{"user_id": "117510477752563883229", "name": "Caitixel Otakumi", "time": 1621984409119, "rating": 5.0, "text": "Doc Torres was very sweet with me and that staff were awesome! Waited a while but with Covid-19 going around and this being one of the very few abortion clinics in Alabama, I was understanding of the process. They also provide financial assistance for you, and I was very grateful to receive it!", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "105760244973994532946", "name": "Pixie Nikki", "time": 1626813155180, "rating": 5.0, "text": "Amazing staff and dr very helpful was there when I needed to call them always good I’m very grateful for this clinic and it’s employees I highly recommend", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "113138445855533861525", "name": "MissAmbition1291", "time": 1550002898760, "rating": 5.0, "text": "So I’m not sure why so many of these reviews are negative! This place is awesome and I wish there were many places in Alabama that offered these services to women. The staff are great and helpful~ there’s always someone ready to answer your call day or night. The escorts are so sweet. I am thankful for my experience at West Alabama Women’s clinic! I felt no pressure at all to make a decision one way or another.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "106663109619434194535", "name": "Heather", "time": 1559583334097, "rating": 5.0, "text": "Seeing the reviews, especially one by a so-called Eris, I must say this.  I visited this clinic. I had an abortion. I was, and remain, unashamed. Because as an adult woman, I can make my own decisions over my own body.  There were protesters outside,  who yelled things in order to shame me and make me feel disgusted with myself.  They failed, deeply, to make me hate what I had done. I made my choice, I executed my rights. You cannot shame me for that.  The clinic has escorts posted outside each time the protesters show up, and they are very kind and understanding people who guide you to and from your vehicles - you can identify them by their rainbow vests.  They do everything to make sure you feel safe and comfortable, even from the first steps into the parking lot.\n\nYou do not hear any screams in the clinic. They do not pull anything away from you or out of you. That is gross misinformation. The nurses are very clear on procedures, and you have options with them. They are kind, compassionate, and will explain things as deeply as you need them to be explained.\n\nThe doctor worked quickly and made me as comfortable as possible.\n\nThere is nothing wrong with making the choice to have an abortion. God doesn't love you any less than he did the day before. If any self-respecting Christian tries to preach to you otherwise, know that they speak only false verse. God is forgiving. He understands women, and understands the choices we often have to make.  Do not let those of differing opinions shame you or frighten you away from your choices.\n\nMake the choice you want to make.  Do what you need to do. It's your body, there's no need to be ashamed.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "105079926113804640530", "name": "Rose McAlister", "time": 1558760743317, "rating": 5.0, "text": "Abortions are NOT illegal in Alabama, this law has not gone into effect, and likely won’t since they are aiming at having this reach the Supreme Court. Please understand that long wait times are to be expected when there are only 2(!) abortion clinics in all of Alabama.\nI hope women don’t ever feel the need to visit here, but if you do PLEASE know that the zygote in your uterus is NOT an unborn baby, and would not survive outside the womb at the stage of pregnancy when you would have an abortion performed. God Bless you, on your journey through life, and may he bless you with a child when YOU are ready, if that is what you would want.\nHeavenly Father protect these women from the evil, shameful, hateful people that would try to control their bodies, keep them safe from harm during any procedures, bless their bodies with your holy light and heal their fear. Amen.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "109376169383713556483", "name": "Teri B.", "time": 1583103032446, "rating": 5.0, "text": "Polite, prompt, and professional. What more could you ask for in a healthcare provider?", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "107103380111552716048", "name": "Miles Ochs", "time": 1607402216166, "rating": 5.0, "text": "This clinic is an incredible place with people who truly care. They do everything they can to provide a safe and positive environment. Alabama has a lot of restrictive laws meant to deter people from accessing the abortions they need and this facility does everything they can to make this experience as time efficient and affordable as possible.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "114225978951443827507", "name": "Desta Johnson", "time": 1522954434556, "rating": 5.0, "text": "Everyone is really nice and they do best with what they have!!! It’s not their fault Alabama is a very conservative state which is why they don’t have sufficient resources. They are the most understanding and compassionate people!", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "108668946649945888678", "name": "Shanda Shanda", "time": 1543294499262, "rating": 1.0, "text": "Please do not get a procedure done here. They rushed me in before my meds kicked in and the doctor did everything roughly. And when I couldn't take the torture, he walked out and they turned me away. So its 10 pm and I got my procedure done around 9am. I'm still in soooooo much pain. Not professional at all and a woman there joked about me not handling the pain....", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "102215215050156929676", "name": "Sharah", "time": 1526744105859, "rating": 1.0, "text": "Gets the job done but overall the staff was very rude. The procedure is not what made me uncomfortable it was the staff..", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "103024878042044744911", "name": "Kackey Kake", "time": 1577226778030, "rating": 1.0, "text": "My visit was horrible the nurses were very unprofessional and rude the doctor was rough they brought me in before my medicine kicked in and they told me they would have to stop because I kept hollering they had no sympathy for the pain I was in", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "108119369501093399231", "name": "Amanda Reyes", "time": 1510063292554, "rating": 5.0, "text": "This is the only clinic in West Alabama that provides abortion services. The doctors, nurses, and staff are compassionate and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "116083942281913797392", "name": "Jake Howell", "time": 1530046803498, "rating": 5.0, "text": "I love respecting women and bodily autonomy", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "106242247753090603328", "name": "Christian Porter", "time": 1467133301234, "rating": 1.0, "text": "Plan to spend a minimum of 6 hours waiting.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "116964199426391786248", "name": "Brittany Boyd", "time": 1426178626395, "rating": 5.0, "text": "Quick and confidential", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "105624855050290421147", "name": "Stella Maris ASMR", "time": 1509157797648, "rating": 1.0, "text": "Unsanitary.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0xd8e128b468a0d1b9"}
{"user_id": "112624066468401771383", "name": "T KING", "time": 1624291646279, "rating": 5.0, "text": "Each time that I have attended an appointment the staff is welcoming and kind! I am grateful for Dr. Williams, Dr. Robinson and NP Andrea for overseeing my pregnancy journey. I am glad I chose this practice!", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "116214038038305374019", "name": "Joe Berry", "time": 1608528842792, "rating": 5.0, "text": "Warm, kind & considerate! These amazing people care. They inform you of all options. My wife would have died had this clinic not saved her life. Every Doctor in my home city said my wife & the fetus would perish if we did not choose this route. Christian Doctors told my wife she would die if she continued. Thankfully, North Alabama has a place with professionals who offer these services. They do their work knowing they are helping yet they are often scorned for it. The front desk welcomes you with a smile & even a shoulder to cry on. The doc called to follow up...even giving us a personal cell number. 5 stars!", "pics": null, "resp": {"time": 1609166384377, "text": "Thank you.  I am so happy that your wife was able to receive the highest standard of care possible.  Our goal is to get every woman in and out of our clinic safely."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "104809094199450079177", "name": "Beautiful Mistake•", "time": 1599236122707, "rating": 5.0, "text": "I can’t speak on these other comments but I can wholeheartedly say my first visit was very wArm and welcoming. It was LAST WEEK OF THIS YEAR 2020, from the front desk to the staff in the back they were all wonderful queens . The lady who did my ultrasound had the sweetest heart & they jus made everything feel okay . At the end of each and every day whether you scums wanna admit it or not we women have rights to OUR BODIES. Don’t ever get that shxt confused and this center is here to make sure you are okay mentally and wanna fall through with the best choice WE CHOOSE!", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "103540270369780378879", "name": "Red Head", "time": 1613506271745, "rating": 1.0, "text": "I wish I could put no stars, I was cussed out and told that I needed to give them a big apology because they wouldn’t listen to me or comprehend what I was trying to explain to them about my situation. This is evil in its purest form.", "pics": null, "resp": {"time": 1617157417058, "text": "We respect all people. We take pride in running a professional establishment and giving each individual the time and attention they need. Profanity is not tolerated in our facility. Please contact management if your experience is anything less than 5-stars."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "105278548828401560402", "name": "La Cl", "time": 1604334426362, "rating": 5.0, "text": "I’m not one to leave reviews but I do read them. I feel I have to say something of my experience for other women in my situation. I was referred here because my local clinic couldn’t help me as I was too far along. It was a 5 hour trip there and the whole time I was dreading it. After seeing how I was treated at my local clinic I was afraid I’d be treated the same there. It was NOTHING like I expected. Everyone was very friendly and comforting. They don’t treat you like trash because of why you’re there. Everyone I came into contact with was very warm and made the experience better. The woman that did my ultrasound was so kind. When she came in I was crying because I was scared. She comforted me before even starting the ultrasound and the whole time we chatted and laughed. The other staff and nurses were the same. They all felt like they were more than just someone there to do their jobs. They felt like friends. I had to go alone because of circumstances but I felt like I had the best support system ever. Yes, the wait was long but I understand why and won’t complain about it. Throughout my wait they made sure I was okay and never made me feel like an inconvenience to them. When the staff wasn’t doing anything they talked amongst themselves and I could hear them laughing from the waiting area. To some it may seem unprofessional but to me it was comforting to hear laughter instead of dead, judgmental silence. Can’t say I’d go again lol. I sure don’t hope so but if there is anyone that is afraid of this place, don’t be. They are wonderful and will make you feel like you’re part of something even if you feel alone. They understand that what you’re going through is tough and don’t make you beat yourself up more about it. If any of you that work here read this, you are all amazing and a blessing and I really couldn’t have asked for a better experience in such a tough situation.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "113104925279970944134", "name": "Astraea Drake", "time": 1599719531430, "rating": 2.0, "text": "Ctd review:\nThe feeling was nothing as described. I have no words for how painful it was. I could barely catch my breath, I was stuck on the toilet, vomiting and honestly scared. The pain was so much worse than expected that I thought something was wrong and was worried and considered to call someone to take me to the hospital. I didn’t, I called the on-call number and the doctor told me to just go lie down on a heating pad and try and take a nap and that it would pass. I told her that I was in the worst pain and was struggling to even get my words out to her and that I couldn’t walk for the pain. I was screaming in pain. She said that there was no need to go to an ER that they would just tell me the same thing and by the time I would be seen it would all be over. And I explained to her that I understood that it would be painful but it didn’t feel right and she reiterated the above. I gave up and she could tell I guess I became distant and said that if I was worried enough and after a while if it were still bad and I insisted on being seen to just come to the clinic. I opted out due to how rude she was to me. She made me feel so small and unimportant. It went on for 8 hours in that severity. The heating pad provided no relief . I was taking both Tylenol and ibuprofen alternating safely and there was no relief. I felt everything. It was so bad I vowed I would never do it again. At my checkup the ultrasound was clear. Here I am 3 months later having complications due to retained product of conception. It was an incomplete abortion. I am now going to have to have a D&C. I spent all day in the ER yesterday due to passing large clots, heavy bleeding, and abdominal pain. I am mortified. I am so sad to have to go through another round of this.\nI wish when it was hurting so bad I would have went to the hospital and not have cared about what she said; That there would be a lack of compassion because this was a voluntary termination and I would not be seen as urgent. I tried to tell her over and Over again that I was worried and she basically, professionally told me I was being dramatic in the most condescending way possible. The choice to terminate is still what I feel what was best for me. I wish I would have drove the distance to planned parenthood. Proceed with caution at this clinic. Do your homework. Please!", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "101875434485285979586", "name": "J Warren", "time": 1624020339892, "rating": 1.0, "text": "They seem very busy possibly too busy to return important phone calls and emails about patients.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "111053921311222717497", "name": "Adam Evans", "time": 1627008513005, "rating": 1.0, "text": "Uncaring,  assuming to being over worked.  Not a professional experience", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "112987266003658866647", "name": "Destini Robinson", "time": 1592703179059, "rating": 2.0, "text": "I was 11 weeks when I got the surgical procedure. I went in Wednesday for my counseling visit. Came back Friday for the procedure. I waited 5 hours before I was called back. The whole time I could feel everything the doctor was doing. It was the worst pain of my life. I cried during and after the procedure. The nurse was kind of rude every time she spoke to me it was always fast so I couldn’t really comprehend everything. I don’t recommend this procedure. Be safe use protection or get on birth control. The pain you go through is not worth it. I wanted to tell my story to let women understand abortions are not fun. You literally wait for hours to later get tortured and told to be still or you‘lol have serious complications later.", "pics": null, "resp": {"time": 1593810230099, "text": "Thank you for your feedback. Our goal is always to provide safe, compassionate care. I am sorry that you feel your wait was too long. We are dedicate to providing safe, essential healthcare. It is not fun, and unfortunately it is not fast. Being one of the few remaining reproductive health centers means the wait may be longer given the volume of patients and the complex needs of our patients. But, you should always feel respected and know that your health is our priority. We will continue to strive to provide excellence in healthcare to those who depend on us as they make these most intimate decisions about their lives and future. Again, we appreciate your comments."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "117580240308314015284", "name": "Kitty Hahn", "time": 1580869141876, "rating": 5.0, "text": "It was my first time going there today and I was very scared. Every single woman working there today was so helpful and kind and cheerful, and that made all of my fears go away. I'm so thankful for them. They were truly amazing and gave me excellent care and consideration.", "pics": null, "resp": {"time": 1593810383992, "text": "We are here for you. Thank you for your comments."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "102285950805395175341", "name": "Barry Owen", "time": 1573161048079, "rating": 5.0, "text": "These are the nicest and most understanding people. They literally help you forget what you’re going through and makes the process a lot easier. My hat is off to these people.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "104176254200474943705", "name": "Brittney Mitchell", "time": 1595938796415, "rating": 5.0, "text": "Very nice and professional staff members.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "106015868877554262751", "name": "Denise Dinger", "time": 1457151005504, "rating": 5.0, "text": "To protect my daughter's privacy, this is not my real name.  My teen age daughter decided that pregnancy termination was the best choice for her.  We chose this clinic because it was close to home.  I could not have been more pleased with the care she received.  Everyone was so supportive, even the volunteers who shielded us from the protesters.  I was getting nervous because my daughter had been in the procedure room a long time.  Finally, the doctor came out to speak to me...she apologized for taking so long,  said she and my daughter had been chatting the whole time.  My daughter had expressed a desire for a career in health care.  This amazing doctor told me to have her call her office the following summer,  that my daughter could come in and shadow her and observe.  I was very touched by her caring attitude!!  I hope to never be in need of this clinic's services again,  but if the unforeseen should happen,  this clinic would ABSOLUTELY be  my first choice!", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "105376254024021431933", "name": "Ashley", "time": 1526696340567, "rating": 5.0, "text": "You are truly in caring hands in this facility from start to finish. I truly appreciate everyone that i came in contact with yesterday and the important work that they do to provide their services to women.  My experience in this clean,  organized,  and friendly facility truly made the difference in making my decision much more bearable.  I didn't have any issues or complaints.  I don't believe i'll find myself in this situation again,  but i wouldn't hesitate to return.", "pics": null, "resp": {"time": 1554164030074, "text": "Thank you!"}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "106252236830108929310", "name": "Hailyn Williams", "time": 1552801561189, "rating": 3.0, "text": "The experience was overall okay considering the circumstances. I didn’t know what to expect since this was my first time going through something like this. The absolute worst part of this experience was waiting. I had an “appointment” early that morning, and I did not leave until that evening. It was absolute torture waiting that long because a million thoughts are running through your mind. The second worst part was being awake and being able to feel the doctor roughly tugging/pulling the fetus out of your body. It’s a feeling that I can’t explain. However, everyone for the most part was nice and would hold a conversation with you. Unfortunately, the nurse (I didn’t catch her name) had no bedside manner at all. She’s the last type of person any woman would want to be around during this type of situation. She was very monotone and unprofessional (cursing at the desk, headphones in her ear, and not really engaged with the patient).", "pics": null, "resp": {"time": 1554162720544, "text": "Thank you for your feedback. We will use this information to make future experiences better for other patients. Unfortunately, as for the wait time, this is not a procedure that you can rush. For patients who undergoing a D&E in the second trimester, time is needed for proper cervical prep. Therefore, you are instructed to come early in the morning. Our goal is always to be sure each patient is comfortable and that each patient completes their procedure safely. This is not an area where speed is the best quality measure to utilize. We are glad that you were able to safely have your services completed at our location, and again thank you for the feedback."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "106527743291506971823", "name": "Linda Moles", "time": 1554132748408, "rating": 3.0, "text": "Make your front desk lady take a Course on how to be kind and courteous to the patients.. she is very standoffish and snappy! Not even a slight smile!", "pics": null, "resp": {"time": 1554161891265, "text": "Thank you for your feedback."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "108288978785832703484", "name": "A Harris", "time": 1554924854469, "rating": 1.0, "text": "This place is awful . Rude nurses , rude RUDE woman at the front counter , when taken to the back the nurses speak negatively about other patients. Extremely negative energy and the people who work there are far from comforting . Unprofessional horrible place . They made sure to make a hard experience 10 times harder . Save yourself the extra grief and go to Birmingham .", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "110179823929768494387", "name": "Song Jones", "time": 1563462553038, "rating": 5.0, "text": "Lovely staff. Thank you for everything! Every major city should have a clinic like this.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "114015970280800718741", "name": "Carson Bartron", "time": 1554329856107, "rating": 5.0, "text": "Obviously no one wants to find themselves in a situation to need the services provided at this center, but if they do find themselves needing a caring and compassionate facility with staff that is non judgemental and non medaling then this is the place to go. The staff makes sure you’re informed. The facility is safe with all doors remaining locked unless otherwise buzzed in. The front desk lady was very quick and maintained an incredibly quiet voice so that no one else could hear the needs of the visit, payment, expectations, etc. The whole visit was very time efficient, especially considering I went at lunch time. The staff made sure to be very up front and informative, non judgemental and never once asked why I was making the choice I was. They made distracting small talk which lightens the very heavy and awkward mood. I would recommend this facility to any fellow lady that feels like this is her answer. Thank you to all of the ladies that work here. Your demeanors and understanding is/was so helpful and appreciated.", "pics": null, "resp": {"time": 1554479984114, "text": "Thank you!!!!"}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "114166796846910991110", "name": "Tartriciea Elliott", "time": 1546814590771, "rating": 5.0, "text": "I love the whole staff they was just as caring and nice.", "pics": null, "resp": {"time": 1554163894172, "text": "Thank you!"}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "110331636365966266203", "name": "jayme calhoun", "time": 1456973100054, "rating": 5.0, "text": "Staff is caring and compassionate, and the doctors are fantastic. The escirts are kind and understanding and dis a great job of keeping the protesters from being able to harass me.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "116871532293228932651", "name": "Daniel Brown", "time": 1485550711131, "rating": 5.0, "text": "This center is operated by kind and courageous individuals who provide a critical service to the northern Alabama community.", "pics": null, "resp": {"time": 1554164053701, "text": "Thank you!"}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "107207903006253244231", "name": "pretty luhh maee", "time": 1556651613819, "rating": 1.0, "text": "This was the worst service I have ever received in my life never again.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "110578493451157155827", "name": "Aiden Kraven", "time": 1474291327397, "rating": 5.0, "text": "Awesome ppl. Thank u soooo much for the respect and professionalism", "pics": null, "resp": {"time": 1554164081403, "text": "We are here for you."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "105297800072492538328", "name": "Pamela J. Willis", "time": 1456956856010, "rating": 5.0, "text": "Thank you to the entire staff for the important work you do in support of Alabama women.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "100304443188510152759", "name": "Amanecer", "time": 1548185893700, "rating": 1.0, "text": "Arrived at 8...  Was the first one in line and turned paper work in,  wasnt told anything.. 1:35pm.     Typical wait tine 45min to 2.5 hr....6 hours??? Why\nStill waiting.   Not been told anything", "pics": null, "resp": {"time": 1554163868629, "text": "We apologize for any perceived inconvenience. However, it Is important to understand that wait times vary according to your individual situation (age of gestation, history of previous cervical dilation, etc.). We are committed to being here as long as it takes to safely complete your procedure. We cannot guarantee you will be in and out quickly, but we can guarantee that we will be available for as long as it takes to care for you. Safety is out first priority."}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "114286103560761219636", "name": "All Things", "time": 1529524880250, "rating": 1.0, "text": "One of the staff members was so rude and made me feel out of place from the moment I walked to the back till i left she rolled her eyes at me and well that was money spent wrong due to the fact I will not go back for the rest of the procedure but that's ok with me the others were ok besides when I got the ultrasound done the woman uncovered me completely and I turned around and seen my baby on the monitor and I don't recommend anyone to go here the only reason I choose this place is from the reviews but I wish I wouldn't have", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "114954822182869139873", "name": "Crystar Lopez", "time": 1560752673424, "rating": 5.0, "text": "yikes! seems like y'all went out of business  XDXDXD", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "103474519105707838812", "name": "MATT Pinkston", "time": 1539126880764, "rating": 1.0, "text": "Their are sorry they want tell your family anything and make them stay out side been there right at 12 hours and want more", "pics": null, "resp": {"time": 1539174860871, "text": "We are glad your loved one received her needed services, safely in our beautiful center. We offer plenty of space for waiting in the main lobby, or in one of our two lounge areas. We just cannot allow other patients and families to be disturbed by disruptive visitors. We understand that it is sometimes difficult to be patient and wait. Our goal is to get every woman in and out safely. Our center cares for patients who travel from as far away as Georgia, Florida, Louisiana, Tennessee and Mississippi. We are able to complete surgical abortions in one day instead of two; however, depending on your loved ones needs, we counsel patients it may be one long day. There are so few locations equipped to do what we do.  Healthcare is not something you can rush.  Be blessed, and please remember to go vote!"}, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "106688745707932800221", "name": "Tyler Jennings", "time": 1559244596215, "rating": 1.0, "text": "Rude staff, slowest clinic I’ve ever been to", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "112777209241330387879", "name": "Karen King", "time": 1466213657327, "rating": 5.0, "text": "Thank you for the important work you do in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "103237600361427725709", "name": "catherine chung", "time": 1560004911769, "rating": 5.0, "text": "Thank y'all for all you do.", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
{"user_id": "116759600444311135816", "name": "Victoria Stetson", "time": 1489897463929, "rating": 5.0, "text": "Thank you for what you do!", "pics": null, "resp": null, "gmap_id": "0x88626caaec7dccf5:0xaf59798e73c37a76"}
