{"user_id": "113905342160831033840", "name": "Russell Tayler", "time": 1371764876314, "rating": 5.0, "text": "Dealing with Clark has been a great experience his knowledge in the welding supply business has been a truly eye opening experience. I went in there almost with an arrogant attitude thinking that i knew what I wanted. But after listening to me patiently and asking questions, and finding out what I really needed he put me on to the right product. Thanks Clark I cant believe that I have not been using this for my welding applications.", "pics": null, "resp": null, "gmap_id": "0x889a4db45477313b:0xbb2ac884194b2277"}
{"user_id": "100997692580971586689", "name": "Taylor holley", "time": 1567106955943, "rating": 1.0, "text": "Went there an waited at the counter a lady just looked at me but wouldn't help... Horrible service", "pics": null, "resp": {"time": 1567192193094, "text": "We are sorry that our Customer Service Rep was tied up and unable to speak with you when you came in. Please give us another chance to show you our normally outstanding customer service."}, "gmap_id": "0x889a4db45477313b:0xbb2ac884194b2277"}
{"user_id": "108698198049461626156", "name": "Bruce Jones", "time": 1535396187377, "rating": 5.0, "text": "Very good prices with excellent customer service", "pics": null, "resp": null, "gmap_id": "0x889a4db45477313b:0xbb2ac884194b2277"}
{"user_id": "113882911170162669554", "name": "ROY TAYLOR", "time": 1516993316695, "rating": 4.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x889a4db45477313b:0xbb2ac884194b2277"}
{"user_id": "117952589020470565015", "name": "Jason Grant", "time": 1411460929265, "rating": 5.0, "text": "they have anything you need", "pics": null, "resp": null, "gmap_id": "0x889a4db45477313b:0xbb2ac884194b2277"}
{"user_id": "108271118206788427836", "name": "Project 97", "time": 1598969908912, "rating": 1.0, "text": "I like Grainger and have never had a problem until now. I just tried to call the mobile location and they woman that answered the phone said that there is no way to be transferred to an exact store. If that is true that’s the craziest thing I’ve ever heard. I asked her so if you can’t transfer me to them, then just give me the number to them and I’ll call. Her response was the store doesn’t have a number. I asked, so there is absolutely no way possible to communicate or get in touch with anyone at that location? And she said that’s correct. It has been that way for years she said. It blew my mind. Truly the craziest thing I have heard in quite a while.", "pics": null, "resp": {"time": 1599662254493, "text": "Hi, Chris. Thank you for the feedback. Our local branches do not take calls, allowing them to assist our customers who walk in the door. Our customer service team can be reached at 1(800)472-4643 and are available 24 hours a day, 7 days a week. They have access to the same information to ensure you receive the right information when you need it. ^Amber, Grainger Social Team"}, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "111502634022735341975", "name": "Stacy Upshaw", "time": 1544822076634, "rating": 5.0, "text": "I was surprised at how good the customer service is over the telephone, very helpful looking up part numbers and the shipping was very fast", "pics": null, "resp": {"time": 1545163640891, "text": "We're very happy we could help, Stacy! Thank you for sharing this and thanks for choosing Grainger!"}, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "114988107600509515931", "name": "Rock", "time": 1561508785685, "rating": 4.0, "text": "Not open on Saturday but the Grainger website says it IS open. It is NOT open on Saturday. I just drove a freaking hour to come buy work boots.\nWhy not be open on Saturday anyway? We work monday-friday in the normal world when we'd go here.", "pics": null, "resp": null, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "101792900332934580367", "name": "Goddbod. Junya “iceberg” Winston", "time": 1590697565070, "rating": 4.0, "text": "nice neighborhood..", "pics": null, "resp": null, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "107244655574647047186", "name": "Wes Allday", "time": 1488428689253, "rating": 4.0, "text": "Nice selection in inventory, staff is helpful with finding/ordering needed parts. Prices can be a bit steep.", "pics": null, "resp": null, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "112106130166363678074", "name": "Doug Fleming", "time": 1538504589244, "rating": 2.0, "text": "Why is this the only electrical supplier that WONT let you speak to a local store without jumping through hoops?", "pics": null, "resp": {"time": 1538510459000, "text": "Hi, Doug. Thank you for the feedback. Our local branches do not take calls, allowing them to assist our customers who walk in the door. Our customer service team is set up to assist our Customers 24 hours a day, 7 days a week, and has access to the same information to ensure you receive the right information when you need it. ^Amber, Grainger Social Team"}, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1515191472893, "rating": 3.0, "text": "Good selection but high prices on most items. However the have parts that you can’t get elsewhere. I need some aluminum angle and they beat Home Depot and Lowes prices by far.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOaH7KQYTM3UjJqaLMaQiaR4Wd4_SOeTQxjakB1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOXBoNCZoVDWPilCPDUVDwcpcLA5LmmqztTdpRq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "109254897699473617949", "name": "Paul Streeter", "time": 1613599061090, "rating": 5.0, "text": "Great helpful advice on my project, thanks", "pics": null, "resp": {"time": 1614272396556, "text": "Thanks for the nice review! Our goal is to always be the best partner possible to our customers. Glad to hear we were able to help you out! ^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "105801370094422418483", "name": "Jack Lloyd", "time": 1603465367251, "rating": 1.0, "text": "Worst customer service.  Having people wait for hour to get service is unacceptable.", "pics": null, "resp": {"time": 1604090874093, "text": "Jack, we're sorry your Grainger experience wasn't satisfactory and would like to look into it further. Please email our customer service team at social@grainger.com with your name, the branch you visited, and a brief description of your experience. We appreciate you taking the time to provide feedback and an opportunity for us to improve your experience. ^Amber, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "106599034495074503300", "name": "Mac Thomas", "time": 1602037623736, "rating": 4.0, "text": "They didn't have what I was looking for but they gave it a hellava try!", "pics": null, "resp": {"time": 1604958537997, "text": "We're very happy we could help, Mac! Thank you for sharing this and thanks for choosing Grainger!\n^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "114343139355483639028", "name": "Richard Norwood", "time": 1536884038698, "rating": 5.0, "text": "Store personnel is extremely helpful and friendly. Sometimes the parts I order aren’t immediately available but they can usually get it in next day. Prices are somewhat competitive but I understand I’m shopping at an industrial supply house.", "pics": null, "resp": {"time": 1537463822004, "text": "Thanks for the nice review! Our goal is to always be the best partner possible to our customers. Glad to hear we were able to help you out!\n^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "104921985438822163578", "name": "Mike Heard", "time": 1534962397953, "rating": 1.0, "text": "I took a long list of tools I needed to purchase to the local store here in Huntsville, AL. The took the list and told me it would be a couple of days.  Here it is two weeks latter and I have heard nothing.  To top that, when I look to find their business phone number it is the corporate phone number and they cannot give you the store number.  I will not attempt to do business with them again.  If there was a zero star I would have selected it.  What poor customer service.", "pics": null, "resp": {"time": 1536688051086, "text": "Mike, we're sorry your Grainger branch experience wasn't satisfactory and would like to look into it further. Please email our customer service team at social@grainger.com with your name, the branch you visited, and a brief description of your experience (including order number, account number, or any other information you feel may be helpful). We appreciate you taking the time to provide feedback and an opportunity for us to improve your experience. ^Amber, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "107166697815402958226", "name": "Thomas McNutt", "time": 1594329585333, "rating": 5.0, "text": "They were very helpful considering what is going on with the virus.", "pics": null, "resp": {"time": 1594672855660, "text": "Thanks for the nice review, Thomas! Our goal is to always be the best partner possible to our customers. Glad to hear we were able to help you out!\n^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "110790955915675291004", "name": "Shane Gann", "time": 1468355900490, "rating": 1.0, "text": "I need an electric motor, I called the store and got a call center, the lady knew nothing about parts, read her multiple parts numbers off the motor and the fan it was attached to. She finally said we are just going to have to call tech support.......really? I just need to know if the motor is in the store before I drive all the way over there.", "pics": null, "resp": null, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
