{"user_id": "108015902358694270361", "name": "Thomas Parish", "time": 1571638096508, "rating": 5.0, "text": "Best CPA firm in town.", "pics": null, "resp": null, "gmap_id": "0x888cf2c215ccf397:0xfbd82a04c43ea664"}
{"user_id": "114111211951053821494", "name": "Shelby Mote", "time": 1468007092066, "rating": 5.0, "text": "Wonderful people to work with!! Very honest and caring. Would definitely recommend them to anyone for tax, payroll, or bookkeeping needs!!", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "100365530848552643938", "name": "Darrin Swan", "time": 1492701874771, "rating": 5.0, "text": "Great experience from a great company.  Thanks for all the help with taxes and payroll.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "104474205535923552810", "name": "kiera meadows", "time": 1480101237998, "rating": 1.0, "text": "would be better if people will answer the phone!", "pics": null, "resp": {"time": 1626383131179, "text": "Thank you for your review.  That was a couple of years before we took over the tax office.  Things are much better now.  There were some health issues with ownership back then."}, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "107807661023494042927", "name": "FL Rowe", "time": 1519200681036, "rating": 4.0, "text": "Good teacher.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "107780845280422596659", "name": "Sherri L Lowery", "time": 1570123412157, "rating": 5.0, "text": "Wonderful... small biz expert!", "pics": null, "resp": null, "gmap_id": "0x889281a4510c5c35:0xd463a6c2e8a233c2"}
{"user_id": "107338399881434127972", "name": "Jason Earnest", "time": 1620942935501, "rating": 5.0, "text": "Mrs. Georgianne is absolutely great at what she does! She has helped me with starting a new business, my taxes, and with my retirement account! She is very polite and professional! I would highly recommend her to anyone I know! She makes things very simple and easy to understand. Five stars ⭐️ ⭐️⭐️⭐️⭐️ From me!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "108177877108750958060", "name": "Beau Pendergraft", "time": 1610495609049, "rating": 5.0, "text": "So glad to have found a PROFESSIONAL CPA that I can TRUST to be working in my best interest. Definitely reliable and reasonable! The peace of mind I get from their services is worth every penny!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "112764286491369204340", "name": "Kenny Pollock", "time": 1610396320801, "rating": 5.0, "text": "I love this office!!! Georgianne and her staff are professional, prompt, HAVE THAT NICE SOUTHERN CHARM and really know their stuff. Would leave more than 5 stars if Google would let me.", "pics": null, "resp": {"time": 1611281109406, "text": "Thank you so very much for your kind sentiments"}, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "110867534001793948523", "name": "Amber Pritchett", "time": 1618513250990, "rating": 5.0, "text": "I wouldn't use anyone else for my personal taxes or business.  She has helped is stay on track to grow our new business.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "106594559754501416995", "name": "Kayla Cherry", "time": 1614614183699, "rating": 5.0, "text": "Georgianne is amazing. She is very professional and answered all my questions. I would highly recommend her to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "104698371670000083894", "name": "Steve Pritchett", "time": 1618256913211, "rating": 5.0, "text": "We love tax time now that we have Georgianne and her team. They not only handle our past but educate us and set goals for our future.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "117787453184875423146", "name": "Brandon", "time": 1611278511247, "rating": 5.0, "text": "Mrs. Graves is very helpful and professional, and knowledgeable on tax law. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "103583726524530147455", "name": "Amanda Higgs", "time": 1585680692406, "rating": 5.0, "text": "I have been a client of Georgianne for years and could not be more pleased with her and all of her teams work!! They make my accounting and bookkeeping needs seamless and fast so I can continue to do my job!! Best in the business!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "116946711757294773114", "name": "Niki Craft", "time": 1533605813019, "rating": 5.0, "text": "Georgianne Graves is the BEST accountant there is, and very reasonable in pricing! She truly cares about you and giving you the best service while making sure that you are truly taken care of!!! I will use her and only her! I reccomend her 10 times over to anybody and everyone!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "109018813346009072101", "name": "Ryan Engle", "time": 1549900781685, "rating": 5.0, "text": "Georgianne got us back more than we expected for a great price! She was very knowledgeable and personable.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "103466813220299570809", "name": "Hannah Cantrell", "time": 1532984330872, "rating": 5.0, "text": "Georgianne is a wonderful CPA!! In the words of my husband \"she makes me feel better about everything!\"", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "107076085337606145307", "name": "mary hart", "time": 1531865568909, "rating": 5.0, "text": "Ms Graves made this years tax experience comfortable, and her office is so cute.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "109605851758335331649", "name": "Bill Hart", "time": 1531865747682, "rating": 5.0, "text": "Georgianne is an expert at working with the IRA for persons not having filed for a number of years.  She really knows her stuff.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "104904665929739847417", "name": "James Chancellor", "time": 1581395567013, "rating": 5.0, "text": "She is a strong Christian who is always looking out for others. Carol is extremely helpful. She knows what questions to ask inorder to help you get the most money back for your taxes. She doesn't treat you as a customer, she treats you as a person. She is always willing to go the extra mile and take her time with you inorder to get the job done correctly. Carol's prices are amazing. She was several hundred dollars cheaper than H&R Block. Not only that you never know who you get when you step into a big box tax service. My family will always choose Carol E. Douglas as our tax needs provider.", "pics": null, "resp": {"time": 1581422828409, "text": "Thanks so much for the review.  Looking forward to next year. God Bless."}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116250714072365762802", "name": "Jeff Welte", "time": 1602618838276, "rating": 5.0, "text": "Our FIRST choice for TAX prep help. Everyone in the office went above an beyond to help s with multi-state filings. It was complicated and they made it sound easy. HUGE Thanks to all!!", "pics": null, "resp": {"time": 1602649945197, "text": "Love new clients .. Appreciate your kindness.  Looking forward to our next visit.  Always Thankful !  God Bless !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "103962485830968019524", "name": "Jerrod Hodges", "time": 1590585499146, "rating": 1.0, "text": "2 out of 2 times disappointed. 1st time dropped off 2 months b4 the april dead line and it wasnt done so opted to do it myself. Then this year had a appointment on march 24th and still not done. And going some wheres else. If u have an appoint shouldnt it be done that day even with the covid19 issue  cause u have a set time??????\n\nUpdated : she used covid19 as a excuse,but hard to used that when my brother gave her his taxes 2 week after mine, his was done the week of the may 11th. So ill be going else where next year", "pics": null, "resp": null, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116354703942683138839", "name": "Pernell Glover", "time": 1529765468917, "rating": 5.0, "text": "Carol and Bridgette are amazing! They made the daunting task of tax filing stress free! It was like talking with new friends and before you know it you’re done! They are very experienced and ask questions you wouldn’t think to ask...and work to file your taxes leaving no stones unturned.They are very friendly, knowledgeable and good at what they do! I highly recommend!", "pics": null, "resp": {"time": 1530104914388, "text": "Love new clients .. Appreciate your kindness.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "101061659276326862279", "name": "Frances Dauster", "time": 1500300655758, "rating": 5.0, "text": "Carol has been doing my taxes since 1995. She has been AMAZING. From my being single, to married, to separated, to divorced, in addition I started a business, and had some overseas stuff going on - every step of the way Carol has been incredible. She goes to seminars, too - continuing ed is so important when it comes to quality work. Carol ROCKS.", "pics": null, "resp": {"time": 1500323799338, "text": "Appreciate your Loyalty.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "108446755128529805122", "name": "GSMO", "time": 1554999450603, "rating": 5.0, "text": "She was awesome! Very knowledgeable and helpful. I highly recommend Carol to anyone looking for tax help or a good accountant!", "pics": null, "resp": {"time": 1573785000582, "text": "Appreciate your kindness.   It was a pleasure. Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "104852750399815053202", "name": "sharkjones261", "time": 1500328394791, "rating": 5.0, "text": "Carol does a meticulous job. Highly recommend her", "pics": null, "resp": {"time": 1500329218647, "text": "Appreciate your Loyalty.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116321459190466358888", "name": "Carol Shipman", "time": 1517448951684, "rating": 5.0, "text": "OUTSTANDING!!! KIND, CONSIDERATE KNOWS HER STUFF AND VERY REASONABLE!", "pics": null, "resp": {"time": 1517532133909, "text": "Thank you for your kindness and loyalty."}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1580914397183, "rating": 5.0, "text": "This is what to expect with proffesional grade tax expertise. First time to file here and have filed previously with two other places in Cullman. They are quick kind and polite. I got the most money back yet. I make considerably less than last year. I highly recommend trying these experts out especially if you want the most bang for your buck.\n\nThanks guys for being Cullmans best tax service you ROCK!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPkzSEKXjGQR1udTn0FyFvIgMRn4eDG3HXiQ-uu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOiCT87CnC9S9YYuW2M63zkO2jYygO7Q-8Rx6yl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ccf83478572b:0xa2ddc2b148c7844a"}
{"user_id": "115493496082139977837", "name": "Bethany Hogan", "time": 1547141756211, "rating": 5.0, "text": "You cannot go wrong with using Drake Accounting.  Everyone is helpful and timely.  We have two businesses we use them for as well as all personal work.  We have used them many years and truly appreciate their work ethic as well as personal attention.", "pics": null, "resp": null, "gmap_id": "0x8889ccf83478572b:0xa2ddc2b148c7844a"}
{"user_id": "115702852694741497344", "name": "Jon Grigsby", "time": 1486668213927, "rating": 5.0, "text": "I recently moved to Cullman and after a record year with my business found myself in need of a really good tax guy.  I had recently read several books on tax law and small business operations and deductions and Gaylon was knowledgeable about everything I could think of to ask him.  He's my Tax guy whose job it is to keep me out of trouble.  I highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x8889ccf83478572b:0xa2ddc2b148c7844a"}
{"user_id": "118032404573826775686", "name": "Yui-Omi Muni", "time": 1517956439629, "rating": 5.0, "text": "Best Accounting firm in the area. I have been doing business with them since 1997 and used only one other firm and that was in 1996. Family owned and operated. Very professional and friendly", "pics": null, "resp": null, "gmap_id": "0x8889ccf83478572b:0xa2ddc2b148c7844a"}
{"user_id": "105918788846928736101", "name": "Mark Cecil", "time": 1528202217617, "rating": 5.0, "text": "I have been using various accountants since 1986. For the first time ever I feel like I am in good hands. Alexis Willis always calls me ahead of deadlines and believes that the details matter. She takes very good care of me.", "pics": null, "resp": {"time": 1529527353153, "text": "Hi Mark, thanks so much for taking the time to leave us with this fantastic review! We are so glad to hear that Alexis has been such a great help to you. Have a marvelous day!"}, "gmap_id": "0x889a0def50699735:0x9ad5659b73a03edd"}
{"user_id": "109808364932604540317", "name": "Andy Harbin", "time": 1619714912537, "rating": 5.0, "text": "I've been using Troy for about 7 years. He now does all my payroll, business and personal taxes. He's always been eager and willing to help with any situation we have. When he left his previous employer and started his own company I followed him. Can't say enough great things about him.", "pics": null, "resp": null, "gmap_id": "0x88626d232392dbd1:0xaf6f4742705daace"}
{"user_id": "110599512021352602360", "name": "Patrick Livingston", "time": 1625097213184, "rating": 5.0, "text": "Great experience, great knowledge and great people!  I am glad to work with folks who are not only doing me a service but are also my friends! Never a better place for all of your accounting needs other than profit wise accounting!", "pics": null, "resp": {"time": 1625239235153, "text": "Thank you, Patrick. We love having you as a client and a friend!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104880504960117462126", "name": "Natalie Tuck", "time": 1625099011308, "rating": 5.0, "text": "Extremely professional and affordable. I have worked with Sharon for years. She is super efficient and the communication she has with her clients is outstanding!", "pics": null, "resp": {"time": 1625239458816, "text": "We appreciate the kind words, Natalie! We understand that communication is the key to help clients not only overcome obstacles, but to understand them."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101652159563950017981", "name": "babin sj", "time": 1625095916766, "rating": 5.0, "text": "Profit Wise has freed me from the stress of doing my business taxes, and has allowed me to focus on the the parts of my business that I love.\nSharon and crew are very active in giving back to our community, and I'm thankful for them and the good they do!\n\nSteve Babin, Photographer", "pics": null, "resp": {"time": 1625239658995, "text": "We care about our clients and our community. After all, they are one and the same. Thank you, Steve!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109321634686813096412", "name": "Lawrence Johnson", "time": 1624931100724, "rating": 1.0, "text": "I hired Profit Wise to do my business and personal account. There is still difficulty in believing the incompetence and flat-out lack of character this “firm” displayed with my accounting.\n\nI found Ms Ashleigh Heinz to be a consistent and complete liar as far as returning phone calls and keeping due dates.\n\nI also worked with Ms Jacqueline Harwood, who frequently would not return calls and had difficulty doing bookkeeping tasks that should have been routine.\n\nMs Sharon Heinz completed my tax return and said I owed over 12K in taxes. I requested a meeting to review my return with Ms Heinz. I ended up meeting with Jonathon. After going through my tax return, I ended up owing less than 2K in taxes.\n\nNot only was I not offered an apology for the service that I received I was terminated as a client.\n\nA first-class organization this is not. Proceed at your own risk. They will gladly collect your money beware the service.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "102061697806981622754", "name": "Lamia Haddad`", "time": 1619996546277, "rating": 5.0, "text": "This is the first year I do business with Profit Wise and for the first time I can say filing my taxes was stress free. Their employees are very welcoming (always smiling). Everyone I've dealt with was highly professional and kind. If you call when they're busy, they always call you back and address any question or concern you may have. Also when they tell you your taxes will be completed on a specific date, rest assured that they will respect you and abide by it. Jonathan was especially helpful and knowledgeable. Sharon is very professional and smart. You can tell she knows what she's doing. She's also extremely sweet and friendly which makes it a joy to do business with her. Thank you Sharon :)", "pics": null, "resp": {"time": 1625239940106, "text": "It's easy to smile when you have great clients and enjoy helping them succeed. Thanks, Lamia!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "118064130576590488239", "name": "Thos Kite Art & Design (Thomas Kite)", "time": 1619039028499, "rating": 5.0, "text": "I came to Profit wize with both my business and personal taxes because I was dissatisfied with my previous accountant. They are very professional, efficient and really helped me with my complicated tax situation. It was easy to load up docs etc to a secure share so that my personal information was never compromised. I found them to be friendly and I feel they really care about their clients. When I reviewed the returns, I was hoping I did not owe any tax but it turns out I did. So the person who worked on my taxes went back to the drawing board and found some additional credits ( I supplied him with some additional documentation). I was thrilled as he was able to get me money back on my federal return and a lower state tax bill. I feel he put in some extra effort  to make me happy. I would highly recommend them.", "pics": null, "resp": {"time": 1625240333179, "text": "Thank you! We are glad you came to us for help! We look love to watch  our clients grow, personally or in business."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "112010012770361466617", "name": "The Engineer", "time": 1620015000765, "rating": 5.0, "text": "We went to Profit Wise because we weren't very satisfied with our previous accountants. Sharon and her team were extremely professional, friendly, and talented. The process was a walk in the park!\n\nWe sat together and Sharon explained everything to us. She made sure everything made sense before we left too!\n\nTaking care of my and family's taxes was NEVER so easy!\n\nGo ProfitWise!", "pics": null, "resp": {"time": 1625239832652, "text": "Along with overcoming tax issues, we like to help our clients understand them. We are happy you came to us for help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "112848318806027696985", "name": "Randy Gatlin", "time": 1622726935247, "rating": 5.0, "text": "Fantastic customer service. I was out of the country for several years and had not filed over that time. Between that and moving back and forth overseas, our tax situation was very complicated. Sharon helped us get caught back up and up to date with our tax obligations. Would highly recommend.", "pics": null, "resp": {"time": 1625239758119, "text": "No matter how complicated, we can always find a solution. Thanks, Randy!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "111231867092666905456", "name": "S.W. Unite", "time": 1614637542657, "rating": 5.0, "text": "This is the second year Profit Wise has prepared my personal tax return. Excellent service and friendly atmosphere. This firm is top notch and highly recommended.", "pics": null, "resp": {"time": 1614874758866, "text": "You're making us blush with that glowing review! Thank you!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104387659308224157408", "name": "Westy's Pet Grooming", "time": 1615312665036, "rating": 5.0, "text": "Sharron, Ashleigh, and I have dealt with at Profit Wise have always been a pleasure to work with. I'm new to business ownership and constantly on the go. They make things simple and easy to manage. So glad I found them!", "pics": null, "resp": {"time": 1625240449937, "text": "You take care of the pets, we'll take care of the paperwork. We are thankful for the oppurtunity to help your business grow!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109438815683655017992", "name": "Joyce Betts", "time": 1613106316715, "rating": 5.0, "text": "I appreciate the professionalism. Kindness is a quality that attack you to people they displayed that toward me. I would highly recommend this company to others. Thanks", "pics": null, "resp": {"time": 1614190106702, "text": "Thank you for your wonderful review."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "118376306446036993479", "name": "robert wentz", "time": 1599099148934, "rating": 5.0, "text": "I have been working with Sharon and Ashley since 2018, and they have helped me with Business as well as personal taxes.  I have used other firms for tax and bookkeeping services, but Profit Wise provides the best services in town. They are extremely knowledgeable and just a pleasure to work with. Their staff is freindly and able to work with my busy schedule. I can not thank Profitwise Accounting enough for all they have done for me, and highly recommend them to anyone.", "pics": null, "resp": {"time": 1600108292831, "text": "Mr. Wentz, Thank you so much for the wonderful review.  We enjoy working with you too."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "107235430057861671635", "name": "James Wheeler", "time": 1619287013409, "rating": 5.0, "text": "Sharon has done a wonderful job taking care of our taxes the last couple of years.  Wish we had used her earlier.", "pics": null, "resp": {"time": 1625240092377, "text": "We are glad you are here now. Thank you, James."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117282269437730975837", "name": "B Knox", "time": 1603226959230, "rating": 5.0, "text": "I was very impressed with the professionalism of this office. I went to them to correct a tax problem/error from a previous company. They were able to go through previous returns and show us what was incorrect and they assisted us with getting our returns corrected and we also ending up getting more money back on previous returns. I would definitely use them for my future tax services.", "pics": null, "resp": {"time": 1603832079296, "text": "Thank you for your kind words Mr. Knox. It was a pleasure to serve you and to save you money. We look forward to seeing you again!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116572094275985617982", "name": "Alex Grimanis", "time": 1615059999178, "rating": 5.0, "text": "Quick and easy process. I highly recommend!", "pics": null, "resp": {"time": 1625240469891, "text": "Thanks, Alex!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117178885583043092916", "name": "Jessica Dube", "time": 1598457604236, "rating": 5.0, "text": "I’ve been divorced a year. This was my first year to do taxes as my ex always took care of that for us. Sharon was very quick to respond, super friendly and professional. I felt like she gave me good advise. I was super happy with my experience and will use her again.", "pics": null, "resp": {"time": 1598473616650, "text": "Jessica, we enjoyed meeting you and are happy that we could make  your tax experience a positive one. See you next year!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116490542433210003954", "name": "Joe Webster", "time": 1613493578410, "rating": 5.0, "text": "Sharon, is helping with my accounting issues, so glad I sit down with her and to stay on track with her professional guidance and she got busy ride-away to problem solving , very helpful for my tree business. Thanks Joe Webster", "pics": null, "resp": {"time": 1614190130200, "text": "Thank you for your kind words, Joe!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "114461620904233646735", "name": "Steve Zipfel", "time": 1606939721421, "rating": 5.0, "text": "Sharon and her team have done an excellent job in keeping me on the right track with tax filings and are very knowledgeable and helpful in all areas of growing one's business.", "pics": null, "resp": {"time": 1610464070644, "text": "Thank you Steve! Your kind words are appreciated."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "103097450340025130735", "name": "Bob Druckman", "time": 1607195389050, "rating": 5.0, "text": "Sharon is very knowledgeable and she has a wonderful team surrounding her. They are consummate professionals.", "pics": null, "resp": {"time": 1610464105871, "text": "Thanks Bob! Those words mean a lot to us."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101655857491307732971", "name": "Penny Stevens", "time": 1603218145186, "rating": 5.0, "text": "Profit wise accounting was great to me and my Mother.  Sharon Heinz came in on a Saturday to get my mother's taxes before deadline.  Great customer service!!!", "pics": null, "resp": {"time": 1603831911952, "text": "Thank you Penny! We enjoyed working with with both of you!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "115778852305277142954", "name": "Hunter Lee", "time": 1603215406904, "rating": 5.0, "text": "Highly recommended! Very friendly and easy to work with, they are very good at what they do. Look no further!\nDr Lee", "pics": null, "resp": {"time": 1603831796793, "text": "Dr. Lee,\nThank you for your kind words. We enjoyed working with you!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117219320139459546660", "name": "Steve Babin", "time": 1586819773501, "rating": 5.0, "text": "Profit Wise has provided me with Tax Preparation Services for the last several years.\nThey have always been Professional, Competent, Thorough and Prompt in all of our dealings. They know the latest information with regard to the Tax Code, and work diligently to make sure my returns are correct.\nUtilizing their service has been a major stress reliever for me...as well as saving me money. I heartily recommend them for all your accounting needs.", "pics": null, "resp": {"time": 1589557728204, "text": "Steve!!  We just love seeing your smiley face here.  Thank you for trusting us with your taxes."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "110016619866632125434", "name": "Jennifer Gallaher", "time": 1603225913110, "rating": 5.0, "text": "Sharon and her team really have their client's best interest at heart. She takes the time necessary to answer all questions and I trust their knowledge completely.", "pics": null, "resp": {"time": 1603831834519, "text": "Thank you for your kind words Jennifer! So happy that we have earned your trust."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116515603894090643085", "name": "Jim M", "time": 1584731968658, "rating": 5.0, "text": "We were extremely happy with Sharon and Profit Wise, the professionalism was so much better than our previous accountant.  Sharon stayed on target for having our 2019 taxes completed and took the time to meet with us and review them.  We loved that Profit Wise had a precise cost list for each form that we needed to have done.  No surprises!  We hope to have many more years working with Sharon and Profit Wise for our business.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "106340547977474270425", "name": "Gabriel Dambaugh", "time": 1603207598298, "rating": 5.0, "text": "Great responsiveness and quality of support for my business and personal accounting needs.", "pics": null, "resp": {"time": 1625240635336, "text": "We are thankful for the oppurtunity to help grow your business and personal life. Thanks, Gabriel!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "113843633983626036094", "name": "김덕명", "time": 1585087219391, "rating": 5.0, "text": "We have used Profit Wise for our small business for a couple years now. Sharon has been great to work with, and we look forward to the same level of excellence with Jessica.  Front desk staff is so friendly and welcoming (and well-dressed!). Although the cost of services is a little higher than we would like to pay for accounting services, we continue to use them for their services.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "108760133588117393647", "name": "Mayra Pangborn", "time": 1603288404225, "rating": 5.0, "text": "I have been a Profit Wise customer for several years now.  I had a challenging situation that they helped me overcome.", "pics": null, "resp": {"time": 1610464041995, "text": "Thank you for the positive rating Mayra! We have enjoyed working with you."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117353479170335097340", "name": "kenneth walker", "time": 1625099729171, "rating": 5.0, "text": "I have been working with Sharon and Ashley for around 5 years. They have helped me in so many ways, I cant begin to cover them all here. They are extremely knowledgeable and just a pleasure to work with. Their staff is amazing as well. Jessica answered all my questions during the COVID-19 crisis and gave  me the information I needed to make critical decisions for my business. I can not thank Profitwise Accounting enough.", "pics": null, "resp": {"time": 1589557543751, "text": "Thank you Kenneth!  We enjoy working with you and are so happy we can help."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101243839984967874644", "name": "Ian Harvey", "time": 1581977289688, "rating": 5.0, "text": "I had a brief (and free!) consultation with Ashleigh, and she put my mind at ease about multiple aspects of my business. If you're starting a small business and want to make sure you're on the right track, grab a consultation slot through their online system. A great experience.", "pics": null, "resp": {"time": 1583271913940, "text": "Thank You Ian, we were happy to help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "107193714011603540622", "name": "Kelly Griffin", "time": 1618590561348, "rating": 5.0, "text": "Great folks to work with. I can always count on Sharon and her crew to take care of me and to answer my questions quickly.", "pics": null, "resp": {"time": 1589557684374, "text": "Kelly, we are honored to help and happy to have you as a client.  Thank you for the review!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104389063781519101156", "name": "Chris Day", "time": 1585580376138, "rating": 5.0, "text": "I was given Sharon's information through a friend and my dealings thus far have been phenomenal. Initially for my father, a local buisness owner, she sat down w/ us and went over all his needs and buisness concerns. After which she explained several different options he had and exactly how each one was different and/or beneficial to him. He signed on immediately and walked out of our consult an hour later relieved and I at ease knowing he was in good hands. Sharon and the Profit Wise team have been handling his payroll, taxes, etc for several months now and are extremely happy w/ the results.\n\nAfter seeing how professional and meiticulous she had been, I moved my families personal taxes over to her as well and am extremely pleased.\n\nIf your thinking of hiring a new CPA, finding one for the first time, or just not sure.. I highly recommend a consultation with Sharon before making a decision.\n\nThank you Sharon and Profit Wise for the exceptional service", "pics": null, "resp": {"time": 1589557866512, "text": "We are thrilled to have you and your father's trust.  Thank you for letting us work with your family, we enjoy having you as clients!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116797010551126489514", "name": "Jason O'Neal", "time": 1579460800452, "rating": 5.0, "text": "Major back tax issue and Sharon and Ashleigh really made me feel confident and comfortable with a plan and procedure to clear up all issues. I’m extremely grateful for their customer service and guidance.", "pics": null, "resp": {"time": 1579536287666, "text": "Thanks for the awesome review, Jason! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon. Cheers!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "102934861959970554103", "name": "Manilla Gorilla", "time": 1589207901245, "rating": 5.0, "text": "Great team at Profit Wise, very helpful and knowledgeable, I usually try and do my taxes myself but not anymore.  I'll be back for sure", "pics": null, "resp": {"time": 1589557607101, "text": "Marty, we are so happy that we'll be seeing you on an annual basis!  Thank you for taking the time to review us, we enjoyed working with you."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "118071813649690414158", "name": "Nathanael B.", "time": 1539797145136, "rating": 5.0, "text": "Sharon provides exceptional services. She advised me on exactly what to do with my business decisions and completed all the paperwork. She will advise you which route is best for your business and let you know of any pros and cons. Excellent service. Honestly, I can’t speak highly enough. Thank you!", "pics": null, "resp": {"time": 1539965927078, "text": "Thank You Nathanael, We enjoy working with you too!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109493045171236164120", "name": "Elena Allman", "time": 1584394922055, "rating": 5.0, "text": "Sharon provided highly professional and excellent customer service. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "102009882933814133090", "name": "Molly Overton", "time": 1531449346121, "rating": 5.0, "text": "Going to see Sharon was one of my best decisions! I had been worrying and creating the worst image in my head. She put my mind at ease and patiently helped me work through all the details. She is smart and kind, and I ended up in a much better position than I imagined!", "pics": null, "resp": {"time": 1531496140011, "text": "Thank You Molly, We enjoyed working with you and are happy we could help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "108683628221783782638", "name": "Dawn Warren", "time": 1489184285751, "rating": 5.0, "text": "Sharon is amazing! She is so knowledgeable in all aspects of business and personal accounting and is always a pleasure to work with. She is also very considerate of your time, which is a plus for me trying to manage getting everything together and done in a timely manner. I highly recommend her for any of your accounting needs, big or small.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1551825646723, "rating": 5.0, "text": "Sharon and Ashleigh have been wonderful!  I had a complicated tax issue and they corrected it like it was nothing.  I have been using them ever since with wonderful care and customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "113898055014541800938", "name": "Kedra Bell", "time": 1470678259107, "rating": 5.0, "text": "Our company has been satisfied with Sharon's service and preciseness from the beginning. She's very detailed and can provide any accounting information you can think of. She's excellent at getting her clients setup on a schedule and it no time you will be running like a well oiled machine.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "112882810999599315273", "name": "samuel clayton", "time": 1552423843819, "rating": 5.0, "text": "Sharon was very professional and knowledgeable.  Overall great experience and definitely will go back.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "103823408013843702093", "name": "Leah Holcomb", "time": 1515171454759, "rating": 5.0, "text": "Sharon and Ashleigh are so helpful! They're always available when we need them and are willing and able to explain anything you don't understand. They make the hardest part of owning a business easier!", "pics": null, "resp": {"time": 1515253191739, "text": "The team here at Profit Wise are thrilled to hear such good feedback, and we are so privileged to work with you!  We enjoy helping with your Accounting and Payroll to make you life easier!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "105694863154379157183", "name": "Jeremy Harris", "time": 1489173096644, "rating": 5.0, "text": "Sharon's expertise in online sales was very helpful in assuring that our taxes were filled out properly. She was fast, organized and efficient in completing the filing process and I will be returning to her with all future quarterly and end of year taxes.", "pics": null, "resp": {"time": 1489188117143, "text": "It was a pleasure working with you and your wife!  I look forward to working together in the future!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109376102152799789717", "name": "Jeremy Sanders", "time": 1458235153561, "rating": 5.0, "text": "Sharon is a very professional and thorough accountant. We absolutely enjoyed working with her for our business taxes.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "105459151951442201600", "name": "Sharon Heinz Personal", "time": 1483499545099, "rating": 5.0, "text": "QuickBooks - Setup, Monthly Support & Training\nLike most small businesses, I needed help with setting up payroll and QuickBooks support. Sharon came to my office and explained QuickBooks to us and completed the initial setup in a timely manner. I recommend her to other business owners all the time.  If you want your Accounting o be Accurate, Timely and Informative call the team at ProfitWise!", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109277713939660985631", "name": "Sarah Davis", "time": 1492265181978, "rating": 5.0, "text": "Sharon and her team are quick to respond to questions as well as quick turn around on filing! We have used for past 2 years and will continue to.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "105835000217546801596", "name": "Charlotte M", "time": 1530893810451, "rating": 5.0, "text": "I made a mistake trying to do my own taxes!  Sharon's help and advice allowed me to sleep at night without IRS nightmares!", "pics": null, "resp": {"time": 1531496170821, "text": "Char, We are glad we could help and look forward to seeing you next year!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109769231446917988856", "name": "Bryan Hodges", "time": 1625171002178, "rating": 5.0, "text": "The team at Profit Wise Accounting has been great for me. I own two businesses in the Madison County area, and my accounting needs are handled by them. Sharon helped me through some tough tax hurdles that I had incurred from a previous accountant. Not only that, but she also branched out my businesses off the same LLC.\nTwo years later now, my tax woes of the past debacle are in much better shape now. They have done a tremendous job to get me clear and stress free.\nI recommend Sharon, Ashleigh, Jackie, and the rest of this amazing firm to anyone needing their taxes or accounting needs met.\nI AM VERY PLEASED WITH PROFIT WISE.", "pics": null, "resp": {"time": 1625239320792, "text": "Thanks, Bryan! We love helping local business flourish and succeed. We are always here to help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117101088784888197085", "name": "Quincy & Amber Adams", "time": 1615228967700, "rating": 5.0, "text": "We just stopped in today and seen Bill.  This was the first time we had used a tax service since moving to Alabama. He was efficient and had us out with a good refund. He also gave us some tips for next year and what we needed to bring when we start our business for next year. Highly recommend these guys.", "pics": null, "resp": null, "gmap_id": "0x88863675d0f1cea1:0x4b2a44eca2c11af3"}
{"user_id": "116782654648978057382", "name": "Christopher hallman", "time": 1554785246721, "rating": 5.0, "text": "Well I will never be able to say enough good things about these two guys! Mark and Bill are top-notch! They are the best at what they do, they try their best to get the most amount of money back to the American citizens from the IRS while at the same time they allow the Americans to pay their fair share of taxes. They know all of the ins and outs and I know the IRS. I wish most Americans had these guys on their side like we do. I have been going there for years and I feel confident that they are doing the best I can for me yet at the same time they are following the law. usually when I go to have them prepare my taxesthese guys on their side like we do. I have been going there for years and I feel confident that they are doing the best I can for me yet at the same time they are following the law. Usually when I go to have them prepare my taxes there is a long line of people waiting. For some reason I left up today and they said that I got there just after the rush had left. I was in and out in no time. Especially thank you to Bill, he has been there preparing my taxes for my family for many years now. If you're looking for some good tax guys Mark or Bill are where it's at! Downtown Fayette Alabama. Thanks guys!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIi5U5YVa31eZc5l8bRcfT-DNrMtm0iiakwz3Q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_qQCKLLheVKCbotvESOsIW6MSR0jwZfuLPaNb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPEgT6iG4AHOIKOec9HLn6ObfS3ZFrHVueEr42h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFfQlRKfO_HRsmhbo2yGiucIpG8Zk8Oj544RHq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzqcezNz_deMg1wP8b697gipfbLIbQaMVIBVLN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOJyqJlxXUDcYhAJCVcRfqgJmGry5LyOpfNYP9r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZ59tUWD07M6NkqJI5FFGxtOF5S2uBtTBASw_5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88863675d0f1cea1:0x4b2a44eca2c11af3"}
{"user_id": "105417834472247673109", "name": "Brandy & Anthony Richardville", "time": 1579121917113, "rating": 5.0, "text": "Mark was amazing! Fast, easy, efficient! Thanks yall!", "pics": null, "resp": null, "gmap_id": "0x88863675d0f1cea1:0x4b2a44eca2c11af3"}
{"user_id": "118342783348004152893", "name": "Christi Allen", "time": 1518145007548, "rating": 5.0, "text": "We love Mark, super nice fella & quick service.", "pics": null, "resp": null, "gmap_id": "0x88863675d0f1cea1:0x4b2a44eca2c11af3"}
{"user_id": "103701356153355058128", "name": "David Spears", "time": 1518135213231, "rating": 4.0, "text": "Professional timely. Mark is best IMO.", "pics": null, "resp": null, "gmap_id": "0x88863675d0f1cea1:0x4b2a44eca2c11af3"}
{"user_id": "102770531226163969316", "name": "Billy Corkerin", "time": 1580233680476, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88863675d0f1cea1:0x4b2a44eca2c11af3"}
