{"user_id": "102382777917579387470", "name": "Jennie Petree", "time": 1463670606656, "rating": 5.0, "text": "I went yesterday and feel so much better today. I had some chronic and continuous pain for over a year that nothing really had helped much., it left me exhausted and fatigued all the time. I have hope for the first time in forever!", "pics": null, "resp": null, "gmap_id": "0x887d482f5b2a8169:0xa552685ec49216f0"}
{"user_id": "108222185108168306049", "name": "Tim Elam", "time": 1493649556742, "rating": 5.0, "text": "Dr. Marino is extremely knowledge and helpful. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x887d482f5b2a8169:0xa552685ec49216f0"}
{"user_id": "113294030849554782446", "name": "Breann Mellon", "time": 1620508608773, "rating": 5.0, "text": "Dr. Lydia is hands down the most amazing Veterinarian I have ever had the pleasure of meeting. Her kind, compassionate, and thorough home visit for our 15 year old Shepherd/Collie mix Molly during her final day was so peaceful and respectful. There was no better way to have said goodbye to our girl than in her favorite spot in our backyard with all our love surrounding her.\nThank you again Dr. Lydia, you are a beautiful soul!", "pics": null, "resp": {"time": 1620745233546, "text": "Oh Ms. Breann. Thank you so much for your kind words. I was honored to help your family, and glad that I was able to make it at least a little more bearable to say goodbye. Molly was obviously a very big part of your family, and you have my deepest condolences. I also hope you had a safe trip home."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "104795229128236730576", "name": "Lillian-Lotus Buccola", "time": 1617374318129, "rating": 5.0, "text": "Dr. Sullivan has a voice that can sooth even the most stressed human and animal.  Her entire level of professionalism and kindness was not only a welcomed factor, but one I have to say delivered a new wave of calm and love as we sent my service dog and best friend of 13 years on to the next realm.\nFrom explaining in depth from how the process works to how our baby would be handled with his cremation was relaxed and heartfelt.  We were given an imprint of his paw which will be kept on our bookcase with his picture everyday forward.  I cannot recommend Dr. Sullivan enough to anyone who has to unexpectedly [or expectedly] put their furbaby down.\nTruly. We thank Dr. Sullivan for her amazing work and the kindness she showed during the entire event.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNoxIfrpeIWMoHcx70_r5EBD0x7HhEEJNQhuQj5=w150-h150-k-no-p"]}], "resp": {"time": 1617648004572, "text": "Thank you so much Ms. Lotus. It was my honor and privilege to be a part of such a intimate and beautiful event, sorrowful though it was. I appreciate your kindness, and am heartened that I was able to help make it at least a little more bearable."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "105487503297174252631", "name": "Angeline Daigle", "time": 1600299174786, "rating": 5.0, "text": "It was a last minute request , but Dr. Sullivan was there for us on our darkest and saddest day. She not only kept Frankie calm but my husband and I as well. We are forever grateful for her service, professionalism, kindness  and compassion.  I highly recommend her.", "pics": null, "resp": {"time": 1600432690205, "text": "Thank you, Angela. While still a heartbreaking experience, I am glad I was able to help make it least a little more positive. It was obvious Frankie was truly a piece of your hearts, and his loss is immeasurable. I do hope in time you are able to find some comfort."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "112697919192558024590", "name": "Joshua Carter", "time": 1595005148624, "rating": 5.0, "text": "I just had our first visit from Lydia. She was very informative and gave me a lot to think about. It’s hard to make decisions about your loved one and someone like Lydia can add structure to the decision and help you come up with a plan. She can help make your dog feel better but also make you feel better. I wanted to have her come by and meet my 15-year-old English Springer spaniel ahead of the decision to have a goodbye visit.I highly recommend Dr. Lydia", "pics": null, "resp": {"time": 1595350703973, "text": "Thank you so much, Joshua. I really enjoyed meeting you and Ollie. I greatly appreciate you allowing me to assist you and Ollie during this very personal and sometimes uncertain time."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "111716072817681279006", "name": "nani nunu", "time": 1588998649841, "rating": 5.0, "text": "My wonderful older dog was failing and had multiple health Issues.  Dr. Lydia was open, knowledgeable, and compassionate.  We came up with an end of life plan that served us all.  From A-Z, Dr. Lydia was our Angel.  I highly recommend her.", "pics": null, "resp": {"time": 1589846005393, "text": "Thank you so much! It is truly my honor and privilege. I am deeply appreciative of your trust and faith in me during such an uncertain and difficult time."}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "104652583956608193730", "name": "Brittany Pickens", "time": 1573428769114, "rating": 5.0, "text": "Dr. Lydia is incredible with my senior dog. She is warm, kind and SO thorough.  We are thankful for her help.", "pics": null, "resp": {"time": 1573530705099, "text": "Thank you so much, Brittany! It's my pleasure and my honor to work with you and your sweet baby!"}, "gmap_id": "0x889a4f7c63ca3277:0x2407755604991426"}
{"user_id": "110565004097290501506", "name": "Tracy Evers", "time": 1621439605354, "rating": 5.0, "text": "So thankful for this awesome chiropractor and staff! Got me in while on vacation when I was in need of an adjustment. I feel so much better. May have to drive down just to see them!", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "102960692323372599901", "name": "Nancy Litch", "time": 1617291798173, "rating": 5.0, "text": "Excellent doctor who also does acupuncture. I highly recommend this practice. The off staff are very friendly and competent too.", "pics": null, "resp": {"time": 1617296796624, "text": "Thank you for your kind words, Nancy."}, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "103823437216875083110", "name": "Pamela Morton", "time": 1611962897780, "rating": 5.0, "text": "Staff was very friendly and helpful right from the first phone call. Dr. Gravely asked questions about my chiropractic care \"up north\" and was able to gently get me readjusted. Atmosphere was relaxing. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "112084996457143845473", "name": "Jeannie Reece", "time": 1611862009539, "rating": 5.0, "text": "Very warm atmosphere.\nAnd great staff", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "105130218810983363209", "name": "Jim Puckett", "time": 1615170382348, "rating": 2.0, "text": "Even though I told them this was a one time visit as I am from out of state, they started a new patient folder. I was treated but when I asked for his diagnosis and treatment I was told he hadn't written it up. I had my home Dr. Request those records, which I signed off for, but they have not sent them. I was charged for new patient records on that date before my insurance was even contacted. Not happy with this lack of professionalism.", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "112583577602456862924", "name": "Jason Reynolds", "time": 1595950805870, "rating": 5.0, "text": "One slip is all it takes. After a long drive in for a week of vacationing in Orange Beach. I believe part muscle and part alignment became my problem. Gravely got me in quickly. He responded to my email inquiry after hours. He listened to my history and got me straightened out. Thanks! Without this I would not have been able to enjoy the week.", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "102331972658035440970", "name": "Katrina Menzies", "time": 1609521068545, "rating": 5.0, "text": "Love this place.... acupuncture!!", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "101057995417602836585", "name": "Tina Nelson", "time": 1595126371174, "rating": 5.0, "text": "Always makes me feel so much better!!", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "116028337950295135759", "name": "Karen", "time": 1490371484634, "rating": 5.0, "text": "As a winter visitor I was looking for a really good therapeutic massage to soothe my aching back and legs.  I had an appointment at the chiropractic clinic with Audra, who was fantastic.  She really gave my aches a workout which was what I wanted and needed.  The room and massage table were comfortable and the price was perfect for my budget.  The doctor's office was convenient to where I was staying, has a nice parking lot, and is easy to find.  The other people working here were also very friendly.  I wish I had found this massage opportunity sooner, but now have the number saved to my phone for my visit next winter.", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "106461898039380032978", "name": "Tangerine Tundra AG", "time": 1560445050563, "rating": 5.0, "text": "Dr. Gravely was very gentle and great with kids.", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "115482233435701974468", "name": "Melissa Brendtro", "time": 1560518183273, "rating": 5.0, "text": "Easy in and out, great adjustments.", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "111663246475005457947", "name": "Ann McFadden", "time": 1561598055441, "rating": 5.0, "text": "Dr. Steven is awesome", "pics": null, "resp": {"time": 1561638474115, "text": "Thanks, Ann. I appreciate the kind words."}, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
{"user_id": "103667699435495995760", "name": "Jacob Kayl, Jr.", "time": 1499277517538, "rating": 5.0, "text": "Wonderful chiropractor and massage therapist", "pics": null, "resp": null, "gmap_id": "0x889a06527d45c601:0xc635d9efe71abac5"}
