{"user_id": "109291812664393294752", "name": "Andou N. Jennifer", "time": 1622508441853, "rating": 1.0, "text": "Everything is around money. Each question you ask, or something you mention will be part of restriction. when you think you are telling something because the lawyer can help you see clearly and tell you what to do, and how he will help you, but no, he will use this information to put more restriction on the contract.\n\nAt the end, if you ask too much questions, they send you an email to let you know they have too much work. You become a nuisance.\n\nPlease take time to ask questions. About everything. Read the contract and ask questions about each paragraphs.", "pics": null, "resp": {"time": 1623160802620, "text": "Though we cannot address specific details regarding your matter here for confidentiality reasons, we invite you to contact us directly to discuss your concerns. We thank you for consulting with us, and wish you well in your endeavors."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "108159231591359044000", "name": "Ray Ray Ash", "time": 1621893199787, "rating": 5.0, "text": "Here is a lawyer that will work for you and not just the fees. Brian is very easy and knowledgeable in his fields of the law what ever those needs are. Mine's are traveling to other countries to be married and having the proper paperwork for both place of residents. Time change and I were late (1hr) but he waited with a smile. OMG I said to myself and he had great news to follow-up on my questions and some I didn't think about asking.\nWho is Brian J. Bogdany???\nDedicated,Honor,Devoted,A Believer,Family Oriented,\nDuty,Committed,Trustworthy\nand a Joyful man to handle\nyour legal affairs.\nMr. ASH,R.,U.S.NAVY retired", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIRe7Z6jcjeST9QM_dBdFmJfzwCPTQMPXyoUeu=w150-h150-k-no-p"]}], "resp": {"time": 1625761354718, "text": "We greatly appreciate your confidence and your kind words. Thank you."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "110171162575614371083", "name": "magda kruger", "time": 1625760564213, "rating": 5.0, "text": "He is extremely good at what he does and one of the most helpful people I've ever met.", "pics": null, "resp": {"time": 1625761236616, "text": "Happy to be of service. Thank you."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "115237433475731487780", "name": "Eric Davis", "time": 1611782578047, "rating": 5.0, "text": "Mr. Bogdany was very helpful in our immigration case.", "pics": null, "resp": {"time": 1611784535053, "text": "We are happy you were satisfied with our work. Thank you so much."}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "105886604400786289898", "name": "Connor D. Grimshaw", "time": 1558622602514, "rating": 5.0, "text": "Very knowledgeable and overall a nice person. Kind heart-ed and strong willed. I would not have a problem trusting them with my life.", "pics": null, "resp": null, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "109217094427497241517", "name": "Johnny Adams", "time": 1581178394312, "rating": 5.0, "text": "Thanks for always taking the time to listen and give advice. Keep up the good work!", "pics": null, "resp": {"time": 1590092274082, "text": "We always appreciate speaking with you Johnny!"}, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
{"user_id": "105279572074460082005", "name": "Jillian Yanes", "time": 1573143083279, "rating": 5.0, "text": "(Translated by Google) This is the best lawyer. Very professional, good prices; and onesto. I recommend it\n\n(Original)\nEste es el mejor abogado. Muy profesional, buenos precios; y onesto. Se lo recomiendo", "pics": null, "resp": null, "gmap_id": "0x888c93390ec7b34b:0x345cd16fb85b3a95"}
