{"user_id": "115186848817027903105", "name": "Paula Watkins", "time": 1595559632316, "rating": 5.0, "text": "They take great care of my granddaughter", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "117663339849488730532", "name": "Devin Nobles", "time": 1552920411549, "rating": 5.0, "text": "Good place for kids to learn and build friendships.", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "117630854104326455487", "name": "family 1st.", "time": 1534166342844, "rating": 5.0, "text": "Nice place for teens and young kids to learn play and stay out of trouble.", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "108151832185563628832", "name": "Ashley Jay", "time": 1550317389614, "rating": 5.0, "text": "Had to vote here the environment was good and quiet", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "117579636936698235503", "name": "Shari Little", "time": 1520661729714, "rating": 5.0, "text": "Take good care of our kids.", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "108714592606748637882", "name": "Dewayne Campbell", "time": 1581380595163, "rating": 5.0, "text": "Great place to go", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "100865916026927491914", "name": "Felecia Wilson", "time": 1531712143193, "rating": 5.0, "text": "Great place for kids.", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "102057881468308848841", "name": "adrienne miller", "time": 1578707381200, "rating": 5.0, "text": "Cute place", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "100573239244261054215", "name": "Rodney Brasley", "time": 1521855657195, "rating": 5.0, "text": "It is close to my house.", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "109654691032850874298", "name": "Ernestl Moses", "time": 1514032961848, "rating": 5.0, "text": "This is my voting precinct", "pics": null, "resp": null, "gmap_id": "0x889a526d03c92f81:0x8def53f947eea0cc"}
{"user_id": "107243534455936798983", "name": "JDTheRedAnimator2008", "time": 1608053751742, "rating": 5.0, "text": "I not a Boys and Girls Club member but I Go there for Basketball Practice/Games", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "108016584629829902208", "name": "Tiffany Walker", "time": 1570823926406, "rating": 5.0, "text": "Very friendly staff. My kids go here 3 times a week and have not had one complaint from them yet. They help with kids homework and give activities to do. And pricing cant be beat! Thankyou for all you do!", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "109870078403751470061", "name": "Emily Pair", "time": 1557251122834, "rating": 1.0, "text": "I would give a zero star. They do nothing with or for the children. Children have little to no supervision. It's in a non air condition gym.", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "104688319463470207131", "name": "Alvin Forte", "time": 1555824632255, "rating": 1.0, "text": "it doesn't be enough grown ups there in charge..the kids do as they please", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "103116247848203550999", "name": "Shirley M", "time": 1562701105426, "rating": 4.0, "text": "Had a great time.", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "106947876300673601060", "name": "Lanny Deal", "time": 1595470569372, "rating": 4.0, "text": "Voting location", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "108471338753174707337", "name": "Dave Jernigan", "time": 1548352156527, "rating": 5.0, "text": "Go", "pics": null, "resp": null, "gmap_id": "0x888d477e5413c861:0x9553014097a9a9cf"}
{"user_id": "107145819377935563475", "name": "Ash Redmon", "time": 1613569964231, "rating": 5.0, "text": "Since my daughter restarted here she has thrived. She’s learning baby sign language and her ABC’s. She trying to speak in sentences and she’s only 17 months! We love her teachers and Mrs. Dorothany is so sweet and patient them! The Covid protocols her make me feel good about sending her!", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "105526535865470865373", "name": "T H", "time": 1578429460199, "rating": 5.0, "text": "Great center for any age. The staff are mostly elder aged women and are very sweet and patient. Been going there for 2years.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "105472100687638951978", "name": "Edna Holley", "time": 1540239041215, "rating": 5.0, "text": "I give this daycare an A+, not only because of their excellent work with the children left in their care, but also for the exceptional customer service that they provide in order to assist/help families that some times fall on hard times.  The owner’s willingness to listen and assist when things are difficult goes beyond just a business relationship.  Kudos to the owner and staff at this daycare.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "101860055553159395826", "name": "Jennifer Ashworth", "time": 1540245547545, "rating": 5.0, "text": "My twins having been going to this daycare since they were 3 months old. They are now 2 1/2. They love their teachers and are always showing us new things they’ve learned. We could not have asked for a better group of people to love our babies as much as we do.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "108202992465986488558", "name": "Brandi L", "time": 1453407976331, "rating": 5.0, "text": "I love everything about this daycare. The ladies there are very kind and responsible. My son learns something new everyday and I can tell he's being well taking care of. I highly recommend this daycare.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "104460363010035342690", "name": "Ashley Hickerson", "time": 1569500135767, "rating": 1.0, "text": "This daycare has multiple allegations of abuse.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "107184831850587604212", "name": "D Robinson", "time": 1483562550805, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "101457219148764461048", "name": "Tatum Butterfield", "time": 1600202487234, "rating": 5.0, "text": "I want to say thank you to the staff and management of Childcare Network who go above and beyond on a daily basis to make sure that my child’s needs are met. Lisa, Stepheni, and Tway insure that safety is a priority at Childcare Network. The teachers take their jobs as care givers to the children of our community very serious.  Every teacher my child has had (from infant room to the two year old room) has treated her like family. Childcare Network puts mind at rest and I find comfort in knowing that my child is safe and loved while I’m at work. Again, thank you for all you do.", "pics": null, "resp": {"time": 1600699197367, "text": "Hi Tatum, thank you for taking the time to leave us a positive review! We work hard to meet expectations like yours, and we are happy that you are satisfied with the care and education our teachers provide your child. Thank you for choosing Childcare Network, we are so thankful to have you and your family a part of our Childcare Network family."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104168410981765307695", "name": "Audrey Johnson", "time": 1599846286448, "rating": 1.0, "text": "I’m going to start by saying the staff that works directly with the children are great! However the management such as corporate is awful! Not ms. Tway or Stephanie. I get childcare subsidy obviously because I can’t afford childcare on my own! They told me Friday that I have to pay childcare out of pocket because child care subsidy only pay it once a year! If childcare charges once a year then why would you guys charge twice a year? That is not a working moms best friend! That is a inconvenience and makes it impossible to go to work. So I’ll probably be missing a week of work because the company wants to make more money any way they see fit! Strongly recommend the staff definitely do not support the corporation rules as a whole! Lisa butler is rude and don’t care about people much like Donald trump a total tyrant!", "pics": null, "resp": {"time": 1600699769077, "text": "We appologize for the inconvenience. We are available to speak with you about any concerns you might have. Please call 833-407-6174 to speak to Corporate Customer Care to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107699754980347841886", "name": "Mrs Russ", "time": 1602170297994, "rating": 1.0, "text": "Horrible Management. The director Stephanie was very  disrespectful. Just pulled my child out today. I do not recommend this location.", "pics": null, "resp": {"time": 1602176980516, "text": "It is only through feedback such as yours that we are able to maintain and improve upon the service we provide to our families. We would like to apologize for the experiences in your review and would very much like to follow up with you. If you wouldn’t mind giving us a call at 833-407-6174, we would like to have someone from the Corporate Customer Care department follow-up with you."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114608540680499829506", "name": "Cierra Rodriguez", "time": 1502031119097, "rating": 4.0, "text": "So... first off I want to clarify the \"discount for review\" thing everyone is talking about. There isn't ANYWHERE on the flyer that states you have to give 5 stars in order to receive a discount for services, so some of the below listed reviews are being VERY dramatic on that standpoint. It's a nice center and my kids have really enjoyed their summer here.", "pics": null, "resp": {"time": 1504620883207, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100824425643397100780", "name": "Chad Millirons", "time": 1476292499052, "rating": 5.0, "text": "I absolutely love this facility. Our daughter is 16 months and love coming to school. In the infant class, she loved Mrs. Michelle and Ms. Emily. Now that she is in the Toddler class, she loves Ms. Chianti. You can tell they truly love kids and they treat your child as one of their own.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "105770043327052678250", "name": "Emily Gunter", "time": 1506826590216, "rating": 5.0, "text": "My niece has been going to childcare network #169 since she was 6 weeks old. She now currently 3 years old and we still absolutely love it! We know she is always safe and well took care of. The staff goes above and beyond to make sure the children are happy and that they are learning! It's amazing how much my nieces knows at only 3 years old! Not only are the teachers great! The director and the assistant director are awesome as well. They are always welcoming and helping solve any issue that may come up! Couldn't imagine my niece anywhere else! #169 rocks!", "pics": null, "resp": {"time": 1509047826570, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107439376903288006210", "name": "Brittany Jenkins", "time": 1575650038335, "rating": 1.0, "text": "I called to see if there were openings for both of my children's ages, I was put on hold for 5 minutes to be told unfortunately there was a wait list for both of their age groups. I asked to be able to put my kids on the wait list. The first lady acted like she was annoyed that I asked. And put me on hold for another 5 minutes, and was transferred to the lady that handles the wait list. Of the 30inute phone call less than 5 minutes of the call was spent actually talking. I understand there is probably a high volume of calls, but even being put on a wait list I'm still a potential client/customer. Either one of those people could have taken their information down and just put them on the wait list.", "pics": null, "resp": {"time": 1575667693921, "text": "Hello Brittany, we apologize for the inconvenience this has caused you. However, after checking with the director, it looks like we do have some space available. If you would give us a call back, at 334-214-5273 and select option two and then press 1 to be transferred directly to the school. We will be happy to help get your little one enrolled!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106419371562225867134", "name": "Jovan", "time": 1409781459748, "rating": 5.0, "text": "So far the experience has been great! My kids love it there! The staff is amazing! The facility is well kept and there is plenty of space. The summer program is great! I can't wait for the curriculum to start!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113462493091324192784", "name": "Dana Love", "time": 1505920344827, "rating": 5.0, "text": "My daughters have been going to childcare network for almost a year. My oldest daughter is very shy, today i dropped her off, like every other day the teacher welcomed us but today was different. Shianti said good morning, got my daughter to talk to her and helped her get her favorite toys to play with. I'm so happy all the teachers at the daycare loves my girls like i do.", "pics": null, "resp": {"time": 1509047895512, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109412919093052672197", "name": "Lanie Dale", "time": 1525701543849, "rating": 5.0, "text": "My son has been going to childcare network for over a year now. I previously had him enrolled in a daycare in Columbus because they had video cameras inside the facility and the place was absolutely awful . I had heard great things about this daycare and decided to give it a try. I am probably the most anxious person in the world and worry constantly about my child. I can honestly say I don't worry one bit when my son is here. The entire staff here are angels in my eyes. My son loves everyone of them and says it's his favorite place to be. He is always so happy to see them and has learned so much from this place. I would recommend them over and over again to anyone and I would never send my son anywhere but here. Thank you guys for everything you do and all of your hard work! This place has truly been a blessing in my life!", "pics": null, "resp": {"time": 1527192891537, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100331046499534639501", "name": "Sammantha Fietzek", "time": 1394756269298, "rating": 5.0, "text": "Love this place! The staff is loving and caring. The school age group has an amazing space upstairs including a beautiful basketball court. All three of my kids love going there and can't wait to return each day (which makes a huge difference to me)", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103774541742903168684", "name": "Courtney Moore", "time": 1455298609373, "rating": 5.0, "text": "My daughter absolutely loves Childcare Network. It took only about a week before she was jumping into the teachers arms, which made me realize that it was an awesome daycare center. I love all the teachers, they always have smiles on their faces and positive attitudes!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106355487220241390016", "name": "Joey Keyser", "time": 1506700330803, "rating": 5.0, "text": "Since my son has been going to child care network he has learned so many new things. The staff is excellent and responds quickly to any problems or any good things that happens at school. They treat my son and every child like it's there own. Thank you childcare network # 169 and staff for making my son and I feel like family!", "pics": null, "resp": {"time": 1509047795325, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113478113579831077819", "name": "Jessica Koonts", "time": 1573551437192, "rating": 1.0, "text": "Beware! My son made it one day (only a few hours). When I picked him up all of the kids in the room were crying while the provider sat on her cell phone. The room was trashed, potatoe chips littered the floor (it was approximately 10am). My son sat in a chair, drenched in tears, and looked completely miserable. Before I went in the room, I went to the directors room to pay, she was rude, didn’t get up to greet me, and said she was busy and that she hadn’t added him to their system (they had his packet for over a week). The place felt like a holding cell for drunk inmates, total chaos and dirty.", "pics": null, "resp": {"time": 1573571429176, "text": "Hi Jessica, thank you for taking the time to share your review. It is only through feedback such as yours that we are able to maintain and improve upon the service we provide to our families. We would like to apologize for the experiences you detailed in your review, as it is not consistent with our company’s policy or standard of care. Please call 877-424-4530 to speak with our Corporate Customer Care Department to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102733578205204750793", "name": "amy danny", "time": 1458786128352, "rating": 5.0, "text": "Absolutely love this place. All of the staff are amazing. Jeffrey loves the teachers that he's had. I would and do recommend this daycare to anyone. I hate we are leaving this summer. It's going to be hard to find another place like this.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "110168122037238350626", "name": "Jay Elliott", "time": 1506828393638, "rating": 4.0, "text": "Both my girls attend this center and their after school program and absolutely love it. And the staff is like family. Highly recommend Childcare Network #169", "pics": null, "resp": {"time": 1509047729893, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107189216982052531231", "name": "P (Ed9arA11enPWND)", "time": 1492114341787, "rating": 5.0, "text": "Awesome daycare! Been using them for over a year. Very comfortable leaving my child in their care. The whole staff is awesome.", "pics": null, "resp": {"time": 1493732569640, "text": "Thank you for your response!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114643715027830862706", "name": "Meka Johnson", "time": 1363373764017, "rating": 5.0, "text": "Childcare Network is a great center. My kids have being going there for 7 years. They have a great curriculum and summer program. My kids are in the afterschool program. The teachers make it fun. The Director is very friendly and goes ABOVE and BEYOND to truly be \"The Working Parents Best Friend\".", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115286715098411149444", "name": "Tiffany Williams", "time": 1413289458299, "rating": 5.0, "text": "So glad that I moved my daughter to this school. She is so much happier going here and the personal relationships between parent and teacher is just priceless..I feel like she is with family and that is great for me. Absolutely love this school! Thanks for everything y'all do!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108390911644580454484", "name": "debbie keyser", "time": 1506651109457, "rating": 5.0, "text": "My son Landon attends this Childcare Network & loves it! The staff here is amazing!!! Landon has learned so much over the last 2 years!! They are always so nice and friendly! I wouldn't want my son going anywhere else!!!!!", "pics": null, "resp": {"time": 1509047919332, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104806860150022084336", "name": "Jenny Britton", "time": 1506828994754, "rating": 5.0, "text": "I have 3 amazing kids & I'm that momma who doesn't trust just anyone with them. My boys are school aged, & my daughter is almost 2. We've been with Ccni #169 for over 6 years off & on. I absolutely trust Stepheni Elliott the director with my children's life. She's an all around amazing lady. She treats the children as Her own.  Her staff is also very wonderful. & helpful.  Everyone is Very friendly, it's a clean facility, & has the best teachers in town. I highly recommend them to everyone I know. Price is great for the attention, love, learning & the care they give.  If I could I'd  give them 10 stars. Thanks ladies for always caring for my babies, protecting them & being there for us whenever we need y'all. #169 rocks.", "pics": null, "resp": {"time": 1509047691587, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102068573566851062720", "name": "Erica Robinson-Hill", "time": 1410399552596, "rating": 5.0, "text": "I have not had to deal with childcare for 13 years. I was fortunate enough to be able to stay home with my little one for almost 2 years. Needless to say, I was extremely nervous about placing my child in someone else's care. My husband and I were welcomed from the moment we came to visit (unannounced) the center. Prior to meeting the director, other staff members were making us feel very comfortable. The director spent approximately an hour with us. We were impressed at the cleanliness of the center as well as how organized and structured the programs are.\n\nWe only need part-time care, but were still impressed at the affordability of full-time care and were advised that should our needs change we could obtain full-time care at any time. Payment options are great as well.\n\nIt is our plan for our child to spend many years here!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104855126629260209208", "name": "Dylan Savage", "time": 1506828639566, "rating": 5.0, "text": "The teachers are great.  The director Mrs. Stephanie and her assistant is wonderful they go above and beyond to meet your needs. 😊", "pics": null, "resp": {"time": 1509047709578, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103235426364552560482", "name": "Denise McWhorter", "time": 1412283117605, "rating": 5.0, "text": "Childcare Network is a great organization. This is my grand children's first experience at being away from home. They absolutely love it. Thank You Childcare Network for helping make the transition easier for my family.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112035745007813061516", "name": "First name Last name", "time": 1491486822869, "rating": 1.0, "text": "Don't believe the hype with the reviews. They offer discounts if you give them five stars. It's a horrible feeling to pick up your kid with a pamper of of poop, dirty nose, and the room smelling horrible. They really need to tight up!", "pics": null, "resp": {"time": 1493732559874, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101973606365972658821", "name": "Benjamin Heimstead", "time": 1476626353862, "rating": 5.0, "text": "Great place with lots of room. I have two children that attend and they are always well cared for. I highly recommend them to any parent.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109216346628053368426", "name": "Labrisha hudgins", "time": 1446393239387, "rating": 5.0, "text": "Great center!! My kids loved going to the center!! The teachers are professional and  very caring. I highly  recommend them for your child care needs!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102351711852551824862", "name": "Rebecca Savage", "time": 1506826674973, "rating": 5.0, "text": "I am a mother of 3 wonderful children, I do not trust my kids with just anyone. I have had experiences with a few daycares and child care network was by far the best place I could have chosen for my kids to go. They are a very clean and friendly place. The teachers are great and very hands on with the children, and the director  Mrs. Stepheni is AWESOME and very helpful. If you have a problem she will go above and beyond to make it right.", "pics": null, "resp": {"time": 1509047838125, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103985994571871773787", "name": "Facetime Terri", "time": 1533675561377, "rating": 1.0, "text": "i learned you cant always go off reviews. i say go visit your self, and ask around verbally, and believe them the first time. good luck", "pics": null, "resp": {"time": 1535490076044, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115616847827434254267", "name": "Jessica Palmer", "time": 1413226102441, "rating": 5.0, "text": "My daughter is two and she absolutely loves going to see her friends and teachers at this CCN!  I am continually impressed by the staffs dedication to child learning, safety, and play!  I would give it six stars if I could!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117802146329438379169", "name": "Krista Brown", "time": 1395223377838, "rating": 5.0, "text": "Been using THIS facility for almost 2 years now. I moved and pulled my daughter out for a while and then had my son. Since I was no longer near this one I tried putting my kids at a different daycare. That only lasted a couple weeks, I now drive about 25 mins out of my way each way everyday just so my kids can be at this daycare! This is the only daycare I can trust and feel good that they're being taken care of. My daughter loves her teachers and constantly talks about them at home and she is learning so much. All the staff are friendly and know your kids by names even if they're not in their class. Molly actually gets excited to go to daycare so she can play. Price is good and the only thing you have to supply is diapers. The director Stefanie and her assistant Loren are awesome, along with ALL the other staff, way to many people to name!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113069187479871638866", "name": "Vidal Rodriguez", "time": 1502032018353, "rating": 4.0, "text": "Really nice place, my kids love it. They do a lot of different activities during the week to keep the kids entertained.", "pics": null, "resp": {"time": 1504620841273, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107067552357276901124", "name": "Hailey Harris", "time": 1448296561722, "rating": 5.0, "text": "I love Childcare Network. I feel safe when I drop my two babies off knowing that they both have wonderful teachers to look after them. The staff are all very nice. Both of my children have learned so many new things and they have only been attending a few months now so it's safe to say i'm a very pleased mother! I look forward to the years ahead of them attending here!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107121782027184352770", "name": "Breanna Savage", "time": 1506828758421, "rating": 5.0, "text": "The director Stepheni and her assistant are amazing people. They do everything possible to make sure your kids are cared for. Couldn’t ask for a better daycare!", "pics": null, "resp": {"time": 1509047701022, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111873776292630679900", "name": "Laquesha Sanders", "time": 1506828621423, "rating": 5.0, "text": "Childcare Network #169 is a awesome school.My children have been attending this facility since they were 6 weeks old.The staff is  professionally trained,very friendly and polite.I would highly recommend them to any working parent's.", "pics": null, "resp": {"time": 1509047750728, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117473344090074990580", "name": "Markaya Tillery", "time": 1506653006429, "rating": 5.0, "text": "I have heard such great things about your school. Debbie Keyser has never had anything negative to say. Landon loves his school very much and has learned so much.", "pics": null, "resp": {"time": 1509047765609, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111900377350133016334", "name": "Emily Murphy", "time": 1455244038075, "rating": 5.0, "text": "We have only been here a few weeks, but the staff is really nice.  I love his teachers and everyone I talk to are crazy nice", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100273397424063345141", "name": "craig chapman", "time": 1394828194234, "rating": 5.0, "text": "For years Childcare Network has provided the best, and most professional of care to my grandchildren. The staff is always kind and caring, willing to assist in every way possible, thank you Childcare Network.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101722058819039312398", "name": "Haley Kelcy", "time": 1506829883332, "rating": 5.0, "text": "Childcare network 169 is a wonderful school. The staff is so great and super friendly!", "pics": null, "resp": {"time": 1509047669972, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103586207344466468637", "name": "shannon collier", "time": 1506651072292, "rating": 5.0, "text": "My nephew Landon Keyser goes here and he loves it and his teacher! Place is neat and clean!", "pics": null, "resp": {"time": 1509047908348, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112470804804835729813", "name": "T Herring", "time": 1412110535561, "rating": 5.0, "text": "Being a working parent is hard.  You worry alot about your child.  You worry about their safety, and you worry about their day while  they are away from their family, in the care of others.  Since changing my daycare to Childcare Network, my worries have greatly decreased.  My mind is more at ease during the work day.  My child is happy when she is dropped off, this is what matters to me in a daycare.  Sometimes you think a newer building, a higher tuition, or an affiliation will make for better childcare.  You may have to re-evaluate how you determine good childcare.   If your child runs to their teacher, and all the other teachers know her name as she is leaving..... that is the sign of good childcare.\n\nThe school age program is very good as well.  The facililty's school age room is also very updated and very age appropriate.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109946996148804562651", "name": "zachary christian", "time": 1506653213403, "rating": 5.0, "text": "Debbie Keyser's son Landon goes here and loves it. Highly recommend this place for your children!!!", "pics": null, "resp": {"time": 1509047774654, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114489419511252273612", "name": "Lisa Singleton", "time": 1506652856427, "rating": 5.0, "text": "Childcare network 169 is the best!! Debbie Keyser's son goes here and loves it! Heard great things about Childcare Network 169!!!", "pics": null, "resp": {"time": 1509047983561, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108711465469148690233", "name": "Debra Keyser", "time": 1506651222998, "rating": 5.0, "text": "My grandson Landon goes  here they are very loving and caring teachers  i would  highly recommend them.", "pics": null, "resp": {"time": 1509047932465, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111724122616853462260", "name": "Christina Love Holmes", "time": 1506652700685, "rating": 5.0, "text": "Debbie and Joey Keyser love this place! I've heard nothing but great things!! Highly recommended 😊", "pics": null, "resp": {"time": 1509047971791, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101614353680917904448", "name": "Chianti Thomas", "time": 1455203291617, "rating": 5.0, "text": "I love work here and my youngest daughter love coming here. It's a great place to be......", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104307182280512490021", "name": "pamela kidd", "time": 1363355225501, "rating": 4.0, "text": "My son is not the type of kid that likes school but after I enrolled him at the Childcare network he loves going to school. I like the fact that he has homework every week. I feel it gives him a since of responsibilitly. Overall, I am glad I pick the childcare network for my son's first expericene of preschool.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107627302866370449935", "name": "Daniel Britton", "time": 1506829108755, "rating": 5.0, "text": "Great place. Good people. Reasonable prices.", "pics": null, "resp": {"time": 1509047675300, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115274757706770895378", "name": "Erica Hurst", "time": 1490393892268, "rating": 1.0, "text": "I don't like the idea that they offer a discount for writing a good review. I've had many problems since my son started attending. The following of policy and procedures are questionable. My child stays sick. I do like some of the teachers but again things are questionable.\nI've witnessed things that I know are not proper policy like changing children's diapers in the floor.\nI", "pics": null, "resp": {"time": 1491245409351, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "118248626441964847063", "name": "Constance J", "time": 1506652667386, "rating": 5.0, "text": "My friend Debbie Keyser takes her son Landon to Childcare Network on 169 & he absolutely loves it! Debbie & Landon both love the staff!!", "pics": null, "resp": {"time": 1509047946265, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103808145144504545852", "name": "Wanky Thomas", "time": 1478449711526, "rating": 5.0, "text": "Outstanding after-school care for any parent considering to enrolled there child into this program with outstanding result!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104890901343860388153", "name": "Jerry lee Savage", "time": 1506827351101, "rating": 5.0, "text": "The faculty is very polite and professional, school is always clean and organized!!", "pics": null, "resp": {"time": 1509047720681, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102990706181603890645", "name": "Wendy Cameron", "time": 1506808761294, "rating": 5.0, "text": "4 of my Grandchildren have went to this day care, the team work they have starting with there Director Mrs Stepheni is more than you could ever ask for, Mrs Stepheni is the most friendlest person I think I have ever met over the last 4 year's I've seen the way she is with her staff and Children at the daycare most importantly the children and you can tell how much those children love Mrs Stephanie as well as the parents and her staff I thank God that there is a daycare out there that has a director that cares about the Children and staff like Mrs Stepheni! and there are no discount for giving them a 5 star rating. Thank you Mrs Stepheni and staff at childcare Network #169", "pics": null, "resp": {"time": 1509047815860, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111698858551078694409", "name": "Realtor Haley Adams", "time": 1506828438463, "rating": 5.0, "text": "Such a caring and dedicated staff!  As a local realtor, I am constantly recommending Mrs. Stepheni and her staff at CCNW 169 to my clients new to the area.\nWhen you choose CCNW 169, you aren't just putting your baby in someone's hands, you're putting your baby in someone's hands you can trust!!!", "pics": null, "resp": {"time": 1509047739060, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108686196410113201274", "name": "Labrina Jones", "time": 1366118956393, "rating": 5.0, "text": "came to the states 2011 searched for a daycare for my son didn't really like to many than I came upon childcare network the teachers are the best they made me and my child feel like we was at home. they are very clean, organized and caring. my child been going here for 2 1/2 years and he  love it. the director Mrs.Kabrina she is the best she make sure her staff do their job and do it to the best of there ability, she walks around daily and check each and every classroom if there's a problem she will address it in a professional way. I love Mrs. Kabrina and her staff in her class its going to be sad to have my child go off to kindergarten when he loves this prek program.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102467198449630806741", "name": "Bradley Lyons", "time": 1502921562294, "rating": 1.0, "text": "Don't send your child here. My daughter has been bitten three times by another child and the teachers have done nothing. I've heard a teacher tells kids to shut up while dropping off my daughter. They do not change diapers nearly as often as they should so my daughter has a constant rash. This place should be shut down. The teachers there don't pay attention and there are way too many children in one room at a time with one maybe two teachers. Worst daycare I've ever seen.", "pics": null, "resp": {"time": 1504620790601, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "110888813726953861614", "name": "Chris Johnson", "time": 1458226295694, "rating": 5.0, "text": "Such an awesome place for a kid to be! Great atmosphere, great teachers. I've been using this daycare for over a year now and havent had any reason at all to look for another daycare. Stephanie and Kelly are the best coordinators ever!! They work really hard to keep that place clean and safe also my son has CF and has special needs, has to take medicine and has to do therapy everyday and they make sure it gets done. My son, Kash, has learned so much and has met alot of new friends in the short time that ive been using this daycare. I love this place and so does my son! thank you guys so much!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112028605250662399315", "name": "Terran Nichols", "time": 1412220230185, "rating": 5.0, "text": "Great place! Loved the teachers and the curriculum", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112475840415048354211", "name": "Shawn Johnson", "time": 1506652952810, "rating": 5.0, "text": "My nephew London keyser goes here and his parents speak so highly of this day care,im considering enrolling my twins here !", "pics": null, "resp": {"time": 1509047995294, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102230131251676624290", "name": "Hyrel Walsh", "time": 1413569693922, "rating": 5.0, "text": "My Great grands tell me they <3 it!! :-)", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100374613251113555965", "name": "Amanda Herbine", "time": 1533373276913, "rating": 2.0, "text": "They need to drug test their staff!!!", "pics": null, "resp": {"time": 1535490067602, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117045102858677899679", "name": "Stepheni Elliott", "time": 1506827317778, "rating": 5.0, "text": "I love this school!!!", "pics": null, "resp": {"time": 1509047850432, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109452318790210321813", "name": "Beverly Doyle", "time": 1620050622138, "rating": 5.0, "text": "My son has enjoyed the transition to BBMA and they have been amazing through the entire pandemic. I appreciate their efforts to keep the kids safe!", "pics": null, "resp": null, "gmap_id": "0x888c933b5eb14285:0xfd9870e1e09f7486"}
{"user_id": "104544026830502230779", "name": "David Eckman", "time": 1618355975686, "rating": 1.0, "text": "I travel, and pay extra for a nation wide membership.   I’ve been in 15-20 ymca’s in the last year and they have all been gracious and accommodating.  This one must be special, because they will not accept my membership, and will not give me any option to use their facility.", "pics": null, "resp": {"time": 1619637978242, "text": "We regret that you were unable to visit our YMCA facility during the pandemic.  In order to protect our staff and our members, we are currently welcoming guests from Baldwin and Mobile Counties of Alabama only.  We will continue to monitor updated CDC guidelines as more people are vaccinated, as rates of COVID-19 change and as additional scientific evidence becomes available."}, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "113796908305712514209", "name": "Recep Kuru", "time": 1620905042986, "rating": 3.0, "text": "Good and friendly employees but they need to check some disgusting customers. The guy spit at floor in sauna like an animal when he did chewing a gum , I already reported him and they known him . I believe they kicked him out .", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "107995168162485446741", "name": "Ernest Kelly", "time": 1604460995292, "rating": 4.0, "text": "Love Gina's Total Body Challenges classes at Bounds Family YMCA. I've been taking her classes for over a year now and am happy to say I look forward to them every week. It's always fun, high energy and you get a great workout! Gina's the best!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "109908641610264443714", "name": "Karim Harzallaoui", "time": 1613395646381, "rating": 5.0, "text": "Great gym, but if they would open at least at 14:30 would be awesome", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "116828095064492123256", "name": "Cody White", "time": 1611579784646, "rating": 5.0, "text": "Clean facility, lots of options, and Karen is the absolute best up front!!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "108927953400009010440", "name": "Wesley Williams", "time": 1610489793065, "rating": 3.0, "text": "Really nice gym but it has the worst hours of any gym I've been to.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "104112391395847642704", "name": "Local Guide", "time": 1575469758338, "rating": 5.0, "text": "Great customer service and welcome desk. 2 pools one indoor and heated another outdoors. Exercise equipment. Several Stories. Family environment and safe. Child Care. Excellent facility.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "107723010185060445400", "name": "A Boyd", "time": 1560437295658, "rating": 1.0, "text": "I came in as a guest with my sister who is a member. Wanted to get a membership but wanted to try a class out first. We called the day before and asked what all we needed to bring for me to do a class with her. Was told all we needed was $10. I get there with $10 in cash and then I’m told “oh we don’t accept cash” which of course was not told to me on the phone. But it was fine my sister asked if she could just charge it to the card on file. Then she asks for my drivers license that I don’t have with me because I was never told that I needed to have it. All the while I’m trying to remain calm even though this is very annoying because I did everything right and called the night before and asked what I needed to have and NONE of this was mentioned. The woman at the front desk was extremely rude and said “well your sister is a member and should have known what you needed to have.” My sister has never brought a guest before and again WE CALLED AND ASKED and were not told any of this. It was very disgusting and embarrassing the way the woman was talking to us. Needless to say, I’m not getting a membership there anymore. This was very disappointing.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "115340946810590555118", "name": "Rachel Tucker", "time": 1535120665206, "rating": 5.0, "text": "The group fitness instructors are an exceptional team. They’re all phenomenal teachers and community builders. For me, they’ve made the difference in my experience at this YMCA. Otherwise, it’s a beautifully maintained facility. The mission of the organization and the way it’s run make membership well worth it.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "106347005921996215181", "name": "The Connor and Jacob Channel", "time": 1561926506871, "rating": 3.0, "text": "Pretty decent gym. Friendly atmosphere most of the time.  Lots of machines although it seems many of the treadmills have glitchy TVs. Wish the pool was open later on weekends and cleaner...especially the outside pool. Pool staff has been unwelcoming in the past. I know they are mostly kids but they should probably have some training in how to treat the kids they are watching. We've always liked the private swimming lessons experience and those instructors have always been excellent. We used to love the Kids Night Out program, but they've made it less conducive for our child who is not into socializing. I wish they had some kind of classes for beginners especially yoga. Administrative people are nice but don't seem to be on the same page with information. Cleaning attendants are friendly and always hard at work. Now that my children are 8 and 11 they do not feel comfortable going in the ladies dressing room which I totally agree with but I do not feel comfortable letting them go in the men's area because there is no privacy for them. I'm not comfortable with them being exposed to naked men or having to expose themselves. Probably a lot to ask for a kids dressing area or family room. There is a changing room/storage room by the pool but I think it's really just meant for storage. It would be great if they would post the status of the pool on Facebook or via text. It's kind of inconvenient to get there only to discover it is closed because of a distant rumble.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "112737742553933877848", "name": "Yosef Aborady", "time": 1572196415874, "rating": 1.0, "text": "They have horrible hours of operation. Wi-Fi coverage is so spotty and when you do have a connection it’s super slow there’s no cellular signal because it is a metal building. Staff are clueless and who doesn’t open until one on Sunday it’s absolutely ridiculous. My advice to anyone would be to go to planet fitness for the same type of atmosphere half the price only thing you’re missing out on is a pool.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "112948535173266914188", "name": "James Spivey", "time": 1536343661977, "rating": 5.0, "text": "Probably the best overall fitness facility in Baldwin county. I’ve tried several other gyms and nothing really compares to the selection of equipment. The staff is also very friendly and helpful! I thoroughly enjoy lifting and swimming here.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "116307715526656136022", "name": "Jessica Ellis", "time": 1598284777128, "rating": 5.0, "text": "Love the staff and instructors!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "113982605433000009787", "name": "Erin Adkinson", "time": 1570470934069, "rating": 5.0, "text": "Great selection of classes. Large and clean facility!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "109451612896501274557", "name": "Ash ton", "time": 1505265414188, "rating": 5.0, "text": "Very military friendly! If you're active military visiting the area, they will give you a free pass for the time you're here. I'd recommend this facility to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "106915007072546626274", "name": "Adam Manning", "time": 1578865905969, "rating": 5.0, "text": "Great facility and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "101686208623848795779", "name": "CHARLES Harris", "time": 1547256640958, "rating": 5.0, "text": "Awesome place to work out . stay fit. I love it , family fitness center.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "108650122943719873601", "name": "Jessica Redditt", "time": 1530302294126, "rating": 5.0, "text": "I use this gym as a visitor and have been very pleased with my experience. Both the staff and other patrons were friendly and helpful to this out-of-towner. I follow a pretty extensive powerlifting and body building program and this gym had almost everything I needed, including a weightlifting platform! I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "114446360632339654883", "name": "Virtual KRMZEN", "time": 1521410763667, "rating": 5.0, "text": "Amazing place to go and work out or just relax in the hottub or swim in the pool! Amazing staff members that are very nice! It's very clean! It's very big and has a lot of room! They have very clean equipment!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "102105983670425585425", "name": "Jim g", "time": 1498097787758, "rating": 4.0, "text": "Great place, much better than downtown. I wish they would post a sign at the entrance and then enforce 10 minutes maximum per machine, no checking emails and texting while lounging on the equipment, chatting and socializing, rather than actually using the weights. The weights are for everyone's use, and using them is what they should be doing. Check your emails, text, and take calls in the lobby area. Thanks for a great place to work out. More fans would be a plus.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "110358103911201668366", "name": "Zachary Dinkins", "time": 1474209419354, "rating": 5.0, "text": "One of the better gyms I've ever lifted at. Nice people there too. I never had a problem with them", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "101555780424778198333", "name": "Robert Holyfield", "time": 1569904914332, "rating": 1.0, "text": "Seen worse. Very crowded", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "114874531213660882482", "name": "Troy White", "time": 1538503447687, "rating": 1.0, "text": "Probably the dirtiest most disgusting gym I have ever been to. My high school locker room smelled better. I don’t think the men’s restrooms have ever been mopped or disinfected. I only see the attendant using a broom and dust pan to cleanup. Wiping off equipment is not enforced. I find all sorts of goodies in the pool (band-aids, lettuce 🤷‍♂️). My wife and I had to say goodbye to our long term membership a few months ago as we just can’t justify the cost of membership vs the amenities. AND the fear of staphylococcus or MRSA. I don’t know how they stay open from a health code standard.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "101472267800518081014", "name": "Brian Brey", "time": 1484342143925, "rating": 3.0, "text": "the people are great but the facility is not up to date. The people running scheduling the classes do a poor job to say the least. the instructors that run the classes are great.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "115676076457971601782", "name": "Rob Whitsett", "time": 1523083083892, "rating": 3.0, "text": "Great gym. Needs to have more maintenance performed on the equipment!!!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "104278571271396281367", "name": "Betsy Smith", "time": 1544140939394, "rating": 5.0, "text": "Friendly atmosphere, helpful staff, variety of classes.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "103972440175282741368", "name": "Trina Swan", "time": 1488667027501, "rating": 2.0, "text": "Plenty of equipment, no parking available during peak hours. Swimming pool is alway inaccessible due to swim leagues. Open for only a short time on weekends.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "102031178748003195697", "name": "Bert Waller", "time": 1502245562066, "rating": 4.0, "text": "Nice, large facilities and decent selection.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "111169139351877772376", "name": "Paul Klutes", "time": 1495318961132, "rating": 2.0, "text": "Okay gym, some good instructors, awful christian music, and a constant stream of Fox News.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "106094082615061403616", "name": "Marissa Ann", "time": 1465684560709, "rating": 3.0, "text": "really needs to stay open till 10 pm", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "108951689435673928304", "name": "Trent McManus", "time": 1461530549624, "rating": 4.0, "text": "Needs to stay open until 10 pm everyday. Needs to get EzH20 water fountains with bottle fillers. Filling a water bottle with a standard water fountain takes ages and doesn't allow you to fill it all the way up because of the angle.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
