{"user_id": "106871101799430229684", "name": "Carol-Ann Stewart", "time": 1616286244221, "rating": 5.0, "text": "Synergy Homecare was the perfect agency to support my dad’s stroke recovery. I needed a little extra help each weekday morning while my dad was on home health and his care giver (Brandon) really helped him gain his strength back.\n\nSynergy was very responsive and very easy to work with, I highly recommend this company.", "pics": null, "resp": {"time": 1617285655380, "text": "Thank you Carol-Ann it was an honor to provide care for your dad."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102407641770590147367", "name": "Delaris Juitt", "time": 1630341899390, "rating": 5.0, "text": "The office staff and caregiver are excellent Connie makes sure to provide the right caregiver to their patients.  Also counsel the caregiver on what the patients need.", "pics": null, "resp": {"time": 1630443795197, "text": "Thank you Ms. Juitt. We appreciate you!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105152836720160835427", "name": "Jan D", "time": 1610993364460, "rating": 5.0, "text": "The caregivers we had were compassionate and loving. Helpful and caring. They took a load off our minds for sure. Synergy was easy to work with, as well. Thank you so much.", "pics": null, "resp": {"time": 1611160937729, "text": "Thank you Jan."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "100953268878880699199", "name": "Tracey Sheets", "time": 1600803322962, "rating": 5.0, "text": "I continue to be impressed by all the staff at Synergy Home Health. Especially Mrs Keisha. I feel like they really care about the patient and as my husband’s caregiver, I feel very supported by Synergy. Everyone has been so nice and helpful. I’m extremely grateful I connected with Synergy.", "pics": null, "resp": {"time": 1600807057799, "text": "Thank you Tracey for your kind words!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "112357443399142504759", "name": "Aleshia Walker", "time": 1571425543312, "rating": 5.0, "text": "Working for SYNERGY has been an extremely positive experience.  The whole organization truly cares about providing quality care and support to each client, and is in this business for all of the right reasons.  They are available 24/7 and work hard to accommodate their clients' scheduling needs.  The office staff truly cares for each client like family and we have wonderful caregivers.  I'm excited to see what the future holds for Synergy HomeCare!", "pics": null, "resp": {"time": 1571428429210, "text": "Thanks Aleshia, we are blesses to have you on our team."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109757023190937385623", "name": "Jenny Hallyburton", "time": 1596589434418, "rating": 5.0, "text": "Synergy has great customer service and the management team has always been helpful. Scott and Lynn are always willing to meet families and answer any questions they may have. I highly recommend this sitter service.", "pics": null, "resp": {"time": 1596650962123, "text": "Thanks Jenny!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "111854529968598824500", "name": "Amy Whittenburg", "time": 1572538859541, "rating": 5.0, "text": "My mother is in late stage Alzheimer's and the caregivers have been wonderful with her.  They are very skilled and have the knowledge to deal with my mom on a daily basis.  They bathe, feed, keep her engaged and love on her.  Could not ask for a better company to take care of my mom.", "pics": null, "resp": {"time": 1572539905188, "text": "Thank you Amy!  We love working with your mom!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101382569584896141318", "name": "T0785", "time": 1596580342498, "rating": 5.0, "text": "Thank you so much for your great care for our patients and staff at Arbor Springs!", "pics": null, "resp": {"time": 1596651018835, "text": "Thank you Taresa!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101637236862186019155", "name": "Nicole Gachett", "time": 1597238908358, "rating": 5.0, "text": "Awesome staff and great welcoming atmosphere upon entry of the office.", "pics": null, "resp": {"time": 1597244129981, "text": "Thanks Nicole, you're awsome!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "108371891602155134744", "name": "Dwayne Long", "time": 1579543108674, "rating": 5.0, "text": "These are some truly amazing people who take  very good measures to insure that you are receiving the best possible care for what is going on and helps you understand all aspects of your care. And it helps that they have a great  attitude and outlook for helping people to understand.", "pics": null, "resp": {"time": 1596651070015, "text": "Thanks Dwayne!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109195218335298633090", "name": "Janine Rumker", "time": 1542733229753, "rating": 5.0, "text": "Right from the very beginning, Shasta from Synergy made us feel welcome and cared for. She was patient and kind with my mother, who recently had a heart attack and had a stent put in. My mother is a caregiver, not used to accepting help and certainly a very proud and private person. She did NOT want any help, certainly not with bathing. Shasta knew just whom to send...Michelle. What a blessing! My mom went from not wanting any help, to wanting to take Michelle with her to her home in Florida! Michelle was so kind and understanding. She did things without being told, was efficient and sweet. I can't say enough good things about our first experience with home care. Thank you so much Synergy!", "pics": null, "resp": {"time": 1542753539473, "text": "Janine,\nTaking care of your mother was such a blessing. Michelle told us many times how much she enjoyed their time together. We wish the best for your mother in Florida and we will miss her.\nThank you again,\nShasta Kromer"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1584158205763, "rating": 4.0, "text": "I have never work there but I heard some good thing's", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "110463180510508467113", "name": "Urica Summers", "time": 1571426576882, "rating": 5.0, "text": "I started with Synergy last year it's a great place to work and the staff is very friendly and the schedules are flexible 😊", "pics": null, "resp": {"time": 1571428245321, "text": "Thanks, Urica!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105536607524898326678", "name": "Gretchen McKenzie", "time": 1565981358160, "rating": 5.0, "text": "I have been working for synergy for two years and I love my job and they’re great people to work with.I give five stars to this awesome company!", "pics": null, "resp": {"time": 1565984793343, "text": "Thank you Gretchen!  We appreciate you so much!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "117152289914272617284", "name": "Erin Carter", "time": 1595974644799, "rating": 5.0, "text": "Great staff and so compassionate!", "pics": null, "resp": {"time": 1596026201190, "text": "Thanks Erin!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "115359726514514132019", "name": "Santrice McClure", "time": 1571425170185, "rating": 5.0, "text": "I start as a caregiver in 2015 when they first open up. I work in the field i absolutely love working for Synergy Home Care and the owners a very understand and i love working with them.", "pics": null, "resp": {"time": 1571428108107, "text": "You are an awesome caregiver."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "116776467660633840740", "name": "Steve Howe", "time": 1623540502726, "rating": 5.0, "text": "It’s rare to have a company who does what they say they are going to do, but we sure did with this company. When they said they would send someone out to get a new caregiver started and trained, they did. When a regular caregiver couldn’t come in they made sure a trained caregiver was there even if it was office professionals (who were former caregivers). They made sure we liked our caregiver and if we had complaints they would take care of it. George (the owner) was so personable and spent a lot of time with us explaining his philosophy on running the most honest, best caregiving experience.  We also enjoyed and appreciated our caregivers for my parents. They worked hard and loved them like their own. If we are ever in the position to need a caregiving service in the future, there will be no doubt who we will use, Your Choice Senior Care.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "105521311697546769366", "name": "Heather Steel", "time": 1616790156292, "rating": 5.0, "text": "I'm very pleased with the service given by Your Choice Senior Care. George and his team are great, and have helped my dad so much. And they have brought me incredible peace-of-mind.  Not only do they bring him breakfast in the morning (he's at Somerby) but they make sure he gets his medicine 3x a day, talk with him (this has helped his speech tremendously) and help him keep up with some of his light chores and ADLs on the days he needs it. We have found them to be super accommodating with last minute changes and requests, and overall very responsive and caring. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111765452972684313246", "name": "Catherine Hales", "time": 1611770989868, "rating": 5.0, "text": "This team is always very responsive in helping our seniors. George and Christina are extremely helpful in making sure prompt and quality care is always available. They are one of the few home care companies that require extended training for those with memory loss. A much needed training in this field!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113963477862069589286", "name": "Debbie Leirer", "time": 1576790533076, "rating": 5.0, "text": "I cannot say enough good things about \"Your Choice Senior Care\" and I highly recommend them to anyone that needs senior care assistance.  They have been a godsent for my father.  They are very kind, caring and patient as well as very professional.  They were always on-time for their appointments with my father.  They assisted and trained my father with taking his blood sugar readings and insulin injections.  They offer a variety of services and you can pick the service(s) that best suits your needs.  Their prices are very reasonable.  If you need a senior care professional for your elderly parent, \"Your Choice Senior Care\" is the first call you should make.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118158288105220348482", "name": "Richard Davidson", "time": 1559942863931, "rating": 5.0, "text": "I highly recommend Your Choice Senior Care for anyone needed help caring for somebody. We’ve relied on Your Choice for well over a year to help care for my 97 year old mother. The company’s owners/managers are conscientious, hard-working, and responsive to our concerns.\n\nOne caveat: the quality of individual caregivers varies considerably, from excellent too awful. The best are more than caregivers; they are friends, both with my mom and my wife and myself. A rare few were bad enough I ordered them to leave and not return. The owners and managers are careful with who they hire, and pass on our instructions for what is expected from the caregivers, but they cannot monitor everything happening in your home.  In the end, it is up to you to determine which caregivers meets your needs and which have to go.\n\nThat said, anytime there has been problem with a caregiver—no matter the time, day or night—the owners/managers have acted *immediately* to correct the problem, including personally caring for my mom until a replacement caregiver was found.  They strive to provide excellent care to the elderly, and their efforts have made it possible for my mom to continue living with us long after she surpassed our ability to care for her by ourselves.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111173524491269581553", "name": "Yvonne Simmons", "time": 1560870714991, "rating": 5.0, "text": "I am helping a friend who lives out of town with his 94 year old Dad.   We chose Your Choice Senior Care about 2 and a half months ago.  Best decision we have made so far.   He has needed 24/7 care up till about a week ago and we cut back to about 10 hrs and the owners helped us figure best times to have the care givers there.\nWe were so lost when we first realized we needed this type care and they took care of everything even down to picking up supplies.  They are so hands on and involved.\nI can go on and on about this being an A+ company!!!!\n\nYvonne", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "117492082925712874149", "name": "Valeria Farmer", "time": 1564659882538, "rating": 1.0, "text": "The 18 yr old they sent to help with my mother wanted to do nothing but sit there and watch tv.  We stopped using them and they keep sending invoices to be paid that we're already paid.  It's been months since we used them, but keep getting invoices each month.  The last conversation i had with them, i was informed they owe me money but here it is the next month and they want me to pay them again!  They owe us no money and we sure don't owe them!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1490797029286, "rating": 5.0, "text": "The care and compassion my mother received from Your Choice Senior care made me want to write a review to tell others. I have a busy life and wanted her to be taken care of by professional and caring people during the day and while I was on vacation. If you're looking for help, give them a call and they can do many things to make your life easier.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOeXsdy8J5-W-2vFBZfPMRJDQllN3twMGr_jj5X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMDKYKgUni8xI-nT_9kqojytoFJu-n9ScAgZEZC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "106762902737563814340", "name": "Jevon smith", "time": 1489425220646, "rating": 1.0, "text": "They sent me out 45 miles..an the facility dint allow male caregivers there to sit with woman...they promise me i would still get my 9 hours on my check..THEY SENT ME 16$..please. Stay away from them", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113695462545965873732", "name": "Leigh Wright", "time": 1490880344064, "rating": 5.0, "text": "They were polite and professional. Definitely made a difficult time easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "100271443291519475830", "name": "Leigh Wright", "time": 1490794533900, "rating": 5.0, "text": "They were friendly and professional. Made caring for my grandmother much easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1553548248356, "rating": 5.0, "text": "Such great people!", "pics": null, "resp": {"time": 1553548502503, "text": "Thank you so much for your kind words! Look forward to seeing Mrs. Chavez next week!"}, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "117277869473223978921", "name": "Kaylee Mendyke", "time": 1603311625590, "rating": 5.0, "text": "The owner of this Senior Helpers, Mrs. Mary, is the most caring and compassionate person I know and truly does so much for her employees and clients. I've been working here at Senior Helpers for about a year and a half and it has been an incredible experience to build a relationship with all of the employees and the clients. I love getting the opportunity to make a positive impact on our client's lives each and every day by keeping them strong, happy, and independent.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "115145217700726132663", "name": "keshia Robinson", "time": 1600429573154, "rating": 1.0, "text": "Well, I enjoyed working for Senior Helpers at the beginning. You get to pick your schedule but the pay is only 8 dollars which is below minimum wage. Im a retired Air Force cop, so the pay wasnt really an issue for me. I wanted the experience since I am majoring in Nursing and I wanted to get a start in the healthcare career field. During my time, the clients were all sweethearts and I enjoyed them. They were the best part of my day. It really hurt quitting because I just love the clients and that is why I stayed. Well, some improvements for the company is as follows: better training, pay for the training, and raise the pay. When I first got to my orientation I asked how many employees they have? I was told over 100, but looking at their open shifts this company turn over rate is high and they dont have enough employees that care. They would send out available shifts but on the app employees had to use for myself  it wouldn't  show that I had available open shifts. The time off that I requested was always for VA (veterans affairs) appointments so my call in's where emergency only. I was always on time with all clients and I gave every client the best treatment, companion care, and respect.\nI dislike the company policies with COVID.  I was schedule to go into the office to do some training. I schedule this on my own because I knew that youtube videos couldnt get me by. I needed hands on training. They lack training. When I confirmed with my boss the time to come in for training I was told by my boss that they are not allowing people to come to the office. She sounded really sick on the phone so I couldnt give you a honest reason why they told employees to stay away. If i had to guess covid. I had called into work last minute for a car issue which i got reprimanded and the second issue was because i needed to make sure a relative didnt have covid because i was around them. I got written up and they told me they would fire me if I called in again. Well. I had to call in again because of covid symptoms. I told the boss if covid symptoms is not a valid excuse for calling into work, then i cant work there. I care about the clients health and if it takes me quitting to protect them I had to. You should not send employees to work or threatened them with termination. Im a hard worker so its really sad to see great people like myself to quit. Lastly, is the driving. I would drive about an 1 hour to get to a clients house. Like i said before I loved the job and I know some caregivers dont do right. They dont clean or take care of the clients like they should. So I stayed because there is not enough good in this work place. All in all it was the company saying I have one more call in and they have to fire me. If im sick i cant be around the elderly. They are vulnerable. They need to rethink their procedures.\n\nNow i dont get unemployment, i cant qualify because i receive the Post 9/11 bill money for school. I cant receive unemployment because i am in school and veterans are not allowed to double dip. Meaning i cant get free money from the Post 9/11 bill and money from unemployment. Like i said before i work because I care.\n\nOn a positive these are quotes I picked up:\n\nThe price you pay for the job you have\n\nCold hands, warm heart, dirty sweetheart\n\nKeshia", "pics": null, "resp": {"time": 1603139866776, "text": "Keshia, we also enjoyed you working for Senior Helpers. We were very proud to have a veteran join our team. The Federal minimum wage is $7.25 an hour. We do pay our employees this for training pay ONLY but once you complete the hiring process and start working with our clients you receive the wage that was discussed during your interview. We do not have a single employee that is working for less than $8.50 an hour. I pulled your check stubs to make sure we did not make a mistake on your pay while you were employed with Senior Helpers and we did not, if you would like  confirmation on your check stubs we would be happy to provide that information to you please just give us a call at our Senior Helpers office (256)650-2982.\nWhen you started working with Senior Helpers we were shorter staffed due to the pandemic and caregivers quitting without notice or calling in for shifts last minute (without COVID-19 symptoms or being in contact with someone who had COVID-19).\nI am sorry you felt we lacked training. We have an entire room in our office dedicated to hands on training that you sat in during our orientation. This training room includes: a medical manikin, hospital bed, shower, shower chair, walker, wheel chair, cane, gait belt, slide board, Hoyer lift, a change of sheets to learn to change an occupied bed, ‘depends’ to practice changing and bathing clients, bed side commode to practice safely transferring clients and more are available to any caregiver who would like additional training to come and schedule a time to practice. We just ask you schedule your time in advance to ensure we have sanitized all materials and your supervisor is available to assist you.\nAs for our COVID-19 policy that you signed and received a copy of in orientation; we ask if you have been exposed or have any COVID-19 symptoms to call the office and we will send you to the nearest clinic to get tested immediately. Your supervisor actually responded to you when you called out with COVID-19 symptoms, “Of course COVID is an acceptable excuse. And are you going to get tested today? If so just send me the paperwork and it will excuse you.” You told us you were going to get tested but you were going to pass on coming back to work for Senior Helpers because you did not like the call-in policy. We respected your decision and removed you from the schedule and just asked as a courtesy for our clients to let us know your COVID-19 test results so we can update them if they need to be tested in the event you tested positive. You responded stating you do not have COVID-19 and have not been exposed therefore they do not need to be tested.\nDuring your interview you agreed to drive up to 30 miles to a client’s home. The furthest you were asked to drive to a client was 25.7 miles and this was not your regular client.\nWe thought you were a great a caregiver to our clients in the short time you worked for Senior Helpers and you are right, you did truly care for your clients which we greatly appreciated. I am sorry you felt the need to quit from a misunderstanding you may have had with the attendance policy. We wish you nothing but the best in the future for your nursing career. And if you have any other concerns, we hope you will please call us at our office (256)650-2982 and we will be happy to address this with you."}, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "106780272926457222795", "name": "Lydia Avery", "time": 1562115265666, "rating": 5.0, "text": "Every care giver that has come to care for my grandmother has been wonderful! She raves about how much she liked everyone that has come from your company! Which isn't always the case with others who have cared for her in the past. I especially appreciate how flexible Senior Helpers has been with being able to find us last minute care when we unexpectedly needed someone. I am SO GLAD we tried Senior Helpers!! You guys are a major blessing to our lives! Finding quality care is not longer difficult or stressful thanks to Senior Helpers!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "114867182327395685485", "name": "april Taylor", "time": 1563572166722, "rating": 1.0, "text": "BEWARE!! I would not recommend getting a job here! I was not able to complete orientation due to family issues. Ended up not taking the job. They refused to pay for that one day and was very ugly over the phone. Hung up on me twice! Not professional at all!!! So glad I did not take the job. Their true colors definitely came out! Reporting issue to labor and board first thing Monday morning!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "103111198269063149400", "name": "Shannon Oakley", "time": 1559845368186, "rating": 5.0, "text": "Senior Helpers has always been so wonderful and easy to work with.  All of their staff is so kind and thoughtful and do a great job every time.  You can always count on them to take care of your loved one and be there for them at all times.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "101393242242184866680", "name": "Crystal Copney", "time": 1560969423663, "rating": 5.0, "text": "I have been employed with Senior Helpers for 6 years now. I really enjoy the company and my coworkers. They are caring and compassionate.  Mrs. Mary is awesome and goes above and beyond for her employees and clients.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "107949723278601060878", "name": "Janet Bentley", "time": 1528002033772, "rating": 5.0, "text": "I am very grateful that a good friend recommended Senior Helpers to me.  They stay in touch with me each week and visit quite often to be sure I am happy with the care I receive.  I do not know what we would have done without their excellent service.", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "103352267172707152175", "name": "Kimberly Kennedy", "time": 1614312264948, "rating": 5.0, "text": "Great company 👍", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "101287508364030747557", "name": "Cathy Dianne", "time": 1518382646216, "rating": 5.0, "text": "Nothing but high praise for Mary, Julie and this wonderful team of caring people.  They helped my family through many tough times over the past many years.  Friendly care and multiple services were provided to my mom and we are forever grateful. FIVE* * * * * STARS!!!!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "106259063835944157730", "name": "Aubrey Smith", "time": 1510624791588, "rating": 5.0, "text": "Senior Helpers is the best home care company out there! Definitely would recommend to everyone!!", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "111795879941166937980", "name": "James Bodie", "time": 1560544814425, "rating": 1.0, "text": "Habitual tardiness, a lack of professionalism, and failure to follow through on timely and important scheduled client care matters makes Senior Helpers a very poor choice for home health care.", "pics": null, "resp": {"time": 1561124839163, "text": "So sorry that we did not meet your expected criteria. We wish you and your family the best of luck in the future. Mary Jackson/Owner"}, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
{"user_id": "103505482398548873642", "name": "Janet Lammers", "time": 1525110700890, "rating": 1.0, "text": "Very disappointing company. If I could give no stars that would be better. 😕", "pics": null, "resp": null, "gmap_id": "0x886212cefb240ae1:0xf5f9c3acb77b2f17"}
