{"user_id": "104234933839882058974", "name": "George Glass", "time": 1621548929410, "rating": 5.0, "text": "Great people at counter", "pics": null, "resp": null, "gmap_id": "0x888e81bb4ef2d179:0x8541a4a147fdcbae"}
{"user_id": "108818400034133832183", "name": "Bob Frick", "time": 1533585436678, "rating": 5.0, "text": "Can't live without them!!\nWe cooling now.", "pics": null, "resp": null, "gmap_id": "0x888e81bb4ef2d179:0x8541a4a147fdcbae"}
{"user_id": "107723271607806336468", "name": "Chuck Brock", "time": 1612881349170, "rating": 1.0, "text": "Very dissatisfied, with the restrictions is hard to do any shopping, they have a small waiting area where service technicians conjugate while they stay behind a barrier", "pics": null, "resp": {"time": 1612969143915, "text": "Dear Chuck, due to an abundance of caution surrounding the spread of COVID-19, some locations are currently practicing Curbside Service only. We certainly hope things get back to normal soon. In the meantime, we do have some additional ordering / pickup tools available at www.bakerdist.com/covid-19. Thank you for your patience and we truly value your business."}, "gmap_id": "0x888e81c1c35f047b:0x9e9f54ab91c2d376"}
{"user_id": "104496377641045176003", "name": "Victor Garcia", "time": 1614033557030, "rating": 1.0, "text": "Says it closes at 5 and they close by 4:30", "pics": null, "resp": {"time": 1614105227048, "text": "Dear Victor, thank you for bringing this to our attention. We had an incorrect closing time on Google; this has now been corrected. We sincerely apologize for this inconvenience and hope that you give us another chance in the future."}, "gmap_id": "0x888e81c1c35f047b:0x9e9f54ab91c2d376"}
{"user_id": "107723271607806336468", "name": "Chuck Brock", "time": 1612916933590, "rating": 5.0, "text": "Great counter service!", "pics": null, "resp": {"time": 1612969074326, "text": "Dear Chuck, thank you for taking the time to leave us this excellent review. We are happy to hear that our counter service is meeting your expectations. Thank you for your business and we look forward to seeing you again soon."}, "gmap_id": "0x889a527404231e47:0xfd08e29b26d60c77"}
{"user_id": "101418607239088731018", "name": "Mike Hayes", "time": 1600784991359, "rating": 5.0, "text": "Great people", "pics": null, "resp": {"time": 1600968839904, "text": "Dear Mike, thank you for taking the time to leave us this excellent review. We will be sure to pass along the kind words to our Mobile team. Thank you for your business and we look forward to seeing you again soon."}, "gmap_id": "0x889a527404231e47:0xfd08e29b26d60c77"}
{"user_id": "109178615236708743892", "name": "Dennis Cosby", "time": 1629320266146, "rating": 5.0, "text": "Our upstairs AC went out on a Friday evening. After a couple of unsuccessful calls to set up a Monday appointment and reading good reviews for Skelton’s I made an online appointment for AM on Monday to repair one unit and service the other two. First thing Monday I got a call the technician was coming. Jeremy was very professional and we were very pleased with his work.\nDefinitely will recommend and use in the future.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109613557666096720829", "name": "Jake Doughty", "time": 1628346575399, "rating": 5.0, "text": "My A/C quit cooling on a Friday evening and I called Skelton’s on-call number. A technician called me back very quickly and was out to fix the issue in a timely manner. Very knowledgeable and up front with diagnosis and repair.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108396730941211418267", "name": "Robert Stewart", "time": 1623452650416, "rating": 5.0, "text": "My experience started when Steve answered the phone.  He was professional, courteous and empathetic. He scheduled my appointment for a tech to arrive within 2 hours of my call. Every minute counts when you're without AC in Alabama in the summer. The tech,  Jeremy, was very friendly,  courteous and professional also. Even more, he was very experienced and quickly diagnosed the issue. Great experience. My recommendation would be to HIRE these guys,  you won't be sorry!", "pics": null, "resp": {"time": 1623764235110, "text": "Happy to help Robert! Your right - in the heat of Alabama AC is KEY!! Thank you for your 5-star rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113238519796197961282", "name": "Suzanne Mattox", "time": 1621644120312, "rating": 5.0, "text": "Our AC stopped working Thursday evening. We tried calling several repairmen Friday morning, and no one responded or said that they couldn't do it until next week. Our house was too warm inside and uncomfortable, and we were not looking forward to dealing with heat this coming weekend especially when high temps are in 90s. My husband found this business through the Internet and he contacted them, and they quickly responded. Jacob, one of their technicians, showed up at our house 30 minutes later!  He was able to repair it by replacing a part. He was honest and professional. And, it was affordable to get it repaired!  We were very pleased!  😀", "pics": null, "resp": {"time": 1622662415149, "text": "We appreciate your 5-star rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100754383618091677544", "name": "Donald", "time": 1627422789769, "rating": 5.0, "text": "Kevin Keith did a superb job of analysis, servicing and maintaining of my systems using the most modern tools and techniques. His knowledge, equipment and dedication to his work are first rate.\n\nKurtis and his team did an excellent job of installing my new HVAC system.  The installation correctly included the use of a vacuum pump and the installation of a liquid line drier.  Then the system was very carefully charged with refrigerant and thoroughly tested.", "pics": null, "resp": {"time": 1625590385060, "text": "Thank you for your positive review and rating Donald!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114938079906404629408", "name": "Alan Cashion", "time": 1620340214419, "rating": 5.0, "text": "Everyone that has come out to do maintenance on our system or do any kind of repairs have all been very nice polite and efficient in their work. They also do not leave any kind of mess around for the homeowner to clean up. If you have a problem that you can’t explain to them on the phone they will send out their service manager named Chad Vick. I have also been in contact with Tony who is the one that laid out the system for our new home and he is very knowledgeable about everything that he does.", "pics": null, "resp": {"time": 1566570641450, "text": "Thanks for the 5 star review Mr. Cashion!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112991357234650589122", "name": "Chris Zaragoza", "time": 1626455187651, "rating": 5.0, "text": "1st time use Skeltons and service was great. The technician, Lee, was great to work with. On time service and fixed problem quickly at fair price. Will definitely use again.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103645168137595314536", "name": "Jennifer Hope", "time": 1622032776619, "rating": 5.0, "text": "Skelton’s is the best! My AC went out and I was so hot and miserable. They sent a tech named John who quickly got my AC back up and running. Thank you so much for the great quality  and professional service!!\n~ Jen", "pics": null, "resp": {"time": 1622662379568, "text": "Thank you for your kind words and your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100040071512836423385", "name": "Bill Simpson", "time": 1627520586445, "rating": 5.0, "text": "The Skelton HVAC serviceman (Jacob) has conducted an extremely thorough Fall and Spring maintenance inspection/service for the past 7 years. He is very customer focused and has demonstrated a keen attention to detail which has kept our system operating at peak performance. I couldn’t ask for better service and support for my HVAC company and appreciate the quality employee that they have provided!", "pics": null, "resp": {"time": 1628179642171, "text": "Thank you so much for your kind words. We strive to be the best and provide the best service in the area. Thank you for noticing!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112749896020415780534", "name": "Charlie Williams", "time": 1627827383769, "rating": 5.0, "text": "Tech came out at 9:00 pm on a Saturday and fixed our AC.  Service was quick and house was cooling within the hour.  Would definitely recommend Skeltons.", "pics": null, "resp": {"time": 1628175355714, "text": "We appreciate your 5-star rating! Glad we could get your system back up and running for you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103871690960148927629", "name": "Sheila Murphy", "time": 1627488718788, "rating": 5.0, "text": "I was very pleased with the service I received from Skelton’s. Everyone was professional courteous and efficient. You want quality this is what you will get at the highest level", "pics": null, "resp": {"time": 1625590008625, "text": "We appreciate your kind words and your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107385709664691159569", "name": "Joe Glazier", "time": 1622562273597, "rating": 5.0, "text": "Our older unit stopped heating in the dead of winter, just when temps were about to plummet.  Skelton's sent out a repair person to try and get us back going, but the unit's heating coil had burned up.  It was time.  The staff at Skelton's were on site the following morning with a new unit and had it up and running in no time!  These are first rate people who stand behind their products and workmanship!  Skelton's has all of my future business - no questions asked!", "pics": null, "resp": {"time": 1622660738566, "text": "Thanks for the five-star review! Happy we could help and we look forward to serving you more in the future. Have a great day!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113830565702028843640", "name": "James Dailey", "time": 1616179266604, "rating": 5.0, "text": "Shelton Heating & Cooling performed an excellent job in servicing my heat pump today. The technician was on time. The job that he performed was excellent. He kept me informed about his progress. I was provided and estimate of the chargers for my approval before the work started.  I have used their services in the past and plan to use them as needed in the future.", "pics": null, "resp": {"time": 1618428857903, "text": "Thank you for the 5-Star review Mr. Dailey! We appreciate you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110791700092129287081", "name": "Elizabeth Politz", "time": 1623770380643, "rating": 5.0, "text": "Very professional and courteous.  Arrived on time and gave me an estimate of the cost…would definitely recommend Skelton’s to family and friends.", "pics": null, "resp": {"time": 1623790623543, "text": "We appreciate your recommendation and positive review!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100450409473775760646", "name": "Raymond Butler", "time": 1627055192562, "rating": 5.0, "text": "Very good service. Technician was friendly, professional, and thorough and explained all he was doing.", "pics": null, "resp": {"time": 1628182384588, "text": "Thank you for the 5-star rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110709537677724893441", "name": "SHIRLEY NEELY", "time": 1623835424010, "rating": 5.0, "text": "Kurtis and mark were great! They did a great job on the installation of a new heating and a/c system.", "pics": null, "resp": {"time": 1624459782791, "text": "We appreciate your positive review Shirley!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101060659672192420302", "name": "Leigh Anne Tucker", "time": 1625541625532, "rating": 5.0, "text": "I’ve used Skelton Heating and Air for years to do routine maintenance and now to replace my AC. They came out within 3 hours when my AC went out. I highly recommend contacting them for your HVAC needs.", "pics": null, "resp": {"time": 1625583435627, "text": "Happy to help! We appreciate your dedication to Skelton's! Thank you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105250307383042460259", "name": "Chris Robinson", "time": 1626375613679, "rating": 5.0, "text": "It was honestly a really great experience from start to finish. My wife met with Cason and we went into wanting multiple options which i thought were all fairly presented and well explained without any pressure of which to go with. I have a close friend who worked for many years for both Trane and Carrier with many of the dealers throughout Birmingham. He gave me a list of 3 companies he would have out to his home personally. Skelton was one of those, another company that i liked very much, and then one we didnt have a great experience on the quote with. Between Skelton and the other competitor, although Skeltons price was higher we were sold by the labor warranty and some of the other written guarantees, along with the rec from our friend. Installation - I believe it was Mark, my wife was the one on site - went way better than i could have imagined. We arranged last minute to have the unit moved to a new location. All of the work was very well done. I had an idea in my head of what \"the aftermath\" should have looked like and the equipment involved in the move and all that, and i probably would have been satisfied with a lot less. Its obviously a lot of money for most families, so I was bound to have some mix of buyers remorse and hesitation about whether or not we'd gone with the right people However, when i got home and saw the quality of the work, how neatly and efficiently and professionally everything was done, i immediately felt entirely confident in our decision and knew we had some true professionals out at the house. I think its the first time in my life ive spent that much money on something and dont have any regrets or second guessing about who we chose to spend it with. Kudos to both Cason and Mark's teams. Thanks yall!", "pics": null, "resp": {"time": 1626445735393, "text": "Thank you so much for your kind words! Our technicians have our customers satisfaction in mind and we are happy they were able to meet your needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110207991883127480009", "name": "Kayla Ingram", "time": 1627694408175, "rating": 5.0, "text": "Jacob was on time, professional, and extremely helpful. He replaced the HVAC compressor and answered all of my questions about the process.", "pics": null, "resp": {"time": 1628178665262, "text": "We are happy to hear our tech was able to help you out. Thank you  for your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100069008516993453999", "name": "Jermaine Dates", "time": 1621633034777, "rating": 5.0, "text": "After calling 5 different companies 3 didnt answer the other 2 cldnt get to me until next week, I saw and called Skelton's Heating and cooling. Not only did they answer they sent a guy out in 30 minutes.  Jacob Avery arrived on time diagnosed the unit in 5 minutes and had my family enjoying cool air within 30 minutes. He was professional and friendly. Skelton Heating is a life saver I recommend them to everyone.", "pics": null, "resp": {"time": 1622663087979, "text": "Glad we could help you out Jermaine!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103942017517386847333", "name": "Jim Garner", "time": 1623703040062, "rating": 5.0, "text": "Jeremy did a great job. Informed me what he was doing and why. Super service!!!", "pics": null, "resp": {"time": 1623763616704, "text": "Thank you for your 5-star rating Jim!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115800126638616923100", "name": "Leah Harry", "time": 1611172043477, "rating": 5.0, "text": "Skelton's does a fantastic job in taking care of their customers. We have used Skelton's for years and have been impressed with their overall customer service. Today, Ethan McCormack came out to repair a motor on our unit. Ethan is friendly, efficient and always takes time to answer questions if we have them. He is professional and courteous. Thank you to Skelton's and Ethan for your service!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110672710340873222514", "name": "Pat Floyd", "time": 1622050731493, "rating": 5.0, "text": "Came out same day I needed their service. Not only fixed my HVAC but also educated me on the problem and how to prevent in the future. Professional and affordable. Wont use anyone else but Skelton’s in the future.", "pics": null, "resp": {"time": 1622661777403, "text": "We appreciate your business Pat. Thank you,"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115230546264107342142", "name": "Cheryl Williams", "time": 1619209864352, "rating": 5.0, "text": "They are always on time and go out of their way to help out when my equipment has to be repaired. Always polite and do a great job!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116346841549156904251", "name": "Thomas Attard", "time": 1616776803061, "rating": 5.0, "text": "Skelton’s technician, John, was phenomenal — highly professional, knowledgeable, and courteous. Great job, guys. Really appreciate the fine work! ... Tom A.", "pics": null, "resp": {"time": 1618428834235, "text": "Thank you for taking the time to leave us a review. We appreciate your service and are happy that you had such a great experience."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103849528593852532317", "name": "Judy Dunham", "time": 1624034390807, "rating": 5.0, "text": "Jason was so thorough and prompt pula very polite and professional.", "pics": null, "resp": {"time": 1624458990160, "text": "We appreciate your 5-star rating! Thank you for you business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103562619545543710542", "name": "Tony Uptain", "time": 1626530696525, "rating": 5.0, "text": "The technician arrived on time and was friendly. He discovered the problem, fixedit, and showed me the faulty part and explained how it worked.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101342294153984529118", "name": "Jordan Travis", "time": 1611171627625, "rating": 5.0, "text": "On Time Service is excellent. Our technician Ethan is super responsive and is eager to get the work completed in a very timely manner! Keep doing what you’re doing.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109513921484023349556", "name": "Maria Chinovsky", "time": 1604427112152, "rating": 5.0, "text": "My neighbor recommended Skelton's. They were quick to respond to my request for help when my heating system wouldn't work. Kevin, the technician, was very polite and considerate, and he repaired the system so that we can be toasty warm. He explained what he did and what repairs and maintenance were done. He also suggested maintenance options to keep the cooling/heating system operating.\nThanks to Skelton's and my neighbor for the recommendation.", "pics": null, "resp": {"time": 1604436701957, "text": "Ms. Chinovsky, we are so happy Kevin & the team were able to help you get heat quickly! Please let us know if you need anything else!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110246081185927915712", "name": "Cameron Hayes", "time": 1621882922928, "rating": 5.0, "text": "Great experience - in and out and very responsive to my phone calls!", "pics": null, "resp": {"time": 1622662849342, "text": "We appreciate your 5-star rating."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105068157272596149777", "name": "Lisa BamaFan", "time": 1599563392104, "rating": 5.0, "text": "Skelton’s has repaired my HVAC in the past, and more recently they have replaced my unit. I’ve been more than pleased with this company. They are prompt and professional, and they don’t run a scam like other companies. They don’t pull up later with backup to market their services you may not need, unlike another company I considered using.\n\nI highly recommend Skelton’s, and they will forever be the only company I call upon for my HVAC services. Thank you all for helping me out so quickly!", "pics": null, "resp": {"time": 1599571637390, "text": "Thank you Mrs. Lisa. I am glad that we were able to help you! Please let us know if you need any thing else."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104066549914504443781", "name": "Raven McMurry", "time": 1615596206006, "rating": 5.0, "text": "Skeltons's came out today to give us a professional opinion and estimate of what type of heating & cooling system would be best for our mobile home. Cason took time to inspect the system we do have, ask pertinent questions, and most importantly, took his time to explain literally everything! He thoroughly answered EVERY question I had and even had the detailed estimate ready before he left the property! We had previously reached out to a few other companies for the exact situation,\nNONE of them went to the extent that Cason did when he was here, not even close. Very pleased with this business all around and look forward to doing business with them!", "pics": null, "resp": {"time": 1618428877316, "text": "Thank you for choosing Skelton's Heating & Air! We are very happy you had a great experience!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108296099223852444932", "name": "Gil Covey", "time": 1627684803355, "rating": 5.0, "text": "Problem solved, blowing ice cubes, nice and cool.", "pics": null, "resp": {"time": 1628178543832, "text": "Happy to hear your nice and cool! Thank you for your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115909880043813314787", "name": "Theresa Rowell", "time": 1620161820630, "rating": 5.0, "text": "Prompt, courteous and professional. They will be servicing my HVAC from now on!", "pics": null, "resp": {"time": 1621531324778, "text": "Thank you for your 5-star rating Theresa!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112354368188583845354", "name": "Bob Nicholson", "time": 1625607315887, "rating": 5.0, "text": "Got the job done quickly and professionally", "pics": null, "resp": {"time": 1626447883848, "text": "Thank you for your 5-star rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110147692565649447934", "name": "Duck Haywood", "time": 1616798769108, "rating": 5.0, "text": "One day after extensive storm/tornado damage in area, I called at 3 pm and by 530 the cold air was blowing.  Great service and covid protocol by tech John.  This is why I have used Skelton for years and no groupon or telemarketer will sway my business! Thanks from Harpersville!", "pics": null, "resp": {"time": 1618428833561, "text": "Thank you for taking the time to post a review. We appreciate your business and are happy that we could help."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103628186880132077115", "name": "Jared Witherington", "time": 1602526071997, "rating": 5.0, "text": "From start to finish the service was great! John called and was able to work me in earlier than my appointment, which was great. He was friendly, professional, and had us up and running in no time. The price was reasonable and there were no upselling tactics used despite having and old unit. We will definitely call on Skelton’s again.", "pics": null, "resp": {"time": 1608304266087, "text": "We are happy to know John was able to take great care of you. Thanks for choosing us for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106043305844210609872", "name": "Vicki Williams", "time": 1621023138395, "rating": 5.0, "text": "The tech  called to inform me he was on the way. He arrived on time and serviced the air condition. He wore his mask.", "pics": null, "resp": {"time": 1621467631767, "text": "Thank you for your positive review Vicki!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116515205228955713105", "name": "Jeffrey Chick", "time": 1627398722294, "rating": 5.0, "text": "Always happy with them and highly recommend them!", "pics": null, "resp": {"time": 1628182308112, "text": "Thank you for the 5-star rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101389529870583554902", "name": "Gordon Bellamy", "time": 1619046195701, "rating": 5.0, "text": "High quality service, honest, friendly and great value!", "pics": null, "resp": {"time": 1592917745609, "text": "Thank you for the excellent review! We look forward to working with you for all of your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114562892935189929486", "name": "Kim Heath", "time": 1607009208694, "rating": 5.0, "text": "I have an older unit but Jacob came out and was able to repair. He was awesome! I would definitely recommend Skeleton's!", "pics": null, "resp": {"time": 1607029038765, "text": "We are so happy that we were able to repair your unit for you. Thank you for your kind words and great review. If there is anything else that we can do for you please let us know."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103752484556266306902", "name": "Cathy Graham", "time": 1607652296818, "rating": 5.0, "text": "I highly recommend Skeleton’s Heating and Cooling . They were fantastic!!! Very nice, helpful and professional. They worked constantly from the time they arrived at my house until the job was completed . Great job!!!", "pics": null, "resp": {"time": 1607697263720, "text": "Thanks so much for the review, Cathy Graham! Feel free to text this number any time and we'll respond ASAP."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109099918586522584487", "name": "Candi Daugherty", "time": 1594405576455, "rating": 5.0, "text": "John is very professional, knowledgeable and a real asset to your company. In addition, such a genuinely nice person.  I really appreciate the details being explained to me in a way that was easy to understand.  Danielle took great care of me when I called as well, and I received an appointment the same day.  Great Company + Great Employees = A “Win Win!”", "pics": null, "resp": {"time": 1608304358774, "text": "Ms. Daugherty we are happy to know that John and our team provided a great experience for you. Please let us know if you need anything else!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115699025332212724946", "name": "Harold Floyd", "time": 1607445972609, "rating": 5.0, "text": "The experience with Skelton was AAA throughout.  The phone personnel were friendly and very helpful.  When I changed my request from replacement estimate to repair due to medical situation, they didn’t miss a beat.  The technician arrived and was courteous and totally efficient.  They were to replace a control panel for over $200 less than a competing service without trying to upswell us.  Overall the service was excellent+++.", "pics": null, "resp": {"time": 1607529438123, "text": "Thank you for the wonderful review. We are so happy to hear that we were able to help you. If you ever need anything in the future please let us know. Thank you again for the kind words."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111925802928479182378", "name": "Amy Albers", "time": 1602283100937, "rating": 5.0, "text": "A/C stopped working right before noon today and we could not be happier with the response Skelton's staff delivered.  They were very quick, affordable, and understanding to our needs.  Thanks to Jacob for a job well done.  Skelton's saved the day!!", "pics": null, "resp": {"time": 1602513233638, "text": "Thank you for the excellent review! We are happy that Jacob was able to assist and get you up and running quickly! Let us know if you need anything else!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100027091382979804987", "name": "Kim Reese", "time": 1595329537014, "rating": 5.0, "text": "Great experience. The staff was highly responsive and courteous.  They made me feel assured that we were going to be taken care of. They updated me frequently on arrival time. The technician was conscientious (masked up and shoe booties)  and clearly knowledgeable as he was able to diagnose and repair within a pretty short timeframe. Highly recommend.", "pics": null, "resp": {"time": 1595340170749, "text": "Thank you, Ms. Reese for the wonderful review and that you had a great experience with our staff! We appreciate you choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102382735407885036062", "name": "Al Watkins", "time": 1607725813085, "rating": 5.0, "text": "Excellent service. Have used them for many years. They get the job done and keep the equipment up. One dealer and product you can trust. Take it from me.", "pics": null, "resp": {"time": 1608739710579, "text": "Mr. Watkins, thank you for leaving such a kind review. We appreciate your business. Merry Christmas!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101399362465639847217", "name": "Louis Dina", "time": 1588866313489, "rating": 5.0, "text": "Skelton's Heating, Cooling and Refrigeration just installed a new AC, furnace and air handler in our upstairs attic (difficult job getting it all in an our up a set up rickety pull-down stairs). They were responsive, polite, respectful, did a quality job, were on time and professional in every way. They did a great job cleaning up, like they were never here. They also use Trane equipment which is good quality and highly rated. Their prices were competitive and they did great work. I'm hard to impress, but they impressed me. Thanks for the great job. Oh yeah, 10 year warranty on parts and labor is standard if you pay cash.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112997915196217506150", "name": "Rance Pearce", "time": 1596562310291, "rating": 5.0, "text": "Very happy with Skelton’s. They came out today and installed a new 3 unit. They were very polite and very helpful. I would highly recommend them to anyone. They have one happy customer 😂😂", "pics": null, "resp": {"time": 1596651072148, "text": "Mr. Pearce, thank you for choosing Skelton's for your new install. We appreciate your recommendation!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112722145728480295212", "name": "Andy Widener", "time": 1593471786709, "rating": 5.0, "text": "I don’t write reviews but these guys are really professional. On time; nice tight work; the installers took pride in their work & cleaned up afterward. Salesman was clear, precise & brief - no wasted time “up-selling”. We got what we needed & got it installed quickly - less than 3 hours.\n\nI was surprisingly pleased (as I am usually cynical about such endeavors).", "pics": null, "resp": {"time": 1593522800240, "text": "Mr. Widener, thank you for the excellent review. We are pleased to know that you had a great experience using Skelton's for your HVAC install!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107666354357612948475", "name": "Michelle Gigis", "time": 1595014026863, "rating": 5.0, "text": "Excellent experience with Skelton's! The technician was very thorough and discussed all the options with me. He was professional and extremely knowledgeable. This is now my go to company for all of my heating, cooling and refrigeration needs. I highly recommend!", "pics": null, "resp": {"time": 1595017635300, "text": "Ms. Gigis, thank you for taking the time to give Skelton's an amazing review! We strive to give our customer's an excellent experience and are happy to hear that you were pleased!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104160777084573785436", "name": "David Reed", "time": 1595435284601, "rating": 5.0, "text": "Great maintenance service for the money and worth it to prevent unplanned downtime. Very methodical in their service and you need to take care of your 5-10k$ investment so it can take care of your family! No pushy sales games and they take care of your property.", "pics": null, "resp": {"time": 1595453240050, "text": "We appreciate you choosing Skelton's Heating & Air, David! So happy you are letting us take care of your investment. Let us know if you need anything!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112937939387728023737", "name": "Patrick McDonald", "time": 1591899258581, "rating": 2.0, "text": "I had scheduled an estimate on Wednesday, June 10 8-9 a.m. Estimator showed up on Thursday, 8 a.m. to perform the estimate. Estimate was done without measuring, or even going under the house. I have zero confidence that the estimate is accurate; I felt like the estimator was simply seeing how much he could get out of me. No detail on the estimate i received. Just got the total dollar figure that seems about 3x higher than it should be. With the time he spent, he really pulled the numbers out of his hat (or some other place).", "pics": null, "resp": {"time": 1591908555465, "text": "Thank you Patrick for your feedback. We are very sorry that your recent experience was not a pleasant one. We strive to provide great service and when we fall short of this we try to do everything we can to resolve the issue. Again, we sincerely apologize for the inconvenience and hope you will give us another chance to make things right. Please give us a call at 205-991-5878 and ask for Chad."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103692524097592145603", "name": "Jerri Day", "time": 1611363393683, "rating": 5.0, "text": "They were fantastic. I can't recommend highly enough.", "pics": null, "resp": {"time": 1611601223467, "text": "Thank you for choosing Skelton's for your HVAC needs! We appreciate you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115472871650137825872", "name": "veta christy", "time": 1624977127516, "rating": 5.0, "text": "Excellent service fast, knowledgeable technician", "pics": null, "resp": {"time": 1625591122611, "text": "Thank you Veta! We appreciate your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104380350742993977822", "name": "Debbie Godwin", "time": 1596465098948, "rating": 5.0, "text": "I had a great experience. The tech was knowledgeable and answered all my question. Very professional. Will definitely use them again.", "pics": null, "resp": {"time": 1596651027058, "text": "Ms. Godwin, thank you for the review! We appreciate you choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106241380685744418869", "name": "terry nauert", "time": 1620150327871, "rating": 5.0, "text": "john service tech outstanding and professional", "pics": null, "resp": {"time": 1621530950630, "text": "thank you for the positive rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104594159687469126628", "name": "Jaynn Kushner", "time": 1606966410152, "rating": 5.0, "text": "We’ve relied on Skeltons’s for all of our heating and air conditioning work for several years and have always received excellent and timely service. Can’t imagine using another company!", "pics": null, "resp": {"time": 1607028968480, "text": "Thank you for the wonderful review and kind words. If there is anything else that we can help you with please let us know."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107145466222942914998", "name": "Ty Proctor", "time": 1594823085541, "rating": 5.0, "text": "John R. was on time, polite, and very knowledgeable. He went the extra mile by looking for the source of the problem that would give long term benefit instead of just a quick patch. He was honest and had my best interest in mind.", "pics": null, "resp": {"time": 1594904887136, "text": "Thank you for the excellent review, Mr. Proctor! We are happy that you had a great experience with our technician John and choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108348513966312136160", "name": "Lee Morton", "time": 1616795104970, "rating": 5.0, "text": "We have complete confidence in Skelton’s and appreciate always having the same technician perform our semi-annual maintenance.  Jacob is the absolute best!  We have three HVAC systems and each one stays in great operating condition thanks to Jacob.  Highly recommended.", "pics": null, "resp": {"time": 1590614904238, "text": "Glad to hear you had another great experience Mr. Morton! Thank you for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115588817612991668977", "name": "Rebekah Rogers", "time": 1591207842979, "rating": 4.0, "text": "Overall the best experience I've had with a heating/cooling company. I thought we had a big issue but our coils just needed cleaning. They could have easily confirmed the issue I thought and charged me for a needless repair but they didn't, which I see as being honest. The receptionist was friendly and professional; my only issue was that I told her I wouldn't be available before 2pm and the technician was there well before 2pm. But otherwise a very good experience! Definitely will be using them again.", "pics": null, "resp": {"time": 1591282520720, "text": "Thank you for the great review and choosing Skelton’s Heating and Air as your service company. I apologize for the technician arriving a little before 2 if it was an inconvenience to you! Again, I am greatful for you choosing Skelton’s and the overall experience was excellent!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116170674685664411883", "name": "jorge rodriguez", "time": 1593097593847, "rating": 5.0, "text": "I called skeletons on Wednesday to fix my thermostat they send a technician there the next day to diagnose the problem. The technician arrive on time and he found the problem in less than five minutes. He Answer all my  questions. If you looking for a good reliable company call Skelton’s You won’t be disappointed", "pics": null, "resp": {"time": 1593101404391, "text": "Thank you for taking the time to leave a wonderful review and that we were able to promptly solve your hvac needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115811431152632136164", "name": "Mat Whatley", "time": 1597951298759, "rating": 5.0, "text": "They were on time and very professional! Got the service completed in a timely manner and set up the return visit for to repair the compressor that had gone bad. Excellent work and service!", "pics": null, "resp": {"time": 1598995177128, "text": "Thank you for the wonderful review, Mr. Whatley! We appreciate your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101631947521459302561", "name": "kimberly howard", "time": 1599959201016, "rating": 5.0, "text": "Great, checked everything and fix my air conditioner in one visit,had another company out three times and could not do what skeletons did in one, great company", "pics": null, "resp": {"time": 1600088961200, "text": "Thank you for the wonderful review! We are happy to hear that we were able to take care of your HVAC!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108320481569023729541", "name": "Rodney Battles", "time": 1596835393563, "rating": 5.0, "text": "Very polite and professional. Quick response. Will definitely use them in the future.", "pics": null, "resp": {"time": 1597067679676, "text": "Thank you for the exceptional review, Mr. Battles & for choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110405031593104215584", "name": "Sharon Jackson", "time": 1623717695591, "rating": 5.0, "text": "Great service, professional and personal", "pics": null, "resp": {"time": 1623763326190, "text": "Thank you Sharon! We appreciate your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107088418089223836780", "name": "Richard Wade", "time": 1590609475813, "rating": 5.0, "text": "Dispatcher called to see if a technician in the area could come a day ahead of the scheduled service appointment.  Technician arrived soon after and very quickly got to work and completed service which included adding freon to system and replacing filter.  Service charge was very reasonable and work was performed thoroughly, neatly and quickly.  Technician was very knowledgable and provided information on his procedure and details for a potential system replacement quote.\n\nI am a return customer and have always had great experiences with Skelton.", "pics": null, "resp": {"time": 1590614988938, "text": "Thank you for the great review Mr. Wade! We appreciate your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103518334877415244784", "name": "Barry Clay", "time": 1604276213929, "rating": 5.0, "text": "Excellent technitions,  clean, courteous and knowledgeable.  Highly recommend this company.", "pics": null, "resp": {"time": 1604331564221, "text": "Mr. Clay, thank you for the excellent review! We are happy to hear you had a great experience with the Skelton's crew!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107872621142370293978", "name": "Hunter Youngblood", "time": 1616796448428, "rating": 5.0, "text": "Such a great response time in getting out to get our air fixed. Very professional and friendly and did an amazing job! This is certainly who we will use from here on out.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114523707118486191658", "name": "Logan Swanner", "time": 1592494769327, "rating": 5.0, "text": "Highly recommend Skelton’s. Called to get a quote and Brian was out the next day. He went through the house and explained everything that would need to be done. We agreed to terms and got a date set. The day of the install, the guys showed up early and got to work right away. They did very clean work and I would use them again.", "pics": null, "resp": {"time": 1592519261479, "text": "Thank you for the great review Mr. Swanner!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110963783348882128263", "name": "Zuomin Chen", "time": 1597716348927, "rating": 5.0, "text": "Jonathan thoroughly checked the furnace, capacitor, Freon level, and other parts of hvac. We are very satisfied with his professionalism!", "pics": null, "resp": {"time": 1597756050883, "text": "Thank you for the exceptional review! Thank you for choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102072298716037752770", "name": "veta christy", "time": 1575719518283, "rating": 5.0, "text": "Always knowledgeable and eager to get the job done right. Very pleasant and considerate technicians who do little things like making sure the were shoe covers so they don’t track mud in your house. Wouldn’t use anyone else", "pics": null, "resp": {"time": 1575910221499, "text": "Thank you for the review Veta! We appreciate that you choose Skelton's Heating & Air for all of your HVAC needs."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117366626437911768446", "name": "Chanda Bowling", "time": 1604509824120, "rating": 5.0, "text": "The service person was very polite and explained everything to me.", "pics": null, "resp": {"time": 1604522161718, "text": "We are happy to hear that our service technician was able to take great care of you! Thank you for choosing Skelton's & let us know if you need anything else!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "118295838042738968936", "name": "Michelle Copeland", "time": 1588255734547, "rating": 5.0, "text": "I did my homework and found Skelton to be not only the least expensive, but they were so helpful, on time, cleaned up after completing the job and hauled away the old unit for me. Kevin is outstanding! He explains everything and lets you know exactly what to expect! I would recommend Skelton all day long!!! Thanks guys... and girls! You rock!!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105136132449633408474", "name": "Jamey Sorgee", "time": 1595963365732, "rating": 5.0, "text": "Everyone at skeletons was extremely professional   and did exactly what they said they were going to do would definitely recommend skeletons to do work.", "pics": null, "resp": {"time": 1596055431135, "text": "Mr. Sorgee, thank you for choosing Skelton's for you new unit replacement! We appreciate you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "118105980183792850563", "name": "Louis Dina", "time": 1568306138085, "rating": 5.0, "text": "My 15 year old AC unit was recharged about 5 weeks ago. When it stopped working again, I assumed all the Freon leaked out again and that it needed replacement. I asked Skelton’s to give a quote on a replacement unit. Their technician was very thorough and discovered a bad switch and capacitor, which he replaced on the spot. He checked our Freon levels and said they were still perfect. His extra effort and honesty saved us from having to buy a new unit at this time, even though he could have easily convinced me we needed a new unit. (Two other companies also provided quotes on new units, but neither of them discovered the underlying issue.) Honesty and integrity, and a desire to serve the customer’s best interests, are important to me. Skelton’s proved it by their actions. When it is time for a replacement AC system, I’ll call Skelton’s.", "pics": null, "resp": {"time": 1568323895929, "text": "Thank you for sharing your experience! We appreciate the review and your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111424208857712007570", "name": "Connor Vintson", "time": 1591817338188, "rating": 5.0, "text": "Can’t recommend this company enough. David went above and beyond to make sure the problem was fixed. They work fast and are VERY trustworthy. 5 stars.", "pics": null, "resp": {"time": 1591823862628, "text": "Thank you Connor for the wonderful review and for choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105705538767177781902", "name": "Rod Cude", "time": 1573518015588, "rating": 5.0, "text": "I depend on Skelton’s to keep my old unit running reliably. Their team does a thorough inspection and cleaning of my system every spring and fall and let’s me know if anything may need tweaking. No pressure tactics, just good people doing a good job and giving options should you want them.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115228666947882667905", "name": "joseph Leftwich", "time": 1593096681164, "rating": 5.0, "text": "Service rep was extremely courteous and professional at all times.  We would not hesitate to use this company again.", "pics": null, "resp": {"time": 1593101632793, "text": "Thank you for the excellent review and choosing Skelton's Heating & Air for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114608032885342585949", "name": "Lisa Craven", "time": 1618258537798, "rating": 5.0, "text": "been using them for years...that says it all.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109821173131893844670", "name": "Kristi Merritt", "time": 1591998725506, "rating": 4.0, "text": "I bought a package unit 6 years ago and recently had a maintenance visit where they did a good job.", "pics": null, "resp": {"time": 1592066132245, "text": "Thank you for the review Kristi! We appreciate your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106040955392018789049", "name": "Luke Hartsfield", "time": 1572992566291, "rating": 5.0, "text": "Skelton’s installed my systems in 2013 and have been the only one’s to service twice annually. Always polite and professional leaving everything nice, neat and clean. David was here today and took good care of all. Super polite! Great company. When my Trane’s run off the track, I’ll call them again.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113189373110606315025", "name": "Claudean Hill", "time": 1621875145449, "rating": 5.0, "text": "Wonderful company.", "pics": null, "resp": {"time": 1622662829701, "text": "Thank you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106944884724636886622", "name": "atf brace Black", "time": 1595272332726, "rating": 5.0, "text": "Jacob was here before time solved our problem my mom has Air Cond. Again... Thank u Jacob & everyone at SKELETONS HEATING,COOLING..\nBETTY BLACK", "pics": null, "resp": {"time": 1595277272695, "text": "Thank you for taking the time to leave and excellent review, Ms. Black! I'm so happy to hear that Jacob was able to take care of the issue quickly and efficiently!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111353276282008520321", "name": "Joan Ludwig", "time": 1587651168381, "rating": 5.0, "text": "Johnathan was very polite, answered all my questions, was very conscientious of neatness & leaving everything like he found it.  He kept me informed at all times!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114963888782889729594", "name": "Benjamin Hedden", "time": 1576185642359, "rating": 5.0, "text": "Great service, came on the same day to give me an estimate, very honest and straight forward. I personally appreciate when they let you know about the fee involved with getting an estimate instead of being surprised. Will use them again!", "pics": null, "resp": {"time": 1576242274779, "text": "Thank you for the review Mr. Hedden! We appreciate you sharing your experience with us."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104056611870220856365", "name": "Andrew Kallus", "time": 1560270747589, "rating": 5.0, "text": "Brian, sales, was excellent and very knowledgeable and set expectations.\n\nThe two guys who came and performed the installation were very professional. Came on time, great work with no issues, and cleaned up and hauled old equipment off.\n\nHighly recommend.\n\nPurchased a new hvac and compressor.  Everything running great and house is much better keeping the temperature stable.", "pics": null, "resp": {"time": 1560820029595, "text": "Glad to hear everything went great! We appreciate you taking the time to submit a great review. Let us know if you ever need anything in the future or help setting up maintenance on your new system next year. Thank you for the choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108466587116266616728", "name": "Sherri Tyus", "time": 1592430719726, "rating": 5.0, "text": "I called after work on a Tuesday and on Wednesday morning, I had an appointment set for later that day.  Sssooo VERY pleased and happy,  YAY!! I even had 2 different techs calling to make sure someone got there. AWESOME, thank you Skelton, Jonathon and Jacob,  great job.", "pics": null, "resp": {"time": 1592488546787, "text": "Thank you for the review! We appreciate your business and are happy to get you up and cooling again."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100528389425442096916", "name": "Jackie McMahan", "time": 1595461756882, "rating": 5.0, "text": "I have never had a bad experience with Skelton’s.  I highly recommend them.", "pics": null, "resp": {"time": 1595510037533, "text": "Ms. McMahan, thank you for your many years of relying on Skelton's to take care of your HVAC needs. We sincerely appreciate having you as one of our long-time customers. Please let us know if you need any assistance!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110752843835565271110", "name": "David G. Revel", "time": 1570453881113, "rating": 5.0, "text": "The technician, David, was professional and thorough. He even had another technician deliver a filter for one of our units that he didn’t have on his truck. That step allowed him to fully test the unit. A tip of the hat to him!", "pics": null, "resp": {"time": 1570456936530, "text": "Thank you for the review Mr. Revel! We appreciate your business and are happy to hear you were satisfied with our technician."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100505815479391576729", "name": "Gavin McCartney", "time": 1588352155326, "rating": 5.0, "text": "Skelton's has always been excellent in answering questions and scheduling service calls. The service have all been courteous and professional.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116998057699987124470", "name": "Hugo Estes", "time": 1623094543094, "rating": 5.0, "text": "New HVAC system installed recently, in our home. The whole process with Skelton Air and Heat was excellent. They exceeded our expectations in every way. Skelton personnel were very knowledgeable and professional. We knew we needed to replace our old system. They were our fourth company to inspect and  give an estimate. Skelton gave us options that would work for us. We selected the option/system best for us. Shoutout to Curtis, Mark, young apprentice Trent (I think) and Brian!\nI would recommend Skelton Air and Heating to anyone, and I already have to friends.", "pics": null, "resp": {"time": 1594904979265, "text": "Thank you, Mr. Estes! We appreciate you taking the time to leave us a great review and that you had a great experience with our team on your new HVAC system!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114756360730898380559", "name": "Chris Froehlich", "time": 1591125616980, "rating": 5.0, "text": "Excellent service, Skelton went out of their way to install our new HVAC system over the weekend. I received 4 separate bids.  Skelton was the most professional and provided the most value for the money.", "pics": null, "resp": {"time": 1591282696772, "text": "Chris,\nThank you for choosing Skelton’s and the great review! It was a pleasure meeting you and we are greatful to be able to have helped."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107700158873164264061", "name": "Tammy Howell", "time": 1558807596408, "rating": 5.0, "text": "Very prompt and professional. The technician from Skelton's was very kind and professional, he answered all of my questions and addressed the concerns I had without hesitation. I loved that I was able to schedule an appointment online and pick a time that was convenient for me.  We will absolutely be using Skelton's for all of our future heating and cooling needs.", "pics": null, "resp": {"time": 1559135982770, "text": "Thank you for the great review! We appreciate you choosing us to service your unit."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112431698512221440835", "name": "Scott Ford", "time": 1571159175524, "rating": 5.0, "text": "Skelton Heating and Air has been my “go to” company for the past 18 years.  They have done work for me professionally and for my real estate clients. They are always reasonable, ON TIME and professional. I would not use anyone else.  Thanks. Scott Ford", "pics": null, "resp": {"time": 1571421754493, "text": "We appreciate the great review! Thank you for choosing Skelton's Heating & Air for all of your HVAC needs."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101885733256536630054", "name": "Ric Misischia", "time": 1587044852512, "rating": 5.0, "text": "Very punctual and professional\nDavid and his crew got us up and running quickly and I am confident with the work\nThis is the second house we have used Skelton’s with and are pleased", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113966597207372164739", "name": "hays sarah", "time": 1587500767766, "rating": 5.0, "text": "They are very personable. They arrived on time. Communicated well what they had done", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100785713740879535002", "name": "Shaun Vick", "time": 1548197218951, "rating": 5.0, "text": "Great service and friendly technician. Explained everything in a way I can understand. Most service companies try to make it sound over complicated to get you to spend more money but Johnathan was refreshingly patient, made me feel comfortable, and was very sincere. Great company for business and residential. I’d give them 6 out of 5 stars if it would let me.", "pics": null, "resp": {"time": 1550755352871, "text": "Thanks for the great review Shaun! We appreciate you sharing your experience."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113748504550261788112", "name": "Scott Farrar", "time": 1585473879455, "rating": 5.0, "text": "Always nice people, decent folks you don't mind letting in your home. I'm a little less impressed with Trane currently though. Three ECM condenser fan motors in 2 years have been replaced.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108796119548707452710", "name": "ison keith", "time": 1624288581779, "rating": 5.0, "text": "Very good", "pics": null, "resp": {"time": 1624458636682, "text": "We appreciate your 5-star rating!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115953277056487016451", "name": "Dale Jones", "time": 1588868933121, "rating": 5.0, "text": "Technician was on time Pleasent and very knowledgeable. Technician did not suggest a costly repair but provided estimate for new unit", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113743085200624929930", "name": "Victoria Bailey", "time": 1557330880575, "rating": 5.0, "text": "Jacob from Skelton's did a fantastic job of getting our AC to work properly again. He went above service we have received from others in the past. He showed me and explained in detail exactly what the issue was. Also, he mentioned a repair we would need in the future but did not push for immediate repairs showing that they want to make you aware of the situation, but won't push for unnecessary fixes. Very professional.", "pics": null, "resp": {"time": 1557493761883, "text": "Glad to hear about your experience Victoria- Thanks for choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117537544599351530456", "name": "Paul Kavinoky", "time": 1585832644789, "rating": 5.0, "text": "we have used them for years.  never had any complaints.  they are the best", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100912007524095855937", "name": "Phillip Madden", "time": 1580311782108, "rating": 5.0, "text": "Issue with thermostat at 9 PM and service man (Keith) was at my house by 9 AM the next morning problem solved.... All handled under warranty at no expense to me. Really appreciate the service, Phillip Madden", "pics": null, "resp": {"time": 1580732866913, "text": "Thank you for the great review Phillip! We appreciate your business and glad we could help."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100491656115628054150", "name": "Jason Junkins", "time": 1603894563014, "rating": 5.0, "text": "Great business.  Very responsive.", "pics": null, "resp": {"time": 1603898866878, "text": "Thank you Mr. Junkins for choosing Skelton's for your HVAC needs. We appreciate you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108353953113654813286", "name": "Cheryl McCoy", "time": 1592932694352, "rating": 5.0, "text": "Ben was an amazing technician and got the job job done quickly and efficiently!", "pics": null, "resp": {"time": 1592937244241, "text": "Thank you for the excellent review & choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "118115062365854347494", "name": "Donald Moore", "time": 1586444358805, "rating": 5.0, "text": "Excellent service on our recent repair.  I highly recommend Brian and his company.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107302138248789582762", "name": "Bill Coker", "time": 1572629329294, "rating": 5.0, "text": "I’ve used Skeletons for several years and they have always been great. Same day service and reasonable billing. They will always check to see if the part is still under warranty.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114460602022302599732", "name": "Michael Taunton", "time": 1582926118731, "rating": 5.0, "text": "I just built a house and Skelton’s Heat & Air was one of the only contractors that did a quality job the first time, not 3 phone calls and 3 trips out. Quality company, Great product, Great service!", "pics": null, "resp": {"time": 1583157548576, "text": "Thank you for the wonderful review, Mr. Taunton!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109249079256556412140", "name": "Melody Thomas", "time": 1556729210544, "rating": 5.0, "text": "I have used a few companies since we have moved and I was SO impressed with Skelton’s!! Mr. John came to re-evaluate a very expensive quote we had received that would have totaled over $4500!! We wanted an honest second opinion and his tripped saved us thousands! He couldn’t back anything the quote said from the other company and not with intention of selling another service. When he simply said (with hai 34 years experience) “I just don’t feel good in my heart about this.” He won me! Thanks for having such great, trustworthy, and experienced employees! Amber was great on the phone as well! Will certainly be my first cal next time! Thank you!! Melody T.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117347273847949199545", "name": "Lee Riley", "time": 1587651726681, "rating": 5.0, "text": "Timely, professional and high quality service.  I would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104472144532397846470", "name": "Like Mermer", "time": 1587498587237, "rating": 5.0, "text": "Skelton’s were very responsive and arrived on time. They were very nice and did a heck of a good job.  Couldn’t ask for more.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103093626008650758308", "name": "Tammy Johns", "time": 1522085166486, "rating": 5.0, "text": "Managing a business I have dealt with many Heating & Air companies. Skelton's by far has been one of the best companies to deal with. They have installed 2 units for us and both times they were very professional, came when they said they would, very friendly and knowledgeable. Jonathan & Nate were awesome!! I would highly recommend Skelton's Heating , Cooling and Refrigeration!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111458004503983710692", "name": "Jeanne Cavallaro", "time": 1594050944314, "rating": 5.0, "text": "They came when scheduled and handled the AC service in an efficient manner.", "pics": null, "resp": {"time": 1594127009180, "text": "Thank you for the excellent review Ms. Cavallaro! We appreciate you choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113268300341869012102", "name": "Amanda Hemby", "time": 1583768224015, "rating": 5.0, "text": "They worked with my busy schedule to come out (the same day!) and fix my heat. They were nice and professional and got my heat fixed quickly.", "pics": null, "resp": {"time": 1583788747134, "text": "Thank you for the wonderful review, Amanda! We appreciate you choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110308383588420915926", "name": "Tom Hall", "time": 1577286565378, "rating": 5.0, "text": "Great place for heating and cooling needs.  Have used them for maintenance issues as well as routine maintenance twice a year.  Always professional and courteous.", "pics": null, "resp": {"time": 1578253780171, "text": "Thank you for the kind review Mr. Hall! We appreciate your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111267557928660542884", "name": "Brandon Marley", "time": 1568214708886, "rating": 5.0, "text": "We just had our HVAC unit completely replaced. Kevin did a phenomenal job diagnosing the problem and presenting is with every option. Kevin made what normally would be a stressful process into a extremely easy process. Wonderful service!", "pics": null, "resp": {"time": 1579099841148, "text": "Thank you for the great review Mr. Marley! Glad you were happy with your service and install. We appreciate your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102894105614856902955", "name": "Drew Sayer", "time": 1565984742280, "rating": 5.0, "text": "My AC decided to take the day off when it was nearing 100 degrees outside so I'll called Skelton's at 11am. By 12:30, a knowledgeable and friendly technician has been to my house, he has identified and repaired the unit (bad capacitor), and a reasonable sum of money has been withdrawn from my bank account. Can't draw it up any better than that!", "pics": null, "resp": {"time": 1566318043358, "text": "Thank you for the review Mr. Sayer! Glad we were able to get you cooling quickly."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112389475846883693946", "name": "Michael Snowden", "time": 1573159609802, "rating": 5.0, "text": "Brian Skelton and his team are competent, efficient and quick to respond. Great work at a fair price makes them the only heating, air conditioning and refrigeration company I’ll ever call. Thanks Brian and team.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112369999099127844118", "name": "Pam Martin", "time": 1580920870602, "rating": 5.0, "text": "They are very professional and knowledgeable very nice and prompt. Explained everything I highly recommend them", "pics": null, "resp": {"time": 1580999154460, "text": "Thank you for the review Pam!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106052908207368248860", "name": "Rae Jones", "time": 1617314212145, "rating": 5.0, "text": "Excellent service!", "pics": null, "resp": {"time": 1618428750402, "text": "Thank you for taking the time to leave us such a great review. We are so happy that we could help."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117125843873466037157", "name": "Phillip Upchurch", "time": 1556220661774, "rating": 5.0, "text": "The guys working on my new air did a great job.  Explained how to operate new thermostat, very helpful crew.  Did a great clean  up job when they finished  Give them a. A rating  Thanks Phillip", "pics": null, "resp": {"time": 1556549631064, "text": "Thank you for the review Mr. Upchurch!!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107792667596512247063", "name": "David Hollett", "time": 1588176827752, "rating": 5.0, "text": "Good price, good service - job well done.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105874070301528284432", "name": "Zai Zakaria", "time": 1591307418173, "rating": 5.0, "text": "Easy, responsive and quickly dentified the issue and got it fixed fast.", "pics": null, "resp": {"time": 1591374968350, "text": "Thank you for the excellent review & choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109901270442772092758", "name": "Patrick Graves", "time": 1617384461782, "rating": 5.0, "text": "Technician was great!", "pics": null, "resp": {"time": 1618428751868, "text": "Thank you for taking the time to leave us such a great review. We are so happy that we could help!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110417119721348174383", "name": "Nathan McCorkl", "time": 1527255545005, "rating": 4.0, "text": "Thank you for your service.  The customer service agent was great at letting us know when the technician would arrive.  The technician work efficiently and communicated service adds which we approved.  The only item I would change in the future is to stick to the quoted cost.  We were quoted on the phone $89/unit (2 total) and the technician quoted an additional $35-$40 sensor.  However, when my spouse showed me the bill it was well over $300 and I don't know why.  Thanks again.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106030328521515569142", "name": "Julie Cunninhgam", "time": 1587322466389, "rating": 5.0, "text": "Technician was there promptly & fixed the problem without fail.  Was very kind & courteous.  Had my system fixed in no time & cool air blowing down from above.  Thank you so much", "pics": null, "resp": {"time": 1566571073619, "text": "Glad to hear about your experience! We appreciate you choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108808756432211383168", "name": "Colin Quarello", "time": 1559657105510, "rating": 5.0, "text": "Skelton responded promptly when our AC stopped working after-hours. Their technician Jeff arrived during the promised time and quickly diagnosed and fixed the issue (bad capacitor). Their rates are very reasonable for the quality service provided and I will be using them again in the future to service and maintain our units.", "pics": null, "resp": {"time": 1559742194116, "text": "Thank you for the review! Glad we were able to get your unit working quickly. We appreciate your business and please let us know if you need anything in the future."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117154056620771236298", "name": "GORDON FAMILY", "time": 1568222169937, "rating": 5.0, "text": "Service technician showed up quickly, evaluated and fixed the AC unit in less than 30 minutes. He was very friendly and professional. Great service!", "pics": null, "resp": {"time": 1568323619537, "text": "Thank you for the review Dr. Gordon! Glad we were able to get you cooling quickly."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113276892710214215647", "name": "Brenda Moss", "time": 1562345974942, "rating": 5.0, "text": "I love this company!! From the sweet lady who answers the phone to the service tech....they’re all friendly and professional!!  Sign up for the $178/yr maintenance. They service your a/c spring & fall. It’s worth every penny!!", "pics": null, "resp": {"time": 1562600004975, "text": "Thank you for the great review Brenda! We can't think you enough for your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112590126128336211498", "name": "Tommie Butterworth", "time": 1540837551730, "rating": 5.0, "text": "They were great.... arrived on time, were very courteous and showed\nme all the details I needed know.  Answered all my questions and\nmade sure everything was working and cleaned up before they\nleft.\nA big thank you to Amanda who had a serviceman come\nlate on Friday to check out a gas leak.  He arrived quickly and\nsolved the problem.\nThanks to all of you!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104402091429810034999", "name": "Leigh Whiteside", "time": 1584992487881, "rating": 1.0, "text": "Went to Trane's website and was given Skelton's as a Trane new unit provider. They sent me an email about an appointment, so I call to make one and they refused. Said it was not in their service area, but the Trane website says they are. Spoke with Chad the Service Manager and explained about website and emails he still refused to give me a quote for a new unit. Unprofessionalism.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114995237916043651790", "name": "Stan Roth", "time": 1594393753859, "rating": 5.0, "text": "The best Residental HVAC Contractor in the Birmingham!!!", "pics": null, "resp": {"time": 1608304377603, "text": "Mr. Roth, thank you for the awesome review and choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117957534197267937482", "name": "Debbie Henderson", "time": 1522865636551, "rating": 5.0, "text": "This was my first experience with Skelton's and I am very pleased. They came to my home in less than 24 hours. The technician was prompt, courteous and professional. He completed the necessary repairs in a timely manner. I will definitely be calling on them for routine maintenance as well as any further problem with my unit.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "118082605632720932591", "name": "Joseph Plays", "time": 1574806994998, "rating": 5.0, "text": "Jonathan is such a wonderfully nice person,,, so respectful and very efficient in what he does ‼️‼️we appreciate what he has done in our home ‼️Thanks ‼️‼️", "pics": null, "resp": {"time": 1574888867635, "text": "Thank you for the great review Mr. Plays!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102100917640690784750", "name": "Jay Miller", "time": 1566835282333, "rating": 5.0, "text": "My 94 year old Dad's AC system went out on a Thursday afternoon in rural Alabama with the heat index well over 100. Justin promptly called me back and was out to check the system before the end of business that same day. The entire system had to be replaced so it couldnt be resolved that day. Justin lined up Wes and his crew so that they could begin the replacement first thing once the system was delivered. I was told everything would be good to go by 1pm. My Dad and I arrived at 12pm and Wes told me all they needed was access to the thermostat and they would be finished. This group understood the critical situation my Dad was in and went above and beyond to make sure his unit was installed and operating ASAP.\nThank you so much guys...you'll never know how much it meant to my Dad to get back to his home.", "pics": null, "resp": {"time": 1566918737236, "text": "Thank you Mr. Miller for the great review! We are happy to hear about your that you were pleased with job and technicians. Thanks again for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100684361345168758695", "name": "Goodoz", "time": 1584471232502, "rating": 5.0, "text": "David showed up on same day as original call and diagnosed my problem.  He priced and ordered a part for me (collected payment) and arrived back at my home first thing the next morning.  AC was back on by 10AM.  Skelton replaced my upstairs AC a few years back and did a good job (crew began and finished same day)...so I called them back for this repair...another good experience.", "pics": null, "resp": {"time": 1584536563926, "text": "Thank you for the wonderful review and choosing Skelton's Heating & Air for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106616200319378163476", "name": "Jack Lyle", "time": 1537799696313, "rating": 5.0, "text": "It seems punctuality is lost on many service businesses these days, but that's not the case with Skelton's!  They arrived when they said they would for a quote on a new heating and a/c system and did the same two days later when they came to install my new system.\n\nI was very pleased with the pricing for a new system and the installation was performed by a professional crew who put pride in their work.  They did not try to sell me things that I didn't need and there were no surprises.\nI paid exactly what I was quoted.\n\nThey will  get all my HVAC work from now on.  I highly recommend Skelton's!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116616130691637504708", "name": "Chuck Treece", "time": 1556937257131, "rating": 5.0, "text": "Installed new TRANE heat pump. On time and with enough resources to accomplish the task.  Improved the existing setup and completed the job in about five hours.  Walked us through all the install process and the new control panel. Very professional, as usual. Would recommend to anyone.  THANKS!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100382650689693309243", "name": "Vito Faruolo", "time": 1553193227755, "rating": 5.0, "text": "Fantastic. The technician, Mr Rowland diagnosed and corrected my fan unit wiring problem on the spot. Prior competitors wanted to install a new motherboard.  They also submitted the best bid to update my return air ductwork.", "pics": null, "resp": {"time": 1553259126906, "text": "Glad to hear about your experience!  Thank you Vito"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102875300705379426123", "name": "Hal David", "time": 1617888272762, "rating": 5.0, "text": "Excellent company", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114454059951979838933", "name": "Winnie Azbell", "time": 1558700683084, "rating": 5.0, "text": "We are very pleased with the service and new installation from Skelton’s.  Their service tech Kevin was very professional and thorough when servicing our old unit and presenting options for repair or replacement.  Since our Trane unit was 21 years old, we opted for replacement.  Installers Cody and Mike had our new unit installed and tested in a few hours.  They reviewed system and thermostat functioning with us and could not have been more friendly and professional.  They cleaned up afterwards and we are enjoying the cool air! Thanks guys!", "pics": null, "resp": {"time": 1558711282417, "text": "Glad to hear about your experience! We appreciate your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102483077767028674607", "name": "Robert Bowling", "time": 1549058585285, "rating": 5.0, "text": "Brian the owner promise all the work that was quoted and it was done.The crew was fantastic. The work was done in a timely manner. In all, I would call them back if I needed other work.", "pics": null, "resp": {"time": 1549311721880, "text": "We appreciate you trusting our company to help with your unit replacement. It was a pleasure working with you and being able to make your home more comfortable!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102023844326208029327", "name": "Connor D", "time": 1592408535087, "rating": 5.0, "text": "Great company. Very professional!", "pics": null, "resp": {"time": 1592414485089, "text": "Mr. Darden, thank you for the 5 star review and choosing Skelton's for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101017436907993138548", "name": "Doug Tilt", "time": 1547577609537, "rating": 5.0, "text": "I remodeled a room in my lake house which required repositioning the main intake vent from a vertical in -wall position to an in-floor register.  Brian Skelton , company owner, came out the day after my call, evaluated the job and provided a best guess estimate for the proposed task\nThe following day a team of two technicians  arrived at 0800 , as agreed. Within 4 hours the old vent box was removed, a new floor frame between the joists was constructed, a new box placed and large duct connected to the existing AC/ Heating unit and new ,sturdy floor grate placed( and thermostat repositioned)\n\nThe Skelton team were most professional and efficient.  The job site was completely cleaned and everything double checked to be sure everything was done to my satisfaction and functioning well. An immediate follow up call to me by company owner was appreciated.\n\nThe total cost was $960.00 based on labor and materials , which was as expected per initial estimate\n\nMy five star rating was completely deserved based on professionalism, punctuality, job done, and charge. I definitely recommend this company and will use them again.\n\nDoug Tilt", "pics": null, "resp": {"time": 1550156935516, "text": "Thank you for taking the time to leave such a great review for our company! It was our pleasure to assist you on your project."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106429986745680439885", "name": "John Jarnagin", "time": 1566301978294, "rating": 5.0, "text": "Premier Customer Service. My tech was friendly and knowledgeable. The issue was quickly diagnosed and resolved.", "pics": null, "resp": {"time": 1566570580851, "text": "We appreciate the review Mr. Jarnagin! Good to hear the issue was resolved quickly. Thanks for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114782790171533147623", "name": "Jerry Coley", "time": 1534969656001, "rating": 5.0, "text": "Amanda was great in scheduling a quick service visit and Jonathan and his helper did an excellent repair at a fair price. Same day service on a hot day was great! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113521730812861767068", "name": "Gloria Nelson", "time": 1536953284724, "rating": 5.0, "text": "Chad is a great service employee at Skelton’s Heating, Cooling and Refrigeration.  He was about honesty, fair pricing and repairing my air conditioner.\nGreat job, I’ve got air again without the expense of a new unit.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101516508681336879504", "name": "Sam Norris", "time": 1566500696486, "rating": 5.0, "text": "Skelton provides excellent customer service - honest, reliable, knowledgeable, and always on time.  I have used Skelton since 2011 for installs and service at my home and my investment property. I would not use any other company for my heating and cooling.", "pics": null, "resp": {"time": 1566571150638, "text": "Thank you for that great review Mr. Norris! We appreciate your business over the years and look forward to many more. Thank you again!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111836347105203837795", "name": "David Burton", "time": 1537800644033, "rating": 5.0, "text": "Absolute pleasure to work with these guys, they are as good as it gets. Excellent, prompt service with highly technically skilled people. Quickly diagnosed the issue and repaired immediately, making sure to be as efficient as they could. I would highly recommend them for any job.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115078541095873541023", "name": "NELLIE DAUGHERTY", "time": 1550026559500, "rating": 5.0, "text": "Skelton will exceed your expectations with their friendly, professional and expert service. The technicians are courteous, knowledgeable and conscientious about giving you the best service @ a fair price. We use them for our commercial properties (25 + HVAC units)  all in good working order thanks to Skelton's Heating and Air.", "pics": null, "resp": {"time": 1550754855450, "text": "What a great review! Thanks for sharing your experience with us Nellie."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107530183722419569627", "name": "david cline", "time": 1569754539794, "rating": 5.0, "text": "I have used Skelton on several new installs and they have always done excellent work.The technicians are always great and will answer their phone if you call with a question", "pics": null, "resp": {"time": 1569842938660, "text": "Thank you for the great review Mr. Cline! We appreciate your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117472664024638904488", "name": "Jessica Maske", "time": 1488557386177, "rating": 5.0, "text": "It seems to be getting more and more difficult to find decent people to entrust the care of your home with, but the guys at Skelton's are both competent and trustworthy.  I am more than satisfied with the work they've done for me. They are experienced, reasonably priced, and very professional. I will definitely be using Skelton's again in the future.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117418456120842528050", "name": "Tim Rich", "time": 1559685544253, "rating": 5.0, "text": "Main unit A/C went out on a Sunday morning before an afternoon family get together. They responded quickly, got things fixed and saved the day.  Very responsive and professional.", "pics": null, "resp": {"time": 1559738757254, "text": "Thank you for your review! We appreciate your time doing so which helps our growth in the industry. Please let us know if you have any future needs."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106385062473631967325", "name": "Aliece Dice", "time": 1530898170185, "rating": 5.0, "text": "We use Skelton’s for all of our home heating and repair. They are always professional and timely. I cannot day enough good things about our experiences with this company. John is wonderful and I’m always glad to see him when he shows up as our maintenance person.  A++++++++++++++++", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114530605531335553248", "name": "Douglas Nickell", "time": 1623188313512, "rating": 5.0, "text": "Knowledgeable technician, friendly and thorough.", "pics": null, "resp": {"time": 1602252823442, "text": "Mr. Nickell we are pleased to know you had a great experience with our company! Please let us know if you need anything else!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103173087023165906737", "name": "Terry Kendrick", "time": 1606320655124, "rating": 5.0, "text": "I have used Skelton's on several occasions.  I have always had very good experiences.  All the technicians have always been honest, professional and courteous.  I would not hesitate to recommend Skelton's to anyone needing heat and/or air service and repair.", "pics": null, "resp": {"time": 1608739701692, "text": "Mr. Kendrick, thank you for recommending Skelton's Heating & Air and choosing us for your HVAC needs. We are happy to serve you!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111414447675820571664", "name": "Duncan Smith", "time": 1530886426391, "rating": 4.0, "text": "Very quick response and knowledgeable and professional service. For the work performed, I believe labor and diagnostics were pricey. However, all work performed was top notch!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113931470487322389595", "name": "fitnesszone101", "time": 1568137221462, "rating": 5.0, "text": "Great Service!  Fixed it fast and did not overcharge!  Very Professional", "pics": null, "resp": {"time": 1568200441772, "text": "Thank you for the review! We appreciate your feedback."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104177034278584769815", "name": "Bryan Allen", "time": 1602102288542, "rating": 5.0, "text": "You don’t need to use anyone else BUT Shelton", "pics": null, "resp": {"time": 1602106105289, "text": "Mr. Allen, thank you for the awesome review! We appreciate you choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113734397394163260534", "name": "Susan Whiting", "time": 1561820246785, "rating": 5.0, "text": "Service was quick.  Excellent and very knowledgeable serviceman.  I will use this company again.", "pics": null, "resp": {"time": 1561992703896, "text": "Glad to hear about your experience Susan! We appreciate the review and you choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102081970803171689837", "name": "Gary Wright", "time": 1558633169703, "rating": 5.0, "text": "After experiencing so many a/c companies with poor customer service and even worse, incompetent work that causes problems in home for months— it is a HUGE relief to find Skelton’s who can even find out/ research/ and repair (if needed) what was done so incorrectly by the incompetent companies before them.\n\nBrian, the owner, personally came to my home to help with getting my perpetual problem (due to other companies) on the road to repair.\n\nI recommend this company 150%. Start with them for ALL your a/c and heating issues— then you won’t be bamboozled as I was by going first through some of the largest and most heavily advertised companies.\n\nThanks!", "pics": null, "resp": {"time": 1558712469316, "text": "Thank you for the great review Mr. Wright! We appreciate your business and are happy to get your issues resolved."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101567829959146485397", "name": "Jack Poole", "time": 1527083568310, "rating": 4.0, "text": "The technicians installing our new A/C were very personable and professional.  They were also very considerate of my home and making sure that they cleaned up the work areas.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116815535862180794816", "name": "Gaije kushner", "time": 1563837311263, "rating": 5.0, "text": "Skelton’s came to us quickly,  found and fixed the problem with our a/c very quickly, and all for a great price.  Highly recommend!", "pics": null, "resp": {"time": 1565019952362, "text": "We are glad that we were able to quickly get your system up and running. Thank you for choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104798467315171910401", "name": "Glenda Jones", "time": 1568825418214, "rating": 5.0, "text": "Was in and out quickly. Was very helpful and polite.", "pics": null, "resp": {"time": 1569238110381, "text": "Thank you for the review Ms. Jones! Let us know if you need anything else and thank you for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "118287950153522242281", "name": "David Goggans", "time": 1555443943823, "rating": 5.0, "text": "These guys are great. I have been using them for several years. They show up when they say they will and I never feel like I have been overcharged. I highly recommend them.", "pics": null, "resp": {"time": 1556141264258, "text": "Thanks for the great review David! We appreciate your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113639805811032879606", "name": "Mike Metzler", "time": 1570978441113, "rating": 5.0, "text": "Great service from a friendly Tech! You will not find a better HVAC company in our area.", "pics": null, "resp": {"time": 1571062392052, "text": "Thank you for the great review Mr. Metzler! We love hearing back from our customers."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109984898932755032162", "name": "Bernadette Fraser", "time": 1520401128596, "rating": 5.0, "text": "Fantastic company. Great customer service and very professional. Could not have asked for a better experience and our air conditioner is working perfectly.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110008992399988448713", "name": "seraphimr", "time": 1563642333644, "rating": 5.0, "text": "We have a quadriplegic living here and one of our central units,  the one in his suite, stopped colling last night. He is temperature sensitive and it is critical to keep his temperature stable in his area. I called SHELTON Air and Heat, this is Saturday morning,  and John a Technician answered.  I explained the situation, told him the model number of out Trane unit. He said he was on his way to a call and come after. Hff e called and ssid he was on his way. He arrived,  called to tell me and I told him i wiuld be diwn in 5 minutes  and told him which of the 5 Trane units it was. I was worried about the length of time hff e would be here an DC tge cost, especially since it was a weekend. I came down, not over 5 minutes later, he was replacing the capacitor on the unitand was finished 5 minutes later!\nJohn was courteous,  honest, trustworthy,  and prompt. He could  have taken his time, running up labor time but just did his job efficiently.\nI will definitely be using Skeleton Heating and Air for or all my AC/HEATING needs. . Thank you Mr. Skelton for having honest and efficient technicians!  Thank you John fir getting the unit up nb and runing so quickly!", "pics": null, "resp": {"time": 1563894933472, "text": "Glad to hear about your experience! We appreciate you taking the time to submit this review and are pleased to hear more of these stories about our technicians. Let us know if you need anything else and thanks again for your business."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104825771781053621797", "name": "Trent Reed", "time": 1523895590753, "rating": 5.0, "text": "Very professional and friendly staff! Honest and open about what work needed to be done. Great customer service and speedy repair. Will use again in the future.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113549270984809969040", "name": "Roger Freels", "time": 1541531512653, "rating": 5.0, "text": "The crew that put in our unit was professional, knowledgeable, and friendly. They all worked to please the customer (us). Johnathan was terrific.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114883557279922855129", "name": "Jude Meyer", "time": 1536067412453, "rating": 5.0, "text": "Excellent all round service...prompt, through and friendly. After seeing the good job the tech performed, I signed up for the yearly maintenance agreement. Thanks, Skelton’s", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110539822425926970580", "name": "Allen Richardson", "time": 1548554210942, "rating": 5.0, "text": "Great service and very helpful. Would definitely recommend Skeleton’s for all your HVAC needs.", "pics": null, "resp": {"time": 1550754801532, "text": "We love hearing back from our customers- Thanks so much Allen!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115476253664448163081", "name": "Patrick Ball", "time": 1592059926383, "rating": 5.0, "text": "Didn’t know I was getting charged since I have 10 years parts and labor.", "pics": null, "resp": {"time": 1592066059593, "text": "Thank you for the review Mr. Ball! Unfortunately the extended warranty on your system doesn’t cover parts outside of the equipment. The breaker and disconnect are considered to be a part of the homes electrical system. Let us know if you have any questions."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115068113568039274283", "name": "Tanya Maddox", "time": 1561564225563, "rating": 5.0, "text": "So happy with Skeltons!  They have installed several units for us and always great service!!!", "pics": null, "resp": {"time": 1561988378929, "text": "We appreciate the great review- Thanks Tanya! We couldn't do it without customers like you."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111476541995423450647", "name": "Kelsey Cunningham", "time": 1562695729842, "rating": 5.0, "text": "John was awesome to work with on getting our new units!! Fantastic job Skelton!", "pics": null, "resp": {"time": 1562855491436, "text": "Thank you for the opportunity! We appreciate your business and the great review."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109521425302119368689", "name": "Norita Csonka", "time": 1557359387429, "rating": 5.0, "text": "Excellent service! Professional service tech . Skelton has always been timely , informative and  has routinely provided great service! Thank you Skelton!", "pics": null, "resp": {"time": 1557493798724, "text": "Thank you Norita! We appreciate the great review!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100921208481631917194", "name": "Linda Roberson", "time": 1557528887985, "rating": 5.0, "text": "They was great, they are very nice people and they did a great job I recommend anyone that have  air conditioning problem Or heating problem skeleton is the people to call", "pics": null, "resp": {"time": 1557753635544, "text": "Thank you for the business! We appreciate the review!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104586811774412199640", "name": "Edward Doddy", "time": 1590679484189, "rating": 5.0, "text": "I used SKELTONS Heating & air today, They went above & beyond to take care of my need, Not to mention that their professionalism and services far exceeded their price, I highly recommend this company, And they are located within a 2 mile proximity, Thank you Brian and your staff at Skeltons Heating & Air for a job well done 😊👍🏻", "pics": null, "resp": {"time": 1558020767830, "text": "Sorry for any confusion Mr. Doddy. We are glad that everything worked out and the replacement went well. Let us know if you need anything. Thank you for the review and your business!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104653039007662495941", "name": "Suzanne Kelley", "time": 1557249991680, "rating": 4.0, "text": "They are always friendly, and do their best to service your air conditioning/ heater.", "pics": null, "resp": {"time": 1557326123454, "text": "We love hearing back from our customers- Thanks so much Suzanne!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104493209096477208166", "name": "Oh happy day", "time": 1531925685905, "rating": 5.0, "text": "Very professional and would recommend everyone to use this company. Most of all honest and respectful.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101396220900854832428", "name": "Ron Swann", "time": 1535142991983, "rating": 5.0, "text": "Great experience. I had been trying to get someone to fix my air for a week. I called Skelton and Brian came by the same day to give me an estimate and moved some things around and installed my new Trane AC the next morning. I will never use anyone else for my HVAC needs.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100410460982170784512", "name": "Joyce Maske", "time": 1488503487624, "rating": 5.0, "text": "Absolutely the best company to deal with! They are very knowledgeable and honest. Unlike other companies out there.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108488936566522019240", "name": "Jordan Estus", "time": 1565968941476, "rating": 5.0, "text": "Best service we have had from an A/C Vendor! They were a pleasure to work with!", "pics": null, "resp": {"time": 1566317936817, "text": "Glad to hear about your experience! We appreciate your business and thank you for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105187931612915584517", "name": "Richard Hopkins", "time": 1607620731686, "rating": 5.0, "text": "Highly recommended", "pics": null, "resp": {"time": 1607697145714, "text": "Thanks so much for the review, Richard Hopkins! Feel free to text this number any time and we'll respond ASAP."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116135709805104669306", "name": "Rebecca H Posey", "time": 1566774458838, "rating": 5.0, "text": "Skelton’s is always prompt and provides great service and gets the problem fixed in a timely manner.\nThank you much!", "pics": null, "resp": {"time": 1566827134203, "text": "Thank you for the review! We appreciate your feedback and for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "105597214716722766277", "name": "Britney Campbell", "time": 1508527387041, "rating": 5.0, "text": "Awesome company! Incredibly trustworthy and very knowledgeable!! You cannot get any better than Skelton's!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104205229275819635055", "name": "Hugh Hickey", "time": 1539027825790, "rating": 5.0, "text": "I  WAS REAL PLEASES WITH THE SERVICE I RECEIVED  PUTT6ING MY AIR CONDITIONER IN.  HUGH HICKEY", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112777812915396252364", "name": "Donald Slee, Jr", "time": 1617808710179, "rating": 5.0, "text": "We are extremely satisfied with the professional, timely service which we receive from Skeltons.\n\nIn addition, we would like to compliment our Technician, Jacob, who performs his work conscientiously, mannerly and professsionally.\n\nWe will continue to use and recommend Skeltons to our friends and neighbors.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "100660059129080301043", "name": "C J", "time": 1517163543569, "rating": 5.0, "text": "Had them install a new HVAC system and they did a great job. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "103252285365391637702", "name": "John Key", "time": 1530410326620, "rating": 5.0, "text": "We are completely satisfied with our new Trane A/C, coil and furnace, installed by Skelton’s Air Condition and Heating. Brian Skelton clearly explained the Trane components, the cost for installation and answered my questions. The installers, George and Wes, were on time and once the new units were installed, walked us through and answered our questions. They were knowledgeable, neat and courteous and were finished by 2 pm in the afternoon. They replaced the original Trane system which was 21 years old and still running well. We knew it was time to replace it and are happy with our decision to choose Skeletons to do it.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113288998276551348509", "name": "Melanie Reno", "time": 1559743063129, "rating": 5.0, "text": "Technician was on time and very thorough. Would recommend.", "pics": null, "resp": {"time": 1559831445583, "text": "Thanks for choosing our company and taking time to leave a review! Your business is much appreciated!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "109078706095107146412", "name": "Jane Fiorella", "time": 1586300568430, "rating": 5.0, "text": "Great guys that took care of all problems", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116896517339146728649", "name": "Amanda Edwards", "time": 1504885251756, "rating": 5.0, "text": "Top notch service! Excellent job all around: Prompt, thorough, and professional! I will continue to use for all of my HVAC needs!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113351613708483601971", "name": "Brian Kelly", "time": 1562333422161, "rating": 5.0, "text": "I Recently  replaced my heat pump system .Skelton’s was on time professional and friendly . I would recommend them to anyone .I wish all businesses would treat customers like they do.\n\nI went to post a review on my recent experience with Skelton’s . The above posted review was already in the system from my last experience . I can honestly say nothing has changed . Consistently delivering outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115173544255982178113", "name": "Frank Humber", "time": 1578003720320, "rating": 5.0, "text": "Excellent service and products great experience", "pics": null, "resp": {"time": 1578253658846, "text": "Thank you for the review Mr. Humber!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113524271804116498354", "name": "trent reed", "time": 1504664709557, "rating": 5.0, "text": "Been using these guys for years at my house and rental property. Very trustworthy, not just salespeople like the other ones I've used", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "106042709292084031679", "name": "Hal David", "time": 1585660996916, "rating": 5.0, "text": "Attention to detail, quality installation work", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108000938886167203415", "name": "Cassey Head", "time": 1525879491160, "rating": 5.0, "text": "Recognized and quickly resolved the issue.  Friendly,  polite,  great service!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "107455619760096838079", "name": "Becky Davis", "time": 1626874569924, "rating": 5.0, "text": "I’m", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "116627939686430155544", "name": "denise leddy", "time": 1591286674940, "rating": 5.0, "text": "Our technician  was great!!", "pics": null, "resp": {"time": 1591306224143, "text": "Thank you Ms. Leddy for the great review and choosing Skelton's Heating & Air for your HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "113831546670376763400", "name": "Charles Faulkner", "time": 1603425120428, "rating": 5.0, "text": "Pleasant, dependable, knowledgeable", "pics": null, "resp": {"time": 1603730588645, "text": "Mr. Faulkner, thank you for the 5-Star review! We appreciate you choosing Skelton's for all of you HVAC needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "117936878082803435944", "name": "Albert Morris", "time": 1548272803259, "rating": 5.0, "text": "Weather was bad never did say anything about it was very helpful even let me know what else could happen before he fixed it like he might have to replace the motor if that did not fix it but it fixed it he also check the refrigerant to the label on the unit great work", "pics": null, "resp": {"time": 1550754935463, "text": "Thanks for the review Albert! We were glad we could get your unit up and running."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "115384121567340132756", "name": "Chris Diak", "time": 1561597909836, "rating": 4.0, "text": "Our technician was polite and thorough!", "pics": null, "resp": {"time": 1561988838410, "text": "Thank you for the review Chris & Nicole! We appreciate you calling Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112246958684914526105", "name": "Trenton Lyvers", "time": 1536110123236, "rating": 5.0, "text": "Chad came out to help me out tonight and he was very professional and was able to resolve the problem quickly.", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110960901201879847487", "name": "Nannett Singleton", "time": 1576031452918, "rating": 5.0, "text": "Customer service is wonderful", "pics": null, "resp": {"time": 1576186876403, "text": "Thank you for the review Nannett!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108485790433099521154", "name": "Louis Zook", "time": 1569246036083, "rating": 5.0, "text": "Prompt, on-time, professional service", "pics": null, "resp": {"time": 1569250467695, "text": "Thank you for the review Mr. Zook! We appreciate you choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "108645631360540299063", "name": "Michael Gibson", "time": 1566328071998, "rating": 5.0, "text": "Very prompt and thorough service", "pics": null, "resp": {"time": 1566570611774, "text": "We appreciate the review Mr. Gibson! Thank you for choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110289575561924926300", "name": "Tabatha Staples", "time": 1565337610040, "rating": 5.0, "text": "Awesome service and very friendly", "pics": null, "resp": {"time": 1565375074512, "text": "We appreciate this review Ms. Staples! Thank you for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "102517722725015156411", "name": "Mark Mitchell", "time": 1561549355311, "rating": 5.0, "text": "Fast response and great communication", "pics": null, "resp": {"time": 1561988267899, "text": "Thank you for the review Mr. Mitchell! We appreciate you choosing Skelton's Heating & Air!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110121335749115360858", "name": "Chris HAAG", "time": 1560268193267, "rating": 5.0, "text": "Punctual and reasonably priced.", "pics": null, "resp": {"time": 1560819079645, "text": "Thank you for the review Mr. Haag! We appreciate your feedback and for choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114442082650008562639", "name": "Donnie Miller", "time": 1597092579188, "rating": 5.0, "text": "Worked on refrigeration equipment", "pics": null, "resp": {"time": 1597150870321, "text": "Thanks for the wonderful review, Mr. Miller and for choosing Skelton's for your HVAC-R needs!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104736997831695893546", "name": "Elizabeth Powell", "time": 1547420124177, "rating": 5.0, "text": "Technicians were on time, fast and courteous", "pics": null, "resp": {"time": 1550755450006, "text": "Glad to hear about your experience! Thanks Elizabeth"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "118204916948504231144", "name": "Carolyn Sherer", "time": 1564840236530, "rating": 5.0, "text": "Thorough and pleasant serviceman", "pics": null, "resp": {"time": 1565019841041, "text": "Thank you for the great review! We love hearing back from our customers."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "111426662983998819208", "name": "John Vasko", "time": 1572276112460, "rating": 5.0, "text": "Outstanding service", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "112810679840075832535", "name": "Brad Kauffman", "time": 1565636335161, "rating": 5.0, "text": "David was great!", "pics": null, "resp": {"time": 1565704904503, "text": "Thank you for the review Mr. Kauffman! We appreciate you choosing Skelton's Heating & Air."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "114501650843291739123", "name": "Allison Coleman", "time": 1568437472543, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1568720669967, "text": "Thank you for the review Allison!"}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "104599831241857314447", "name": "Lauren", "time": 1565803737809, "rating": 5.0, "text": "The best of the best!!", "pics": null, "resp": {"time": 1565877421856, "text": "Thank you for the review Mrs. Riley! We appreciate the kind words."}, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "110929173315117706249", "name": "Patricia Campbell", "time": 1629481197861, "rating": 5.0, "text": "I live out of town and was in town over the weekend looking for a house. Placed a contract on a house and called Skelton’s Hesting and Air to have the AC systems checked out. I spoke with Steve who Listened and stated he could have someone out there the same day to have the systems checked.. Very nice, professional and efficient couldn’t ask for a better company!! Thank you so much Steve for sending Ethan out to the home.. I look forward to doing business with Skelton’s!!", "pics": null, "resp": null, "gmap_id": "0x888915bfffffffff:0x62a3539e3e6fd484"}
{"user_id": "101825827717446695549", "name": "Bill Moody", "time": 1621694670882, "rating": 5.0, "text": "Had never been there and was pleasantly surprised at the level of customer service, greeted by several people and was given instant attention by a James Taylor. Very knowledgeable about the questions I had for him and knew the product I was asking about. If you need help with a project, go there I think any of the gentleman behind the counter will be more than happy to help", "pics": null, "resp": {"time": 1621870189562, "text": "Dear Bill, thank you for taking the time to leave us this outstanding review. We will be sure to pass along the kind words to our Auburn team. We appreciate your business!"}, "gmap_id": "0x888ced67cf4399e1:0xf4d3be8de1180fa8"}
{"user_id": "108446901911264276978", "name": "Walter East", "time": 1621533732512, "rating": 5.0, "text": "Always good service.", "pics": null, "resp": {"time": 1621606137576, "text": "Dear Walter, thank you for taking the time to leave us this excellent review. We are pleased to hear that our service is matching your expectations. We appreciate your business!"}, "gmap_id": "0x888ced67cf4399e1:0xf4d3be8de1180fa8"}
{"user_id": "104406998804281526891", "name": "Jeremy Davis", "time": 1564239958611, "rating": 5.0, "text": "Good heating and air conditioning parts.  Great  employees there", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xf4d3be8de1180fa8"}
{"user_id": "114531235001579235325", "name": "Carolyn Way", "time": 1449061028527, "rating": 1.0, "text": "If i could have clicked Zero stars to rate my experience in this store I would have. The man behind the register was the rudest person i've ever encountered. I asked him a question and he rudely responded and when I told him i'd not be back in his store he stated that was fine. I don't know if he was the manager or an employee but there was no excuse for his rudeness. If they treat all their customers the way i was treated they won't be in business at that office long.", "pics": null, "resp": null, "gmap_id": "0x888ced67cf4399e1:0xf4d3be8de1180fa8"}
{"user_id": "111830335915210966094", "name": "Mary McKinnon", "time": 1615413665430, "rating": 5.0, "text": "The entire staff has been helpful and professional! Thank you Gary, Carla and Katie for your information and guidance. Gary went out of his way to accommodate our crazy schedule. He is so knowledgeable.\nMason, Jaq and Clay arrived on time, they were professional and informative. The work was done in a timely manner, very neat and clean with attention to detail. When they were done, there was not a spec of anything left. Thank you for a job so well done!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105230352555970076559", "name": "Katie Willis", "time": 1615214598055, "rating": 5.0, "text": "I have been using Total Comfort for about 3 years. They have always exceeded my expectations. I highly recommend this company for your heating and air needs.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101848659199817744753", "name": "M Tyree Wilson", "time": 1615245718678, "rating": 5.0, "text": "From the initial PHONE CALL TO THE FINAL \"FIST BUMP\" AFTER THE INSTALL....We knew we made the right decision going with this company...The rep we set up the appointment with....EXCELLENT...The guy(Gary) that came out to do the estimate....EXCELLENT and HONEST ....The guys who performed the Install....you guessed it EXCELLENT !!!!!!  My family and I are very pleased with everything that was presented and performed....couldn't  ask for better service...Total Comfort Heating and Air is the TOTAL PACKAGE of Honesty, Service, and Professionalism ....", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115900475656183536320", "name": "C Mallory", "time": 1613170718093, "rating": 5.0, "text": "This was my first time using this company, but it definitely will not be my last. I called on a Saturday when my furnace went out, which was actually beyond repair and had to be replaced. They were very polite and courteous and I am well pleased with my new furnace.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113602914220390636913", "name": "kristy templeton", "time": 1619822066833, "rating": 5.0, "text": "Great place. Harry is the best", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116000666929995139166", "name": "Sylvia N.", "time": 1594749016827, "rating": 5.0, "text": "Total Comfort Heating and Air is an excellent company, fully committed in delivering the absolute best service to its customer base.  The HVAC technicians are highly knowledgeable and very professional.  They  efficiently get your home back to the right temperature at a reasonable cost.  Chelsea, in the office, schedules appointments with the lowest wait time.  Harry, the service manager, is responsive to individual customer's needs and intends to exceed their expectations.  Big hearts all around with these people!  I wish other companies were this sincere in pleasing the public.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104536524850114481739", "name": "Ambera Law", "time": 1597178162181, "rating": 5.0, "text": "Total Comfort Heating & Air, they came out Saturday my system had frozen-up, water was leaking into the room below. .I was told me what to do over the week-end, they said they would return on Monday.\nThey came that Monday morning and did everything they said I needed and extra work to get my system up and working in a timely manner.  Total Comfort Heatimg & Air is a great company.  They stand on you word Thank God for a company like theirs.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102979794026874090819", "name": "Mrs Johnson", "time": 1585792019656, "rating": 5.0, "text": "I have to say that the one person I spoke with was very polite and professional. I called their office and Mrs. Danielle pick up with a very polite and professional voice. I have several questions and she didn’t hesitate to answer any of them. I could tell she was very busy as she did have to ask me to be put on hold a few times,( which wasn’t a problem)  but each time she came back she would always apologize and make sure she helped me in any way she could. With everything going on in our world this is someone you would enjoy talking too. This to me is how you would want your fore front of your business to be. I will have no problem recommending this company or recommending Danielle to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107878549000939758028", "name": "Taylor Stinson", "time": 1584115066649, "rating": 5.0, "text": "Landon and Justin who did our install were awesome. Really professional and knowledgeable about what they were doing. Cleaned up their area after finishing.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102574868619350222877", "name": "Kekke Young", "time": 1591137434330, "rating": 5.0, "text": "Brett was our technician. He was very knowledgeable and efficient. He answered all of our questions.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103872905813969068339", "name": "Kamren P", "time": 1557589403567, "rating": 5.0, "text": "I would definitely recommend this company . I called on Sat morning around 5am & someone was able to come out around 9am I only had to pay $50 for them to come out , which was awesome considering that it's the weekend . Some other companies charge a much higher fee to come out on a Sat . My technician was Tyler . He was excellent! As a woman , he made me feel very comfortable. He explained the situation clearly and informed me of my options . I didn't feel pressured , swindled , or hustled like I have by a technician from another company . He was very honest . I will definitely call them in the future .", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "106727059176347965656", "name": "Alphonso Hicks", "time": 1551189322864, "rating": 5.0, "text": "My system was installed in 2014 by TC. I wasn’t impressed with the old owners, and the way they did business. The new owners are great and the Technicians are so much better than what we’ve seen in the past. Eddie did the maintenance recently and did a great job. Found some issues from the initial install and took care of them at no cost to us. Really appreciate the new owners and staff.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116485098488885127631", "name": "Helen Nuelle", "time": 1587057457544, "rating": 5.0, "text": "My air conditioning was not functioning and the company came in checked it out  and made recommendations to correct the problem. Our new system is efficient and it was installed quickly.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104628025315581346224", "name": "Earl Cambron", "time": 1587401676049, "rating": 5.0, "text": "Great experience working with Fisher. Would highly recommend Fisher and Total Comfort!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109325264806551925344", "name": "Jackie Jones", "time": 1529522455313, "rating": 5.0, "text": "Thank heavens Total Comfort Hearing & Air is under new ownership! In June 2017 we replaced our old units with two American Standard ac & heating units under the previous owner and the installers were awful.  We had small gas leaks on both units, insulation around the refrigerant lines was half ass done on the downstairs unit and not even replaced on the upstairs which was dried & cracking, etc.  When I called to have the has gas smell checked out the new owners were eager to get someone sent out immediately. The smell was intermittent so I wasn't sure if there was an issue. The first time Sonny came out & took care of the downstairs gas smell.  A few hours after he left the air purifier wasn't working.  Eddie came to our house and fixed and also noticed the \"dryer\" was installed backwards on the both units. He corrected both problems in addition to gas smell upstairs, & addressed the insulation on the refrigerant lines.  Eddie was wonderful! We so appreciate the time he has spent to address the install issues. My husband owns a construction company and we've dealt with several HVAC companies for our home & business....hands down we are so impressed with the service Total Comfort provides.  The ladies in the office are the first impression of the company and they are awesome! Total Comfort will continue to receive our business due to the great service & and friendly demeanor of their employees!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118001758079029050263", "name": "Ethan Jones", "time": 1553607042226, "rating": 5.0, "text": "Eddie came out to my parents place yesterday. I really appreciate the time he took taking care of their needs and he was very polite and professional. We had some less than happy experiences with this company before the new owners took over, but it looks like they have really turned things around for the better.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101400546013438362341", "name": "Scott Williams", "time": 1534629838385, "rating": 5.0, "text": "Total Comfort came out this afternoon.  The technician was Harry. He was very polite and informative. We are getting a new furnace installed on Monday. I would highly recommend Total Comfort to anyone. Thank you so much!! Scott Williams", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118330282769401667746", "name": "Anne Vicknair", "time": 1555466308463, "rating": 5.0, "text": "After the last service my AC unit wasn’t cooling properly. Called TotalComfort and Eddie came out on a weekend and found the problem and easily corrected it at no charge. Not many companies will stand behind their work like that anymore. Really appreciate the kind and prompt service.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105028752500394995333", "name": "Sandra Reaves", "time": 1532233096995, "rating": 5.0, "text": "Gary was very prompt, professional, and efficient.  We really appreciated his courtesy. He quickly got our air conditioner up and running.  In this hot weather, that makes him a super hero to us!!  Thank you so very much!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101710032665019373847", "name": "Jason Lane Garrison", "time": 1510971242917, "rating": 5.0, "text": "If you’re looking for a company that’s reliable, professional and do honest work look no more.  I heard Total Comfort Heating was under new management so I was reluctant to call them but did they change my mind when I used them.  Quick to respond, professional and spent the time explaining what was going on with my unit. I’ll definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "114206161975537438313", "name": "Danny Brown", "time": 1519237999196, "rating": 5.0, "text": "My a/c was not operating correctly so I placed a call to One Source Heating and Cooling and asked for a service man to visit and find the problem.The ladies in the office were very nice and professional and arranged for him to come and access the situation. Sonny   ( the serviceman) arrived right on time and quickly found the problem and had me going in about 10 minutes. He was very professional as well and I certainly will be calling them again for all of my heating and cooling needs. They are the best company for their honesty, punctuality, dependability, professionalism and affordability. I'm so grateful to have them.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101362591013178345061", "name": "John Casada", "time": 1556802931639, "rating": 5.0, "text": "We have two HVAC systems. Total Comfort replaced our first system two years ago. Our second started acting up and we called Total Comfort again.\nHarry was quick to come out, located the problems with our system and patiently explained what was wrong. He then discussed all of our options for repairing vs replacing. Unfortunately, we had to replace our 26 year old Trane system. Harry really helped us with this bad news and discussed financing options.  I hate that we have to go through this, but I am so glad that Harry was by our side. Top notch customer service with highly skilled, clean, courteous, can-do technicians. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105835728998287136613", "name": "Carolyn Nelson", "time": 1551885111533, "rating": 5.0, "text": "I’ve dealt with Total Comfort many times from maintenance to repairs and I’ve always been satisfied by their service. Eddy has been out to help us before and always seems to go that extra length to take care of our needs. We really appreciate everyone.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118194960290129854652", "name": "FLYBY", "time": 1562763726122, "rating": 1.0, "text": "Had tech arrive, a young and inexperienced boy, explained the issues with the units, the tech did visual inspection only, never hooked up gauges, stated system is working fine. I realized the system was not working, I called 4 times, no one returned my calls, was not allowed to speak to the Manager, Jody, and was told it would be additional charge to come back. Be careful.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111687842287640898590", "name": "Cheryl Whitley", "time": 1532395636917, "rating": 5.0, "text": "Sonny, the worker that came to help me on my AC today was a very polite, kind, and thoughtful person who took his time to explain everything that he did and why. There aren’t a lot of people who do that and I appreciate that! Thanks Sonny! Thanks Total Comfort for having a worker like Sonny!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105889394043193967911", "name": "Sonya Smith", "time": 1550582580758, "rating": 5.0, "text": "Great experience from start to finish. I talked to Chelsea in the office and she sent Eddie out to service my Furnace the same day. Very friendly and knowledgeable company.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115687673064575666981", "name": "Robert Blackwell", "time": 1557190486154, "rating": 5.0, "text": "Love the new owners and their Service Technicians! Eddie took care of everything we needed and got our AC running the same night. Vast improvements in service since the new owners took over.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118159392435891181927", "name": "Jason Lassiter", "time": 1529373559663, "rating": 4.0, "text": "Amending my original review: after an initial failure to properly schedule my appointment (see original review below) Total Comfort called the next business day to apologize and to make things right. They offered to send a technician right away and offered to waive the service call fee to make up for the inconvenience. I really appreciated this. Anyone who accepts responsibility for a mistake and makes a good faith effort to fix things gets a second chance with me. The technician, who was nice and professional, quickly found and fixed the issue (a simple clog). Before he left we got a call from the owner who explained that there would be no charge for the service. All in all Total Comfort really turned things around and they will get my future business.\n\nOriginal Review: I made an appointment. They did not call and did not show. Can't recommend.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111758707200190541917", "name": "Rick Whited II", "time": 1580313114927, "rating": 5.0, "text": "Everyone I got to work with was extremely polite, knowledgeable and very professional.", "pics": null, "resp": {"time": 1580329942203, "text": "Thanks for the kind words.  We look forward to working with you in the future.\n\nThanks,\n\nKeith"}, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "110398914181633228044", "name": "Alantha Russ", "time": 1549492111308, "rating": 5.0, "text": "Nothing but good things to say about this company. Eddie came out today for the normal maintenance and did a great job as usual. We really appreciate the time Total Comfort puts in to making sure a job is done right.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113603250434133094661", "name": "Sam Henderson", "time": 1513193940984, "rating": 5.0, "text": "Total Comfort came to our rescue!  This winter Charter/ Spectrum caused an electricity surge at my house starting and electrical fire, frying my HVAC system and frying the motor on a refrigerator and freezer. Total Comfort saved us before it got to cold by coming out and quoting us a fair cost and then doing the repairs quickly and with quality work. I know I will continue to use them!  Great people. Great Service. As for Charter, not so much.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113077802862354290261", "name": "Kaz McFly", "time": 1507757543506, "rating": 5.0, "text": "I thought I needed to replace my AC but Harry with Total Comfort came out and spotted the problem and fixed it. He could have gotten me to buy a new unit but didn't. Instead he allowed me to take my time and not make a rush decision by fixing the problem. I highly recommend Total Comfort. Honest, nice and fast service", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112054683527952441907", "name": "Frankie Roe", "time": 1537298221732, "rating": 5.0, "text": "We had a great experience with Total Comfort Heating and Air. Our heat had stopped working suddenly.  When I called the office to make the appt., the lady I spoke with was helpful and courteous. Gary came out, was very nice, and within a few minutes, our heat was up and running again.  Would highly recommend these folks!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115796135556230078853", "name": "Dennis Bryant", "time": 1514481432964, "rating": 5.0, "text": "I bought a unit from this Company 10 years ago and it was an awful experience. To much to list. The unit went down this winter and i called to check on warranty information on the unit. Now this unit was purchased for my parents house and both are disabled. With that said my guard was up. As i placed the call i found that Total Comfort is under new management. Expecting the worst. Boy was i wrong. The new management and ownership at Total Comfort was a huge breathe of fresh air. The team at Total Comfort was honest and up front with me from the start. They offered about as much help to me as they could. The Technician named Soni that worked on my parents unit went above and beyond to take care of my parents. If you had a bad experience in the past then believe me its a new day with this Company. I personally want to say thank you to the team at Total Comfort for bending over backwards to give me any and every option they could. From an angry customer years ago to a customer that will only call the new team at Total for anything me or my family members need. Thank you Total for all your help.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "108884958831092340560", "name": "Belinda Allen", "time": 1552480240874, "rating": 5.0, "text": "Great company. Eddie came and installed a part I needed yesterday. Very polite and friendly.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "106462243790824611238", "name": "J Davis", "time": 1538263104192, "rating": 5.0, "text": "Can’t say enough good things about this company! Gary came out on a Saturday after 6 to fix our air out at Logan Martin. When I say that we were suffering, we were absolutely miserable in this house! It took him less than 10 minutes to fix the issue and cooled down a house full of women who came home after a Pell City mud run to an 87 degree house. Highly recommend Gary and Total Comfort heat and air!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104227104911921229158", "name": "Keely O'Really", "time": 1507751195336, "rating": 5.0, "text": "Very honest and quick to diagnose our problems. We had 2 other companies come out and tell us 2 different things are wrong with our A/C unit only to find out by the Total Comfort tech that that was not the problem and even got our AC running for the time being until we could get it fix. Great service, came on time, and very polite and knowledgable. I recommend them to anyone who is in need of AC repair.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107249620089509103405", "name": "Margret Battle", "time": 1549895264326, "rating": 5.0, "text": "Eddie came out last week to clean our package unit and thankfully caught some small issues before they caused major problems. He gave us a good price for repairs and helped us get financed quickly. Thanks TC", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "114823251808715907424", "name": "Diane Cook", "time": 1509717313129, "rating": 5.0, "text": "Absolutely wonderful experience. I had a total HVAC replacement plus blown in insulation. All technicians were on time, clean, courteous and completely professional. I will give them an A+ for a great job done.\nDiane Cook", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "110252571747897345439", "name": "Kendall Jackson", "time": 1508345789095, "rating": 5.0, "text": "Great experience.  Excellent new management and fair pricing!  Prompt service response.  Would recommend", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "118343884316507232162", "name": "Jason Smith", "time": 1528981857280, "rating": 5.0, "text": "Just had our whole system replaced, and the guys at Total Comfort did a great job. Gary kept in touch with his whereabouts and time frame for the initial service call, and got the broken down system patched up long enough to get the new system in the following morning . The guys showed up with all the equipment before 8am and went straight to work after a friendly meet and greet with our dogs, who love company . They were both friendly and efficient, cleaned up after themselves, finished well before the estimated time frame, and did it all for a price that was on the low side of what we expected to pay . I would recommend these guys for any heating and cooling needs.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112638120573018748044", "name": "Carrie Cotney", "time": 1508346185774, "rating": 5.0, "text": "Great experience! The service technician was polite and worked efficiently to solve our issue.  The new owners have done a great job!  I highly recommend Total Comfort Heating and Air.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109162170761426275872", "name": "Paige Cooper", "time": 1550624401049, "rating": 5.0, "text": "I would recommend DJ for any services needed. He is friendly, courteous, and he cares about his customers.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102310971247175371358", "name": "Dustin Wilkerson", "time": 1506025147764, "rating": 5.0, "text": "Excellent company to do business with. I highly recommend giving these guys a chance if you are in need of any HVAC work. It is my understanding they are under new ownership and are eager to ensure all of their customers are happy. They have definitely earned future business and recommendations from me.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103497448177506047009", "name": "Cal Markert", "time": 1538674854411, "rating": 5.0, "text": "Saved me money with honest access net and only charged 50 for service call.  They knew what they were doing too.  Very pleased", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107910909164138694394", "name": "Byron Williams", "time": 1506026540983, "rating": 5.0, "text": "Thanks to Total Comfort for getting use up and running again. We appreciate the quick service and professional staff that came out to service our HVAC. After the tech explained everything I could readily see the problem and felt very comfortable going ahead with the repair. They where very professional.  We are very impressed.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102483469473439742896", "name": "Nathan Whitaker", "time": 1532552171251, "rating": 5.0, "text": "We are attempting to sell our house and had an issue arise during inspection. Eddie had serviced the unit 2 weeks earlier and everything was in working order. We explained the issue about how we were held up with being able to close because of the inspection. Total Comfort went above and beyond and immediately came to ensure things were ok. Turns out that the inspector was wrong. The unit was working correctly. I video taped it to show the buyers the problem was not Total Comfort. It was their inspector. We have used Totsl Comfort for years and plan to have them install and new unit at our new home later. Eddie is the man!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "102833975545215774331", "name": "debby cochran", "time": 1553105007759, "rating": 5.0, "text": "Brett Shelton,  my service professional, was very nice and knowledgeable.I find they seem to care a lot about the customers.I would totally recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113669696991990263790", "name": "Holly Chapman", "time": 1508343894168, "rating": 5.0, "text": "Thankful for the New Management for quickly repairing my unit. Professional, on time, and trust worthy. I would choose Total Comfort again and again and you should too!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105687209365744763140", "name": "Joe Randall", "time": 1556223222904, "rating": 5.0, "text": "Cody was honest and efficient and took care of my problem. Will definitely call again.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "106416963101575470417", "name": "Terry Payton", "time": 1508431827168, "rating": 5.0, "text": "Glad they have new owners.  The new ones are terrific!   Took great care of us fast and very fair price.  Thanks again!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116135530854596815490", "name": "Stan Paschenko", "time": 1522974279970, "rating": 5.0, "text": "Total Comfort has serviced my Hvac units for the past 3 years. I recommend this company because of their honesty and integrity. No pushy sales pitch.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "114502952986045655299", "name": "Kelsey", "time": 1533700039707, "rating": 2.0, "text": "I had an emergency call after coming home to an 86 degree house. There's technician was extremely friendly but no resolution was provided. Ther problem he said I had wasn't the problem at all. I missed an entire day of work to be told mid morning the next day noon one could come until afternoon. I could've gone to work in AC for the morning! Very disappointed in the level of service provided.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1561393530904, "rating": 5.0, "text": "Just  had total comfort heating and air come to my home and they just installed this new thermostat I could not be more pleased with their work friendly service and the price was just right.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "100014806508020778347", "name": "JP Jones", "time": 1548457707626, "rating": 5.0, "text": "David was very good at  doing his job and knowledgeable. Great personality", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104193186063811139641", "name": "Christy Thomas", "time": 1508334800286, "rating": 5.0, "text": "New owners and management are fantastic!  Good quality customer service!  Very pleased with the work and it was completed in a timely manner.  Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103154610428773387605", "name": "Mike Gillespie", "time": 1521748306276, "rating": 5.0, "text": "Very nice on the phone. Called to let us know the technician was on the way. Technician could not have been more helpful or professional with his explanations and wanting things to be done correctly! Would recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112066480998554444700", "name": "Tracie Lewis", "time": 1532988245046, "rating": 5.0, "text": "The tech was very courteous and professional. He and the company went above and beyond. Would highly recommend Total Comfort!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111504365738794162592", "name": "Jimmy Owen", "time": 1533911415015, "rating": 5.0, "text": "Setting the appointment was easy and the agent worked very well to set the appointment which was convenient for me.\nThe technician was great and explained everything very well.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "100014806508020778347", "name": "JP Jones", "time": 1548457707626, "rating": 5.0, "text": "David was very good at  doing his job and knowledgeable. Great personality", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113929257680473715714", "name": "Blakely Segroves", "time": 1508335157948, "rating": 5.0, "text": "We were so impressed with the new owners!  Prompt and reliable service to repair my unit.  Would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104838347680161208878", "name": "Kandy Kane", "time": 1517325623821, "rating": 5.0, "text": "Eddie was fantastic!!! Very professional and quick at fixing our problem.\nWe will only be using this company from now on! If you have any problems with your heating or air, definitely give Total Comfort a call!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104485638669930952455", "name": "Julian Kit", "time": 1452403280399, "rating": 2.0, "text": "Called them out after our unit stopped working. The guy who came out only saw $$$, down played our system every chance he could. Said its to small for the house (our house is fairly small and it's always keep us plenty warm). Told us our system had rust which was causing the problem but got it working by taking a piece of wire and cleaning out the sensor. Took less than 2 min to get the system working but cost almost 100$ for next to no work. 18 point inspection is also a lie.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116069628066331434626", "name": "Linda Fomby", "time": 1561432782056, "rating": 5.0, "text": "Tyler arrived in a timely manner and solved my problem. Very efficient.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "108609118647522269436", "name": "Betty Gunter", "time": 1554209183188, "rating": 5.0, "text": "Eddie was at our home yesterday and he’s such a sweetheart. We felt a little silly when he told us why our furnace wasn’t working but we’ll know what to look for next time. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109250979916779043766", "name": "Rod Bunn Florida", "time": 1551237401995, "rating": 5.0, "text": "Dj was courteous and knowledgeable and did a great job, I would recommend him to everyone I know", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "117897145988813417931", "name": "Joanne Walker", "time": 1518805959381, "rating": 5.0, "text": "Great Service starting with the operator who took my request for a service call, to the technician who came. Thank you Sonny for being on time, courteous, polite and your very thorough checkup of our heat and air system.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "117234910230057958256", "name": "Curtis Nargo", "time": 1471549923324, "rating": 1.0, "text": "Total comfort heating and air LLC today August 18, 2016 as I am traveling down for 59 in Hoover I started hearing cracking sounds on my windshield as I got closer to the source while other cars were swerving to get away from this truck that was carrying loose rocks in the back of a small flatbed trailer uncovered and rocks falling all over the highway.  I saw two cars get struck with windshield broken my car was struck twice\nwith star break cracks in windshield, and as ice sped up to get around this total comfort heating and air truck IT LOOK LIKE HE WAS JUST LAUGHING AT ME!  I dialed there number tried to call but they kept hanging up on me stay away from this company if they don't have enough sense to haul gravel in the proper way.Bad reviews on these guys. !!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "109250979916779043766", "name": "Rod Bunn Florida", "time": 1551237401995, "rating": 5.0, "text": "Dj was courteous and knowledgeable and did a great job, I would recommend him to everyone I know", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "117234910230057958256", "name": "Curtis Nargo", "time": 1471549923324, "rating": 1.0, "text": "Total comfort heating and air LLC today August 18, 2016 as I am traveling down for 59 in Hoover I started hearing cracking sounds on my windshield as I got closer to the source while other cars were swerving to get away from this truck that was carrying loose rocks in the back of a small flatbed trailer uncovered and rocks falling all over the highway.  I saw two cars get struck with windshield broken my car was struck twice\nwith star break cracks in windshield, and as ice sped up to get around this total comfort heating and air truck IT LOOK LIKE HE WAS JUST LAUGHING AT ME!  I dialed there number tried to call but they kept hanging up on me stay away from this company if they don't have enough sense to haul gravel in the proper way.Bad reviews on these guys. !!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "100491457408749197288", "name": "James Howlett", "time": 1548079637813, "rating": 5.0, "text": "Eddie came out and took care of our Furnace quickly and gave us a great price for the repair. Will be using this company in the future.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116877214747386098871", "name": "Vista Brooks", "time": 1511888452106, "rating": 5.0, "text": "Awesome Company!!! New management that still believes in making sure that mistakes that were made before are fixed. Quick service and a great staff!!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115805444616248996214", "name": "Lillian Wilson", "time": 1518110606791, "rating": 5.0, "text": "They have always been on time and very polite people.I am so glad we used them for our heating and air :)", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "101664908758993034918", "name": "lori krauss", "time": 1538437990502, "rating": 5.0, "text": "Can not say enough about this company and Gary Dailey.  We noticed our air was not working around 3 pm on a Saturday. We were at our lake house in Talladega. I called four other companies, that said they were 24/7. None would return a call. No one even answered. I called Total Comfort and spoke to Gary. We were almost near heat stroke at this point. He could sense the desperation in my voice. He said let me make a few calls, and if I'm able I'll be on my way. Ten minutes later he called back and said he was on his way. Drove from Gardendale to Talladega to look at our unit and see what could be done. He was a lifesaver. It was the capacitor. He had a new one on his truck, and fixed it within 30 minutes. What normally would have cost a lot, on a Saturday evening was a few hundred bucks or so. I would have given them 10 stars if I could have. WE WILL NEVER USE ANYONE BUT TOTAL COMFORT AGAIN!!! IM not a person that leaves reviews, but I have never seen such amazing customer service EVER.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115761879127646288402", "name": "Zach Batizy", "time": 1532482949214, "rating": 5.0, "text": "Was quick and efficient. Helped solve the problem really well\n\n-Sheila Batizy", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104343834658584824161", "name": "Jay Cardwell", "time": 1561571865050, "rating": 5.0, "text": "Harry did an outstanding job and he was very professional", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "113761514497167857297", "name": "Mora Taylor", "time": 1532634527220, "rating": 5.0, "text": "Sonny was very professional and explained the process very well. I would highly recommend Sonny and Total Comfort Heating and Air.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107714613861743316478", "name": "Terrance Darling", "time": 1535042841384, "rating": 5.0, "text": "Great job!! Knowledgeable technicians!!! Thanks Harry and Sam.\n\nMr. Darling", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "112571339437103197529", "name": "B K Gray", "time": 1479396327597, "rating": 1.0, "text": "Worst experience I ever had. Do not, and I repeat do not use this company. Misleading techs, customer service is terrible. Been trying to get a refund, will not return phone calls. I have a service level agreement, and had to buy a new unit from them(which now I don't believe I needed), and they treat you like crap. Everything is about $$$ to them. I agree with Julian", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "110694646758577205270", "name": "Madison Garner", "time": 1476112690703, "rating": 1.0, "text": "They are very unloyal and misleading to their employees! The owner has very bad anger issues and treats people with the upmost disrespect! I wouldn't dare recommend their services not only because of how he does his employees, but by his general characteristic traits. Also the fact that he only hires \" attractive young women\" ( for office work), is also very disturbing and discriminating. He also doesn't seem to concerned with his customers either. Unless your buying a new unit or signing a service agreement you mean nothing to him.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "103420134858817003549", "name": "Bryan Blackmon", "time": 1419466177952, "rating": 1.0, "text": "Right Now, Christmas Eve 2014 marks less than 6 months with my new system (old one was 20+ years old and died) from this company. The installation re-used some of the parts from the old system. I have had to call them back out now for the third time in less than 6 months to check on the system and while the people are very friendly, I am highly unsatisfied. A unit of this age (when properly installed) should have zero issues cooling a townhome of my size and should (in general) have no problems. It is now Christmas Eve 2014 and all creatures are stirring because the damned-new HVAC Heat Pump will not cool off my home. Thanks.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "115575444048383948735", "name": "Lonnie Moore", "time": 1531766568428, "rating": 5.0, "text": "Technician showed up on time, assessed the problem and quickly fixed it. You can’t ask for more than that.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "108675675785003002378", "name": "Barbie Moore", "time": 1531521363757, "rating": 5.0, "text": "Extremely friendly and fast service 🙂🙂🙂", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "105021074932365765154", "name": "Calvin D Tucker II", "time": 1534471494742, "rating": 5.0, "text": "Service above excellent!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107203651313049263635", "name": "Jessica Ray", "time": 1517327150208, "rating": 5.0, "text": "Very professional, excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "104649681239390663386", "name": "Soleado C", "time": 1542318335478, "rating": 5.0, "text": "Awesome!!!!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "107730982926432524954", "name": "Joseph Jackson", "time": 1524310797884, "rating": 5.0, "text": "Honest, Experienced, Trustworthy, Timely, and Fair.", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "116222252261829068368", "name": "Joycelyn Oden", "time": 1383671868915, "rating": 5.0, "text": "I had a very good experience with this company! I will be using them again!", "pics": null, "resp": null, "gmap_id": "0x88891edcafc0f967:0xaa7b968364d0c0f7"}
{"user_id": "111176584781685606903", "name": "Chaney Champion", "time": 1610238628685, "rating": 5.0, "text": "Very good place to work at", "pics": null, "resp": null, "gmap_id": "0x887d37d9c940e1a1:0x684ae08e1b59f2ed"}
{"user_id": "117735081048000748723", "name": "Abdulkadir Jama", "time": 1594998702130, "rating": 5.0, "text": "They do unload quickly", "pics": null, "resp": null, "gmap_id": "0x887d37d9c940e1a1:0x684ae08e1b59f2ed"}
{"user_id": "108755016848460665912", "name": "will beano", "time": 1553200309232, "rating": 3.0, "text": "Stopped in to ask about a filter for my home. The lady in the office was new at the time so she ask a guy to help. I believe the guy was new also. Had no clue what was talking about I think he was more concerned about his preppy looks than his work. I wanted to tell him his pants where way to short with his brogan shoes.\nAccording to him after he walked back towards his office I over heard him say I didn’t know what I was talking about but I guess my 25 years in HVAC experience didn’t count.\nHe stated he was the so called vp but heck seems these days all the kids that graduate think they are.", "pics": null, "resp": null, "gmap_id": "0x887d37d9c940e1a1:0x684ae08e1b59f2ed"}
{"user_id": "102075704065772396123", "name": "Carolyn Robards", "time": 1562941862442, "rating": 5.0, "text": "My older Trane A/C motor went out on an extremely hot day. I called that day at noon and they had a technician out before closing. My part was something they didn’t have on hand but they went above and beyond to get it for me as soon as possible. They installed it immediately and everyone I came in contact with was very professional, friendly and explained everything to me. I highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "102062891148250064430", "name": "David Pilkington", "time": 1584537459048, "rating": 5.0, "text": "Skelton Heating,Cooling is one of the highest quality Companies you can use for your heating and cooling needs.there Tech's are prompt and courteous.Quickly identifies problems and efficiently solved them.A company with solid footing.You can't beat the value.I would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "115563419972717478355", "name": "Melissa Atemon", "time": 1547231104261, "rating": 5.0, "text": "We had gotten an estimate from another company previously and not only were they pricier, but we also had to pay for the estimate. Brian came out and gave us an estimate and explained everything very clearly. The day of install they were early and got to work right away. They did an excellent job and were very professional. I will definitely be using them for our future HVAC needs.", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "103125248201686865833", "name": "Andy", "time": 1520385386918, "rating": 5.0, "text": "Purchased a brand new Trane A/C system.  They beat the next lowest proposal by $350. On top of the best price,  installation was well done.  Experienced technicians were punctual and did a great job; hauled old equipment away; new, larger pad; everything picked up and cleaned up.  Oh yeah, and the salesman was knowledgeable, courteous and respectful.\nGood company.", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "108853808135747173018", "name": "larry lang", "time": 1563324773644, "rating": 5.0, "text": "Top quality service from the ladies in the office , maintenance crew and the installers of my new unit. Job well done in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "109740601281087611171", "name": "Debbie McCrobie", "time": 1508792158646, "rating": 5.0, "text": "I have been using Skeltons since the owner started his business, working out of 1 van. Brian and his company have serviced my home for years. We also use them where I work and we have no complaints. They are all very nice, and know what they are doing. Starting with Amanda, in the office to all of the service techs,  its one heck of a company. We appreciate all you do for us.", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "108313895200022423264", "name": "Sammie Fowler", "time": 1487888157749, "rating": 5.0, "text": "I recommend Skelton's to everyone.  They have maintained our air conditioners for 5 years now.  They have come out on the weekends when we needed service and we will be calling them to replace our older unit when it comes time.  Great People! Fantastic Service!", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "110946371442627690558", "name": "Matt Blair", "time": 1515693168020, "rating": 5.0, "text": "We've been using Skelton's for years. They are a good family owned business that provides exceptional service. I use them for any HVAC needs at my home and my business. They just recently fixed an attic furnace at my home. Jonathon was professional and courteous. He arrived on time; then he diagnosed and fixed the problem in less than an hour.", "pics": null, "resp": null, "gmap_id": "0x88895bc15137aa51:0xf4e385ba3419af66"}
{"user_id": "112175510420915674941", "name": "Tom Solley", "time": 1538947520859, "rating": 5.0, "text": "Our Chrysler Marine starter quit working. Started to spend $300 for a rebuilt one off eBay, but thought I'd give them a try. Two days later and $58, she's as good as new. Couldn't be happier, will use them again for sure.", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "115573881529570838898", "name": "Wes Bryant", "time": 1376186178434, "rating": 5.0, "text": "Stopped by Brown-Keahey on the recommendation of a friend.  Had a question about my starter.  They were closed (Saturday) but Donnie happened to be there.  He took time on his day off to answer questions about my starter and showed me some side projects he was working on.  Much appreciated!", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "103023812073291090437", "name": "Roger Prine", "time": 1519494149221, "rating": 5.0, "text": "The place to go for rebuilding your alternators are starters for that you can't find in the store", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "114600010431387947517", "name": "Rod Cromer", "time": 1496128418017, "rating": 4.0, "text": "Starter and alternator experts", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "104286523305506329040", "name": "Al Rhoney", "time": 1618521671730, "rating": 5.0, "text": "Every single time I've had a need to have maintenance, repair, or like today, a total replacement of my HVAC units, I've always used Mid-South Heating and Cooling. You couldn't pay me to shop for a better price. Whatever I've been charged over the years, I'm confident that the price was fair. All the technicians that I've met have been polite and professional. It feels good to have confidence that I can trust Cary and his team.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "116570261419637651974", "name": "JP Runyon", "time": 1623174087269, "rating": 5.0, "text": "Jeremy Busby was exceptionally professional, knowledgeable, and quick to respond to making repairing our HVAC a priority!\nI would highly recommend MidSouth Installers!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "113434742026923765592", "name": "Robert Partington", "time": 1619390683802, "rating": 5.0, "text": "Cary did excellent job in repairing HVAC. Very professional. Explained everything he did and why it had to be done. Gave me options on different levels of repairs or replacements. Prices were very reasonable. Very satisfied with all the work done. I will recommend him and his company to anyone that may ask for a recommendation. If I ever need HVAC service midsouth installers will be the company I call.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110273271052829145819", "name": "Ken Johnson", "time": 1620760081221, "rating": 5.0, "text": "Knowledgeable technician and excellent service at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117680521985555354417", "name": "Di H", "time": 1602883250047, "rating": 5.0, "text": "We love this company. We have been with them for 11 years. They have come through for us when our AC was out multiple times in 96 degree temps. They just replaced 1 of our 3 old 20 year old heating and AC systems with a whole new system. When we compared to the two other replacement estimates we got from two other companies, the savings on our new system through Midsouth Installers was hundreds of dollars. They handle the seasonal maintenance for all of our systems as well. They are always prompt courteous and professional!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "108661297657068972156", "name": "Sandy Berglund", "time": 1617053398486, "rating": 5.0, "text": "We have used Midsouth for at least ten years and we have been nothing but pleased.   They are efficient and pleasant and offer to help us with ancillary work.  We highly recommend Midsouth!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110214680180705042301", "name": "torrie thomas", "time": 1599195839128, "rating": 5.0, "text": "Damien and his crew are wonderful!!! I would recommend to any and everyone! Our AC went out on what felt like the hottest week, but we had zero worries all thanks to mid south! Damien had me intouch with Carey and in a 6-7 min phone conversation had us set up with an AC unit and all the financial steps finished with every question answered!! They quoted the prices upfront and were very kind! They came out next day and the crew, mark and Brandon, were on time, fast, and professional! Everyone was great! I can’t thank them enough!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "102650428948421916818", "name": "Danny Niblett", "time": 1622086354907, "rating": 5.0, "text": "Great place for the kids to be able to stay cool", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117177943439376721635", "name": "Rebecca Hutchinson", "time": 1620074817668, "rating": 5.0, "text": "Very knowledgeable and reliable service.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117078229298204673217", "name": "Timothy Wynn", "time": 1615821588931, "rating": 5.0, "text": "Midsouth replaced the board on our older furnace; hoping to get a few more years out of it now. Great service!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "113347187635679801879", "name": "Robert Hallowell", "time": 1580582253636, "rating": 5.0, "text": "Best experience I’ve had with a heating and air company. Prompt and informing answers to all my questions. Their attention to the smallest details were among the reasons we decided to go forward with them and we couldn’t be happier with our decision. Very attentive to their customer’s needs. Would recommend to family, friends and to some people I don’t even like, they are that good.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "116274739564368635302", "name": "shelly Baker", "time": 1582727673041, "rating": 5.0, "text": "I'm with a local fire department and they came out and did an outstanding job. They were so professional.  When I called I was told the time that would be showing up and they were there on time. I would definitely recommend them.  We will be using them in the future for all our heating and cooling needs.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "118194231576244467937", "name": "Darlene Stokes", "time": 1613411696138, "rating": 5.0, "text": "Fast and friendly service.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110521320042586420019", "name": "David Evans", "time": 1622238915293, "rating": 5.0, "text": "Good Service", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "114446550656662265254", "name": "Jerome Mckinstry", "time": 1591387200775, "rating": 5.0, "text": "I called to get info on a home that I wanted to buy in Ga.; even though the home was not in their market the lady that answered the phone was very professional and answered my questions and advised me the best that she could under the circumstances. I wish that I could use them in Georgia.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "118376889761529242329", "name": "Peter Bosworth", "time": 1614629783022, "rating": 5.0, "text": "Great, speedy service", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "105701534834433724359", "name": "Darren Brown", "time": 1565120326720, "rating": 5.0, "text": "After many years in real estate, Midsouth is the only hvac company I use on my rentals, flips and personal home.   An honest broker.  Trust Chris and Midsouth installers heating and cooling inc.,", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "102854413666403613048", "name": "Dance Dad Piper", "time": 1491590860885, "rating": 5.0, "text": "I am so impressed with Midsouth Installers. Matthew was our technician and he was there to help us get our system fixed and that he did. Courteous, professional, efficient and cost effective. We will definitely use them to upgrade to a new unit in the future. This was a great experience. I see that I am one of many who are completely satisfied.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "101304664607659678482", "name": "Frances D", "time": 1574892966861, "rating": 5.0, "text": "This company was very courteous and prompt from start to finish. I had to call them for a quote regarding a full HVAC replacement and they went above and beyond. They beat everyone's quote and timeframe for completion. The guys that came out for the install displayed their professionalism from the very beginning. I will definitely refer them to my neighbors.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117888311918859051710", "name": "Jerimie Goike", "time": 1557330707939, "rating": 5.0, "text": "Tech was on time and did the work needed on the unit.  Didn't realize how low the freon was.  He refilled the freon and now it's making the unit cycle better and the house is more comfortable without working itself to death.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "100700726000047491296", "name": "Ali D", "time": 1563232593425, "rating": 1.0, "text": "Terrible, horrible, awful would not recommend to anyone.  Only one of the three technicians they sent out were competent.  Our AC was out one month June 14 - July 15 and they repeatedly misdiagnosed what was wrong with our ac and expected us to pay for their mistakes.  We are pretty sure they broke the ac coils (we didn't have problems before they messed with it) and they re-wired our thermostat incorrectly.  I had to call constantly to get updates and no one seemed to have a clue.  Customer service is poor to say the least.  Once we FINALLY got the ac fixed they wanted to dispute the invoice.  DO NOT HIRE MIDSOUTH TO DO ANY AC WORK!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "113222476061334741788", "name": "Cross Fire", "time": 1531598520537, "rating": 5.0, "text": "Great company, honest and so easy to deal with. I choose my contractors based on their personality and how they act.  Mid South was honest from the start and they were able to get out the next day to replace my coil.  I had several questions for the company who originally installed my 4 year old central AC unit (3D) and they dodged me like the plague which says so much about their business. Mid South was completely honest, very personable, friendly  and I could go on.  If you need hvac help call Mid South and don't waste your time with anyone else.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "115951043489281079591", "name": "Brian Gullage", "time": 1562637587587, "rating": 2.0, "text": "$616............for 2 twenty dollar capacitors and a 15 minute service call.  So my previous 5 star review has changed.\n\nI have been a very loyal customer of Midsouth, and I have recommended them to numerous people. I have always given them excellent reviews.\n\nI know small businesses have high expenses and need to make a profit, but overcharging a loyal customer that sends you referrals has consequences.", "pics": null, "resp": {"time": 1563388442904, "text": "Hello Mr Gullage,\nI hope you are doing well. I just wanted to make a quick response to your negative feedback. We actually charged you 485.00 for (2) pounds of Freon and (2) capacitors. This is a very competitive price in our area for the service that was performed on your HVAC system.\n\nWe always give upfront pricing before any work is completed. You had the option to approve or decline the work  before any work was performed on your system. You approved the work order and then we made the needed repairs. Please feel free to reach out to us if you have any more questions or concerns. You can contact our office @ (205)730-1270. As always, we appreciate your business!!!\n\nWe do our very best to stay as competitive as possible to help our customers."}, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "109708197216913336181", "name": "Annette Branham", "time": 1525902458728, "rating": 5.0, "text": "Midsourh workers came out on Friday night and successfully got our air COOLING!!! They were knowledgeable and extremely courteous and gave us an estimate for the cost before\ndoing the job. We are pleased with their service and are happy to recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "102992308458264089892", "name": "Jana Caffee", "time": 1583750386282, "rating": 5.0, "text": "Professional, quality work! Very reasonably priced. Able to come out quickly and fix it quickly! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117206615328333641569", "name": "Donna Comer", "time": 1515865869410, "rating": 5.0, "text": "Very nice folks to deal with.  Dependable, honest, caring people.  would not hesitate to recommend them to anyone...", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110304832507495679650", "name": "Cathy Rogoff", "time": 1530215653262, "rating": 5.0, "text": "The Customer Service was outstanding from the first call I made to set up the appointment.  The serviceman did an excellent job!\nI will put them at the top of my list for any HVAC service!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117905815088185893724", "name": "Loretta Brown", "time": 1516001788640, "rating": 5.0, "text": "We have used Midsouth for many years and two houses, they are clean\nand courteous people. They would not tell you that you needed something replaced if they didn't mean it. It is hard to trust someone these days but this company is very honest.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "107855090667390866006", "name": "C N", "time": 1547565000903, "rating": 5.0, "text": "Here to handle all of your home or business heating and cooling needs. Great at preventive maintenance, service, replacements and ductwork. Several financing options available if needed.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "101799867838514070433", "name": "Tonya Head", "time": 1463667412941, "rating": 5.0, "text": "Thank you so much you guys for all the work you did, not only were the good , and fast, they were one of the nicest group of guys! You don't always find that in a company these days! Thank you so much !!!!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "108960374770609188551", "name": "Dionne Lovett", "time": 1515285185261, "rating": 5.0, "text": "Cary came to my house and went above and beyond as far as courtesy and service.  He followed up with me to make sure everything was good.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110070627375908456997", "name": "Brad and Barbie Anderson", "time": 1549425109327, "rating": 5.0, "text": "Chris Long and the Midsouth team went the extra mile to quickly take care of an emergency for us over the weekend, providing quality equipment and service, and did so at very competitive prices. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "103570436447230159599", "name": "James Mann", "time": 1602020015786, "rating": 5.0, "text": "Midsouth did a great job and they stand behind their work.", "pics": null, "resp": {"time": 1553528056315, "text": "Hey Mr. Mann, Thank You so much for leaving us a awesome review and Thank You for your business!!!"}, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "114502934635576414204", "name": "Tonya Formby", "time": 1464556485765, "rating": 5.0, "text": "Midsouth is great! Cary has come out twice to work on my AC and I am always so impressed. Very friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "105252939778968260156", "name": "Jonathan Sharpe", "time": 1530130922805, "rating": 5.0, "text": "Very fast service and friendly staff. Did what others could not deliver. A+", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "108495358283269458100", "name": "Joe Thomas", "time": 1581505078739, "rating": 5.0, "text": "Professional , great service, job well done", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "109676966942712753740", "name": "Kay Zarzour", "time": 1472754149880, "rating": 5.0, "text": "Midsouth Installers Heating & Cooling have been very reliable and prompt.  I have referred them to others in need of HVAC inspections and servicing.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "111574630910316494272", "name": "John Phillips", "time": 1456881307807, "rating": 5.0, "text": "Our family has trusted Midsouth Installers for years.Very professional service technicians that always help us feel comfortable with our HVAC repairs or units in need of replacement. We would recommend Midsouth Installers Heating & Cooling to other friends and family!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117481997981414674522", "name": "C. Duggan", "time": 1623783060999, "rating": 5.0, "text": "Fast service, diagnosis and repair. Reasonable charges.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "102274042994523873744", "name": "Chris DeLoach", "time": 1516791279057, "rating": 5.0, "text": "They're trustworthy, punctual, and reliable. Great company.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110675241984936635979", "name": "Ray Browne", "time": 1516979239578, "rating": 5.0, "text": "Friendly, kind, and honest service. They are your friend in the heating and air business.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "104754665558477981506", "name": "Deborah Jackson", "time": 1515079257882, "rating": 5.0, "text": "Simply flawless, start to finish.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "104643789168640372751", "name": "Nik Layman", "time": 1531428693484, "rating": 5.0, "text": "Techs are always on time, friendly and go a good job", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "106451326950475209667", "name": "Jacquline Fink", "time": 1604514351707, "rating": 5.0, "text": "The guys were very friendly and professional.\nThey checked everything and had me cool again in no time.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "113536049843483969436", "name": "Jonathan Barrett", "time": 1515688853889, "rating": 5.0, "text": "These guys know what they are doing!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "117113039709731753275", "name": "Felisa Hsu", "time": 1528987359662, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "116689626499084255301", "name": "Lady Girardi", "time": 1490997672072, "rating": 5.0, "text": "Great experience !!!!", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "110440993876602175793", "name": "Jason Black", "time": 1623689246295, "rating": 5.0, "text": "Jeremy Busby did our maintenance and repair. He was incredibly respectful and knowledgeable. He didn’t try to sell me on anything “extra” or anything I didn’t need. He was thorough in checking my unit from top to bottom and making sure everything was taken care of. HIGHLY RECOMMEND", "pics": null, "resp": null, "gmap_id": "0x88891c0bae706b65:0xc7adc74a2299ccb1"}
{"user_id": "113330989695341805984", "name": "Tracy Gibson", "time": 1601398783318, "rating": 5.0, "text": "I wouldn't call any other company for my Heating/Cooling issues. They are always prompt, extremely kind and helpful and, more importantly, honest. They go out of their way to make sure to determine the problem and get it fixed in the quickest, most thorough way.  They are always glad to explain everything to you and answer any questions you might have.  Everyone that works for this company is an asset to company and the community!!  I especially give kudos to Will (today) Tyler, Cindy and Megan.", "pics": null, "resp": {"time": 1611604856622, "text": "Thank you for the kind words. We do our best to make sure our clients know exactly what is going on with their unit."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103644750593283308875", "name": "Dane Benton", "time": 1534117540932, "rating": 1.0, "text": "Terrible workmanship paired with an equally repulsive attitude towards customers.\n\nOur A/C unit died in August of 2017. Luckily, we had a warranty through Old Republic, which paid for a replacement unit. Unfortunately, however, the company that Old Republic required us to use for installation was 5 Star Heating and Air Conditioning out of Foley, AL.\n\nOver the past year, we have experienced several issues with our new unit not cooling the house properly. About two months ago, we came home to soggy carpet and buckled wood floors due to the drain pipe for our unit overflowing. My father came by to take a look at the unit and noticed that the \"Safe-T-Switch float valve\", which cuts the unit off if the drain pipe clogs and fills up, was installed ON THE WRONG SIDE OF THE UNIT, rendering it completely useless.\n\nWe called 5 Star and they did come out to the house and move the valve to the correct side without charging us, which we felt was the least they could do since their poor workmanship was the cause of this incident. Over the past few weeks, we noticed that our outside unit would randomly cut off during the day, making the house unbearable to be inside. We called 5 Star, and they let us know that it would be $100 to come out and take a look at it. At this point, I decided to call another company to come look at it rather than paying 5 Star.\n\nThe other Service Man came out and took a look at it and noticed that the inside of the pipe that the float valve was attached to was clogged with sealant, preventing the flow of water. (See attached photos) I'm no plumber, but I can tell you that when you put sealant inside the female coupling, and push the male part in, the sealant has nowhere to go but inside the pipe, which prevents the drain pipe from being able to drain water. He replaced the drain pipe, and put the float valve in the correct place, and amazingly, our A/C unit works like new!\n\nI will be sure to let everyone know how much money my \"no-cost warranty replacement\" A/C unit has cost me thanks to 5 Star's sub-par work.\n\nPhoto 1 - Crazy Straw like drain pipe from 5 Star\nPhoto 2 - Sealant inside pipe (photo taken after I punched a large portion of the sealant out of the pipe)\nPhoto 3 - New drain pipe installed by another {competent} A/C Repair company", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNfTmZE3Bd42fClrv34oV45AuBHNZQe-gBb-dcw=w150-h150-k-no-p"]}], "resp": {"time": 1534874112513, "text": "Dane, we are sorry to hear that you were not satisfied with our options for maintenance. We felt that our repair of the float valve and drain line were sufficient in correcting the problem. We at 5 Star Air Conditioning pride ourselves on excellent workmanship, and truly hope that you understand our position with the 30 day warranty. Please remember proper maintenance is critical, and we are happy to hear that your A/C unit is working properly."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100770903908185367825", "name": "Christina W", "time": 1599008447232, "rating": 5.0, "text": "Amazing service! Was able to text my issue and receive information about service call all via text. Paul M. responded quickly in less than 60 minutes from initial text to arrival. It took him approximately 5 minutes to ascertain nothing was wrong with the system...it was operator error! Paul asked insightful questions about what had happened that day and also explained how the system worked in summer and winter, so I learned a lot about systems down here and how to care for them as opposed to how systems run up North. When we need a new AC, we will definitely call 5 Star Air to do the job!", "pics": null, "resp": {"time": 1613495962444, "text": "Thank you Christina!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "117438774222596833419", "name": "William Metais", "time": 1594468033654, "rating": 5.0, "text": "Amazing company! AC unit quit and they showed up at my residence in less than 45 minutes. Diagnosed the problem and replacement of the entire system was the only option, as the original had served it’s useful life. Was one night without AC and they told me they would be there early next morning to install everything. Unbelievable! In meantime, they loaned me two portable units to keep the house somewhat comfortable. I’ve never heard of that!!!! What a great company! It was also a holiday weekend and they still we’re at my place at 7:00 A.M. the next morning and had the job completed by noon! Price fair and service outstanding. What more could a person ask for? I HIGHLY, HIGHLY recommend!!!!! Have NEVER had that kind of customer service from any HVAC company!!!", "pics": null, "resp": {"time": 1596653034237, "text": "Thank you for the kind words, William!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103811486072982673405", "name": "Greg Summerford", "time": 1607537463428, "rating": 5.0, "text": "For several years, we have relied on the honesty and integrity of 5 Star to provide an accurate assessment and remediation of the HVAC failure of the day. When it came time to replace the HVAC, they provided a variety of options and the chosen one quickly and professionally installed/placed into service. Highly Recommended.", "pics": null, "resp": {"time": 1607539006238, "text": "Thanks for taking the time to leave such a great review!  We look forward to taking care of you for years to come!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102358379451397693593", "name": "Paul Domingoes", "time": 1601081980734, "rating": 5.0, "text": "Will, was the tech who came out to service our unit. Five star came out after 9 days from hurricane sally.\nOutstanding service. Number 1 in my book. Will was up front about all aspects to our system, he checked everything.\nThank you 5 star you are the best.", "pics": null, "resp": {"time": 1611604942062, "text": "We are so glad we could get you up and running after Hurricane Sally. Thank you for the kind words!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "108190382760939399165", "name": "Patricia Miller", "time": 1592276065754, "rating": 5.0, "text": "I would like to thank five star for an incredible job. Cindy is a beautiful to person to work with. They were courteous and helpful and they kept their promise that my unit would be installed on Monday. Also thank you to Tyler. Thanks to  Scott and the young man who put in the unit and the advise to keep the system as clean as possible. Great job guys.", "pics": null, "resp": {"time": 1594146844927, "text": "Thank you for the review Patricia!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103099276701070675056", "name": "Sarah Kuzma", "time": 1590523428686, "rating": 5.0, "text": "I received excellent response to my AC problem. Professional interactions and timely service. They diagnosed the problem and promptly repaired the AC with reasonable cost. Kept me informed regarding time of arrival and the time was as promised. They use an advanced communication system that notified me of the solution via text and I was even able to reply with payment via text. This convenience and the great customer service is very valuable to me. I highly recommend 5 Star Air Conditioning.", "pics": null, "resp": {"time": 1590523586449, "text": "Thank you Sarah!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "110005126372206247855", "name": "Daniel H", "time": 1594240321304, "rating": 5.0, "text": "We knew these folks were at the top of the heap right off the bat.\nEveryone has been so friendly and welcoming. They felt like old friends from the start. They were on time and professional.\nWe’re so happy we went with Tyler and Cindy and the whole crew are the best! They deserve the 5 Star name!", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "118191794020607250580", "name": "Amber Carpenter", "time": 1590781886648, "rating": 5.0, "text": "My air stopped working yesterday morning. After calling the company that installed my unit and got little to no help, I called 5 star Air conditioning this morning. Cindy listened to my issues and was sincerely concerned. She had Will come out and check my AC within hours. He was extremely professional and explained everything he was doing to me. He had my air running within an hour. You guys are life savers!  I’m so grateful I called them and I highly recommend if you’re in need of AC repair.", "pics": null, "resp": {"time": 1590785594918, "text": "Thanks Amber, we are glad Will got you cooling!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "114024781468580533822", "name": "Maureen E McGuire", "time": 1591109024177, "rating": 5.0, "text": "My home was getting warmer and warmer. I didn’t know why because the air conditioner was on. Finally, I went outside to check the unit and saw the fans were not turning because one of the blades had been torn in half and was wedged along the unit’s edge. This is all happening in the early evening, I’m going to my granddaughter’s graduation & my unit is 21 years old. Being very new to the area, I called the business closest to me. What a WONDERFUL group of people!\nThey listened to my problem, came to my home immediately to assess the situation and gave me very useful tips and information. Took the damaged part and replaced it. Then, made sure it was working properly. They took care of me like I was a member of their family. Thanks to them, I made it to the graduation & my home was cool when I returned.", "pics": null, "resp": {"time": 1591113741744, "text": "Maureen, thank you for the kind words!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100305076655783563024", "name": "Adam Lucassen", "time": 1598751256200, "rating": 5.0, "text": "My outside AC unit failed and needed to be replaced. I called on a Saturday morning and Will came out diagnose their problem and was able to install a new unit within 12 hours. I’m very happy with the quality of his work. He really went the extra mile to get me back up and running.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "117773911594442418560", "name": "Michael Roy", "time": 1585234831526, "rating": 5.0, "text": "Extremely confident in the work done. Our tech was extremely courteous and kind. I hovered over him so I knew what was going on. He did not mind at all. True service with a smile. I will only go to 5 Star with my A/C needs! I have no reason to go anywhere else.", "pics": null, "resp": {"time": 1589992718750, "text": "Michael, thank you for taking the time to write a review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "111816317369765517447", "name": "Tom Boggs", "time": 1596648139822, "rating": 5.0, "text": "Outstanding!  The team from 5 Star were polite, responsive, and professional. Donnie knew his business and quickly had my AC back running... very important in 100 degree heat!", "pics": null, "resp": {"time": 1596652058977, "text": "Thank you for the kind words, Tom!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "111107204523072519300", "name": "Eleanor Johnson", "time": 1597333195215, "rating": 5.0, "text": "I am so very pleased with your service. Your promptness response when I call is very impressive. All of your service members are very helpful plus extremely nice. I am a very satisfied customer. Thank you for your service.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102985371286332453828", "name": "Penny Marlow", "time": 1597676715940, "rating": 5.0, "text": "Was out of town all weekend. Returned to our home not feeling cool. Called 5STAR Monday morning and they were on property at 8:45. Service was completed under an hour. Will definitely use again if necessary and would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103032750671531698253", "name": "Richard Capps", "time": 1597960487723, "rating": 5.0, "text": "Tyler at 5 Star installed a new ac/heat pump system inside and outside units with quick service outstanding price and set up a very substantial  rebate that I wasn't even aware of. If you want the best, honest company that actually cares about your ac and heating needs and doing the job right , backing up there work, then trust me , you need to call these guys.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "114597737585680012492", "name": "Jessica Martel", "time": 1602550924322, "rating": 5.0, "text": "Donny was fast effective and professional. Kids and I were thrilled to have out AC fixed so quickly!", "pics": null, "resp": {"time": 1611604713809, "text": "Thank you Jessica for the kind words! We are so glad Donnie could get you up and running again."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100773303647146337258", "name": "Havi javi", "time": 1590191205958, "rating": 5.0, "text": "Great response time and professional service. Had a knowledgeable technician (Paul was very respectful and explained things easily) at the property within a few hours of contacting their call center, and it took less than an hour for him to diagnose and repair the problem. Will definitely use this company for future issues.", "pics": null, "resp": {"time": 1590523698718, "text": "Thank you for taking the time to leave a review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102234638642424567088", "name": "brian oreilly", "time": 1596463890433, "rating": 5.0, "text": "Absolutely would recommend this company. We didn’t have to wait long and they were in and out quickly. Will not hesitate to call again.", "pics": null, "resp": {"time": 1596652128770, "text": "Thank you for the kind words, Brian!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "110849595191078922802", "name": "De Dickey", "time": 1587587704038, "rating": 5.0, "text": "Really pleased with the professional service I received from five Star air conditioning.\nTyler, the owner, really knows how to assist customers with prompt and efficient service.\nVery knowledgeable and has professional technicians , Scott and Kyle, to perform the\n5Star air conditioning services.\nThank you for all your help as I am very pleased with my purchase.", "pics": null, "resp": {"time": 1589992559691, "text": "Thank you for the kind words De!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "117567470250249351099", "name": "Kelly Helton", "time": 1586392857630, "rating": 5.0, "text": "They were fast friendly and very friendly and such a great price.   From the first call to the end result was AMAZING.    I will definitely be spreading the word You guys are AMAZING.  Will thank you sir you ROCK", "pics": null, "resp": {"time": 1589992619813, "text": "Kelly, thank you for taking the time to write a review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "117807557140130145816", "name": "Jenn", "time": 1594600731333, "rating": 5.0, "text": "5Star came out for service on my unit, for yearly maintenance check ups. We’re right on time, quick, and very kind. Will definitely use again!", "pics": null, "resp": {"time": 1594662059855, "text": "Thanks for leaving a review Jenn!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107684115368644876679", "name": "Bob Kayser", "time": 1593123747591, "rating": 5.0, "text": "5 Star has been my HVAC company for the past three years. They have installed two units and maintained 2 previously installed units for the entire time, and I couldn't be happier. Their prices are competitive, their work is meticulous, and they deliver just as you would want them to. Cindy and Ty are the folks you want to call when you need HVAC!", "pics": null, "resp": {"time": 1594146817424, "text": "Thank you Bob for the kind words!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106110079338582529064", "name": "Debra Webb", "time": 1598803581865, "rating": 5.0, "text": "After a night with no cool air, 5 star was quick to send Will out to fix the problem. He was knowledgeable and fixed our problem immediately.\nSo grateful for the professionalism from the time Cindy answered the phone till our problem was fixed\nThank you for  coming to our rescue!!!", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "114257746647789334785", "name": "Wayne Cheatwood", "time": 1588342183701, "rating": 5.0, "text": "We have called on the services of 5 Star Air Conditioning twice in the last 10 months on an older unit.\nThe first call was made and the cause was found to be a small snake had crawled in the unit outside and shorted out the unit.\nThe second time it was low on freon.\nBoth times we talked with a knowledgeable person on the phone to have a technician arrive in an timely manner. Both times the technician diagnosed our problem and took the time to explain the situation and what was needed. Both times the work was completed with no further problem.\nI hope there isn't a 3rd time on this a/c unit but if there is we will call 5 Star for service or replacement if necessary.", "pics": null, "resp": {"time": 1589991417837, "text": "Wayne, thank you for taking the time to write a review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106186936269693232064", "name": "Alison White", "time": 1582653901220, "rating": 5.0, "text": "5 Star Air Conditioning was recommended to me nearly four years and I have found them to be a great company with excellent service.  When my Air Conditioning unit broke down last summer, Tyler went to a great deal of trouble to find me a suitable replacement at a good price and it was installed within days.   I was thankful to know someone knowledgeable that I could trust.", "pics": null, "resp": {"time": 1582669254132, "text": "Thanks Alison!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100898262903516763690", "name": "Cindy Mathis", "time": 1596480673522, "rating": 5.0, "text": "Not enough good things to say about this company.  I called for an appointment at 10 in the morning and my problem was resolved by 1:30.  Don’t hesitate to call if you have an air/heat problem", "pics": null, "resp": {"time": 1596652099379, "text": "Thank you for the review Cindy!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113470852269835299933", "name": "joe thomassen", "time": 1559507535757, "rating": 5.0, "text": "I received outstanding service from 5 Star Air Conditioning yesterday, as I returned home from a long day's hike in extreme heat to find my air conditioning not working! I'm so glad I chose 5 Star for the service call! They were extremely nice and concerned for me...it was like reaching out to an old friend in the initial call! That meant a lot! Amazingly, the technician was at my door within an hour and promptly assessed my problem and thankfully, they had the uncommon part that was needed! Cindy, the totally charming wife of the 5 Star owner quickly brought the part to my house within minutes, and it was delightful to meet her!\nThe technician, Brandon was so nice as well, and although it was a complex fix, he did an excellent job and had my a/c going in no time!\nI can't say enough about how pleased I am with my experience with 5 Star and I'm thrilled to know we have such a wonderful a/c service here in Foley! I'll definitely recommend 5 Star to all my friends! Thanks, 5 Star...you're awesome!", "pics": null, "resp": {"time": 1561413973547, "text": "Joe, thank you for the great review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107439001880093703136", "name": "Don Kinkade", "time": 1597873947135, "rating": 5.0, "text": "Very helpful. Worked closely thru the entire ordeal until it was complete.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115179718548914926354", "name": "GG E", "time": 1590254425439, "rating": 5.0, "text": "I’m so thankful to Five Star!! They came out quickly on a HOLIDAY weekend. They were polite, professional and FAST !! Thanks you soooo much for awesome efficient service !!", "pics": null, "resp": {"time": 1590523610825, "text": "Thank you for the wonderful review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102095144656972863909", "name": "Debra Hipskind", "time": 1572387316650, "rating": 5.0, "text": "I live in Indiana & have house trailer in Foley, Alabama! My heating & cooling system went out it was very old! My brother-in-law met 5 Star Air Conditioning there & they had it in, in one day, they trusted me to send them a personal check through the mail! Done a great job! Very pleased", "pics": null, "resp": {"time": 1579005007010, "text": "Debra, thank you for taking the time to write a review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "108622418469200680217", "name": "shane felkins", "time": 1608322376037, "rating": 5.0, "text": "Great service very knowledgeable kind and courteous", "pics": null, "resp": {"time": 1611604642347, "text": "Thank you Shane for the 5 Star Review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "111655890736034237212", "name": "Gayle Dearman", "time": 1577997846362, "rating": 5.0, "text": "I've been using 5-Star HVAC for approximately 6 years to service, repair or replace the 9 units I have ain my rental properties. I've been extremely pleased with 5-Star. The owners and employees are very knowledgeable, reliable, professional and courteous. I appreciate very much that they always manage to come quickly when I have a repair emergency. I also like knowing that I'm talking with a company owner when I call for service or questions. You definitely get your best response when company owners schedule their work.  I highly recommend the folks at 5-Star.", "pics": null, "resp": {"time": 1579005058261, "text": "Gayle, thank you for taking the time to write a review, we appreciate it!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115263165781913303379", "name": "Lamar Beaird", "time": 1592941425414, "rating": 5.0, "text": "I was completely satisfied with the service and the speed of getting my air back on the same day I called for service.", "pics": null, "resp": {"time": 1594146832054, "text": "Thank you for the review Lamar!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115042282799935683842", "name": "Mandy Shutt", "time": 1596654916661, "rating": 5.0, "text": "So fast and friendly. I will definitely recommend to my personal friends and family.", "pics": null, "resp": {"time": 1596658728585, "text": "We are glad you are back cooling Mandy! Thank you for the kind words."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "109184154178982670514", "name": "Brenda Deschermeier", "time": 1585944944602, "rating": 5.0, "text": "Will is a very reliable in courteous person and really knows what he's doing when he does his job we enjoy having him come to our house and take care of our air conditioning and heating and would recommend them for anybody and five star air conditioning great business", "pics": null, "resp": {"time": 1589992749886, "text": "Thank you Brenda!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113357792937968185943", "name": "Melissa Vest", "time": 1594592180510, "rating": 4.0, "text": "Service was fast but was very expensive -  especially for the small issue we had with our A/C.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100124761292770914497", "name": "Kacie Minchew", "time": 1578953619244, "rating": 5.0, "text": "I have been using 5 Star Air Conditioning since I have moved into my house. I would never use anyone else. They are a great company.", "pics": null, "resp": {"time": 1579005093369, "text": "Thanks Kacie!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "112459946870917894793", "name": "Mary Keen", "time": 1578960314442, "rating": 5.0, "text": "Always courteous, clean and ready to take care of business. These folks are great to work with and much appreciated.", "pics": null, "resp": {"time": 1579005147378, "text": "Thanks for the review Mary!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "112384379102997016111", "name": "Sabrina Gavzy", "time": 1568478746514, "rating": 5.0, "text": "These guys are amazing. I have never had a better experience. Not only are they dedicated but they kept me informed of everything they were doing. I would recommend them any day.", "pics": null, "resp": {"time": 1569434882258, "text": "Thank you Sabrina!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107337143547710128397", "name": "Robert Williams", "time": 1534423953182, "rating": 5.0, "text": "The 5 star team has been servicing our A/C heating and our spa heater for 4 years. They are courteous , timely and thorough. They are well worth their work. We look forward to their visits every 6 months. Whenever we have had an emergency they respond immediately. Thanks to the 5 star team.", "pics": null, "resp": {"time": 1534526263067, "text": "Robert, thank you for the great review and recommendation. We appreciate you hearing that you were pleased with us the past few years. Thanks again!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106308979892407699382", "name": "Daniel Stevens", "time": 1562192256119, "rating": 5.0, "text": "Will and Brandon rocked our install. Professional and down to affordable business. I even needed help moving a dresser and Will assisted!! Highly recommend!!!\n\nPS - Cindy helped in scheduling to get us back up and running as well.", "pics": null, "resp": {"time": 1562198363785, "text": "Thanks for the review Danny, glad we could help!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113582763310736079531", "name": "Robert Hilton", "time": 1560360505258, "rating": 5.0, "text": "We have had exceptional customer service with 5 Star every single time we’ve dealt with them. From their knowledge of key issues and their willingness to go above and beyond to help has been quite a surprise in a world full of lack luster, ineffectual technicians and companies.\nI’ll use and recommend their services every time!\nThanks again for everything!!\nBen R.", "pics": null, "resp": {"time": 1561413891904, "text": "Ben, we appreciate you taking the time to leave this review."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "104559527838566418051", "name": "sarah dean", "time": 1579971190769, "rating": 5.0, "text": "We called 5 star Friday night at 6 p.m.  By 10 a.m. Saturday morning they had called and had our problem fixed!  Thank you so much for your prompt response and we will definitely use 5 star again in the future.", "pics": null, "resp": {"time": 1579978891426, "text": "Thanks Sarah!!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "110458298182621410586", "name": "Tracy Snider", "time": 1572385246527, "rating": 5.0, "text": "Replacing home A/C..Easy to work with from quote to install.  Good communication all thru the process.  Great work and product on time and best value I could find.  If you need HVAC work you cannot do better.", "pics": null, "resp": {"time": 1572388931060, "text": "Thanks Tracy, we too enjoyed the process too!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "114158501179752130208", "name": "Bob Crachet", "time": 1598062852726, "rating": 1.0, "text": "A bunch of these reviews are bogus. Jennifer Flowers is the owner’s tenant.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "105064029793634795224", "name": "Nicholas Zinevich", "time": 1556997405199, "rating": 5.0, "text": "Super service, from the 5 Star team. Tyler arrived Friday found our problem and a decision was made to replace the system. Scott and Brandon showed up on time today (Saturday) ahead of the following Monday appointment. Much appreciated as hot humid weather is upon us.This was a major swap out which was performed in a very professional friendly manner. Upon completion they left the place spotless. They are an asset to 5 Star.", "pics": null, "resp": {"time": 1561414034457, "text": "Thanks for the shout out for Scott and Brandon!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "116876222561676292807", "name": "Patsy White", "time": 1546545756154, "rating": 5.0, "text": "We own a condo in Gulf Shores. We have snowbirds in for the winter and the air conditioner stopped working! Who knew it would be 80 degrees on New Year's?? I called our home warranty company and they gave me several companies to choose from. After reading all of the reviews and talking to the nice folks there, I knew Five Star Air Conditioning would be the the right company to deal with. They sent a technician out and he got our unit fixed in no time at all! Our snowbirds are happy and so are we! If you need an air conditioning company you will not go wrong by using Five Star Air!", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107401452505370893637", "name": "Irene Weaver", "time": 1539875061694, "rating": 5.0, "text": "We called 5 Star Air Conditioning to come out to Pic N Pay. And Cindy was very polite on phone. Said she would have someone out that Day. And Scott comes to Store and Looks at A/C and Shows Us What all was wrong. He got started and within No Time we had Air. Scott Done an Awesome job. We are very pleased with Scott work. And We Highly Recommend 5 Star Air !!! Thank You Scott for your Help !!!", "pics": null, "resp": {"time": 1539970086273, "text": "Thanks Irene, we appreciate the five star review. We are delighted that we were able to get you up and cool! Let's us know if we can be of help in the future. Thank you."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107127383803961393301", "name": "Betty Blakeney", "time": 1558560240122, "rating": 5.0, "text": "A very reliable company of\nowners and employees.  Very trustworthy, time efficient, treats customer with respect, helps to save money and will even come on Sunday if needed.  I cannot say enough kind words regarding 5 Star!\nB. Blakeney", "pics": null, "resp": {"time": 1561413990088, "text": "Thank you Ms. Betty :)"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102692794633961022165", "name": "Jennifer Byrom", "time": 1527112387413, "rating": 5.0, "text": "Finally! I have found an HVAC company that is compassionate and will go out of their way to take care of their customer.  This is a company you can trust and I am extremely happy with their service.  They scheduled a time between 2:30 and 3 pm, they beat me to the house! It is hard to find reliability and honesty with repair companies, and I strongly believe I have found one with 5 Star Air Conditioning.  Thank you so much!", "pics": null, "resp": {"time": 1527164637169, "text": "Jennifer, thank you for the wonderful review. We are pleased that you were satisfied with your service and repair."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "101458847074113787060", "name": "Wade Andrews", "time": 1551758735992, "rating": 5.0, "text": "Fast response, great service, and quick turn around. Repairs and replacements are done well with clear communication and explanation of services and costs. Friendly and professional - will definitely continue to use for all HVAC needs.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "110580039433695525347", "name": "Gavin N", "time": 1575759563481, "rating": 5.0, "text": "These folks are amazing. Go above and beyond, whatever it takes to get the AC job done!", "pics": null, "resp": {"time": 1575901707300, "text": "Thank you for the kind words Gavin!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107485962532161176355", "name": "Shannon Taylor", "time": 1585070633108, "rating": 5.0, "text": "They are top notch. They always take care of me   Couldn’t be happier.", "pics": null, "resp": {"time": 1589992733445, "text": "Thank you Shannon!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106119882934958605722", "name": "Luanne McCarley", "time": 1532616788886, "rating": 5.0, "text": "Tyler, Cindy, and their crew will take care of you. Our air conditioner stopped cooling early on a Friday morning. I called 5 Star Air Conditioning and they were here that morning. It was bad news, the compressor. The really bad news was there wasn't one available in the area which meant we would be without air on the hottest weekend of the summer. The good news: 5 Star loaned us a portable unit to use through the weekend. They were here bright and early Monday morning with the new compressor and we had air conditioning again before lunch. We always recommend 5 Star to our friends and family.", "pics": null, "resp": {"time": 1532634905069, "text": "Thanks Luanne, we appreciate the wonderful review and your kind words. We are happy that we were able to help you with a temporary solution until we could get you a new one installed. We thank you for the recommendation!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "104917661130561640668", "name": "Debra A Kline", "time": 1529540181912, "rating": 5.0, "text": "We have been using 5 Star for several years to do the maintenance on our units. They are always thorough and prompt when doing the service, and are without fail quick to respond when problems arise.  Recently, one of the units needed to be replaced and Tyler’s team installed the new unit in a timely and professional manner.  We highly recommend this company!", "pics": null, "resp": {"time": 1529606585627, "text": "Debra, we appreciate the review and your continued support. It is always a pleasure doing business with you."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "105199941217756418131", "name": "Brian Hart", "time": 1530127617897, "rating": 5.0, "text": "Absolutely great experience. Nobody likes having to replace the HVAC system but 5 Star made the experience as painless as possible. Cindy sent me a quote, which I compared against a few other local companies. I felt I would get the best value from 5 Star Air Conditioning so I chose them.\n\nScott, Brandon, and Wesley performed the installation. All three were courteous and professional. I could tell they take pride in their work through the attention they paid to how they wired and plumbed the units. They took the time to answer my questions during the installation, and then walked me through what they did after the work was complete.\n\nMy new American Standard unit is running great, much quieter than the old unit and I’m pleased with both the equipment they recommended as well as the quality of work they provided.", "pics": null, "resp": {"time": 1530143158183, "text": "Thank you Brian, we appreciate hearing compliments on our work and professionalism. Please let us know if we can be of service in the future."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107736122029232347476", "name": "Chuck Lebet", "time": 1560034466185, "rating": 5.0, "text": "Great service. These service techs know their skills. Thanks again for your fine customer service!\n.", "pics": null, "resp": {"time": 1561413909414, "text": "Thank you Mr. Lebet!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115507472346571597870", "name": "Sydney Ann", "time": 1551755494840, "rating": 5.0, "text": "We called over the weekend when our unit went out. They were out that day to check the problem and diagnosed it on the spot. They were back the following morning to replace pie unit. There was no long wait. The transaction was smooth, service was great!", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "101797060733567882082", "name": "Richardson Services LLC", "time": 1537463689863, "rating": 5.0, "text": "Very satisfied and happy with the work that Scott and Brandon did! Great, dependable, hard workers that were also very friendly. I highly recommend using 5 Star Air Conditioning and will do so if needed again in the future.", "pics": null, "resp": {"time": 1537554490300, "text": "Kyle, thank you for the five star rating. We appreciate the recommendation and please give us a call in you ever need us."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "105547358733433249192", "name": "Tommy Lee", "time": 1531422431705, "rating": 5.0, "text": "Tyler and 5 Star Air Conditioning are simply first class. They are knowledgeable, helpful and you can depend on what they tell you. I highly recommend them to anyone looking for service to your existing system or if you need a new system installed. You'll be glad you called them.", "pics": null, "resp": {"time": 1531516432414, "text": "Tommy, thank you for the wonderful review. We appreciate your comments and business."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115635838087427108981", "name": "Sharon Sofsky", "time": 1537146656017, "rating": 5.0, "text": "This company is amazing! Today my AC went out and within an hour they had me up and running again! I would highly recommend this wonderful company !! 5 STARS FOR A 5 STAR COMPANY!", "pics": null, "resp": {"time": 1537225187448, "text": "Sharon, thank you for the five star rating. We are happy that we were able to get you serviced quickly! If we can be of help in the future, just give us a call. Thank you again."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115257844848128588208", "name": "Sherry Weaver", "time": 1526491530804, "rating": 5.0, "text": "Wonderful company, owners, and crew! They came in and replaced our outdated system; were courteous and knowledgeable and even swept up before they left!! I got to meet Tyler and Cindy, and feel like I have 2 new friends in Foley :)   Thank you Scott and crew for your hard work!!", "pics": null, "resp": {"time": 1526659883542, "text": "Sherry, it was our pleasure to do business with you. Thank you for the great review from your two new friends in Foley!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107936808354664321658", "name": "John Gray", "time": 1534868717453, "rating": 5.0, "text": "Very Friendly, and quick. I called them and they were able to repair my AC Unit the same day. Highly recommended.", "pics": null, "resp": {"time": 1534872288222, "text": "Thanks for the great recommendation, John! We truly appreciate your business and your kind words."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "108162531334698011611", "name": "Larry Morgan", "time": 1508374405795, "rating": 5.0, "text": "Our old unit went out on Friday.  5 Star set us up with a temporary unit for the week end. They arrived Monday morning with the new unit and had us up and running by early afternoon.  We appreciated 5 Star's quick response to our issue and their professionalism.  We look forward to our continued relationship!", "pics": null, "resp": {"time": 1508507620411, "text": "Thanks Larry, we are thrilled you and Judy are enjoying your new unit!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106081595322166790462", "name": "Megan B", "time": 1534384178700, "rating": 5.0, "text": "5 Star Air Conditioning went above and beyond from the beginning. When I first spoke with Ms. Cindy she was eager to help with my issue, she got a technician scheduled to come take a look on the the next day. Tyler was my technician assigned to come by my house and take a look at the problem, he was very efficient and explained the problem in a way I could understand! I will always choose 5 Star as my go to A/C company.", "pics": null, "resp": {"time": 1534526348024, "text": "Thank you Megan, we appreciate your review. We are happy that we could get you all fixed up and just give us a call anytime you need us."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100637163839509588506", "name": "Veslava F", "time": 1557145755486, "rating": 5.0, "text": "They have always treated us like we were their only client and we love that about 5 Star AC", "pics": null, "resp": {"time": 1561414003004, "text": "Thanks for the review V"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106445909015541649283", "name": "Ralph Winton", "time": 1493846790085, "rating": 5.0, "text": "These guys are the best!  Had a motor go out on my AC unit during the summer and thought it would take several days to get fixed. I called 5 Star and the service tech diagnosed the problem, ordered the parts, and the following day I was up and running!  Competitive pricing as well.\n\nI recently had another issue and explained the problem to the receiptionist. She got a service tech to call me back (5 min) and he and I fixed the problem over the phone. Saved me the cost of a house call!\n\nI would definitely call these guys for any and all AC/Heat repair. You won't be disappointed!", "pics": null, "resp": {"time": 1495811606749, "text": "That is great to hear Ralph! We love it when we are able to take care of our customers as soon as possible. Thank you for the 5 stars!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "118097254468016040919", "name": "Jim Stewart", "time": 1532393102696, "rating": 5.0, "text": "I have never been treated so well by any company, from start to finish. The phone was answered on the first ring and, when I explained my issue (a/c problem on a 100 degree day), Cindy said she would call me back when the next repair tech was available. She replied within 20 minutes and said the technician would be on site in less than an hour. He arrived in 30 minutes and immediately diagnosed the problem. It was a minor problem (for him) but a major one for me, and I was treated like I was the only customer he had all day. I would recommend 5 Star to anyone!", "pics": null, "resp": {"time": 1532433944030, "text": "Jim, thank you for the wonderful review. We are glad that we were able to fix your problem quickly and get you some relief in this heat. We appreciate the recommendation and glad to be of service!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "100637163839509588506", "name": "Veslava F", "time": 1557145755486, "rating": 5.0, "text": "They have always treated us like we were their only client and we love that about 5 Star AC", "pics": null, "resp": {"time": 1561414003004, "text": "Thanks for the review V"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103442693588465174880", "name": "Kevin Gorman", "time": 1579562099562, "rating": 5.0, "text": "I am very happy with 5 Star A/C", "pics": null, "resp": {"time": 1579565811909, "text": "Kevin, thank you for taking the time to leave us a review!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113345390317573338183", "name": "Jonathan McKenzie", "time": 1535171348201, "rating": 5.0, "text": "5 Star is an amazing company that TRULY cares about their customers and are absolute experts in their field. I can’t think of anything negative and I have used them for over 4.5 years. Thanks!!", "pics": null, "resp": {"time": 1535215748844, "text": "Jonathan, thank you for the wonderful review and being such a loyal customer. We appreciate the five stars!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "118121926071832249643", "name": "Lewkutz Family", "time": 1518742116079, "rating": 5.0, "text": "Couldn't ask for a better company! Tyler, Cindy and 5 Star Air Conditioning have done a great job for me since day 1. I wouldn't call another company. They have my business as long as I'm in Gulf Shores!", "pics": null, "resp": {"time": 1518743989606, "text": "Thank you!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102652421288103558405", "name": "Andrew Hudson", "time": 1524762146402, "rating": 5.0, "text": "5 Star Air Conditioning is absolutely AMAZING!! Cindy is the most helpful person, she brightens up the day every time I call with a problem. Then there is Tyler, what a WONDERFUL person, so punctual, informative and honest! They are not out to take advantage of the people in need of HVAC repair, they are truly there to help, such a delightful change from most companies today! I would highly recommend them for any of your HVAC needs!", "pics": null, "resp": {"time": 1524764011122, "text": "Andrew, it is our pleasure to serve you. Thanks for the review :)"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "117356778409202757904", "name": "Kristan Croom", "time": 1530287632904, "rating": 1.0, "text": "I have Never been treated so poorly by a company in all my years. I've been in sales and customer service myself for 21 years and can not fathom treating someone the way that the owners treated me.  T actually told me he'd never seen his wife/co-owner treat anyone as poorly as she had me. He also said if you are not on her good side, she will make sure the installation is prolonged \"like she did a customer in Point Clear.\" Well, he was honest about that!  BUT...\nI was lied to, I was reprimanded on the phone, I was discriminated against, and was led on for 3 weeks and 4 days without Air Conditioning. My home warranty is conducting a detailed investigation and I hope They will never be able to do this to anyone again. They were cruel and vindictive.\nThe absolute lack of professionalism, maturity, and kindness is just disturbing.", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "115830047127556272647", "name": "Daniel Barrow", "time": 1526319022294, "rating": 1.0, "text": "Called to ask if they sell parts. Innocent question. Lady who answered the phone said no. When I asked if she knew who around here would, she said nobody should. And that was as helpful as she was willing to be.", "pics": null, "resp": {"time": 1526339639433, "text": "Hi, Mr. Barrow,\n\nWe apologize for the communication that you felt was not very helpful to your situation. We try to be as helpful and informational as possible while still running a business. The supply stores that we purchase materials from do not sell to the public and, we are truly sorry, that we can not be of additional assistance on who you can purchase from."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113448094002820289989", "name": "Ralph Hellmich", "time": 1539793466430, "rating": 5.0, "text": "5 Star did an outstanding installation of a new unit for me this past summer.  The employees were courteous and really fast.  Unfortunately my unit was in the Attic and it was very hot and a small space.  The installed unit is better in quality workmanship and ductwork than when I built my house with a new unit.   Outstanding work, great price, good equipment thx again ...Ralph G Hellmich", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103172386290512936296", "name": "Judy Thurmond", "time": 1579823010404, "rating": 5.0, "text": "I can't say enough wonderful things about 5 Star A/C. I can promise you you will not be disappointed with the service you will receive from Tyler, Cindy, and the rest of the crew at 5 Star A/C.  We have 5 condo's...4 in Gulf Shores and 1 in Orange Beach and for the past 5 years Tyler has serviced all of our units and done complete HVAC replacement in a few of our units. All service and replacement have been done in a prompt , courteous, and professional manner. Even our guest who have been in our condo's when we have had a/c problems have commented on how quickly they arrived, evaluated, and fixed the problem. You just can't find service like they provide anywhere else.  I would never consider using any other air conditioning company but 5 Star A/C!", "pics": null, "resp": {"time": 1526659723014, "text": "Judy, thank you for the wonderful review. We appreciate you being a loyal customer and look forward to many more years working together."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113448094002820289989", "name": "Ralph Hellmich", "time": 1539793466430, "rating": 5.0, "text": "5 Star did an outstanding installation of a new unit for me this past summer.  The employees were courteous and really fast.  Unfortunately my unit was in the Attic and it was very hot and a small space.  The installed unit is better in quality workmanship and ductwork than when I built my house with a new unit.   Outstanding work, great price, good equipment thx again ...Ralph G Hellmich", "pics": null, "resp": null, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "102970998859683397141", "name": "Rachel Johnson", "time": 1530032149860, "rating": 5.0, "text": "Tyler and Cindy are always there to help! They have great customer service and took time to help me figure out the issues over the phone late at night. Thank you for taking care of our personal and business AC needs!", "pics": null, "resp": {"time": 1530069176443, "text": "Rachel, thank you so much! You are the best!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "109060482985719219233", "name": "Brad Nicks", "time": 1519474035543, "rating": 5.0, "text": "5 Star Air Conditioning installed my new AC system with an outstanding professional crew that went beyond my expectations.\nTyler quoted me with 4 options, showed me the difference in SEER ratings, filled out my registration and completed my rebate for $600  with Baldwin County EMC.\nI would highly recommend 5 Star for any service or replacement on an AC system.", "pics": null, "resp": {"time": 1519479892776, "text": "Thanks for the review Brad!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "116902288035754777426", "name": "Stephen Tunstall", "time": 1561412851828, "rating": 5.0, "text": "They were very professional, responsive and knowledgeable.", "pics": null, "resp": {"time": 1561413811615, "text": "Thanks Stephen!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "112799983870588571037", "name": "fatboyz1998", "time": 1530196812220, "rating": 5.0, "text": "Just got AC fixed by Tyler & his team!! quick and honest...... first class service, highly recomend them!!! CB in OB", "pics": null, "resp": {"time": 1530202832139, "text": "Thank you for the great review and we appreciate hearing that you were happy with your service."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "105299911354829558541", "name": "willie godwin", "time": 1560454974427, "rating": 5.0, "text": "They were very professional and gave us tips on the things we can do to maintain our unit.", "pics": null, "resp": {"time": 1561413852132, "text": "Thanks for the review Mr. Godwin"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103065083292496477563", "name": "Timothy Lower", "time": 1527815887415, "rating": 5.0, "text": "The Higginbotham’s are Honest Hard working HVAC Tech with Integerty, I Love my Air Conditioning (Keep it at 68)  and The 5 Star comfort Club is a Must to keep us Comfortable on the Gulf Coast! Thank you for your Hard work Keeping me Cool!\n#WherestheBOSS", "pics": null, "resp": {"time": 1527861843606, "text": "Timothy, we appreciate the great review! Let us know if we can help you at anytime. Thanks again!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "107944012162135265436", "name": "Matt Trostel", "time": 1484319422431, "rating": 5.0, "text": "My first two needs for an HVAC expert were emergencies and 5 Star came through for me each time.  Not only did the tech put in extra time to help me out, the bill didn't reflect the typically high costs of emergency work.  Sign them up as YOUR go-to HVAC experts.", "pics": null, "resp": {"time": 1486051983357, "text": "Thank you for the great review! We truly appreciate your business and kind words!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "109410456131692593649", "name": "Josh Williams", "time": 1534247772136, "rating": 5.0, "text": "Top notch service that I couldn’t be more happy with. Courteous and honest.", "pics": null, "resp": {"time": 1534336501087, "text": "Thank you Josh, we appreciate the review and comments."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "105405917850333428169", "name": "Don Johnson", "time": 1448542168546, "rating": 5.0, "text": "Great, Honest company.  I look forward to working with Tyler again.", "pics": null, "resp": {"time": 1448640536874, "text": "Thanks so much for the kind words and for the 5* Don!  We look forward to working with you again too."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "113385537264776434380", "name": "Jonathan Hicks", "time": 1532378690585, "rating": 2.0, "text": "Technicians are great but the customer service and total lack of respect from the lady in the office is unnecessary.", "pics": null, "resp": {"time": 1532434850181, "text": "Jonathan, we appreciate you taking the time to leave us a review and comments. We are glad that our technicians were able to take care of your AC problem. Thank you."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "101009106174869011743", "name": "Michelle Miller", "time": 1540314202105, "rating": 5.0, "text": "Amazing service! Would recommend them to everyone!", "pics": null, "resp": {"time": 1540399765405, "text": "Michelle, thank you for the amazing five stars. Let us know if we can help you again in anyway."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "112460297602817238403", "name": "Jim Bills", "time": 1530540025639, "rating": 5.0, "text": "Fast and friendly service. Thanks for the help this weekend.", "pics": null, "resp": {"time": 1530589001027, "text": "Jim, thank you for the five star rating and kind words. Let us know if we can be for future service."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "106282988561268200611", "name": "Sue Alford", "time": 1497543869624, "rating": 5.0, "text": "Got me up and running/cooling quickly!!!!", "pics": null, "resp": {"time": 1497581256112, "text": "We were happy to help Sue! Please give us a call anytime!"}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
{"user_id": "103405517336698175371", "name": "sheila hodges", "time": 1539958959276, "rating": 5.0, "text": "Always available and so knowledgeable", "pics": null, "resp": {"time": 1539970160761, "text": "Hi Shelia, thank you for the wonderful review. Let's us know if we can help you with anything in the future."}, "gmap_id": "0x889a0e7b98f65799:0xbe99b5890b18269"}
