{"user_id": "115497234242002248308", "name": "Hidden Commander", "time": 1515882116865, "rating": 5.0, "text": "Great expierence, friendly staff and players.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8eHPukMQPbJRhuU5sRRr1dUpyYg7LzIwjxRmA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNCXK55etCIjByiWCDW_3LpHyLhZzuKeNtUDcoY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNVS1DW8y5hAZTTMtNNlzzlMRbVO38Mkoqy64U=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOVE4QbDDsGmaFbpXY5qF7fII6BxyrxweYhBEt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNUO3fe0r6X2I_Z0riYixXSc-1RizW3GdGtBj5Q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-Yb924bnQW83KJL3jH0VfqtXilG23VVDX58I3=w150-h150-k-no-p"]}], "resp": {"time": 1515969782159, "text": "Thanks so much for the review, we are glad you enjoyed your experience, tell your friends and come back to see us soon."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "105043468742288727333", "name": "Tint Pro", "time": 1514772070678, "rating": 5.0, "text": "Allen, Josh, Kevin and the rest of the staff are amazing. We always have a fun time playing here. They have always gone over the top to help with technical issues. Generally have a good selection of guns, batteries, grenades and other stuff for sell. Cool having a local store to purchase airsoft equipment, which normally is ordered online.\nThe indoor arena is pretty legit and they always run different game types to keep it interesting. Keep up the good work guys!", "pics": null, "resp": {"time": 1514789476054, "text": "Thanks so much for the feedback, we are happy you enjoyed yourself. Keep an eye on our FB page and we will make announcements when we get restocks in as well as anything new going on."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "115760797479731728467", "name": "Digital ShadowX", "time": 1498872154993, "rating": 5.0, "text": "I went here last September before the remodeling and had a great time! The refs were good, everyone played fair. It's my b-day today and we are driving 3-4 hours just to go play here. I noticed a lot of comments saying that the staff didn't chrono their guns but they did mine so...yeah. See you guys tomorrow!", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "116668253036993891729", "name": "Skyline Airsoft", "time": 1504994864431, "rating": 5.0, "text": "I came to Alabama for a hurricane evacuation and the employees here took me in and helped me with whatever questions or issues I needed assistance with. A great group of individuals, and also a great field for quick close quarters encounters. I will definitely return.", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "107207829063550006440", "name": "John Welch", "time": 1513750094551, "rating": 3.0, "text": "It’s a great place but there are some cheaters with about 450 FPS guns that hurt way more than the regular guns. Great refs but poor checking outside guns FPS, hopefully you will enjoy it.", "pics": null, "resp": {"time": 1513779550188, "text": "Every single gun that enters our field is put through chrono, if you have a player you suspect of having a gun shooting hot please let the ref know and they will put them through a random chrono to ensure they are not changing the FPS after they chrono. Thank you very much for your feedback."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "111629568480846903546", "name": "Cameron Fortenberry", "time": 1517077066909, "rating": 1.0, "text": "Poorly ran. Ran by young kids. Absolutely no structure. Waited 30 mins in between games because staff(kids) was to busy trading equipment and talking. Didn't tell us an important detailed the spring in the magazine. My brother and I spent the whole first game shooting blanks because lack of instructions. It's a great idea and can be alot of fun. I'd suggest to go somewhere else if you have the chance.", "pics": null, "resp": {"time": 1517086443536, "text": "Good afternoon Cameron, I sincerely apologize for your experience during your visit with us. I am personally going to speak with the staff today and determine exactly why the situation occurred and ensure it will never happen again. Please feel free to stop by any weekend and speak with the field manager of the day and we will be happy to give you a free day of play on the house as well as ensure you are fully trained in the proper way to use the equipment. Again I am very sorry for your experience we will strive to gain back your trust and ensure you have an awesome experience. Please feel free to email me with any issues or questions at battlegroundsairsoftbham@gmail.com"}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "111009125953177972203", "name": "Jaqual Jackson", "time": 1522518413181, "rating": 5.0, "text": "My son and his friends really enjoyed this place! We will be back to enjoy the fun again.", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "113907893239458952864", "name": "Mr. Queasy", "time": 1445288909721, "rating": 1.0, "text": "(( IT\"S DEAD ))the only reason i gave it 1 stars is because i never got to go in because it is dead, the entire building that makes up the store and the other ones around it had there windows covered in black tarp and the grass was dead and crows now circle the rotting corpse of Battlegrounds airsoft. it was a disappointing trip.", "pics": null, "resp": {"time": 1492450784074, "text": "Sorry your trip was so horrible, we have reopened under new management and look forward to seeing you soon."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "102278529330038748686", "name": "Dylan Player", "time": 1491695074484, "rating": 5.0, "text": "Battlegrounds is now reopened and it is being run better than ever. New staff is amazing and the teching is great.", "pics": null, "resp": {"time": 1492450533306, "text": "Thank you so much for your review. Please let us know if there is anyway we can improve to make your experience more enjoyable."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "111350538292477045964", "name": "tin nguyen", "time": 1494634522508, "rating": 5.0, "text": "I had Tons of fun hanging out here! Will go at least once a week if i could!", "pics": null, "resp": {"time": 1494636335274, "text": "Thanks so much for the review. We are extremely happy you enjoyed your time with us. Please come back anytime."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "105099102696409985352", "name": "Carter Lyon", "time": 1509253167356, "rating": 2.0, "text": "I've played at this field a few times now and overall it is a pretty fun place. Refs are great and freindly. However, they never chrono.(checking the FPS of the guns brought from outside the field)And the whole, \"it's airsoft if you can't take being shot don't play\" is not an acceptable excuse for a CQB(close quarters combat)field especially when they majority of players on the field are little kids. Typical fields have allow for rifles to be set at a max of 350fps which would hardly ever break skin, unless at a close distance and again if not checked can be dangerous for all players young or old because someone can run 400-500fps and not be held accountable for the damage. Also the refs have good intentions when it comes to trying to make new game modes but when these new game modes are not well thought out you are often left on the field playing classic TDM (team death match) towards the end of the round. Also it seems that there is not much commintcation/training between upper management and staff often leaving things to be unorganized. On a more positive side of things most of the refs there have extensive knowledge of airsoft guns and equipment meaning that repairs can often be made on site and they are always willing to give a helping hand.", "pics": null, "resp": {"time": 1509254832788, "text": "Every single gun that enters our field is chronoed before it is allowed to be used, any gun that is reported to be too hot is rechronoed. If someone is hiding a gun and is shooting too hot they will be ejected from the field. If you feel a gun is shooting too hot have the ref or anyone on the staff chrono the gun just to make sure.\n\nOur chrono limit is 380 FPS for all guns on field, we do allow 400 during times where the entire group wishes to play at the higher FPS. All of this is covered in our rules as well as enforced by our staff. If we suspect anyone is using a gun that has not been chronoed we take care of it by either rechronoing the gun or removing the offending player from the field.\n\nNew game modes at indoor fields almost always devolve into TDM regardless of how the game mode is setup, we do welcome any suggestions as to new game modes you might wish to play.\n\nAs for the comment on the communication piece, please email us at battlegroundsairsoftbham@gmail.com with an example of how the staff is not communicated with and trained in how to run the field as I ,the owner, speak to them not less than 5 to 10 times daily to ensure everything is operating smoothly, I have two managers on site who run the field every single day, and the remaining staff have been playing and reffing airsoft games, as well as organizing larger airsoft events for a combined 20+ years. We welcome any direct feedback you might have, please feel free to speak with any of the staff on location or email me at the listed email address above."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "102797604838432626952", "name": "james johnson", "time": 1462711685521, "rating": 3.0, "text": "This is from someone who is brand new to the airsoft world.  Took my son and his friend for the first time.  Pricing I thought was fair ($35 for gun and mask rental for all you can play).  Staff and experienced players very helpful and friendly.  Arena is pretty cool with all kinds of obstacles to hide behind.  Showroom area is OK and only had a selection of three of four rifles to purchase, but the pricing on what was in stock is comparable to what you would find online.\n\nNow for the not so good part of the experience.  Groups were too large for only one referee. In general the experienced players were fair but a majority of the time we got lit up after calling we had been hit.  They are supposed to have a 350 fps limit but not once did I see any guns checked with a chronograph.  Makes me wonder just how fair game play actually is.  I can handle an occasional curse word but the  language from the younger players was out of control.\n\nWith that being said, the management was quick to fix problems brought to them about excessive gaming, horse play and bad language.  All in all not a terrible experience but a lot of room for improvement and to make this a much more enjoyable experience from the novice to the veteran player.\n\nSo the real question now is, \"Would you go back?\".  My answer is, \"Maybe\".    If I was to go with a group, rent a time slot and have a more controlled environment then my answer is,  \"Absolutely!\".\n\nThis is not to slam Battlegrounds Airsoft, but to give a fair critique in hopes to see it live up to it's true potential.  To have a great environment so that a new person coming to the sport would have a great experience and want to return again and again.  Hope this helps.\n\nSincerely,\n\nJames Johnson", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "113812307962251533817", "name": "chris posey", "time": 1414108953634, "rating": 5.0, "text": "Battlegrounds Airsoft is a great location for New and Veteran CQB Airsofters. There are many locations to take cover and rush through and there is a moderately sized waiting/breakdown room for pre and post-game times. They have Food, drinks and a weapons for purchase in the main entrance. I personally enjoy the place and go nearly every weekend and people who you may see there are more-likely than not Good Spots. The employees are nice and helpful and will assist you with anything you need.", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "114351699658645422306", "name": "David Cannon", "time": 1471831097631, "rating": 5.0, "text": "Had a great time u be back this Friday", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "116844244966318909508", "name": "carl dean", "time": 1455720071819, "rating": 5.0, "text": "Awesome place....good times indeed!", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "105219148369524301598", "name": "MUD MONSTER", "time": 1472954297291, "rating": 1.0, "text": "this place sucks the quality of everything is bad the reffs dont do their jobs and everone cheats its a decent field put its not worth the money and time to play at a damn field that is crooked", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "115857232849440810333", "name": "Ashley Dark", "time": 1474063262279, "rating": 2.0, "text": "I have a large group of friends and was told the it would be open on Friday at pm . The web sit all so states i open on Friday. Show up with my friends and its  closed. Called an was told it was closed so im guessing that if you go here it will be closed.", "pics": null, "resp": {"time": 1492450696838, "text": "We apologize this was before we reopened under new management. We are open every Friday Saturday and Sunday for the hours stated on the Facebook and Google page. Come see us."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "115717740750622513016", "name": "nathaniel randolph", "time": 1484345921478, "rating": 5.0, "text": "Loved this place just came to play a game but it's closed down don't know why.", "pics": null, "resp": {"time": 1492450563114, "text": "We are now reopened under new management, come back and check us out. We look forward to seeing you soon."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "118047607659292417632", "name": "aj franklin", "time": 1456589748664, "rating": 2.0, "text": "it was dead like the other guy said it was closed there wasn't much there and there were about two cars at the whole place", "pics": null, "resp": {"time": 1492450732548, "text": "We have reopened under new management, come check us out again we would love to see you."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "101734255638736649505", "name": "michael trotter", "time": 1518096408049, "rating": 5.0, "text": "I bought two of your elite force m4 magazine and the day I got it I dropped it and it broke so it dose not feed good what should I do I am coming by on Saturday", "pics": null, "resp": {"time": 1518114025931, "text": "Bring them by this weekend and we will take a look and try to fix them or see what we can do for you."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "113019012617392114757", "name": "Alex CANE", "time": 1526074116075, "rating": 5.0, "text": "Had a great experience", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "114124189284658457165", "name": "Joshua Wiley", "time": 1525184880835, "rating": 5.0, "text": "Lots of fun", "pics": null, "resp": null, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
{"user_id": "106973398829900800541", "name": "Ronda Fletcher", "time": 1489243997135, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1492475519248, "text": "We would love to see you back, new owners now come check us out again."}, "gmap_id": "0x888911bac08b7839:0xe44d70c37c4c3d8"}
