{"user_id": "109317947639996900960", "name": "K. E.", "time": 1620751908965, "rating": 1.0, "text": "It has taken me a few days to fully process my service experience on 5/7/21. I scheduled a service appt online for my Stelvio. I also checked the box for a loaner vehicle. I was scheduled for 4/27/21 for an oil change. Once I checked in I was told by Tom Williams, Manager, that I was not required to have any major services done on this visit but maybe the next time I would need to have my brake fluid flushed. I let him know that I would need a loaner vehicle. His response was, We don’t have any so Johnathan will take you to work. Once I picked up my truck and I was driving off I immediately noticed a different feel to my truck. I just thought it was different because they had done a tire rotation. A few days later I noticed a noise when I braked. It gradually got worse and louder. I called and spoke with Jonathan. I told him about my concerns. He told me it was probably a rock stuck between my rotors and that if it was the brakes my sensors would have let me know it and its probably just a rock but if I brought my truck first thing in the morning it would be a quick and easy fix. He told me they didn’t have any appts available and that they didn’t have any loaner cars for me to drive while they inspected my truck. When I arrived on 5/7 Jonathan stated you are gonna have to leave the truck with us you need new brakes and rotors. I asked why and he said you are metal to metal. So that’s when I immediately started asking what happened when I brought my truck last week, he apologized said the tech just didn’t catch it. I asked what about my sensors, why didn’t they go off, he stated the sensors are on the inside and this was on the outside pad. None, of this was making sense to me. I asked him for a quote for the service to be completed and of course it was approx $700 with a 10% discount. I’m fuming inside by this time bc not only have you all inconvenienced me when I could have had this service done last week, but I was in danger and you lied on my vehicle’s multi point inspection, or maybe you didn’t even do an inspection at all, but now you’re gonna double charge me for labor. I asked him who is the service manager and he stated Tom was. I explained that every time I have come here you all have told me that you do not have loaner vehicles but the last time I was there(for my oil change) he told a customer on the phone “oh no worries we’ll put you in something when you get here and you’ll be on your way”. Johnathan replied, “Oh that was probably a Maserati owner and he’s gonna put them in a loaner Maserati”. I stated, “so you are telling me that you all hold certain customers to a higher standard because of the type of car they drive”. He stated they don’t have any loaners, and someone could drive me to work. I literally paced the parking lot in disbelief bc of the lower standard of service based on the brand name of the car I drove, the oversight of my right rear brake being completely gone and scrubbing metal to metal, and the fact that over half of the cost for me to have the service done was a charge for labor for some techs that clearly half do their job. People think that it’s a myth that women get mistreated when it comes to their vehicle service but I experienced it first hand. I could have chose to be an irate customer but because I am a black woman I chose to keep my feelings, emotions, and anger inside and take the poor customer service I received. However, I do have a choice in what type of car I drive and what type of customer service I feel I should receive. I was even just considering upgrading my car. I did not feel valued and I don't think they provide the same level of customer service across the board.", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "107227365486625955136", "name": "Sal Frenda", "time": 1512418026557, "rating": 5.0, "text": "Outstanding selection of cars and knowledgeable sales staff", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnQNXW5KEDcU0YqP2eHTY0JBoy0qf1IFuEEgm4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "117009141715936946913", "name": "Jacob Busfield", "time": 1611626326331, "rating": 5.0, "text": "Daniel should be your go to guy for all your Fiat 500L and 500x needs great guy 100% on his game took care of my mom very much appreciated drove from central Mississippi they are the only fiat dealer close with a selection of cars we were literally in and out in 2 hours future customer for sure", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "111802581531340924344", "name": "Michael Kidd", "time": 1609169712290, "rating": 5.0, "text": "I don’t often leave reviews, but in this case I definitely have to because it is so well deserved, by several people, at Birmingham Alfa Romeo.\n\nI recently traded in my 2017 Alfa Romeo Gilulia for a 2020 Giulia. Definitely the best car buying experience I’ve ever had.  I was given a fair price for my trade, and the sales price of my new car was more than fair.\n\nMy salesman, Beau Beggs, made sure I completely understood every single item during the buying process.  He is very well versed in all aspects of the Alfa line, and took the time to ensure I understood the operation of all the new car’s systems.  From the time I walked in the door, until the time I drove away I never felt pressured or hurried in any way.  For the first time, buying a car was actually enjoyable.  Thanks Beau!!\n\nNow I get to brag about the service department manager, Tom Williams.\n\nAbout 800 miles later I was driving home from work when my sunroof blew out for no apparent reason.  Needless to say, it kind of freaked me out.  I called Tom while I was still on the interstate.  He didn’t avoid the problem, didn’t ask a bunch of questions, and even though it was late in the day, he didn’t suggest any other avenue to solve the problem other than to bring them the car.  Because the glass was still falling from the sunroof Tom sent a tow truck to pick up the car and ensured the driver wrapped the car to prevent any further damage.\n\nWhen I arrived at Birmingham Alfa I found out that all the loaner vehicles were out.  That didn’t stop Tom from taking care of the situation.  He simply put me into a used car (another Alfa with only 2500 miles) until another Alfa loaner vehicle was available about a week later.  In the meantime, Tom communicated the issue with Alfa, and made sure they would take care of the problem, and of course they said they would.  I was told parts were on order, and Tom would stay in touch with me as repairs progressed, which Tom did because, well... He’s Tom and he’s the best.\n\nWhen the sunroof blew out the glass hit the trunk and the spoiler, causing several paint chips.  I knew they would have to touch up the paint, and that the paintwork would cause the value of the car to depreciate, and talked to Tom about it.  I knew he would do whatever he could to remedy to problem.\n\nWhat I DIDN’T expect was what happened next.\n\nI received a call from Tom.  He had communicated the issue up the food chain, to include Alfa themselves.  The Alfa brand very, very rarely has any issues at all, and they were more than a little surprised to hear of this one.... and they definitely wanted to make things right.\n\nBirmingham Alfa, due in no small part to Tom Williams’ leadership and superb customer service, replaced my car.  My brand new car.  With another brand new car.  No hassle, no hoops to jump through, no problems at all.  In a word:  Amazing.\n\nSo.... I say all that to say this;  If you are looking for a new vehicle (or even a used one) I cannot recommend a dealership more highly than Birmingham Alfa Romeo.  Go there, find Beau Beggs, buy something.  You will not be disappointed.  As a matter of fact you will be pleasantly surprised in the experience.\n\nSooner or later you’ll need that vehicle serviced.  When you do, take it to no one other than Tom Williams. There is no comparison.  I have never been so pleased in the caring customer service he has provided.  both on my 2017 Alfa that I traded in, and the new one I am currently enjoying.\n\nI don’t know who actually owns Birmingham Alfa, but if you happen to be reading this I want you to know you’re doing something right.  Keep up the good work, and keep your good people like Tom and Beau.  People like them are what keep your customers  coming back.  I know I’ll be back, and I’ll keep recommending Birmingham Alfa to others.\n\nThank you Beau Beggs, Tom Williams, and Birmingham Alfa, for being the exception to the rule.", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "102954886716319469662", "name": "Gary Watkins", "time": 1616277088835, "rating": 5.0, "text": "Really nice place and really nice cars and trucks and deals", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "109914242830430455428", "name": "Harrison Gunn", "time": 1597534986888, "rating": 5.0, "text": "Very helpful staff. Beau and Chris were great at assisting me with my purchase. Especially since i was coming from Atlanta. I highly recommend their services.", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "109331228363595867001", "name": "Zachary Root", "time": 1617207092116, "rating": 4.0, "text": "They have manager special for 8 alfa romeos starting at 28000", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1554770586291, "rating": 5.0, "text": "I'm not going to be buying an Alfa Romeo today.  That was one of the first things I told the salesman who greeted my son and I at the front door. I told him that we were just there to look at the cars and sit in a few. He was very friendly and spent probably 45 minutes talking about the cars and allowing us to peer into them and experience them. He was a really nice guy. If I were to ever be in the market for an Alfa Romeo I would go back to see him.", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "105706074149108169133", "name": "Joey Chance", "time": 1610641487300, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "108349985226004056073", "name": "Perry Russo", "time": 1565376592764, "rating": 4.0, "text": "Very knowledgeable salesman, very polite, but we haven't decided on a vehicle as of this point. But we were impressed to say the least...will go back at some point", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "108606493707634982538", "name": "Trey Nolen", "time": 1544289124749, "rating": 2.0, "text": "Not super happy.   They are fairly disorganized and have trouble finding service paperwork.   My car was not even cleaned after being there for an extended period (the length of time was not their fault).   For this level of car, I do expect a bit of premium service, but that is not what you get.  The facility is very nice as are the people, but I think they need to work on some management and procedures.", "pics": null, "resp": {"time": 1544291011835, "text": "Hi Trey, I'm very sorry you were not happy with your experience.  Our service department is closed on Saturdays and it did take a few minutes to locate your paperwork.  It was a bit of an unusual situation but we do apologize for not meeting your expectations.  I'm sorry for the delay and we hope you'll give us another chance in the future to make it right.    -Jonathan Woodall"}, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "101140003536480747631", "name": "michael black", "time": 1556921256160, "rating": 5.0, "text": "Actually at Fiat of Birmingham. Great experience there, took care of us everything short sweet exactly what you would look for in a car dealer.  Ask for Johnathan!", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "109113997439773350737", "name": "Jason Glasscock", "time": 1591487707728, "rating": 5.0, "text": "Awesome, takes care of you", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "104414361035633765174", "name": "Brandon Shutt", "time": 1508616776509, "rating": 5.0, "text": "If you’re looking for an Alfa Romeo, Maserati, or even a Fiat, then this is the place to go. Beau Beggs worked hard to get a deal done on a new 4C for me. He always did what he said he would, and was quick and easy to work with. Make sure you ask for him!", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "113993782770665395355", "name": "Jonathan Woodall", "time": 1482857520237, "rating": 5.0, "text": "Alfa Romeo is BACK and in Birmingham at Alfa Romeo of Birmingham!!  Cannot wait to see the Giulia in person, it's going to be such an incredible car!", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
{"user_id": "102082283020519256805", "name": "Pietro Piazza", "time": 1533489763654, "rating": 4.0, "text": "Very professional, just dream cars", "pics": null, "resp": null, "gmap_id": "0x88891231ed5d9cf5:0xecab1d88df1cefaa"}
