{"user_id": "110124447829536891675", "name": "Shundra Bristow", "time": 1614364433173, "rating": 1.0, "text": "Horrible with explaining and getting back with patients on test results and blood work nurses also very slow responses not good at explaining what is going on are helping patients just puts things off for months with out explanation are trying to find out problem just prescribed medications and get co-pays. Horrible getting new doctor in Birmingham. Doctor Lee. Very unprofessional staff never helped me with allergy issue in over 6 months couldn't even explain blood work that had been taken over 3 months I was never informed.", "pics": null, "resp": null, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "115217412317990982597", "name": "Ash Green", "time": 1612825039017, "rating": 1.0, "text": "Very unprofessional office staff!!!   They talk to you in a very rude manner!  They will disclose your information!  They refused me care knowing the severe allergy issues I was dealing with!   The office manner cancelled my appointment.   Anyone in the healthcare field should not refuse a patient help!  Very sad!!!", "pics": null, "resp": null, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "104485073363229503565", "name": "Julie Evelsizer", "time": 1533105170830, "rating": 5.0, "text": "I contacted Dr. Lee's office on the Internet and asked if they thought I might have an immunological problem, because I was constantly having sinus infections and taking antibiotics all the time. Dr. Lee wrote me back the next morning and said to make an appointment, which I did, and got in very quickly. Dr. Lee tested my blood thoroughly and found that I had never developed immunity to Hemophilus Influenza B. He gave me the vaccine for it, and my sinus infections have been few and far between in all the years since. I liked him a lot instantly and was impressed with his knowledge.", "pics": null, "resp": {"time": 1533169014206, "text": "Thank you so much for your kind review Ms. Evelsizer.  I appreciate  your trust in me very much and am so glad to hear that you have been doing better.  Stay well!"}, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "114984969317287083626", "name": "anm1980", "time": 1519268136738, "rating": 5.0, "text": "Dr. Lee is the best doctor I’ve ever seen my whole life and I’ve lived all around the US! I may not be a doctor myself but I’m very educated when it comes to healthcare. I look up the ratings of every doctor I see and I am constantly researching the latest healthcare options. I have been seeing doctors a lot lately for health issues and since I research so much, I typically come across doctors that haven’t heard of some of the latest research at National Institutes of Health or institutions like this. Well Doctor Lee not only always knows what I’m talking about but he knows it in so much detail that I just shut up and listen lol he has helped me through so much! I went from having high and low immunoglobulin levels (antibodies) to having normal levels. He tested me in detail and looked at every step of my immune system. Not only is he a great immunologist but he is a great doctor in every category 😂 I seriously asked him something that is not his specialty (Gastrointestinal issues) and he helped me more than the Gastroenterologist I see did... I may sound overly excited to talk about him but I’m just so happy somewhere like Montgomery has a doctor like him! I refer everyone to him... friends family and everyone.. hopefully he doesn’t get overly booked because this could back fire on me lol", "pics": null, "resp": null, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "104405454336081585762", "name": "google user", "time": 1476377348681, "rating": 5.0, "text": "Dr. Lee is a great Allergist! He really does care about his patients. Its been years since Ive been to him but when my daughter Stephanie W. was about 5, she was diagnosed with RRP. She was seeing Dr. Lee for allergies at the time. Because of the RRP she was going through so many surgeries. She had about 38 when she started going to him. Dr. Lee was curious what this virus was that was causing her condition. So unrelated to the allergies he started studying her condition. He came up with a theory that her T and B cells were very low and that she was born that way that is why she could not fight a virus that everyone has in their bodies from birth. He came up with a special formula of different immunizations that targeted boosting these cells. Instead of needing surgery every 6 weeks it went to every 6 months. Within 2 years she was free of RRP. We have never been able to or thought of thanking Dr. Lee for his research and help. But if I could talk to him today I would give him a big hug! He helped cure my daughter and I owe him so much for that!!! Really he is a great great Dr. If you want one that cares, go see Dr. Lee. He won't do you wrong.", "pics": null, "resp": null, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "108561255312649060782", "name": "Mrs Lady", "time": 1552917416805, "rating": 4.0, "text": "Dr Frazier is a phenomenal doctor. He listens thoroughly to the problem to find the right solution.  He sewms to csre about his latiwnts very much. His staff however especially at the front desk are rude and each time you ask them a question the seem agitated or aggravated.. I really like the office but dislike the ladies in the front as much as they seem to dislike everyone that walks into the building.", "pics": null, "resp": null, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "112631527601491282704", "name": "Katherine O'Boyle-Waters", "time": 1457709642631, "rating": 5.0, "text": "Friendly - very informative. Quick in and out for appointments and shots.", "pics": null, "resp": null, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "107069509047312078669", "name": "Wiliam hays", "time": 1520128667804, "rating": 1.0, "text": "Be aware be very aware.", "pics": null, "resp": {"time": 1520566541521, "text": "Please be aware that you are NOT one of currently registered patients in my practice and need to address your concern and feedback to the appropriate healthcare provider."}, "gmap_id": "0x888e8045c9419897:0x4629ce8a8b4dd1f0"}
{"user_id": "107392130985287062617", "name": "Ernesto Obregon", "time": 1629913307652, "rating": 5.0, "text": "I have received excellent service for several years at this location. I am always listened to and my concerns are heard. When medication or allergy immunizations are prescribed the prescription is always explained to me in terms I can understand.", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "114348909934475619447", "name": "Wiley Stoudenmire", "time": 1628549656066, "rating": 5.0, "text": "I have been receiving allergy shots from Alabama Allergy and Asthma, in Trussville. Prior to my latest visit a new batch was ordered. The new batch was received promptly, with in three weeks, and I was able to schedule my shots to fit my schedule. I have been a patient for several years and everyone has always been courteous and helpful.  I highly recommend their services.", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "110264186524658654016", "name": "Lori Roper", "time": 1628551913375, "rating": 5.0, "text": "Great place. I took my 2 teenage boys. Staff was very nice and attentive to my son when he had a reaction to an allergy.  I would very much recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "112104376471238495517", "name": "Elaine Marshall", "time": 1621274638954, "rating": 5.0, "text": "All the staff were very friendly and professional.  Dr Massey explained clearly all the possibilities for my husband’s symptoms and treatment plan!  He was very kind, courteous, and professional!  It was an amazing experience!  I highly recommend this clinic!", "pics": null, "resp": {"time": 1621358430140, "text": "Thank you, Elaine! We will make sure that Dr. Massey knows you shared this! We're happy to be able to care for your family\nat Alabama Allergy!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "118128384754595630519", "name": "L Steed", "time": 1623707515203, "rating": 5.0, "text": "Everyone is super courteous.  The doctors are caring, helpful and knowledgeable. Their level of professionalism is second to none. My visits to AAAC are always pleasant (from start to finish).  See you guys in 6 months.", "pics": null, "resp": {"time": 1623777177759, "text": "Thank you! We appreciate the feedback and look forward to providing you with excellent care!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "110174909840652803892", "name": "Kim Pope", "time": 1624890223902, "rating": 5.0, "text": "Where should I began, so many reasons. Friendly staff, knowledgeable of what my situation was, very clean facility.  I was a little shy about my current reaction but they all were pleasant to talk to.", "pics": null, "resp": {"time": 1625684747684, "text": "Thank you, Kim! We appreciate the feedback and look forward to providing you with excellent care!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "110344711191253495027", "name": "Fred Fernandez", "time": 1618456786104, "rating": 5.0, "text": "I have been a long time patient of Alabama Allergy & Asthma Center, Trussville.  My interactions with Dr. Massey and his staff have been great. At my last checkup with Dr. Massey he was prepared by reviewing my conditions and medications in advance of the meeting and exam.  He listened to my comments, and provided straight forward information and answers to my questions.  He came into the meeting with an upbeat and positive attitude.  As long at the foregoing remains the same in my future encounters with the office, I have no problem giving my whole hearted recommendations.", "pics": null, "resp": {"time": 1618926930970, "text": "Thanks, Fred! We will make sure Dr. Massey gets this feedback! We love being able to take care of you and are glad that you feel welcome! We want everyone to feel like family here at Alabama Allergy!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "101805251247479365392", "name": "Flora Williams", "time": 1618248901585, "rating": 5.0, "text": "I have never felt so welcome at a doctor's office. Starting with the front desk employee. She set the tone with her professionalism. To the nurse working directly with me, she was kind, nurturing and compassionate. I have been a patient of Dr. Massey’s since 2008. Of course he is always the best!", "pics": null, "resp": {"time": 1618327702704, "text": "Thank you, Flora! We will make sure that Dr. Massey knows you shared this! We're happy to be able to care for you at Alabama Allergy!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "114734921452108616141", "name": "Zackery Redding", "time": 1615992398981, "rating": 5.0, "text": "Everyone was very friendly and understanding of little ones. My daughter is only 1 year old and they were so sweet and understanding with her! She can be a little loud and all over the place, and everyone from the time we walked in until we left, was so sweet to us. No one made me feel like she was \"bad\" or annoying because she was just doing what babies do. Everyone actually complimented her for being so cute and outgoing. That speaks volumes about this establishment to me.", "pics": null, "resp": {"time": 1618241264717, "text": "Zackery, thank you so much! We are so happy to be able to help you and your family! We're here for all your daughter's allergy needs. We look forward to serving you in the future as well!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "113496718171892488757", "name": "Leslie Edmondson", "time": 1615991627342, "rating": 5.0, "text": "Receptionist has one of the most positive attitudes that I’ve ever witnessed!  She is wonderful!  My nurse was so kind and thorough and my doctor was great at listening to my concerns.", "pics": null, "resp": {"time": 1618241015897, "text": "Thank you, Leslie! We appreciate your feedback! We strive to make the patient experience warm, friendly, and focused on you!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "105348587188084986834", "name": "Charlie Beth Musgrave", "time": 1617719853084, "rating": 5.0, "text": "Dr. Sikora, Becca and Blake treat us like family. I feel confident in their choices for my 6 year old (even we started seeing them when he was 3). I highly recommend this group!", "pics": null, "resp": {"time": 1618242885723, "text": "Erica, thank you so much! We are so happy to be able to help you and your family! We're here for all your allergy needs. Let us know if you need anything at all!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "116205168110262186543", "name": "Bonnie Arnold", "time": 1618245872258, "rating": 5.0, "text": "Love the folks at Alabama Asthma & Allergy Center. They’re very thorough and have my asthma and allergies under control after a lifetime of constant struggles. They do teledoc appts. as well which I like to do when I’m not having problems that require an in-person visit. Highly recommend them.", "pics": null, "resp": {"time": 1618327782925, "text": "Thanks so much for the review, Bonnie! Feel free to message us at any time and we'll respond ASAP."}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "107678177535020564699", "name": "Andy Robertson", "time": 1623705233840, "rating": 5.0, "text": "This was my first experience with this this medical practice but it was all positive! The whole staff was very friendly, they took time to listen to my symptoms, and are working on strategy to get me some relief!", "pics": null, "resp": {"time": 1623777157899, "text": "Thank you, Andy! We appreciate the feedback and look forward to continuing your treatment!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "113849078466708135299", "name": "Kristin Lane", "time": 1615995800598, "rating": 5.0, "text": "My daughter went to her first appointment the other day. The staff was very friendly. Dr. Massey was very thorough. The wait time was very short! Very pleased with our overall experience!", "pics": null, "resp": {"time": 1618241386112, "text": "Thank you, Kristin! We look forward to providing great care for you in the future as well! So glad that you had a wonderful experience with Dr. Massey!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "115404876617520618219", "name": "Mercedes Lyle", "time": 1624893183201, "rating": 5.0, "text": "I love my Alabama Allergy & Asthma Center guys & girls. They’re the Best!!!", "pics": null, "resp": {"time": 1625684105773, "text": "Thank you! We appreciate the feedback and look forward to providing you with excellent care!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "115939782831317982919", "name": "Angel Finley", "time": 1617724357264, "rating": 5.0, "text": "Everyone was so nice and attentive to our needs. Everyone explained everything so well and relieved my little boy's nerves of having the testing done and made his experience the best it could be.", "pics": null, "resp": {"time": 1618243139292, "text": "Thank you so much for the review! We are happy to be taking care of your health needs! Our patients are family, and we look forward to taking care of you in the future."}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "106010806710845164132", "name": "Denise McClay", "time": 1623715080545, "rating": 5.0, "text": "Great doctor and staff-experienced and friendly!", "pics": null, "resp": {"time": 1623775695209, "text": "Thank you, Denise, for your feedback!"}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "118052621349036718958", "name": "Vickie Carr", "time": 1601294468314, "rating": 5.0, "text": "We visit the Trussville office to get my son’s shots. Everyone is so helpful and friendly. The office is clean and all of the staff (especially the lady that gives my son his shots) is extremely nice. We love this place!", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "116911539151682437376", "name": "Bessie Hatcher", "time": 1614947572650, "rating": 5.0, "text": "I love this place my daughter goes here\nVery clean", "pics": null, "resp": {"time": 1615406386508, "text": "Thanks so much for the review, Bessie Hatcher! Feel free to message us at any time and we'll respond ASAP."}, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "100157479992864858956", "name": "Janie Kirkpatrick", "time": 1547319236209, "rating": 1.0, "text": "I watched as the woman at the desk told my niece if you don’t pay your daughter will not get her shots today!  I understand a business has to receive payment, but there are circumstances that are occurring in her life that she has no control over at the time.  My niece is a single mother and doing a great job if I might add!  Her ex is not helping her at all and her insurances are in limbo. In fact he is making it as difficult as he can by preventing her from getting an insurance that would cost her less... Instead of working with my niece the receptionist did this in front other patients that were in the office.  This same receptionist had called my niece at her place of employment demanding payment.  Is this not called haressment?  Common sense tells you if you have a single mother working trying to keep her daughter healthy and you as a health provider can make that happen wouldn’t you make sure all your patients were taken care of? My niece came back to sit down after paying the small amount of 250.00 and couldn’t even talk because she was so upset and crying! She is paying almost full price for each shot her daughter receives.  I looked up at the receptionist that had NO regret or expression for doing this at all!  I wondered if anyone else had had this experience with this well known place business.  Please let this review make it better not worst for all the patients Alabama Allergy serves!", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "109974830121945172065", "name": "Shandah", "time": 1476889337549, "rating": 5.0, "text": "The Trussville location is wonderful. I had an appointment there for the first time about a month ago (my next appointment, which was confirmed after a call to remind me of my appointment by Cynthia - the receptionist, is at the end of this week). I have had some issues for a few years, but I had not been tested for allergies. I am thankful first for friends who listen and give great advice, and also for Dr. Massey and the great nurses and receptionist at the Trussville location. Thank the Lord for some relief. I still have to make sure that I will not have to take the allergy shots, but I am hoping that all of this can be resolved - at least I am getting relief from years of coughing, unable to sleep, and taking medication that worked for a moment and then did not work anymore (because all of my issues were not being address).\n\nI want to thank Dr. Massey and the team at the Trussville location for being patient and hearing my entire story to help figure out what is going on with me. I really wish the best for all at this location.\n\nAgain, Thank you.\nShandah aka Hopeful Patient", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "108808555033853168275", "name": "David Gallegos", "time": 1579730845512, "rating": 1.0, "text": "We just drove more than an hour for my daughter to get an allergy shot, we got there right at 4 and they didn’t want to give her the shot bc the doctor say it was 4:02 and they stop seeing patients at 4!!!", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "105765186332602571729", "name": "Jessica Peterson", "time": 1580246698060, "rating": 1.0, "text": "Husband's visits were very unprofessional and further more unproductive. Getting extra charges for what a doctor is supposed to do to begin with. Will not be going back ever again.", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "108557607178721576442", "name": "Kyle Brown", "time": 1503668133649, "rating": 5.0, "text": "Very friendly and convenient  location. Dr. Massey was great!", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "108016181217269140153", "name": "james Peterson", "time": 1580245873077, "rating": 1.0, "text": "They do not help you in ways you think you need help. Will tell you to take over the counter drugs and charge you an extra $18 for statements like \"you need to quit smoking\" and bill you not under your consent. Highly not recommended.", "pics": null, "resp": null, "gmap_id": "0x8889734b02df40b7:0xfa4c6f79ceda8b8c"}
{"user_id": "103313033260989799110", "name": "Maya Evans", "time": 1623422631377, "rating": 1.0, "text": "My daughter’s pediatrician referred us to this practice approximately two and a half years ago. We’ve never had a pleasant experience there as everyone (besides the front office staff) are extremely rude, unorganized, and unprofessional. Dr. Meadows is ridiculously arrogant and doesn’t listen. It was bad enough during our last appointment when my repeated statements to the nurse practitioner at the time completely ignored me when I told her my daughter’s medication instructions were not the same instructions we were provided during the previous visit. But, a recent call to get help which resulted in no help whatsoever (verbatim “go to her primary care physician and call us when she gets better.”) leaves me no choice but to seek help from another allergist. I refuse to pay copays to a practice who elects to offer bottom shelf assistance and doesn’t listen.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "101661980707126298754", "name": "Anna Faye", "time": 1622093752681, "rating": 1.0, "text": "I was at this office years ago!! I was coughing horribly and my Asthma was super out of control. When I did the PFT test, I couldn’t blow the sailboat across the ocean (which isn’t normal). My oxygen saturation was in the low 90 s (also not normal.) Dr. Meadows was extremely arrogant and basically said my Asthma was very mild. He did not listen to me as a patient. He put me on an inhaler that basically made me feel like I was receiving no treatment at all. I went back to my pediatrician because I was still a young teenager at the time and he came up with a plan to help get my Asthma more under control. I am now on the highest level of the maintenance inhaler that I take. My Asthma is quite severe. I do not recommend this doctor. He was a nice guy, horrible doctor.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "113917280537516466771", "name": "Uschi K", "time": 1601482349583, "rating": 1.0, "text": "My appointment with Dr. Meadows was to find out what is causing my skin allergies.  He never looked at my skin and was more interested in diagnosing my lungs as damaged after listening to them for four breaths.  My lungs are fine.  He refused to perform the allergy test which was the whole point of this 'exercise'. Complete waste of time and money!", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "117123556387325303269", "name": "Steven Smelley", "time": 1592321615640, "rating": 5.0, "text": "Dr. Meadows is a really nice guy and an excellent allergist, he’s the reason I’ve got my asthma under control and I know I’m allergic to the entirety of nature. Always professional and he hires good people.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "107926121772628311895", "name": "Pickett Family", "time": 1544112463372, "rating": 5.0, "text": "We had such a great experience here with my 14 month old son. Dr. Meadows was very knowledgeable and had my sons best interest as his first priority! They let me know ahead of time any fees and how much they would be. I’m so happy we found him!", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "100008050089830766877", "name": "Abigail Potter", "time": 1580324526849, "rating": 1.0, "text": "My daughter is almost 2 years old. Her pediatrician referred us to Dr. Meadows to get allergy tested. She has severe Eczema, and we also think she has a dairy allergy or another allergy. So we get to the appointment and wait. For 90 minutes. Just for Dr. Meadows to walk in, look at her, and say \"she has eczema. she doesn't need to be allergy tested.\" Umm. Excuse me?? She was referred here to specifically get the testing done, so your opinion does not matter. He said you can put her in a bubble and her skin will still look like that. Ok? But you can also pour milk on her and she will immediately turn red and start itching?? So his response was just that it was a reaction that flared up the Eczema. Needless to say my Pediatrician is furious and has referred us to someone else. I would not use this Doctor at all. His staff is very rude and does not care at all about your problems, or your child's apparently. If you want better service try Dr. Lee.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "105187537749198154445", "name": "Tripp Johnson", "time": 1507225085448, "rating": 5.0, "text": "Dr. Meadows is one of the best medicinal professionals Ive ever met. If you’re a military family and get referred off base to an allergist, you need to go to Dr. Meadows. He is well connected with the military and can order allergy shot serum from the Army’s allergen lab. That means that you won’t have to start from scratch with shots when you move to another base.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "103971566900079893241", "name": "Holly Ingram Speigner", "time": 1524672527317, "rating": 5.0, "text": "I've had awful allergies/breathing issues my entire life and Dr.Meadows improved my quality of life exponentially. I did not know day to day life could feel this good! I highly recommend Dr.Meadows and his wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "114559559732361141183", "name": "Leslie Fannin", "time": 1427137471895, "rating": 5.0, "text": "They do such a fantastic job of taking care of my little boy! He was diagnosed with asthma. We kept going to his pediatrician and getting steroids. Dr. Meadows was able to bring it under control.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "109318284998365758952", "name": "Shawanda Jenkins", "time": 1477600296632, "rating": 4.0, "text": "Dr.Meadows and his staff are great in everyway,professionally as well as great people and friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "101991922641096706177", "name": "SimpleCutie", "time": 1451936417580, "rating": 5.0, "text": "He is a professional in every way and very thorough....", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "109167134972920035695", "name": "Dan Novak", "time": 1427219618999, "rating": 5.0, "text": "Courteous and professional staff and doctor", "pics": null, "resp": null, "gmap_id": "0x888c2a44eb9fad9f:0xfbb172cc2d5f5211"}
{"user_id": "107300929016835343695", "name": "Angela Smith", "time": 1518815415594, "rating": 5.0, "text": "Wonderful Doctors! Everyone is so friendly, and they really do all they can for their patients. Absolutely my first pick!", "pics": null, "resp": null, "gmap_id": "0x888bb3bcfe8cc85d:0x32e6fa0ca090d27a"}
{"user_id": "106426617878352567132", "name": "Debbie Ball", "time": 1494610813572, "rating": 4.0, "text": "I have Not seen this doctor in long time ...but when I did they were always good to me All of them", "pics": null, "resp": null, "gmap_id": "0x888bb3bcfe8cc85d:0x32e6fa0ca090d27a"}
{"user_id": "111304030992766108060", "name": "Patrick Scott", "time": 1625064855630, "rating": 5.0, "text": "Dr. Joe Frank Smith is one of the best in the business as far as I am concerned. He performed my daughter's surgery on her adnoids and tubes and she had no complications and a speedy recovery. I have continued to recommend Dr. Smith to parents and others since and I have been to see him myself in the past.", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "112462748239030073738", "name": "Glen Deaton", "time": 1612410026074, "rating": 2.0, "text": "I went to see Dr Joe early part of last year 3 third surgery the recent one as of June 2020.He knows Glens health and dignosis.Hes never made him wear a mask!! we went today Feb 3 2021, the receiptionaist ask where r your masks I explained that he has a letter from his psycharist and Dr Joe has never required him to wear one.She was loud ,rude had my autistic son upset .she only checked his temperature not mine we live in the same household I was going in the room with him last year they ask u all these ??? Nope not anymore they used to take parents temperature nope wow.so even though Glen hates changes and he loves Dr Joe and he trusts him because of the rudness from the receiptionaist and the nurse who btw had to tell me that Dr Joe operated on someone with Convo today.Does your mask and vaccines protect you ??btw he did his surgery at the Dothan surgical center and didn't even recommend a Convo test this was June 2020", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1514451770819, "rating": 5.0, "text": "Love dr joe frank ! Performed all my surgeries since I was a toddler", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "111805635986799075063", "name": "Ashley Smith", "time": 1417635446932, "rating": 5.0, "text": "Dr Joe Frank Smith is a excellent doctor and his staff are also at both locations", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "116701707057439435212", "name": "June McClendon", "time": 1624732343673, "rating": 4.0, "text": "I highly recommend Southern ENT & Dr Walters. Likes: Website has printable new patient forms that I completed before my appointment. Comfortable waiting area. Once I got to the exam room, I was seen right away. First by the friendly, efficient & knowledgeable auditory tech who took me to the sound-proof room for testing. I was pleasantly surprised that there was no wait time between testing & meeting with Dr Walters to review my results. Five stars for Dr Walters! It was obvious that he had reviewed my paperwork in advance,. He explained my results, answered my questions, and recommended a course of action clearly & patiently. I felt like he was seeing me as a person, not as a condition. Why not 5 stars? 40-minute wait time before getting to exam room & inability to complete & submit patient forms online.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109321360756288387280", "name": "Deborah Hataway", "time": 1626970799152, "rating": 5.0, "text": "I am  completely satisfied with my appointment with  Dr. Lowery.  He put me at ease.   He has been my ENT for over 10 years and I drive over 45 miles one way because I trust him and his diagnosis each visit I have had.  He orders test when needed to ensure we know what we are dealing with.\nI recommend the Southern ENT & Sinus Center to any and everyone that needs an ENT.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118206263218210649794", "name": "CLH 79", "time": 1624315376044, "rating": 5.0, "text": "We saw Dr Fort for my son's frequent nosebleeds. He was very nice and helpful. The office is large and clean. His nurse/assistant and the front desk clerk were very nice also. Overall a great place. Easy to get an appt too.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115699391723525140900", "name": "Rhonda Rhudy", "time": 1626815709843, "rating": 5.0, "text": "Dr Walter's was very kind & thorough with my 15 year old daughter's sinus surgery. He explained the procedure to where she understood", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112046350063589526968", "name": "M J", "time": 1617746675071, "rating": 5.0, "text": "The assistant for Dr Lowery is very gentle and patient. Dr Lowery was very attentive and informative. I did not feel rushed as I usual do when visiting the doctors. Dr Lowery and his assistant listen and were compassionate. I would recommend them to my clients as well.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118241715010888133577", "name": "James Sparks", "time": 1617825141048, "rating": 5.0, "text": "Great experience.  Dr. Walton was wonderful and concerned about my illness. Would highly recommend if you need a great ENT", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102613799315012531350", "name": "Dana Price", "time": 1607193969266, "rating": 5.0, "text": "I saw Dr. Walters for the first time.... I am completely pleased! He took time with me , listened to me and discovered an issue that was previously missed by another ENT in my hometown. He took care of the problem and I felt immediately better! He will definitely be MY doctor from now on!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110115481554068986918", "name": "Lauren Gingo", "time": 1612680192404, "rating": 5.0, "text": "Dr. Fort seen my husband for a 2nd opinion and we were very impressed. He listened to all his concerns, explained in detail what he was thinking, prescribed him medication, and getting him to a specialist for more in depth testing for his trouble swallowing. He also wants him to follow up with him in the near future. One of the best Drs he's seen, not just ENT Dr's.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "107841753224888819299", "name": "Pamela Williams", "time": 1612467369274, "rating": 5.0, "text": "Dr Walters was very professional and answered my questions precisely. I will recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106998141012729230339", "name": "Ray White", "time": 1605305090089, "rating": 5.0, "text": "I was very happy with the office staff and with Dr. Lowery in their manner and concern for my well being. I highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108948349441784284622", "name": "D J", "time": 1608324642124, "rating": 5.0, "text": "They seem to be extremely cautious with Covid safety.  Dr. Walters is the BEST. Very patient,  explains well, answers all questions and really cares.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103746235602676490083", "name": "Bobbi Lee", "time": 1604173689837, "rating": 5.0, "text": "Excellent care, I felt welcomed and that all personnel were courteous and professional.  I was seen at my appointment time, in spite of COVID precautions and the aftereffects of Hurricane Zeta. Dr. Lowery was polite and answered my questions.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103424394194085224746", "name": "Heather Brownlee", "time": 1561036309536, "rating": 5.0, "text": "Went here yesterday for extreme ear pain. I had already been to a doctor and received antibiotics for what I was told was an inner ear infection. Upon arriving the nurses were extremely helpful and nice with helping me get my insurance figured out. I was taken to the back for a hearing test by another very nice lady she explained everything she was doing and explained the graph to me after we were completed. Dr.Walters was very thorough and looked in both ears more than once. He determined I DID NOT have an inner infection but, a protruding ear drum! He was able to pop it back in place for immediately relief. I was very happy with my visit here and everyone on the staff is extremely helpful and nice! I recommend anyone to go here!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109082315971785092268", "name": "Betty Bryant", "time": 1601771274314, "rating": 5.0, "text": "Prompt attention, thorough exam, left satisfied. Personnel very friendly.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106411139485337673177", "name": "Ala Barakat", "time": 1574714147498, "rating": 5.0, "text": "Friendly staff, no waiting on appointments. Dr. Walters was very friendly and knowledgeable. Highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108067481546921736104", "name": "Monty Reed", "time": 1603902935200, "rating": 5.0, "text": "Got me in same day I called. Fixed my gland immediately", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "113319179488473931618", "name": "Johnny Walker", "time": 1552072589188, "rating": 5.0, "text": "The staff is the best! They go out of their way to make you feel welcome and do an excellent job. I wouldn't considering going anywhere else and my treatment has been nothing short of a life changer.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112769715152790815053", "name": "TommyMary Grant", "time": 1605295090543, "rating": 5.0, "text": "In and out in a reasonable time", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105284883321240640723", "name": "Linda Lee", "time": 1603551441345, "rating": 5.0, "text": "Excellent serviice.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115527044841455865302", "name": "mike yeskevicz", "time": 1578437344859, "rating": 5.0, "text": "Dr.  W is great and very good bedside manner", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "111118226927417170590", "name": "James Patillo", "time": 1553719603482, "rating": 1.0, "text": "I was a patient of Dr. Jebeles for many years and was very pleased with him. In Nov 2018 I developed a severe nose bleed, something I never had previously. Had to go to emergency room where they advised me to go to my ENT Dr.  Which I did with Dr. David Walters with Southern EnT. He did nothing to treat the condition, other than advised me to go to the emergency room. Of course I told him I was at his office from what I was told to do from  emergency room Dr. that night the bleeding was severe and I called and talked to Dr . walters the next morning he advised me to go to the emergency room. Ayer a few days of  very severe bleeding I was able to get an  appointment  with  another ENT. Dr. Who immediately cart irised my nose.This Dr could not believe why Dr Walters would not treat this conditionThe bleeding was very severe and I felt it to be life threating. After almost 20 years I will never  go back to Southern ENT  And Sinus", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "117192137654006299074", "name": "Leah D", "time": 1479840431368, "rating": 5.0, "text": "I had a reaction to a steroid shot out of nowhere (that doesn't EVER happen to me), and the entire staff went out of their way to make sure I was taken care of. I was very much so blessed with their patience and kindness", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102494647938481819406", "name": "Lindsay Brock", "time": 1581728459297, "rating": 5.0, "text": "Great place great people 👍", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105138833436904284223", "name": "ANNimal 2020", "time": 1528596393523, "rating": 1.0, "text": "The rudest staff ever & Dr. Jebeles is in & out not hearing a word you say misdiagnosing you. Had to end up using another AWESOME ENT at ENT of Alabama at St. Vincent’s", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110847520477891799177", "name": "Mike MacMahon", "time": 1470661769547, "rating": 5.0, "text": "Prompt scheduling, attentive staff, and great doctors finally got me relief from my chronic sinusitis. Hooray!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "116296672795214289271", "name": "Ana Johnson", "time": 1497964879095, "rating": 5.0, "text": "Great staff! Quick and efficient!!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "113881841310014443641", "name": "David White", "time": 1621274419639, "rating": 5.0, "text": "I am so glad that ENT science has improved so well over the years.  I'm 73 and always as long as I can remember, suffered from sinusitis.  I just endured it with over the counter stuff.  But getting the \"tubes\" in my ears has really, quickly relieved my condition a lot.  I really like the fully professional staff and the doctors.  For once I am really better.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113619271270684809199", "name": "Greg Strickland", "time": 1626279895419, "rating": 5.0, "text": "Quick and professional, caring and knowledgeable staff who goes above and beyond to treat their patients. Some of the absolute best!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108511350413598810877", "name": "soapy jones", "time": 1625238515977, "rating": 5.0, "text": "A very professional office with kind, efficient crew and docs who explain things thoroughly, listen to questions and act with compassion. An amazing place.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106039686264639515928", "name": "Brian Koerwitz", "time": 1620783069366, "rating": 5.0, "text": "Dr. Shields went above and beyond.  My son came down with a rare illness his freshman year at the University of Alabama and we were from out of state.  The office got him in fast and was super easy to work with.  My son then needed a couple different letters from Dr. Shields to explain the illness to his employer and Dr. Shields worked with us on those as well.  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106736827327613698764", "name": "Ms. Bossy P", "time": 1620248251679, "rating": 5.0, "text": "Great experience. Dr Beniot was amazing with my special needs daughter. Would recommend", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115991408992300342305", "name": "Loren Enslen", "time": 1615393542236, "rating": 5.0, "text": "The staff is professional and polite. Dr. Benoit was great with my 5 year old son and very thorough in making sure everything was ok. Definitely would recommend Alabama Ear, Nose, and Throat to everyone!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114737419456065939731", "name": "Bob Corning", "time": 1614709944045, "rating": 1.0, "text": "Broken Nose.  No diagnosis or treatment provided. No attempt to explain to the patient on the condition or potential outcomes.  Completely ignored patient concerns for the 2 minutes the 'doctor' spent with the patient.\nHorrifying approach to a medical practice.  Seek treatment elsewhere.  Will be denying insurance payment.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108388235995406349160", "name": "Porsche Vaughn", "time": 1615981047744, "rating": 5.0, "text": "Very nice and detailed about what services will take place and I got results same day!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116959679379383426122", "name": "Mary Mitchell", "time": 1619040539283, "rating": 5.0, "text": "Best doctors, best CRNP EVER and the greatest staff around.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "101841470479283780590", "name": "Ashref Abdulla", "time": 1623877619819, "rating": 5.0, "text": "VERY professional I’m telling you guys right now I came all they way from Mississippi and they treated with nothing but respect and kindness", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113965823263956662771", "name": "Civille Brown", "time": 1614786984841, "rating": 5.0, "text": "Excellent ENT physicians. I trust them.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110251895664896590528", "name": "Amber Compton", "time": 1606833869641, "rating": 5.0, "text": "We were referred to Alabama ENT for a newborn hearing screen since my son didn’t pass his test in the hospital. The staff was friendly and wait time was short. The audiologist was very friendly and made the experience of the testing really smooth.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114198870122793215958", "name": "Summer Birdsell", "time": 1602703447627, "rating": 5.0, "text": "Dr. Gordon Shields is the absolute best! Has awesome bedside manner/care and has taken care of my children with their ENT needs! Defiitely recommend this doctor and their office team!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107079152949044991078", "name": "Jo Ann Harrelson", "time": 1593173845345, "rating": 5.0, "text": "The staff is always kind and very sweet when we arrive! My son is now 3 years old and knows when we go into the office he will be greeted kindly and get to see many nice and kind faces as they check his ears and make sure he is doing great.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "102702185973661939229", "name": "Ms. Barbara", "time": 1557845616187, "rating": 5.0, "text": "Dr. Shields is wonderful. He's professional and friendly. He really listens to his patients and he explains things well. The office is in a good location with adequate parking. The waiting areas and exam room were clean and nicely decorated. The staff was professional. The wait time was reasonable for the number of patients in the queue. No complaints.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116966833594077148861", "name": "Chana Taylor", "time": 1611207354616, "rating": 5.0, "text": "Dr. Benoit and staff were superb 🙌🏻", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104264536209657572908", "name": "Bertha M. Hunter (Queen B)", "time": 1615808926672, "rating": 5.0, "text": "I was very satisfied with the service I received", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115198616251159203336", "name": "Kimmy sofab", "time": 1593274118134, "rating": 5.0, "text": "Friendly staff who provided their services in a timely manner. My daughter is four and she was comfortable being there.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116078242948888619038", "name": "Nancy Gvillo", "time": 1559316081042, "rating": 5.0, "text": "I was very pleased with my experience at Alabama Ear, Nose,  & Throat Specialists.  Candace Maynard treated us with professionalism and care.  Dr. Crady and Dr. Benoit made us feel at home and both were very thorough with my son's exam.  Dr. Benoit did an excellent job with my son's ear tubes and we are so thankful!  We appreciated their follow-up and willingness to answer questions also. A big thank you to all of them.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111027484371582366609", "name": "Trisha Hubbard67", "time": 1557803950703, "rating": 5.0, "text": "I have been going to Dr. Benoit probably at least a dozen years.   Very nice doctor.  I feel confident with his diagnosis.   My daughter and family use him,  too.  I recommend him to family and friends.  Office staff are very nice.  Very clean and attractive office.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104287827818013816231", "name": "Curzine Wallace", "time": 1574723355795, "rating": 5.0, "text": "I went to Dr. Shields because I was having trouble with vertigo.  I was recommend by a coworker.  Dr. Shields and his staff are very  professional and thorough.  He performed a series of tests to see what was causing the vertigo.  I just want to say that you will not be disappointed with this practice if you decide to go.  Thank you Dr. Shields.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113306404739424630092", "name": "Lisa Phillips", "time": 1574997288529, "rating": 5.0, "text": "Dr. Benoit is a very good ENT Specialist. His concern and care about what I was dealing with made me feel so at ease under his care. He is very thorough with giving your diagnosis and prognosis. I was clear about everything that he was going to do for me before any procedure was done. The thing that really made my heart overjoyed was when he personally called to check up on me after my procedure. I've never ever had a doctor to take that kind of time out of their busy day to personally call me, and for me, that is what has left a lasting impression on me. I told my family and friends about that and they were amazed, so thank you Dr. Benoit and staff for taking excellent care of me. You will always be my ENT Specialist and who I will refer all my family and friends to. Thanks again!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113587790278628269445", "name": "CB Smith", "time": 1574283949252, "rating": 5.0, "text": "Dr. Gordon Shields is an excellent ENT. He demonstrated great rapport with me on my first visit so I knew he was going to be a good fit for me. During every visit, he walks in, immediately greets me, and shakes my hand. He addresses all my concerns.\n\nRecently, he performed minor surgery on me in his office and did an excellent job. Anesthesia was used and I had no pain or side effects. He is very competent and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110406999270827226784", "name": "Stephanie Hall", "time": 1600660359469, "rating": 5.0, "text": "Dr. Benoit is amazing! Staff is amazing as well! Thank y’all!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116411688938750328956", "name": "Carol Caffee", "time": 1597357731373, "rating": 5.0, "text": "Nice seemed knowledgeable, understood and was patient with my emotional baggage from childhood.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "117378502316229761923", "name": "rebecca house", "time": 1579365928462, "rating": 5.0, "text": "I see Dr. Benoit as well as NP Snider. They are both great and well knowledgeable. I feel like they really listen and form a treatment plan to quickly help the problem!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113116154842476270865", "name": "Robin Kuykendall", "time": 1554915933723, "rating": 5.0, "text": "Dr Shields has the greatest bedside ethics and he’s also very knowledgeable.  I couldn’t ask for an easier experience relating to my inner ear disease.  Highly recommend Dr Shields and his staff are super friendly and very prompt and professional!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "117444479934895412576", "name": "Diane Walker", "time": 1571356365035, "rating": 5.0, "text": "Dr Benoit corrected a problem I had for years. I had a dry hacking embarrassing cough for many years and all of my testing were normal and no doctor could figure it out. As soon as I told him about my symptoms he gave me a diagnosis right away and prescribed a medication that worked. The first day without coughing brought me to tears because I FINALLY found a solution! . I will forever be grateful. Dr Benoit you are the BEST!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "105215403665117044367", "name": "Terra Smith", "time": 1614966007916, "rating": 5.0, "text": "I would absolutely recommend Dr. Shields and his staff! Everyone was friendly and professional. I had the balloon procedure done in the office, and they talked me through the procedure before and during. Excellent job!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109503534678122345679", "name": "Rose Boyd", "time": 1522704488918, "rating": 5.0, "text": "I called first thing in the morning and was able to get an appointment later on that morning. First time patient - you know what kind of paperwork you have to complete.  The young man on the other end recommended I go online to complete the patient forms, which was VERY convenient.  I was able to type in all the info, print out and sign.  I was in and out within an hour. The staff was phenomenal.  Very, very nice and professional.  Dr. Benoit was GREAT!  Very empathetic, kind and caring. I would highly recommend Dr. Benoit and his staff!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115413020976574948841", "name": "Alicia Menard", "time": 1547740484877, "rating": 5.0, "text": "Very friendly staff, easy parking, and clean office; these guys are great! Dr. Benoit took his time to address my issues and he answered all my questions.  His nurse was fantastic, too.  I would highly recommend Dr. Benoit to anyone looking for an ENT.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106116130577556907819", "name": "Lodkeshia Cheatem", "time": 1574958694702, "rating": 5.0, "text": "Dr. Benoit is the best. Great bedside manner. Very patient and thorough!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114254464577441266767", "name": "JAMES GORMAN", "time": 1552079106013, "rating": 5.0, "text": "Very impressive got right to work, did what I went there for.   Staff is very well informed and they know their positions.  Was really impressed with everything.  I will be a patient as long as they will have me.    I will recommend  to my family and anyone that needs an ENT.       JG", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104015572374637888836", "name": "April Stevens", "time": 1546530654074, "rating": 5.0, "text": "We love Dr. Shields and Audiologist Crady and everyone at this practice! Unfortunately my son has needed 3 sets of ear tubes because he just hasn't outgrown the condition, so we have visited this office A LOT and they are always kind, professional, and great with my son. They are very good with timing their appointments as well, we do not have long waits like you have at many doctors, which is really a blessing when you have small children waiting with you.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "100067090699476337812", "name": "Curtis Fleming", "time": 1527697176927, "rating": 5.0, "text": "These are Great folks to deal with and always do a good job with your medical and Hearing issues. I saw the audiologist  Molly and she checked my hearing and made some adjustments to my hearing aids and I can hear much better.  Thanks", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107260230849865821536", "name": "Sarah Morrison Bell", "time": 1545345950245, "rating": 5.0, "text": "We love Dr Benoit! He is so patient and kind! You can tell he really cares! Great with small kids!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "100110603797624471531", "name": "Heather Miller", "time": 1548863448288, "rating": 5.0, "text": "Very professional, organized and knowledgeable staff. They got us in and out quickly but not without thoroughly explaining our toddlers condition or treatment options. I didn’t feel rushed and felt as if Dr. Shields genuinely cared for our son and his illness.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110340905543661727024", "name": "Jessie Sealy", "time": 1579750370367, "rating": 5.0, "text": "I was very sick with a very bad cough sore throat and couldn't talk good. I called the office and they let me come that day and was treated for my illness. I thank all them for that. Keep up the good work. Thanks", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103037181254945107522", "name": "Tom Ozment", "time": 1559310832911, "rating": 5.0, "text": "Dr. Shields and Dr Benoit have taken excellent care of me with a right ear issue. From hearing tests to treatments, everyone is top notch and on the ball.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "100487318486531705127", "name": "Dianne Knight", "time": 1513440670707, "rating": 5.0, "text": "My experience was very good. First of all I was able to do paperwork on computer and just take in at my appointment. More offices need to pick up on this because very good. Everyone that works there are friendly just as doctor.  Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109566918139777596553", "name": "Dee", "time": 1545459434459, "rating": 5.0, "text": "I had a major/minor accident. One doc tokd me my nose was broken, then Dr. Benoit told me it wasn't.  After a follow-up visit I am happy 2 report I am back to normal. Dr. Benoit was great and made me feel really confident in his diagnosis. Thanks Dr. B.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114593770736435434144", "name": "Cherrelle Knight", "time": 1592712358431, "rating": 5.0, "text": "Love this office. Nice and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108114782287420774536", "name": "Poisondragonx", "time": 1550091628041, "rating": 5.0, "text": "These are the best docs I've just about ever dealt with...they get you in fast and get you out fast.  They did a wonderful job with my son on getting him over some chronic sinus problems and did great on his tonsilectomy...highly recommended", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113491136206277514705", "name": "Robert Poe", "time": 1582754060721, "rating": 5.0, "text": "Dr pappas is a great friend to hard of hearing ppl", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110231408030201526696", "name": "Charlie Odle", "time": 1615028167505, "rating": 5.0, "text": "5 star experience in all areas.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110254784151641475683", "name": "Super Sunny", "time": 1583279942620, "rating": 5.0, "text": "Fixed my nose; can't really compare it to anyone else, as I've only had this done once.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "112839772463571974876", "name": "Lynne Foster", "time": 1532549721849, "rating": 5.0, "text": "Dr. Benoit is extremely professional.  He takes his time and thoroughly explains everything.  I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109349656193810439298", "name": "Eric Lewis", "time": 1567006735363, "rating": 5.0, "text": "I been using them for years, easy to get into and always treated good.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "117433677490439410420", "name": "Tina s Mills", "time": 1562798980365, "rating": 5.0, "text": "I have been to 2 ENT doctors while I lived in Pensacola Florida.  I have been to a UAB ENT doctor since moving back to Tuscaloosa. No one has helped as much as doctor Benoit!!  Not only has he helped my vertigo, which I considered severe and disabling, he is so kind, he listens and treats you with respect.  He has tried something new for my vertigo and it is working!!  Hugs to Alabama Ear, Nose and Throat!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "105524413703349215141", "name": "Patrick Agee", "time": 1512316413329, "rating": 5.0, "text": "Alabama ENT was able to see me on short notice.  They were attentive to my needs and went above and beyond.  Great group to call my doctor(s).", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106798340848954041248", "name": "Sandra Reed", "time": 1571677135217, "rating": 5.0, "text": "Professional; answered all my questions; highly recommend", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108497264382148232129", "name": "Natasha Norwood", "time": 1557436351011, "rating": 5.0, "text": "Friendly staff & My first time goin to Dr. Craig M.Benoit,  MD  Office... Dr Benoit went right to my problem... Thank u so much for helping me...\nTMJ is soo painful & now Humana want pay for my Mouth Splint $1,000.....", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104052784802159400819", "name": "BeardedWonder 85", "time": 1519695883296, "rating": 5.0, "text": "Dr. Shields and the staff at Alabama ENT were great. They all were polite, respectful, and to the point. I had surgery on my nose performed by Dr. Shields and couldn't be happier with the results.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103807068427870060776", "name": "Eric Lewis", "time": 1533657941933, "rating": 5.0, "text": "I always get good service, and when I have an emergency they do their best to work me in as quick as they can.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111257747565844584994", "name": "Nicole Perez", "time": 1567377004048, "rating": 5.0, "text": "Great, helpful staff. I also never had to wait long at all.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107269995982324146813", "name": "Christopher Snider (craziedScot)", "time": 1511906711321, "rating": 1.0, "text": "I’m in disbelief that I have two insurance cards (both valid) a primary (Blue cross blue shield of Alabama) and secondary (Aetna) both covered at this place. I was told after waiting an hour that they (Alabama Ear, Nose and Throat) can’t see me until this is resolved. Not sure what needs to be resolve but I lost a days pay coming to see this doctor. I even said I would pay cash and was turned away. This is a crock of S**T and I am totally going to get my money, I lost for taking a day off work. Figured we get billed if we miss an appointment and only fair the doctor gets billed for my time. Totally disappointed by the professionalism of the front desk. It’s a shame I hear good things only to be proven wrong!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109593565242482167199", "name": "Jeremy Middaugh", "time": 1525278818866, "rating": 5.0, "text": "Very professional and most caring about their patients. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113206068573400478637", "name": "Luke Smith", "time": 1546448380086, "rating": 5.0, "text": "Great people. Great visit. Highly recommend. Very professional and personable.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "118232824126738986087", "name": "Andrew A", "time": 1512746426996, "rating": 5.0, "text": "Very thorough. Nice and helpful. Did an awesome job on my surgery.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107872501568885544341", "name": "zz tan", "time": 1574798534882, "rating": 4.0, "text": "doctor are good, but it's hard to get quick appointment", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115150106140390877842", "name": "Tyra Hoggle", "time": 1550764167724, "rating": 5.0, "text": "Love Dr. Benoit and the ofc staff is nice and friendly.  I've never had a long wait time either.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104266838227250659539", "name": "Abbey Jones", "time": 1537325171286, "rating": 5.0, "text": "I’ve been going here for the last couple of years, and have been completely satisfied. The wait is never long, the staff is courteous, the audiologists are nice and experienced, and Dr. Shields always listens to me and takes his time.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115574639220688949790", "name": "Amanda Knight", "time": 1513698037452, "rating": 5.0, "text": "The staff were vary friendly and was great to my daughter they put her at ease.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115868201907020800473", "name": "Shatara Hunter", "time": 1531327128789, "rating": 5.0, "text": "Dr. Benoit was very attentive and listened to my problems rather than telling me what he thought was wrong without me telling him anything. And I appreciate that.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114411443899349950170", "name": "Melissa Holt", "time": 1512162433935, "rating": 5.0, "text": "The staff is very friendly and very efficient. No long waits.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110602600753521769225", "name": "Greg Baxley", "time": 1565402285689, "rating": 5.0, "text": "Best ENT Dr. In town.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111603126032384873173", "name": "Danielle Jeter", "time": 1550954934615, "rating": 5.0, "text": "Little wait time & caring Dr's.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104200473257126159865", "name": "Riley Leslie", "time": 1522942772098, "rating": 5.0, "text": "I had a very good experience! Very friendly atmosphere!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103183970892002056954", "name": "Sibyl Fondren", "time": 1483890126108, "rating": 5.0, "text": "I'd been plagued with monthly sinus infections with intense pressure and pain for over a year.  During that time I saw 3 different ENTs without any long term change.  I had tried the prescribed sinus irrigation, Flonase, countless rounds of antibiotics etc. to the point I was living on decongestants to get any relief.\nDr. Benoit was the first to suggest taking a CT scan. He listened to my history and seemed to genuinely want to help me find relief. He showed me the CT scan and explained how my deviated septum and enlarged turbinates were swelling and causing not only pain but blockage which wasn't allowing mucus out or helpful medications in! He suggested a septoplasty with turbinate reduction.\nMy surgery was November 16, 2016 and I have had continually improving symptoms.  I have yet to have a sinus infection, I can breathe freely through both nostrils (something I never realized I couldn't do!), clearing my sinuses is a breeze now and my Flonase can actually get where it needs to go!\n\nA huge thanks to Dr. Benoit and his friendly, efficient staff! I couldn't imagine an easier experience or a better outcome!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113313419430993677469", "name": "Larry Roach", "time": 1573219930964, "rating": 5.0, "text": "Very caring, friendly, and professional service.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "112375069333297057840", "name": "Brenda Brasfield", "time": 1558582408752, "rating": 5.0, "text": "Did not have a long wait before being seen by dr, staff friendly,  courteous.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104213062139648864414", "name": "Janece Chapman", "time": 1576168348892, "rating": 5.0, "text": "Dr. Benoit was great!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "112467123270199105417", "name": "James Barber", "time": 1547567590379, "rating": 5.0, "text": "Professional staff that is always pleasant and helpful!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "102106313279225573884", "name": "Garrett Mckone", "time": 1512748566112, "rating": 5.0, "text": "Glad we have these great doctors in Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115587299688486114880", "name": "scotty probasco", "time": 1491408680851, "rating": 3.0, "text": "Charged for pre surgery screening and then refused surgery, all while being referred to a pulmonary doctor that was \"covered by insurance\" but it wasnt.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115041041835384402708", "name": "Pam Nix", "time": 1553557208387, "rating": 5.0, "text": "Very happy with the personal and the doctor!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106731982446235249239", "name": "Susie Culp", "time": 1566946830838, "rating": 5.0, "text": "did not have a long wait at all.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116991023155130235307", "name": "Lanora Bayer", "time": 1525264891490, "rating": 5.0, "text": "Excellent customer service and care!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116060001029842830857", "name": "Kristy H", "time": 1520454177262, "rating": 5.0, "text": "You couldn’t ask for a more understanding doctor and the nurses were very friendly as well.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "102992916564037910708", "name": "Glenn Munn", "time": 1566248281727, "rating": 4.0, "text": "Very professional and courteous", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111995354223072391796", "name": "Grace Byrd", "time": 1532639340737, "rating": 5.0, "text": "Very professional and thorough.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111349679636473650547", "name": "Graylin Arnold", "time": 1552147735681, "rating": 5.0, "text": "Good overall experience", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104517709334499223091", "name": "Philip Plotkin", "time": 1574174084790, "rating": 3.0, "text": "Meh", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "101856646060653355417", "name": "Linda Noland", "time": 1513700390311, "rating": 5.0, "text": "Very nice and helpful", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113404023382610507391", "name": "Christinia Hinton", "time": 1537256048792, "rating": 5.0, "text": "Knowledgeable,  Friendly people", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116568740081166769910", "name": "Quionnia Harkins", "time": 1546230451002, "rating": 4.0, "text": "Nice, friendly, and helpful!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106243356330963316888", "name": "Valarie Deloach", "time": 1550493182784, "rating": 5.0, "text": "Excellent care", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111626396238041970964", "name": "Randall Garrison", "time": 1627350619154, "rating": 1.0, "text": "Christopher Clark is a very arrogant doctor.  Instead of trying to find a solution, he got defensive and belligerent with me.  I had to go back to my doctor, today, who sprang into action right away, when he heard of my condition.  Clark had a good opportunity, but failed to make the mark.  I’m not sure Clark is a capable doctor.  I didn’t see it.  I will try to give Clark as much adverse publicity as I am able.  And that goes for ENTAA as well.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101600483277831810121", "name": "liz fike", "time": 1627450354305, "rating": 5.0, "text": "Even though I’m sick, I love coming to see the friendly staff & my great Dr Goldberg!!!  I think he is the best is town!!! I’ve been with them since 1997.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103737119299193193861", "name": "Cindy Attaway", "time": 1625218476900, "rating": 5.0, "text": "I always like going to see Dr. Owens because of his joyous personality as well as his expertise as a physician. He has always been a great help to me and makes sure he answers all questions I might have. He makes me feel that everything will be ok and I need not worry. I like that feeling when I walk out of his office. All his staff are very kind and helpful.", "pics": null, "resp": {"time": 1626377758985, "text": "Thank you so much for taking the time to send in a review for Dr. Owens and our staff here at ENT Associates of Alabama."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107392813736810835368", "name": "Mark Teachman", "time": 1627503507733, "rating": 5.0, "text": "Dr Owens was very helpful in diagnosing and treating my reflux condition. He is kind and spends enough time with me to thoroughly evaluate and discuss options.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "117945188680937347628", "name": "Amber StJohn", "time": 1627438293961, "rating": 5.0, "text": "The entire staff is very professional and helpful. They still care and take time with their patients. I never feel like I am being rushed and not heard. Here is the big one.... when you call, they answer the phone!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104515631635871833435", "name": "Gary Eggleton", "time": 1627650235065, "rating": 5.0, "text": "Had Sinus checked for infection, they were, received shots and a prescription, Dr. Wilson was good, thorough and informative.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107601454558163584898", "name": "Christy DeFrance", "time": 1626655190475, "rating": 5.0, "text": "Polite and respectful staff. Dr Colvin listened to every concern and addressed my needs/issues professionally and politely.", "pics": null, "resp": {"time": 1626790748899, "text": "We appreciate you taking the time to send in a review for Dr. Colvin and the staff at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115956290267738750272", "name": "Sue K", "time": 1625691621273, "rating": 5.0, "text": "I have just started going to Dr. Elledge and I’m very glad that my doctor referred me to him. He listened to my concerns and came up with an excellent plan which was the least evasive way to go. Also, his staff is friendly and made me feel very comfortable. I definitely recommend this practice.", "pics": null, "resp": {"time": 1626378103342, "text": "Thank you so much for taking the time to send in a review for Dr. Elledge and for our staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114733621895994713544", "name": "Tammy Maddox", "time": 1625617518099, "rating": 5.0, "text": "Dr Clark and staff at ENT Associates of AL are all exceptional and very caring! Very pleased with their expertise and kindness!", "pics": null, "resp": {"time": 1626378802438, "text": "We appreciate you taking the time to send in a review for Dr. Clark and the staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110926444518109971616", "name": "Sierra Turberville", "time": 1625769232442, "rating": 5.0, "text": "Friendly staff, short wait times, Dr. Colvin very thorough explaining things and very patient to make sure it is understood.", "pics": null, "resp": {"time": 1626378449162, "text": "Thank you so much for spending the time to send in a review for Dr. Colvin."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101074120633007936355", "name": "Joy Steadham", "time": 1626095101316, "rating": 1.0, "text": "Made an appointment at the Grandview office of ENT Associates and after 2 hours in this office, I left without any treatment or conclusion in regards to my visit. Two weeks later, I visited a local Doc in the box (Med Center Hoover), in which they let me know within 30 minutes of being in the office I had fluid behind my ear which was causing the issues I had gone to a PROFESSIONAL for. Upon leaving ENT associates I was under the impression that of 24 years of age I was suffering from tinnitus, as well as needed to consider a nose job for my allergy problems. Now after one day of being treated by the local doc in the box, I feel 100 times better. Who knew it was rocket science to take .000005 seconds to look into someone's ear and see fluid, and then connect the dots. 0/10 for ENT Associated at Grandview, don't waste your time.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111984259075706517089", "name": "Mandi V", "time": 1626193256881, "rating": 5.0, "text": "Extremely friendly and knowledgeable staff. Such a great place!", "pics": null, "resp": {"time": 1626378327728, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "113019352532044808791", "name": "Kayla Thomason", "time": 1626367514489, "rating": 5.0, "text": "Everyone is so nice and efficient. Glad to breathe again after Dr. Elledge did my septoplasty!", "pics": null, "resp": {"time": 1626377796627, "text": "Thank you so much for taking the time to send in a review for Dr. Elledge."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101385346462785410473", "name": "Ashley Davis", "time": 1625245029167, "rating": 5.0, "text": "Dr. Goldberg is my new ENT! He was professional, thorough and kind. I so appreciate the staff at ENT Associates of AL, P.C.", "pics": null, "resp": {"time": 1626378829651, "text": "We appreciate you taking the time to send in a review for Dr. Goldberg."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102776650278946608861", "name": "Tamika McNeal", "time": 1626439550203, "rating": 5.0, "text": "Service very quick. Staff very friendly", "pics": null, "resp": {"time": 1626790811164, "text": "We appreciate you taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104221464419337013578", "name": "Leonard Wertheimer", "time": 1625239029381, "rating": 5.0, "text": "Very good medical treatment and very warm and welcoming staff.", "pics": null, "resp": {"time": 1626378951698, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111949772950405776934", "name": "Tracey Smith", "time": 1627134805353, "rating": 5.0, "text": "Dr. Goldberg was great at discussing treatment.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118378415853564195355", "name": "Esther Levy", "time": 1626552962943, "rating": 5.0, "text": "I was able to get in quickly and everyone was very nice,", "pics": null, "resp": {"time": 1626790780493, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100531382467029140198", "name": "Jeri Davis", "time": 1625693809868, "rating": 5.0, "text": "Dr Goldberg is kind, relaxed, not an alarmist and an excellent Dr.", "pics": null, "resp": {"time": 1626378760461, "text": "Thank you so much for taking the time to send in a review for Dr. Goldberg."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "112906857844062869767", "name": "Patricia Bonds", "time": 1625227990726, "rating": 5.0, "text": "Very good , happy with care received!", "pics": null, "resp": {"time": 1626379011627, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102712663322596536182", "name": "Linda Channell", "time": 1603245296210, "rating": 2.0, "text": "Very pleasant & courteous, but he did not fully address all of my issues.  I felt the depth of care was enough justify the charges.   Very disappointed,", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102448728965203132829", "name": "Lisa Lowery", "time": 1627673759152, "rating": 5.0, "text": "Dr. Owens is the best!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102051067274359310885", "name": "Kathryn Carlton", "time": 1625700372941, "rating": 5.0, "text": "Dr. Owens is wonderful!", "pics": null, "resp": {"time": 1626378738564, "text": "We appreciate you taking the time to send in a review for Dr. Owens."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "116124522623155828585", "name": "Darrell Sims", "time": 1626296449263, "rating": 5.0, "text": "Knowledgeable, caring  Doctor!", "pics": null, "resp": {"time": 1626378279723, "text": "Thank you so much for taking the time to send in a review for Dr. Goldberg."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110230002038362439113", "name": "Angela Hollis", "time": 1625763264301, "rating": 5.0, "text": "Very detailed oriented", "pics": null, "resp": {"time": 1626378692571, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "109261231269065310241", "name": "Salim Jan", "time": 1576729248154, "rating": 5.0, "text": "Good Group of Doctors, Great services by entire staff. Good communication.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMqHA_fVVPNH1R2F00L7xlnUoF6XUzNDSNjRxsS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "109817597646888992463", "name": "Deana Gore", "time": 1573483407473, "rating": 5.0, "text": "A truly wonderful group of Physicians and Staff.  Decades of experience. The doctors have taken VERY good care of me and my son in immediate times of need. Several members of my extended family and friends are also seen by the physicians. Never have to wait for an appointment, same day.  Can't say enough GOOD about this practice.  I would HIGHLY recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107274967924642924701", "name": "Rhonda Shear", "time": 1573235176541, "rating": 5.0, "text": "The doctors and staff of ENT Associates of Alabama are wonderful!  Dr. O'Neil at St. Vincent's is AMAZING!!  The staff at the Grandview, St. Vincent's Downtown and St. Vincent's East locations are always so nice and friendly. The girls at check-in always have a smile on their faces.  And I can't say enough about how efficient they all are!  There is no sitting in the waiting room for an hour waiting to see the doctor.  They get you in and out very promptly.  But when you leave, you don't feel like you were just a number and rushed out of there.  I highly recommend ENT Associates!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "106812794086520904637", "name": "Jill Carter", "time": 1575484505576, "rating": 5.0, "text": "We go to the St. Vincent's office in Trussville.\n\nDr. Christopher Clark is amazing with both Adults and Children.. My 5 year old ADORES him and trusts him completely. They REALLY CARE about their patients and have ALWAYS found time to see us THAT DAY if it is urgent... Even if it means staying later after hours.\n\nMy daughter needed her tonsils out, he did his first available and did a Great Job!!\n\nAnd the staff, they are the kindest and hardest group of workers I have ever met. There is child area in the waiting room full of books and lots of other fun stuff W(is actually cleaned often)!\n\nI would recommend them (especially Dr. Clark) to EVERYONE!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103143966881715442526", "name": "Joe McNulty", "time": 1564664067627, "rating": 5.0, "text": "My wife had surgery at St. Vincent’s on Monday and Dr. Black and his team were awesome. St. Vincent’s Hospital was a wonderful  experience. From the time we checked in at 4:45 am until we left, even the special kindness shown to us by the young lady who went to retrieve our car did not go unnoticed. We were very impressed. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104340587657520904090", "name": "Kathy Lecroix", "time": 1572375287594, "rating": 5.0, "text": "The allergy department staff is awesome!! They are interested in me and make sure that I’m doing well with the medicine!! Deana and Libby take excellent care of me and are very encouraging and attentive!! I wouldn’t go anywhere else and I highly recommend this department to everyone!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114459070276250322513", "name": "Kayla Adcox", "time": 1573184263471, "rating": 5.0, "text": "Amazing group of doctors! All are wonderful! They’ve been treating my sinus and allergy problems for four years now. I would recommend this group to anyone with ear, nose, and throat issues.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102901354116100409537", "name": "Bradley Dupree", "time": 1580407565712, "rating": 1.0, "text": "Arrived 15 minutes early for appointment. Waited 2.5 hours, and still had not seen the doctor. Left to return to work. I understand the overbooking process, but patients would appreciate a heads up for long waits, or even alternative dates to ensure a quick visit. This is unfortunate, because I've otherwise had a pleasant experience at previous visits.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "113662107268451887304", "name": "Greg Gravlee", "time": 1574618523888, "rating": 5.0, "text": "The Allergy team is phenomenal!  Libby and Deana have great attitudes, and their customer service is fantastic.  I always enjoy my \"one-time-per-vial\" visits.  Thanks, ladies!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102381781407944757405", "name": "Lisa Benefield", "time": 1566512224219, "rating": 5.0, "text": "Dr. James T. O'Neil is the best. A great Doctor who has a great attitude, smart, and straight up with you about your issues. He listens and communicates well and gets you out of the hospital FAST! A very trustworthy & down to earth guy.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107252443570053836510", "name": "S Curtis", "time": 1574814141284, "rating": 5.0, "text": "I have been a regular patient/customer at the ENT Associates of AL main office at St Vincent's for many years. I have always been very pleased with the office staff, the nurses, and my doctor (Goldberg). Everyone is cheerful, polite, and helpful, and they really keep things moving in the clinic to try and stay reasonably close to 'on-time' for appointments.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103857946469844124609", "name": "April L", "time": 1559669972611, "rating": 5.0, "text": "St. Vincents location - Entire staff was nice. Process was smooth. I was able to complete registration easily from my phone the day before my appointment. I had Dr. Alan. He took care of all my concerns and made sure I was good to go. I would refer any of my family and friends to him.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115558552328356695858", "name": "Scott Wilson", "time": 1575323655858, "rating": 5.0, "text": "First time there and nothing but good to say about these professionals. Dr. Black was who I saw and he was thorough and friendly. Treated me like a patient and not a case or number. Left feeling good about my first experience with them.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "109303173050133796646", "name": "Patricia Pate", "time": 1575083377780, "rating": 5.0, "text": "I have loved my experiences with these doctors, especially Dr. Black, and the employees. I truly believe that Dr. Black saved my life and I am so very thankful for him. I would, and do, recommend Ent Associates of Alabama to everyone.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118041675667427554623", "name": "Tammy Felix", "time": 1574652370744, "rating": 5.0, "text": "Dr LeJeune is amazing! Very knowledgeable and listens to his patients! The front desk staff are incredible! All of the staff, nurses all of them are outstanding! I'm grateful for all of them!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102550157513146698159", "name": "Kelsey Jackson", "time": 1573172453686, "rating": 5.0, "text": "Ent Associates of Al where do I begin you can’t go wrong with the physicians here they care for you listen and take time for you and the staff members are awesome as well! They all work as a team and you can definitely tell it! Love ENT Associates of AL!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115529160765586903923", "name": "Katie Pardue", "time": 1573159076042, "rating": 5.0, "text": "This is a great group of doctors. The office staff is very kind and helpful. I highly recommend this practice to anyone that needs a ENT doctor.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108421289589950340819", "name": "Heather Williamson", "time": 1565393261096, "rating": 1.0, "text": "Dr Black has the absolutely worst bedside manner. He shares absolutely no sympathy with his patients. To even watch him belittle his shadow Dr,'s. I will never use this practice again, much less recommended it. I will do my due diligence to shed light on a self sanctified, full of himself physician. For a Christian based hospital....he shows no christ like behavior. Only self exalting, completely blinded by himself. To feel so debased today,....complete unbecoming of St Vincent's Hospital. I will definitely let everyone I know, to steer clear of this practice.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107428446078709868044", "name": "JMC 1981", "time": 1573572877954, "rating": 5.0, "text": "The entire ENT Associates of Alabama staff are awesome!! Great staff and great facilities. I would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108099316558788495388", "name": "Taylor Manasco", "time": 1573144983752, "rating": 5.0, "text": "Such a wonderful group of physicians! I couldn't have asked for a better experience. The staff was absolutely fantastic and very friendly.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115419063940870909463", "name": "Jamie Odell", "time": 1572295160507, "rating": 5.0, "text": "Love ENT Assoc. of Alabama- St. Vincent’s Birmingham Allergy Dept. Deana and Libby are wonderful and make the allergy process SO much easier! :)", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111596220926709340434", "name": "Sam Rich", "time": 1573154981311, "rating": 5.0, "text": "I see Dr. Patrick Owens at the St. Vincent's East office - this is an excellent and caring office.  Everyone is very friendly, from the front desk to the back of the office.  I highly recommend this office and doctors.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "105543517773035895497", "name": "Catherine Gray", "time": 1574619056548, "rating": 5.0, "text": "ENT Associates has the most professional and friendly staff! The nursing staff is personable and professional. Highly recommend ENT Associates for all of your ENT needs!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114117616787926717266", "name": "Jenny Vaughn", "time": 1571666172627, "rating": 5.0, "text": "Wonderful group of Doctors. I would trust any one of them to see me or my family!  Dr. Goldfarb is absolutely wonderful! He's not just a wonderful doctor, he's a good hearted person who loves his patient's and staff", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102636808123014538934", "name": "Petit J", "time": 1584103188657, "rating": 2.0, "text": "On Thursday, March 12th, arrived at 1:45 pm for 2:00 pm appointment with Dr. Clark (St. Vincent's East location, Bldg 48).  Was called to exam room at 1:55 pm.  Was told there would be a wait as Dr. Clark was in surgery....Dr. Clark finally came in to see me at 2:50 pm.  NO ONE CHECKED ON ME OR GAVE ME UPDATES DURING THE 55 MINUTES I WAITED IN THE EXAM ROOM.   WILL NOT BE BACK TO DR. CLARK!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100118449264731591401", "name": "Drew McLaughlin", "time": 1573559099991, "rating": 5.0, "text": "Great group! Amazing doctors and courteous staff! Everyone always goes above and beyond for the patients.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "113680681893986111836", "name": "Kelley Cobb", "time": 1573150886022, "rating": 5.0, "text": "Great group of physicians. Office staff also very helpful! Wouldn't use anyone else!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108715670324379543339", "name": "Terilyn Burg", "time": 1575501203547, "rating": 5.0, "text": "Bravo to all of the staff for their caring and loving attention they give to all of the patients/clients...definitely 5 star *****.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102051137016425340285", "name": "LM Jones", "time": 1572516656179, "rating": 5.0, "text": "St. Vicents birmingham allergy department staff are great. I always enjoy seeing Deena and Libby. They are so sweet and very professional! They make the experience the best!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111609954273664601500", "name": "Crista Hughes", "time": 1574439174930, "rating": 5.0, "text": "Amazing group of people they just love on my little guy , hes very hard to deal with but they take there time with him and try and talk to him and play to calm him down. Thank yall❤", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104700017364807186748", "name": "Kellie Luckie", "time": 1576088775545, "rating": 5.0, "text": "ENT Associates has a great group of doctors!!  I would refer anyone to see them as I know that these doctors will take care of them.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "106990660158061339394", "name": "Mallory McLaughlin", "time": 1570712834358, "rating": 5.0, "text": "Very friendly staff and amazing doctors!! Dr. Goldfarb did nose surgery on me, and has been amazing!! I have had no pain with the surgery.\nMy family sees Dr. Favrot, and think the world of him. You would be in great hands with any doctor in this group.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108075829711714187167", "name": "Miranda Stewart", "time": 1573151556708, "rating": 5.0, "text": "Dr. Elledge and team are wonderful!!  They have treated me and my son (both patients) so well and I would recommend them to all my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "105120504952298710589", "name": "John Higginbotham", "time": 1522157309470, "rating": 2.0, "text": "Great staff and doctors. However, my wife was overcharged for her test and office visit. This is ok as long as the refund is issued in a timely manner. The CEO Dianne's policy is that if you are overcharged, you will receive a check 6-8 weeks later. This is unacceptable as they should bill these charges rather than charge too much upfront. I STRONGLY encourage any patients to check to make sure of this as the billing department would have kept my money if I hadn't caught it.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104107257879545414212", "name": "Brittany Robinson", "time": 1569849786352, "rating": 5.0, "text": "Staff is very friendly and helpful. Everything is very clean and well kept.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114918023619602504750", "name": "Kaye Jones", "time": 1573146553027, "rating": 5.0, "text": "My daughter has had sinus issues for years\nI made an appointment in the Alabaster Office. We loved Dr Elledge and his wonderful staff\nAfter being treated by Dr Elledge my daughter is doing tremendously better\nI highly recommend Dr Elledge at ENT Associates of Alabama in Alabaster ❤️", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "112219494699453841743", "name": "vickie howell", "time": 1573149495781, "rating": 5.0, "text": "All the staff at ENT Associates of Alabama are very polite and make you feel so comfortable.You dont have to wait long to see a dr. They have you in and out at a timely matter.I would recomend anyone that needs to see a ENT to go to ENT Associates of Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104191370803535717013", "name": "Shawn Green", "time": 1573149899413, "rating": 5.0, "text": "They get  you back in a room fast and the doctors and staff are very kind and helpful", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111613398629910671742", "name": "Chris Vaughn", "time": 1573142994106, "rating": 5.0, "text": "wonderful group of doctors and staff!! I would highly recommend this ENT group", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115366696405612728523", "name": "B Cop", "time": 1569591309520, "rating": 1.0, "text": "The McDonald's of ENT's (not a good thing)\nSaw Dr Oneil (well, actually his PA did most of the work, he showed up for 30 seconds at the end) for a very bad double ear infection and he was less than gentle with my sore ears. The nursing staff is all about turnover...they messed up my first prescription to the hospital pharmacy and I am still trying to get a prescription called in 24 hours later but cannot get past the nurses answering line and nobody will call me back.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118163050985599564094", "name": "William Daniels", "time": 1573147709170, "rating": 5.0, "text": "I had a great experience with Dr Favrot\nCompassionate nurses\nStaff was wonderful", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "117146196197401617402", "name": "Hannah Taylor", "time": 1573149419359, "rating": 5.0, "text": "Great group of doctors with friendly staff! Dr Black did my thyroid surgery and I could not have asked for better care!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101194385593443794945", "name": "Sonya Gruber", "time": 1574513412538, "rating": 5.0, "text": "A great group, got the best care, left feeling better.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100079395979048023130", "name": "posey ernie", "time": 1568658644524, "rating": 1.0, "text": "I have been a patient of dr lajune and dr brag for about 25 years. now that they moved I call to refill my allergy and they say I have to schedule a appointment I was just there 6 weeks ago that's another fifty copay so I decided to take my business elsewhere thank you very much.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114130158722700993356", "name": "Toni Ashcraft", "time": 1553878886647, "rating": 5.0, "text": "Very helpful and efficient like I have not seen in dr office in a while staff is helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107115008727544408548", "name": "Adam&Kimberly waugh", "time": 1574786076104, "rating": 5.0, "text": "Dr. LeJeune and the staff at Gardendale are great!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100867552836536690914", "name": "Brenda Cade", "time": 1527337928284, "rating": 1.0, "text": "Dr Poynor has got to be the worst Dr at St Vincent. He told me I had an attitude because I didn’t remember the prescription Dr Simpson prescribed to be before and I asked was it in the files. When he said that I immediately left his office and refuse to be seen by him. Dr Simpson was booked but he was able to squeeze me in. When I was on my was back to see him Dr Poynor continued to try to make commits to me. He said I did not mean to cause you to have a bad day with a smile on his face. What was that to say. If my Dr is not available I do not and will not ever step foot in his office. Other than that the Staff is all way courteous and Dr Simpson is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "117259978054771811622", "name": "Angela Manasco", "time": 1573145958643, "rating": 5.0, "text": "Great group of physicians. Friendly  staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102599839990068348742", "name": "Jeremy Bryant", "time": 1573166600985, "rating": 5.0, "text": "Great faculty! Love this place!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114188529058766438610", "name": "mike callahan", "time": 1534362950116, "rating": 5.0, "text": "Dr Poynor is one of the most gracious and smartest doctors I’ve ever met!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114035578146780572911", "name": "Amy Lazaro", "time": 1573132853163, "rating": 5.0, "text": "Great doctors, great employees and awesome service!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "105256599990391889517", "name": "Tara McBurnett", "time": 1574211851036, "rating": 5.0, "text": "Excellent Group of Doctors and Specialist.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110446642974392066071", "name": "Tammy", "time": 1574211298952, "rating": 5.0, "text": "Recommend for all your ENT needs!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111251152495383948469", "name": "Cheryl Adams", "time": 1573146470608, "rating": 5.0, "text": "Great doctors, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103844459586803250633", "name": "Kimberly Carder Waugh", "time": 1574785706495, "rating": 5.0, "text": "Amazing offices at ENT Associates and wonderful doctors!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110635855906107103024", "name": "Christel Lee", "time": 1573854867262, "rating": 5.0, "text": "Great Doctors, Great staff, Great experience", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104858873591796280717", "name": "Brian W. Kittrell", "time": 1494499173397, "rating": 5.0, "text": "Love these guys!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118283470019045173250", "name": "Laura Whittington", "time": 1627747927260, "rating": 5.0, "text": "Wonderful staff, so polite, helpful and professional.\nReally like Dr Owens.  He's so down to earth.\nHe sits beside you and explains everything.\nTreats me like his grandmother!!!!!\nHe's young, but he's GOOD.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111745744048178348357", "name": "Neil Burnside", "time": 1612373153011, "rating": 1.0, "text": "Did not even get to the appointment. My wife would call to make one and the secretary is beyond rude. That’s the first point of contact. You would think she would be nicer. Very sarcastic remarks and had 0 customer service skills aside from throwing out the word ma’am on occasion. Don’t even bother calling these people. Or better yet fire the secretary on staff today and find someone who’s actually courteous", "pics": null, "resp": null, "gmap_id": "0x889a4304c62e28eb:0x126cd53fbb9aa343"}
{"user_id": "104266529268154570947", "name": "Milton Turney", "time": 1614006536731, "rating": 5.0, "text": "Very nice and thoughtful. Help me with a reaction from a spider bite.", "pics": null, "resp": null, "gmap_id": "0x889a4304c62e28eb:0x126cd53fbb9aa343"}
{"user_id": "117159474215789001416", "name": "Scott K", "time": 1605331439567, "rating": 5.0, "text": "The timing of these shots saved my life.  My allergies are so much better this year. Beginning and end of season this year no sinus infection. Would give ten stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "112678311335725092365", "name": "Kimmie Smith", "time": 1595949343068, "rating": 5.0, "text": "Very pleased with Dr. Freeman! His Allergy shots are unlike any other. I didn’t see results until after about 6 weeks, but I’m so glad I stayed with his injection regimen", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "111656496781284692516", "name": "alison young", "time": 1543879771949, "rating": 5.0, "text": "We love Dr. Freeman. He is very straight forward waist no time and gets to the point. He loves the children and takes great care of them. We love our allergy plan.", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "104478733539027875555", "name": "Dawn Fenner", "time": 1548857665340, "rating": 1.0, "text": "I do not recommend this Dr. dirty office among other things. Very important things. Beware! I wish I could leave zero stars.", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "116004828488741174883", "name": "Brennon Rohde", "time": 1536262217108, "rating": 1.0, "text": "Dr Freeman is not the physician to see. He doesn’t pay attention to your records or the reason you are at his office, all he cares about is putting you on his “miracle shots” and billing your insurance. He leaves syringes and testers laying around the office and his new staff is completely unprofessional. They take almost an hour to give one injection where it took the old staff a matter of minutes because they are always out smoking or on their personal cell phones. Save yourself time and money and see a real doctor.", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "103825872175411957604", "name": "Sarah Capps", "time": 1568143010331, "rating": 5.0, "text": "My allergies are almost gone. He does listen and the shots are working", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "116533048223139291396", "name": "sew thankful", "time": 1536214279500, "rating": 1.0, "text": "would not recommend this Doctor to anyone. He is late 70's and runs the office with his wife and no staff. It was a very odd setup.", "pics": null, "resp": null, "gmap_id": "0x88626cbc49d3eecf:0x8bf1af17edb94081"}
{"user_id": "103150251912376904694", "name": "A Person", "time": 1571086014306, "rating": 2.0, "text": "They need another day in Enterprise. Dothan is open for 4 days and Enterprise is only open on Tuesdays. It makes it much harder for me to get allergy shots when you have to do it on one certain day. Waits are long, the staff got worse and several other things. Although they try to get people in. It's just extremely angering when it's opened 1 time a week in a town with 30,000 residents.", "pics": null, "resp": null, "gmap_id": "0x88926e843e9b3055:0xbe898cb7f32732f2"}
{"user_id": "106880585317146264997", "name": "Nathan Willard", "time": 1573586517345, "rating": 1.0, "text": "Our appt for allergy testing on a three year old was at 9:45. It is now 1:20 in the afternoon and we are still waiting. An hour in the waiting area beyond our appt time, over an hour sitting waiting for the doctor and no sign of him coming back in to tell us results.", "pics": null, "resp": null, "gmap_id": "0x88926e843e9b3055:0xbe898cb7f32732f2"}
{"user_id": "115496349537786357822", "name": "Nicole Wymes", "time": 1621706739443, "rating": 5.0, "text": "When I go to the office everyone very nice to me. If I have questions about my asthma or allergies or sinus they will help me figure it out", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "114003372771505687990", "name": "Jennifer Lee", "time": 1599151445118, "rating": 1.0, "text": "My daughter was a new patient.  I use the word was because we had to sit in the car a hour passed her appointment time. The nurse kept telling me that they had no rooms open.  But even when they call to check to see if we was coming they had 2 times before her appointment  open. This is a very bad 1st impression for a new patient.  We just left. How would they like to sit in the car for over a hour ? If you can't make the time for the appointment then why make them? Not going back thats for sure.", "pics": null, "resp": {"time": 1599494476159, "text": "We are very sorry to hear that you had this experience. Currently due to COVID we are experiencing delays due to screening patients outdoors, room sanitization, and trying to keep patients in the waiting room to a minimum to reduce exposure as Alabama continues to see COVID cases.  Currently we are only seeing new and allergy testing patients in the office and doing telemedicine at the end of the day. We will take this into serious consideration and try to improve our workflow."}, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "102352339694857852370", "name": "Suki T", "time": 1580913342918, "rating": 5.0, "text": "Dr Kalenian is an amazing doctor, a doctor who actually cares for his patients. He has literally saved my life. He recognized that I could have a rare disease and made sure I got the testing necessary to be diagnosed one way or the other. He wouldn’t have recognized all of the signs of this disease if he didn’t take the time to listen to my explanations of what had been going on instead of just trying to rush me through. I thought I had just developed new terrible allergies, but he recognized it was more. He helped me get proper testing, get referrals and followed up on all of these things. I have since been diagnosed with a the very rare diseases suspected and am doing a lot better because of being on the right treatments for the disease. Without these treatments I would likely be deceased by now. I will forever be thankful to Dr Kalenian and his staff.", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "103266531838493645388", "name": "Robert Joslin", "time": 1572202174986, "rating": 5.0, "text": "We have known Dr. Kalenian for a very  long time. Dr. Kalenian has been always caring, is never rushed with his patients, is honest and listens to his patients. We first went to him in the late 90s, and were  referred to him by the late Dr. James Sullivan and he really helped both me and my wife with our severe allergies. We greatly appreciate him, wishing all the best after his car accident recently.", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "114941088607438957242", "name": "Gloria Argueta", "time": 1607955330361, "rating": 5.0, "text": "Dr kalenian 🙏😀excellent  staff great and friendly 🙏😀", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "112361224467306045929", "name": "Margaret Sims", "time": 1574604704902, "rating": 5.0, "text": "I was impressed with every aspect of this group including the Doctor , Nurses and Staff. Everyone was so helpful and kind.  The place was very clean also not very long waiting to see Dr. I would highly recommend this group to anyone.   Margaret Sims", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "113000116319984445530", "name": "Monica Dennis", "time": 1572567746890, "rating": 5.0, "text": "This dr and staff have always taken excellent care to make sure I have the best treatment for my asthma. They are on the cutting edge of new medicines. I have been a patient for many years and have been able to keep my asthma under control and out of the ER.", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "115133393032958901983", "name": "Jason", "time": 1574557556280, "rating": 5.0, "text": "Dr. Kalenian has been my Asthma and Allergy Doctor for the past 9 years. He, his head nurse Mariette and staff have provided me with the best care possible! It’s really hard to find Doctors that will take the time you need, but Dr. Kalenian has never made me feel rushed and always taken the time Ive needed to answer any questions. Dr. Kalenian and staff makes you feel more like family than a patient and I highly recommend Alabama Asthma and Allergy!", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "112188367891676505104", "name": "Ami Denault", "time": 1570056926028, "rating": 1.0, "text": "They goof around with random meds that actually actually made me extremely sick. Then they procrastinated refilling my meds for two months. After playing tag for that long I decided to change doctors.", "pics": null, "resp": {"time": 1571103759199, "text": "Thanks for your concerns as we value them and sorry for any inconvenience you may have experienced. We have been providing good service to you for many years, carefully investigated your issue and have a paper trail on file after calling your pharmacy that we received a fax refill request from the pharmacy after you picked up your prescription which the pharmacy told us to then ignore. If there are any issues with any worker we would kindly appreciate that you would promptly contact our management team first with suggestions for improvement so that we can better quickly rectify any situation to your satisfaction and better help others.  However, thank you for your comments as we greatly appreciate all of our patients comments and concerns and keep them all under serious consideration. Sincerely, AAAPC staff"}, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "101306012764683037073", "name": "Dia Crawford", "time": 1557529588971, "rating": 5.0, "text": "I love Dr Kalanien and his staff! The really listen to you and make you feel like they value you. They understand that you know your body best and talk to you, listen and work with you to provide the best treatment for you. They will always follow up on calls and even Dr Kalanien will call you at home and discuss your issues with you. They don't hurry you through and they work with you. I have improved greatly with my breathing under their care and look forward to my visits. They are genuine caring individuals. Now that I have such a caring doctor and his staff I look forward to enjoying a better quality of life. Please do yoirself a favor and visit them. You won't be sorry and your life will never be the same. It will be much better!!!", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "105475969701733900459", "name": "Dolly Ezell", "time": 1555429464113, "rating": 5.0, "text": "Dr. Kalenian is intelligent, listens to, and genuinely cares about his patients.  The office atmosphere and staff are knowledgeable, upbeat, positive, and caring.", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "103150251912376904694", "name": "A Person", "time": 1571086255135, "rating": 2.0, "text": "They need another day in Enterprise. Dothan is open for 4 days and Enterprise is only open on Tuesdays. It makes it much harder for me to get allergy shots when you have to do it on one certain day. Waits are long, the staff got worse and several other things. Although they try to get people in. It's just extremely angering when it's opened 1 time a week in a town with 30,000 residents.", "pics": null, "resp": {"time": 1571103096564, "text": "Thanks you for your suggestions.  We have looked at this before, and currently our doctor is the only board certified allergist who comes to Enterprise with a population of 30,000. Dothan's population is 120,000 outside the circle and a city typically has to have a population  of 50,000 to fully support a specialist. Our caring physician comes to Enterprise mainly out of loyalty to military personnel and their dependents since he himself is a former military doctor and decorated war veteran of Desert Storm. Other specialties like cardiology typically come to Enterprise on a limited basis as well. We invite you to come to our Dothan office where there is more flexibility with scheduling shots and visits and we are open there on  Mondays, Wednesdays, Thursdays and Fridays. We however will keep your suggestions under serious consideration and do appreciate your comments and concerns. Sincerely, AAAPC Staff"}, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "110841224820284952320", "name": "Patty Hamilton", "time": 1574703232430, "rating": 5.0, "text": "The staff is always friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "116933025295070148265", "name": "Sandra Church", "time": 1554755242427, "rating": 5.0, "text": "Great Doctor that actually listens to you.", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "116128996694199478168", "name": "Dan Williams", "time": 1500044390983, "rating": 5.0, "text": "Dr. Kalenian is a doctor who actually will take the time and listen to you as well as guide you to proper treatment. I have both allergies and asthma and they keep me on a course of control over my ailments. If you have allergies or asthma, you could not pick a better doctor than Dr. Mark to treat you! And I have been to a lot of doctors", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "115180549945959367197", "name": "Amanda Ward", "time": 1546613040150, "rating": 5.0, "text": "Very informative", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "101295743779708428853", "name": "Jeffrey Hatcher", "time": 1478208379237, "rating": 4.0, "text": "Good and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88928dbdac15b9df:0xf740e54528e87b22"}
{"user_id": "106032661582959315398", "name": "Tre Garrett", "time": 1616543391938, "rating": 5.0, "text": "I had battled with chronic sinusitis my entire life, up until my mom referred me to the best and only doctor to ever correct my sinus issues. I had 2 procedures and neither are in anyway invasive at all. The healing process was a breeze and I can finally breathe! I highly recommend anyone who suffers with any sinus/allergy to consult with Dr. Roberson. I have never felt better in my entire life.", "pics": null, "resp": {"time": 1616552752103, "text": "We are so glad you are feeling well! Thank you for your kind words."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "101899971296895664008", "name": "Joe Moore", "time": 1612905349533, "rating": 5.0, "text": "Dr. Robertson was very informative, and made sure I understood in full detail everything he was recommending for me. Staff was very friendly and knowledgeable. I can tell I'm in good hands.", "pics": null, "resp": {"time": 1613336062970, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102615502888452211586", "name": "Carol Mims", "time": 1614352655599, "rating": 5.0, "text": "I have nothing but good things to say about Dr. Robertson and his staff. I recently had surgery for a deviated septum and balloon sinuplasty. Both procedures went well and I am breathing and sleeping better.\nDr. Robertson is very prompt and caring as is his staff.", "pics": null, "resp": {"time": 1614355646945, "text": "Thank you so much Carol! We are so glad you are feeling good."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102223490664247163377", "name": "Stephen LaRocca", "time": 1610735263557, "rating": 5.0, "text": "Dr. Robertson, Beth, and staff are extremely courteous and professional. They took time to discuss concerns and review diagnostic data with me. Highly recommend this group!", "pics": null, "resp": {"time": 1611761379175, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "117222530601191863215", "name": "Lanier Millsap", "time": 1610031533137, "rating": 5.0, "text": "Staff is great and professional.   Dr. Robertson handle all my questions thoroughly. Did my wife and I sinus surgery.  Highly recommend.", "pics": null, "resp": {"time": 1610059339468, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109236689603499798891", "name": "Tiffany Guin", "time": 1600480545490, "rating": 5.0, "text": "Dr. Robertson is hands down the best doctor. I would highly recommend him. I have never felt this much relief from my sinuses and ears. Thanks to Dr. Robertson I now have no sinus pressure in my ears and I have so much relief and can breathe so much better. Thank you!", "pics": null, "resp": {"time": 1600484938328, "text": "So glad you are feeling better! Thank you for the kind words."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109379532754025617610", "name": "Cindy Tennimon", "time": 1622155991248, "rating": 5.0, "text": "Great staff, promptly see you once you arrive . Expensive? Yes, even with insurance.", "pics": null, "resp": {"time": 1622819317644, "text": "Thank you for your review!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105418759381483567954", "name": "Marsha Hutchison", "time": 1602019571843, "rating": 5.0, "text": "Dr Robertson and staff are amazing!  I was sick for a very long time .  My MD sent me to Dr Robertson.  I thank God for them.  Surgery went well. I almost forgot what it was like to be well!  Thank you so much for all your help and being so kind", "pics": null, "resp": {"time": 1602028891828, "text": "We are so glad you are feeling so good!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "103383705289330257758", "name": "Amber M", "time": 1579714307600, "rating": 5.0, "text": "Wonderful experience! I found Dr. Robertson online and went in because I was having problems with breathing and sinus pain. They started me on allergy shots which have reduced the frequency of sinus pain. Then I had a few surgeries to correct a deviated septum and remove my tonsils. Every surgery went very well, and Dr. Robertson was very hospitable to me (a 22 year old female) and my father. I now breathe a lot better!", "pics": null, "resp": {"time": 1579709879292, "text": "Thank you for your great rating!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "101887860347868781658", "name": "Jacob Hinkle", "time": 1582219669004, "rating": 5.0, "text": "Dr. Robertson and his staff are among the friendliest I've ever encountered. Scott talked to me about the procedure in simple terms that make sense to people who aren't doctors. When I visited, I did t feel like a patient, I felt like I was visiting a friend.", "pics": null, "resp": {"time": 1582237399992, "text": "Thank you for sharing your experience and your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "114239592464627008957", "name": "Google Account", "time": 1562955601153, "rating": 5.0, "text": "One of the Best doctors I have ever met!!  I can Breathe now.  A million Thanks to Doctor Robertson and his exceptional staff.  The surgery was so much better than I expected!  New to Birmingham and glad that I found you!", "pics": null, "resp": {"time": 1564531932274, "text": "Thank you! We are glad you are feeling better!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102069743780540201422", "name": "Alex Nix", "time": 1557887274236, "rating": 5.0, "text": "The staff and Dr. Robertson are so friendly and truly care about your health. I can honestly say from my personal experience that Dr. Robertson changed my life. Before seeing him, I suffered daily from chronic sinus issues that significantly impacted my day to day life, and I am forever grateful for what he did to turn my life around. My quality of life is so much better, I sleep like I have never slept in my life, and I can finally breathe like a normal person. If you suffer from chronic sinus issues like I did, they can give you the relief you are seeking. I highly recommend Dr. Robertson and his staff, they are truly excellent at what they do!", "pics": null, "resp": {"time": 1564531969055, "text": "Thank you for your kind words! We are so glad you are feeling good!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "111702898491031143946", "name": "Maria Faulkner", "time": 1550352809054, "rating": 4.0, "text": "The doctor is five stars all the way and he’s made a tremendous difference in my son’s ability to breathe! He’s had two surgeries with Dr Robertson and it’s been a great experience. I can’t give the place five stars because for some reason even a simple post op appointment (and every other appointment I’ve been to with my son) takes between an hour and a half to two hours. I don’t understand the wait time; we usually book for first appointment in the morning or first one after lunch and still wait an hour. If they can fix that it would be great!!!", "pics": null, "resp": {"time": 1550516977646, "text": "Thank you for your feedback! We aplologize for the wait time. We are working on improving our scheduling procedures to minimize wait time."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "113714896824254140809", "name": "Randy Miller (Ran)", "time": 1569454370204, "rating": 5.0, "text": "Great experience! Office staff is very friendly. Dr. Robertson was very thorough, his professionalism and bedside manner is second to none, he accurately diagnosed my problem and treated it appropriately. I am now back to 100%! Thank you Dr. Robertson and staff.", "pics": null, "resp": {"time": 1569457534484, "text": "Thank you! We are glad you are feeling good!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "103702178652063687981", "name": "Thom Johnson", "time": 1553303474922, "rating": 5.0, "text": "Dr. Robertson and his staff are very friendly and very knowledgeable. All of the procedures were done in house and with minimal discomfort. Dr. Robertson is in high demand so you must be flexible in case there is a wait! Don't worry, he'll spend as much time with you as necessary. Hope he helps you as much as he did me. I can breathe so much better now.", "pics": null, "resp": {"time": 1553304399231, "text": "Thank you for your kind words. We are glad you are breathing better!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "117749771707152147605", "name": "Philip Dye", "time": 1540942269073, "rating": 5.0, "text": "My wife Rachael Dye has been going to him since October. We have loved  our experience so far. We have been treated very nice and we love how sweet, kind and caring he is and his whole staff. Today Rachael had a  procedure done and the OutPatient Center was great. Dr and the staff treated her very kind and was there checking on her the whole time when she got sick and did what they needed. Her procedure went good and she has one more in November. We will recommend him to anyone.", "pics": null, "resp": {"time": 1541098485193, "text": "Thank you for your kind words. We hope Rachael is doing well!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "111442735245342443391", "name": "Andrea Clay", "time": 1540314635973, "rating": 5.0, "text": "Dr. Robertson was referred to me by my primary care doctor as well as a friend.  I have had sinus problems my entire life.  I underwent sinus surgery with Dr. Robertson at the end of August and am thrilled with the outcome.  He is thorough in explaining every part of any test, procedure, etc and takes all necessary time with you as a patient.  His office staff is professional and kind.  I highly recommend Dr. Robertson for any of your ENT needs.", "pics": null, "resp": {"time": 1540316289369, "text": "Thank you for sharing your positive experience and kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "107178191116919903672", "name": "Matt Bartlett", "time": 1553742278339, "rating": 5.0, "text": "Great doctor! Very professional and informative. He made sure to address any concern i had with the sinus and septum surgery. He informed me that all the horror stories that i may hear about the surgeries are not true. highly recommend.", "pics": null, "resp": {"time": 1553743506815, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "106803836679169731864", "name": "Steven Eversole", "time": 1537926947070, "rating": 5.0, "text": "Excellent doctor that takes time with patients and explains everything completely. He doesn't rush or over book appointments they keep you waiting forever in the office. Great surgeon for sinus problems too. Highly recommended and the best ENT around.", "pics": null, "resp": {"time": 1537927656532, "text": "Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "101040114473136464637", "name": "Teresa Elliott", "time": 1551881056133, "rating": 5.0, "text": "I had sinus surgery on January 8,2019.  Dr. Robertson was great!  I highly recommend him!  The surgery and recovery process went well!", "pics": null, "resp": {"time": 1551903038683, "text": "Thank you for the kind words and we are glad you are doing well!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105610709381908754254", "name": "Tara Parker", "time": 1557076634684, "rating": 5.0, "text": "Love him! Very professional staff, comfortable office, and detailed care. I am so glad i took someone else's advice, and gave Dr. Robertson a call. I finally feel like im getting ahead of my severe sinus and allergy problem.", "pics": null, "resp": {"time": 1557102801683, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "110727638891352911924", "name": "Shella Smith", "time": 1571688381825, "rating": 5.0, "text": "My cousin drives all the way from Atlanta to get her hearing aids adjusted! She loves Jennifer", "pics": null, "resp": {"time": 1577024163317, "text": "That’s great! Thank you for the review."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102779834863842429895", "name": "Zachariah Kesterson", "time": 1557166722657, "rating": 5.0, "text": "I have suffered from sinus issues and infections for over 25 years. I have seen other specialists. Dr. Robertson is by far the best ENT I have ever been treated by. Dr. Robertson and his people are so kind and thorough. After a hearing test, an allergy test and catscan he discovered my sinuses were blocked with little to no openings in the passages. The surgery was scheduled quickly and the care was fantastic. The recovery was not bad at all. I have never felt better in my life. I can finally breathe through my nose with no obstruction, and I am not getting a sinus infection every month anymore. My family can even tell a difference in my mood. The surgery has been life changing. If you need ENT care, Dr. Robertson and his people are incredible.  Highly recommend.", "pics": null, "resp": {"time": 1564532030065, "text": "We are so glad you are feeling good! Thank you for coming to see us!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "106799017269761397771", "name": "Charles Daryl Wideman", "time": 1550417308622, "rating": 2.0, "text": "That want to charge you for appointment if you have to cancel, but they can't get you back to see the doctor at your appointment time. Always 20-30 behind. Also it seems they just want to upsell services.", "pics": null, "resp": {"time": 1550516882287, "text": "We are so sorry about this. We actually do not charge for canceling an appointment, just for a “no show”. We are working on improving our scheduling, so that the wait time is minimal."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "107639813832056147369", "name": "Brenda Slatton", "time": 1553091311815, "rating": 5.0, "text": "You need an ENT he is the best and the staff is very professional help me so much", "pics": null, "resp": {"time": 1553634389343, "text": "Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "107278629902588882124", "name": "Amy Wagar", "time": 1445256433637, "rating": 5.0, "text": "Staff is very friendly. Dr Robertson takes time to explain everything to me. I had surgery to open sinuses and it is amazing the difference. I feel very confident in the care I've received there.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "108369331871065654897", "name": "David Massengale", "time": 1513744448310, "rating": 5.0, "text": "Dr Robertson did 2 surgeries on me, one to repair my deviated septum, the second on my sinuses. He did a great job! He is a very good ENT surgeon!!", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "114331284340261420293", "name": "Independent thinker", "time": 1416272456190, "rating": 1.0, "text": "Went in, thought I had bad allergy, was told by Dr Robertson I was allergic to  everything but mold and mildew. I had a bad feeling about it then. He suggested surgery to get air moving, idiot like I agreed. I could tell no difference after healing, didn't approach my original problem. I feel he wanted to pad his pocket at my expense.\nI went to another Doctor, he didn't do the age old skin prick test, he drew blood and sent it off to be tested. Came back I was allergic to dogs only and just enough to register on the test it was so slight. Said I will probably have to have surgery to get it straight. Dr Robertson didn't do the job right.  He only did part of the job needed, why would he not do the whole job and not put someone through all that again?\nGO AT YOUR OWN RISK!", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105554081770444743576", "name": "Breunca Meadows", "time": 1501639875810, "rating": 1.0, "text": "My experience started off good and went horribly wrong from there. Working in the health field I've learned that a patients health history pays a vital key in treatment. I show up to my 5:45 appointment for my surgery apparently no one from the nurses to the doctor reviewed my medical history which stated that I was anemic . After being prepped for my surgery I was then told that I wouldn't be having the surgery due to me being anemic. Which was stated that same day more than once to two different people. On top of wasting my time, including the week that I had already taken time off from work which was now a waste, I was told that I could  call back in two - three months once I was \"cleared\" to have the surgery! I wouldn't recommended to anyone who has any type of predisposed health issue.", "pics": null, "resp": {"time": 1501694373049, "text": "We are so sorry for the inconvenience.  We always put our patient's safety first.  Unfortunately, safety concerns can arise at any time.  Please give us a call if you have any additional questions.  Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105590779498271044927", "name": "Kevin Foote", "time": 1427753610606, "rating": 5.0, "text": "Dr. Robertson changed my life! I visited him after hearing a radio commercial about balloon sinuplasty, and I was skeptical at first but after years and years of chronic sinus problems, I was desperate to try anything. Dr. Robertson was very warm & personable, and I could tell he really cares. Most doctors I've met are sort of callous, and it's hard to find one that'll talk to you like a real person. Kudos to Dr. Robertson for making me feel comfortable about this, because it's a lot to consider & a lot of money. I elected to go with the procedure, and I'm so glad that I did. I can breathe so much better now, I'm sleeping better, and I'm no longer constantly bothered by my sinuses throughout the day. I'm not breathing perfectly, of course, but I can definitely feel a significant improvement. I think as long as you're nor expecting rainbows & unicorns but can keep your expectations reasonable, you'll be satisfied. If I could go back in time, I would have the procedure again. Thank you Dr. Robertson!", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "104957207123587525259", "name": "JP", "time": 1491935065849, "rating": 5.0, "text": "Dr. Robertson is a great doctor.  The best ENT in Birmingham. Dr. Robertson performed sinus surgery on me back in 1998. I was having severe miagrane headaches that would last for days.  After surgery I felt 100% better. I was amazed at the result. Also Dr. Robertson does NOT pack your sinuses after surgery. Today I'm still doing great and haven't had any other problems with my sinuses.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105052743519866573717", "name": "becky patterson", "time": 1577017015827, "rating": 5.0, "text": "First time I got relief with my sinuses!", "pics": null, "resp": {"time": 1577024097552, "text": "We are glad you are feeling well!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "115917112411888473774", "name": "Deana Mumpower", "time": 1446041450448, "rating": 5.0, "text": "I have had chronic sinus infections  for years.  My ears felt stopped up which was affecting my hearing.  Dr Robertson found the problem.  He suggested balloon  sinuplasty.  This has enabled my sinuses to drain properly and has alleviated  constant sinusitis. This procedure also opened my  ears.\nThe balloon sinuplasty  helped me so much, I took my mother (90) to see Dr Robertson.  She has had constant sinus problems for years.  Dr Robertson suggested the same procedure.  She is having great results, also.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "104269136012608898670", "name": "Sweet Home Alamanda", "time": 1452866255387, "rating": 5.0, "text": "Dr. Robertson is absolutely amazing. I originally went in to see him about sinus issues that were making me miserable. He suggested that I undergo allergy testing. I did and my results revealed that I was allergic to 90% of what I was tested for, and I was severely allergic to most of those. I have started Rush Immunology and I look forward to feeling better in the future! Due to my anatomy (as found on CT Scan) Dr. Robertson recommended surgical intervention, and he performed a Septoplasty on me as well as addressed several other sinus-related issues during the procedure. Yes, post-op pn is never fun, but I am hoping to reap the benefits of the surgery in the near future.\nI cannot thank Dr. Robertson enough as he has been so knowledgeable and helpful in explaining exactly what he feels is going on with my allergy and sinus issues. When I first met him, he came in and sat down and took plenty of time speaking with me...even after being in a long day of surgery. He is never rushed in my appts, and spends a good amount of time explaining things. His staff has also been so friendly, helpful and knowledgeable as well. I appreciate Dr. Robertson and his awesome staff more than they will ever know! Thank you ALL so very much!!!\n(*FYI regarding another review below, the blood test used for allergy testing is NOT AT ALL considered to be the most effective at finding accurate results; research this)", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "112333434551215376865", "name": "Em M", "time": 1535254008587, "rating": 5.0, "text": "Dr Robertson and his staff are very friendly and helpful!", "pics": null, "resp": {"time": 1535390572209, "text": "Thank you!  We really appreciate your review and kind feedback."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "116439990772194710213", "name": "Brandon Cruise", "time": 1564526723704, "rating": 5.0, "text": "great care and very friendly", "pics": null, "resp": {"time": 1564531895292, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109610590841895487081", "name": "C Guthrie", "time": 1428348117499, "rating": 5.0, "text": "Dr Robertson is the best ENT we have ever been to. He cares for our whole family and extended family with allergies, tonsils, asthma, etc. Great practice and highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "103940423309617784407", "name": "selina allcorn", "time": 1498577746524, "rating": 5.0, "text": "Very nice staff, and Dr. Robertson is very thorough.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109891319777833429940", "name": "Victor B Pettus", "time": 1571418756735, "rating": 5.0, "text": "Great Service", "pics": null, "resp": {"time": 1577024173589, "text": "Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "115518893991040546026", "name": "Diana Shoel", "time": 1526076279646, "rating": 5.0, "text": "Great doctor and friendly staff", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "111484906490605884541", "name": "sool sool", "time": 1499487562485, "rating": 5.0, "text": "(Translated by Google) Dr. Robertson is a sinus specialist, my big problem for many years, after a detailed study he explained what the causes were and what solutions he had for me.\n\n(Original)\nEl Dr. Robertson es especialista en sinusitis, mi gran problema por muchos años, después de un estudio detallado me explico cuales eran las causas y que soluciones tenía para mi.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
