{"user_id": "112175510420915674941", "name": "Tom Solley", "time": 1538947520859, "rating": 5.0, "text": "Our Chrysler Marine starter quit working. Started to spend $300 for a rebuilt one off eBay, but thought I'd give them a try. Two days later and $58, she's as good as new. Couldn't be happier, will use them again for sure.", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "115573881529570838898", "name": "Wes Bryant", "time": 1376186178434, "rating": 5.0, "text": "Stopped by Brown-Keahey on the recommendation of a friend.  Had a question about my starter.  They were closed (Saturday) but Donnie happened to be there.  He took time on his day off to answer questions about my starter and showed me some side projects he was working on.  Much appreciated!", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "103023812073291090437", "name": "Roger Prine", "time": 1519494149221, "rating": 5.0, "text": "The place to go for rebuilding your alternators are starters for that you can't find in the store", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "114600010431387947517", "name": "Rod Cromer", "time": 1496128418017, "rating": 4.0, "text": "Starter and alternator experts", "pics": null, "resp": null, "gmap_id": "0x889a527724fd8ac9:0xe51b32fed4f2a126"}
{"user_id": "107696584351107496497", "name": "Joel Banyai", "time": 1605136280282, "rating": 5.0, "text": "In the past few months I've had work done and sent multiple friends to this shop. They've fixed cars other shops won't touch (or messed up), and saved my friends and I a ton of money. We all know warranty work doesn't pay the bills, but when an alternator they had rebuilt and installed failed, they had a new alternator swapped in the next morning. On another repair they offered a good used part they had on hand for much cheaper instead of charging for a brand new part. Another car had a strange symptom; they correctly diagnosed two cascading failures up the line and fixed everything. If a repair isn't going to be cost effective, they'll tell you that too.  I'm extremely pleased. You won't go wrong going here.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "113170035828590986453", "name": "Lisa P", "time": 1599138306860, "rating": 5.0, "text": "Quick service. Great price.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111208463373245123319", "name": "Jane Knauss", "time": 1584125043337, "rating": 5.0, "text": "Very nice and knowledgeable. Quick turnaround and reasonable prices. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "112107226880004550926", "name": "Alexandria Haley", "time": 1598507209583, "rating": 5.0, "text": "This man does an amazing job with rewiring...", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "106129296149127023476", "name": "Ikram Singh", "time": 1567640014725, "rating": 4.0, "text": "I think they did a pretty decent/good job on my windshield wipers and front window rotor. Had the car ready the very next day. The guy is a PROFESSIONAL but I think I was OVERLY CHARGED !!\nIf it was not for the HIGH CHARGE I would definitely visit this place again.", "pics": null, "resp": {"time": 1576084685450, "text": "We appreciate your business and we believe our prices are very competitive."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "101397981434405686581", "name": "Josh Knowling", "time": 1547922430396, "rating": 5.0, "text": "I recently took my truck to Russell Brothers with a tricky electrical issue that had persisted despite previous mechanic's best efforts.  I was skeptical at first that a solution would be reached.  Initially, Russell Brothers did fail in their first attempt at correcting it, despite having replaced expensive components.  However, after a couple of return trips, their persistence paid off and they expertly diagnosed and ultimately corrected the issue for good.  I would like to thank technician 'Jim' in particular in showing great integrity, reaching out to me when he knew the issue was not correctly repaired.  Will used their service again in the future, as well as recommend it to others. Thanks fellas!", "pics": null, "resp": {"time": 1549736421341, "text": "Thank you Josh! We truly appreciate you taking the time for the awesome review!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "108700960294994844581", "name": "jdblackbelt", "time": 1539147778687, "rating": 5.0, "text": "I have been bringing my vehicles here for service and maintenance for 10 years now. They regularly charge me half what the dealership has quoted me for the same job. They're always busy (as people have caught on they do phenomenal work for fair prices), so sometimes you'll have to wait an extra day for your vehicle, but you'll always save money. Jim and Robbie have always taken care of me, know me by name, and only recommend repairs and maintenance on what's necessary. There's a reason they've been in business since the 70's. Can't recommend them highly enough.", "pics": null, "resp": {"time": 1539200714965, "text": "That is so very special that you that the time to write such a wonderful review. We appreciate you taking your time to give us such a kind and thoughtful review. Sincerely, thanks so very much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "118114176008128280076", "name": "Elizabeth Henson", "time": 1581304948758, "rating": 5.0, "text": "Easy to schedule with, did the work for what they said it would be, and what they said it would be was MUCH less than the dealership quoted.  This is the second time we've had work done there and they've got our business if we need something else done.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115217720221887283257", "name": "alicia perez", "time": 1441056201930, "rating": 5.0, "text": "Best place to get my truck fixed. I took my truck in at approximately 12:30 and they were done by 3:00. Excellent prices, friendly guys, really smart. They know what they are doing and are honest to their prices. They are awesome all around. We will continue to keep taking our vehicles there.", "pics": null, "resp": {"time": 1564072084173, "text": "Thanks so much!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "108594614352902405485", "name": "Jake Self", "time": 1520871235768, "rating": 4.0, "text": "Had to return a few times but they was kinda working me in I still recommend them. Let me clarify this statement instead of changing it. When I say return a few times I mean too fix several problems. Only once was something unfinished properly on my alternator/battery, and had to have it towed back. No extra charge but I did feel that they should've covered the TOW TAG.😂😂😭👌🤘👍✌️", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "107302473788236122918", "name": "Robert Robb", "time": 1503060231454, "rating": 2.0, "text": "Charged me $400 to fix a bad wire going to the AC clutch (no parts).  At $85/hour that means it took them almost 5 hrs to fix.  I had looked at the problem before I brought the car in and had narrowed it down to the AC clutch so I asked when i pick it up if it was on the ground or power side.  He wouldn't tell me .  When I looked under the car I could see where they used a wire jumper like whats used for connecting trailer lights to connect to another ground wire that must have been good.  I had expected 2 to 3 hundred but with the mechanic refusing to answer a simple question left me questioning.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110557839919993682275", "name": "Jovan Coates", "time": 1484863855621, "rating": 5.0, "text": "Russell Brothers Auto is the best repair shop in this city hands down.  I have been having my vehicles serviced there for over ten years.  They have kept things running that others have said could not be fixed, or a dealership suggests that it's time to purchase another vehicle.   They work on any make and model of vehicle and can perform any type of maintenance from fluid changes, up to engine replacement.  The staff is friendly and the service top notch.  They have always had my vehicles ready the same day I drop them off.  The value cannot be beat.  They do not suggest needless services just to pad an invoice, if your car is not running or something electrical doesn't work, they will immediately get to the heart of the problem and take care of it.  They stand by their work and I will wholeheartedly recommend to anyone if you need your car repaired take it to Russell Brothers, you won't be disappointed.", "pics": null, "resp": {"time": 1564072003146, "text": "Thanks so kindly!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115043664282084828699", "name": "LiqwdE Teryx 4LE (LiqwdE)", "time": 1520521783294, "rating": 5.0, "text": "So far so good. Very understanding. They helped budget my repairs into 3 visit depending on severity of problems. As long as people remember most problems can't be solved same day. Good mechanics, not miracle workers!", "pics": null, "resp": {"time": 1549736567362, "text": "Appreciate you very much. Thank you for being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114756388195955394865", "name": "Briana Wright", "time": 1424363466795, "rating": 1.0, "text": "If I could rate it at half a star I would. Avoid this place like the Ebola.\nThough Ebola Might be easier to deal with than these clowns.\n* NO Communication.\n* NO Realistic estimate.\n* NO Time frame for repairs to be completed.\n* NO Call to authorize ordering of expensive parts.\n* NO Friendly service, in fact, acted as if simple questions were a bother to answer, and indeed were NOT answered.\n\nIn the End I had my Car towed away to take to elsewhere.. where the car was fixed, and on the road the next day, for the same price as I was charged by these yahoos for ripping apart my dashboard.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111748791581459687827", "name": "Thomas Taylor", "time": 1454361361897, "rating": 5.0, "text": "These guys will fix those cars that no one else will even touch. They repair a Porsche Cayenne (a real PIB to fix) to a 20 year old beater that most would charge more than the car is worth.\n\nThe guy that was crabbing about his experience...., If you say \"Fix it!\" they will fix it. If you say tell me what is wrong and how much, then they will do that as well. BTW, it cost $$ to diagnose and this is sometimes the most expensive part of a repair. Communication is key and it goes both ways.\n\nThese guys are about the only honest ones left. They are so good that many dealers around town bring their used cars to them because their own mechanics can neither fix nor diagnose what is wrong with them. Or maybe they just don't want to get their hands dirty!\nJim and his guys will get greasy and keep you on the road!", "pics": null, "resp": {"time": 1564072062383, "text": "Kind words and much appreciated!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110595242941967694919", "name": "Russell Patten", "time": 1513098413023, "rating": 5.0, "text": "Great repair facility. Will go back there again in future if needed. Very helpful and knowledgeable", "pics": null, "resp": {"time": 1549736630960, "text": "Thanks so much for the kind words and for being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115482508235936950714", "name": "James Bowker", "time": 1506221055951, "rating": 5.0, "text": "Best place to take your car or truck. Real nice people who don't B.S you. 💘", "pics": null, "resp": {"time": 1564071875935, "text": "Thanks so much for the great review. It is very appreciated!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110101656312094046077", "name": "david huey", "time": 1520872087551, "rating": 1.0, "text": "People misdiagnosed my car after I TOLD them what was wrong. Then offered the correct repair for slightly above market value. Gee, thanks but no thanks. Take your car here if you enjoy wasting money", "pics": null, "resp": {"time": 1524064931147, "text": "We are unsure how to respond since there are no details. Please either post the information or call us and we can address your concerns."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "100660179116163681659", "name": "chris denton", "time": 1481573049146, "rating": 5.0, "text": "Excellent work! They are top notch mechanics and do excellent elecrical work also. They are straight up and will not take advantage of you.", "pics": null, "resp": {"time": 1564072041416, "text": "Thanks so much!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "116626745452803937441", "name": "z ten", "time": 1535725802849, "rating": 1.0, "text": "I asked for a quote for two sides. I was given a price. I asked if that was the price for both sides. He said yes. Later, after already doing one side, he tells me that it was the price for one side and questioned if I wanted the other side done. I said I would pay for both sides if they took care of the alignment. He said they would. I got the vehicle, immediately noticed the horrible alignment, had it inspected, and was told that the alignment was, as I suspected, terrible.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111138479150269657430", "name": "Andrew Self", "time": 1498864044298, "rating": 5.0, "text": "Always quick and direct with addressing the issues you have with your vehicle. Had a much wider skill set than other shops in the area.", "pics": null, "resp": {"time": 1564071960889, "text": "Thanks so much!!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114452824243984101202", "name": "brent dutton", "time": 1538311229510, "rating": 4.0, "text": "Knowledgable staff. Fast & courteous", "pics": null, "resp": {"time": 1538414732668, "text": "Thanks so very much for being our customer and taking the time to give us a very nice review!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "112312572809002445572", "name": "kristi gibbons", "time": 1466266245509, "rating": 2.0, "text": "We've had one good experience with these folks and two bad ones. They have some skilled electrical technicians capable of figuring out difficult electrical issues. Unfortunately, the company WILL take advantage of you financiallly given the opportunity. They failed to honor a warranty on a part they replaced. Another time they overcharged for correcting an easily diagnosable connection problem in the ignition system. No parts were replaced, probably less than an hour of labor was involved, and the bill was a few hundred dollars. When I politely questioned them on the bill, the guy became agitated, tried to change the subject, explained how I was lucky they didn't charge much more to get my car back.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "102128516049759978201", "name": "T. Barnes", "time": 1529590078319, "rating": 4.0, "text": "I've been using Russell Brothers for 25 years.  Always fair and very good at Auto Electric repairs.", "pics": null, "resp": {"time": 1529592780627, "text": "Thanks so very much! We appreciate your patronage truly."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "101925628941556109489", "name": "Trevor Tate", "time": 1518375193320, "rating": 5.0, "text": "I only take my car to these guys, there the best in the business and if you have some type of wiring or computer issues with your vehicle take it to these guys", "pics": null, "resp": {"time": 1549736589384, "text": "Thank you! Thank you!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110563615991398509123", "name": "Malcolm Smith", "time": 1528376251157, "rating": 5.0, "text": "Does a great job and does it right the first time.", "pics": null, "resp": {"time": 1528386697397, "text": "Thanks so very much for your kind words! Please let us know anything that pleases you or displeases you and we will always try to be better."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "104881043768727871445", "name": "billy Allen", "time": 1564068323499, "rating": 5.0, "text": "They fixed the problems and I got it back the next day. Replaced wiper motor, rebuilt alternator and air filter", "pics": null, "resp": {"time": 1564071676983, "text": "Thank you so much for the wonderful review! We appreciate it so much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "102519782902967951653", "name": "Vincent vashel", "time": 1457216707182, "rating": 1.0, "text": "made the mistake of telling them I was from out of town, my original quote was $700. I thought a little high, but when I went to pick my car up it was $3200. & they totally screw up my 4 wheel drive said they didn't know anything about 4 wheel drive. can you say rip-off", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114738578676967424231", "name": "Ed Hood", "time": 1430185852498, "rating": 5.0, "text": "Best Shop in Town. They'll fix it! Been using them over 15 years!", "pics": null, "resp": {"time": 1564072109238, "text": "Thanks Ed!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111105865597545009900", "name": "winterelm", "time": 1509455966571, "rating": 5.0, "text": "Awesome service if you need an alternator rebuilt.", "pics": null, "resp": {"time": 1564071842826, "text": "Thanks so much."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "109144512860558158632", "name": "Joan Marie", "time": 1521382012044, "rating": 5.0, "text": "Hidden jewel in Huntsville Alabama. BAM!", "pics": null, "resp": {"time": 1523481927011, "text": "Thank you so much!!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "118051971773537963491", "name": "Patrick Pezzano", "time": 1512619337672, "rating": 5.0, "text": "Great people to deal with if you have any auto. Electrical problems this is the place to go.", "pics": null, "resp": {"time": 1549736672837, "text": "Thanks for taking your time for this wonderful review and for being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "100593327704166788645", "name": "Debra VanHeiden", "time": 1490968647718, "rating": 5.0, "text": "Always a fair price and good service", "pics": null, "resp": {"time": 1564071987460, "text": "It is so kind, thank you so very much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "115518603906144189725", "name": "Stephen Eyma", "time": 1427400538267, "rating": 5.0, "text": "Those guys did a great job at a reasonable price. Hats off Russell Bros!", "pics": null, "resp": {"time": 1564072155825, "text": "Hats off to the great review! Thank you."}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "114483245697141139521", "name": "Paula Harris", "time": 1551945541378, "rating": 5.0, "text": "Good", "pics": null, "resp": {"time": 1552070970195, "text": "Thanks so much Ms. Harris!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "108963799297163091985", "name": "Frank Armstead", "time": 1477537598271, "rating": 2.0, "text": "The worst people in the world to work on your car please stay away if you do not want trouble", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "111565289148010094830", "name": "donald peoples", "time": 1549654744756, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": {"time": 1549736365186, "text": "Thanks so much for the kind words and being our customer!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "104876356686931793178", "name": "John Fletcher", "time": 1504723993079, "rating": 5.0, "text": "The get it done place\nIf nobody else can I bet they can!", "pics": null, "resp": {"time": 1564071913454, "text": "Thanks so much!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "110184357982732487152", "name": "CJ AUTOMOTIVE HANDWASHANDDETAIL,LLC", "time": 1510092076949, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "113174550674152384594", "name": "Furlough Wrecker Service", "time": 1505339411083, "rating": 5.0, "text": "Awesome Service and Fast", "pics": null, "resp": {"time": 1564071895548, "text": "Thanks so much!!"}, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
{"user_id": "104649472993009271938", "name": "Corey Bartlett", "time": 1456344853787, "rating": 1.0, "text": "Call ahead of time for estimate on installing a manifold intake and throttle body was give a 300$ estimate and a date(2-23-16) to drop it off dropped it off 5 hrs(9am-2pm) for them 2 call me back and tell me it would cost 500$ not the 300$ estimate i was given over the phone.", "pics": null, "resp": null, "gmap_id": "0x88626ca53558acd7:0x79f09f22a2152dc3"}
