{"user_id": "110466141906933223821", "name": "Lee Nocella", "time": 1614109926131, "rating": 1.0, "text": "one star is too many.  the drivers left us stranded.  we paid them extra to wait.  they put my patient in danger.  they left us waiting in the sun to increase their billing.  i wouldn't let them take a goldfish to the vet.", "pics": null, "resp": null, "gmap_id": "0x888911a9429bb91d:0xb634c5054bb98aee"}
{"user_id": "111977383104590427806", "name": "Cat", "time": 1596545759541, "rating": 4.0, "text": "They where great and very sweet. I had been in a bad wreck and they tryed to keep me claim, and let me take my own clothes off instead of them cutting.", "pics": null, "resp": null, "gmap_id": "0x888911a9429bb91d:0xb634c5054bb98aee"}
{"user_id": "101237573964542925154", "name": "Cheryl Freeman", "time": 1605130122395, "rating": 1.0, "text": "They not only provided terrible service ...I have now been attempting to get in touch with them for several weeks regarding an incorrect bill and they never answer the phone nor return your call", "pics": null, "resp": null, "gmap_id": "0x888911a9429bb91d:0xb634c5054bb98aee"}
{"user_id": "108782980942136403473", "name": "Vic Mobley", "time": 1538257378484, "rating": 1.0, "text": "I was coming off I-20 @ Trussville and when the light changed, I sped up and got in front of the RPS Ambulance, Medic 826 and stpped at the next light and the ambulance got next to me in the right lane and stopped at the light.  When the light turned green and we attempted to go, the ambulance attempted to hit my car and I stopped so the ambulance got in front of me and started brake checking, hitting his brakes and I stopped again, when they started going and I proceeded slowly behind them, they started zig zagging from the lane to the middle and back again.....we stopped again and they stopped too...Then sped up really fast and turned towards St. Vincents East.  ROAD RAGE FROM AN AMBULANCE...I WILL NEVER ALLOW THIS SERVICE TO TAKE ME ANYWHERE..A CAB OR UBER IS SAFER.", "pics": null, "resp": null, "gmap_id": "0x888911a9429bb91d:0xb634c5054bb98aee"}
{"user_id": "100764375822856623485", "name": "kjjunior2001", "time": 1536524793085, "rating": 1.0, "text": "Horrible!!! They dropped my 250 pound terminally ill mama on the porch trying to get her in the house. She was getting chocked by the straps as she slid out of the seat.", "pics": null, "resp": null, "gmap_id": "0x888911a9429bb91d:0xb634c5054bb98aee"}
{"user_id": "105400227229372886654", "name": "Adam Swedenburg", "time": 1521916831377, "rating": 5.0, "text": "They are fast at responding. They have amazing workers that are very well trained at what they do. They are friendly and always willing to help. The manager is very nice and is okay with people calling with questions or comments.", "pics": null, "resp": null, "gmap_id": "0x8886635974eaf4b5:0xb28778eb917d0abf"}
{"user_id": "101911626565553244350", "name": "Cassandra Nolan", "time": 1579703906079, "rating": 5.0, "text": "Thank you for all you do for the community. Top notch care. Y'all took excellent care of me in my time of need, so I can't thank you enough!", "pics": null, "resp": null, "gmap_id": "0x88628421b4bbcf63:0x3070e670e88c6215"}
{"user_id": "103550465237961147216", "name": "Beatriz Hill", "time": 1584997145459, "rating": 1.0, "text": "In August of 2017 I was involved in a traffic accident (rear-ended by a semi) and transported to trauma center.  Today (three years later) I received a collections bill from a Simons Agency trying to collect an unpaid debt from First Responders of Alabama.  I KNOW for a fact that my car insurance paid this bill back in 2017 so I will NOT be paying this collector.  Also, it's not the first time I've heard of this happening to someone.  Your billing department is incompetent if this happens on a regular basis.  Get your act together and stop ruining people's credit!!!", "pics": null, "resp": null, "gmap_id": "0x88628421b4bbcf63:0x3070e670e88c6215"}
{"user_id": "118406521179948075038", "name": "Daniel Pannell", "time": 1576082257610, "rating": 5.0, "text": "Great service. No a single complaint!", "pics": null, "resp": null, "gmap_id": "0x88628421b4bbcf63:0x3070e670e88c6215"}
{"user_id": "111560228732024547734", "name": "Blake Singleton", "time": 1540443119582, "rating": 5.0, "text": "Listened to our requests about lights and siren. Were respectful and took care with all of our problems. Polite.", "pics": null, "resp": null, "gmap_id": "0x88628421b4bbcf63:0x3070e670e88c6215"}
{"user_id": "100749967659467766357", "name": "F. Slate", "time": 1573050191780, "rating": 1.0, "text": "The gentleman who talked with my son during his ambulance ride was helpful, nice and genuinely concerned, this review is in no way towards the ambulance employees. This review is for the EMS\nHuntsville office staff, they are unprofessional. No one knows how to answer a telephone. I've called on several occasions trying to discuss why I was being sent 3 bills and I never once had someone actually answer the phone.", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "104182516366755035508", "name": "Judy Sands", "time": 1539735654747, "rating": 5.0, "text": "I just wanted to thank the amazing team (younger dark haired woman and younger man with facial hair) that showed up tonight when I had to call 911 for my daughter for what I thought was a seizure (it was an extremely bad fit that I've never seen her throw before...I was embarrassed beyond belief). They were beyond professional, great with my 1 year old and made me feel less ridiculous about calling for what turned out to be nothing. Y'all were great, and in case nobody has said it lately, you are very much appreciated! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "116095481177795258291", "name": "Karen Nichols", "time": 1576592902146, "rating": 1.0, "text": "The lady who answers the telephone at this business is very rude and unprofessional. I just read through some of the reviews and found where people have had the same experience I have with \"Belle\" - you guys really need to replace her.", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "111534414577943229314", "name": "Marie Drake", "time": 1544133720009, "rating": 5.0, "text": "All I can say is...God Bless Hsv EMS Inc (Jackie).  My Aunt is in the nursing home and all her income goes to the state.  She has about $5.00 to $10.00 a month left over.  That remaining amount covers the monthy bank fees.   For the past three months or so, all I could do was pay Hsv EMS $5.00.  I wrote them a memo so they would know that I was doing the best I could with her finances.  The amount she owed was less than $100, but I respected the importance that the money was money they earned and she owed.  So, when I was paying her bills this month... I was overwhelmed with happiness.  A special purple inked written memo from Jackie said..... Hope this will help! Jackie.  YES, Jackie it helped more than you know.  I want everyone to know that Hsv EMS are special in many ways.  Not because the balance was written off, but they truly made a stressful situation this holiday so much happier.   Although my Aunt is currently in the stages of Dementia and paralyzed on one side with a stroke, she is a God fearing woman.  She would praise God and say thank you.  But on her behalf.... I want to say THANK YOU so much for your ALWAYS professional (staff) and gratious gesture which is warmly appreciated and will not be forgotten.", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "103019718537011111766", "name": "JoAnn Penzin", "time": 1552337072219, "rating": 1.0, "text": "Who ever heard of an Emergency medical service that could not answer the phone.", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "114989312167412219600", "name": "jere henry", "time": 1546177934488, "rating": 1.0, "text": "Probably would have gotten more compassion from a cab driver!", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "112379408071918067351", "name": "Martha DeFrank", "time": 1492018325530, "rating": 1.0, "text": "Billing is a more than a hassle. My accountant rep was Bell and she was immensely rude, uncaring and short tempered. When asked to talk with a different representative, she kept arguing with me on my actual need of being transferred.  I wouldn't use this service if it wasn't the only ambulance service provided in the state of Alabama.", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
{"user_id": "115956247863478470379", "name": "Jeff Hill", "time": 1479845270412, "rating": 1.0, "text": "Recently took a ride with Hemsi after an accident I was involved in. Paramedic was extremely rude, of little help, and very cold in general. I would rather drive myself to the hospital than ride with Hemsi again!", "pics": null, "resp": null, "gmap_id": "0x88626b4729d24fc1:0x1f8d30cba8e4c88c"}
