{"user_id": "115946586675132783261", "name": "Jason Clark", "time": 1605051857485, "rating": 5.0, "text": "Awesome place! Great selection! and the guys there know firearms in and out. They're very knowledgeable and know their stuff! The atmosphere there is very chill also. They didn't try to push me into buying something that i didn't even want. They make their suggestion when you tell them what you are looking for and they just kind of step back and let you make your own decision about it.\n\nI appreciate that! I Can't stand to be pressured about buying something.\nTop notch business and Top notch people there!\nI'll be back👍", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "103382617581800818873", "name": "Rob Jordan", "time": 1602094427142, "rating": 5.0, "text": "Today was my first time going in here, and the guys really helped me out I gave them what I wanted and price range and they made it happen. They are very knowledgeable guys and know everything it is when it comes to guns. The guys in there are easy to talk to and truly want to help you. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "108349891544577937801", "name": "Anthony Thomas", "time": 1599312525439, "rating": 5.0, "text": "Great shop, stopped in this week for the first time after my local shops all disappointed me with bad customer service.\n\nDrove 40 minutes to get here. Staff was great, had a great selection, purchased me a new pistol chambered carbine for a great price.", "pics": null, "resp": {"time": 1599345031190, "text": "Thank you Anthony, We take pride in our customer service, and by the way we stand by our guns. We hope to have a big shipment of ammo next week. Safe shooting. Don"}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "117373659457946131307", "name": "Alex Medlin", "time": 1623965184815, "rating": 2.0, "text": "High prices and poor customer service", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "108969089308146354604", "name": "Mr. K", "time": 1586132185367, "rating": 5.0, "text": "Really enjoyed the salesman I worked with. I knew exactly what I wanted however he showed me a more recent model that I had no idea about. His recommendation was more ideal for the purpose of my purchas . Every concern I had, he showed me a viable solution.  Thanks for the professionalism and knowledge.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "105108120626084339381", "name": "Bobby Kilgore", "time": 1564586726783, "rating": 5.0, "text": "Great store!  Anything and everything you could ever want for shooting.  People are great and know what they are doing!  Highly recommend this store.  You won't be disappointed.", "pics": null, "resp": {"time": 1564631934764, "text": "We try to please. It's all about customer service."}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "108073278894094514513", "name": "Joshua Mitchell", "time": 1513091551775, "rating": 5.0, "text": "Very knowledgeable and helpful guys. At first look it may seem they don't have as many guns as a place like Academy but they actually have way cooler and more quality stuff. Plus they actually know their guns. Tom helped me find a perfect concealed carry weapon as I wasn't very familiar with the different types of handguns. They have a lot of cool surplus gear too. They are a very experienced crew who can also make a new customer feel comfortable so I would recommend this shop to new shooters or professional ones the same.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "114614299712948496014", "name": "Herman Daniel", "time": 1587605736318, "rating": 5.0, "text": "They have almost anything that you can find online but you are standing there talking to a real person. They are awesome and the only thing that I am sorry for is the fact that I had not found them sooner. Found my go to  tactical shop. Glad I found yall!!", "pics": null, "resp": {"time": 1587654511702, "text": "Thanks for finding us. We try hard to give great customer service. Thank for your business."}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "103218374166278954563", "name": "agbond003", "time": 1464285216103, "rating": 5.0, "text": "Overall, my experience at Southern Survival Store has been absolutely positive.\nThe Products they carry are of great quality and prices are more then reasonable. The customer service is top notch and I always feel welcome to approach them. When I ask a question or ask for an opinion on certain items, the staff will answer in a fashion that illustrates both honesty and integrity. When you have an interest in a particular item, the staff will not give you a few sale's pitch lines; instead they will tell you their actuall experience with the product. Knowing that these guys really use what they sale brings confidence in my purchases. Long story short, this is the best example of an army surplus store in every category that can be graded.\nI highly encourage anyone one with outdoors, survival, or defense needs to check this place out.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "100993980818099815845", "name": "Brian Mccall", "time": 1570673178398, "rating": 4.0, "text": "I was greeted as soon as I walked in the door, really nice staff. I was under the impression I was walking into a oldschool millitary surplus somthing like heart of dixie was so i must say i left a little disapointed but i will be back for hunting ammo for m1\nI notice it was almost half price of what i paid last time", "pics": null, "resp": {"time": 1570724301056, "text": "Brian, thanks for coming into our store. We used to have lots of surplus but as you saw we are selling out of that business. We now focus on Tactical Guns and Training. Thank you for your review. Don"}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "112715800980453130933", "name": "Leon Stark", "time": 1492123106743, "rating": 5.0, "text": "They don't treat you like an idiot for asking what something is or about firearms. That alone makes them better than most places I decided not to do business with. Very good selection of products.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "112654725991574923182", "name": "Nguyen Huy", "time": 1504138141590, "rating": 5.0, "text": "This place is amazing. The staffs are so friendly and they are ready to help you when need. Their price are reasonable and worth it.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "104836423185618051576", "name": "Nicholas Molinari", "time": 1458512928648, "rating": 5.0, "text": "Great trip out there. I spoke with the owner Don and he was very kind and honest. The prices are great and the store very organized.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "107283470282825060744", "name": "Demetrios", "time": 1564022010019, "rating": 5.0, "text": "This place is a build a gun Masterpiece.  Love this place.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "113302232812233103769", "name": "Melanie Lankford", "time": 1513723768566, "rating": 5.0, "text": "This store has top quality equipment, trainers and gun experts. The classes they offer are very impressive survival and preparedness skills in a realistic atmosphere for a variety of situations.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "114984773301672558090", "name": "Sherry Kilgore", "time": 1564661468602, "rating": 5.0, "text": "Great customer service before and after the sale!", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "107276760296871815254", "name": "Robert Bennett", "time": 1461874949703, "rating": 5.0, "text": "They make feel welcomed and ready to help.\nGreat selection to choose from.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "100380985408513726797", "name": "Bart Rushing", "time": 1469883160884, "rating": 5.0, "text": "Friendly and knowledgeable staff... Seems to be about everything you could need...", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "115046506707736352231", "name": "John M", "time": 1487547566553, "rating": 5.0, "text": "Wide variety of survival supplies, firearms, & ammunition. Knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "111769571857013359938", "name": "Roy Aaron", "time": 1492868372540, "rating": 5.0, "text": "Best place for all outdoor gear hands down", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "109206010153870487430", "name": "Randy Norred", "time": 1441823248398, "rating": 5.0, "text": "This place is amazing and they are very helpful.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "100557899186541022141", "name": "michelle cloutier", "time": 1469660238438, "rating": 3.0, "text": "Friendly staff kinda musty inside.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "107073613417132993075", "name": "Jerred Hall", "time": 1616358388853, "rating": 5.0, "text": "Get-R-done!!!!!!!!!", "pics": null, "resp": {"time": 1616377854557, "text": "Thank you Jerred, we are trying. Don"}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "101559557143321204031", "name": "River Lafloor", "time": 1625055310739, "rating": 5.0, "text": "Best in town gunsmith great customer service has a wide variety of items inside the store. If he don't have it he can get it. He does Sarah coating and other gunsmithing work. Stop by give him a call.", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "107360431523257178853", "name": "Andy Hardas", "time": 1615157447589, "rating": 5.0, "text": "Best customer service anyone could possibly ask for and fantastic gunsmith services. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "106485506615578435438", "name": "John Lard", "time": 1515174801479, "rating": 5.0, "text": "Good person to deal with. Little slow only because has so much to work on. Never had an problems. Goes out of his way to help.", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "114618759021194872511", "name": "Daryl Wright", "time": 1556104916551, "rating": 5.0, "text": "I have done business with Dan several times and I will continue to do business him as he has great prices on everything he sells, Dan is my go to guy when I'm in the market for a new gun, he's the only person I will do business with.", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "114406666086684020710", "name": "Richard Cornatzer", "time": 1542048030064, "rating": 5.0, "text": "Best gun shop and gunsmith around bought several pistols and rifles from shotglass guns couldn't ask for a more honest and fair person to deal with has a pretty good selection of guns as well", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "108197368476551528503", "name": "Adam Eaton", "time": 1484097619628, "rating": 5.0, "text": "Dan Fox knows what he is doing. He has worked on almost all of my armory and I will continue to customize my weapons with him.", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "117058298453112892757", "name": "Jason Morgan", "time": 1462516804285, "rating": 4.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "114431422362955878937", "name": "Quentin Doxie", "time": 1467660379316, "rating": 4.0, "text": "History", "pics": null, "resp": null, "gmap_id": "0x887d37f2137291b1:0xfd3e6a930dfb462e"}
{"user_id": "117986240903370929222", "name": "Joshua Findley", "time": 1623336977714, "rating": 5.0, "text": "As a guy who's worked in and around the archery world for years, I know quality when I see it, which isnt often these days. The folks at Pat's are a genuine stand-up bunch! Pat's has been my Mathews dealer for 4 years now and that's despite the hour plus drive and the Mathews dealer just down the road from me. Simply put, it's well worth my time and money to go see Paul at Pat's archery and it will be for you too. They're the best Mathews dealer in the Southeast!", "pics": null, "resp": {"time": 1623340982058, "text": "Thank you so much for the 5-star review! We appreciate your business!!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "116337320028205364661", "name": "Eric", "time": 1617972627191, "rating": 5.0, "text": "Can't believe all the bad reviews. I have never had a bad experience here. Staff is always helpful, polite, and attentive.", "pics": null, "resp": {"time": 1617984315083, "text": "Thanks for the 5-star review and we appreciate your business! There's a history behind the bad reviews - has to do with a photo taken in a parking lot next to our store many years ago.  Our sign just happens to be in the background. People seem to think we took it and randomly leave bad reviews when it makes the rounds :("}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "101113620447290126769", "name": "Drake Taylor", "time": 1624220507149, "rating": 5.0, "text": "Had my bow setup here and my dad had a string replaced and we both agreed this is the only place we will be coming back to", "pics": null, "resp": {"time": 1624289161668, "text": "Thank you for the great review and your business! We appreciate you and your dad trusting us with your archery needs."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "101731051972639030169", "name": "Leo Aguillon", "time": 1593282991015, "rating": 5.0, "text": "Pretty stand up people. I never affiliated the business with Nazis but just wanted to see where this was.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107895145164234432335", "name": "ronlong1971", "time": 1559958324292, "rating": 5.0, "text": "Went in a couple weeks ago to order my new Matthews Traverse and Paul was awesome at assisting me and helping me get everything I wanted. He also helped out my 11 year old son just like he was a grown up with a pocket full of money. And it really made him fill important. Went back a couple days later for my friend to order his same great service and Jake helped out with his and him and Paul our both awesome guys. Great place great prices and wonderful customer support. Can’t wait to get my bow.", "pics": null, "resp": {"time": 1560526040353, "text": "Thanks for the 5-star review and supporting local! We appreciate your business!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "108693574467653576975", "name": "Manuel Hernandez", "time": 1595535661867, "rating": 5.0, "text": "I’m sorry that picture happened to you. Looks like a great store", "pics": null, "resp": {"time": 1595604490839, "text": "Thank you!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "106463868694947477516", "name": "Jeff M", "time": 1593276945768, "rating": 5.0, "text": "Great job responding to the photo on fb. Wish y’all the best", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "104849508543743140876", "name": "Peace, Love & Rocks -Sean Lamore", "time": 1595185683859, "rating": 1.0, "text": "Great endorsement!  This is the master race, huh?", "pics": null, "resp": {"time": 1595258390217, "text": "Your review is probably regarding a photo circulating that we did not authorize. It was taken without our knowledge a few years ago by people not affiliated with our business in an adjacent parking lot. Our sign just happens to be visible in the background. This does not represent the values of our business and we do not condone this behavior."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107344990416639103645", "name": "VQ Maxima", "time": 1596436142717, "rating": 5.0, "text": "The photo has nothing to do with them great business!!!  (I’m Black)", "pics": null, "resp": {"time": 1596466205928, "text": "Thank you!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "109388756549449564808", "name": "Dez'monde Gartrell", "time": 1593356880430, "rating": 1.0, "text": "Can't support a business who embraces this kind of behavior in their parking lot...", "pics": null, "resp": {"time": 1595258412805, "text": "Your review is probably regarding a photo circulating that we did not authorize. It was taken without our knowledge a few years ago by people not affiliated with our business in an adjacent parking lot. Our sign just happens to be visible in the background. This does not represent the values of our business and we do not condone this behavior."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "112169463878733242519", "name": "Mike Cameron", "time": 1572212277899, "rating": 5.0, "text": "I need to take back my earlier review I was so disappointed that my new ravin messed up that I blamed the store and I have to say I was Wrong  they fixed my new ravin in a week and despite my bad review the bow tec treated me extremely well so I hope I can set the record straight I was WRONG  . I still believe the owner should have let me use a bow until mine was fixed but I kinda understand that to so anyone in need of a good outdoor store Pat's is the place to go  for five star service mike Cameron  west Alabama taxidermy  millport Alabama", "pics": null, "resp": {"time": 1571691351849, "text": "Thanks Mike! We appreciate your business and hope to see you again soon."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "118215159479795358351", "name": "Phil Harper", "time": 1563054443246, "rating": 5.0, "text": "Awesome place  great selection very friendly knowledgable staff", "pics": null, "resp": {"time": 1563205610088, "text": "Thanks for the great review Phil. We appreciate your business and we appreciate you supporting local!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110842453110822336202", "name": "Phillip Boyd", "time": 1538071597339, "rating": 5.0, "text": "These folks know what their doing. I have got great service here.", "pics": null, "resp": {"time": 1538594612764, "text": "Thanks for the 5-star review!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107315879112856610738", "name": "Mark Levy", "time": 1540394935290, "rating": 5.0, "text": "Friendly, knowledgeable, staff. I was going on a crossbow hunt and I think his name is Paul asked me what I was hunting with. I told him the bow I had and the broadheads and he explained that the only broadheads that would fly truly like a field point were a different style due to the high velocity bow. I bought those broadheads and a target and sure enough he was right. He also sold me the cheaper arrow stop explaining that it was kind of unnecessary to buy the more costly one, his experienced not only saved me money, but also allowed me to perfectly drop a buck with a heart shot at 58yards with my crossbow (Ravin r20). Highly recommend and will continue to shop here for all of my archery/hunting needs.", "pics": null, "resp": {"time": 1540407510156, "text": "Thanks for the 5-star review! Congrats on the buck. Stop by and show us a picture when you can :)"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107332175990856889606", "name": "greg wise", "time": 1509204590471, "rating": 5.0, "text": "Pat' s staff is always great and eager to make sure you have  everything  you need to make your outdoor experience  the best.", "pics": null, "resp": {"time": 1509460406296, "text": "Thanks for the review Greg!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "100401659260849165254", "name": "Seth Fuller", "time": 1536366630388, "rating": 5.0, "text": "I jus saw this saw this place on instagram and a whole bunch of cuzin fookerz in front. 10/10 would see meme again", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "112774572440348349435", "name": "Greg Albritton", "time": 1464194186498, "rating": 5.0, "text": "Great Place to do business. Very knowledgeable staff. They make you feel like family.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107302686339509165240", "name": "PJ sivley", "time": 1473646902008, "rating": 4.0, "text": "I recently brought in a used bow I bought and they did a great job of sighting the peephole and making sure the strings were good. They have better prices on archery items than the guns and ammo.", "pics": null, "resp": {"time": 1475528354531, "text": "Thanks for the review PJ!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "104473322013040426031", "name": "Teresa McCombs", "time": 1495309590817, "rating": 5.0, "text": "Staff will do all they can to educate you on any sport that they carry the equipment for.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "114002843782668229070", "name": "Peggy Willcutt", "time": 1536912098156, "rating": 5.0, "text": "Love pats all the sales staff are very knowledgeable and very helpful", "pics": null, "resp": {"time": 1537821944981, "text": "Thanks for the great review Peggy!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "114767381380895451443", "name": "Mason Anderson", "time": 1466004388270, "rating": 5.0, "text": "Great selection, and excellent staff. Very Reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "100405323888720957468", "name": "Gabriel Avarello", "time": 1596399978510, "rating": 5.0, "text": "Great products", "pics": null, "resp": {"time": 1596466211767, "text": "Thank you!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "113873892262788178825", "name": "lonzo", "time": 1542327236216, "rating": 5.0, "text": "Found this place off of a meme. A kkk rally was being held in front of it.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "115070748538884113191", "name": "Shad Kimbrell", "time": 1473709378496, "rating": 5.0, "text": "Excellent place to purchase sporting goods", "pics": null, "resp": {"time": 1475528302320, "text": "Thanks for the 5-star review!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "101145201246185021274", "name": "Joe Weldon", "time": 1600206163716, "rating": 5.0, "text": "Friendly place", "pics": null, "resp": {"time": 1600266897042, "text": "Thanks for the review!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "104684198646823068176", "name": "Jackie Clemet", "time": 1508440139413, "rating": 4.0, "text": "Great people", "pics": null, "resp": {"time": 1508443532631, "text": "Thanks for the review Jackie!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "115088149898129642257", "name": "Mitchell Davis", "time": 1508192117178, "rating": 5.0, "text": "Great store!", "pics": null, "resp": {"time": 1508258991871, "text": "Thanks for the 5-star review Mitchell!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "116817477628504672442", "name": "Corey Fox", "time": 1506367142509, "rating": 5.0, "text": "Awesome service as usual!!!", "pics": null, "resp": {"time": 1506375235014, "text": "Thanks for the great review Corey!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110399493391760898985", "name": "Hug Savage", "time": 1496207811123, "rating": 1.0, "text": "Overpriced trash", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110513761966952745065", "name": "Bobby Phillips", "time": 1482768552587, "rating": 4.0, "text": "Good selection", "pics": null, "resp": {"time": 1484238663025, "text": "Thanks for the review Bobby!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "115941335773886596550", "name": "Don Herr", "time": 1521928545664, "rating": 5.0, "text": "Great people very helpful", "pics": null, "resp": {"time": 1522097287639, "text": "Thanks for the 5-star review Don!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "117327655528317203735", "name": "Bobby Russell", "time": 1496251106278, "rating": 4.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "106282218690321493986", "name": "Jason Latham", "time": 1470621517403, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "108191505809021863012", "name": "Carlos M. Fernandez", "time": 1623449410463, "rating": 5.0, "text": "UPDATE 6-11-21 This business is truly worthy of a ten (10) Star rating! Once again they have come through in a professional, technically competent, and competitively priced manner. I had the barrel of my 20 gauge shotgun cut down to the regulatory length for home defense (18.5\") and it came out perfect. The weapon looks like it just came out of the box! Truly a professional and talented job by the resident gun smith's! Thank you to all. Your results may vary.\n\nBREAK\n\nShould be in the 10+ Star club! I was extremely impressed with my first interaction with your staff. Erin (Counter Lady) and Gerald (Gunsmith) pulled it together in a timely manner installing a P365 Safety Conversion Kit on my weapon. The work was done in minimal time resulting in me feeling much safer with 12+1 configuration. Customer service was without par, quality of the work was perfect and the pricing was very competitive. Wishing you guys the best in biz. Stay safe, be alert. Best. CMF sends...", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100769589719365023254", "name": "Chris Knight", "time": 1621818125040, "rating": 5.0, "text": "I stopped in today to test fire a new mossberg 88 I picked up. Had a hard time finding ammo before I arrived, but they happened to have a couple boxes of ammo i could use.\n\nThe staff is friendly, courteous, and very informative. They take the time to explain what it takes to fire at the range with ease, and have a cushy waiting area to view a quick training video. The whole process was smooth and easy.\n\nThe range safety officers are well on their game. I felt safe the entire time on the range, and they were able to quickly explain the touch screen track interface, and further explaining that safety is a top priority.\n\nI signed on for 30 minutes, and decided to fire my .40 before testing the shotgun. The touch screen interface has me sold on coming back to bullet and barrel. With just a click, the target goes the exact distance. Takes all the guesswork out of the experience.\n\nI fired my pistol, and was pleased with the range itself. The design is new and clean. And with the RSOs keeping an eye on everything, it's a great environment to enjoy your firearms.\n\nI tried the 88, and it performed beautifully. I added some extra cushion due to a shoulder injury. For those that would ask, you can't shoot bird shot here. But you can fire buck shot and slugs. But I'll tell you, it's fun firing a shotgun at this range.\n\nAfterward I wandered around and struck up conversations with some of the staff, and showed me a selection for sale. I was impressed with the inventory, as well as pricing. I see myself buying my next firearm from here.\n\nFor me, it's a bit of a drive from Madison. But good business is where you find it, and Bullet and Barrel is my newest one stop shop for all things firearms. Plus, open on Sunday!\n\nDont take my word for it, stop in and check them out today! I'll be back soon, keep up the good work guys.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvuz95o_d6-D6-jouQmBd1MO6aeWVF21SXCr48=w150-h150-k-no-p"]}], "resp": {"time": 1621814100195, "text": "Thank you for coming down! Please come back soon and....May the force be with you ;)"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105860791059418933903", "name": "Karen Smith", "time": 1621466501646, "rating": 5.0, "text": "State of the art range! The employees are always friendly and helpful - from the sales team to the RSOs! Everyone is very professional and committed to ensuring the safety of everyone who walks through the doors. I would absolutely recommend this place to any of my friends or family without hesitation!", "pics": null, "resp": {"time": 1621467285522, "text": "Thank you so much! Please come back soon!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105590913039818165206", "name": "JonPaul Wise", "time": 1614614054310, "rating": 5.0, "text": "I recently moved to Huntsville and wanted to find a new class 3 place to call my \"local shop\". This place is a perfect example of how to do things right, treated me like I was a long time customer right from the start and after just a few visits I feel like I've been coming here for years. Very veteran friendly and the facility is far beyond just a gun shop. I've lived in 8 cities over 5 states in the past 10 years and this place is on the top without a doubt!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107829370627486097339", "name": "Justin W (JdogAwesome)", "time": 1572148367485, "rating": 5.0, "text": "Extremely well maintained and high quality range! The firearm rentals where great and the guns where in pristine condition! The range officers where super nice and helped us a ton as it was my first time using a pistol. Can't recommend this place enough!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDlyDfxXpPyzsXqCRSa0kV6DEUR1WPKZLKpMIO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOrLZ6vFpaPFT2Pzw-iNZIaHq5Mg26oG-mH4aRy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110771848172386740724", "name": "Adrian Farrales", "time": 1608333886826, "rating": 5.0, "text": "Bullet and Barrel is a great place! They have a wide selection of firearms and a very nice indoor range, but what I like most about this place is that they offer excellent classes relating to firearms. Jeff is one of the staff members there and he is a great teacher. The folks working at Bullet and Barrel are experts and they'll make sure you get everything right. If you're looking for instructional classes on anything related to firearms, then Bullet and Barrel is definitely the place!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110386124523052422004", "name": "Lynn Watts", "time": 1616244148179, "rating": 5.0, "text": "Took the handgun cleaning class with Jeff.  It was very informative.  I learned how to disassemble, clean and reassemble a firearm.  The tip about the grease was especially good since I have trouble at times with pulling the slide.  Thanks for the exceptional training.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "117265596001971072007", "name": "David Norg", "time": 1616899491974, "rating": 5.0, "text": "Needed my scope mounted on a new rifle.\nMade the mistake of taking it to another popular local business to get it done. Clearly was not a professional installation.\nGerald with Bullet and Barrel reinstalled the scope and rings on the spot and did it right!\nGreat people and service!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103561447289124441166", "name": "Carrie Givens", "time": 1611358036525, "rating": 5.0, "text": "I just made the best investment today, my new Wilson combat edcx9l firearm and I love It. Jeff was extremely helpful and the experience was awesome. I just started taking classes, and Jeff made sure I knew everything that I needed to know about the firearm before I left. He was very patient, considerate, and knowledgeable. Thank you Jeff, you’re awesome!\n- C T Davis", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100683797676367632405", "name": "Marquiz Liner", "time": 1608675278286, "rating": 5.0, "text": "Can’t recommend Bullet and Barrel enough! The staff is very knowledgeable and extremely helpful! The range is clean, well-maintained, and well-managed by the excellent RSOs. Everyone we’ve encountered has been super nice! If you’ve never been, I highly recommend you check them out! They’re awesome!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116868464070051506322", "name": "Telia Norg", "time": 1616879069127, "rating": 5.0, "text": "Just had a scope remounted correctly.  Took to another gun shop and they apparently had no idea what they were doing. As soon as we showed the clerk the firearm he immediately knew what was wrong. This is our place from now on.  Thanks", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107087569882439689247", "name": "Hilary Crimmins", "time": 1610233838344, "rating": 1.0, "text": "Nice clean and well ventilated facility.\nBut honestly it is overpriced, and has extremely long waits. Members get preference and can be observed jumping the line before non-members for range access. I've even had a staff member tell me that they only had 4 boxes of ammo left and would only sell to members.\nToday we, two of us for one lane, arrived at 2:15pm and paid for 30 minutes on the range. We waited well over 2 hours and did not get our full 30 minutes because they were closing. It's not worth it.", "pics": null, "resp": {"time": 1610234764887, "text": "We totally understand the frustration. We were extremely busy today as I'm sure you saw! With everything going on in the firearm industry we are trying to do everything we can. But we do have members who pay a monthly fee and part of that benefit is jumping the line. Kind of like Disney! We would love for you to give us another opportunity. Please reach out to me, Louis, at 256-384-4867 and we will make sure you have a 5 star experience"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104579732206294547798", "name": "Joyce Maxwell", "time": 1605533390164, "rating": 5.0, "text": "Had a wonderful experience Saturday with my daughter's. Took a class with Tommy, can't say enough about his wonderful teaching skills. We were nervous but with Tommy's great personality it wasn't long till we were calm and enjoying ourselves. Thank you so very much. We'll definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "113159052817495728647", "name": "Andrew Emmerton", "time": 1605922208706, "rating": 5.0, "text": "I took a private lesson with Jeff and he was very knowledgeable, I highly recommend taking a lesson. The rest of the staff were also great and they have a great selection of firearms for sale as well as some to rent for their indoor range.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116606637947680991772", "name": "Chad Jones", "time": 1608750494221, "rating": 5.0, "text": "Louis and the crew at bullet and Barrel are first rate and so is their facility.  I've had some minor gunsmithing done as well, mainly to check suppressor alignment and get a few breaks lockset on, service has been fast and very affordable.  I've had a few problematic firearms inspected as well and John, their gunsmith, has always been straight forward and accurate.  Of the range facilities in the area, BnB stands head and shoulders above the rest.  I have range passes to go to other ranges for free, but I would rather spend some money at BnB to be with a better crowd and make sure their level of commitment to the average gun owner is rewarded.  When it comes to stores that are in your corner as a gun owner, these guys are bar none best of the best in our area.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108753319473049978968", "name": "pauline bracken", "time": 1595624122120, "rating": 5.0, "text": "Sarah did a fantastic job teaching me how to firearm! I actually would give her 10 ⭐️ Since I haven’t in years!! I probably will take another class before I actually buy a pistol! Thank you again for your patience and spending over 2 hours with me! I had a wonderful time!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111412710532941403652", "name": "Catherine Stower", "time": 1597345578493, "rating": 5.0, "text": "Sarah was a wonderful instructor!  Her patience went above and beyond what I would have expected from an instructor, and her knowledge is tremendous.  In addition, she is continuing to work with me to help me figure out the best firearm for personal use.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115165443956734656168", "name": "Steven Gaffin", "time": 1593188132496, "rating": 5.0, "text": "I went because I was having the hardest time removing the retaining pin from the firing pin of my Remington 870. So I took the bolt down to Bullet and Barrel. Front Desk (not really front more like back left corner) staff was very welcoming and friendly. The gunsmith was able to remove the pin and lathe down a manufacturing defect in it that was keeping it in the bolt.\nI was very satisfied and impressed with Bullet and Barrel and will definitely return for the many other services they offer.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116606637947680991772", "name": "Chad Jones", "time": 1608750494221, "rating": 5.0, "text": "Louis and the crew at bullet and Barrel are first rate and so is their facility.  I've had some minor gunsmithing done as well, mainly to check suppressor alignment and get a few breaks lockset on, service has been fast and very affordable.  I've had a few problematic firearms inspected as well and John, their gunsmith, has always been straight forward and accurate.  Of the range facilities in the area, BnB stands head and shoulders above the rest.  I have range passes to go to other ranges for free, but I would rather spend some money at BnB to be with a better crowd and make sure their level of commitment to the average gun owner is rewarded.  When it comes to stores that are in your corner as a gun owner, these guys are bar none best of the best in our area.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108753319473049978968", "name": "pauline bracken", "time": 1595624122120, "rating": 5.0, "text": "Sarah did a fantastic job teaching me how to firearm! I actually would give her 10 ⭐️ Since I haven’t in years!! I probably will take another class before I actually buy a pistol! Thank you again for your patience and spending over 2 hours with me! I had a wonderful time!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115165443956734656168", "name": "Steven Gaffin", "time": 1593188132496, "rating": 5.0, "text": "I went because I was having the hardest time removing the retaining pin from the firing pin of my Remington 870. So I took the bolt down to Bullet and Barrel. Front Desk (not really front more like back left corner) staff was very welcoming and friendly. The gunsmith was able to remove the pin and lathe down a manufacturing defect in it that was keeping it in the bolt.\nI was very satisfied and impressed with Bullet and Barrel and will definitely return for the many other services they offer.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111412710532941403652", "name": "Catherine Stower", "time": 1597345578493, "rating": 5.0, "text": "Sarah was a wonderful instructor!  Her patience went above and beyond what I would have expected from an instructor, and her knowledge is tremendous.  In addition, she is continuing to work with me to help me figure out the best firearm for personal use.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106958615455349640396", "name": "MaryAnn Green", "time": 1595662212612, "rating": 5.0, "text": "Took a beginner's gun safety class.  Sarah was my instructor and was extremely knowlegeable.  She answered all my questions and gave me good advise on how to properly handle a fire arm.  She provided helpful hints on the firing range.  I plan on meeting with her again for more instruction.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108678911012212882076", "name": "Steve S", "time": 1592359008165, "rating": 5.0, "text": "Excellent instruction and advice from Jeff White! He is extremely knowledgeable and taught me a ton of tips to correct my technique. Thank you so much! It's just a great facility. Clean, professional, helpful.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114560596622958917468", "name": "Ethan Brewer", "time": 1597445293885, "rating": 5.0, "text": "Alberto is the man. Great customer service. We talked about many different guns. He knew the product, and I could tell he was genuinely trying to help me.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "118391526411006229340", "name": "Eugene Mayo", "time": 1581772020215, "rating": 5.0, "text": "My first visit to Bullet & Barrel was a very pleasant experience. I expected the normal indoor gun range with no frills and a lack of management personnel for the amount of customers. Not at Bullet & Barrel! You enter the establishment and find yourself in a first class gun store with very tastefully displayed products. When you check in to the range most of the paper work is done electronically and there are plenty of well trained staff on hand to help you, not only at check in but on the range also. Defiantly not a Mom & Pops business. Top notch!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109063956324002300964", "name": "J Cowan", "time": 1593199430181, "rating": 5.0, "text": "Great place for learning how to shoot or just for practice. My husband and I visited and enjoyed it. Truly learned at lot from our instructor Sarah. She was very knowledgeable and very patient. We learned so much. She walked through every detail with us together and separately, as we each own two different guns. Highly recommend! Thank you Sarah!! We will be back.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100133391775176345084", "name": "Dorothy Loftin", "time": 1574159741642, "rating": 5.0, "text": "Thank you Tim for a great lesson on learning to get comfortable with a gun! I was with my sister and friend, both of whom had experience with guns.  Tim tailored the class for all 3 of us with varying abilities.  I had never touched a gun and was shooting with multiple guns by the end of the session.  The best part of it all is now I’m comfortable with the gun we have in our home.  Thanks again Tim!  We will definitely be back for more lessons!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "118358975380986036935", "name": "Randy Chavez", "time": 1602194615105, "rating": 5.0, "text": "Went in the is morning for the first time to sight in my hunting rifles. WOW!  Got hooked up with George and he did it all. Helped me sight in four rifles is one hour, explained everything he was adjusting and just made the experience unbelievable. Couldn't have asked for anything more. Thanks George!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116572371350412508177", "name": "Emilee Taritero", "time": 1591582714575, "rating": 5.0, "text": "My twins took the Youth Marksmanship Class  with Sarah as part of their 13th bday weekend. She was amazing! She was so patient with the group of kids. She explained everything very well and made sure the class understood all the points of gun safety and operation which allowed them to have an amazing time once they got the hands on experience on the range. My twins DID NOT want to leave.  We will definitely be back!", "pics": null, "resp": {"time": 1591656147147, "text": "Thank you do much!!! Sarah is a great instructor! Please come visit us again soon!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111271810573390878118", "name": "vivaswanth c", "time": 1568135892378, "rating": 5.0, "text": "Great range. Courteous people and very encouraging trainers.\nModern equipment and look. Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMyR6ROAdKi2X5TpiB72VhtnB1uGTqAuMAxmpTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN86bGQj2aQsjpkoMZaFjlurUool5SQozkFD-Fd=w150-h150-k-no-p"]}], "resp": {"time": 1568137186635, "text": "Thank you for the kind words! Please come back and visit soon :)"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105728822323416055853", "name": "Nelly Belly", "time": 1558874620802, "rating": 5.0, "text": "Best range in Huntsville.... and it’s not even close. I became a member when they were still building it because I knew it would be a great place and they have exceeded my expectations. The ranges are well lit and spotless. The thickness of the barriers between the ranges was a major selling point to me. I feel safe and secure when I am on my lane. The range masters are helpful and add another layer of protection for the customers/ members that are throwing lead at a target. I strongly suggest you give Bullet and Barrel a shot (pun intended) if you are looking for a place to shoot. Beware, this place can become addictive.", "pics": null, "resp": {"time": 1558881232991, "text": "Thank you for the kind words! We appreciate your continued support"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102414268234017561216", "name": "diane rigsby", "time": 1595023888840, "rating": 5.0, "text": "A friend and I took the first steps class from instructor Sarah.  Sarah gave great instruction emphasizing safety first.  She was very patient.  I learned A lot and will go back in the future.  Also the facility was very clean.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116207865826871015356", "name": "Jasmine Tucker", "time": 1560554577222, "rating": 5.0, "text": "If you’ve heard about this place and have not stop by, WHAT ARE YOU WAITING FOR? This place is awesome! It’s clean, and there’s safety videos which made me feel safe and my favorite part was that the staff made me feel comfortable. I encountered Sarah who is so patient and knowledgeable. This was my first time using my new .380 and she encouraged me to practice more with it and not be discouraged. Just when I thought the place couldn’t get any better I even had the same experience as I exited by Pam she’s so sweet she explained to me about how to become a member. This place sells everything too!", "pics": null, "resp": {"time": 1560555262695, "text": "Thank you so much!!! Please come back soon 😃"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108293537391808136874", "name": "Larry Parker", "time": 1591551886484, "rating": 5.0, "text": "Excellent facility. Great instruction on gun safety and usage from Jeff White. Highly recommend Jeff for a private or group lesson.", "pics": null, "resp": {"time": 1591656262064, "text": "Jeff does an awesome job!!!! Please come visit us again soon!!! And let us know if we can help you further"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110574924617358983360", "name": "Ivica Ristovski", "time": 1587601671836, "rating": 5.0, "text": "This is a very good place. Staff is super nice. Clean building, very nice shooting range. I would say best in town. Perfect for pistol shooting.", "pics": null, "resp": {"time": 1591656325335, "text": "Thank you!! All of lanes are also rifle rated as well!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105971127545111666382", "name": "Clint Beavers", "time": 1591917294765, "rating": 5.0, "text": "The staff is very knowledgeable and friendly. Sarah answered all my questions, demonstrated gun safety, and made my first time experience an enjoyable one.", "pics": null, "resp": {"time": 1591921224228, "text": "Thank you for the kind words!!! Sarah is a great part of the team! Please come see us again soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116644672468733693372", "name": "Zachary Talley", "time": 1574911954300, "rating": 5.0, "text": "This is the best gun shop in Alabama. Fastest and most professional service. I dropped my gun off with new scope John amd Alberto had all the necessary mounting hardware in stock.  1 hour they mounted ,bore sighted and zeroed in at there 100 yard range. EXCELLENT SERVICE and very well trained gun smith and employees.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116291605423341650990", "name": "FryingPan", "time": 1565375236426, "rating": 5.0, "text": "Got a membership to this place and its worth every penny. Excellent range officers and all very professional. The ranges themselves are very clean and ventilated. There is ample space for any weapons you want to bring. They have a huge selection of weapons to rent (free with membership) which was one of the big selling points of the membership for me. Once you shoot here you won't go anywhere else again.", "pics": null, "resp": {"time": 1565377333532, "text": "Thank so much! We appreciate you joining the family!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103434953636452611588", "name": "braxton guthrie", "time": 1591989101486, "rating": 5.0, "text": "Extremely respectful over the phone was very refreshing, normally because of my age (21) I'm in between being treated as an adult and an adult.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109763709233762642653", "name": "david schachle", "time": 1590858780273, "rating": 5.0, "text": "If you are looking to learn how to shoot, I highly reccomend Jeff. He is very nice and profesional. They have a clean range and store. Very fun experience.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104230763638810113614", "name": "Bryson Hill", "time": 1574896334045, "rating": 5.0, "text": "After going to three other places in Huntsville and the big box store across from Bridge street that has the street named after them along with there sales add and waiting in line for hour two find out that they did not have one or ever had one.\nFor now on Bullet and Barrel has my business best prices in town Thomas was my sales person he was a great help . Everyone was very nice I encourage anyone that is in the market for firearm visit Bullet and Barrel", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114657207870938196902", "name": "donald reimer", "time": 1590874698341, "rating": 5.0, "text": "Very clean, safe and very nice range people are very helpful and friendly no attitude will definitely return when back in town", "pics": null, "resp": {"time": 1591656282169, "text": "Come back and see us! Travel safe"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106343797249030979973", "name": "Charles Pruitt", "time": 1579522040394, "rating": 5.0, "text": "The staff is friendly and knowledgeable, and the gun range is awesome. Whether you're a beginner or a pro, if you're looking for a place to shoot, try them out. They've definitely earned my business.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "101946007405696258910", "name": "Galvin Freeman", "time": 1558740390867, "rating": 5.0, "text": "First visit here to shoot and I was very, very impressed with the entire staff from start to finish! This place has that it factor and has lots of potential to become a gem here in Huntsville! The indoor range takes it to another level. Definitely recommend checking this place out! You won't be disappointed! I enjoyed my visit and will be back.", "pics": null, "resp": {"time": 1558881195682, "text": "Please come back soon!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104809396136423875469", "name": "J B", "time": 1578778773597, "rating": 1.0, "text": "First, I must say that the range facilities are quite nice with helpful staff. The range facilities are up to date, very comfortable and the RSOs are very professional.\n\nHowever, I made the mistake of using the gunsmith services. This has not gone well. This particular saga has been going on since the end of November. I always had to call or email them to get any status and the answer was always the same...it will be ready Saturday, it will be ready next week, it will be ready \"sometime next week\". I do not believe that they have devoted any significant time to my project. The first time I checked in with them after a week, that is when they informed me I needed to bring in other components. They never reached out to me. Very frustrating. Now that it is in Jan I have given up working with them and I am now taking the project somewhere else.\n\nI get the feeling that they want to work on things when they feel like it, have no obligation to provide status or time estimate to the customer. Furthermore, I do not believe that they have fulltime gunsmiths which feels a little misleading from the website.\n\nSo if any readers know a professional, hardworking gunsmith in the area I am certainly looking!", "pics": null, "resp": {"time": 1591656700106, "text": "Hey JB! we're so sorry this was your experience. Normally our Gunsmiths can offer quick turn around times. Some thing may change that with parts availability and waiting on other parts we need from our customers. I am sorry we were back logged at the time and when we received your receiver in late December we began to diagnose the problem. But again that's no excuse for a lack of communication. Please let us know if we can be of further assistance"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "113576949989515699496", "name": "Andre Harris II", "time": 1585429501688, "rating": 5.0, "text": "Went to buy a light for my handgun and I received quick and friendly service. I was also lucky enough to receive a small discount while I was there.\nClean and an open environment also", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108816635150288248569", "name": "Ethan Owens", "time": 1558740549520, "rating": 5.0, "text": "A truly epic indoor shooting range. Truly the best in Alabama. Seriously. Plus I don’t have to worry about lead poisoning or negligent discharges by employees. They’re prices are really decent as well. Not the cheapest but well worth the price because of the great value they represent.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103451963558862652488", "name": "Sara Bozeman", "time": 1580511041825, "rating": 5.0, "text": "Jerrell, the gunsmith, literally saved my weekend. I went in on a Friday needing to sight in a new rifle before going hunting for the weekend. My mounts were machines improperly and couldn’t hold a zero. Jerrell skipped his lunch to fix my mounts, and did an amazing job. The rest of the staff was very helpful, kind, and generous with advice. I love how clean and fresh the facilities are as well. Not many gun ranges are so well kept! I’ll be going back, and definitely using Jerrell for any work I need done on a gun.", "pics": null, "resp": {"time": 1580517107049, "text": "We love our gunsmiths!!! Please come back and see ya soon!  😀"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100547152685670753677", "name": "Kenyon Stone", "time": 1563320910192, "rating": 5.0, "text": "Such a great place! Staff very helpful and friendly. Brought a 12 year old, they had some options for her, and were making sure she enjoyed herself as well. Tim was a great help, felt very welcome", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102037781289923717364", "name": "Caitlin Thomas", "time": 1597631194156, "rating": 5.0, "text": "Such an enjoyable experience.  Highly recommend Bullet & Barrel", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106614678154707483995", "name": "Destiny Freeman", "time": 1558314434981, "rating": 5.0, "text": "We had such a great time here! Friendly, knowledgeable, and attentive staff. The range and facilities are very well maintained and clean. Wonderful range and personable people. Win win. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110461008165691452570", "name": "DAN From the SOUTH", "time": 1561317289625, "rating": 5.0, "text": "This is by far my favorite shooting range to use in Huntsville! Very friendly environment and extremely kid friendly. My son always says \"Bullet and Barrel\" when I ask him where he wants to go!! Well done guys!", "pics": null, "resp": {"time": 1561390714672, "text": "Thanks!!!! We like to think we're all a big family 😀😀😀"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107390012346107880803", "name": "Matt Ray", "time": 1573618184224, "rating": 5.0, "text": "No better place in Huntsville to buy a silencer.  You can even use it in the range while waiting on the government.  Silencer shop kiosk makes the process super simple, and the staff are excellent to work with.", "pics": null, "resp": {"time": 1573670286724, "text": "Thank you so much!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104827550966101539236", "name": "Mike K", "time": 1550189378117, "rating": 5.0, "text": "I took Louis up on his offer of a tour of Bullet and Barrel as my previous experience was less than stellar.  The experience this time was quite the opposite of my last visit; even before I met Louis.  I was greeted as soon as I entered the building and was pointed in the right direction to meet Louis.  The tour was thorough, and as suspected the facilities are top notch, and they offered quite a bit more than I expected.  The gun range is state of the art and the RSO's are extremely helpful.  The staff is friendly, professional and quite knowledgeable .  Thank you Louis, and the entire Bullet and Barrel staff for an exceptional experience.  I most definitely will be back.", "pics": null, "resp": {"time": 1548979366048, "text": "Mike, I am so sorry that this is what you experienced with us today. We pride ourselves on giving our customers an awesome experience. As our reviews reflect that this is not our norm. But I'd love to personally invite you back and I'll give you a behind the scenes tour of our facility. Thank you for the feedback and we truly hope we can deliver a 5-star response on you next visit. If you'd like to set this up my personal email is louis@bulletandbarrel.com~ Louis, General Manager"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103903206891610443238", "name": "Rick Morgan", "time": 1532730611397, "rating": 5.0, "text": "Jason did an excellent job teaching me how to shoot. He caught and corrected all my aiming problems.\nA really great teacher!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRgjz8BUYXxEwl6X0Smo9A1AvaXsY150NFGatA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100405558825939297594", "name": "Thomas Webber", "time": 1575035130290, "rating": 5.0, "text": "I have been to Bullet and Barrel many times. Always a great time and the staff treat you right. Best place in Huntsville!!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106267637187803387277", "name": "Danta Simonsen", "time": 1533174684407, "rating": 5.0, "text": "My son and I took a gun safety class and had a great time. The instructors were knowledgeable and made the class fun without loosing the seriousness of what we were there to learn. Tim took extra time to help my son making him feel confident. He was very encouraging no matter how bad my aim was. Excellent service, great facilitie. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "113245599041872880690", "name": "Michael Mauro", "time": 1562616299543, "rating": 5.0, "text": "Hands down, the best Gun Range I've ever visited. I've lived across 5 states and have visited ranges in each one. This one has, by far, exceeded my expectations in all areas. The staff are immensely helpful, friendly and professional. Thank you for your clean facility and expert staff!", "pics": null, "resp": {"time": 1562617489096, "text": "Thank you so much for the kind words!!!! And for bringing us some cool guns to work on~louis"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "118333425931884060775", "name": "Bridgette Bradley", "time": 1525802349268, "rating": 5.0, "text": "We had our corporate event here. The employees were simply wonderful! Everyone was very knowledgeable and cared about each person in attendance. The facility is immaculate! The shooting range itself is the best in Huntsville. Highly recommend Bullet and Barrel!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102393979441459658862", "name": "Jacob Boyett", "time": 1563741077206, "rating": 5.0, "text": "Went in as a newbie shooter and within 2 minutes of being in the range Dave stepped up and immediately told me things I could correct and even went so far as to give me some drills to run. I would recommend Dave and B&B to anybody. See you guys next week!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108820322193839483013", "name": "Barrett Eimer", "time": 1525906827869, "rating": 5.0, "text": "Great range to shoot at with nice lanes and technology; they have a decent selection of quality guns and rifles too. They also sell apparel for men and women.  It comes together as a welcome and unique blend of ideas for a place to shop.  There is a ton of space and it will be cool to see how they intend to make use of it all.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109025203305171759456", "name": "Weston Hall", "time": 1569251261077, "rating": 5.0, "text": "What a fun professional place! Very clean and the staff was very friendly. They weren’t intimidating and was nice when I asked them questions.", "pics": null, "resp": {"time": 1569252581260, "text": "Thank you so much! Please visit us again soon!!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102887651973201008984", "name": "Ira Merritt", "time": 1574448818035, "rating": 5.0, "text": "I have used the range at B&B  a number of times and the staff is always friendly, helpful, knowledgeable and safety conscious. I also recently did a trade and had gun smithing done on an AR. My interactions have all been very satisfactory. John, the gunsmith, and others went far out of their way to resolve a non-standard hardware problem in a way that I greatly appreciated. Great staff and operation.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110357112194904816846", "name": "Jay Graham", "time": 1535079128730, "rating": 5.0, "text": "My wife and I shot guns for the first time. We had an excellent experience. We took a personal class from Colt, a fantastic instructor! He is very knowledgeable, explains things clearly, and kept us feeling confident throughout the entire process. We're already looking forward to our next visit.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100806952164329730825", "name": "Miki Heaton", "time": 1527632572973, "rating": 4.0, "text": "First time to visit this range, very nice facility and clean well maintained range. I would have given it 5 stars if not for two things. When we walked in the door two employees behind the counter were on their cell phones and didn’t look up until we spoke. Then when we walked on the range the range officer was also on his phone. In each case neither were talking only looking at the screen.  I personally have a problem with employees being on their phones at work but on a firing range just seems like a really bad idea.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100342808309986601209", "name": "Will Booker", "time": 1601499206445, "rating": 1.0, "text": "I drove all the way across town to get there still in line for 5-10 minutes they let two people in front of me go on to the range and then told me that they just took the last person on the range and turned me away. It wasn't covered related because they weren't busy. I won't be going back thanks for nothing", "pics": null, "resp": {"time": 1601498220549, "text": "Thank for leaving this feedback! As you can see typically the strong majority of our guests have 5 star experiences. Talking this over with our team we looked back at your trip. We do have a pretty firm rule on not allowing shooters on the range 30 minutes before we close. The folks who went ahead of you are some of our members and one of their perks is lane priority. We would absolutely love for you to give us another chance and I would like to invite you back as my guest and comp you your range time. ~Louis S."}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108600997079562543514", "name": "Matt White", "time": 1563936713669, "rating": 5.0, "text": "I am so happy with the experience I had shopping for my gun parts and my new purchase of the noveske space invader! They have answered every question that I have had. I usually give a name to ask for but theres no need in this best gun/shooting range in north alabama! Everyone is very knowledgeable. This place is amazing!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107642431437483050675", "name": "Matt Hamblin", "time": 1561389897751, "rating": 5.0, "text": "Great staff and an amazing range. Oozes professionalism and safety. Highly recommended!", "pics": null, "resp": {"time": 1561390688298, "text": "Thank you so much! Come visit us again soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105776846650904642011", "name": "Ariel Eisenstadt", "time": 1566439900442, "rating": 5.0, "text": "Lots of fun, friendly staff very helpful. Terrific selection of rental firearms very fair pricing", "pics": null, "resp": {"time": 1566442213205, "text": "Thank you so much for the kind words! Please come visit us again soon and if there is anything we can do please let us know~Louis"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "112326583337221270939", "name": "Pat Shores", "time": 1534036843316, "rating": 5.0, "text": "Great place to shoot!  Awesome service and staff especially the range officers.  They were both friendly and helpful all while being professional.  This was my first trip but it sure won’t be my last!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115529393377274868126", "name": "Seth Webb", "time": 1526070121908, "rating": 5.0, "text": "These is the best range in North AL. The range is well lit, climate controlled, and each lane is very spacious. But the best part are the people who work here. I cannot give enough praise for my favorite place in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104096609437544748955", "name": "Ron Volinski", "time": 1526501956453, "rating": 5.0, "text": "First time at a gun range. The staff was very helpful and accommodating.  Very nice place and the people are friendly and attentive.  Jason was really great with helping me with gun control and site alignment.  Great experience!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114439284211049144142", "name": "Caleb Hollingsworth", "time": 1538696898727, "rating": 5.0, "text": "Never thought I would go to an indoor range again after a poor experience at Larry's range. The range here is nice and well lighted! Love it!", "pics": null, "resp": {"time": 1545166371276, "text": "Thank you! Come visit during the holidays!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "112355749499904037575", "name": "tim watson", "time": 1545519504534, "rating": 5.0, "text": "Nice and friendly staff. Clean and well run. Will definitely go there again.", "pics": null, "resp": {"time": 1545520900312, "text": "Thank you so much!!! Merry Christmas and we look forward to seeing you soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111511835336164488913", "name": "alfred keely", "time": 1538869657969, "rating": 5.0, "text": "The facilities are very nice, clean,  and comfortable. The staff are also very nice, and knowledgeable. It was an outstanding experience. My wife and I will be back.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109464143699365618625", "name": "Tom Copeland", "time": 1561481305196, "rating": 5.0, "text": "Great place.Great people. Wouldn't think of going anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103218440390554545205", "name": "Wayne Roddy", "time": 1545944295636, "rating": 5.0, "text": "This a real nice place. The staff is very friendly, the decor and range is super clean.", "pics": null, "resp": {"time": 1545945035431, "text": "Thank you so much Wayne!!! Please come back soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114059350885411774905", "name": "Mandi Harbour", "time": 1560721467241, "rating": 1.0, "text": "Me && my husband went today and talked with a guy name Jeff. Let’s just say we WILL NOT be going back. He was rude and his costumer service was trash 🗑 this place won’t last long at all with the prices and the non friendly staff such as Jeff!", "pics": null, "resp": {"time": 1560723746117, "text": "I do apologise that this was your experience! This is so strange to hear because Jeff is one of our most lauded employees. Although we do apologise that we didn't meet your expectations I'd love to discuss your experience. Please call me on Tuesday at 256-384-4867 ~Louis GM"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115775298099401313508", "name": "Jack Stripling", "time": 1525574831045, "rating": 5.0, "text": "This place is awesome! Loved the rifle range. Great experience. I'll be back!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114321005151885743844", "name": "Anthony Williams", "time": 1536346579366, "rating": 5.0, "text": "Came in looking for a gun that they had out of stock. One of the workers really helped me  out by looking for the weapon at other stores. Then helped me understand the paper work process. One thing that stuck out to me was friendly customer service and needs of the consumer met.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116363061391476258604", "name": "Louisa G", "time": 1525571373580, "rating": 5.0, "text": "State of the art facility.  Super friendly and comfortable environment.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105291196920222164577", "name": "Paige Burchel", "time": 1527170772276, "rating": 5.0, "text": "Precious ladies items - jackets, tees, hats, scarves, etc...not to be missed!", "pics": null, "resp": {"time": 1545166240120, "text": "Come again! We have a great sale going on!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114303609354564449561", "name": "Dean Hammer", "time": 1529639799002, "rating": 5.0, "text": "Very clean place and helpful staff! Will return!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107677483136872137909", "name": "Dave Rausch", "time": 1532822765536, "rating": 4.0, "text": "Well maintained facility & Staff", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "112604359372434499692", "name": "Jason Denny", "time": 1542731976741, "rating": 2.0, "text": "You range does include a 100 yard range. However, put the fact that it is CLOSED ON MONDAYS on you site!!!  What a waste of time!", "pics": null, "resp": {"time": 1542734472100, "text": "Jason I am so sorry for the inconvenience. We are closed on Mondays so we can keep Bullet and Barrel to our high standard of a clean and safe range. However we do have our hours posted on our Website as well as here on Google and Facebook. But please come in tomorrow and we'll give you a 5 star experience"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111961657292195059673", "name": "DM M (DMM)", "time": 1549498784663, "rating": 5.0, "text": "Amazing!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108361401863922310598", "name": "Susan Hoskins", "time": 1563321219157, "rating": 5.0, "text": "Great place to visit!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110062649847321220660", "name": "Charlie Donner", "time": 1539531075735, "rating": 4.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103772026577371185703", "name": "Keelie Yowe", "time": 1616887979385, "rating": 5.0, "text": "Great customer service always! Great prices on ammo and guns - great selection as well. Highly recommended for all your personal protection needs! FIVE STARS!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "100539208029661702207", "name": "Jaime K", "time": 1612643112935, "rating": 5.0, "text": "This is the BEST local gun shop in Birmingham. The best customer service around... Plus, the gun and ammunition prices are the BEST in town! Highly recommended!! 5 STARS!!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "112608601853120375158", "name": "Casey McDonald", "time": 1611838611720, "rating": 5.0, "text": "Wonderful experience with this place. The guys helped me pick out a gun for my fiancée, and gave me a good deal on ammo for it. Liked em so much that I decided to get a shotgun as well. Only positive things to say about this place and the employees.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "109762246743588130057", "name": "Nancy Wilson", "time": 1611613552309, "rating": 5.0, "text": "Excellent service.  Will shop here again for a gun once the market gets better.  It is hard to find anything anywhere and the owner said to just be patient they are working on getting some in.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "101874047445878968096", "name": "Austin Park", "time": 1619984591266, "rating": 5.0, "text": "Always super helpful and friendly. Well stocked on ammo everytime ive been in there. Dont have much experience with pre-covid ammo prices, but from what ive found they are very fair with their mid-covid prices", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "112687513783963698288", "name": "Fernan Woodson", "time": 1607022404098, "rating": 3.0, "text": "The guys were really nice and helpful as they could, but every-time i try to patronize this establishment there is some sort of discrepancy. Either lack of knowledge on certain firearms or the product I am looking to purchase is conveniently out of stock.  I wouldn’t waste my time going in there.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "104089258649835985717", "name": "Phil Thomas", "time": 1613667397274, "rating": 5.0, "text": "Have bought and traded here , Best place to shop . Great guys to work with. 5 STAR OR MORE ⭐⭐⭐⭐⭐⭐", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "113549345451232446125", "name": "Joshua Almond", "time": 1599246077115, "rating": 5.0, "text": "I had an awesome experience at this store, i called looking for ammo and they had it in stock at an awesome price. Russell was very friendly and their firearm and accessory selection looked awesome to me! They earned a lifelong repeat customer in me for their honesty, professionalism, courtesy, and clear communication skills. Thanks again Russell!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "110187548500020460953", "name": "Denie Girardeau", "time": 1594935741565, "rating": 1.0, "text": "CASH ONLY, PEOPLE..No debt cards, or charge cards. Will not even give you change or cash back to make a transaction.  cash must be exact!  He knows  ammunition is scarce.  Others buyers must have caught him on a good day.  Will never buy there again.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "109043140247059816726", "name": "Brad Peak", "time": 1591384380706, "rating": 5.0, "text": "Nice store, lots of guns and super friendly.  I didnt feel rushed or pressured to buy anything and the guy took the time to answer all my questions. Very knowledgeable!  Visiting Alabama Guns is always a great experience!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "106594268637133653369", "name": "GT Abraham", "time": 1599320613112, "rating": 1.0, "text": "This how the phone conversation went...\n\nMe: Hello, I was calling to see if you have a certain ammo in stock.\n\nGuy: wHat dO yOu NeEd?!\n\nMe: Some 9mm hollow points.\n\nGuy: NO!\n\nMe: Okay thank you.\n\nIn short the dude was incredibly rude and short for no reason.\n\nLook elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "104739353653960808028", "name": "Amanda Nutton", "time": 1604514394301, "rating": 5.0, "text": "Very helpful, and knowledgeable.  I will be a returning customer.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "108260599277411143071", "name": "aman babwari", "time": 1590963291996, "rating": 5.0, "text": "Best Customer Service Ever. They Will Have My Business In The Future.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "103485890352765913654", "name": "Preston Holloway", "time": 1591572115359, "rating": 5.0, "text": "Great place. Got stocked up on .380 for the Zombie Apocalypse.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "118073511815561252488", "name": "Donovan Donald", "time": 1583033489418, "rating": 5.0, "text": "Owners a great guy and the customer service is superb. Great deals and varied selection.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "112642935984628911026", "name": "jason hall", "time": 1527206182942, "rating": 5.0, "text": "Visited Alabama Guns and Outdoors today to pick up a new pistol and couldn’t be happier.  Great selection on pistols, shotguns and rifles.  The guys working were super friendly and provided great customer service.  Ffl transfers are available here as well.  A great local business providing service to the people of Shelby County and all of Alabama.  Give these a guys a look for your next firearm related purchase, you won’t be disappointed.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "113041795614624395780", "name": "Brad Plaxco", "time": 1579732268816, "rating": 5.0, "text": "Super good guys! Always try to shop there first.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "112954096312504914869", "name": "Tyler Richards", "time": 1486744681519, "rating": 5.0, "text": "Don't let the size of the store fool you, their selection of firearms is exceptional. Being in law enforcement, I have had many gun purchasing experiences and consider Alabama Guns and Outdoors one of my best yet.\n\nFor first time gun owners looking for a comfortable buying experience, look no further. You don't find gun businesses with an atmosphere and owner like this often.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "105479635332734948358", "name": "PressStart ToRetry", "time": 1476384960042, "rating": 5.0, "text": "Very nice guys and willing to help with whatever you need. Stopped in just to look around and enjoyed the conversation while I was there. Made a small purchase and the owner gave me a discount. I will definitely shop here again.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "107314358995554574865", "name": "Gerardo Hernandez", "time": 1494300936005, "rating": 5.0, "text": "This gun shop is arguably one of the best in Birmingham even though it may not be the largest. The staff has and continues to be very respectful and insightful to all patrons and I personally have a very positive experience every time I go. The selection of firearms is great and good quality; although it may not have the largest they do carry worthwhile guns and equipment worth buying. It is an overall great place for first-time gun-buyers as well as the experienced.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "103405133183759891270", "name": "Alexandra Gomez", "time": 1477621759805, "rating": 5.0, "text": "I am so happy I was able to buy my first gun from Alabama Guns & Outdoors. Everyone was very helpful and nice. They took their time to show me guns and helped me choose the perfect one for me. Russell even took the time to show me how to break down my gun and put it back together. If you're in need of buying a gun, you should definitely go see them. Thank y'all so much!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "100521378503498705636", "name": "L Ferg", "time": 1476560833244, "rating": 5.0, "text": "Bought my first gun from here last week. The owner is incredibly nice and knowledgeable. I had my daughter with me and he made her feel safe around the guns. This is going to be the only place I go!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "101566975546734890441", "name": "daniel smith", "time": 1471736425632, "rating": 5.0, "text": "Great people, great selection, and even better prices. I picked up a glock 27 g3 today and couldn't be any more satisfied. I recommend doing business here even if you have to travel a little. I will definitely be going back for my next purchase.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "108415910270311676790", "name": "Toys World", "time": 1588625876122, "rating": 1.0, "text": "Poor products from china. Go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "113157542921135946163", "name": "Mattress City", "time": 1541311018429, "rating": 5.0, "text": "Staff was great! Gave me excellent advice for the kind of holster that I needed and great information about using my new 9mm", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "104957207123587525259", "name": "JP", "time": 1492533699297, "rating": 5.0, "text": "Great place to buy firearms. Staff is very friendly and don't hassle you to buy anything. They always thank you for coming in.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "118006330002523579045", "name": "Camille Hantla", "time": 1486743375769, "rating": 5.0, "text": "Came in to buy a gun box for my boyfriend so he could fly his service gun home after moving me across country to Birmingham. After many laughs with these guys (and candy! 😜), we left super pleased and were even offered the gun box and a keychain can of mace, free of charge. What a way to be welcomed to the area! Thanks, gentlemen!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "113831187900452673147", "name": "Alexandria Nichols", "time": 1494299398916, "rating": 5.0, "text": "Excellent staff! Go to place for ammo! Great selection in guns and extremely helpful advice!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "106804631661310493707", "name": "Guerney Pierce", "time": 1506975546978, "rating": 5.0, "text": "As always great friendly service, good honest prices and knowledgeable staff! I personally Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "113831187900452673147", "name": "Alexandria Nichols", "time": 1494299398916, "rating": 5.0, "text": "Excellent staff! Go to place for ammo! Great selection in guns and extremely helpful advice!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "110826112258343961580", "name": "Matthew Chapman", "time": 1562200750808, "rating": 5.0, "text": "Knowledgeable staff and always friendly!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "100910674107378724185", "name": "Jessica Ayala", "time": 1457715278547, "rating": 5.0, "text": "Amazing guys. Very knowledgeable and helpful. Really made sure they found the perfect gun for me.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "108061557575618406714", "name": "Karen Lott", "time": 1541312284125, "rating": 5.0, "text": "New guns, new ammo, new holsters, great store, great prices, great people, great service!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "101925153916642675847", "name": "stetson cupp", "time": 1506113776337, "rating": 5.0, "text": "Very friendly and reasonable. I recommend this place", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "102968249337862386586", "name": "Kent Farmer", "time": 1512412612421, "rating": 1.0, "text": "Sign on door said ( open ) at 10:30 so I came back at 10:45 only to find sign hanging on door that said ( closed today open tommorow ) so I went to Mark's & bought a safe !!!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "103552559877886272325", "name": "Royricus Mose", "time": 1491666059904, "rating": 5.0, "text": "They are the best greets you as soon as you walk in prices aren't to bad and they know wat they are talking about", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "117123133470400197599", "name": "Dalton Baldwin", "time": 1479166215559, "rating": 5.0, "text": "Great place to get a gun. Friendly staff that actually care about the customers.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "117638617002725330876", "name": "Damien", "time": 1462572132001, "rating": 5.0, "text": "Excellent customer service, comfortable atmosphere and competitive pricing.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "100125786199184245663", "name": "Adrian Diaz", "time": 1509390577128, "rating": 5.0, "text": "Excellent prices and friendly customer service.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "117094515953753694587", "name": "William Brooke", "time": 1528486053025, "rating": 5.0, "text": "Very friendly environment. Nice selection of product as well.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "108132504654968051319", "name": "Jonathan Warren", "time": 1472422405301, "rating": 5.0, "text": "Coming back in soon to buy a new gun!! Great customer service and great selection!", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "108713424258924150383", "name": "Alec Faucett", "time": 1453324151195, "rating": 5.0, "text": "SHUTUP BO! YOU CANT BASE A REVIEW ON A WHOLE STORE JUST OFF THEIR WEBSITE.\n\nTHIS IS A GREAT STORE! I WILL NOT BUY A GUN FROM ANYWHERE ELSE EVER AGAIN. SINCE THE DAY I BOUGHT MY FIRST GUN FROM THEM A FEW MONTHS BACK I HAVE BOUGHT TWO SINCE THEN AND AMMO. THEY HAVE KNIFES, SAFES, HOLSTERS ETC. THE OWNER IS A VERY NICE GUY AND KNOWS ABOUT ANYTHING YOU WANT TO KNOW ABOUT A GUN, AMMO OR ANYTHING ELSE TO DO WITH FIREARMS. HE WILL BE COMPLETELY HONEST AND TELL YOU EXACTLY HOW HE FEELS ABOUT A PATICULAR GUN, RATHER HE THINKS ITS A GOOD GUN OR A PIECE OF CRAP AND CAN TELL YOU WHAT TO DO TO IMPROVE ITS PERFORMANCE. HE DOESNT TRY AND LIE TO YOU JUST TO SALE YOU SOMETHING. HIS PRICES ARE GOOD AND HE HAS A LOT OF INVENTORY. IF YOU ARE A GUN COLLECTOR OR JUST GETTING YOUR FIRST GUN, WHATEVER IT MAY BE, I HIGHLY RECOMMENED THIS STORE.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "102794168431118472632", "name": "Sherilynn “Jazzy” Ivy", "time": 1499467478001, "rating": 5.0, "text": "Great deals! Very informative of inventory!💪💪💪", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "110084280145127445433", "name": "Matthew Patmon", "time": 1500930308933, "rating": 4.0, "text": "Great atmosphere and customer service", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "116581262973939460579", "name": "Steven Hayes", "time": 1521909532694, "rating": 4.0, "text": "Good folks friendly great price", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "104392181794534467819", "name": "michael crowley", "time": 1519936357117, "rating": 5.0, "text": "Good prices no pressure salesman", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "111332566862310214830", "name": "WSO 2017", "time": 1498674826132, "rating": 5.0, "text": "Extremely satisfied,  excellent customer service", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "117212706734490499365", "name": "Jay Painter", "time": 1572692223795, "rating": 5.0, "text": "Deals.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "114372475757912327262", "name": "Ginny Dunsirn", "time": 1508528268257, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "113016498441532587189", "name": "Ronald Jackson", "time": 1519048713195, "rating": 5.0, "text": "This place can get all my money.", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "111689821911175314429", "name": "William Parker", "time": 1507345601816, "rating": 5.0, "text": "Get'em here", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "111902812237417033895", "name": "BG Iradji", "time": 1429633027425, "rating": 5.0, "text": "Nice store.  Lots of inventory", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "105909891915588207607", "name": "Bo Crowder", "time": 1452065102240, "rating": 1.0, "text": "Website suxxx", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "106082195450710572714", "name": "Allstar Pool & Spa", "time": 1431032493198, "rating": 5.0, "text": "Alabama Guns and Outdoors is the place to go", "pics": null, "resp": null, "gmap_id": "0x8889240967635d65:0x75621554fe703fb4"}
{"user_id": "117865363158680407145", "name": "Craig Stiles", "time": 1611702590921, "rating": 1.0, "text": "Absolutely the WORST customer service I've experienced in my entire life! I purchased a new, still in the box home defense shotgun on Wednesday 1/20/21. That afternoon when I put the barrel on it. (it comes with the barrel off in the box) When I attempted to \"rack\" the pump action, it would not move, when I removed the barrel the forearm with the slides came off leaving the receiver in the gun. I immediately put the gun back in the box and contacted SWAT. I told them what had happened, asked if they had another gun of the same make and model in the box, and they said yes. I returned the gun on Friday 1/22/21, at which time, i was informed that I would have to ship the gun to the manufacturer at MY expense as a \"warranty\" issue. I questioned their definition of warranty, being the gun had never even had a shell put in it. They employee then said he would attempt to REPAIR the gun, and would contact me. I was contacted the next day and told it was fixed. I told him I was unable to come to the store that day, but would contact them the following Tuesday, because they're closed on Mondays. Not wanting an out of the box repaired gun, I asked for a refund, at which time, my request  refused and was hung up on by the store owner. I've notified my bank, have disputed the charge and will get my money back. The bank said they'll handle getting reimbursed from SWAT. Buyer Beware!!! I had to put 1 star before being allowed to post, but would had rated the a minus 5 if allowed!", "pics": null, "resp": {"time": 1611725728513, "text": "We are known throughout north Alabama (and beyond) for our excellent customer service, fantastic selection and low prices. Please read our many 5 star reviews and then come see us and decide for yourself. Thanks and Semper Fi!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "101091769344549289720", "name": "B G", "time": 1620409121986, "rating": 5.0, "text": "Great service and excellent staff to deal with. Good inventory.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "109106908883812849368", "name": "Jamie Lamb", "time": 1607221862998, "rating": 5.0, "text": "The guy that owns it is a Marine, and there are other workers who have served in some capacity.  They treat you like a brother, know their stuff about guns, and they have the best gun shop in the region.  I'll give only them my business in North Alabama.  I go often and have purchased many guns from them as well as ammo.  They also have an active Facebook page that is very up to date.", "pics": null, "resp": {"time": 1609214930700, "text": "Thanks Jamie, we appreciate you!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "113156006144970359948", "name": "Donnie Harville", "time": 1618367852972, "rating": 5.0, "text": "I love this storeGreat people And a great variety of firearmsAnd ammo", "pics": null, "resp": {"time": 1618422437063, "text": "Thanks Donnie! I appreciate the kind words!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "107818640577709038856", "name": "Clayton Kirchmar", "time": 1617740745251, "rating": 5.0, "text": "Great place. Great staff.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "112703371049767390173", "name": "Jennifer Palmer", "time": 1592315786066, "rating": 5.0, "text": "Daughter and I visited SWAT after going to 2 other stores. We were welcomed as if family. Willie suggested we handle and dry fire the pistols for comfort and weight. That night we went to the range and we practiced as he suggested.We are very pleased with our purchases and will definitely go back!", "pics": null, "resp": {"time": 1592321845139, "text": "Thank you so much! We appreciate the kind words. It's great to hear that you both are happy with your purchases!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "100282999942503002253", "name": "Jason Sharp", "time": 1603140648931, "rating": 5.0, "text": "The people are knowledgeable, friendly and really took care of me and my wife.", "pics": null, "resp": {"time": 1603158388957, "text": "Thanks, we really appreciate you both!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "113880314745689888600", "name": "Zach Atchley", "time": 1603562965337, "rating": 5.0, "text": "Great people and great selection. Knowledgeable staff.", "pics": null, "resp": {"time": 1603589153281, "text": "Thank you so much, we appreciate you!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "111863896705211516199", "name": "Christopher Duda", "time": 1599757010808, "rating": 5.0, "text": "Best store in town, awesome prices and even better people!", "pics": null, "resp": {"time": 1599824170383, "text": "Thanks Chris, we appreciate you!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "102751840336041609948", "name": "Shawker 71", "time": 1584800506452, "rating": 5.0, "text": "Great prices on guns, ammo, gear. The staff is really helpful and all around just nice. I make it a mission to stop here when I pass through Killen.", "pics": null, "resp": {"time": 1592321976984, "text": "Awesome, thanks!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "117124315792608836499", "name": "Trula McMickin", "time": 1573254110975, "rating": 5.0, "text": "I LOVE SWAT! Friendly staff, great prices. So different from some places I've been to where they think just because you're a woman you're not interested in guns. Would recommend them to anybody (and have)!", "pics": null, "resp": {"time": 1573432126284, "text": "Thanks Trula!! We really appreciate you and your support!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "105752339908310160412", "name": "Wayne Mccalpin", "time": 1581220518531, "rating": 5.0, "text": "SWAT is by far the best gun store in Lauderdale county.!\nIt is the only gun store I know of where I can actually touch the guns without having to ask an employee behind a counter to assist me.\n( Their great security camera system allows for better customer access to guns )\nAmmo prices stay close enough to the lowest prices available on the internet that its worth a couple bucks to buy the case of ammo local.\n\nEvery gun owner in this area should Support this Local gun store..!!", "pics": null, "resp": {"time": 1581371420790, "text": "Thanks Wayne, I appreciate you!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "116295984819591509200", "name": "Alan Conner", "time": 1562114927630, "rating": 5.0, "text": "Awesome place!  The only gun shop I have ever been in where you can pick up any gun in the business to examine & get a feel for it.  A great selection of firearms to choose from.  Great prices on firearms as well as clearance & regular stock ammo.  Very friendly, knowledgeable & professional staff.  This is for sure a military & veteran friendly store!  I was very pleased with a few trade ins I have made in the past.  I have referred many people to SWAT Guns & Ammo during the past few months.  I will definitely continue to do business with these guys.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "101421044749911857113", "name": "Jastin Allen", "time": 1580821686316, "rating": 5.0, "text": "Great customer service, nice beautiful selection of guns and accessories , even won a gun on customer appreciation day", "pics": null, "resp": {"time": 1581371459437, "text": "Congratulations on your free gun!! I appreciate the kind words!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "108204401050753210780", "name": "Jacob Simpson", "time": 1521323735098, "rating": 5.0, "text": "Awesome prices. Very nice selection on AR15 parts and rifles. They don’t price gouge on trade ins either, fair trade in prices. Have the weapon system that I was looking for in stock and at a good price. Will definitely be doing business here again!", "pics": null, "resp": {"time": 1549476869718, "text": "Thank you!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "116862650146360952659", "name": "Robbie Hill", "time": 1569698880420, "rating": 1.0, "text": "Will never go in this place again. Said they couldn't legally sell me a gun because I had a disorderly conduct over 10 years ago. I also have a pistol permit lol", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "113740456492833063033", "name": "Mark Denton", "time": 1550323921030, "rating": 5.0, "text": "I went in yesterday for the second time and was greeted by a familiar face.  If anyone needs any work done they have a walking gun encyclopedia who happens to do some great gunsmith work on staff now. Good to see him working again and not just hanging around pawn shops!  Their selection is pretty good and very diverse for such a small store, there are lots of cool old & new guns to choose from.  The only downside is that they're so far away from where I live in Russellville but IMO the trip is well worth the drive to get some competent counter service for a change.  Before I had to go all the way to Larry's to get an honest opinion on a gun but now I can just go to SWAT.  A+++ I'll be back and I'll bring friends!", "pics": null, "resp": {"time": 1550335448708, "text": "Thank you so much, we appreciate you!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "104559509770891278769", "name": "C J", "time": 1552012271390, "rating": 5.0, "text": "Can't comment on their prices really (which seems to be the only negative thing i've heard about this place based on these reviews) but I personally really like this store. Every time I've been in to buy ammo (which is very fairly priced) I've been greeted by super friendly people. I went in today and it was my first time in since they've \"expanded\" their shop, and it was a surprise to me how big the selection was. Tons of pistols especially, and I like the way they have everything laid out so the consumer can handle it without having to bother employees to get each gun out of a case. I haven't purchased a gun here (mainly because they didn't have a large selection last time I was in) but now that I've seen the new shop, I'll definitely be back to pick up something (other than ammo). Other shops should especially take notes on the friendliness in this store.", "pics": null, "resp": {"time": 1552148748024, "text": "Thank you so much for the kind words! We appreciate you!! Our selection is constantly improving and we work hard to have the best prices around. Thanks again!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "110453510387384596923", "name": "aubrey butler", "time": 1593017080001, "rating": 1.0, "text": "Store claims to be open and wasn't had to make extra trip back. Buyer be ware save time and money and go elsewhere, I know I will never go back here again.", "pics": null, "resp": {"time": 1593027032437, "text": "Our hours are clearly posted on our FB page. We are open Tues-Sat and are closed Sunday and Monday."}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "102094878047048272663", "name": "Marco Villarreal", "time": 1573286211241, "rating": 5.0, "text": "Good people, good store, good guns, good price. All around good store!", "pics": null, "resp": {"time": 1573432094605, "text": "Thank you so much! We appreciate you!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "106616120167300830059", "name": "Amy Elliott", "time": 1573514016402, "rating": 5.0, "text": "Super friendly staff, great selection and awesome prices!", "pics": null, "resp": {"time": 1573520074676, "text": "Thank you so much!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "104678918878389982160", "name": "Jim Murphy", "time": 1573413802019, "rating": 5.0, "text": "Great place, great prices, always friendly and helpful.", "pics": null, "resp": {"time": 1573431959531, "text": "Thanks, we really appreciate it!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "108828290179878168618", "name": "Jarl Balgruuf", "time": 1527366109514, "rating": 5.0, "text": "Always friendly and good to deal with. Been shopping there since they opened and will continue to do so! Great prices and great selection.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "105551872228246207242", "name": "Jesse Jacques", "time": 1549404776711, "rating": 5.0, "text": "Great selection friendly faces make for an excellent gun shopping experience. Highly recommended.", "pics": null, "resp": {"time": 1549476381044, "text": "Thank you!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "112607613334800186858", "name": "Cory Clower", "time": 1553781499915, "rating": 5.0, "text": "Grate guys and good deals shout out from Texas. Thanks", "pics": null, "resp": {"time": 1553784435181, "text": "Thank you so much!!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "107268399125713671263", "name": "W B", "time": 1573930353616, "rating": 5.0, "text": "Awesome prices on ammo and gear", "pics": null, "resp": {"time": 1581371477677, "text": "Thanks Travis, I appreciate it!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "111474473575473566667", "name": "Nick Hall", "time": 1545725337807, "rating": 1.0, "text": "They will try to low ball you on a trade in and then lied to my face saying they can get a NEW Glock 17 for $410. I will gladly take my business else where and will not refer anyone to this place again. Complete slap in the face for what they wanted to give me for my Glock. Plus they were rude.", "pics": null, "resp": {"time": 1549476791462, "text": "This is factually incorrect and I have a store invoice to prove it. To anyone that has not yet come by to visit us at SWAT LLC, please do so and you will find that we offer friendly customer service, a fantastic selection and awesome prices. The fact that our business is growing so rapidly and most of our new customers find us because of word-of-mouth referrals speaks for itself. Thank you and have a great day!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "105982997880577818179", "name": "Ha Ha", "time": 1520639906835, "rating": 5.0, "text": "Great people, will do business with them again. Prices are competitive with big box stores.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "117688766491927569893", "name": "brad jackson", "time": 1524687822833, "rating": 5.0, "text": "The staff really know their stuff, always friendly and ready to help.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "105592341312961160407", "name": "Jerry Apple", "time": 1531940490083, "rating": 5.0, "text": "Great selection, great prices, great service, and great people!!!", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "100983668533120184292", "name": "Rj Walters", "time": 1501103955035, "rating": 5.0, "text": "Very nice little store they have good sales on bought a Taurus 9mm pistol very happy with it if I need another gun that's where I'll buy it", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "109156799523773414861", "name": "Thomas Tucker", "time": 1527514680601, "rating": 5.0, "text": "Good prices, good customer service, no reason not to go.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "112272842147009670406", "name": "Justin Baker", "time": 1507846820269, "rating": 5.0, "text": "Staff was friendly and helpful. I will be shopping here again.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "108735722694437648345", "name": "jimmie fry", "time": 1573317109466, "rating": 5.0, "text": "No other place better for all your guns and shooting  needs.", "pics": null, "resp": {"time": 1573432022278, "text": "Thanks Jimmie! We appreciate you!!"}, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "112550440618100338145", "name": "Jay Forsythe", "time": 1498327889106, "rating": 5.0, "text": "Awesome place to go. Great prices", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "109756370447172660013", "name": "James Someone", "time": 1499534285217, "rating": 5.0, "text": "Great folks to do business with and great prices.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "111144724841406479865", "name": "Brandon Lawson", "time": 1479871040715, "rating": 5.0, "text": "Great prices good service intelligent people :)", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "105209570884745324954", "name": "Johnathon Davis", "time": 1503797683661, "rating": 5.0, "text": "Awesome place. Definetly going back", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "100954557761170861793", "name": "Kagen Bratcher", "time": 1483556314635, "rating": 5.0, "text": "Good prices and great gear with good help", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "105787410224413460095", "name": "Alan George", "time": 1496850104008, "rating": 5.0, "text": "Knowledgeable, friendly, and great prices. $25 fro transfers also.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "106334232427354984331", "name": "Barry Cox", "time": 1528346593185, "rating": 5.0, "text": "Great store, knowledgeable staff, good selection", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "100212424802804494854", "name": "Jamey Brown", "time": 1513454295706, "rating": 5.0, "text": "Best place to buy a gun", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "114788894109054931602", "name": "Greg Alexander", "time": 1502143797116, "rating": 5.0, "text": "Cheap ammo prices", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "106149481320602707373", "name": "Randy Smith", "time": 1498780038841, "rating": 5.0, "text": "Very good!!!", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "117500878976459632538", "name": "Jojo Hoho", "time": 1513966983823, "rating": 1.0, "text": "Very high prices.", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
{"user_id": "109327694526804764021", "name": "Josh Gargis", "time": 1488640784580, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8862ca23d169dc9d:0x6c3d1b1723f5cdd5"}
