{"user_id": "118074093143002181740", "name": "Stephanie Marche", "time": 1615578184566, "rating": 1.0, "text": "When Dr Long left, the clinic lost the ONLY part that was professional, ethical and helpful. I've never encountered a medical establishment that cared less about helping patients. Their ONLY concern is making money. There is no attempt made to listen to, help or BELIEVE the patients have actual pain. They treat everyone as though they are just drug seeking. Dr. Long is greatly missed, by me at least.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "108785288456131566803", "name": "Gerald Smith Sr", "time": 1626742420047, "rating": 3.0, "text": "A little crowded a bit of a wait but everybody is friendly they prepared to sit a minute", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "117903407449651214713", "name": "Mike Reid", "time": 1622677121847, "rating": 1.0, "text": "DO NOT USE IF YOU HAVE MEDICAID. THEY WILL USE ALL YOUR OFFICE VISITS, THEN CHARGE YOU $125 A MONTH JUST TO GET YOUR PRESCRIPTIONS. COMPLETE RIPOFF.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115191111317732069006", "name": "tashera chisolm", "time": 1583348766081, "rating": 5.0, "text": "The staff here is very nice and I always get great information regarding my options. The staff is always pleasant and patient. I get to participate in my care and treatment which makes me feel like the provider cares about my health. Everyone always treats me with care and the process for appointments is smooth.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "117558060716288408130", "name": "LaTanya Jackson", "time": 1595546154563, "rating": 5.0, "text": "Very good practice but we really miss Dr. Long😔. Nurse Kitty is so sweet, she goes out of her way to make sure everything is correct. Wouldn't want to go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "111973061347433660298", "name": "Lisa Jones", "time": 1598900286410, "rating": 1.0, "text": "The Dr are great but you get in faster than you can check out time in 26 mins to get out took 45 mins sad", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "112313471370250136443", "name": "Melissa Bates", "time": 1569583856395, "rating": 5.0, "text": "Excellent care by compassionate physicians and medical professionals! Dr. Shinkle has a great bedside manner and is very skilled at performing various medical procedures. I could not ask for a better group of kind professionals to trust with my care. You are most definitely in good hands here.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "108762704474877331241", "name": "mark riendeau", "time": 1566489900374, "rating": 5.0, "text": "This review was asked of me, but honestly it’s my honor to compose! In 2008 I was injured and sought medical treatment for lower back pain. Upon several months of on going Dr visits and treatment I was unfortunately forced to undergo Two lower back surgeries which although did not rid my condition completely it did allow me to walk again and I chose to undergo Pain Management with the Center of Pain under the treatment of Dr Herrick. For the past 11 years I have seen Dr Herrick and he and his staff have provide a borderline comfort to ease my pain and give me my life back. Within these past 11yrs I have had to relocated south of his office in Montgomery to Gulf Shores which is roughly 175 miles and again to North Alabama roughly 200 miles away. Being unable to live a life with my family without suffering from daily pain. I am at The mercy of medical treatment. But Being so far away from the Dr Herrick I had to make a simple choice to find a new Dr or travel the 3hrs to continue treatment with the Center of Pain under Dr Herrick treatment. I have had one other Dr in the past 11ys administrate a Epidural to my lower back and I was not satisfied with the treatment nor did this Procedure help my pain. I wish not to speak bad on any other Dr or Pain Management Clinic but for me I have never had one bad experience or visit during my time with the Center of Pain. The staff has always gone above and beyond their means to ensure my visit and treatment has provide relief to my symptoms. Dr Herrick has always been understandable and provided a course of relief for me weather it be medication or procedure Epidurals. If you are suffering from daily pain and currently are seeking help please schedule a appointment  with The center of Pain/Dr Herrick and experience a quality medical facility", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "106576859022738108747", "name": "cheron fryer", "time": 1563457488114, "rating": 1.0, "text": "Have been seeing Dr. Long for over 3 yrs. and I'm aware nothing is 100 percent but there has not been a remedy to work in this length of time.   He listens but makes no effort to try a better treatment plan.  When he sent in his nurse practitioners, they were never accurate on info from my records there.  Just Lying for more money has been their specialty, BEWARE !!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "103702634994742198236", "name": "Barbara Lay", "time": 1583337340999, "rating": 5.0, "text": "I appreciate the kind attitudes of the workers  here at the center for pain. It means so much whenever  we come in with pain. The pain business  will really be growing.  I know  this one will be one of the first. Thanks guys.😁😁😁", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "109754346396732601475", "name": "Gail Netherland", "time": 1569687197134, "rating": 5.0, "text": "I have been going here for about fifteen years, I have been to this location and the Baptist South location.  Dr Herrick is a great doctor who takes time to listen, his only drawback is that he is an Auburn fan, but I keep working on him.  All of the staff are friendly and goes out of their way to make sure the patients are comfortable.  It’s like seeing old friends every time I go.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "105832114474948527732", "name": "Jennifer Turner", "time": 1575651795022, "rating": 5.0, "text": "Dr Herrick is an amazing Dr; he listens, remembers, and he really cares. I highly recommend Dr. Herrick and his staff! They are all very courteous and professional.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "100274501202212599170", "name": "Laura Coker", "time": 1568232640646, "rating": 5.0, "text": "Dr. Katz is hands down the absolute BEST doctor ever! His procedure room staff is very professional. The entire office is amazing! Immediate relief upon leaving the office. I would totally give this office a 5 Star ever visit!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "101745568124963895166", "name": "Cheryl Owens", "time": 1569335254197, "rating": 5.0, "text": "This is the best place in the world to me, they are the nicest staff of medical representatives that any Doctor's office could have, they are a perfect team. Dr Herrick is nice, he has awesome bedside manners🙂🙏🏾❤️", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "112702218263144080079", "name": "Mary Griffith (Bradon's Memaw)", "time": 1569253781006, "rating": 5.0, "text": "This is a great place.  Understanding staff who have great attitude.  Caring people who treat you like a human not a number.  Kudos to Dr Katz and staff for putting me at ease", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "118182598775601026459", "name": "Joelen Vaughn", "time": 1583330695194, "rating": 5.0, "text": "I've been coming here for about a year for injections and I've always had excellent care. The staff is attentive to all of my needs and I appreciate each of of them and Dr. Shinkle!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "104538910696474253624", "name": "Karen S", "time": 1566481893591, "rating": 4.0, "text": "Staff very nice and willing to listen. Procedures have been done timely and for me successful. Dr. Herrick worked with me on my pain areas. I’ve been very please with my procedures.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "107241434544228313122", "name": "Sandy Lee", "time": 1613129337458, "rating": 5.0, "text": "Get you in and out quickly", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "102245321052978012884", "name": "Becca Scott", "time": 1605186521729, "rating": 5.0, "text": "Any place that gets me out of pain deserves as many stars as possible.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "101803397984568367845", "name": "Darleen Evans", "time": 1569520815705, "rating": 5.0, "text": "Very friendly staff.  Never have to wait to be seen.  Every visit they have been so nice.  Comfortable waiting area.  Dr. Shinkle has helped my back pain.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "116092264319863587518", "name": "Rosa Chung", "time": 1568991460267, "rating": 5.0, "text": "I’ve been seeing Dr Katz for years and they ya e always treated me with utmost care consideration and empathy. The staff is always helpful and attentive. Will keep seeing him for all my chronic pain issues.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "100054676806771764592", "name": "Rosalind Harris", "time": 1569523962038, "rating": 5.0, "text": "This office is the greatest the staff is friendly and caring. Dr. Shinkle really knows he's profession I am doing much better. I recommend everyone to visit the Montgomery office if they are having pain.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "105822773532801652762", "name": "Karen Weatherly", "time": 1568996003690, "rating": 5.0, "text": "Nurse Kimberly is fabulous, loving and patient.\nEvery one there is wonderful and extremely professional. They have the patients’ needs at heart!!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115000387020744668762", "name": "Greta Koch", "time": 1573747705643, "rating": 5.0, "text": "Dr. Herrick and his staff are wonderful!! I live in Daphne and drive to Montgomery because Dr. David Herrick is the best!! I have been a patie9 20 years! Thank you to Dr. Herrick and his awesome staff!💗", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "109620579417759324398", "name": "Donald Merritt", "time": 1569245003391, "rating": 5.0, "text": "I've been working with the East location for several years and they are awesome. I'm always in and out very quick. If you need pain management they are highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "114504649731253085742", "name": "Pete McCoy", "time": 1569266182200, "rating": 5.0, "text": "Dr. Katz and his staff are great! They are always friendly and are truly concerned about my well being.  If you suffer from neck or back pain, this is the place to come for relief!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115556915509721837478", "name": "Angelia Bacon", "time": 1567098249853, "rating": 5.0, "text": "Excellent treatment. LOVES the staff! Would recommend to family and friends! Love Dr. Vella. So compassionate.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "117727372289062867715", "name": "vanessa rhodes", "time": 1568235651138, "rating": 5.0, "text": "Dr Katz and his office staff are wonderful. He takes care of both my husband and I.  We both highly  recommend them. Oh and his procedure room nurse is the best!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115748647875781773507", "name": "Angela Rouse", "time": 1572546812090, "rating": 5.0, "text": "Staff are wonderful, so professional but friendly. They are always ready to help with whatever I need.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "107636886924264833990", "name": "Lakenia Williams-Rankins", "time": 1566504118555, "rating": 5.0, "text": "I have only had great experiences at this facility! The staff is awesome  and Dr Herrick rocks! I would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "110322489712328582799", "name": "Cynthia Crosby", "time": 1569526657986, "rating": 5.0, "text": "I had a cervical epidural procedure at The pain center at East. The staff was awesome! Dr. Shinkle was stunning! I obtain good relief from my procedure! I recommend him to all for pain management!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "109458272379609130752", "name": "Marilyn Barnes", "time": 1567090803967, "rating": 5.0, "text": "Dr Vella is a really sweet man. Very concerned about you. Great bedside manner. Staff is really helpful!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "116762983931099797003", "name": "Sherry Stoffo", "time": 1569254780277, "rating": 5.0, "text": "Dr katz and  his staff are awesome!\nThey take great care  of me. Always make me feel better!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "102395551862352117218", "name": "Cathy", "time": 1578518833676, "rating": 5.0, "text": "The employees are so wonderful, front desk is great and my IV nurse is amazing! I wished I could take her home with me!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115869009515447935371", "name": "Shelley Crews", "time": 1569248276199, "rating": 5.0, "text": "Great job getting IV in!  They always listen to me when I am explaining what my issues are and take good care of me. Dr. Katz and the staff at the Center for Pain are wonderful.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "107806375888455725861", "name": "Sarah Jenkins", "time": 1570049105313, "rating": 5.0, "text": "The center for pain is a wonderful establishment. The doctors and staff are very friendly, courteous and thorough! I would highly recommend them for patients with neck and back pain.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "114177924052847321602", "name": "Evette Mccall", "time": 1570026272799, "rating": 5.0, "text": "I love this office dr. Shingle is an excellent doctor I never have a problems when I come to my appointments & the staff is amazing always smiles & willing to comfort u while you’re there I won’t change nothing bout this office", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "113880681953937928314", "name": "Sophia McDonald", "time": 1569340440989, "rating": 5.0, "text": "I had my injection and it lasted a year! Wow! A year with very little pain. Thank you Dr. Herrick and his wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "105733514477657331696", "name": "Allen Robinson", "time": 1563289555503, "rating": 5.0, "text": "Good Doctors & staff. Sometimes they are shackled by the FDA but they DO listen & care. Have been seen for both my wife & myself. Remember it is called a \"practice\" because everyone & problems are different,it takes practice to really help.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "111063332913568824911", "name": "Becky Wheat-Hassel", "time": 1569243560751, "rating": 5.0, "text": "Dr. Katz and his staff are amazing! I have been seeing them for 9 years and I couldn’t function in daily life without them. I highly recommend seeing them if you are experiencing pain daily.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "109946612017981819844", "name": "Katie McWaters", "time": 1570023621117, "rating": 5.0, "text": "Wonderful disposition and he cares about his patients. Love the help I've received by him.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "103573276867206492890", "name": "Crystal Benjamin", "time": 1570018157178, "rating": 5.0, "text": "Doctor Shinkles and his staff is very nice. There is never a long wait. They get you in and out as quick as they can. I would recommend anyone that has any type of long-term pain to come see Dr. Shinkles and his staff at the Center 4 Pain.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "112421563046746229180", "name": "Jinny Craig", "time": 1583347154902, "rating": 5.0, "text": "I absolutely love Dr. Shinkle and his entire staff!  My pain is finally managed!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "103989638414703896220", "name": "Debra Price", "time": 1578423091221, "rating": 5.0, "text": "Great staff, friendly, personable and caring.\nDr. Katz is awesome!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "116457283599939331004", "name": "Mary Jeffreys", "time": 1567689913143, "rating": 5.0, "text": "The Center For Pain PRATTVILLE location Rocks!!! Why? I have taken my mom to other pain management centers and the experience was terrible. Our experience with the PRATTVILLE location has been nothing less than exceptional! They have a streamline system that works well. You are in and out. Although they're busy you don't see or feel the hectic chaos the could occur. The entire staff is extremely organized, nice and sympathetic  from the front door to recover. They have been able to get my mom's pain to a tolerable level, allowing her to enjoy day to day simply activities. Thanks so much Dr. Aaron Shinkle and staff! If you or your loved one is hurting, please, please give them a try. You will be glad you did. Stay blessed!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "107860496614456741717", "name": "Sharon Venable", "time": 1569427009292, "rating": 5.0, "text": "The staff are professional and friendly! I love Dr. Herrick! He is wonderful.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "100997532060328357863", "name": "Angeline Dubose", "time": 1570024754228, "rating": 5.0, "text": "Dr. Shinkle n the entire  staff here at Center for  Pain are very nice , caring and supportive  I would like thank you all for everything y'all  do", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "105906202124018592700", "name": "Chris Gatlin", "time": 1570021596238, "rating": 5.0, "text": "Dr shinkle has pain relief down to an art. I am getting great relief to my back and legs. Highly recommend him and the center for pain.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "107286400925233786682", "name": "Jane Kennett", "time": 1567701384110, "rating": 5.0, "text": "I had a visit with Dr. Shinkle’s  nurse practitioner today.  As usual, she was very kind, and was truly interested in my pain issues.   The staff is very friendly and helpful.  Whenever I have had a procedure, Dr. Shinkle’s nurse always takes time with me as she is starting the I.V.   Dr. Shinkle always talks to me before beginning any procedure.  I go to the Prattville location.   The injections and/or ablations have helped me avoid further surgery, and keep me on the tennis court.  Additionally, when I have a sudden pain issue, I can call the office, and they set up an appointment for a procedure immediately.    I would recommend this practice to anyone who is dealing  with pain issues.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "113824000665368422317", "name": "Stephanie McCormick", "time": 1520980674523, "rating": 5.0, "text": "THE CENTER FOR PAIN\nDr. Shinkle and his caring, friendly staff will WELCOME you and work WITH you to figure out your special needs.\nYou're always the center THEIR world!!\n\nBut, you have to reach out for help first. You don't have to suffer in silence..... they will take THE VERY BEST CARE OF YOU!! 🏅🥇🏆🎯\nWithout this place...their wonderful people- MY  life would just be unimaginable!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "108859147674128399459", "name": "William Wyatt", "time": 1569336423074, "rating": 5.0, "text": "I have known dr herrrick for several years , both privately and professionally both dr herrick and his entire staff are fantastic  I would highly recommend him and his practice to anyone experiencing back pain", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "102980097408930265857", "name": "Kimberly Holmes", "time": 1572613994633, "rating": 5.0, "text": "The best staff! They really do care.\nThey have helped me so much with all the pain that I have going on in my back, and down my legs.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115349584311582268527", "name": "Allen Garrett", "time": 1566479446720, "rating": 5.0, "text": "Dr Hedrick and his staff are outstanding they help my mother and myself.   They are the place to go if you want a quaily it’s experience.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "106719071726347327391", "name": "Nince Knight", "time": 1575565142061, "rating": 5.0, "text": "My family at dr shinkle is the an my iv nurse is always all. Way some", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "111221341797687527580", "name": "SYTILLIA CARLISLE", "time": 1567085079179, "rating": 5.0, "text": "Dr Vella and his staff are wonderful ! Taking great care of me! Anyone with back problems go see them!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "116114676247835352805", "name": "Clarice Tabb", "time": 1570022016748, "rating": 5.0, "text": "Dr. Shinkle and the staff at The Center for Pain has been so great during my process. The staff is beyond friendly and Dr. Shinkle knew exactly what to do for me so that I may avoid having surgery.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "117354383327247897957", "name": "Rebecca Knowles", "time": 1567088301563, "rating": 4.0, "text": "Dr Long and Dr Vella both take great care of me! Listens well and remembers  the last conversation we've had!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "116659382526507074529", "name": "Tara Walker", "time": 1568989894474, "rating": 5.0, "text": "Staff is awesome!  SO friendly and helpful...", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "110460966668311670029", "name": "LeAnne Fulmer", "time": 1567689869707, "rating": 5.0, "text": "Seen in Prattville location, love the staff, they are wonderful.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "106016698303005996303", "name": "pam kervin", "time": 1552138022724, "rating": 1.0, "text": "Went too see Dr: Herrick 3 times. He said 1 sentence to me. Never told me what he was doing or what my prognosis was. If you like being herded like cattle he is the doctor to see. Rude with no personality.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "117118698582919021681", "name": "Julie Dickey", "time": 1547160874721, "rating": 3.0, "text": "Jan 2019\nNew pt visit with Dr. Herrick who's kind & tries to find a way to fix your pain problem. Was a unorganized visit with staff coming in & out of exam room including MD. Not sure why he had to leave each time.  Doesn't seem like he was able to come up with a plan today. I've got an inoperable problem & I've been to so many doctors in î  & Atlanta Georgia with no one knowing how to k k the>& use it properly are paying a high price with our quality of life. The walls in this was8MD's office are pasted with 11x8 peices of printer papers stating things about their rules, laws, business & more rules & regulations if u take any pain medication. Upon this being my new patient visit I was not impressed  my visit today especially as was directed to exit ... & btw stop at Lab 1st for a drug test. What? I've gotten no scripts from this MD, no thx plan, no instructions, no answers ... and yet they want a drug that I'll have to pay for if my insurance doesn't cover it. I could see if I was receiving care, medicine, treatment from MD, but for a consultation? I don't care about the test, I know I'm clean, but it makes u feel like your not trusted, dirty, bad person... just brings u down.  I understand why there's a need, but it could have either been omitted or instructed better instead of here being handed a cup, told to leave your purse, coat, & anything else outside of bathroom that u don't even have a sink to wash up until u open door & use community sinks.  So to sum it up... it was just a  okay visit that had opportunity to have been much more. I've got to come back so maybe next time more will be like Sarah a sweet & friendly med tech who made me feel welcomed. No one was mean, ugly, or unkind to me.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "104232198418800272963", "name": "Jamillah Rasheed", "time": 1547483800647, "rating": 1.0, "text": "Dr. Jones  has to be the worst doctor I have ever had to see.  I was injured on the job and was sent to him. He only cares about workers comp and their money. He does not care about the injured worker.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "105158908968983752241", "name": "bennie tarleton", "time": 1569520909664, "rating": 5.0, "text": "Dr Shinkle and his staff are wonderful.You can tell they really care about your problem.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "109508350487541004774", "name": "Delores Lawson", "time": 1567091819951, "rating": 5.0, "text": "Love the staff and doctor for excellent service.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "104679436024355315981", "name": "Tina Stark", "time": 1525984741681, "rating": 1.0, "text": "Worst doctors I have ever been to. Moved from Pa and these doctor did not continue the type of care I was receiving there. Put me on a low dose of pain pills for chronic psin that I hsve due to a sevre injury. Some says I hsd to increase meds so ran out before I seen them. When I went to my appointment instead of listeni g to my level of psin and why somedsys I had to take extra to get through day mind you I was taking a much lower dose than I was taking in Pa. I have asthma and they prescribed a patch thats side effect is a serve asthma attack. When I addressed them they acted like it was no big deal and said I was to use it anyway. If you value your life and you don't want to be treated as if you are a criminal do not go there", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115068391004612305441", "name": "Jennifer Sexton", "time": 1572471425315, "rating": 4.0, "text": "Great staff and Dr Shinkle is wonderful!!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "101342984072889149204", "name": "shug Cole", "time": 1566479016506, "rating": 5.0, "text": "I have been with Dr Herrick for over 14 yr the  staff have been so amazing to me , thank so much center of pain , for helping me.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "111295169038079082906", "name": "Terri Adams", "time": 1547406656078, "rating": 5.0, "text": "Love Dr. Katz and his staff.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "117658027747721195439", "name": "Sandra Hardy", "time": 1569333297639, "rating": 5.0, "text": "Great service.Great bedside manner.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "113422958803476326601", "name": "Christina Persails", "time": 1567086713467, "rating": 4.0, "text": "Loves Dr Long and his staff!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "116718120740854727629", "name": "Wendy Painter", "time": 1493665793938, "rating": 5.0, "text": "Dr. Katz is an awesome doctor.....love the staff!!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115040403245581732102", "name": "Sonya Griffin", "time": 1570020493954, "rating": 5.0, "text": "Great staff and service.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "115340296409318996989", "name": "Ernest Taylor", "time": 1516116434963, "rating": 1.0, "text": "Worst doctors to ever visit no concerns on patients only about money.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "100168799920532741536", "name": "Gina", "time": 1516643839660, "rating": 5.0, "text": "Dr Katz and his staff are amazing.", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "107635310790005495250", "name": "Joe Rutland", "time": 1601776937742, "rating": 4.0, "text": "Professional!", "pics": null, "resp": null, "gmap_id": "0x888c2c063e9bc2b9:0xf54a7947f1a8742"}
{"user_id": "111675318506067807008", "name": "Sierra Washington", "time": 1568961235978, "rating": 1.0, "text": "I came to the ER after a spider bite that left me with a fever, swollen arm, and abdominal pain. The nurse who saw me had terrible bed side manner. Every time I asked him a question about treatment or medication, I was left confused. After the doctor left out, I had more questions and when I asked about why my arm was so swollen or why my stomach was cramping so badly,  I was told if I talked to the doctor then, ”that’s it.”\nAll I wanted was to get a more detailed answer about treatment after I left. After the doctor left out the room, I had questions about how the spider bite would affect other medical issues I was currently having. His answers were very short and left me confused. I refused a pain medication because of a reaction I had once years ago and its like from that moment I was treated like a junkie who was their for drugs. I left in so much pain. I think it was only because I refused the first medication that they were thinking I wanted a stronger medication. I didn’t! I just did not want to leave itching from the one they offered.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "115240863612205021514", "name": "Ray", "time": 1533314114756, "rating": 2.0, "text": "My son broke his leg during football practice.\n\nI had excellent experiences with St Vincent's before; so I opted to take him to their ER.\n\nI found out quickly no one was in any interest to help.\n\nI got the wheelchair on my own, loaded him in the wheelchair and admitted him.  I am strong enough to move my son but the addition of a broken leg (the tibia was split in two) brought on new challenges to transfer him from the car to the wheelchair.\n\nThe security guard made sure to let me know after he was admitted that I needed to go park my car in the parking lot.\n\nWhat followed later were several hours of nominal care:  x-rays, splints and waiting.\n\nNothing appalled me.  It was just doctors, nurses and other employees going through the motions.\n\nIt's just a job.  Who cares, right?\n\nAfter getting a splint and shot for the pain, we started to leave.  Did I get help with my son back in the car?  nah.\n\nOn the way to billing, the nurse says \"you got this, right? I got somewhere I got to be.\"  I answered \"yeah\" because why make an effort now? ¯\\_(ツ)_/¯\n\nIt's nothing short of comical because I constantly read nurses bragging about themselves on social media.\n\nI checked out my son, rolled him to the doorway (mind you, he has been given a shot for pain so kind-of out of it), left him to get my car and put him in.\n\nAfter transferring him back to the car, the security guard walked out in what I thought was a halfhearted attempt to help.\n\nBut no, he was just coming to get the wheelchair.\n\nSo, have fun at this ER.  If expect nothing more than the bare minimum, you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "115539632273771283814", "name": "chad tague", "time": 1559055863237, "rating": 5.0, "text": "Dr Mills and RN Savannah were attentive and helpful. It was obvious they cared about my well being.  Hopefully my arm heals faster than expected!", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "109674273533839750993", "name": "Kyndall Frankln", "time": 1527668589502, "rating": 1.0, "text": "Worst ER ever. I recently went to Grandview ER on 280 and it was 10x better. Took my boyfriend to St. Vincent’s because that’s where’s he wanted to go and it took us 30 minutes in a room before we even saw anyone, then was told they would get an IV started and sat for another hour... STILL no IV. Slowest staff ever. You’re way better off going somewhere else than to this ER.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "107631572583430928917", "name": "Alabama Jenny", "time": 1580163060383, "rating": 5.0, "text": "I've had my children here, and three surgeries. I love this hospital for many reasons but mostly it's dedication to patients and staff that truly care about human beings. They are one of the last hospitals that is Christ centered, with Crucifix displayed in each room and throughout the hospital. It is located near UAB and downtown near Lakeview District. There are plenty of places very close within walking distance to eat for visitors or family and love ones waiting on surgery. There's also a Starbucks located within the hospital. They have a cafeteria and a bistro with great food and selections for everyone and any diet. God bless St. Vincents Hospital the doctors, nurses, patient care assistants and event the transport staff that escort you to your car on discharge. Everyone is friendly and caring. Thank you for being there.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "116640537881145848155", "name": "A Bibb", "time": 1524321240531, "rating": 1.0, "text": "Absolutely the worst ER!!! Staff was extremely rude and acted like they could care less what the patient was there for. Would not recommend this hospital to anyone I know.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "105642830726414390416", "name": "Nate Carr", "time": 1525229847105, "rating": 1.0, "text": "Terrible customer service. Hospital has gone downhill BIGLY.\n\nNothing about St Vincent’s is worth a visit. Any other hospital would be a better bet.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "115213440179646206838", "name": "Gator Bait", "time": 1525229956253, "rating": 1.0, "text": "Call any ER, and ask for wait times... any other hospital will have shorter wait times.", "pics": null, "resp": null, "gmap_id": "0x88891bc9969ae5a1:0x6fd3f8b7d99022de"}
{"user_id": "112360566581967807357", "name": "Eleanor F. Wright", "time": 1594688548865, "rating": 5.0, "text": "Dr Nesbitt has been my Dr for over 11 years. He means the difference in the quality of my life. He is a great  person and Dr.", "pics": null, "resp": null, "gmap_id": "0x88891bc9ef5259fb:0xa78c1a0a8b036ec8"}
{"user_id": "110978564559217196946", "name": "Karen Berry", "time": 1519321256045, "rating": 5.0, "text": "I've seen Dr. Nesbitt through the years. I could not have asked for a more caring, concerned God fear Doctor or staff.  They are Always willing to help with your pain needs. Can't Thank them enough for getting me out of pain. The best bed side manner out there. He really has great concern for his patients.", "pics": null, "resp": null, "gmap_id": "0x88891bc9ef5259fb:0xa78c1a0a8b036ec8"}
{"user_id": "113216558969613168971", "name": "gwendolyn handley", "time": 1489379138524, "rating": 5.0, "text": "Dr. Nesbitt & his staff are off the charts. Dr. Nesbitt administers blocks to my Daddy. The blocks have helped him so much, not only his neck but all his joints. Thank you Dr. Nesbitt!", "pics": null, "resp": null, "gmap_id": "0x88891bc9ef5259fb:0xa78c1a0a8b036ec8"}
{"user_id": "107384402340660307253", "name": "Bobby Tidwell", "time": 1565114990176, "rating": 5.0, "text": "Best at what he does period!", "pics": null, "resp": null, "gmap_id": "0x88891bc9ef5259fb:0xa78c1a0a8b036ec8"}
{"user_id": "110133904999943174361", "name": "Daniel Craddock", "time": 1617734139432, "rating": 5.0, "text": "I went recently for my first epidural, I was shocked and felt blessed to have little to no pain during the procedure. Still no pain after more than 24 hours! Going on 48! The staff were kind very professional. Dr. Robinson was very nice and knows his practice very well. Praise God for this clinic! Thank you so much Auburn Pain Specialists!!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "102007961951959893178", "name": "JOHN SMITH", "time": 1617196352667, "rating": 5.0, "text": "I have been seeing Drew And Dr Roberson for 6 years they are very nice group of people even though they all but one are Auburn fans ROLL TIDE", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "104542889195463102580", "name": "Christy Love", "time": 1611372713878, "rating": 1.0, "text": "This was by far the worst experience I've had with a doctor. Dr. Robinson treated me as if my pain didn't matter and told me to go as long as I can without pain meds and it will get better, he called it getting over the hump after 2 visits he insinuated that since my personal injury case is still ongoing and I haven't received a settlement is probably why I was still in pain. I've never felt so humiliated.  I hope no one else has to go through this.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "115728948792062764628", "name": "Ann Bailey", "time": 1586454890198, "rating": 5.0, "text": "I was very impressed  with how my visit was handled during this Covid-19 time. I felt very safe. The treatment was very professional.  I have always been able to get in when in pain for a shot or treatment.  The staff is wonderful.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "107348714086708701957", "name": "Jim reetz", "time": 1580307910094, "rating": 5.0, "text": "I am a very active person who relies on my body to make a living as a fly fishing guide.  I have severe consuming pain in my back & legs.  I have had many nights where the pain kept me up most or all of the night. The effect on me showed up everywhere sleep, atitude, activity & being able to play with my daughter.  I believed surgery was the only option left.  I knew of way to many horror stories with back surgery. Through Dr Robinson and his staff we have been able to manage the pain so that my quality of life has increased significantly.  There always quick to get me an appointment when my back gets angry with me.  Very friendly staff and always quick to respond to me, the pharmacy or my insurance company.  Great people and life changing treatments!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111006317336172396280", "name": "Tina Alewine Welcher", "time": 1542817697051, "rating": 5.0, "text": "Dr Robinson is extremely informed and up to date on all new date for chronic long term pain. He is very aware of the root causes and that is where he works from to correct the problem. He does not just throw pills at everything which I greatly appreciate.\nHis staff is as informed, kind,caring and helpful as Dr Robinson. His nurse practitioner comes with numerous amounts of experience and is as wonderful as all the other staff.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "103563103519607970861", "name": "Lacey Rice", "time": 1570470182544, "rating": 5.0, "text": "The staff are phenomenal! I don't have to wait a long time for my appointments. When I have a procedure they constantly talk to me and reassure me. They are very professional.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "107982099389535907090", "name": "Patricia Ludwig", "time": 1542823534138, "rating": 5.0, "text": "Great people. SUPERIOR PAIN MANAGEMENT. Nice, understanding, professional, and most of all they care about you AND your pain. They realize how much it can affect your life. It’s hard when you have pain to go to a doctor. They sometimes just give you pills or send you home thinking that’s what you want. This practice looks at the whole person. They use the newest as most progressive treatment possible to treat your pain. Sometimes it is pain medications, sometimes it’s medical procedures to block the pain. Sometimes it includes physical therapy and even working with other doctors. But they always look at the whole picture, see you as a person , and want you to have the best life you can without pain. I can do so much more now with my children and grandchildren because of the care they provided. As a patient and a nurse I highly recommend Auburn Pain Specialist.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "112265721812155770662", "name": "Donald Patterson", "time": 1537285273633, "rating": 5.0, "text": "Dr. Robinson is a excellent and very thorough Doctor. I have been living with very severe pain in my back from previous injuries and Dr. Robinson and his great staff have been ABOVE and beyond for helping me with my pain. Drew is very helpful and understanding and humorous.. They really do make you feel like part of the team (family really). I do and I will continue to refer anyone who asks me for a Pain Management Specialist to come see Dr. Robinson and his wonderful staff... You guys rock..even Drew (well he does drive a Ford 😝) Seriously though I have nothing but the highest regards for Drew..I just love that we can joke and have a good time...", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "103719180021803904141", "name": "Earnestine Evans", "time": 1542311227873, "rating": 5.0, "text": "I bring my brother every month for follow up appointments. Staff have always been exceptionally cordial. The doctors takes time to sit down ask questions and explain your treatment. They also have a very nice and inviting sitting area.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111538447621079387477", "name": "Brenda Capps", "time": 1541601303009, "rating": 5.0, "text": "Best Doctor I have seen  Takes time to listen without judgement. I had almost given up because no one would listen. I have cancer related pain. Dr Robinson is very experienced in this and truly wants his patients to have the best quality of life with medication and procedures. Bless them", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "116908636028896859346", "name": "debbe daymude", "time": 1535637185679, "rating": 5.0, "text": "Dr Robinson and his staff are so caring and compassionate!  He has helped me so much with my post cancer pain.  I wish I could give him more than 5 stars.  🙏🏻", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "116551315436863993930", "name": "Ramona Crosby", "time": 1539876083800, "rating": 5.0, "text": "Does anyone actually enjoy going to any doctor? I don't think so lol, however all of the staff as well as the doctor himself actually do make it a pleasure to go here.\nI have let several of my friends as well as anyone that I know who has to go to a pain Management to please give Dr. Robinson and his staff a try.  I don't think I have ever been to any other doctors office that strives as hard as they do from the receptionists & billing, to all nursing staff & the doctor to make you feel so at ease that, YES, you actually do enjoy the experience.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "112371394614114164118", "name": "Traci Gresham", "time": 1538507470775, "rating": 5.0, "text": "From: Traci Gresham I truly love Dr Eric & staff. They are the nicest & caring ppl. I feel comfortable there. I've been going to him for awhile now & wouldn't go anywhere else. They have helped me tremendously!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "113399064429093171620", "name": "josiewells outlaw", "time": 1544107624733, "rating": 5.0, "text": "Nice clean office friendly staff. Thanking God I have this new doctor in my life.. highly recommended", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "114356150180972851550", "name": "Beverly Roper", "time": 1566327985554, "rating": 5.0, "text": "Dr. Robinson and his staff are very sweet and Professional.  Love this doctor", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "110575235374537382609", "name": "Kenneth Daniels", "time": 1539023161316, "rating": 5.0, "text": "I love visiting auburn pain specialist. Thay have been helping me out so much with my back pain. Also the staff are very respectful and friendly. If you ever need the help give them try its well worth it", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "115437173642423794542", "name": "MARTHA D THORNELL", "time": 1538570929228, "rating": 5.0, "text": "Dr. Robinson, Dr. Drew are the best. The staff are always friendly. The appointments are also done in a timely manner. I recommend this office to anyone who is in alot of pain and needs an understanding Doctor.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111824456101787778581", "name": "Orie Gresham", "time": 1538507074290, "rating": 5.0, "text": "Very satisfied. Dr. Eric & staff is really nice & helpful. He does all he can to relieve your pain. He is knowledgable & knows what he is doing. So glad i was referred to him.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "116361236217239854338", "name": "Belinda Jackson", "time": 1535658701149, "rating": 5.0, "text": "I would to thank Dr. Robinson and his Staff for making me feel like person and not a number. My pain is real and so are they when it comes to them listening to what is hurting me. Thank you all for being so sweet and kind. May the Lord Bless and keep you..", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111275840378689597342", "name": "David Fowler", "time": 1554641873326, "rating": 5.0, "text": "A thorough assessment was made of my condition, and it was recommended that I do stretching of the back and allow my back to continue healing and postpone any shots. I was told to call back if improvement did not continue.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "101052684850244501397", "name": "Dawn Smith", "time": 1536584132179, "rating": 5.0, "text": "The staff here are so friendly,and always make you feel welcome. Very caring. I highly recommend Dr.Robinson to anyone.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111518780798351904591", "name": "Vivian Evonne", "time": 1557247315534, "rating": 5.0, "text": "I have been using Dr Robinson since around 2008. Always have had positive results.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "102722632358824523796", "name": "Yolanda Ogletree", "time": 1547042659621, "rating": 5.0, "text": "I have been going to Auburn pain specialist under the care of Dr. Tim Robinson for about 2 years now although I do have somewhat of a chronic back problem he along with Dr. Drew have made me very comfortable the staff is super friendly and very courteous I would very much recommend this establishment I will continue to go there as long as they make me comfortable with my current condition", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "106328138212667135545", "name": "Bridget Nelson", "time": 1540406807542, "rating": 5.0, "text": "The nurses and staff are exceptionally nice and curtious to me and my family. I’ve never had any issues with this office. Dr. Robison is an awesome doctor and actually cares about his patients and helping them as much as he can.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "113002067871407428738", "name": "Donna Myers", "time": 1536182648284, "rating": 5.0, "text": "I have been going to Dr.Robinson for several years now & he is a amazing doctor that knows exactly what he's doing and takes the time to explain things to where you can understand, and to be honest, if ur wasn't for him, I may not be walking still. I thank God for this doctor and if you truly need a doctor that can help, I highly recommend him. I will continue going to Dr.Robinson for as long as I need a pain mgmt.doc.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "106101342349561058986", "name": "Jessica Miley", "time": 1536777105606, "rating": 5.0, "text": "Every time I go there everyone is so friendly. Dr. Robinson always listens to me and answers all my questions. I never feel rushed. He has helped me a lot...", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "113606893098109286913", "name": "Maisie Diamond", "time": 1539714929028, "rating": 5.0, "text": "My husband, Steve, has been a patient here for years. He always receives excellent care when the need arises for an appointment. We are extremely pleased with Auburn Pain Specialist.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "108172125572501907002", "name": "Linda Mount", "time": 1611152023887, "rating": 5.0, "text": "It's a wonderful place they have helped me so much.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "105449250409056846495", "name": "Brenda Spatz", "time": 1535635995203, "rating": 5.0, "text": "Had issues of right arm from breast surgery.  He has me on meds to ease discomfort, and bed side manner fantastic. Very cordial,  easy to talk, wonderful. Reccomend to anyone...", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "110131155090699946871", "name": "julian Myers", "time": 1536069259748, "rating": 5.0, "text": "I've been going to Dr.Robinson for several years, hes a amazing doctor and he has helped me get my body going when no other doctor could. His staff goes above and beyond their job to help anyway they can.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "112667321790931606936", "name": "Randy Garland", "time": 1537276529080, "rating": 5.0, "text": "The doctors in pain specialist as Auburn pain clinic are some of the best that I have ever had the pleasure of dealing with when it comes to pay nobody ever wants it but they do work with you to get it under control and to pinpoint where it's coming from and work with you to be able to live your life and be able to enjoy a pleasurable life again", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "117487271034723644764", "name": "Carol Broxmeyer", "time": 1537193502682, "rating": 5.0, "text": "Patrick Bolton goes there an he has the best care then he has had in along time. THANK YOU ALL", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "116012900825753847881", "name": "Esther Smith", "time": 1538404663177, "rating": 5.0, "text": "All of the nurses and doctors have been kind and helpful in trying to find the cause of my pain and provide me with a permanent solution. I would recommend this place to anyone who has chronic pain.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "100522604949215417844", "name": "C Kinder", "time": 1548167896595, "rating": 5.0, "text": "I have been a patient with Dr. Robinson for almost 2 years. Just had a visit and again the staff and Doctor Robinson were excellent, I arrived and within 30 minutes I was leaving with my knee having been injected to reduce the pain and swelling. When I moved to Auburn from Northern Virginia, auburn Pain Specialist were extremely helpful in getting records from my previous provider in The D.C./Virginia area.\nDr Robinson is very professional and takes the time to explain what we are doing to ensure I can live a normal live with minimal pain. The staff there makes me feel like I am part of a family not just a number. They are always asking about things in my life not related to my particular health care needs, which makes me feel they truly are trying to help.\nI have never waited more than 10 minutes from when I check in and their new text messaging system for reminders is awesome.\nAuburn Pain Specialist Is staffed with very professional individuals along with Dr. Robinson but they still treat people with respect and courtesy and always working to allow me a better value of life.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "106682713892919270700", "name": "Debbie Broxmeyer", "time": 1537193277763, "rating": 5.0, "text": "Great place to be when when you got great people to help you with your problems", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "110341922378036317933", "name": "Jenny Jenkins Smith", "time": 1552910916178, "rating": 5.0, "text": "The staff was very friendly and professional.  Dr. Robinson took his time during my evaluation and i was relieved to know he will not only treat my pain but will find out what is causing all of my issues.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "105720258542965150357", "name": "Joseph Giambrone", "time": 1539617927453, "rating": 5.0, "text": "Dr. Robinson is an excellent doctor and has helped me with my back pain.  He has a great office staff who are friendly and caring.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "106998748746870663355", "name": "Brandi Raley", "time": 1484342887790, "rating": 1.0, "text": "Dr. Eric Robinson was prescribing me pain medication, and he did 2 back procedures on me assuring me that he would get rid of my back pain. I went to my follow up yesterday, and I told him my back pain is still there just like it was before he even did the Radio-frequency Neurotomy. What does he do? He takes me off my pain medication and doesn't even schedule another appointment for me. What kind of Dr does that?", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111938696823692620764", "name": "Angel Lamb", "time": 1576789166056, "rating": 4.0, "text": "Extremely nice people.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "113402232652933069234", "name": "Amanda Tielking", "time": 1539115462632, "rating": 5.0, "text": "Great staff great doctor helped me tremendously", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "109048704640415045389", "name": "Ron Harvey", "time": 1539036864060, "rating": 5.0, "text": "Friendly,fast and detail info about your service and health!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "115759780390414664228", "name": "Faydra Walker-Hall", "time": 1540842209493, "rating": 4.0, "text": "These guys are super-great! The staff is friendly and patient and Dr. Robinson knows his stuff!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "107063604009711706364", "name": "Robert Caldwell", "time": 1556025576616, "rating": 5.0, "text": "Very professional. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "101872999713550904289", "name": "alicia yates", "time": 1544450765695, "rating": 5.0, "text": "Very professional and courteous staff that cares about their patients", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "116270440825680812713", "name": "Dena Duck", "time": 1542033422114, "rating": 4.0, "text": "Dr. Robinson's staff is exceptional, friendly & helpful. From the receptionist, to the nurse to Drew.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "111254350581960856087", "name": "tracy tate", "time": 1541101261738, "rating": 5.0, "text": "This is a great place everyone is nice and helpful", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "105782121964909113710", "name": "amy Franklin", "time": 1536258620952, "rating": 5.0, "text": "I have been coming to Auburn pain specialist since I had spine surgery in 2015 . The Dr's, nurse's and staff are wonderful .", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "103595314374801216236", "name": "Bonnie Sellers", "time": 1537038960024, "rating": 5.0, "text": "Dr Robinson has been treating me for chronic back pain for approx.7 months, my pain is getting better & the whole staff treats me like I'm part of their team!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "113797285428542965720", "name": "JennT46", "time": 1540437284037, "rating": 4.0, "text": "I am very happy with Dr. Robinson’s practice, especially now that he added Drew.  Appointments are on time, and Drew has done a lot to help me with my pain!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "108799585834460469670", "name": "Judi Cannon", "time": 1538575936168, "rating": 5.0, "text": "Couldn't ask for better Doctors and staff!\nI've been going there for quite a while and couldn't imagine going anywhere else they are like a second family.", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "117088467034812434714", "name": "JP Hall", "time": 1353314906210, "rating": 2.0, "text": "If your under 40 dont go there Dr Robinson thinks anyone under 40 cant have any real pain and treats them like a junkie! He is a QUACK! He put me on medication and when I told him it was not working he just said deal with it! Very UNPROFESSIONAL!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "109127157349860802743", "name": "Bonita Collins", "time": 1526995803375, "rating": 4.0, "text": "Auburn Pain Specialist will do whatever they can to help you with your pain!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "102363383706759060908", "name": "tmedley2011", "time": 1532960143549, "rating": 5.0, "text": "Great Doctor and staff!", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "105335197415511154397", "name": "Sharon Mitchell", "time": 1550524265313, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "115235568074185831354", "name": "Dawn Lawson", "time": 1538498255650, "rating": 5.0, "text": "Staff is friendly and listens", "pics": null, "resp": null, "gmap_id": "0x888cf2c8e3b4db01:0x9047fa2c53a6d76"}
{"user_id": "109913725345250759996", "name": "Jayson Shafer", "time": 1626980396946, "rating": 5.0, "text": "The Dr. spent a good bit of time with Talking to me about my options.  I’m a very complicated cervical  injury patient  I  do everything possible to you take care of myself.  I believe  Dr Durkin Could understand that even in our first visit. I appreciate his straightforward approach.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "105763913489809834966", "name": "Starr Whittington", "time": 1622051632280, "rating": 5.0, "text": "These people are awesome!! Dr. Walker and her associates are So devoted to their patients . When I started going to them I could barely walk but now with their devoted experience I'm walking . This facility is unique.  I would recommend these drs to anyone that really wants to get better and have less pain.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "115029665043058754423", "name": "Charles Osborne", "time": 1627540573972, "rating": 5.0, "text": "Very informative on my consultation visit to know what my treatment will intel", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "112084012349861972776", "name": "buddy james", "time": 1622058419844, "rating": 5.0, "text": "Being my first experience  at Dynamic pain and wellness , I was very much Impressed with everyone and how polite and respectful  they were. The Doctor seemed very much concerned with my diagnosis  and scheduling me for immediate future care . I feel that I have made the right choice by coming to Dynamic I thank you very much.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "110846149470902922381", "name": "Terry Johnson", "time": 1621602110038, "rating": 5.0, "text": "A professional and friendly atmosphere.\nThe Physicians are knowledgeable and there to do the best they can to help you.\nThey're very efficient, you're in and out.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "106377588063430296917", "name": "heart", "time": 1621634940359, "rating": 5.0, "text": "I am so grateful for the care and compassion of, Dr. Durkin and staff! I truly felt cared for.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "117860636915227330793", "name": "Jenny Henson", "time": 1626463915808, "rating": 5.0, "text": "My boyfriend an a friend goes here nice people clean place", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "107652714392811700312", "name": "Ivy Dodd", "time": 1615617243040, "rating": 5.0, "text": "The staff are the most adoring people and are most respectful. Waiting time has improved tremendously.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "105129481309504045898", "name": "Chris Orso", "time": 1613413225517, "rating": 1.0, "text": "Great staff... HOWEVER... I've been on the same pain medication(percocet) for 3 years, prescribed by them. That's the ONLY narcotic I've taken in that time. And on 3 separate occasions they tell me my drug screen came back with morphine in my system. And another time, codeine. THAT'S COMPLETEY FALSE!!!! And there's no disputing it nor will they allow to do an on the spot drug to prove such. So now I'm out pain medicine because of their faulty lab practices. Youre better off going ANYWHERE  than this quack of an office!", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1598263130544, "rating": 1.0, "text": "Fraud and unethical practice. Upon information and belief, I’d encourage any current or former patient, or representative of a patient to file a complaint with the state board, insurance company and any other legal avenues against this group. The DEA should investigate allegations of insurance fraud and other medical malpractices.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "108288238802534517259", "name": "Jennie Washington", "time": 1590677711421, "rating": 1.0, "text": "The staff here is sickening, new patient and they don’t help you understand what is going on are what is needed they expect you to just know, they all stand around on social media not speaking are even communicating with the patients. Only reason they got a star is because that’s the only way to write a review it’s sad to say you be better off somewhere else. The dr is not friendly and he seems as if he is in a rush this clinic is unprofessional and I will not be back.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "117142271113753872506", "name": "Donna Fornoff", "time": 1605900884267, "rating": 5.0, "text": "They have been extremely nice to me as well as seem legitimately concerned about my pain", "pics": null, "resp": {"time": 1605901711302, "text": "Thank you for your feedback!"}, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "103820369589658516790", "name": "Willie Williams", "time": 1568761396782, "rating": 1.0, "text": "Unorganized, unprofessional and rude. Probably one of, if not the worst places I’ve ever been. Overheard the staff discussing another patients history as well as their “I think he’s an addict” comment. Patient privacy is a joke here. They flat out lied about Dr. Hall being on vacation just so they could sign up all his patients without them knowing he was leaving. Dynamic pain and wellness is more of a pain than wellness. Do not go here, it’s all about the money to them.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "115799717626716320619", "name": "Marie", "time": 1582557700254, "rating": 1.0, "text": "I was going here when Dr hall was here last year and the name was not the same I loved it then but every since docter Hall left this place is a joke  he had me on 3 pills a day 7.5 that work just fine for a year they come in and start changing it first they went down to three  5 which I said was not working to good so the next month they took me to only two 5mg a day I missed so much work so when I went back I drop them like they like to drop ppl I told them I no longer wanted to be seen by them and I call my docter to see about sending me else where this folks or a joke", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "111386895367574201091", "name": "Randy", "time": 1572375845007, "rating": 1.0, "text": "This New Main Doctor Had A Clinic In Florida And Because of Fraud With Some  Insurance Companies Are  Reasons why The Insurance companies Will Not Approve Paitents To Be Seen!!! They Say You Have Been Approved And Give you the APPOINTMENT Date And Time THEY Call You 1 DAY before you supposed to be there to say YOU ARE NOT Approved? Not Good at NOTHING BUT Delaying YOU for Meds And Upcoming SURGERY!!! LEFT HAND Doesn't Know What the Other Hand Is Doing 3 months of Misleading Someone who is Trying to Get Another SURGUERY Done Over By ORTHOPAEDIC surgeon!! Review the Internet the Whole True Story is Posted You Don't have to Take My Word for the Truth!!", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "103433186158857075159", "name": "Janetta Pogue", "time": 1569241919201, "rating": 1.0, "text": "This facility is so unorganized and unprofessional.   Appointments were scheduled on top of another,  chaos and confusion.   It's a straight money grab.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
