{"user_id": "111767970234794501486", "name": "Wendy Blau", "time": 1621214893292, "rating": 5.0, "text": "Wonderful experience with Crossing Paths!  They delivered me the most loving, gentle and incredible dog I've ever had and for that, I will forever be grateful.  Can NOT say enough about this rescue!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMxCp0wuJJh7j5unpVdIB2gP-Pusrkwx02wI4Rw=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "116269843510818333352", "name": "Nicole DeVito", "time": 1617834842275, "rating": 5.0, "text": "Wonderal rescue.  I got my dog, Evie, from Crossing Paths and they were very professional. They transport to the Northeast from Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "117031665025508232243", "name": "Abby Chase", "time": 1615041140003, "rating": 5.0, "text": "Got 2 wonderful healthy dogs!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104956127196811488863", "name": "Jac Wetzel", "time": 1573924124911, "rating": 5.0, "text": "Adopted our second dog from Crossing Paths Animal Rescue on 11/9/19.  Samson is a wonderful puppy, healthy, social and a pure joy. He slept in his crate through the night from day 1 and loves our 2 other dogs. The adoption process was great and everyone we came in contact with was kind and wonderful. Our puppy arrived to Newtown, PA stress-free, clean, wagging his tail and so happy. I am so grateful to the transport company for taking such great care of him while he was being driven from Alabama to Newtown. I highly recommend Crossing Paths Animal Rescue as they really care about these dogs and save so many lives from the kill shelters in Alabama. Thank you for all you do and for saving the lives of Samson and Lucas. We love them so much and thanks to CPAR, they got a second chance at a beautiful life full of lots of Love!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTCamA5JsFOaP2_OoLqVeGex-TIHHhEAonpgI4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0V4_pe7dJh0riMvPKqvy3cHjK37aTJfK3IylF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPtRoESv0GEsGOFveNwUeQwB34ee-4KTbiz5fnr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "108502048765243368055", "name": "Barbara Withers", "time": 1599016439274, "rating": 5.0, "text": "I absolutely love our puppy from Crossing Paths. The communications between myself and this rescue, foster were superb, the Transport was done without a hitch, nice and smooth. We thank Crossing Paths for allowing us to adopt this precious pup.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "100075655822363986859", "name": "Rachael Taylor", "time": 1597802679752, "rating": 5.0, "text": "Very fast to respond and such a pleasant shelter to work with. Poseidon completes our home!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "114626089089065666381", "name": "Helen Rum", "time": 1479223682002, "rating": 5.0, "text": "My experience is superior. This is my first adaption. Everything was new. I would like to say we are really happy to choose Country Crossing. Our Bella B arrived to Newtown PA 11/12/16. It was big Adaption Event. 7:45 AM around 70 people come to pick up new family member what we choose from Per Finder by pictures & Foster mom conversation. All doggies come save & happy. Our Bella was adjusted very well. Like everybody, nice with kid & visitors. We have had first vet appointment. All documentation provided by Shelter was really helpful. Vet visit was perfect. Bella do not have car sickness & was great until vet check up. I would like to say BIG THANK you TO ALL !!! MY FAMILY IS HAPPY TO GOT PERFECT BABY BELLA TO CELEBRATE THANKSGIVING TOGETHER.\n\nProud! You did provided superior service & support.\nHelen&Andrey R.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNpvXR1n64aa__fBW5bFMeBIWmry_81TSdzAlxj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "116403225477692019501", "name": "Kathy McIvor", "time": 1605988061100, "rating": 5.0, "text": "I adopted 2 beautiful pups on separate occasions from Crossing Paths Rescue. The adoption process was seamless and the volunteers were so caring and helpful. I wholeheartedly recommend this nonprofit rescue!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "116298219510163288089", "name": "Kashia Hudson", "time": 1598029447824, "rating": 1.0, "text": "We adopted a dog from Crossing Paths who had worms and a severe skin condition.\nAfter several visits to the vet, we managed to get it treated.\nI'm not fond of these people but I do know that they are not in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "108486073288614118621", "name": "Gary Mertz", "time": 1603506795079, "rating": 5.0, "text": "We got our beautiful girl from the wonderful folks at Crossing Paths.  I cannot say enough positive things about the experience. The communication was outstanding from start to finish. It is very clear that they truly do care about the dogs. The process for adoption was perfectly smooth. We could not have asked for a better experience!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "113298888241134719807", "name": "Necie Mize", "time": 1597877887570, "rating": 1.0, "text": "There have been witnesses of illegal sales and uncouth practices at this vile place of Crossing Paths that is located in Locust Fork.\nI don't know why they have listings of different address all over the place when they are only in Locust Fork.\n\nFor the dogs who do go to homes, it's a blessing for them to be out of that environment.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "113856530448799950602", "name": "Nora Hughes", "time": 1595966306330, "rating": 5.0, "text": "I recently adopted Maisy (formerly Baby Belle) from Crossing Paths Animal Rescue. The process was simple and straightforward. I applied and was accepted, Maisy was transported from Alabama up to Pennsylvania, and I picked her up from Heather. Total fees for adoption and transport added up to $465, and Maisy is perfect! We did visit the vet a couple of days after she arrived and she tested positive for coccidia and giardia, as well as some irritation in her ears, but that is common for rescue pups. Just be sure to take your dog to the vet once you have them to ensure they are healthy. We are so happy to have this little puppy in our lives and we are thankful for the wonderful experience that Crossing Paths has provided!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP5lUGN5y5FNYemIs044nZfrs7xlVvbWpXF5iPt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "111279073290307793247", "name": "Chandler Giddy", "time": 1597882165175, "rating": 1.0, "text": "Beware of this place!\nIt's not all that it seems on the surface and sad when dogs need to be rescued from a rescue.\nI'm always happy when adopters get their forever dogs because that means those dogs are no longer at this awful facility.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104678341705561740196", "name": "Pamela J Willis", "time": 1594674887683, "rating": 5.0, "text": "This IS NOT the location of Crossing Paths Rescue!!! The are NOT located in Birmingham, AL !! This site was created by a irate employee!! We deal with Crossing Paths on a regular basis and they are wonderful people!! Their facility is amazing as well as their employees, and the care about the animals and take very good care of them!!! They are located in Locust Fork not in Birmingham!!!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "113833678036855610955", "name": "George Longshore", "time": 1596259310452, "rating": 1.0, "text": "I'm an old man but I know this bunch is not to be trusted.\nI know this as true.\nFor every good story, there's certainly multiple bad ones and more that are not told.\nDogs should be well taken care of and are not in reality and the place does not reflect the tons and tons of money that has poured in from the public's money.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104143770787764704107", "name": "Mara Everett", "time": 1591978043081, "rating": 1.0, "text": "True story:\nA day came when a local attorney's wife rescued a dog with a broken leg and had asked this owner if she would take him.\nOwner said yes, seeing it was a sellable dog.\nThe dog had suffered a broken leg and the attorney's wife believed the dog would get the care it needed.\nThe dog, named Falco, would suffer on this leg for nearly a year despite the begging of staff for the dog to be allowed to seek medical care to remove the broken leg as it bled from walking on the wound daily.\nOwner refused.!!\nOne day, an interested adopter saw the dog's false story of how the owner herslef had rescued the dog with the broken leg off the streets making sure the dog was taken care of by the vet and that the leg had been amputated for it's health safety and immediately felt sorry the dog's situation.\nThe dog's broken leg was tied for the picture.\nThank goodness for this adopter because it was the only reason why Falco was able to get the relief he needed.\nHe was then rushed to the vet for immediate amputation to prepare him to be sent to his future family.\n\nIf you think these dogs get the care they need or an adequate amount of food, You're wrong.\n\nDogs are disposable there if they don't sell.\nOnly certain ones they can use for advertisements are kept.\nThe rest end up sacked in a garbage bag and tossed in the dumpster.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "107277503509828807114", "name": "Joanie Eddis-Koch", "time": 1503963056127, "rating": 5.0, "text": "We adopted our dog in 2015 from Crossing Paths Animal Rescue. We found them to be completely legitimate and we highly recommend them. Our dog came with all of his vaccination records, which were complete for a puppy of his age. The description that they provided about our dog's temperament was spot-on, so they are being honest in their descriptions of these animals. This helps to ensure that the right dog goes to the right family. I am so grateful for their honesty and the excellent way that they care for these animals. I continue to support this shelter because I know the work that they are doing will help more animals. We would not hesitate to trust them again when searching for another pet.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "116355606947806787294", "name": "N S", "time": 1597524030215, "rating": 5.0, "text": "We were super nervous about adopting from here as its very far from where we live and we had limited time to decide if we wanted to adopt a dog or not. We had been applying to so many animal shelters but we were not able to receive many replies. Crossing Paths had checked out references and were able to reply to us and place us in contact with the foster ASAP. We weren't able to ask our foster many questions due to her busy schedule but we ended up going through with the process nervously. We were worried that there was inaccurate information or that the process was too quick, but in the end, our worries were for nothing. We are so lucky to have adopted from this shelter! Our puppy has a good temperament, was house trained very quickly, he's comfortable with his crate, loves everyone, and he had all his needed vaccinations/etc. up to date from the shelter. He fit in very quickly with our family and we're able to give him the best life possible because the shelter was able to give us a chance. He gets home-cooked meals, lots of treats and love, so much exercise and playtime, and he gets to meet with his neighborhood best friends everyday. We're happy that we were able to trust this shelter with their process and able to get the exact pup they had on their website with an awesome personality.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "100599955875598678433", "name": "Shannon Trammel", "time": 1572704394343, "rating": 1.0, "text": "There are so many issues with this place--where to begin?\nThis rescue is only located in Locust Fork, Alabama.\nIf you are an employee, past or present, it is wise to seek a lawyer to get back your stolen wages.\nYou have two years from the time you learn of this deceitful scheme against you.\n\nMisclassification of Employees:\nEmployees are intentionally misclassified as a 1099 Self-Employed Independent Contract Worker.\n\n~~It has always been illegal with penalties for the employer.\n•These employers every year with every single employee past & present evades paying their employer payroll taxes to the IRS and places the burden on all of their employees at the end of each year.\nThat is each employee pays the employer's taxes on themselves.\n\n~~Every employee past and present is owed not only the back payroll taxes they have paid for the employer with their own hard earned money but every time the employee has worked overtime any day each day is also owed in back overtime monies to each employee by the employer.\n\n>>Overtime money is owed for any time worked OVER 8 hours during that day every single time each time.\n\n--It is money that is owed to every employee for every year past and present.\n\n*1099 Tax Information:\nA 1099 Tax Form is A Form For Self Employed-Independent Contract Workers.\n\n•It is NOT a cash form for employees who do not get cut taxes during the year.\nThat is illegal.!!\nIt is also illegal not to pay employees overtime pay.\nEvery employer is required to cut taxes each pay period for each employee and pay them overtime when worked.!!\n\n--Each Employer's personal and business financials should also be separate.\nThen there's codes for the facility which are nonexistent.\n\n•1099 Tax Forms are for Self-Employed Independent Contract Workers are business owners, shops, & individual contract workers who perform a certain hired job until completion deciding their own hours, own work days, and their own fees/wages to be paid by a client.\n\n~~~~~\nEmployees:\nAre hired people who come in at a certain time & certain days by an employer and are paid what the employer decides to pay them expressing duties for each employee and also issuing schedules.\n\n>>Misclassification is illegal.!!!\n\n>> Alabama's Right To Control Act.\nIt's a law.!!!\nAll employees & ex-employees--talk to a lawyer.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104136196519566123386", "name": "Candice Price", "time": 1595082438965, "rating": 1.0, "text": "This site was established by Crossing Paths themselves.\nNot the lies that irate employees did which is spouted off to smear their names because they know the truth about everything.\nThese people have multiple sites up everywhere that they put up themselves and they have various people from other states with P.O. Boxes set up here in Locust Fork, Al as well as other areas in Blount County for donations.\nThese people are known all around and there is various documentation on various issues.\nThe facility is definitely only in Locust Fork but the sites are put up in various places by the owner and her staff.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "108615473159518244285", "name": "Dave Vinci", "time": 1560342590311, "rating": 5.0, "text": "We adopted our youngest dog from them almost four years ago now.  The description we had of the dogs personality was spot on. He is the happiest dog we have had and fit in perfectly with our other pets.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "114355469543763630748", "name": "Kim Samsel", "time": 1572796515067, "rating": 5.0, "text": "Thank you Crossing Paths for giving me the best little dog in the world. It's been 4 years now since she made the trip up to  Pennsylvania.  She's a strong little girl and she and I are grateful for Crossing Paths for saving her life.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "102437625521242105714", "name": "McKooshnick Madness", "time": 1501790572715, "rating": 5.0, "text": "We adopted both Tux and Fern from Crossing Paths and they are the most loving, loyal dogs that we have ever had. We are crazy about them.\nCrossing Paths held true to all of their promises and were very helpful and honest.  Yes, they are in Alabama, but they have meet and greet events in Pa. where you can meet the dogs that are looking for homes.\n\nI highly recommend them and trust them. They are excellent and truely care about the animals that they are adopting out.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "108541394443637964883", "name": "Deirdre Mann", "time": 1592113097171, "rating": 1.0, "text": "My sister worked for this awful place and saw a lot of disturbing things.\nSo did her construction savvy husband who noticed all kinds of violations.\n\nThe building inspector would be citing tickets for days, if this place were to be inspected.\nNothing is up to code and is dangerous for animals and humans not to mention the children who run around the place.\nDangerous.\nAnd there is no insurance kept for the place.\nWorkers are at great risk as well as children.\nIf injured, staff has to take care of it themselves including the financial aspect of any and all doctor bills, stitches, etc.\nBad place.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "113401816671059984850", "name": "Wendi Bennett", "time": 1578327908588, "rating": 1.0, "text": "I COULDN'T POST THIS UNLESS I GAVE THEM A RATING A ONE STAR IS NOT LOW ENOUGH  ....... TOTAL SHAM!!!! DO NOT USE THIS RESCUE!!!!!!.....glorified puppy mill. I honestly don't think anyone in this organization has a soul or a heart. Don't ever use this rescue, don't ever donate to this rescue. They want payment up front for a dog sight unseen, you have no idea what condition the dog is in until it's trucked and delivered to one of the two drop off locations in PA or MD or even if it's the dog in the photo, when you ask any questions they immediately shut you down and tell you the dog is no longer available for adoption. I plan on contacting the Alabama attorney general to launch an investigation into their practices.\nSHAME ON YOU CROSSING PATHS ANIMAL RESCUE!!!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "114006617186028653189", "name": "Audra Headley", "time": 1569730911868, "rating": 3.0, "text": "We just adopted a dog through Crossing Paths, and while we absolutely love our new baby, our process wasnt the greatest. Their website and advertisements place some of their dogs in PA, while all of them are actually held in Alabama, really frustrating to find out after you fall in love with a dog that you'll have to pay for its transportation because it's not where it was advertised to be. After going through their application process, it seemed like I heard from no one after my CC info was received; i tried to follow up via email and phone and received nothing back from them. I actually resorted to calling animal services in Alabama because I was legitimately concerned we were being scammed. Finally, our day came to get our dog, and upon her first visit to the vet the following day we ended up with a $200 vet bill because she had a yeast infection in both ears; something else we werent expecting as it was made clear to us that in order to get transported out of state she needed a clean bill of health. All of the staff were super nice, it would just be great if they could work on communicating and clearly stating that their dogs are in Alabama because some people may not be interested in that extra fee to transport when there are plenty of local rescue dogs in need of homes.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "117476758974446263575", "name": "Tanner Collins", "time": 1583866142117, "rating": 1.0, "text": "This place is known to feed as little as possible to the dogs they raise money for. Many are hungry. The food fed to them has sometimes expired and is picked up from the local feed store closeby upon the owners request, is fed old food due to lack of rotation, and fed rat infested feed from free bags picked up from a lady in Montgomery.\nIt is true.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "112434732180950932523", "name": "Caroline Weber", "time": 1556245400235, "rating": 5.0, "text": "Got my dog Daisy from here. She is the sweetest, most gentle dog, and the people were so kind and helpful while getting her off the doggie bus. She would not budge! Poor thing was so scared!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "109416169088637078589", "name": "Katy", "time": 1477354350899, "rating": 5.0, "text": "I had an amazing experience with Crossing Paths Rescue. The staff is amazing and I have adopted a wonderful dog who loves me. I highly recommend them! Thanks for such a warm and wonderful memory. I will be grateful forever. ❤", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "102249633529979786111", "name": "Brianne MacNamara", "time": 1477826960067, "rating": 5.0, "text": "Could not be happier with the service and transparency of this shelter.  After putting our application in they were in contact every step of the way. Our dog was brought from Alabama to Pennsylvania in a large truck with 60 other dogs.  Picking her up was magical.  She has been the best companion a person could ask for.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "109572345876950889045", "name": "Jody Ng", "time": 1470269104440, "rating": 5.0, "text": "I sent adoption applications to so many different shelters and rescues but Crossing Paths Animal Rescue was by far the nicest and first to respond! Although I ended up adopting a dog from a local shelter, I highly recommend checking Crossing Paths. They're super responsive and kind!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "117682025645372432225", "name": "Carlie Kamnik", "time": 1502535297357, "rating": 5.0, "text": "We adopted our fur baby Peyton about 2 years ago from crossing paths. He could not be more perfect and has brought so much joy to our lives and everyone he meets. Peyton is a great dog, calm, good with children. We know this must be partly because he was well taken care of by his foster family before he made his forget home in Philadelphia, Pa.He had all of his shots, was neutered and had his paperwork when we received him. He continues to be a strong, healthy happy pup today. We are forever greatful to crossing paths for bringing this puppy perfection into our lives!\n\nThank you to the staff and foster families from crossing paths! What you do is so important! We could not imagine our lives without", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "116350427419407567280", "name": "Karla Buse", "time": 1574436062982, "rating": 1.0, "text": "The behind the scenes horror that has gone on for many years definitely outweighs the good.\nSad", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104039208149485776429", "name": "Nichet Tucker", "time": 1484787920309, "rating": 5.0, "text": "I adopted my dog a year ago. Everyone associated with Crossing Paths was extremely helpful especially my dog`s foster mom. I spoke to her during and after I adopted my dog . She took care of him like he was her own puppy. Thank you . Continue doing the great work you do for our four legged friends.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6nYPHRjubvbR0gsk6QIpLTFVO3otKrOdbTMii=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "115636325313748674412", "name": "Anne McNamara", "time": 1564663235857, "rating": 5.0, "text": "Adopted my sweet Toby from here and I couldn't be happier with him.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "114663591403340516625", "name": "Erin Kessler", "time": 1442161745945, "rating": 5.0, "text": "I know when we found Rey I tried looking up reviews on crossing paths and couldn't find any and it put me off a little. But we took the chance and trusted them and got an awesome dog; so I figured I'd give them an awesome review.\n\nWe just adopted our dog from Crossing Paths yesterday. They communicate well, and keep in touch with you through the entire process. They showed up to the transport on time, and it was very well organized (especially considering they had about 30 adoptions and an event that day). Rey is a gorgeous 4 y/o corgi/golden mix and she is everything we were told she would be.\n\nThank you so much Crossing Paths Animal Resuce!!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104992385189728276398", "name": "Lisa Lill", "time": 1561223663898, "rating": 5.0, "text": "My sister adopted a beautiful little boy from this rescue this morning! The staff was awesome! The foster mom was very responsive and set my sister's mind at ease.  The dogs that came off the truck were all calm and seemed well cared for.  I was truly amazed that they were all friendly and excited to meet everyone who wanted to meet them.  Scooby was incredibly friendly and loved the attention he got! He will be greatly loved and spoiled in his new home.\n\nThe only negative item i would say is that the site listed that he was in Hagerstown, but he was in Alabama,  so my sister did have to pay the transport cost,  but really,  $120 isn't that much considering that there are at least 3 personnel there to help with distribution and vehicle maintenance and gas.  My sister said scooby is worth every penny!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "111565036348712259152", "name": "gskateri", "time": 1518137825356, "rating": 5.0, "text": "One day my brother and mom came home  with a dog with a tag \"aldo\" He had a lame hip and  a bug. He is perfect. His name is now cody. He's the best dog and a guy who fixed something in our house also got 3 dogs from crossing paths. So amazing! We love our dog!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "107410027551465439722", "name": "Dana Harding", "time": 1487743284530, "rating": 5.0, "text": "Crossing Paths ROCKS. I adopted my fur baby Twinkle almost 5 yrs. ago now, she is the best thing in my life & I thank Crossing Paths for her, especially Patricia. Twinkle was transported up from Alabama on a Saturday that I, unfortunately, had to work so I wouldn't have been able to meet the transport truck. I was panicked on how I could make this work (no coverage at work). I expressed my concern to Patricia & her plan was to bring Twinkle back with her after the transport meet & I could come to the alternate spot after work to pick up my new baby. What a relief & what a sweetheart Patricia was, still is, to offer to do that. Twinkle is now my shadow & is actually sleeping right next to me right now. She is such a character. She gets me laughing at her craziness & then she really starts going berzerk. Twinkle has made my life, the unconditional love goes on forever. She is my pal & I love her to the moon & back. Twinkle, my Twilight pup-so glad I found her & she is equally happy that I found her because she is one SPOILED something. Save a life & adopt-they're not broken, just down on their luck & need a chance. Give them a chance you will not regret it!!!! Crossing Paths-I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "116919827695736286360", "name": "Christine Mecutchen", "time": 1569904171162, "rating": 1.0, "text": "This organization adopted out a dog with simply one vet call.  Someone who knew the adopted the dog and was very concerned about the rescue's decision.  This person called me to intervene as I have been involved in rescue for over 25 years.  I called, with the promise of confidentiality, to express deep concern for the dogs care and welfare - short AND long term.  They promised they would investigate.\nThis 'rescue' (as they call themselves) simply called the new owner and read to them ALL the accusations!  Then had the audacity to tell me \"there were satisifed\"!?!  Satisified with what, a lying persons claim that they weren't lying?!?   Not to mention the compromised the confidentiality by relaying all those details!?!\nThen they wrote me an email telling me if I had concerns to contact \"the authorities directly\".  No concern for their poor decision, no accountabliity - just passing the buck onto our local agencies to clean up the mess they created!\nPlaces like this that adopt out simply to find a home for a animal, whether it is a good home or a good fit, is no excuse. There lack of substantial investigation is simply taking an animal that has already been uprooted, at least once, and subject it to a situation where it will likely be uprooted again is a disgrace!   Every new transition likely creates a animal that becomes less and less adoptable!\nDo yourself a favor and DO NOT support this 'so called' rescue and their practices.  Consider for a moment...  that if they don't put effort into properly vetting you - what kind of quality information are they vetting about the animal for you... that you are about to bring into your home?!?\nUPDATE: Sometime after I wrote this review, this 'rescue' called the woman who had the dog, again, and proceed to tell her EVERY detail they could in hopes of unearthing the person who reported them!?!  Absolutely unreal.  This place is a complete and utter shame and give rescues a bad name. I would RUN, not walk, away.  There are plenty of quality, caring rescues out there for you to rescue an animal from. Adopter Beware as their practices on each side of the transaction can and do effect you.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "105775578188313896395", "name": "Lauren Davis", "time": 1559997583128, "rating": 2.0, "text": "i have gotten a puppy from an out of state shelter like this once before and everything went smoothly so i tried not to think too much into the sketchy details of this place when getting a puppy from them. to make a long story short, we did pickup our puppy a few days ago. she and all the other dogs that came off the truck looked clean and healthy- but my puppy who was supposed to be 5months is actually closer to a year old per my veterinarian. she also has a form of mange that wasn’t being treated. ****Also The day after we got her my credit card that i don’t typically use but that i used to pay for her.. was used in another state for thousands of dollars at a Walmart. i have no proof that it has anything to do with anyone at this shelter but being that i never use my card but did recently to purchase the puppy- i can’t help but think they may be involved. just a heads up to anyone considering adopting from here", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "105626713628411970425", "name": "Hannah Vandegrift", "time": 1465081119535, "rating": 5.0, "text": "Just adopted out lovely girl from crossing paths animal rescue and we couldn't have gotten a better dog. She's smart and loving. I wasn't sure at first about not meeting the dog before adopting but Mitch and I decided to do it anyways and it turned out wonderful. Thank you so much to crossing paths for making this happen. Without you, adopting our furbaby would not have been possible. They kept us updated at every step in the proccess, have us guidance, and we're very friendly.  We are very happy! #adoptdontshop", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "117174344411879823223", "name": "Responsible Forest", "time": 1455327866584, "rating": 1.0, "text": "These people are scammers.  Do not trust these people.  They have postings all over petfinder claiming their dogs are in pennsylvania, but when you submit an application with your personal information, they reveal the dog is in alabama.  I submitted an application for multiple dogs and they sent me a generic email that said the dog i was interested in was already adopted. All 4 dogs i was interested in overnight? Clearly some kind of scam or data-mining operation, hoping for someone to be dumb enough to pay adoption and transport fees before even meeting the dog.  Pathetic", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104593450916628273303", "name": "Marlene Carver", "time": 1494560454739, "rating": 5.0, "text": "The best...Love our Gabby girl❤❤❤", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "115914909229299626570", "name": "Cody Jackson", "time": 1576039486433, "rating": 1.0, "text": "From personal knowledge, many dogs pulled from the kill shelters to be given a \"second chance\" by this place are later euthanized at vets office per owner and/or die from different circumstances at the kennel because of laziness and tossed in the garbage dumpster.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "101964808824690874835", "name": "Jemutai E.", "time": 1496842118000, "rating": 1.0, "text": "Very rude people.", "pics": null, "resp": null, "gmap_id": "0x88891bea55555555:0x151d8df72507756e"}
{"user_id": "104187092950560537892", "name": "Audrey Vanzant", "time": 1616023863390, "rating": 5.0, "text": "Wonder place...\nAnd they got a place where u can buy items to help\nAnd money goes to help buy food for\nAnimals at the shelter...thank u", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "108007369220114735515", "name": "Keirri Carr", "time": 1600527437166, "rating": 5.0, "text": "We had a neighbor cat and they fixed him up got him a good home.. Great people that work there..", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "115140292454134123903", "name": "Lee-Anne Hooks", "time": 1618598506945, "rating": 5.0, "text": "Love this little thrift store!", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "114971650129920927933", "name": "Linda Pugh", "time": 1596124450432, "rating": 5.0, "text": "The employees were very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "106943192692664772349", "name": "Savannah Blake", "time": 1582462825937, "rating": 5.0, "text": "You could really feel how much everyone cared about the animals.", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "112280637541527852576", "name": "Chandler Mott", "time": 1557974889724, "rating": 5.0, "text": "The people are so sweet there it is a really awesome place", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "116860440977795544975", "name": "ee taylor", "time": 1374078434053, "rating": 4.0, "text": "Look people, The Athens pound is what it is and judging it does not change it UNTIL THE people of Limestone County change their thinking.  The number of animals that end up there are not there because the ATHENS POUND adopted that cute pup that the kids wanted and then a few months later were no longer interested b/c it needed to be fed, walked, loved, nurtured and played with.  That is Mom and Dad.\n\nThe dog who has gotten older and no longer interests the people who adopted it cannot help life.  We all get old.  Yet, would you want to be discarded when your older?\n\nThe cat who came from an unwanted litter, ended up in a pound, shelter or rescue and got adopted by someone who shined like the stars as an adopter.....until kitten turned into cat and cat got pregnant......didn't put herself or her batch of kittens there.\n\nYes, the Athens pound had odor issues. So, do most city/county run pounds when they are constantly OVERLOADED with people's cruelty and lack of responsibility to begin with.  These pounds and shelters do the best they can.  When you get as many animals in as they do, you can only do so much and they try to give every animal they can A SECOND, THIRD OR FOURTH chance.\n\nSome animals come in unadoptable from illness, injury  or having been mistreated and become aggressive.  Based on what I have seen from many pounds and shelters, I can understand why these animals might be leery of humans.\n\nSO....while your throwing off on this pound and the situation it is, the PEOPLE who remain uneducated about the animal populous, say/neuter, puppy mills, responsibility and how the many diseases such as: PARVO, Distemper, kennel cough etc happen then maybe you should stop ragging on the pound.\n\nWhen you have daily turn ins and strays, you only have so much time and space to move the animals around to, to keep the environment halfway sanitary and safe.\n\nI've watched the lady who WORKS all day to get these animals into rescues and no kill shelters and/or fostered on the phone in her office.  They do care......why don't the people who make the problem CARE?", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "105755111688348975631", "name": "Elizabeth Ballard", "time": 1367362406412, "rating": 2.0, "text": "I adopted a kitten from here and the week after he was extremely sick and less than a pound in weight. The only reason he lived was because we force fed him food and formula. He caught feline herpes from this shelter. I had a friend who adopted 2 puppies from this shelter as well and within the week they were both deathly ill.", "pics": null, "resp": null, "gmap_id": "0x88628c8f8dcc2b71:0xf7a3cb0e4f65f28"}
{"user_id": "106543423343572705795", "name": "Lorraine Price", "time": 1616623444203, "rating": 4.0, "text": "They do a good job of getting the animals to rescue groups or adopted out. It is difficult for them because they only have two people who work there every week. They are only open to the public two days a week. If you leave a message, they will let you know if they have room for the animal you found or if you need to surrender yours.", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "113603768427540308392", "name": "Bobo Simmons (Ezzy-beast)", "time": 1620380479566, "rating": 5.0, "text": "They are a amazing place very helpful & caring", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "107216057989839392066", "name": "Sherry Joiner", "time": 1575447157101, "rating": 5.0, "text": "I love what they do for all the animals! Everyone there is a huge animal lover and they work so hard to get the animals adopted. Keep up the good work.", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "118373094528688469242", "name": "Antoinette Collinson", "time": 1617930399816, "rating": 5.0, "text": "So fun", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "111932556799364564412", "name": "Teri Gage", "time": 1527361948074, "rating": 5.0, "text": "Answer to my prayer. We're here visiting family and found a little stray honey colored puppy on the step when returning from Tuscaloosa last night. Called and to my delight they told me to bring her in... Such carrying people.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4Jd4bHoaDBj5ag3iAVExG7_ehREcyatWeIGZH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "100669343478846905566", "name": "Jerry Brown", "time": 1573617778725, "rating": 5.0, "text": "Excellent service and everyone is super friendly", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "106128782624726591757", "name": "Arlene Spell", "time": 1547235271895, "rating": 5.0, "text": "Very caring people who obviously love animals.", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "115565545092974908728", "name": "Charlie E. Davis", "time": 1545181520381, "rating": 4.0, "text": "They really need more volunteers, and money to help their cause. They are doing a great thing, great people trying really hard to help the animals", "pics": null, "resp": null, "gmap_id": "0x8885f35fd8db9af9:0x971f4b99b0695b3b"}
{"user_id": "111906584481438748917", "name": "Margie Francis", "time": 1621621691863, "rating": 5.0, "text": "It was great the people were nice and in two weeks I'll  have me a 🐶", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "103308029941008706043", "name": "Madison Starnes", "time": 1610936701994, "rating": 1.0, "text": "It was just a regular day and it didnt say they were closed. But sure enough no sign on the door or anything posted on the site/socials.", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "106422826987950630204", "name": "Verdell Jackson", "time": 1622150605538, "rating": 5.0, "text": "I work  next to the shelter", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "115093124608837658338", "name": "Chris Jones", "time": 1583799667828, "rating": 1.0, "text": "I went to the shelter to look for my dog that’s a German Shepard when the two guys said they had some but none had a scar on her back. I asked can I walk back there n just look and they told me I couldn’t it’s against policy??? But the other two shelters did?? Anyone wanna help me out here", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "109170244555344031528", "name": "Ender Ponydragon", "time": 1563279433100, "rating": 5.0, "text": "The staff were very helpful and efficient. We dropped off a puppy for transfer, and paid a reasonable 25.00 transportation fee. Everyone there was very friendly.", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "111992221207862108122", "name": "Tori Monique", "time": 1617975087433, "rating": 1.0, "text": "Terrible customer service", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "107666358769628876848", "name": "Nikki Heathcock", "time": 1561438859806, "rating": 1.0, "text": "Literally the worse shelter EVER!!! Also do not even try & contact them about coming & getting strays they won't come out , said you can bring it if it's a stray you have and they also charge you just to take the stray . Which I feel would be okay if that were a rule for every shelter . But how come saraland , Chickasaw & mobile will come out and get strays but they won't unless you pay it's ridiculous. I also want to know why mobile won't come to this area and makes us use prichard because our address is eightmile which is prichards jurisdiction but I see mobile county animal shelter riding down this street by my house all the time I've seen him go up my side of Lott over a dozen times . So when prichard animal control will not come out & mobile claims that they don't come out here. Then what tf do I do?", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "103563915028982039622", "name": "Debra Hershey", "time": 1501975757248, "rating": 5.0, "text": "Spoke with Frank over the phone about kittens I needed to donate to the shelter.\nHe was so very  kind to accept them \"5\" I  had become attached to them, as one of my cats had them behind my couch (sectional so open corner). 9 & 1/2 weeks with the cuties. TINKERBELL, & WINNEY are the girls and then theres\nHOWEY, SOOTY and ELVIS. Frank picked them up from my home yesterday\nAUGUST 4TH 2017. Thank you Frank, for your sweet kind heart!", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "100223184664120683941", "name": "Sam Powe", "time": 1481206601305, "rating": 5.0, "text": "I love it we are getting a cat so ⛦⛥⛦⛤⛤stars", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "110750080607733286988", "name": "Eric Marks", "time": 1554828899877, "rating": 1.0, "text": "Does anyone know a number that I can contact the animal control officer myself since the shelter obviously will not get him out here .", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "105895113809019598736", "name": "Britney Stradford", "time": 1576252148294, "rating": 5.0, "text": "Thats not the correct number", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "114085231780489436246", "name": "David Everett", "time": 1522552931525, "rating": 4.0, "text": "Polite people", "pics": null, "resp": null, "gmap_id": "0x889a53d36f9189d7:0x2cd65b4fdb9a19e0"}
{"user_id": "100446584805748255727", "name": "Cow Crazy", "time": 1623873268716, "rating": 5.0, "text": "Truly helps the community with helping animals. Great staff. Donations are always needed. Please give anytime you can with feed or monetary gifts as well.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "104535673014673306864", "name": "Sarah I A", "time": 1618631660060, "rating": 5.0, "text": "Left a dog for my friends because they could no longer take care of him. I was greeted with kindness and I know the dog is well taken care of thank you guys for all you do i really appreciate your time with animals. It shows how much you guys really care", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "103791987283342229787", "name": "Cheri Nixon Cooper", "time": 1622463432288, "rating": 5.0, "text": "Hard working friendly staff, very dedicated... These loving animals need more caring owners, STOP THROWING YOUR ANIMALS OUT ON THE STREETS.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "110545701630795785500", "name": "Kevin Gardner", "time": 1610128023397, "rating": 5.0, "text": "Wonderful facility and a great place to adopt a pet. Kind of out of the way, tucked in behind the airport, but really easy to find with signage galore. This place is the overflow for the rest of the county, so they are always full and have a good selection of adoptees.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "102520537456502603898", "name": "Jennie Jacks", "time": 1617737533319, "rating": 5.0, "text": "Pick up my sweet chico today!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMqHfpFw4IvLKgJN5mbUGg59kW5tAILsx9lZaYx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "115203411179946457856", "name": "Angela Macon", "time": 1616189819306, "rating": 5.0, "text": "They do such a great job with the animals", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "108196702683563540708", "name": "Roger Tessler", "time": 1572753481553, "rating": 5.0, "text": "Wonderful folks working for Peanuts to help our local animal problems/needs.\n\nI am not affiliated with them, but encourage anyone to stop by and donate kitty litter, unopened bags of Dog/Cat food, and/or donate to help them.\n\nIt's more than just a place for people to dump unwanted pets.\n\nIt's a true Shelter ;)", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "114477015149495090697", "name": "Teresa Archie", "time": 1572009459720, "rating": 5.0, "text": "😆 lovable PETS, friendly, need a 🏡, home,honorable gotta 💘 Love Emma", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "106305303554706651596", "name": "First year gardener", "time": 1543624723895, "rating": 5.0, "text": "Found a dog. Took it here. They found the owner. Great! Love this place.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "101084692628477533591", "name": "Michael RAUCH", "time": 1557274754961, "rating": 5.0, "text": "The staff is kind and compassionate.\nThank God for these folks.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "108952960268570571440", "name": "Amber McNeill", "time": 1508602451036, "rating": 5.0, "text": "They’re an amazing place but I just wish people would get the animals. It’s so sad but they’re getting taken care of.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "117827570535441744068", "name": "Travis Milhan", "time": 1582910295666, "rating": 5.0, "text": "Great group of volunteers!", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "111659487157362328490", "name": "Vanessa Patterson", "time": 1548937542778, "rating": 5.0, "text": "Spears great, willing to help as much as they can,", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "115439902280466641795", "name": "Regina Mullally", "time": 1540223400203, "rating": 5.0, "text": "Awesome animal shelter and great people!", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "107498450820489289965", "name": "Susan Compton", "time": 1527289642033, "rating": 5.0, "text": "Cares Bout animals & people. Very helpful!", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "113841362927781255746", "name": "Eunice Bluster", "time": 1536759689541, "rating": 3.0, "text": "Stunk so bad but I guess it was to be expected being it is an animal shelter. They have so many kittens and dogs to be adopted out. Why buy when you can adopt right! Pros The staff is very friendly, Con it is very loud and 👃", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "107537062322950084446", "name": "Rachel Ford Cleveland", "time": 1452893336884, "rating": 1.0, "text": "This place needs to be taken over by someone that cares more about the wellbeing of the furbabies rather then money.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "108226136631708981863", "name": "Larry Smith", "time": 1514811679774, "rating": 5.0, "text": "Wonderful people to deal with.", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "110097074825234412804", "name": "Janet the HipGyp", "time": 1568723798446, "rating": 5.0, "text": "Caring staff", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "107953520948088897464", "name": "Tangela Denman", "time": 1517253160992, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x87b783c581903fd3:0x4ada2cda7c1cc8e8"}
{"user_id": "107553236921632336856", "name": "Christine Farquharson", "time": 1622754580484, "rating": 5.0, "text": "Very clean shelter and the gentlemen was very caring.", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "110532883818655791398", "name": "Eva Karen Tew McInnIs", "time": 1616347527978, "rating": 5.0, "text": "Thanks for my precious pooch!", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "112766508054304372719", "name": "Crystal Castle", "time": 1583175701010, "rating": 1.0, "text": "went this past friday to adopt a female boston terrier puppy. she was the only dog crated in the whole facility. you could tell that she was sick but we had assumed she needed to be wormed. immediately went to the vet to get a worming pill and set up an appointment for her to get checked up on monday. once we brought her home she began showing signs of parvo. severely. took her to the vet the very next morning and she had to be put down. went back up to the shelter today to speak with a employee regarding the situation and they said they were sorry and offered for us to take a different dog home. given we’ve already had such a terrible experience of course we wouldn’t want another dog from their facility. but they refused to give us a refund. i would really be careful adopting any animals from this facility. poor babies.", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "107506241257197756963", "name": "Anita Hill", "time": 1598663026067, "rating": 5.0, "text": "They are always available.", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "112047935534977505583", "name": "Karla Maxwell", "time": 1534639634147, "rating": 5.0, "text": "I adopted Duke.... “Ron” the Shelter called him almost eight years ago. He was very timid with men. Now recently lost his sister. I was trying to find him an adult sister around six to ten. He is either twelve or thirteen years old. I do want to thank you for him. He is more aware of my schedule than I am. He see me off to work and let’s me hug him or kiss him on the nose. He jumps around like a puppy when I get home. He talks “barks” of joy. He is still so playful. He is always right there ready to greet me. He misses his sister, but he has never been an “only”.The tag said he was found in a warehouse. He was about four or five. He has come so far when dealing with men. He loves to run in the north forty. (Up top) He is very protective of his Momma. He thinks he is a “lap dog” when he is really too big. He is not a “lapdog” from lack effort or willingness, but lack of lap. He likes it when I sit on the floor. He has my whole leg length the lay on and get spoiled. He has finally figured out there will always be food! Thank you for my forever friend. If you know of a senior female, he does like to play with other dogs so we might be looking soon. I couldn’t find the pictures of your current animals. I found them when I got him. However, I was on a computer now I am on a phone. If you could help with this I would love it. Karla Maxwell", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "108663704530178068168", "name": "Brenda Williams", "time": 1583174714231, "rating": 1.0, "text": "I adopted a puppy Friday went to vet immediately. The pup had to be euthanized the next morning due to serve case of parvo.  They refused to give my money back. Sad", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "104852124957151413217", "name": "Michelle Hawthorne", "time": 1528139746354, "rating": 2.0, "text": "Be aware they charge $30 per animal", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "110062998317913335734", "name": "Coy Whitehead", "time": 1564093492967, "rating": 5.0, "text": "Good. Cuts", "pics": null, "resp": null, "gmap_id": "0x88904507cbee7f65:0xb1d8ae296d187a2c"}
{"user_id": "117464987642713369772", "name": "Alabama Dixie Diggers", "time": 1559406592011, "rating": 5.0, "text": "NIKO NEED A FUR EVER HOME  AND WE NEEDED LOVE.   SHORTLY AFTER NIKO WAS ABLE TO SAVE  A LITTL\nKITTEN AND COOKIE AND CANIN WERE ABLE Y SAVE HM\nNOCO SAS.IT ALL CAME AROUN SO HE COUD RESCUE", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "112539449386916011982", "name": "Melisa Daniel", "time": 1565809753053, "rating": 4.0, "text": "Very nice staff and informative.", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "106926120638895727814", "name": "Beth Garrett", "time": 1609202755523, "rating": 3.0, "text": "Rude staff", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "104182954757139141689", "name": "Cindy Correa", "time": 1523709931916, "rating": 5.0, "text": "Great place to adopt a pet to find your best friend who can say anything bad about a Humane Society the wonderful they take care of all the animals but just wonderful", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "100203000331916479129", "name": "Carter Brown", "time": 1484618575872, "rating": 5.0, "text": "Love the staff, they are so helpful.", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "101788346158303898250", "name": "Wanda Spraggins Allen", "time": 1528932885399, "rating": 5.0, "text": "Adopted 2 kittens... need say more?", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "101460188344743051785", "name": "Jequinn", "time": 1605204996259, "rating": 5.0, "text": "(Translated by Google) God\n\n(Original)\nGud", "pics": null, "resp": null, "gmap_id": "0x888cbb6d07fcc501:0xce6641597fa3544a"}
{"user_id": "110106882032690837594", "name": "Nick Armstrong", "time": 1619651249069, "rating": 5.0, "text": "This is a great place... more than that,  They are doing great things.   This is where I got my first dog.   These people really care for animals and it is clear when you visit.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMvqmAdxvgy4Iuy9WYCULwHZ9Q-1A_BIktbKj5M=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPWMHJG8IelvnvrhnkusxPCxx4LSfUtRbVuX9lH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "104714869991472248760", "name": "Charlotte McCurley", "time": 1604840992425, "rating": 5.0, "text": "Amazing place and very nice and helpful staff.  I went as a volunteer, so I got to see the dogs up close and interact with them. The dogs are well cared for, pens are clean and they were overall happy. Just a couple of grouchy ones. Jenny, a full time employee, told every single dog she loves them. I asked her about it and she said, \"They need to hear that.\"", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "105007188793512327879", "name": "Nelson Amonett", "time": 1611013856444, "rating": 5.0, "text": "Great place and great people.  Animals are well cared for.  Love the sweet girl we got.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "113345535435436588361", "name": "Grace Tatum", "time": 1582078570003, "rating": 5.0, "text": "We adopted our sweet Reese from them. wish we could adopt everyone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnDGZn_o5X1PyL2PGK9uZGN7JooSOWpcTJ36rk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "109895763755341181400", "name": "Laci Williams", "time": 1611515595577, "rating": 5.0, "text": "We got the sweetest girl from here. They were very helpful and pleasant to work with.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "111223795907950970572", "name": "Charlotte Landers", "time": 1618850420432, "rating": 4.0, "text": "They are very nice. Have a lot of dogs.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "116438921645603634168", "name": "Ann Winkles", "time": 1606252278796, "rating": 5.0, "text": "This is a no kill shelter for dogs. They have almost 200 dogs big and small young and older. It's hard to decide which one. They all are looking for some one to love and give them a loving home.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "115307777709463677094", "name": "Ann Wynne", "time": 1594577118153, "rating": 5.0, "text": "Adopted a female pit mix from here 5 years ago. I needed to make sure that she would be a good fit for my male. The people at Second Chance allowed me to bring him to meet candidates. After meeting about six dogs, he met his best friend Ariana.  Ariana is doing great and I will definitely go back to Second Chance if I adopt another.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "102012454714222083523", "name": "William Dill", "time": 1586198644186, "rating": 5.0, "text": "I adopted a mix breed from Wanda & Doug (3) years ago ( Oppie) He is a great dog. I had him shipped to Connecticut. The whole transaction was perfect.      If you wish to help animals in need . Second Chance in Boaz is the place to contribute!! They are the most caring animal rescue you will ever find!!!!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "112584323983751338271", "name": "Shannon Amos", "time": 1604685227721, "rating": 4.0, "text": "Very loving people!! GOOD WITH Animals!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "114365666165715337417", "name": "Hannah Jackson", "time": 1576372529520, "rating": 5.0, "text": "Very helpful and friendly staff. Easy adoption process with affordable fees. Lots of goodies including a free grooming certificate and also a free certificate for an adoption kit from petsmart!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "100452182739544049616", "name": "rs1960Sryan rs1960", "time": 1576190365728, "rating": 5.0, "text": "They are trying their Very best to Help, their animals. So if you are looking for something to  Love come by an find a special little friend, that will always Love you more than you ever know.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "116560676102817985396", "name": "Bama Sign", "time": 1537202614324, "rating": 5.0, "text": "Great Place , these are some of the finest people you will ever meet, Doug and Wanda are the Real Deal, such an awesome cause! Remember Don't shop...... ADOPT!!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPy3YByTM5274SNns3ls6mVzZLzMisS3ldt763q=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "102341708643544269913", "name": "Tammy Pursley", "time": 1592272452975, "rating": 5.0, "text": "They do a wonderful job taking care of of all the beautiful puppies and 🐕 dogs..!!!! God bless them all !!!!!!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "108810731468533406832", "name": "Madelyn Chambers", "time": 1580224136219, "rating": 5.0, "text": "It's a wonderful thing, what these shelters do. This one has a lot of older dogs.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "104391054441815052274", "name": "Jason Suttles", "time": 1603176037398, "rating": 5.0, "text": "Can't find a group of people anywhere that care more about dogs than these folks. I adopted my Evelyn from here.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "118012073466152564265", "name": "Ernest Thurston", "time": 1440215347482, "rating": 5.0, "text": "I found my new friend \"Sandy\" here. They had her named Ellen but I changed it to Sandy. This a great place that cares about the animals. I found them on the web and found a picture of my newly adopted friend. They provided the spay and rabies vaccine through a local vet before I picked her up. The adoption fee was very reasonable. It was actually less expensive then if I got her from the pound, and the process was real simple. They are a no kill shelter unlike the pound. The sad thing is that there aren't enough adoptive parents to go around. My new friend was there for 2 years before I adopted her and she was in the pound before that. They could also use some volunteers to help out around the kennel. I'm very happy with my experience at Second Chance. Sandy and I are slowly working through her adjustment living in a home, but it's going good.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "105357971410549474507", "name": "Tricia Smith", "time": 1547249727720, "rating": 5.0, "text": "Very knowledgeable and caring people. They all go above and beyond knowing every single dog in that place.  we came in with a very specific want and they matched us up perfect.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "108302204680817513387", "name": "Cj Johnson", "time": 1551560184389, "rating": 5.0, "text": "What kind hearts these people have. They have been so helpful with strays in our area. We tend to pick up strays. I do foster and second chance adopts them out. I love helping when i can. Keep up the good work! Yall have hearts of gold!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "114039751858805210649", "name": "Greg Lackey", "time": 1424576480096, "rating": 5.0, "text": "Best dog I've ever had. The people who run it really know each dog and can help a great deal to match you with the right dog. Take advantage of their knowledge.They are not pushy and let you look around as much as you want, but are there if you have questions. Choosing a good match is so important, and there are so many dogs it can be confusing. They can narrow it down and help point you to your perfect dog if you need help. They have lots of really great dogs.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "102223651028248769069", "name": "Chandel Wilkerson", "time": 1570559018258, "rating": 5.0, "text": "They are some of the best people I know and arevery good to the dogs", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "114626154205407557642", "name": "Deanna Dyer", "time": 1605305858899, "rating": 5.0, "text": "So glad I found this place!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "109896127498584728074", "name": "Marc Simpson", "time": 1517936914161, "rating": 5.0, "text": "I've met Doug and Wanda a few times over the last few years. They are both WONDERFUL people. Being a part of the rescue community, I meet a LOT of people, some being \"liars and thieves\" and others being none other than guardian angels like Doug and Wanda! If it were up to me, they would be classified a 5 star organization!!\nThank you for your service!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "104202431387093358564", "name": "Buford Bagwell", "time": 1577584031235, "rating": 5.0, "text": "Very caring and hard working staff.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "107358002313911599602", "name": "allen Henry", "time": 1577557201276, "rating": 5.0, "text": "Great place to pick up a pet", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "101355411432071845335", "name": "Christine Thompson", "time": 1501523348541, "rating": 5.0, "text": "Sweet, kind friendly people.  Love their animals very very much. A great experience with them, and a seamless adoption of Sam to be our newest family member.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "117854665244742354661", "name": "Meowy Peowy", "time": 1535196205959, "rating": 5.0, "text": "Did community service here and absolutely love it. Wonderful staff and I wouldn't go anywhere else to get an adoptee .", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "110867936333730276969", "name": "Chas&Jbird", "time": 1549105754543, "rating": 5.0, "text": "Thank GOD for this shelter I found the sweetest Lil puppy on the side of the road it almost got ran over they took it in. We need more amazing places like this one!!!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "104886380680052483720", "name": "Cara Lange", "time": 1455804890112, "rating": 5.0, "text": "I love Doug and Wanda McGee. They have a heart for what they are doing for these animals. My husband and I got 2 furbabies from Second Chance Animal Shelter. We have not regretted it for a second. Don't shop adopt!!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "102394969364306360739", "name": "carol Moore", "time": 1583371595646, "rating": 4.0, "text": "Everyone seemed knowledgeable and caring.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "109808832998215984472", "name": "Alani Linares", "time": 1551220296744, "rating": 5.0, "text": "I love it they are so kind and all the animals are sooooooooooooo cute", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "104474468877128647607", "name": "lyshanda harbin", "time": 1549603682932, "rating": 5.0, "text": "Found our newest family member and we're in love❤❤🐶", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "111256510786455772991", "name": "Tracy vandergriff", "time": 1571589341571, "rating": 5.0, "text": "No kill shelters are a mirical for many animals", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "113285211955067017091", "name": "Michelle", "time": 1524559689447, "rating": 5.0, "text": "Love this shelter! We adopted our dog Ceasar here a little over a month ago. Best dog you could ever ask for!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "112369753615309003586", "name": "Sherri Fitzpatrick", "time": 1515683977071, "rating": 5.0, "text": "We love this place!  We like to go here & volunteer.  Doug, Wanda, & Erin are wonderful people.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "105386495190102467571", "name": "Nell Lewis", "time": 1558284947020, "rating": 5.0, "text": "Found a new born puppy in ditch by house. Vets offices wouldn't take it. Second Chance took her.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "112932005922396387854", "name": "ReBecca Cochran", "time": 1520889245093, "rating": 5.0, "text": "Wanda and Doug are doing a very admirable job. Any help is appreciated.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "104092309535502054730", "name": "Toney Bartlett", "time": 1561667433732, "rating": 5.0, "text": "Sweet people doing God's work", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "111046605641630395931", "name": "Sherri Kyle", "time": 1455918265359, "rating": 5.0, "text": "We got our dog Ariel there. She is such a wonderful and well behaved pet. So glad we found them to find her.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "113944085815631415640", "name": "Roger Stinnett", "time": 1532316178259, "rating": 5.0, "text": "Very nice people and really do care for the animals a lot", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "116554798312788104753", "name": "Lunar Frantic", "time": 1507705423080, "rating": 1.0, "text": "Do not go here! These people were cruel enough to adopt a dog out that was STOLEN!! They never posted a picture, never shared anything about the puppy, and when owner found out they gave her the run around! Saod he couldn't be adooted then they adopted him out almost two days later to someone other than her! Look up #bringflashhome and read the full story!!\n\nThey also picked up a dog, three days later after sharing picture, the owner claimed him. THEY MADE THE OWNER PAY TO GET HIM BACK!\nPlease! Do not donate or give anything to these thieves!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "101472300153690484783", "name": "koma krazy", "time": 1575950203711, "rating": 5.0, "text": "They all need attention", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "105338676116576155643", "name": "Diane Feltner", "time": 1552594386057, "rating": 5.0, "text": "Very nice place and people", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNNCFSIbmj9sx602HVYMCz8jrzAGc-rIc5K2ggX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "103345733923196114264", "name": "jerry fletcher", "time": 1534967258185, "rating": 5.0, "text": "Incredible people with excellent knowledge about their adoptees", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "109960941582832649625", "name": "Evangelist Getty Philippe", "time": 1553856243649, "rating": 5.0, "text": "Well organized,  great team.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "109700219814055544598", "name": "David Hoyt", "time": 1553398151913, "rating": 5.0, "text": "Great....loving people.....!!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "108500754860167624282", "name": "Dennis Sheffield", "time": 1461251822466, "rating": 5.0, "text": "Good people! Highly  recommended .", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "103245224682017614488", "name": "LisaDStyle", "time": 1422283549995, "rating": 5.0, "text": "Maybe I'll find Taylor that cat she's been wanting. Though it could be all dogs, we are going to find out.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "118183938820650201063", "name": "Maggie labonte", "time": 1577581063702, "rating": 5.0, "text": "They rescue dogs", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "101934954897517438342", "name": "Jason", "time": 1556494058984, "rating": 5.0, "text": "Very friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "113482831634751706450", "name": "Christina.deleon 2567062345", "time": 1523762638309, "rating": 5.0, "text": "Love it!!!!", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "100258456311715521216", "name": "Kristy Cline", "time": 1517950356661, "rating": 5.0, "text": "Extremely nice and helpful", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "113241529022217431145", "name": "Beth Evelsizer", "time": 1497020566137, "rating": 1.0, "text": "People are rude.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "112413482665132560985", "name": "deaven Gilbreath", "time": 1486340134769, "rating": 5.0, "text": "They're special people taking care of so many animals And they value what they do.", "pics": null, "resp": null, "gmap_id": "0x888a1abcda08ae97:0xf9787530644d2f3a"}
{"user_id": "111340160333047253532", "name": "Emily Sandoval", "time": 1599776462097, "rating": 5.0, "text": "An easy process and absolutely wonderful group of animal lovers working here. I'm so grateful to them for helping me find my newest fur baby!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwzRKJhsOfk240Bm2xZEMg4-04_HaKSN3g46_E=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "113799057017253089964", "name": "Mike Schneider", "time": 1595521209857, "rating": 5.0, "text": "We adopted a dog from Third coast animal rescue, and could not be happier. Jackie was absolutely wonderful to work with and made the adoption very easy. Our Brewster, is everything we had been told. He is adjusting to us very well. He is a wonderful addition to our family. This organization is extremely professional and helpful and went over and above to make sure we had made the right decision on our adoption. I would highly recommend this organization if you are looking to adopt a pet.", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "115853885303511702770", "name": "Susan Cowen", "time": 1595285093546, "rating": 1.0, "text": "I was approved to adopt a dog from them, but they were so uncommunicative, it took two months to actually get the dog AND I had to drive three hours away to get her myself. She was advertised as heartworm negative, but I was told she was actually heartworm positive days before I was scheduled to pick her up. I was given meds that they said were for heartworm treatment, but after taking her to my vet, found out it was only medication to manage symptoms. Be very cautious when adopting from this rescue.", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "116945498095792173763", "name": "Just Me", "time": 1565304053997, "rating": 5.0, "text": "One of the volunteers is a foster and takes care of the deaf (just like me!) and blind dogs, as if they were her own children. I highly recommend this place. Please adopt and give them a forever home. Bless your heart, Tabitha!\n🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "105571675257310641052", "name": "Todd Mckerchie", "time": 1579994853598, "rating": 2.0, "text": "Kind of a strange deal.... glad for what they do first and foremost. We tried to adopt a dog but you better keep every receipt of you already have a dog for heart worm meds vets etc..... ok well who in the world has receipts for a 15 year old cocker spaniel that is still kicking and has had seizures and a stroke... guess what still going. Of course we take care of our animals but good lord I’m not going to keep every record I have other things going on as well. They turned us down which is fine hope the dog gets a good home. Emailed them to check up on the dog to see if it had found a home yet, just to keep up with it that’s all. Got a reply of we already looked at your stuff and unless you have receipts you can’t adopt. Ok was just seeing if the dog got adopted chill out. I will go somewhere else from now on or just get a pure breed. They kind of left a bad taste in my mouth for rescues. We have rescues also that are in great health. Oh well", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "117221944060366021550", "name": "Brenda Hunnicutt", "time": 1616930403668, "rating": 5.0, "text": "I was looking for a rescue dog", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "117941081178527493051", "name": "Deanna Weaver", "time": 1617918374377, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "101048882932687168860", "name": "Gina Blount", "time": 1600034464426, "rating": 5.0, "text": "Great people to work with", "pics": null, "resp": null, "gmap_id": "0x889bc7ca17956271:0x9026536daf9c5d28"}
{"user_id": "105454055848401114249", "name": "Linta Hopper", "time": 1620161531164, "rating": 4.0, "text": "Nice place. Clean. Knowledgeable staff.helpful.", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "102968081226727098102", "name": "Franklin", "time": 1597502525483, "rating": 5.0, "text": "Very clean & didn't smell as a kennel. Staff was well informed with easy application process. Animals were well cared for with food,water, some with toys. We adopted 3 beautiful kitties with intention of adopting a dog. Great job ladies.", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "104997280891477233422", "name": "Faith Gables", "time": 1577466891289, "rating": 5.0, "text": "The staff was very enthusiastic! They helped me find exactly what I was looking for! They were very helpful. The facilities were clean and the animals were well socialized and cared for.  I adopted a flame point Siamese kitten. I definitely would recommend this shelter over the others I have visited recently. Great job!", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "111696046280792289510", "name": "Chelle Howard", "time": 1598508761986, "rating": 3.0, "text": "They don't smell like straight urine like the other one's but they do need to pay better attention to their dogs because my neighbor got one from there that turned out to be very aggressive with other dogs and kids.", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "106551330371431292703", "name": "TERA FORTENBERRY", "time": 1613850111802, "rating": 3.0, "text": "Beautiful facility.. the smell was horrible inside.", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "107172096232901116159", "name": "Richard Cox", "time": 1591135882462, "rating": 5.0, "text": "Very caring and helpful. They really care.", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "109540098364727149160", "name": "The Shindigs", "time": 1611639790438, "rating": 2.0, "text": "Barely accepting calls", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "118229623461773295102", "name": "Tansley Washburn", "time": 1565015078368, "rating": 5.0, "text": "Very proper & clean! Can’t wait to pick up my fur baby, so glad to be able to recuse you!", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "100637634882282854177", "name": "Sasha Bearden", "time": 1560571413646, "rating": 5.0, "text": "They are sweet", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "104063905059573181367", "name": "Connie White", "time": 1563555091848, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888a252737f6e76d:0xe92e217385f95fae"}
{"user_id": "108824066347052487933", "name": "Stephanie Autry", "time": 1622566554788, "rating": 5.0, "text": "Wonderful. All the ladies were very sweet and helpful. I left adopting a beautiful dog and very happy. Thankyou ladies. God bless you.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "102952221219030800592", "name": "Wynter Bittle", "time": 1601944678526, "rating": 5.0, "text": "I recently adopted a dog from them.  They really care and are extremely helpful.  The establishment was clean and comfortable and the animals are well cared for.  Cupid is a welcome addition to our family 💚", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO47DTAeQTL4DfcGTw1vPgNDsVOZWXiRBv-rfsW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPuk0Qhif49wf_U1liV85UVA2xL5XQphbJ9Nq9v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPBh8OwyibBGAmQIwSy7Jx2tflh5E_7-ubawA0y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "108517257940683220154", "name": "zac creel", "time": 1613746759870, "rating": 1.0, "text": "On December 2, 2020\nA lady carried my cat to this place of business, so they could locate the owner and return him to his family, because she had witness a car putting the cat out of there car. In front of my house, close by the road and drove off. Assuming the person in the car toss out somebody's cat. She stop's and gets the cat and tries to chase down the car that put him out. Unable to do so, she gets a picture of the car and the tag number of the car. Then she see's a state trooper, at the store down the road from my house. So she stopped to report to him what she had just witness. He directs her to the cullman county animal control & shelter, because that is who deals with animal related issue's. So, she goes there and tells the people in the office what she had witness and shows them the picture of the tag number of the car. That put the cat out of their car, and tells them the exact location. Was right off 747 on the corner where \"Creel Motor's\" house is at. So she leaves my cat there and thinks that they are going to do what they are suppose to do in this situation. Make a effort to find the owner, to relocate the cat with his family. But that isn't what takes place at all. They sent my cat straight to the back room and euthanized it. That day before the close of business. A cat that had never in his life been anything but loving to anyone that, he had ever met before. Keep in mind this cat just got picked up in front of his house by someone he never seen before and going for a intense car ride, to try and chase down another car. With a car full of strangers, and the whole time he is just loving on them like they where family.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "117445247876212529193", "name": "Jeffery Wynn", "time": 1591215055269, "rating": 5.0, "text": "The people here are extremely kind and looking to place/forever home these animals. It was a nice experience visiting Cullman Country's animal shelter. I will support them happily.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "109568184170623298644", "name": "Tina Aspinwall", "time": 1578524649397, "rating": 5.0, "text": "Because I got the best new family member \"Cooper\"!!!! He is soooo well behaved and the people there were very nice and help full", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-AkUE9DCTO9JNESIbHYCWdX9t4ADLIPI7ZV9T=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "101745848298893762340", "name": "Leanna Weeks", "time": 1604652465745, "rating": 5.0, "text": "I just made a donation but the staff was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "116613698869536202825", "name": "Tim Black", "time": 1581659108694, "rating": 4.0, "text": "Nice clean place. Friendly staff. Wasn't there to adopt. My Mom had three puppies dropped at her house and we all have plenty of dogs. Hopefully someone else got to take them home. Tried giving them away but wound up at animal shelter.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "110292570929638089269", "name": "Kristy Culver", "time": 1598758113230, "rating": 5.0, "text": "We found the best new family member here.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "109887452886414405810", "name": "William Porter", "time": 1596726366490, "rating": 4.0, "text": "Felt comfortable leaving a sweet kitty with them.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "106853080787595576763", "name": "Sarene Hampton", "time": 1583358711014, "rating": 3.0, "text": "Super nice staff! Facilities are what you would expect for not enough funding.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMVGdVfjKawNAbxVtHyGlasqYVUM3Gy36CADCXD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "118039661504557530051", "name": "Jeremy Ferrell", "time": 1582757939434, "rating": 5.0, "text": "Shelter animals can be the best animals. If you are looking for a dog or cat please stop by the shelter first.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "110405392614996255327", "name": "Laura Stuckey", "time": 1572020395209, "rating": 2.0, "text": "The guy behind the counter both times I've been there was NOT interested in helping me adopt at all. He let me know his hamburger was getting cold.. Today I was forced to take 3 kittens in, someone dropped off and he was there with another so called animal caregiving employee. I was promptly told they were gonna kill the kittens by end of day and its NOT THEIR PROBLEM  due to the facility being small and understaffed. THESE WERE 3 MONTH OLD KITTENS!!  DONT THEY HAVE KITTENS ON THEIR WEBSITE?? Both employees were COLD AND UNCARING.. I was forced to turn these babies in and these people have NO EMPATHY. IT SHOWS.. BOTH EMPLOYEES had the attitude that they're just there for the job...", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "115753740593983085253", "name": "Willette B", "time": 1513706952088, "rating": 5.0, "text": "We love our new shelter puppy, \"Ellie\". She has become an amazing addition to our family. Thank you for caring for her until we were ready to find a new dog after our Sadie passed away. We will always appreciate your kindness.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "104526550197035300174", "name": "Mechelle Williams", "time": 1545927446677, "rating": 5.0, "text": "Picked my dog up from there today. Staff was extremely nice and  the kennel was very clean. Thank you for taking care of Lucy. All dogs appeared to be very well taken care of", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "107786755559747436589", "name": "Felicia Cruce", "time": 1568022321990, "rating": 5.0, "text": "Great staff wish I could  take every dog home", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "117278547010628316486", "name": "Wendy Montealegre", "time": 1500075120762, "rating": 5.0, "text": "I've been to so many rural shelters to pull animals into rescue, I've lost count.  I always dread going to a new facility because I never know what I might see.  I was so pleased to see this shelter was VERY clean and organized.  The staff were so incredibly friendly, helpful and easy to work with.   They got back to inquires immediately.   The animals were clean, cared for and loved.  Cullman County should be VERY proud of their shelter!!!", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "108307676296844996097", "name": "Barbara Lawrence", "time": 1591218504207, "rating": 5.0, "text": "Never had trouble bring in dogs that were dumped or question dogs they have.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "109199086360404571078", "name": "Alex Stallings", "time": 1530032992424, "rating": 5.0, "text": "Lovely staff and adorable pets. Wish I could adopt more. Please make donations of paper towels, cat litter and especially old bath towels if you're able to.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "105811657102333484395", "name": "Richard Lynch", "time": 1532812853474, "rating": 5.0, "text": "Chris Westmoreland is the best at what he does thank you CCSD for all you do for our county", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMuj_gvpom-kOdknMdyxSfRnQYo6vZRixAhr5tA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "106155740248567537302", "name": "Pixie", "time": 1513204333602, "rating": 5.0, "text": "Great staff, clean facility, and the animals are well cared for. Was able to view and take our new family member home the next day.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "102026479928731724576", "name": "Angela Blair", "time": 1569612717246, "rating": 2.0, "text": "This shelter needs more employees! These poor animals are neglected and packed in an area with no AC. The cats are inside,but the dogs broke my heart! The county really needs to do something about this. We were rushed out while looking to adopt because they wanted to leave early.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "106537518503395125246", "name": "bjt 2077", "time": 1535661634050, "rating": 1.0, "text": "These people are a joke!! They don't enforce leash laws on dogs that are running lose and pose a dangerous situation instead they want you to catch the dogs and bring them in yourself!  My favorite is when you call them to report a dog that has bitten someone and they tell you it's a police matter and the police tell you it's animal control responsibility to handle it this is a poor excuse for a organization!", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "117394724252291571435", "name": "Heather Richards", "time": 1541522347674, "rating": 4.0, "text": "Lovely staff members. Extremely clean facility", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "113197899576269700713", "name": "Josey Mac", "time": 1521930954428, "rating": 4.0, "text": "What can I say it's a blessing they don't have many animals a few larger breed dogs I didn't see cats though but I didn't ask to see them I'm sure they are in a different area", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "117542877037314467623", "name": "Terry Willcutt", "time": 1572568066631, "rating": 5.0, "text": "Great Place Fantastic Employee's", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "100002756197507256245", "name": "Terry Bailey", "time": 1610854475069, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "118388741950812251885", "name": "Mt D3wman", "time": 1554380176095, "rating": 4.0, "text": "Good animals for rescue. Need a place for a home.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "107674734879521196941", "name": "T Powers", "time": 1552351529394, "rating": 5.0, "text": "The gentleman there were very knowledgeable and nice", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "104057635584543629449", "name": "Lachrisha Riggins", "time": 1524179698249, "rating": 5.0, "text": "Wonderful people. We got a great dog.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "108909421854005365081", "name": "Miranda Evans", "time": 1582600169640, "rating": 5.0, "text": "The cute puppies", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "106911007578434681973", "name": "sandra swearingen", "time": 1579396567979, "rating": 5.0, "text": "Adopt a pet", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "112099260904533214941", "name": "Heath the Fam Swafford", "time": 1504846103944, "rating": 5.0, "text": "Great caring staff.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "111258989782147649456", "name": "Edith Baker", "time": 1492260497500, "rating": 5.0, "text": "Nice place to take animal's", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "115025696929710965529", "name": "Mike Pricer", "time": 1559001910839, "rating": 5.0, "text": "Very friendly staff", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "106940687574174823817", "name": "Keith Edwards", "time": 1529762139623, "rating": 2.0, "text": "The smell was little much", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "103342302971572095931", "name": "Johnte Richardson", "time": 1521543924634, "rating": 4.0, "text": "Nice clean facility.", "pics": null, "resp": null, "gmap_id": "0x8889cbe4564cd02b:0xf97021d44b86b24"}
{"user_id": "105282077844012575019", "name": "Douglas Mckee", "time": 1623798589515, "rating": 1.0, "text": "Absolutely NO Help. Excuses is all You get. Very,VERY disappointed.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "103260231140082844164", "name": "Trama Cook", "time": 1565442488125, "rating": 5.0, "text": "Beautiful people! Loving my rescue Truffles!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPj395r-9lA5ZFe9Q8CjGq3iMVq19PyUjOVzF07=w150-h150-k-no-p"]}], "resp": {"time": 1581896740081, "text": "Thanks for the awesome review, Trama Cook! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon. Cheers!"}, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "105244613470473811418", "name": "dezmarie jones", "time": 1614574675709, "rating": 1.0, "text": "I came here & was lied too 3 times. January 14, 2021 I came here and expressed my interest in a puppy VERY clearly. I told the lady ( red head w/ freckles ) Me & my friend were interested in the 2 new puppies ( Dani ( girl )  & Dominick ( boy )  ) they had just got in a couple weeks ago. They told me the dogs wasn’t available for another 2 months & I came up almost every week to create a bond with them. The freckle lady wrote my name & number down & she would give me a call when they were available. NO CALL. During my 3rd visit I was informed that Dani had been adopted by another family. I was concerned as to why she was already given a permanent family & she wasn’t available yet. So I asked questions ‘ What would I have to do so I can permanently adopt Dominick ? ‘ ... Young lady told me to fill out an application so she can give it to her manager so she would be informed on what was going on. I filled out an application for him on January 26.  On my last visit, one of the ladies I had never met came to me & informed me that they sold Dominick. She told me the family that adopted both of them had FIRST wanted Dani & had to decide whether or not they would continue to get Dominick. During the time period of them coming to an conclusion, I had already spoke to the freckle lady expressing my interest. WHY continue  to sell him to a family that had to ‘ decide ‘ on whether or not to get him & not sell him to someone who had ALREADY displayed interest. That’s foul & unprofessional.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "104021627695030043686", "name": "Tiffany Sanderson", "time": 1610409446628, "rating": 4.0, "text": "Best kisses ever, I would be willing to guarantee. Most secure,safe feeling to exist in the whole world, in his arms most def. But babe is the meanest most outgoing to cause pain paranoid unrealistic insecure spiteful jealous , real man's man if you know what I mean. Not for me. Brings me misery outside of holding me or kissing me ( take them like u used to please) it's only hurt I'm receiving. Love you from not being around\nHopefully u can understand. Good luck with Tina Marie . Tina and Justin. Sounds good actually.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN5Pr8JBnws9e4laLXthOxixrEFncz16fCGp71w=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "106748371248228781659", "name": "Sascha Easterling", "time": 1562592504226, "rating": 5.0, "text": "Adopt don't Shop", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP5RHvhs1YvHlLUaJ_LhNiWu09SUYrSKGpf5S3d=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "104475595867599700645", "name": "Stephanie McBride", "time": 1597873848614, "rating": 5.0, "text": "Penny Webster is genuinely dedicated to the safety and well-being of animals. I have used her as a groomer for 10 years. I know when I leave my dogs there, they are in good hands. My daughter has adopted 2 rescues from Lifeline. They are valued members of our family. I would highly recommend Lifeline and VIP Grooming.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "106045660224535363067", "name": "Marie Noel", "time": 1604265230333, "rating": 5.0, "text": "Thank you for helping me rehoming my dog. Very nice people, and understanding of hard times.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "100475915387134844491", "name": "Dan Saulsbury", "time": 1600301779535, "rating": 5.0, "text": "Great people doing awesome work for pets.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "107298024331559603621", "name": "melody lecroix", "time": 1615853259505, "rating": 5.0, "text": "Very professional,  and helpful", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "113216300523728507846", "name": "Keira Conley", "time": 1579709130130, "rating": 5.0, "text": "Do you guys employ for weekend positions ? i love animals and i work during the week but i can definitely devote my weekends to the shelter!", "pics": null, "resp": {"time": 1581896476017, "text": "Hi Keira, Please go to our website and fill out the volunteer application & mention you would like to work as either a paid employee, volunteer or both.  www.lifelinepetrescue.org"}, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "114337149666288672473", "name": "Rocio Hostetler", "time": 1581889553140, "rating": 5.0, "text": "Very good experience . Love how it was very clean and well kept . Cats were sweet as could be and the dogs looked very well keep and just good service all around. I will definitely recommend to any of my friends .", "pics": null, "resp": {"time": 1581896354499, "text": "Thanks for the great review, Rocio! The team at Lifeline Pet Rescue of North Alabama is thrilled you're happy with our service.  We appreciate all the recommendations.  Look to our website for new animals to adopt.  www.lifelinepetrescue.org"}, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "117054355822473310748", "name": "Lioubov Florinskaia", "time": 1576542688512, "rating": 4.0, "text": "The place is small,  but they are open on the weekends and holidays,  so it was  easier for us to find the perfect pet.  And they allowed us to Foster before adopting,  so we could make sure we were the right family for the pup.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "117756271906367716344", "name": "Christina Cunningham", "time": 1563475029472, "rating": 3.0, "text": "The food is good but wait was way too long.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "115860180670274443611", "name": "Dustin Hunt", "time": 1559219679951, "rating": 5.0, "text": "Great food. And wonderful service", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "108050489351166884947", "name": "Bryan V.", "time": 1613866004582, "rating": 2.0, "text": "No answer", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "115187252126224326625", "name": "Kiliaen Anderson", "time": 1489384657292, "rating": 5.0, "text": "Wonderful group, currently have one of their hospice fosters and am astonished at the large amount of support provided by the group.  Behaviorist gets back to me within 24 hours and they get my foster into the vet immediately, when I've needed assistance with her condition.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "112014633547787962947", "name": "Robin Tittle", "time": 1580849794378, "rating": 5.0, "text": "Great work.", "pics": null, "resp": {"time": 1581896606698, "text": "Thank you so much for your kind words, Robin. We really appreciate you taking the time out to share your experience with us. We count ourselves lucky for people like you."}, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "112851573044707018347", "name": "Amie Hamilton", "time": 1562800512279, "rating": 5.0, "text": "Great job", "pics": null, "resp": {"time": 1581896767619, "text": "Thanks for the awesome review, Amie!"}, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "110326113981921339851", "name": "Eddie Dodgen", "time": 1558616400786, "rating": 1.0, "text": "They don't call back", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "114667200702778319556", "name": "Joe Raper", "time": 1499794580418, "rating": 5.0, "text": "They really care about the animals!", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "112035165969954823710", "name": "Claude Hudson", "time": 1488407055935, "rating": 1.0, "text": "This place is closed.", "pics": null, "resp": null, "gmap_id": "0x88620d5b7a6049c3:0xaab19e77937305ba"}
{"user_id": "105911712348170692712", "name": "Sam Peacock", "time": 1611449306577, "rating": 5.0, "text": "Everyone at the humane society was very sweet and polite. They take care of all the animals with loving hands. They all have the...\"I love animals\" look on their faces! You can tell they have the care and love to give to all the animals and that's what they do. I would recommend going to the humane society and finding a new friend to take home with you and love.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113515428249954327534", "name": "Paula Stewart", "time": 1607372790169, "rating": 4.0, "text": "When to look at some dogs to possibly to adopt. Staff was very friendly and helpful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBa1F3rA-q2mCJyA7BdTBQy_0aUsNSab4P8uXm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQ1ya0Vex_t57hY8GOaE6Cf52eLHnQJJ__WlNK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPI7Ol5wSFE2QxopaHllIZgm07ztz3zgTDijTnm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "116197485273858344626", "name": "Casino Baby", "time": 1608815615952, "rating": 5.0, "text": "I have adopted two animals from here over the years they are such a great place.  They are so kind and wonderful with the animals.  I believe in adopting from the shelter to help the animals that need a loving home and a second chance.  I just adopted a handicap dog and she is so loving and beautiful she's my heart.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "102612805093388671775", "name": "Regina Buccelli", "time": 1620872564959, "rating": 5.0, "text": "I adopted my revent two babies from them.  The prople are so wonderful and helpful.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113126557165800004244", "name": "Cove Springs Farm", "time": 1546541356096, "rating": 5.0, "text": "Dogs well taken care of.  Good variety.  Low kill shelter that utilizes dog breed rescues when needed for placement of a dog", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDreelE1MykuX8rlumhmMsffUU22ETZ0zA0F5k=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "105099518828967516250", "name": "Shirley Cameron", "time": 1617302195504, "rating": 5.0, "text": "I got my cat. The people working in there are so nice.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "117316737494343119047", "name": "Michael Kiernicki", "time": 1613233800667, "rating": 5.0, "text": "Great place to rescue your friend. Nothing like a pet.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "106026901319891547337", "name": "Elizabeth Hester", "time": 1619288156154, "rating": 5.0, "text": "They take good care of your pets", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113733003664590671820", "name": "Arianna Harmon", "time": 1603726387919, "rating": 1.0, "text": "Was supposed to come pickup a puppy for a foster to adopt situation. Called before hand to let them know when to come get it and they told me that it was going to a rescue after I was SPECIFIALLY told they didn't want it to go on a transfer and I had already held it and bought all the stuff for it. Talked to 3 people no one seemed to know why I was told that. Never seen such a dirty, unorganized place. Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "111826155738754533672", "name": "school_tingz", "time": 1588449890668, "rating": 4.0, "text": "SOMEONE HELP. i know this isn’t a review, but my friend’s parents captured a red eared slider turtle from their backyard and are keeping it in a small bin that’s about 10 inches long. the turtle is about 6 inches long and doesn’t have any room to move. all that’s in there is 3 inches of water with no heating lamp or basking area. the same thing happened with her last turtle, but it died. she wants to let it go, but if she does, she will get in trouble. i have offered to buy them all the necessities that the turtle needs to live a good life, but they keep turning it down. if i do, then they will yell at her. i don’t know what else to do and i don’t even know if y’all can do anything about it either, but me and her both don’t want another turtle to die because of the neglect.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "100321288268255379106", "name": "paula nuhfer", "time": 1595015946651, "rating": 5.0, "text": "We love you guys, best place ever to get a pet. Amazing caring staff. Thanks for all you do.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "102767645449996368280", "name": "J. Sam", "time": 1510355182455, "rating": 5.0, "text": "I wish I knew our babies full story but she made her way from the humane society in Gadsden all the way to Pennsylvania thank you for getting her a rabies shot. She is so sweet and kind we also love the name Tatum!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMtKLt3ebQMtQpwrGbx3poJPkgiRWEP7Urm1lr4=w150-h150-k-no-p"]}], "resp": {"time": 1531870803688, "text": "We too wish we knew all of their stories! We just try to help them create new happy ones! Thanks for adopting! Hope Tatum is doing well!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "109518181898359811280", "name": "Tony Walley", "time": 1574276393343, "rating": 5.0, "text": "Had a great visit... the entire staff was attentive and very pleasant.  Special thanks to Abby who spent well over an hour with me she really cares about her job and knows how to make someone feel welcome.  I give the entire staff kudos", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113382315279499949490", "name": "Dale Smith", "time": 1578780865128, "rating": 5.0, "text": "Went to rescue a puppy. Smitty met us with such kindness and love. Had to get what a great puppy. I believe he is beagle and boxer mix. Awesome place to get your next pet.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "117073491258711811820", "name": "Mizzuz Mo", "time": 1555470456858, "rating": 5.0, "text": "Please go adopt Nemo! They won't tell me how he's doing. I'm sure he's scared. He's just a baby. Well, a really big and rapidly growing baby--but still a baby! He loves to play and recently began to dig holes outside! He's 7 months old today. He needs some one who knows how to train him because he can get really excited when he's happy and we could not afford professionals. He's kept in crate overnight from 10pm to 6/7 am. He eats 3x daily 6-8a, 1p, 6-7p. Purina puppy chow. He's walked one hour after eating. And will scratch at door if he needs to \"do his business\". He's gonna get really big, but he's a sweetheart. He's a lab/pit mix. He received 2 rounds of puppy shots, dewormed, chewable nexguard flea & tick/heartguard for heartworm prevention at Gadsden Pet Clinic. He's a whole lot of joy and much work for a family that includes a baby the same age as him. We only allowed him in the living room as he grew and we were in a different part of house doing school work. Husband works 6 days a week and with an infant and 3 little ones I was exhausted. I don't think he was as happy as he could be. We miss him(didn't know I'd miss him like this😢). We love him, we want him to be happy, and hope he finds his forever home with a more experienced person or family who can give him lots of attention, exercise, training, and much love. He really is a good dog. #Nemo", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7ShaH-mmFmhREAMh3ptdqJoWy0QxlY_tvahdS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVWZLQLD4YB83cZVMjgTOAb03-wk0lQMZA08Hr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "102503798427090727511", "name": "Abigail", "time": 1560646320028, "rating": 1.0, "text": "I first visited this humane society to look for a dog to adopt. My first impression was that the staff was decent, but they were not very helpful as it was my first time adopting and I did not know how the process worked. After waiting around for the staff to acknowledge me, I was informed where the dogs were, and was told I could to go back and look at them. I immediately liked one of the dogs, so I told the staff that that was the one that I wanted to adopt. They said they would hold it for me, and that it may take a few days, and that they would call me when the dog was ready. After a week of waiting for a call, I called the shelter to see about the dog. They transferred me to two numbers, telling me they were busy, and then no one answered. This happened three times within two days, and then no one answered every time we called after that. I went to the shelter to see what the issue was, and one of the staff told me that a rescue that re-homes dogs throughout the country came and got her to take her to a no kill rescue to  save space in their shelter. They had plenty of room, and why would they give them to a shelter to save space to re-home in another state ,if there was someone interested in adopting him in their shelter here? I was very disappointed in their service.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "101912439155110215154", "name": "Joseph Evers", "time": 1589173844626, "rating": 5.0, "text": "Very helpful and nice staff, I feel like they really care for the animals and I highly recommend this location.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "115395323128209475643", "name": "Amanda Elrod EA", "time": 1593699657791, "rating": 5.0, "text": "Thank you guys so much for finding and taking care of Choo Choo, you guys are the greatest 🤗🤗🤗🤗🤗", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "115036829698661979518", "name": "Nena Stephens", "time": 1579445319813, "rating": 3.0, "text": "They are NOT a no kill shelter. Just want to clear that up, as some have stated in their reviews. Was told by an employee yesterday that they are a traditional shelter and the only no kill shelter nearby is in Boaz.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "112950761099319371524", "name": "Jennifer Stango", "time": 1579263772560, "rating": 4.0, "text": "The staff are super helpful and friendly. I just wish I could take all of the animals home.  It breaks my heart there are so many sweet animals there waiting for a home.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "105087931056267159959", "name": "Frankie Diego", "time": 1575675457715, "rating": 3.0, "text": "It's a nice place to adopt a New family because my new dog became a new family member who is now happy to be with us", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "102800467284445112521", "name": "mason Rulez", "time": 1590258736958, "rating": 3.0, "text": "My dog that was stolen was adopted out because I didn't find the facebook page In time for her to come home now I have no information of her whereabouts or.if it was even her", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "104997280891477233422", "name": "Faith Gables", "time": 1577468055218, "rating": 1.0, "text": "I’ve been looking arround for a kitten for a while now and I visited this shelter to take a look. I found a kitten on the first visit and was interested but they decided to close two hours early so I only was able to take a quick look at the kitten. I took home an aplication and returned it a few days after but when I looked at the kitten again she and her siblings had a SEVERE respitory infection. One of her siblings was sneezing so hard there was blood everywhere! The staff was not attentive and distracted by her boyfriend. We had to inform her of the sick kittens. Moments before she had informed me the kittens were ready to go home with a family. They didn’t even know the cats were sick! The windows were unwashed and covered in kitten mucus.I looked into the cat room and one of the adult cats was limping and would not put any weight on her front paw. I’m very disappointed because I have adopted two pets from here when I was a kid,and I once volunteered here regularly when I lived in this state. This place used to be great. I do not by any means mean to be hateful or rude but I would not adopt an animal from here. All the animals are in poor condition and all the cats had respitory infections. I really would like to see improvement in the future because this place used to be great.:(  on the other hand if you are looking for a healthy animal and a shelter with great caring staff and great reviews try Rainbow City Animal Shelter. The staff gave me a tour after asking what I was looking for. I was introduced to every cat. The staff also spent enough time with the cats to now their unique personalities and preferences. I was very impressed. They were amazing and helped me adopt a healthy flame point Siamese kitten! 11/10 would recommend.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "106609776500591770972", "name": "Jacquelyn Irby", "time": 1536345828265, "rating": 5.0, "text": "I adopted Aurora August 3, 2018. I shortened her name to Rori, and she goes to work with me everyday. I am a caregiver and my patients just love her and she loves them. She is the best fur-baby ever. Smart, funny, and very loving!!! Oh yes, she talks back to me... very vocal. I love her so much, and she has been a huge help to me as my service dog!!! Rescuing an animal is very gratifying. Everyone that is in want of a furr-baby should check out the shelter first. The babies the are waiting to pick you for their forever mom or dad!!! <3 < 3", "pics": null, "resp": {"time": 1536592779577, "text": "Thank you for your outstanding review! We are so happy for you and Rori, I hope she touches many lives along the way. Thank you for adopting and happy tails to both of you!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "108810731468533406832", "name": "Madelyn Chambers", "time": 1580224086863, "rating": 5.0, "text": "The workers here are always so sweet, and seem to genuinely care about animals.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "101934954897517438342", "name": "Jason", "time": 1556494020466, "rating": 5.0, "text": "We adopted our dog from them 3 years ago. They we're very friendly and courteous. To this day, if we have questions, they take their time to answer them and hello any way they can", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "110726118129642336495", "name": "charli abbott", "time": 1550291935987, "rating": 5.0, "text": "They were wonderful and were affordable enough so that I could get my puppy Daisy fixed. They took good care of her. Thank you", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "115823004654726287324", "name": "jan colley", "time": 1565990551085, "rating": 5.0, "text": "We love our new family member , SADIE. The facility was clean, employee's were friendly, and helpful.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "115443330887192536504", "name": "ChytheKing 7787", "time": 1565056456381, "rating": 5.0, "text": "This is a no kill shelter which is amazing. And the staff is really nice", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "108719190317290916054", "name": "sinbadicus", "time": 1593444785655, "rating": 5.0, "text": "Very friendly staff with great knowledge", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "108106537766475397891", "name": "Jody Brown", "time": 1499401825544, "rating": 5.0, "text": "This local Human Society is contracted through several municipalities locally due to the fantastic work their team of professionals provide and rescue along with adoption efforts. Friendly staff all the way around and I seem to see nothing but a prosperous future for this organization and the people involved in it now! Great things are really happening here.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "102968081226727098102", "name": "Franklin", "time": 1531232811318, "rating": 5.0, "text": "Adopted 2x from here and most recently this wk. Excellent information from staff who strive to maintain a clean facility. Not everyone can adopt and not all should be allowed. i'm a proud partner & encourage animal lovers to check out this agency. Also follow the web cam & agency fund raisers.", "pics": null, "resp": {"time": 1531871728241, "text": "Thank you for adopting and also for the kind words! We appreciate your support, we couldn’t do it alone!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113552457371409246384", "name": "Dora Lesley", "time": 1561158883592, "rating": 5.0, "text": "I love animals. I hope the animals get a loving family.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "101258876876517675102", "name": "Tammy Smith", "time": 1536847195229, "rating": 5.0, "text": "Hello, update on Peanut Smith, he had surgery to remove tumor on neck and surgery to fix tail. He is on some medication, but doing great, he goes back to the Dr.(vet) in one week for follow up. My brother an I figured about a year and 3 months since we last seen him. The Dr.(vet) said he had been thru it. For sure that's an understatement. I am so very thankful to you and your staff for helping us reunite. We will visit once we are good and healthy..see you soon..Thank you again so very much.", "pics": null, "resp": {"time": 1536856930289, "text": "Such great news! Happy tails to all of you and thanks for 5 stars!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "107377507147490186005", "name": "William Mullins", "time": 1607960358737, "rating": 1.0, "text": "Smell bad, not clean", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "115148389116324143663", "name": "Carla Pnkerton", "time": 1572203985011, "rating": 2.0, "text": "The staff is rude, and they don't answer their phones. They aren't helpful at all.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "104724719051478792766", "name": "Amber Thompson", "time": 1479139986868, "rating": 5.0, "text": "Was in there around veterans day. There was this older woman there making a scene about why she couldn't have a dog. The people at the society were very nice and informative about the fact that they would not let her take in this dog without having the dog at their home neutered. Which is very understandable.  I really appreciate that they would go to such lengths to keep the pet population down. The older lady was very rude and stormed out of the building disappointed. I hate that people like that exist in this world.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "100209849774692124153", "name": "Abi Carter", "time": 1526917844914, "rating": 1.0, "text": "If I could give a negative rating I would. What I witnessed was beyond horrific. The dogs are severely neglected. I looked at smaller breeds and every single one of them were malnourished. They looked as if they had not eaten in months, their ribs were showing horribly. Every single one of them also suffered from kennel cough so bad that they could not run or breathe without coughing non stop. I also witnessed a worker literally throw a dog under her arm like it was a sack of flour instead of a living animal. These poor babies have already had a rough life and they are not getting the treatment they need/deserve. I will not adopt from this place EVER.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "116948825234890490774", "name": "Valarie Hudson", "time": 1544536318615, "rating": 5.0, "text": "I love this place. The animals are well taken care of and everybody was friendly.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "105722876931514333215", "name": "Kartr Higgins", "time": 1516126669442, "rating": 5.0, "text": "Great place!  The staff was very friendly and helpful.  They helped us adopt a great cat.", "pics": null, "resp": {"time": 1529513571635, "text": "Thanks for your review! Hope your fur baby is doing well!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113398401123489666086", "name": "Sarah Reaves", "time": 1555267934569, "rating": 5.0, "text": "My little baby is fixed and home and very well taken care of", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "114382215136646566310", "name": "Ryan Adams", "time": 1616465953812, "rating": 4.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "105707161742786188984", "name": "Olivia Rager", "time": 1482379634827, "rating": 5.0, "text": "loving and caring staff! I volunteer a few days a week and the staff cares so much about the animals as if they are their own.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "112889856078162465946", "name": "Hope Meeks", "time": 1556939177614, "rating": 5.0, "text": "As clean as you can expect an animal rescue to be. The people were knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "117145240796419637910", "name": "Skyler Mayo", "time": 1532715109712, "rating": 4.0, "text": "Today I took my dog maylle here she is such a wonderful dog I wish I could have kept her but sadly I couldn't I hope y'all help her find a amazing home were she can be loved and treated well", "pics": null, "resp": {"time": 1532725518213, "text": "We are very sorry you couldn't keep her, we will take good care of her and find her a great home!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "118239847515797762506", "name": "Michael Russo", "time": 1539949921900, "rating": 5.0, "text": "Come save a pet's life..great people to help you...", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "102088408241346173882", "name": "Margaret Gilpin", "time": 1512462343929, "rating": 5.0, "text": "Adopted my kitten. Very clean and organized facility. Awesome people who care and love animals.", "pics": null, "resp": {"time": 1529513745876, "text": "Thanks for your review and hope your fur baby is doing well!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "108667888518565954346", "name": "Marlene Trusler", "time": 1535909384988, "rating": 5.0, "text": "Such helpful patient people, Sarah and Lisa were such an amazing help", "pics": null, "resp": {"time": 1536082842189, "text": "Thank you! We consider ourselves blessed to work alongside those two ladies!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "116304444525187658920", "name": "Mary Gilliland", "time": 1560715660162, "rating": 1.0, "text": "Did not even help me with a cat that had kittens that was a stray.... NOT A HELP AT ALL", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "113906200028671292252", "name": "james adams", "time": 1532770561510, "rating": 5.0, "text": "Staff is very helpful .  They are eager to assist you on your search for your forever pet. You can bring your current pet to see how they get along wiith your candidates.", "pics": null, "resp": {"time": 1529513078253, "text": "Thanks for the great rating!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "111930799096235613432", "name": "Daniel Watts", "time": 1542637098669, "rating": 4.0, "text": "Great people who care about animals and they're well being", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "109390371358511432862", "name": "David Pearson", "time": 1465692924909, "rating": 3.0, "text": "Last week i done the hardest thing ever, I had to put up our puppy up for adoption a puppy that we rescue at birth. But after 5 months we felt it would be best to find her a good home a home with a bigger yard an someone that's younger. She was house broken all shots an chipped a great puppy. So today I just wanted to check to make sure they found her a good home see if I could bring her toys an if she was still there have some play time. They open at 10 am I call no answer I leave message no call back I call again for the next 2.5 hrs no answer. So I drive to the center went to the front desk an the lady ask if she could help me I said yes I drop off my puppy an I was-------- she cut me off an told me once I signed that paper she could not give out any info. Thanks for making me feel worst an all I wanted to do was to see what else I could do.", "pics": null, "resp": {"time": 1528995107775, "text": "Mr. Pearson, we are so sorry you had to give your puppy up. We understand things happen. That is why we are here, and as I type this, we have already taken in 11 since opening at 10am. Fortunately, we average about 50 adoptions each month and try our absolute best to save everything we can. Because of the overwhelming number of animals that come in to the staff of 8, it was set forth years ago that while you are welcome to stop in or check Facebook for those up for adoptions, the board and staff have the policy in place that once surrendered, we cannot personally discuss updates. With such a small team and upwards of 4000 souls coming in each year, it would be impossible to speak with every family. We hope that you are off to a great Summer and that you will consider adoption in the future. We, along with other area shelters, appreciate those that come back, once situations change. Have a safe Summer, sir."}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "114213189145528617648", "name": "Tia McDaniel", "time": 1504025418675, "rating": 5.0, "text": "Ten outta ten I got my dog there and volunteered there for years and glad to say they always made me feel welcomed and it's the place to go if you ever want a furry friend(s). And a big thanks for Sister.", "pics": null, "resp": {"time": 1531871997843, "text": "Thanks for adopting and volunteering! You are welcome anytime! We couldn’t do it without our volunteers!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "118204018152930499192", "name": "Christie King", "time": 1440379681160, "rating": 5.0, "text": "This group of staff and volunteers are so passionate about every animal that comes into the shelter.  I love what they are doing for the furbabies of Etowah County!  Call them to adopt.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "117505112327070938863", "name": "Tracy Patton", "time": 1478930390398, "rating": 1.0, "text": "I came in with my daughter to adopt yesterday veterans day...We found a very sweet puppy that you call Taz she played in yard with Taz for an hour..and fell in live..We were totally and completely disappointed when we were informed we could not adopt him because my for yr old house dog wasn't neutered...Thus really broke her heart. She is a police officer and serves in National guard.. 20 years old no children and wanted and found this puppy. That puppy would have had the.most loving home because of her companionship and she would have loved to have this puppy to help her overcome her stress from the job as well as lonliness....I was totally taken back by this and I wonder what better of home than with a caring and serving child that has so much to offer..if that isn't a acceptable home for this pup I don't  know what is.. very disappointed and sad..", "pics": null, "resp": {"time": 1528994772284, "text": "Mrs. Patton, we so appreciate you coming in. The policies set forth in the bylaws and by the governing board offer some flexibility but not much, regarding spay and neuter. We are going through Google to see our reviews and apologize for the late response time. We appreciate you making the decision to adopt. Taz is actually living the life in South Carolina. While we don't get to see Taz as much, we do get Facebook updates. Fat and sassy for sure! Hope your baby is doing well, too. Have a safe Summer."}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "103225362837761178727", "name": "Sherri Brothers", "time": 1461978464553, "rating": 5.0, "text": "I have loved these wonderful folks for a long time . they have saved many furkids..", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "111054530616917362082", "name": "Dixon Miller", "time": 1493642340790, "rating": 5.0, "text": "Enthusiastic, caring staff and a clean, modern facility. Nothing here that is not to love.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "104141898068056941585", "name": "Flakeaze", "time": 1572739523329, "rating": 5.0, "text": "So many cute dogs", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "107182294348875924777", "name": "Melissa Conner", "time": 1550438821918, "rating": 5.0, "text": "Nice clean place everyone was real nice", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "110356277168003186924", "name": "Abigail Jenkins", "time": 1453560214849, "rating": 5.0, "text": "I voulenteer every Saturday! Very fun!!!\nI love playing with the animals!", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "100617678209353573236", "name": "Sharita “Spot” Johnson", "time": 1595431965069, "rating": 4.0, "text": "Great employees", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "110742792180659826836", "name": "Bobby Perkins", "time": 1567475088450, "rating": 5.0, "text": "Really nice and helpful staff", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "116091804148309785731", "name": "Morgan Bond", "time": 1563824690219, "rating": 5.0, "text": "Help this dog showed up at my house and I can’t keep it", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "103822617267978186476", "name": "Terri Findley", "time": 1561245409947, "rating": 1.0, "text": "They act like they really don't like animals and don't call and ask for help you can forget it.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "109970374337289549864", "name": "Char Pollitz mathews", "time": 1517669989588, "rating": 1.0, "text": "Will not help mistreated animals very unfriendly hate this place", "pics": null, "resp": {"time": 1528994062477, "text": "Mrs. Mathews, we are sorry to hear you feel this way. Please tell us a little more about what we were unable to help you with. We average over 50 adoptions a month, send another 20 or more on transport and rescue, assist all of Etowah County with paying for spaying and neutering, work with local city and county leaders to support local and state legislation for animal advocacy, and offer food assistance to residents in need. We also shelter animals from within the city limits of Gadsden and Attalla. We see your other reviews are Jefferson County way. If this was meant for the Gadsden shelter, please let us know how we can help you. Enjoy your Summer!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "111789093291049563134", "name": "J. Rain", "time": 1566227586487, "rating": 3.0, "text": "Too small", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "110247842725093206678", "name": "Mark Collier", "time": 1584220174650, "rating": 4.0, "text": "Nice and clean", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "105779097710374523379", "name": "Eric Carroll", "time": 1538664283065, "rating": 5.0, "text": "People with ALOT of HEART. They will help when no one else will.", "pics": null, "resp": {"time": 1539365617241, "text": "Thank you Eric, we try our best to help in any way we can!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "107777665261633696568", "name": "Carolyn OBrien", "time": 1485725287140, "rating": 1.0, "text": "The most \"inhumane\" organization ever encountered and pulling only a pathetically small percentage of animals from Bartow Co with whom they are contracted to help pull and save.  No at all a \"humane\" organization.", "pics": null, "resp": {"time": 1528992885850, "text": "Mrs. OBrien, thank you for the review. Unfortunately, you may have the wrong shelter. We are unaware of Bartow County or who they contract with. We are in North Central Alabama in Gadsden and serve as a shelter to the community. We assist residents within the city limits of Gadsden and Attalla. There are three other shelters in our county, but none of them partner or service the county you reference. Hope this helps. Have a safe Summer!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "112514144280857228449", "name": "Tracie Wiggs", "time": 1573129402716, "rating": 5.0, "text": "5 stars", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "101897196111603528711", "name": "B Johnston", "time": 1550714859784, "rating": 5.0, "text": "Great cause", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "117607335057515643137", "name": "Phillip Wilson", "time": 1557919598038, "rating": 5.0, "text": "We donated pet food", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "105910847377653563969", "name": "Charity Haney", "time": 1523340654260, "rating": 5.0, "text": "I want to adopt them all!!!", "pics": null, "resp": {"time": 1529513330023, "text": "Thanks for the awesome rating!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "109316936369807790378", "name": "Dylan Spencer", "time": 1519074614002, "rating": 2.0, "text": "Very disappointed of called this facility over 20 times since i left there this nor no g with no response very poor customer service", "pics": null, "resp": {"time": 1528994494475, "text": "Dylan, THANK You for adopting this year! We are not sure what extensions you left messages on but hope you can narrow it down, so we can check into the phone and service system. The adoption also tried to contact you this morning, so please let them know details when you guys connect. THANK YOU FOR ADOPTING!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "118040063608459092005", "name": "Justin King", "time": 1537811152442, "rating": 4.0, "text": "Doing best they can", "pics": null, "resp": {"time": 1537887806304, "text": "Thanks for the review!"}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "117513574300672919807", "name": "Dillon Fuller", "time": 1473966509860, "rating": 1.0, "text": "I tried bringing kittens down to put up for adoption but they wanted $50 just to take them", "pics": null, "resp": {"time": 1528994375146, "text": "Mr. Fuller, the bad news is that we only take in from within the city limits of Gadsden and Attalla at no charge, due to contracts that the cities cover for their residents. The good news is that we are one of few shelters that still service ALL areas. Because we are a stand alone nonprofit and not owned by government, we do ask for an out of area fee to offset the costs associated with care and vetting for the over 4000 needing help, yearly. We always encourage residents from other areas to spay and neuter their pets and directly seek assistance within their areas. Thank you for checking with us. Do let us know if you still have the Mother cat. We offer to pay most of the spay fee. You do have to reside in Etowah County, but it is available, thanks to donors that believe in the program."}, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "106061165633001850218", "name": "David Martin", "time": 1483304708729, "rating": 5.0, "text": "It's amazing", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "114297093869021575657", "name": "Ralph Pruitt", "time": 1433766939761, "rating": 1.0, "text": "Want answer the phone.", "pics": null, "resp": null, "gmap_id": "0x888a3c9fa16c132f:0x4a8d12750fd21da"}
{"user_id": "112202558254072482638", "name": "A. Gooch", "time": 1623596200917, "rating": 4.0, "text": "Even though they were very busy they were friendly, helpful and helped to match my son to the perfect dog.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "107314140305438017317", "name": "Sheldon Goff", "time": 1619299971417, "rating": 5.0, "text": "Very committed, very hard working staff and volunteers. Doing their best to care for, and find homes for a never ending tide of animals that need help. We have 2 dogs from there.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "107850006429978510160", "name": "Caitlin", "time": 1606709344992, "rating": 5.0, "text": "We’ve taken in 2 animals from the Florence Lauderdale Animal Shelter. The first we took in earlier this year and he’s adapted well. His age has made him senile. The second we got during the pandemic and the staff was very accommodating to us. The transaction was quick and easy while social distancing. Wonderful place!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMt4delJ2lX0w_oLOWvI5trZLJ_boLGKG0cU7fs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtzOxJhPnvZHcNcCDUzwr9gFWQHgeLCCviDKCN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "108687145016563312765", "name": "Hollie Todd", "time": 1620776070737, "rating": 5.0, "text": "They were very polite and let us spend as much time as we wanted in finding our perfect furbaby. They also have a play room where you can go and spend some solo time with your pet to see how things are between you. We went for a pup but ended up picking our precious Tabby Frank!! They give you a treat bag and allow you to pick a gift to take home with you for your new furbaby! They were all awesome and respectful. They let me call non-stop to check on our Frank when he had his neuter surgery later on and was polite each time. I Def recommend them!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "111154468470196963531", "name": "Amy Vining", "time": 1568008813413, "rating": 5.0, "text": "Absolutely loved this place. Gained my best friend for life. I couldn't ask for a better best friend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNSqebx6LxMsd-O654MrPpkgRV9UTPQv6s_A_Y1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPadmZ04veFrKI6YqODrbgUdLiYtWJSBHHdhqLd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "105663362473902577797", "name": "Breanna Berry", "time": 1620224963513, "rating": 3.0, "text": "(I'm only giving this a 3 star because of the customer service.) I love animals and FULLY support no kill shelters and was super excited to come visit this one. Although I had heard that some members that work here were very rude, I decided to come here very optimistic. The girl who let us in was okay.. She didn't seem too enthused but I figured she was just having a bad day or was just ready to go home, giving it was around 3:45. My boyfriend and I were interested in some of the animals and were asking about them, but everyone we were inquiring about the older lady would respond, \"They're going home soon.\" Which was great but... That's all she would say and literally with every animal we asked about... So in the end, my boyfriend wanted to meet one of the dogs. The lady who greeted us told us they had just got them in and she was looking to see if they were ready to meet. The older lady didnt even look at us and blurted out, \"They're not ready....\" She was just very rude and I CANNOT believe she is still employed here with this attitude. The whole time we were there, we were never greeted with a smile and we felt like we were bothering them with our presence. I sure hope these sweet animals are treated better than customers. If management sees this, PLEASE PLEASE train your employees on customer service. Animals are depending on the families that walk through those doors and the employees are literally running us off....  Losing customers is losing a home for an animal. Very disappointed.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "108265197064953858936", "name": "Jackie Stricklin", "time": 1623173481170, "rating": 5.0, "text": "They were wonderful,  Megan was alsome, she saved the day for my wife an I  , thanks yall very much.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "102100999819414957230", "name": "Derral Upton", "time": 1622688543448, "rating": 5.0, "text": "I rescued my dog , I commend the work they do, keep up the good work!!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "112738780328832520970", "name": "Jen Fleenor", "time": 1621343931161, "rating": 1.0, "text": "Horrible service. They text you instead of talking in person and they dont respond back. They were no help whatsoever. Walmart has better animal control than this place. Dont waist your time calling or \"texting\" which is what they do.. great customer servi6! Not!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "100996114551259501454", "name": "Kristen Hawk", "time": 1617846762183, "rating": 5.0, "text": "Very sweet lady and was kind to us about our missing cat. She was very helpful and got back to me about searching for him also", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "110819314767861265305", "name": "Stephanie Pruitt", "time": 1620761858792, "rating": 1.0, "text": "We dropped off puppies today that were dumped near our house. We had taken them to the vet when we saw what shape they were in. Paid for their puppy shots, treated an infected wound, dewormed them, put them on flea and heartworm prevention meds, and tried for a couple of months afterwards to find them a home. AS A LAST RESORT, we made a surrender appt because we couldn't keep them. We already have two dogs and they kept getting out of the fence. While we were dropping them off, my daughter went to the door to give the workers their toys and extra collars, and the lady told her she shouldn't get anymore dogs. Acted like we were sorry people for taking the dogs up there. Like I would leave these sweet babies with people who are so rude and disrespectful if I had any other option. If the purpose of this shelter is to re-home dogs, someone should explain that to the hateful lady working intake.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "111054026657282420193", "name": "Walt Britnell", "time": 1614451928431, "rating": 5.0, "text": "Dropped off an abandoned cat a former neighbor of mine left behind. Had concerns(she was pregnant, hadn't had food in days, etc). The lady that took her in and did intake reassured me that she would be in good hands!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "109679919681094824350", "name": "Heath Walton", "time": 1619905752376, "rating": 4.0, "text": "I called before going and they where helpful in taking a stray momma cat and her babies that I rescue from under my house. Even told me they would try to get them adopted out", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "106068415117384574889", "name": "Carol Bracey", "time": 1614100340120, "rating": 2.0, "text": "We could  definitely  find more funding  for this shelter especially   to hire more help and public  awareness  about the  needs This was the nastiest  shelter  I've been  to", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "101472098166351189738", "name": "Richard Underwood", "time": 1615401299663, "rating": 5.0, "text": "Very nice place , people need to go here when they want a pet , they have some awesome animals", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "112553954373347546374", "name": "Taj L. Sibley", "time": 1615128090453, "rating": 5.0, "text": "Very nice staff, kennels are clean and animals seem well taken care of", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "114453011821935157111", "name": "Brittany_ Alexandra", "time": 1610597666903, "rating": 5.0, "text": "This was my first time in the building since it's been built and it was so large and clean all the animals seemed happy despite being in the shelter but the staff was friendly and accommodating, highly recommend going here to find your furever friend!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "106102182864050823357", "name": "Toni Roxane Barnes", "time": 1597510668806, "rating": 3.0, "text": "The facility is very nice! Rooms to play with and meet cats and dogs. Had to stand outside for a while even though we had an appointment. They couldn't find the paperwork at first.  Anyway, I adopted the kitten I fostered. I love my little boy! ❤🐱", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "111154468470196963531", "name": "Amy Vining", "time": 1568008813413, "rating": 5.0, "text": "Absolutely loved this place. Gained my best friend for life. I couldn't ask for a better best friend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNSqebx6LxMsd-O654MrPpkgRV9UTPQv6s_A_Y1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPadmZ04veFrKI6YqODrbgUdLiYtWJSBHHdhqLd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "105422348607587674157", "name": "Ella Huddleston", "time": 1607123919877, "rating": 1.0, "text": "Called to ask about a veteranariy visit for my grandpup, Blazer. He has a red sore on his side, and I kinda was asking if they would take payment plan. Big New expensive shelter..I guess for only at a certain income level. I was hung up on twice, ad if He doesn't matter. Merry Christmas", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "113265644632874557622", "name": "Anthony Mansell", "time": 1600784169914, "rating": 5.0, "text": "Outstanding staff and facility. They truly care for and go above and beyond for every cat and dog in their care. Thank You, for ALL that you do!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "108886354510155506780", "name": "Alison Parker", "time": 1606175591662, "rating": 2.0, "text": "The facility is wonderful. But the staff is very rude and unresponsive. I’ve been so frustrated and disappointed by this shelter.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "112121661740984477345", "name": "Kyle Barker", "time": 1600717267907, "rating": 1.0, "text": "Went there to adopt was treated with a we are better than you attitude. I have never in my life felt so disrespected in my life. I went there to adopt an animal and was told we will let you know because we choose the animal for you. Never again will this shelter get my support.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "114543878607934846898", "name": "Stephanie Rose", "time": 1600732365449, "rating": 4.0, "text": "The facility is clean and the animals cages were clean. The issue is that the staff is not friendly, almost to the point of rude. I cannot imagine the things they see and deal with. But I think you need someone who is friendly to work with the public who comes in to adopt.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "104101370179666208838", "name": "Lillie Williams", "time": 1600717717805, "rating": 1.0, "text": "They lie and the employees are very disrespectful... We had looked at a dog that a lot of people were trying to look at. (because they had posted her on facebook) The families who had looked at getting her before couldn’t or didn’t want/have her. Their exact words were, “Unless you decide not to get her, you are going to get her.” We called today because they were supposed to call us back, but it has been 5+ days since we have heard back from them, they said they had found a home for her. The disrespectful part, we came after we had saw the dog, looking for a cat for friend... one of the employees looked at us and said “oh it’s you again” and rolled her eyes. This made us feel very small. You have so many families just trying to get a simple dog or cat, but they bring a dog or cat they THINK you would like instead of letting us see all of the dogs or cats.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "115077145641337430884", "name": "Nikki Hill", "time": 1619113414760, "rating": 1.0, "text": "Rude only giving one star because you have to.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "109104580939348753612", "name": "Paula Jo Scott King", "time": 1589022404384, "rating": 5.0, "text": "We adopted our cat Lola back in late Jan or beginning of February we love her. The staff here love these animal an do an amazing job getting the pets homes. Go by and find a forever pet. Beautifully kept facilities.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "102988906606777607005", "name": "Derrick Horsley", "time": 1598915162071, "rating": 5.0, "text": "This place is awesome really sweet,informative and helpful people and I adopted a kitten which was really easy there,alot easier than some places,so all around i would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "103514040543727945185", "name": "Janice Smith", "time": 1601748392434, "rating": 1.0, "text": "This morning, 10/3/2020, a call was placed, by a Lauderdale County Deputy,  to Animal Services, regarding a horse that was loose. and was in the middle of Highway 20.  This is a busy highway.  They refused to come because they didn’t consider it to be an emergency.  Had someone hit the horse, it could have caused considerable damage to a vehicle, injury, or loss of life.  Very disappointed!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "102266997692478696525", "name": "Nichole Winters", "time": 1598913674769, "rating": 5.0, "text": "The people are all very kind and helpful. The animals all look loved and taken care of.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "117205574687904515407", "name": "Linda Walls", "time": 1609976125571, "rating": 3.0, "text": "Ok place to adopt but could do with  improvements", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "108751643765565900412", "name": "Rachelle Powell", "time": 1577292791610, "rating": 3.0, "text": "It's Yule morning. Volunteered to help. It was great.\nOnly thing I can say bad is that volunteers need to be nice to other volunteers. I've never been here. New to Alabama.  Been here 3 days only. Wasn't expecting an older woman to a be so rude because I was inquiring about volunteering my grooming services.\nHave a Blessed Day\nBlessed Be", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "113343869885371270640", "name": "Jack McLemore", "time": 1599422330975, "rating": 1.0, "text": "I have never been to a animal shelter that asked you to fill out a adoption application before seeing the animals and then wanted to pick the animal for you. The woman was rude and had a better than you attitude. I will not be back.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "108779815364500965458", "name": "Dan Williams", "time": 1606171343141, "rating": 5.0, "text": "Very nice staff and very clean. Go adopt!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "113353216539191203167", "name": "Jonathan Martin", "time": 1604253943308, "rating": 5.0, "text": "Very clean and nice.\nWell organized.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "110527762238132939478", "name": "KarenLynne B", "time": 1596306957527, "rating": 5.0, "text": "This is a no kill shelter with a beautiful facility. People were kind and courteous", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "104505869960681609073", "name": "Jessie YOUNG", "time": 1598490967266, "rating": 5.0, "text": "Clean. Beautiful assortment  of dogs and cats. Fantastic people!!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "117689724986105994856", "name": "BigOleTater", "time": 1596301943405, "rating": 5.0, "text": "Sweet people that love what they're doing. Very helpful!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "105971926070680545012", "name": "Alyssa Schoener", "time": 1596393625194, "rating": 1.0, "text": "Late posting but here was my one time experience with this shelter. They are extremely rude and unprofessional staff! When you claim that you need animals gone and people show up to take a look to adopt but you yell out that you’ll be closing in 30 mins and to come back tomorrow, you need to be shut down. They only care about going home on time and not the animals there. Possibly prejudice", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "105650551738113303290", "name": "Music Man (Music Man)", "time": 1591892060083, "rating": 1.0, "text": "They lie... I been waiting on a call for over a week. I was supposed to get it last week. I have barking & aggressive dog problems for a year now & I have made trips to the Animal Shelter & numerous calls. It has all fallen on defense ears...", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "118199026716299764170", "name": "megan britnell", "time": 1593494389999, "rating": 5.0, "text": "the employees were very nice! the dogs are sweet!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "105890867385014128294", "name": "Beverly Emerson", "time": 1618051185299, "rating": 5.0, "text": "Love this place", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "115201810358276651899", "name": "Waylon Harper", "time": 1594773885290, "rating": 5.0, "text": "Excellent new facility! Lots of animals needing a home!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "105860758291233608911", "name": "Aaron Marquardt", "time": 1599067389304, "rating": 5.0, "text": "Great improvement from the old location.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "106438473269061220094", "name": "Francesca R", "time": 1565515718582, "rating": 5.0, "text": "The new facility is beautiful. Still the same great staff. Keep up all the great work you do!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "111900675746596524715", "name": "Doreen Hendrix", "time": 1572799809604, "rating": 5.0, "text": "Great, hardworking staff. Florence has an animal shelter to be proud of. Found my sweet Izzygirl there three weeks ago.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "106450931202625551162", "name": "Amy Vining", "time": 1579324241616, "rating": 5.0, "text": "This is where I rescued my best friend. My fur baby Evie. Best dog ever.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "106019783907391125418", "name": "Susie Rickard", "time": 1586192131290, "rating": 5.0, "text": "Friendly staff and clean facility.  Go walk a dog they need love too", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "107644151635471985163", "name": "Bretley Clark", "time": 1585683532010, "rating": 5.0, "text": "The best shelter I have ever been to!! I wish I lived closer so I could volunteer!!!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "103352329437668438419", "name": "Brian Cain", "time": 1588621427214, "rating": 1.0, "text": "My wife just had to drop off some kittens today and had to deal with some very rude and disrespectful employees. She was already crying her eyes out over taking them to the shelter and then had to deal with some very awful employees. If you ever have to drop something off or are wanting to adopt be prepared to deal with some very disrespectful employees.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "102850557388257476895", "name": "Eric Dumas", "time": 1601905373483, "rating": 1.0, "text": "The meanest staff i know", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "113317868566803357728", "name": "Christine Fediuk", "time": 1597778220734, "rating": 5.0, "text": "The staff is friendly and nice!!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "109725114628151901167", "name": "A W", "time": 1574034645080, "rating": 5.0, "text": "Very nice facility. Nice staff.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "103406083022388610638", "name": "Tabatha Logan", "time": 1602106385339, "rating": 5.0, "text": "Very great experience", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "110207476608312735764", "name": "Melissa Allison", "time": 1600274343290, "rating": 5.0, "text": "New, clean, and adorable babies!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "110675609817496062460", "name": "Lisa Rice", "time": 1583204235502, "rating": 5.0, "text": "Beautiful new building. Staff is friendly.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "114737550691986337731", "name": "Greg Hayes", "time": 1566545620596, "rating": 5.0, "text": "Thanks for all the works for what they do for the dogs", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "106740279232047359746", "name": "James Montgomery", "time": 1570292411436, "rating": 5.0, "text": "Any no kill shelter gets high marks.", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "104353921412514966146", "name": "Sueann Soto", "time": 1567635937894, "rating": 5.0, "text": "Great staff and clean .", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "104385420892202197958", "name": "Jami Housman", "time": 1609723415344, "rating": 5.0, "text": "Awesome!!", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "108495197059006630335", "name": "Dennis Liles", "time": 1584463186470, "rating": 4.0, "text": "No comment", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "103945949080058047237", "name": "Xxlxvelydxeams 123xX", "time": 1576450180236, "rating": 5.0, "text": "Awwsommee staff", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "117410215064205484339", "name": "Michelle T", "time": 1579751101134, "rating": 5.0, "text": "Wonderful people", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "116422430757547246653", "name": "Kathy Seybold", "time": 1577312096532, "rating": 5.0, "text": "Always adopt", "pics": null, "resp": null, "gmap_id": "0x887d3772afaefd8f:0x1a1dc74bdcbe476b"}
{"user_id": "103936213969808859491", "name": "R M", "time": 1621120569945, "rating": 5.0, "text": "I got my second foster from there and the experience was great and very smooth. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "101736715417331208251", "name": "Anna Caroline", "time": 1603814647571, "rating": 5.0, "text": "Beverly was so sweet and helped my sister adopt a kitten! We tried to visit a different animal shelter, but the phone line was busy for well over 30 minutes. So we called North Baldwin Animal Shelter. Beverly answered and she told us that due to covid we couldn’t actually enter the building which was fine with us because we know how safe everyone needs to be in times like these. So we told her what we’re looking and she recommended an 8 week old kitten that matched what my sister was looking for perfectly. We then got an appointment that day as soon as they opened with no difficulties at all! Once we arrived, Beverly brought the kitten to the car and we got to see how we liked him and it took literally 1 minute to realize we were in love with this cat. Beverly made the experience so much easier than any of the other animal shelters around here! Definitely will be visiting here when I adopt my first pet!", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "114733213426142865228", "name": "Bobby Clayton", "time": 1615994075101, "rating": 3.0, "text": "Very friendly but gave bad advice about heartworms per Delta Vet. Heart guard does NOT treat existing heart worms. I love Mona.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNVInPqE8hZCGzb9-Fp6zczzTOVJ8MKqkFxExka=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "100022278792746803368", "name": "Cheryl Conway", "time": 1617661086326, "rating": 1.0, "text": "I tried to go see some dogs...they told me it wasnt a good time,just got back from spring break.They are only open 2 1/2 hours a day,put up pics of dogs,but dont want you to come there.Shame....adopted my last dog there and she was a treasure.The woman on phone was so rude! Such a shame! I am a dog lover and wanted to adopt from there.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "102605831280899573469", "name": "Wade Tolbert", "time": 1579724273478, "rating": 5.0, "text": "Adopted these two little cuties over the weekend. They are loving their new home. Always adopt don't buy!! There are lots of animals that need a good home. The staff was very friendly and helpful, looking forward to walking dogs for them soon in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwBop0AOCZolx7a2QbbmkpKAc430VBTOI8UxB9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "103295861839215092770", "name": "Sydne Rawls", "time": 1602035339863, "rating": 5.0, "text": "You can tell how much this place loves what they do! They work very hard to make it a safe and clean space for animals. They are also SUPER easy to work with through the adoption process!! Thank you NBAS!!", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "116089437142319685231", "name": "Erik Weekley", "time": 1616554644365, "rating": 1.0, "text": "How about actually have a website so one could look into adoption.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "113536626796489248141", "name": "Stephen Williams", "time": 1502500924433, "rating": 5.0, "text": "A gracious example of what people can accomplish when they are passionate about animals.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM51k0y0D5zoQAYyYzzxRubSPihwHcp6A7yvdu0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNlKWNKrXgX7RoqybKO6pBj1u-PGCuYaHn5rYGE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPurh7VK2DVXylS4pvQrAHCIes7verraFTml4_d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1SkKqmUry4QMCaBm-NkrE7nqwPonPZHnFWprh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgQGLxaMBoul_S0xOMElZObwFRf4fmT-zHt1Q5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNUf4LW2RShQ-9KrH8u5nRXTYqdDrD-A5Rzt4j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZZ0MY8fnJzw7iR-n94IR9PGndaf_3wtNhW4Ny=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvnAshccuIaNRMbJhdx9fCyCwMDrNYRJzrTEO6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUpX3NXYWjPkVMKFDFevHYgygbe7jhUkuoR1Ka=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "115217789622545580831", "name": "Mikey Carter", "time": 1533729145614, "rating": 5.0, "text": "Love this place, the staff is absolutely amazing very knowledgeable about the animals they get in and are willing to take the time with you and the adoption. They don't push or rush you they allow you to take your time. There absolutely wonderful.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "104495721588716894872", "name": "Scott Vinson", "time": 1622907985754, "rating": 4.0, "text": "Got a dog .", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "114563327091985254252", "name": "Alpha Bonding (Alpha Bonding)", "time": 1552579767208, "rating": 5.0, "text": "This no kill shelter has an extraordinarily benevolent staff.  Plenty of wonderful animals to adopt here.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "111101848092776046989", "name": "Crystal Miller", "time": 1578182357858, "rating": 5.0, "text": "The staff are great and we drove away with a new member of our family.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "109591564976495733281", "name": "JD Guess?", "time": 1531583188656, "rating": 5.0, "text": "Great ! They really care about these homeless dogs and cats and they treat them very well. Also they really want to find a great home for them.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "113742585615718466606", "name": "Erin Bryars", "time": 1460896894396, "rating": 5.0, "text": "The staff and volunteers that work here are awesome! You can tell that they love all of the pets that they care for. I would definitely recommend adopting a pet from this shelter if you live in Baldwin or Mobile county!", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "104686946616582078558", "name": "Bruce Andrews", "time": 1567291298101, "rating": 5.0, "text": "This is the place to go for a loving animal adoption.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "109266888797871113022", "name": "Carmen Higgins", "time": 1538780105805, "rating": 5.0, "text": "The staff are wonderful. They do such a great job caring for the animals.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "109718206963420488462", "name": "Teresa Neville", "time": 1550350562034, "rating": 5.0, "text": "Wonderful staff wonderful shelter,  they are all about helping animals!", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "117571993670028646011", "name": "Joyce Paulson", "time": 1524752894469, "rating": 5.0, "text": "No kill shelter. Excellent caring staff", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "117571993670028646011", "name": "Joyce Paulson", "time": 1524752894469, "rating": 5.0, "text": "No kill shelter. Excellent caring staff", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "103607384569339224538", "name": "dawson wood", "time": 1391197729448, "rating": 5.0, "text": "This shelter whereI I got my puppy Kailey with I later named Haven and she's a loving and caring canine they take great care of there animals at North Baldwin animal clinic so please adopt an animal and take great care of him/her.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "105693581736627025029", "name": "Tedie Mulligan", "time": 1521741219194, "rating": 5.0, "text": "Very clean facility. Employees & volunteers are nice.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "111742435118004979656", "name": "David Faulkner", "time": 1527115332473, "rating": 4.0, "text": "Got a new cat", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQ35_XzLgE9wwWAExQbX6wLZV78W6V40G0lYTO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "100174472431080326955", "name": "Always A&A", "time": 1495787499985, "rating": 4.0, "text": "Great little shelter. Friendly staff", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "106727525587888055361", "name": "Alexis Harlee Jay", "time": 1551814892755, "rating": 1.0, "text": "You need to add your hours to your website.", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "101870943326614727053", "name": "Kala Richardson", "time": 1555419467647, "rating": 1.0, "text": "One of the staff members is very rude!!!!", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "111426202842177200008", "name": "Kris Wolff", "time": 1548533366086, "rating": 5.0, "text": "Wonderful people", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "104356799493071196718", "name": "Beverly Poiroux", "time": 1621179784718, "rating": 5.0, "text": "(Translated by Google) Buy\n\n(Original)\nKoop", "pics": null, "resp": null, "gmap_id": "0x889a8a3fca0d7d25:0x72f9fa73257fe7e6"}
{"user_id": "102360661851503605760", "name": "Rachel Phillips", "time": 1620421788712, "rating": 1.0, "text": "Called to ask about a dog, took my kids to meet the dog and then returned with my other dog for a meet and greet. During the phone call and initial meeting they never told me the dog had heart worms. One of the other girls told the manager she had concerns because I told her the dog would be outside which was a lie - I specifically said we have an open door policy and the dog would be inside or outside whenever he wanted and we also had a fenced backyard for extra safety. I am extremely upset that I was never told about the heart worms before I took my children to meet him because now I have three upset kids who fell in love with a dog we cannot adopt. It would be great to have important things like that listed on the website and told to people who call asking if there’s any important information they should know about a dog they’re interested in. They also said my vet didn’t have any vet records which wasn’t true (I spoke with my vet, the records are not complete which is the vet’s error but they did have some record).", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "110366124387231467614", "name": "Carl B", "time": 1591495144303, "rating": 5.0, "text": "Our dog Molly came from the shelter and she is the PERFECT family pet.  Always calm and loving inside (even when the kids are loud and running around) and playful and energetic when we go outside.  Loves running with us and, weirdly for a dog from Alabama, LOVES playing in snow.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDF8-5h1luPuVvfBYHlmI6az5zygHeaMT_znh_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2u1JaFtcNHqmcPNxP-_oX_U8xlo2P45mgozV6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1U8Bd2xvktHYSxxQ0FY7o0RJzstUoJJF9KFRb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "100799003414622435794", "name": "Brittney Drummond", "time": 1621698549854, "rating": 5.0, "text": "Loved this place they way they love the animals is amazing", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "107303647830153577116", "name": "Amberberdawn", "time": 1619041673707, "rating": 1.0, "text": "Doesn’t return phone calls", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "115678611927859168720", "name": "Alex Czako", "time": 1618103150064, "rating": 5.0, "text": "Very friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "112187373128068655943", "name": "Virginia Blackwood", "time": 1609810894137, "rating": 5.0, "text": "Kind and caring. Very helpful.", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "110984955129741250669", "name": "Larkin Self", "time": 1605734406367, "rating": 1.0, "text": "They were very unprofessional and refused to show me the dog that I wanted to see. Wanted me to bring home a dog that they said was full of heartworms.", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
{"user_id": "106198576007704998967", "name": "Ed Persons", "time": 1570731639913, "rating": 5.0, "text": "Lindsey, Erica and the staff provide able stewardship over the lives of these beautiful hopeful animals.  Empathy and compassion reign in this vital safe haven.  Let's all do more to support their worthy mission.", "pics": null, "resp": null, "gmap_id": "0x8888611733a55555:0x9cb118f8c690dce8"}
