{"user_id": "112102322518291570215", "name": "Ehrrensmommy", "time": 1471484252574, "rating": 5.0, "text": "I'm so glad I took the trip to see his dogs.  Please only serious Rottweiler owners and dog lovers need to visit.  This man loves his dogs like family!!!! We love our new puppy.", "pics": null, "resp": null, "gmap_id": "0x888a1c9583fb8adf:0x44f404795c43dfd"}
{"user_id": "107530485026851343816", "name": "Poppi Gee", "time": 1469585004744, "rating": 5.0, "text": "Nyle is a great guy.  He has really good dogs.  A must see.", "pics": null, "resp": null, "gmap_id": "0x888a1c9583fb8adf:0x44f404795c43dfd"}
{"user_id": "106773925008625440468", "name": "Debbie Kiser", "time": 1476338178074, "rating": 5.0, "text": "Close to Home, Great People!", "pics": null, "resp": null, "gmap_id": "0x8861d2f4af39b08f:0x2bac80386947793"}
{"user_id": "102255395368393794112", "name": "Anisa Hunter", "time": 1627090680242, "rating": 5.0, "text": "Our dog, Miles, loves his getaways to the Hot Diggity Doggie Camp. The staff there always have your pet’s care & safety at front of mind, and they are quick to contact you if there’s any concern. Miles gets plenty of fun playtime and exercise during his visits. I would definitely recommend taking your pet there!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMy5a2mWKlvrqj03mBftGaAq1CjCDy1zkU8XNwf=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "100747760966974625136", "name": "Jenny Keogh", "time": 1625797643624, "rating": 5.0, "text": "I enrolled my rescue in Hot Diggity Doggie’s levels program to work on leash walking and to build more of a bond between the two of us. Unlike other puppy kindergartens I looked into, HDDC’s program has multiple levels you pass through before “graduating” so the skills my dog learns aren’t forgotten as soon as we leave the class. The trainers are so knowledgeable and work with each dog individually and helps the owners understand their dog. I’ve noticed a HUGE difference in my dog’s obedience and manners when I take her out in public.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-P4JZ0SAY7PnCJ97hMKyL-PHgTe9CQnXliqOi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORYNYbnwmNzM5HQJZVluZNashLOmqvfJUILs1U=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "101098605169945184688", "name": "J. Ashley Ewing", "time": 1627304370332, "rating": 5.0, "text": "Asking and providing a bath as part of an extended stay.  Letting me know about an issue they saw during the bath. Always very friendly.  My dog always seems happy to see them anytime I drop him off.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "100000717061421181989", "name": "Amanda Phifer", "time": 1627223823636, "rating": 5.0, "text": "Love HDDCamp for our dog Layla!  They always take such great care of her ❤️ and find a way to fit her in when we need a place for her to stay!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "111967046855654219985", "name": "Bambi Smith", "time": 1614222225246, "rating": 5.0, "text": "Our home away from home for our little fur baby.  He LOVES Hot Diggity and nearly jumps out of the car window he is so excited when we pull up.  We know he has a great time and is very well cared for.  There is no better place for pups and I don't know what we would do without them!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNjIMAd_Ma8yR6GXGZ8mpFMQxGC1QHMYn--Wafk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "108863520578511907755", "name": "Courtney Carter", "time": 1614739357008, "rating": 5.0, "text": "I cannot speak highly enough of Hot Diggity Doggie Camp. My dog, Kevin, attends day camp while I’m at work. The staff are very personable and address my dog by name each morning. The pick-up and drop-off process is seamless. My dog receives great attention and exercise. I can enjoy my day at work knowing he is well taken care of.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "113271660735824992089", "name": "Grace Lee", "time": 1612053345746, "rating": 5.0, "text": "Hot Diggity is the BEST!  I started using them in 2008 with my first dog, Olive, and have continued to use them with my current dog, Elsa.  The original owner, Amy Trice, was fantastic, and the new owners, Liz and Brooke, continue to provide excellent care while expanding the services provided.  They have two large yards- one for large dogs, and one for smaller dogs- that are equipped with tons of equipment for the dogs to play with.  The staff are always friendly and helpful.  They regularly take in fosters and hold fundraisers for local charities.  In addition to their Puppy Kindergarten Obedience classes, they have recently started a Levels Training class that helps reinforce basic skills, as well as some more elaborate tricks.  I am so glad they are part of our community- coming from Chicago, I had worried about finding a reliable doggy day care and am so glad that they are here to provide this valuable service!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "113161331547040513483", "name": "Susan Stabler", "time": 1621295700400, "rating": 5.0, "text": "My dog always enjoys himself at HDD. They have been very flexible and it is the only place I can leave him and not worry about him having a great time and will be loved. Gave him a great bath also. Wonderful experience... as always!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "106443478492848018011", "name": "Lori Turner", "time": 1613608225731, "rating": 5.0, "text": "Hot Diggity is wonderful. My dog gets lots of exercise and gets to play with other dogs. She gets so excited when she knows it’s a Hot Diggity play day. The staff are exceptional. Everything is so organized. We love it. Strongly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "117801829881865422818", "name": "Taylor Crowe", "time": 1613603853394, "rating": 5.0, "text": "They care so much about my pup and are always willing to help out when needed! They always know my baby the second I pull up to drop him off. They are personable and go out of their way to check on your pup if they are injured. I also love that they have student discounts! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "102147814680459825948", "name": "Nancy Williams", "time": 1617915409158, "rating": 5.0, "text": "Thanks so much for taking such great care of Scout. Great job on the bath too!  We both look forward to seeing you again soon.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "111538054363032340610", "name": "niki arendale", "time": 1614988422074, "rating": 5.0, "text": "We are new to Hot Diggity Doggie Camp and have nothing but positive reviews. The staff has been very welcoming and super nice. And all the dogs including mine seem to be well cared for and happy.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "100869429666044535355", "name": "Sarah Macon", "time": 1613607829703, "rating": 5.0, "text": "We Love HDD! Our Beagle boy had a ball playing there and we board there as well. It’s so nice to not have to worry about our pup being cooped up in a crate for days like the vet does. He gets to run and play and be with his pals! The staff is so friendly and they love the pups like their own!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "115717949032705597754", "name": "Kelsey Summerford", "time": 1615139298095, "rating": 5.0, "text": "Our dogs absolutely love staying at Hot Diggity. I’m pretty sure they would never leave if we didn’t make them. We have older dogs with meds, and I trust them 100% while our pups are in their care. It’s obvious how much they love their clients and their fur babies. I always recommend Hot Diggity when anyone asks where they should board their dogs, do puppy classes/other trainings or do daycare.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "115430559640324030659", "name": "Michelle McDaniel", "time": 1614040326557, "rating": 5.0, "text": "Shep loves playing with his friends at Hot Diggity Dog Camp. A great place for your dog to play and get exercise. All the workers are very skilled in relating to the dogs. Highly Recommend HDDC. Included is a picture of Shep after he gets home from a fun day at HDDC.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMy7S2JB8ccypAbUBV_rlRZMMebZGkICX4oPagR=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "100278038115037790733", "name": "Madeline Gentile", "time": 1620600431180, "rating": 5.0, "text": "Hot Diggity is our go to for dog daycare in Tuscaloosa! They are truly the best and are so welcoming to our dog, Max. He gets so excited to go to daycare and always has a great time! We recently started their levels training program and are LOVING it!! We are learning so much and seeing IMMEDIATE results! Highly recommend to anyone in the Tuscaloosa area!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "114042300757181967619", "name": "kenlee west", "time": 1614632001220, "rating": 5.0, "text": "My dog Kirby loves to go to the Hot Diggity Doggie Camp. He gets to play with his friends which he loves. I know he loves it because when we drive up to the camp, he can't wait to get out of the car. The staff is exceptionally kind and caring.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "102585768795838862606", "name": "Lindsey Sobeck", "time": 1622169560210, "rating": 5.0, "text": "My dog loves it there and always comes back tired and ready for a nap! This place is great if you want a place you can trust with your pups!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "101754748073239378024", "name": "Montana Fouts", "time": 1620516615715, "rating": 5.0, "text": "Love this place so much! My pup is stubborn and doesn’t like to leave me but loves coming back and sprints to the door! Appreciate this place and such amazing people!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "112729011286111142005", "name": "Isa Lazo", "time": 1613332419684, "rating": 5.0, "text": "We recently adopted a pit mix pup and started him in the levels training program. It has made such a difference! We are amazed how quickly he has progressed. Everyone is so knowledgeable and patient- we look forward to going to class each week and love seeing our dog learn", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "117786548715951994089", "name": "Susanna Whitehead", "time": 1614049701334, "rating": 5.0, "text": "Murray the boxer is a regular day camper. The staff love him and have gone above and beyond what was required of them on multiple occasions!! Murray is very energetic and they’ve exercised, played, bathed and paired him with other dogs that can tolerate his enthusiasm:)\n\nHe is a better dog at home because of Hot Diggity!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "109890055613340598042", "name": "Kailey Roberts", "time": 1619224150036, "rating": 5.0, "text": "Couldn’t be happier with HDDC. I was worried about sending my pup to daycare, since he is missing a leg but they take amazing care of him and I never have to worry. Some days I pick him up And I think he’s sad I’m there to get him. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "115171297931689546734", "name": "Mary Rogers", "time": 1619896932845, "rating": 5.0, "text": "We have been taking our girl to the levels training class for a couple of months now, and the results were almost immediate with our Winnie! Not only has she learned some cute tricks, but, more importantly, she’s more\nobedient, more attentive to us, and more excited to learn. Before HDDC levels training, we had tried to teach Winnie basic commands and few tricks, but Winnie would either learn a command and decide to not do it, or she would be really discouraged if she couldn’t figure it out! Liz, Destiny, and the other trainers have really helped us understand how to communicate well with Winnie and have taken the time to talk through additional problems or concerns we’ve had with her behavior at home. Winnie loves going to class; it is definitely a highlight of her week! If you’re looking to refine your dog’s behavior and skills, I would 10/10 recommend HDDC levels training.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "114254956624561529264", "name": "Jeff Craft", "time": 1611966689470, "rating": 5.0, "text": "I started bringing my dogs to Hot Diggity in October 2018 when my wife was traveling all week every week.  I was there a lot and kind of still am.  Our dog family has grown over time and I really consider Liz and Brooke and the staff part of our family.  They take great care of our pets.  Right now I bring 2 of my larger dogs there.  They are big and not the best-behaved but the staff there is always happy to see them and take good care of them even when they are a handful.  I can’t recommend Hot Diggity enough and I wouldn’t write a review if I didn’t mean it.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "105511126330438815056", "name": "Caitlin Thoma", "time": 1614544227638, "rating": 5.0, "text": "Junior loves going to play! He always comes home tired and ready to take a nap. I really appreciate the staff for getting to know Junior’s personality and pairing him well with other dogs.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "106967723641543971716", "name": "Krystal Cunningham", "time": 1615172852324, "rating": 5.0, "text": "I think this place is great! They don't just dog sit they actually get out and interact with the dogs. I have a pit bull who is full of energy but every time she leaves this place she is dog tired lol. This is the best dog camp ever!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "115546079762503027414", "name": "Abby Sutton", "time": 1614359643129, "rating": 5.0, "text": "Ive been taking my baby to HDDC for over a year and I have to say it is THE BEST DOG CAMP IN THE WORLD! They offer easy and effective training classes, daycamp, boarding, and even late stays for those of us who have to work late. I’ve used all of these and have been 1000% pleased with my experience. They truly treat every dog as their own. The staff is wonderful and caring. My dog always gets so excited when we pull into the parking lot and is exhausted from playing all day long by the time I pick him up. I would never take him anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "117738819166764585203", "name": "Kathy Wetzel", "time": 1614097189839, "rating": 5.0, "text": "Finding the perfect day camp and boarding facility for my spoiled Goldendoodle has been a godsend to me!  The staff at Hot Diggity provide quality service and treat their four-legged guests with love, respect, and genuine care.  Lola is always excited when we pull up for drop-off and she is exhausted when I pick her up at the end of the day!  It is apparent from her demeanor that she is well cared for while she is there.   I highly recommend Hot Diggity Doggie Camp!!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "113865069865216417352", "name": "Noah Hammonds", "time": 1613960185312, "rating": 5.0, "text": "Our 6 month old fur baby, Bean, loves doggie day camp. He comes home smiling and worn out. With him having so much energy, this place has become perfect for him to play while the parents are away!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "102067121486696647766", "name": "Virpi Hamner", "time": 1613783644404, "rating": 5.0, "text": "I highly recommend Hot Diggity Doggie Camp. My dog, Saaga, loves it there. She already knows where she is going as we turn to their driveway. All the staff are extremely friendly and helpful.  I know they will take good care of my Saaga in my absence!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "103617259891343185430", "name": "Carol Jackson", "time": 1617838380369, "rating": 4.0, "text": "Kiki has the best time at Hot Diggity! She can barely contain herself when we turn there. She plays hard with her friends, then sleeps very well!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "117079593253277212326", "name": "Julie Vence", "time": 1613063065146, "rating": 5.0, "text": "I have been bringing my dog to HDDC for almost two years now for both boarding and day camp! I don't really trust many people with my boy, but I LOVE this place and so does he! I have a really complicated work and travel schedule and they are always so accommodating, helpful, and flexible. The entire staff is so awesome, and I would highly reccommend all of their services to anyone! :)", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "107512600877721862926", "name": "Thom O'Rourke", "time": 1612880674662, "rating": 5.0, "text": "My Dog Dax loves going to training. The staff is talented and patient. It’s been a great experience.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "113775246445261911439", "name": "Tina Miller", "time": 1610242926252, "rating": 5.0, "text": "I have two adopted rescues, Janie and Tyson, and take them 2-3 days a week to day camp at Hot Diggity Doggie Camp. I cannot tell you how comfortable I feel leaving our fur children in the extremely capable and loving hands of each of the staff members there. Liz and Brooke, the owners, are dog trainers, experienced in every aspect of dog behavior. They not only have several dogs as personal pets, but they also once served as the live in caretakers for The Humane Society of West Alabama's doghouse. At HDD, there are several play yards along with an indoor facility when the weather isn't the best for outside play. A daily schedule is followed, and every dog is supervised and loved on. I also board my two at HDD when we travel. I love their hands on approach, their communication via email and social media, and I just love this business!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "101762923584419214186", "name": "Mary Liz Curtner-Smith", "time": 1621982180173, "rating": 5.0, "text": "They take great care of your doggie.   My dog loves it here!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "106098733931879354143", "name": "Emily Zapinski", "time": 1612062453894, "rating": 5.0, "text": "I cannot recommend Hot Diggity Doggie Camp enough!!! They are incredible. We are in their Levels training program, and Liz, Destiny & Ashlyn are so knowledgeable, kind and helpful. Our dog (and us) have learned SO MUCH. THEY’RE THE BEST!!! 🐶🐾", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "103420622787405663821", "name": "Buford Boone", "time": 1620135380003, "rating": 5.0, "text": "We love Hot Diggity.  We are \"2nd generation clients\".  We have been clients there since 2012.  It is so refreshing to have trust in those that care for our 4 leg family members.  HDDC members are like family to us.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "115976542021989642805", "name": "Mollie Gillis", "time": 1614453893578, "rating": 5.0, "text": "This place is the best! Our dog loves going to HDDC and the staff is so sweet, knowledgeable, and great with dogs! 10/10", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "106264270928845056354", "name": "Karen Hulsey", "time": 1615148647151, "rating": 5.0, "text": "I love Hot Diggety Dog. My dogs are happy there. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "104279226305313598482", "name": "Angie Martin", "time": 1613601142664, "rating": 5.0, "text": "We love Hot Diggity Doggie Camp! They love our Jaxon as well as all their camp pups! They are exceptional as Jaxon’s home away from home!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "104541195613389751488", "name": "Logan Elkins", "time": 1623710337719, "rating": 5.0, "text": "My 1.5 year old loves coming here and is always worn out. And for the price it is, it’s totally worth it to have him occupied all day!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "118054217001048148735", "name": "Melissa Faulkner", "time": 1623284404105, "rating": 1.0, "text": "Will never be back. They try to cheat you out of your money. It happened once and I let it slide but they tried it again  but this time I pre-paid so there was nothing they could do. Plus my dogs came home COVERED in FLEAS AFTER I PAID FOR A BATH!!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "103004946510411858729", "name": "Jennifer Baggett", "time": 1613947491143, "rating": 5.0, "text": "Queen Sugar, our treeing walker coonhound, absolutely loves HDD!  She enjoys playing with all of her furry friends, and she always comes home exhausted! HDD has very friendly staff, and I love that someone stays with them throughout their stay!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "117744210384713700173", "name": "Margaret Ila Christian", "time": 1615037607825, "rating": 5.0, "text": "Merely mentioning a trip to the dog camp sends my dog into zoomies. When we round the curb to approach the camp, she starts prancing in her seat. The staff is always excited to see her and when I have had extreme circumstances in the past, they have accommodated. Can't say enough great things about Hot Diggity!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "116307028564435652421", "name": "Charis", "time": 1618702295725, "rating": 5.0, "text": "My dog loved it and came back tired from running around and having fun", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "114328647872443304633", "name": "Duncan Kessler", "time": 1614036779896, "rating": 5.0, "text": "My Doberman Pinscher \"Diesel \" has been going weekly for about 3 months & absolutely loves it. Brooke and the entire staff are AWESOME!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "105466934239205569433", "name": "Princess", "time": 1598900188878, "rating": 5.0, "text": "Great puppy kindergarten class!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOO0MnSct-dLMehdA3BrBQYE2jdDpBNV6OlQuL9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "113690778699668205184", "name": "Jennifer Brown", "time": 1538005151505, "rating": 5.0, "text": "I’ve been a customer of Hot Diggity Doggie Camp for 4+ years now. Amy, Liz, and Brooke take great care of my pup. The dogs play most of the day and mine comes back exhausted by the end of the day or after boarding. Amy did Puppy Kindergarten for my dog and other and that initiated my love of her and what she has built as a business. Great group that I will continue to use often.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "108532195673044011288", "name": "wspanic008", "time": 1559410906411, "rating": 5.0, "text": "Love the people here!  We just started puppy classes and already learning tons from the staff here. Would advise anyone in the area to use any and all of the services here!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "114844118936180020709", "name": "Typical Reece", "time": 1538003565518, "rating": 5.0, "text": "Best place in the Tuscaloosa and Northport area to take care of your fur babies. I took my Iris girl there for years. She always got so excited when we pulled in the driveway because she knew it was time to play. She loved Dogcamp!!! The staff is amazing and friendly and genuinely care about the pups like they are their own. If I could give them 10 stars I would!!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "117194269749305788777", "name": "marie armistead", "time": 1538003984318, "rating": 5.0, "text": "This place is so awesome.  The staff is so friendly. They really put alot of Love and Time into each fur baby that is there.  Excellent !!!!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "104483374747106205681", "name": "Gene A", "time": 1538004769830, "rating": 5.0, "text": "Amazing place.  They greet us at the car as we drive up and treat our girls like we are dropping off them off at preschool.  Brooke, Liz, Amy,Bailey, Sherry, Paige, Payton and Cynthia are alway so friendly knowledgeable.  Littlebit and Paisley love it there and that is so important to us.  I recommend Hot Diggity Dog camp to anyone who cares about their pet and wants to have the luxury of leave them with out worry.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "114770193620928528137", "name": "King Craig", "time": 1584427098395, "rating": 1.0, "text": "Put my puppy on a waiting list,for training they never contacted me...", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "109278634506214147738", "name": "Cody Key", "time": 1538003160178, "rating": 5.0, "text": "I love the staff here! They are all so friendly and great with my pups! Would recommend this place to anyone!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "114047047491047363345", "name": "Hollie Swain", "time": 1535405052316, "rating": 3.0, "text": "I left my 1 year old lab/hound mix with the Hot Diggity Doggie Camp for 7 days while I was in Mexico on vacation.  I called several times just to check on my dog with no return calls for 3 days, at which time Amy  finally called and informed me that there had been an incident of aggression that my dog was involved in.   I was also promised pics of my pup while he was there.  I received no pictures, and when I returned my dog had lacerations around the bottom of his throat and puncture wounds on the inside of his thigh from an \"altercation\". I was not notified if my dog received at least first aid care, and the attendant had no information when I arrived. I understand that dogs may often have toy and treat aggression.  I am uncomfortable with the lack of communication and supervision.", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "104857857728854434557", "name": "Matthew Dennis", "time": 1518302343451, "rating": 5.0, "text": "Great Doggy Daycare the crew there is awesome and Ruby loves it", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "104241037747554817827", "name": "Rebecca Allen", "time": 1627937225108, "rating": 5.0, "text": "Still such a high-quality service, even after Amy’s retirement some while back. Chloe Dog, Chiweenie extaordinaire, loves it still at age 16!", "pics": null, "resp": null, "gmap_id": "0x88861d7b7effaf59:0x814dfbd93d06b724"}
{"user_id": "113883936617606797713", "name": "R S", "time": 1595903234297, "rating": 5.0, "text": "These guys are amazing! They were super helpful and kind! I was able to pay for what I needed over the phone and they loaded it all in my vehicle without me getting out. (Awesome during Covid times!) I had to drive extra to get here because Arab store (which are awesome people too!) didn’t have what I needed in stock. Thank you for providing great service to our community!", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "113304444169528009933", "name": "Tim Pinkard", "time": 1616540448847, "rating": 5.0, "text": "Use the Cullman Farmers Co-op all the time. Good place with good people running it.", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "115916432173727001895", "name": "Carlos Villar-Gosalvez", "time": 1617380562102, "rating": 5.0, "text": "Good place to get pig food", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "101592885521181444026", "name": "Deborah Cox", "time": 1610675806162, "rating": 5.0, "text": "Is there any other Co-op this place treats you like family an a friend. No one could do or be better.", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "101765554492139546168", "name": "Renah Smith", "time": 1625968219456, "rating": 5.0, "text": "Fast service", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "105120084918163923741", "name": "Jeff Cornett", "time": 1608393283793, "rating": 5.0, "text": "Great place 2 buy farm items", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "109855152085503550066", "name": "Nancy Henry", "time": 1621539771922, "rating": 4.0, "text": "Has everything I needed", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "107865931591975136075", "name": "Renee Davis", "time": 1619606022792, "rating": 4.0, "text": "Very friendly people.", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "102167470908782934611", "name": "Ginrin", "time": 1588329156482, "rating": 5.0, "text": "Good selection, helpful staff.", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "114648412151169291047", "name": "teresa drinkard", "time": 1538801042116, "rating": 5.0, "text": "Allway's great service  and friendly  help..", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "109160445640265152711", "name": "Russ Moore", "time": 1534246125870, "rating": 5.0, "text": "Good prices, helpful people", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "112181625453044693818", "name": "Donald Towers", "time": 1526135066641, "rating": 5.0, "text": "Great people  and farm products", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "112701173443294778305", "name": "Veronica Keith", "time": 1454430601516, "rating": 5.0, "text": "Great store with knowledgeable and helpful employees", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "116613698869536202825", "name": "Tim Black", "time": 1582576660980, "rating": 4.0, "text": "Anything you need for the garden", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "111630316685807091755", "name": "Kasey Minor", "time": 1508170419379, "rating": 5.0, "text": "Very helpful everytime", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "112638448390811487434", "name": "Richard Martin", "time": 1555612712656, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "109892541570419774634", "name": "Perry Raines", "time": 1544506899467, "rating": 4.0, "text": "Farm supplies", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "118062516997267611057", "name": "Shanin Robertson", "time": 1529386844742, "rating": 4.0, "text": "Farm supplies", "pics": null, "resp": null, "gmap_id": "0x8889c16ccf975abd:0x93ca530a9f8ad910"}
{"user_id": "102933145701000697164", "name": "Victor Lockwood", "time": 1544983663238, "rating": 5.0, "text": "great place to take your dog for a spa day, reasonably priced", "pics": null, "resp": null, "gmap_id": "0x88628c6260340a1d:0xe60486372dc213ed"}
