{"user_id": "106859445139622319466", "name": "Natalie Smith", "time": 1606996964811, "rating": 5.0, "text": "Great customer service skills @Alex and with the times that we live in I cant express how important that is these days. The location manager was super nice when called and went above expectations when addressing my payment issue. GREAT EXPERIENCE!", "pics": null, "resp": {"time": 1610125660810, "text": "Thank you so much for leaving a great review! We strive to give the best customer service to all our customers. Please let us know if there is anything we can do to make your house a home!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "117752863040426286360", "name": "Talonda Inge", "time": 1623106557458, "rating": 5.0, "text": "Alex & Peter are the best ever hit business company in Saraland Alabama \" Let Go \" Saraland", "pics": null, "resp": {"time": 1623159650437, "text": "Thank you so much for leaving a great review! We strive to give the best customer service to all our customers. Please let us know if there is anything we can do to make your house a home!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "108689396437309755261", "name": "Thor Volden", "time": 1612298636069, "rating": 5.0, "text": "Have been renting with Baber’s in Saraland for a little over a year now. Great customer service, Alex is very helpful and knows her job well. I will continue to rent with them from now on.", "pics": null, "resp": {"time": 1612300696433, "text": "Thank you so much for leaving a great review! We strive to give the best customer service to all our customers. Please let us know if there is anything we can do to make your house a home!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "116063677265246792569", "name": "Samuel Castleberry", "time": 1601412872378, "rating": 5.0, "text": "I ordered a deep freezer from these guys. They brought it out and set it up where I wanted to be set up. The manager personally interacted to with me both over the phone and during the delivery. I recommend them.", "pics": null, "resp": {"time": 1602090062366, "text": "Thank you Samuel for this great review! We strive to give our customers great service throughout their rental. Please let our team know if you need anything."}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "107825834656112038671", "name": "Billie Parsons", "time": 1611425667900, "rating": 5.0, "text": "I was looking for a lift chair recliner, one with a dual motor, where the footrest comes without the headrest going back, for up coming surgery, I noticed that Babers posted  on their  face book page  that they had one, called, visited,  rented AND delivered in one day!!! store was very clean, Alex was friendly, knew her job, made everything fast and simple", "pics": null, "resp": {"time": 1611427598988, "text": "Thank you so much for your review! We do what we can to make our customers' house a home. Thank you for being apart of the Baber's family!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "101000662001489206321", "name": "mike smith", "time": 1607799437796, "rating": 5.0, "text": "Very nice folks.  Got there quick  set everything up  i recommend  them.", "pics": null, "resp": {"time": 1610125643064, "text": "Thank you so much for your review! We do what we can to make our customers' house a home. Thank you for being apart of the Baber's family!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "113073715702478229883", "name": "Macy Fisher", "time": 1622384310510, "rating": 5.0, "text": "Great location and awesome service!", "pics": null, "resp": {"time": 1623159700860, "text": "Thank you so much for your review! We do what we can to make our customers' house a home. Thank you for being apart of the Baber's family!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "113186365315998552362", "name": "Joyce Lamar", "time": 1607789941702, "rating": 5.0, "text": "Peter, the manager is so helpful and ACTUALLY cares.  Super professional!!  I'm a fan for life as long as he's there!", "pics": null, "resp": {"time": 1610125653073, "text": "Thank you so much for leaving a great review! We strive to give the best customer service to all our customers. Please let us know if there is anything we can do to make your house a home!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "100787119729954998605", "name": "Sheryl Rowe", "time": 1595092188080, "rating": 5.0, "text": "Wonderful customer service! Highly recommend this Baber's Saraland location", "pics": null, "resp": {"time": 1610125671864, "text": "Thank you so much for your review! We do what we can to make our customers' house a home. Thank you for being apart of the Baber's family!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "109024468817294788680", "name": "doug nealey", "time": 1584627214925, "rating": 5.0, "text": "Great place to do business very friendly and helpful people locally owned and operated I highly recommend doing business with these people", "pics": null, "resp": {"time": 1610125692247, "text": "Thank you so much for your review! We do what we can to make our customers' house a home. Thank you for being apart of the Baber's family!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "112144531864256198775", "name": "Samantha Graves", "time": 1580796565468, "rating": 1.0, "text": "Crooks.  They love to Harass people. Over charged us many of times.  I dont recommend them at all.", "pics": null, "resp": {"time": 1610125768518, "text": "We are sorry to hear about your experience with our Saraland location. We strive to provide an excellent experience for everyone who walks through our doors. Thank you for making us aware and will have the District Manager look into this. Please come back soon and try us again! Please contact us by emailing, customerservice@babers.com, if you have any other issues. Have a wonderful day!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "117277933836499004234", "name": "Vera Williams-York", "time": 1579959570014, "rating": 1.0, "text": "Would not sale to me because of my last name  ( Williams ) and if I could get that person to bring his things back then and only then I could get some furniture. The manager Peter went on to tell me all of this person business like their name where they lived ss# telephone number etc....", "pics": null, "resp": {"time": 1580136666598, "text": "Mrs. Williams-York, we apologize for the inconvenience you experienced at our Saraland location. Please private message us your phone number and best time to reach you. We will have the District Manager call you about your experience. Thank you for reaching out to us!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "101113440595071792281", "name": "Dominique Hill", "time": 1537329389775, "rating": 1.0, "text": "This office is so unorganized and full of crooks! I was told that my payments would be due on Sundays, which wasn’t a problem, but suddenly, automatic payments start drafting from my account, which, once, that ain’t no problem, but when I tried to stop them, I was told that they couldn’t, I had to talk to the home office. When I called the home office, they didn’t answer or return my call. I’m paying extremely too much for a refrigerator and it came with an already blown light bulb in it. I had to notify my bank to decline all debits from them until we can get it rectified and I still haven’t heard anything from the main office but — and this — they tried to debit my card AGAIN today, Tuesday. I’m returning this merchandise first thing after finding a better deal and customer service. I would not recommend this company at all.", "pics": null, "resp": {"time": 1543512024366, "text": "Dominique,\nThank you for your review. We are truly sorry to hear about your experience. Please email to us your agreement number and name on the agreement at saraland@babers.com, so we can get more details about the the payment and compensate you for your discomfort.\nSincerely,\nBaber's"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "100045240114537659695", "name": "Anna Isaeva", "time": 1544844344144, "rating": 5.0, "text": "Great team, great products, great service. Love 6 months same as cash!", "pics": null, "resp": {"time": 1610125917860, "text": "Thank you so much for leaving a great review! We strive to give the best customer service to all our customers. Please let us know if there is anything we can do to make your house a home!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "105464365341874855253", "name": "Bob Winchester", "time": 1623949774127, "rating": 5.0, "text": "Great staff!!!!", "pics": null, "resp": {"time": 1623961026986, "text": "Thank you so much for your review! We do what we can to make our customers' house a home. Thank you for being apart of the Baber's family!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "112025672845767461780", "name": "Sherrice Richardson", "time": 1552128914756, "rating": 1.0, "text": "I worked there and people of color should honestly find elsewhere to rent ...\n\nBabers company does NOT care about any employees, they barely care about the stores and I say that because the owners barely to never call or come by unless it’s a problem then you’re getting scolded by 5 people! I worked as an account manager doing allllll the managers responsibility but not being compensated for it. It was my responsibility to call due and past due customer but when I make contact with anyone the manager stands over my shoulder telling me exactly what to say and I can’t stand being micromanaged . I had to use my own personal Facebook for sales and my personal cellphone for advertising. I used my personal cellphone for collection calls . Most customers are extremely rude. And the store manager didn’t make it any better with the things he wanted you to say . The store manager said “I think this job has made me racist” and it shows in his work he will rent quicker to white people than blacks and he is quicker to offer “help” to white customers than blacks. The store manager has adhd or something he can not focus and puts all his task down on me . He is impossible to work for, some days he doesn’t ask you to do anything other days he ask you to everything AND his job! He was never on time and always left early and takes long breaks. A lot of the time I was NOT allotted a lunch break but when I look at my pay stub the time was taken out of my check . You have too many responsibilities that you are not paid for ... Oan the store is really slow but the manager threw away the chairs and doesn’t want you to sit ! And wearing babers uniforms are mandatory and you have to buy them yourself and the cloths are overpriced and cheaply made JUST LIKE THE COMPANY ITSELF !", "pics": null, "resp": {"time": 1611427645776, "text": "We are sorry to hear about your recent experience with our Saraland location. We strive to provide an excellent experience for everyone who walks through our doors. Thank you for making us aware and will have the District Manager look into this. Please come back soon and try us again! Please contact us by emailing, customerservice@babers.com, if you have any other issues. Have a wonderful day!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "101164235738094243399", "name": "Mary Edwards", "time": 1541529585618, "rating": 5.0, "text": "Great customer service at this location maybe they can train the airport location", "pics": null, "resp": {"time": 1610125902931, "text": "Thank you so much for leaving a great review! We strive to give the best customer service to all our customers. Please let us know if there is anything we can do to make your house a home!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "103487581445151172519", "name": "Juan Puente", "time": 1541973755786, "rating": 1.0, "text": "Complete nightmare trying to order a bedroom suit from these people. 1st week we’re told it could take up to 2weeks. Week 2 the dude ordered the wrong size suit and was told that he would have to order the king size bed by itself or find one new from another store. Week 3 we go in expecting everything to be good to go “wishful thinking” was told the king bed he found at the other store was sold after he told them he needed it so he would find one and go pick it up personally. Week 4 we go in and expect to at least  talk and find out wth is going on and  we get hit with the excuse “only half of our building has power” so we can’t power up the computers to see anything. We eventually gave up and got rid of the flyers they gave to my wife to put into the welcome pamphlet for the new people who moved into our apartment community. This place is a complete joke. I would advise anyone looking for furniture to look elsewhere. These people will give you bs excuse after bs excuse. Supposedly it’s under “new management “ but apparently he’s failing horribly as well.", "pics": null, "resp": {"time": 1542033167785, "text": "Juan,\nThank you for your review. We're truly sorry to hear that you've been waiting for your merchandise for almost a month. If you could give us a call to our Corporate office at 228-312-0359, we'd be happy to look into the matter and try to rectify the situation.\nSincerely,\nBaber's"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "108845587429531511151", "name": "Angela Lankford (Angela)", "time": 1510755226825, "rating": 1.0, "text": "The new lady managers are complete jackasses. They won't take off one late fee ...they knock on your door every day. I've been a customer for 6 years and I've bought numerous products from this baber's in Saraland. I will not be back after I finish paying off what I owe. I will now be a buywise customer for the rest of my life. The 2 fat ladies that work there now who are supposed to be managers have no compassion for their customers and/or frankly pieces of white trash who lucked out on a job!", "pics": null, "resp": {"time": 1532123465192, "text": "We want to thank you for your feedback. Baber's in Saraland is now under the new management and would be happy to help you out on any of your furniture, electronics and/or appliances needs."}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "116060899327881143955", "name": "Bre Bre", "time": 1528484887923, "rating": 2.0, "text": "I would not rent from this location. Was told our payment was due on a certain day paid it a day later and two days after paying our phones were being blown up asking when we would be coming in to make a payment although we had just paid for a week. Very unprofessional and rude. Will be taking business elsewhere in a few months.", "pics": null, "resp": {"time": 1532044648557, "text": "Bre,\nThank you for bringing this to our attention—it will help us improve our operations. We are truly sorry that you had received several call even after making you payment. We understand your disappointment, and apologize for any inconvenience that this may have caused you.\nPlease let us make it up to you by offering you a weekly payment vacation. In order to redeem that, please feel free to call to our District Manager directly at 432-250-4792.\nSincerely,\nBaber's"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "101674366279914067380", "name": "Ric Burge", "time": 1503335517963, "rating": 1.0, "text": "Neighbor had a stove from Baber, dropped it, broke the glass in the door, didn't pick it up until after I called. There's still glass there now.\nThe manager is very RUDE!\nWhy should we have to clean up their screw-up?", "pics": null, "resp": {"time": 1611427649197, "text": "We are sorry to hear about your recent experience with our Saraland location. We strive to provide an excellent experience for everyone who walks through our doors. Thank you for making us aware and will have the District Manager look into this. Please come back soon and try us again! Please contact us by emailing, customerservice@babers.com, if you have any other issues. Have a wonderful day!"}, "gmap_id": "0x889a56f487a1cf3b:0x5a140872ff715361"}
{"user_id": "114594771005481572164", "name": "Nancy Tedford", "time": 1622962625374, "rating": 5.0, "text": "Outstanding! I was greeting within 30 seconds of opening the door. Nobody jumped on me to try and smother me with high pressure selling. I was greeted and that was polite. Mark was busy with the other customers, but he let me know that we were important as well.\nI came into the store with good intentions of payment account off. It was the last payment for my couch and TV. However I saw something right when I walked in that I was going to get from another source. I figured I would just go ahead and get it here. Mark and Jason assisted me and taking care of my needs. I'm having my furniture delivered next week, and look forward to it it is much needed. But I'm not real happy about, the way you set up customers payment history and how it's not turned in to the credit bureau, neither good or bad. Y'all sure wouldn't make a hesitation on picking someone's furniture up from their house, would you? Something to think about. Thank you Mark and Jason deserve a raise!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "113388399959467870879", "name": "Kari Engle", "time": 1582965944946, "rating": 5.0, "text": "Love my new bedroom suite and dryer that I got for a total of $150 a month. ☺️", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBXDsl1ndn7gUXwU89XWX-13DdnEU22vJcX-A=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx3a6pB_WvU-QMdcdduWvyi4c5rmSy1GK82ig=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8cKz5m9pkmdzBQQSVi-0LwgQjLbP_xaeqUDY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "108159363811154985079", "name": "Pharon Gonzales", "time": 1614965166409, "rating": 5.0, "text": "I have been coming to this store over two years and i wouldn's leave them for nothing. The staff is so friendly and helpful, the Store Manager is AWESOME!!!! Anything we have trouble with or need understanding she's always right there to help us. I reccommend any and everyone to go see them. They are great people and can be trusted!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "103903703685390534719", "name": "Edward Hollingsworth", "time": 1614056318363, "rating": 5.0, "text": "The best and only store I will ever rent or buy from ever again Sandra and Mark go above and beyond to help u with all ur needs and wants if they don't have it they will get it for u give bestway a chance and go check them out thanks for all u do guys", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "104166355304205186821", "name": "Mikel Miller", "time": 1614625429120, "rating": 5.0, "text": "The general manager was awesome! She really helped get a great deal!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "107051204575068444681", "name": "Shelia Dacosta", "time": 1607178833538, "rating": 5.0, "text": "They were amazing and the manager went above and beyond to help me get settled in my new home with the perfect bedroom set!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "113492223926952598816", "name": "Lindsey “Elle” Elizabeth", "time": 1599775753796, "rating": 5.0, "text": "Best ppl at the one on bob wallace. Ask for andrew, hes an amazing worker. Always goes above and beyond like the manager and others there.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "117288382700570306350", "name": "Melissa Green", "time": 1597977733629, "rating": 5.0, "text": "Love these guys. I've been doing business with them since 1982. They always make the customer satisfied. They always aim to please.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "103301257523484621434", "name": "Carla Davis", "time": 1570893211848, "rating": 1.0, "text": "I will never do business with Bestway furniture rental again. I had a washer and dryer that I paid over the past year literally about 2,200.00 including interest and weekly payments. They lied to me and told me they would be paid off by now.\nI have had to have the dryer replaced twice and the washer replaced because of substandard used products. The poorest quality I've ever seen.\nI got behind by a week and I pulled up at my home at 8a.m. and the Bestway truck had been stalking my house and they pulled up quickly blocking me in like some repo man. It was rediculously dramatic.\nThey took the washer and dryer away as if I was some terrible customer that was several months behind. It was insane. I'm never doing business with these people again and I recommend you stay far away if in need of rental furnishings. Go to Arrons or Rent A Center.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "114353120847102885562", "name": "Billie Leslie", "time": 1598975859055, "rating": 1.0, "text": "They admitted to me that they had overpriced merchandise...", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "109254652788754396664", "name": "Nene Burgess", "time": 1579042698195, "rating": 4.0, "text": "LOVE JASMINE W... HONEST, HELPFUL, AND FRIENDLY...", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "102213826227708845524", "name": "Eddie Dean", "time": 1567287378860, "rating": 5.0, "text": "Great place got my tv here and set up for the Alabama game roll Tide", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "104312286025819683327", "name": "Deborah Brashers", "time": 1578945494187, "rating": 5.0, "text": "Amazing place they are so nice and understanding!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "117322022310658427507", "name": "Peppa Hall", "time": 1516883211653, "rating": 1.0, "text": "I wish I could give a negative 1. I ordered a bedroom set with a dresser...The day it came it was missing knobs off the dresser the whole time I was paying on it I called consistently to check to see if the \"ordered knobs\" came in. All they would say is we have ordered them we're waiting.Needless to say Vincent and the rest of his employees are nothing but Liars it's been a year-and-a-half my furniture is paid off and I still do not have any knobs. I will never ever recommend nobody to go to the store.\n\nAnd it was my first time using a \"rent to own place\" .", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "117666811505264666465", "name": "Clarissa Brown", "time": 1555783336882, "rating": 1.0, "text": "Manager was rude. She called when I asked to have a text reminder sent to my phone. I’ve asked them to put me on the text reminder because I work and can’t have my phone ringing off the hook. I’ve already received the text today and an hour later a phone call. The manager jaquella slams down the phone after I asked her about the text messages. And when I called to complain about her being rude she pretended that she didn’t do it. Today is due day not late day I don’t appreciate the rude people that call with the attitudes like the furniture is their furniture and the money belongs to them. You can get more bees with honey than with sour milk.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "109404834210267370179", "name": "Michael Davies", "time": 1598659326907, "rating": 1.0, "text": "i entered this establishment on 8/25/2020, i was greeted by an employee who was not wearing a face covering. i myself had on my face mask per state and city mandate. i proceeded to the counter to inquire about leasing merchandise. (i have leased with this company on a previous occasion, my experience at that time was very sub par. the delivery was late and the dryer power cord  was damaged to the point of causing property damage to my wall plug in my home.) A red headed woman approached the counter with no mask and asked me \"how can i help you?\", i replied i am looking to lease a laptop. she then told me \"i have the desktop over there\" i stated then what kind of laptops do you have \" the kind that turn on!\" she stated. so i disregarded her unprofessional remark still uneasy about both employees not having on a face covering, and asked to know my options of computer choices. she then with an attitude that i was an inconvenience to her began putting laptop boxes on the counter. i read the specifications and made my choice. she asked if i had leased with them before, i stated yes. it had been more than 30 days since my last lease so i was directed to fill out another lease application. during this time of filling out the application i came to find out the employee that was behaving in this manner was the general manager. she then informed me while i was filling out the rental application that she \"hated these mask\" and that i did not have to wear mine while in the store. i was now fully uncomfortable from a collection of lack of safety procedure during a pandemic. i continued to wear my mask. once the application was complete another employee then took a copy of my drivers license. the general manager took another 10 minutes to ask me to please come into her office. she was pulling up things on her computer. she then turned to me and rolled her eyes and said\" so you have rented from us before huh? \" i said yes i have multiple times. she then proceeded to question why i was late on my rental payment. i told this brute of a woman that i had financial hardship and lost my job at the time. i got behind on the lease and once i realized i could no longer afford to get the payments from these loan sharks up to date due to exorbitant late fees and penalties i returned the leased merchandise. she then stated that she \"believed in giving second chances\". i  acknowledged the comment but did not rebut to the comment. she then looked over more information on her computer. and turned to me and said \" being late im ok with, but people keeping merchandise that is not theirs im not ok with!!\" at this point i have become very uncomfortable and feel as if my visit to the store this day has become a humiliation session for the store manager. i stopped the woman and told her i felt degraded and would no longer like to do business with this establishment. she then laughed at me and said \" fine then\". i contacted the corporate office for this company and was informed they condone this behavior. a few notes if you intend to rent from this establishment, you may be exposed to covid 19 by employees or other patrons due to lack of adherence of mask mandate while in this location or lease merchandise that has not been sanitized properly. you will be belittled by the staff if you ever have financial hardship while in a lease agreement with this company as well. i hope this review is helpful to those thinking of leasing from this company. i would recommend the better competitor YOURWAY RENT TO OWN which is located at 2547 Bob Wallace ave. when i left this establishment i went to your way and was able to lease a laptop computer in less than 15 minutes without being belittled or shamed. (quick your way rent to own history) they do not charge daily late fees(best ways policy is built to extort with late fees)  when a payment may be late and will work with you if you hit financial hardship. also the merchandise is of higher quality, the facility is cleaner, with more inviting more professional staff. stay safe out there in this pandemic!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "110061741895329464718", "name": "Michelle Tunstill", "time": 1516848026034, "rating": 1.0, "text": "This place has lost our business. Since vencent and Cheri left. The people that are there are very pushing and have no concept of customer service. Would not recommend this place to any one. But if you are looking for a great place go see the people at Your Way rent to own on bobwallace Ave!!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "100303349459036962540", "name": "yvette young", "time": 1487377502347, "rating": 5.0, "text": "Very nice and I love the environment they treat you like family very friendly they work with you if you're not able to make your payment on time love those guys at the store on Bob Wallace", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "105599669874201956379", "name": "John Carlisle", "time": 1477928602706, "rating": 1.0, "text": "Lamp rented from here with living room suite had a short that caused a power surge that ruined a 270.00 sterio plugged into the same outlet. The store accepted my sterio to repair it and kept the unit for over a year and never fixed it or replaced it. This lamp could have burned down my home. The manager and staff don't care about their customers and will not fix anything. Take your business elsewhere. It's not worth the risk of losing  your hard earned electronics or worst case your home.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "102963783308282539078", "name": "David Keel", "time": 1473444073213, "rating": 5.0, "text": "Got a great deal on a dryer from here a few months ago. Overall very nice people. The sales people are a bit pushy but that is to be expected I guess.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "110538500803244074497", "name": "Leslie McCrary", "time": 1564006761433, "rating": 1.0, "text": "HORRIBLE HORRIBLE CUSTOMER SERVICE ! I WOULD NOT RECOMMEND THIS PARTICULAR LOCATION TO ANYONE ! The management is TERRIBLE AND RUDE !", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "107823510277026223150", "name": "jonothan english", "time": 1486601483522, "rating": 4.0, "text": "Great people. You pay too much for merchandise but if you don't have great credit it's a way to obtain things", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "101826315466677514640", "name": "Paul Stoneking", "time": 1504730234741, "rating": 1.0, "text": "Pushy and have harassed customers the day their payment is due.  Not worth dealing with this company there are better ones that offer the same services in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "102697994665714179194", "name": "Natalie Ball", "time": 1562351729848, "rating": 5.0, "text": "Absolutely best rental store 👍", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "107843429033647636701", "name": "Triple Threat Reborn", "time": 1487346070808, "rating": 1.0, "text": "I would ever do business with them again. They are rude and I was late told them why I would be. They don't care about their customers. Reason I say that I've never been late. I rented from a washer from Rent A Center before and payed it off. Was late due to car accident they never did the things these people do. Knock on your door so hard like dude my neighbor had to call me at work. Smh! If you don't have to go to these people please don't go.", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "116572478722115062311", "name": "Jose Moreno", "time": 1482007858748, "rating": 1.0, "text": "Bestway ,,  Sucks , Go to RAC or Aarons or save your money  been with them for 2 yrs developed a good acquaintances with people in gallatin,  tn,   Thanks to Cris and John moved to alabama got a washer and dryer and because I was late they picked them up ,", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "103817981539407787634", "name": "Alvin Solone", "time": 1553430195117, "rating": 1.0, "text": "Terrible business people. Very rude!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "115347705427589258346", "name": "Kim McCabe", "time": 1523908865430, "rating": 5.0, "text": "Great place, super friendly associates!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "103627807140102775263", "name": "Nolan Williams", "time": 1511925779817, "rating": 5.0, "text": "Good place to rent good services", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "117120288272970423064", "name": "Star Star", "time": 1549148707255, "rating": 1.0, "text": "Store had a new design and new merchandise. Managment isn't  friendly", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "114260314785214171703", "name": "Glitter Glitter", "time": 1523488172603, "rating": 1.0, "text": "Awful customer service", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "104575777369686510618", "name": "Elegance on any Budget", "time": 1523864431560, "rating": 1.0, "text": "Nate has horrible customer service", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "106787239931148702765", "name": "Gina Jones", "time": 1512440623612, "rating": 5.0, "text": "Loved it!!!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "110906990742959205659", "name": "Jamie Kopf", "time": 1512366158892, "rating": 5.0, "text": "Favorite place!", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
{"user_id": "104862552439261135009", "name": "Kelvin Hardin", "time": 1515786828361, "rating": 5.0, "text": "Great Staff and Stock", "pics": null, "resp": null, "gmap_id": "0x88626c968658c4e5:0xe253ce2faeb99938"}
