{"user_id": "113651479048336240524", "name": "Shari Smith", "time": 1600116288206, "rating": 5.0, "text": "Our company, the National Service Cooperative, has worked with Jones McLeod for over 25 years.  They represent our organization in all of Alabama.  The reason that they are the Premier Service Provider for us is because of their commitment to excellence and to customer service.  With ever service call they perform, they send trained technicians with the parts needed to complete the repairs.  Their management team, led by Chris McLeod, is the best there is.  You are in the best hands when you select Jones McLeod!!", "pics": null, "resp": {"time": 1600173750346, "text": "Shari, Jones-McLeod is so thankful to have worked with the National Service Cooperative for all those years. Jones-McLeod loves taking care of all your commercial appliance service needs, whether it is in a restaurant, school, church, hospital, or any other facility with a commercial kitchen. So thankful for our partnership!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "117724235928976755066", "name": "Bob Collier", "time": 1614377005410, "rating": 5.0, "text": "Jones-McLeod are really convenient for the services that they offer. Their rates are competitive with anyone, their response time is good, and the office manager, Pat, is super friendly and helpful.", "pics": null, "resp": {"time": 1614379465284, "text": "Bob, thank you for the kind words. We at Jones-McLeod are very grateful for the opportunities to continue to earn your business! Thank you!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1614744947363, "rating": 5.0, "text": "Staff was good and new what they were doing", "pics": null, "resp": {"time": 1614784859470, "text": "Hoyt, thank you for the kind words. Please let us know if you need help with any of your commercial appliance parts and service needs. thank you!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "112894296067233723694", "name": "jessica Chen", "time": 1598055590668, "rating": 1.0, "text": "We had service with them several times, they were wonderful but last time they came couldn’t found what is problem with fryer and fryer just back working normal when they come so they just left doesn’t charge anything, I was appreciate they came even they didn’t do anything. But today my fryer don’t work again, I called up there and ask for service, they just told me can’t do any service for us no more, I asked why is there any reason to make y’all to do this to me? They just kept saying sorry we can’t do any service for you no more. I don’t really understand so I questioning him why? He told me he don’t want to argue with me, just they don’t service us no more. Wow..\n\nThat’s ridiculous. First, we never yelled out anybody . Second we gave you guys credit card info to trust you guys to charge us for service. Third the last time service which is couple days ago he couldn’t find the problem for the fryer So I asked him before he leave what if the fryer stop working again, he told me just call office for service. Then I ask him how about the charge? He answered he will not charge me this time but he doesn’t know if his boss going to charge or not. So I will just say thanks to him because I knew there is a fee for came out.  But I don’t think I will have a problem with you guys to collet the bills. You might need to talk to who came for the service first. Maybe they were lying for some reason.", "pics": null, "resp": {"time": 1598041798733, "text": "Mr. Chen, as we explained we can no longer render you service due to the fact that on multiple visits to your establishment we have had a difficult time getting paid for our services and our technicians and dispatchers have been yelled out on each occasion. Our rates were explained in advance and the technician clearly explained what was needed to repair the equipment prior to doing the repair. We were given the go ahead to proceed with the repair, but when the repair was complete the technician was told he would not be paid for the parts or service. Therefore we can no longer provide service to you. We will not send our technicians into that environment again."}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "117202087865196998209", "name": "Derek Landry", "time": 1598643803960, "rating": 5.0, "text": "Great and friendly staff, very Knowledgeable. would give 10 stars if i could. will definitely be a repeat customer.", "pics": null, "resp": {"time": 1599081865350, "text": "Thank you for the kind words. Jones-McLeod Montgomery is always happy to be at your service!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "103705861119340225481", "name": "Randall Phillips", "time": 1586441304856, "rating": 5.0, "text": "The very best service company we have ever used. Kept me informed on what all was going on at the job-site and worked well with our customer at the job site and got the job done and everyone happy. Well be using this company again and future projects.", "pics": null, "resp": null, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "115622766621942721308", "name": "Sarah Barnett", "time": 1513019939776, "rating": 5.0, "text": "Pat is so easy to work with!! I loved doing business with this company and will be a returning customer. They are fast, dependable and kind. Highly recommend.", "pics": null, "resp": {"time": 1534543880078, "text": "Sarah, thank you for your business and your kind words about Pat!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "104697244657038436492", "name": "Ozzy Doner", "time": 1540098717281, "rating": 1.0, "text": "Scammers!!! First the Service technician was just for 1h 20 minutes at my store and the second time he was just 35 Minutes here. The Part he replaced was $ 158,- he told me. They charged me almost $1300!!! For what???? Never ever again. And this goes straight to our attorney. I got Cameras in my Store.", "pics": null, "resp": {"time": 1565116826102, "text": "Mr. Doner, sorry, but we did not provide you service out of our Montgomery office."}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "104667658092188723655", "name": "Andrew Leif", "time": 1609277178022, "rating": 1.0, "text": "Water heater I purchased on 5-16-2020 has failed!  I believe the thermocouple is bad.  Attempted to call customer service, to no avail.  Called number on web and recording informed me that calls aren’t being taken from residential water heater owners!   So I punched the number saying I was a business owner.  They didn’t answer that either!  This is beyond bad service!  Will call Menards, where I purchased it and advise that Rheem is of no assistance!  Hopefully they will be helpful!", "pics": null, "resp": null, "gmap_id": "0x888c2a6bfafa4239:0x2b23714cb5f89c4d"}
{"user_id": "111287751095770125179", "name": "Jonathan Vejjajiva", "time": 1588515895601, "rating": 1.0, "text": "Rheem makes terrible products and a terrible company to deal with. Wish I had read some reviews instead of just buying what Home Depot had available.", "pics": null, "resp": null, "gmap_id": "0x888c2a6bfafa4239:0x2b23714cb5f89c4d"}
{"user_id": "117341605406154606454", "name": "Philip Lerner", "time": 1554864896205, "rating": 5.0, "text": "Love my job!", "pics": null, "resp": null, "gmap_id": "0x888c2a6bfafa4239:0x2b23714cb5f89c4d"}
