{"user_id": "112359205638022222706", "name": "Wil Bowman", "time": 1609018518864, "rating": 5.0, "text": "One of the best equipped YMCA gyms that I have been to. Nice equipment, plenty of iron, plenty of bumper plates, a bunch of racks and benches.  Some higher-end equipment as well. The locker room is a dump, but it's not a priority for me.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOhwTmsT_t9vrbAwzIAD-cqzKhLDxQ5lLIMvtYN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMoNS1aWkpJCvKPtk08RuRE24ZbzVN4LwiNTCNb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNIT7GNKcjyC9SGDasp1QgHVQY1kfWr-nHRf5Kl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "108000506547593507114", "name": "Myra Mason", "time": 1598913315273, "rating": 5.0, "text": "I love my YMCA! Its always clean and the employees are super nice! They just put in lots of new equipment.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMJr2Bn88Vjzmr8UgPPkGSeYuhTJC6yVJ_2u5NT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7g2l4xtlMphNy_sLEyYnJzw4mvT8glS8QbbUi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSWLsN4yY9TKM_FjlnrsSyy9WjYrWWKwa2d9nN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "108838716128737250905", "name": "Kevin Preble", "time": 1607631068011, "rating": 5.0, "text": "Super clean gym. State of the art equipment and plenty of it. Super friendly staff. Oh and the lap pool is awesome.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOzuykcYkda0K458w4aICHvi4_ceZJFzrHwINb1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "117983220144554975661", "name": "Dawn Steadham", "time": 1592608543470, "rating": 5.0, "text": "Love my Y!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvRSEC5hTPOTzt80MBAcDlbpp3gNSZbR6Hl1lv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGXz5I-0ZBAkpLARAfFGt6HMnwRL3zhcZK9fDG=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "116185708052794961654", "name": "Robin Bolen", "time": 1566226563678, "rating": 5.0, "text": "You couldn’t ask for a better after school and summer care. From Carmen the director all the way to each individual counselor. My kids have been here going on three years. I can not explain the amount of love my kids are giving and how willing they are to work with my youngest when it comes to meds and helping to make a plan that works best for him. Carmen, Ashley, Taylor ,and  Ely have also became more like family. I know my kids are safe and taken care of anytime their at the Y.", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "108743890242169067748", "name": "sydney howard", "time": 1572277052107, "rating": 2.0, "text": "NOT SAFE for BABIES. Daycare let my BABY get TRAMPLED by older kids running around and another time didn’t strap my baby in and he was standing up in a stationary seat about to fall and smack head on a cabinet. Worst daycare staff ever!\nVery nice facility if you do not have kids though.", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "103314777744203503150", "name": "Danny Thomas", "time": 1540729178487, "rating": 5.0, "text": "I just joined. It’s not newer like planet fitness, but I love it. A place for the kids while you working out. Very nice staff..", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "112324998544048676274", "name": "Mallory Anderson", "time": 1565910452765, "rating": 5.0, "text": "My family loves the North Mobile Y! We've used them for 3yrs now, no complaints, staff is amazing ❤️", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "105090256631177026315", "name": "Candise Smith", "time": 1513698710554, "rating": 2.0, "text": "Need to have a bigger facility with more machines so there is no wait. The kids over the pool area are extremely sarcastic and rude with a very false sense of entitlement. The children's center across the way seems to be a place for troubled kids. My kids will never attend there again. Always a fight with a troubled child almost daily. Supervised by teens/young adults not at all ready for the responsibility of the well being of so many children. I quit my job so my kids did not have to be here everyday. Could not stand to see them beg me not to leave them everyday. No amount of money is worth leaving your babies with someone who doesn't care that they are changing your child on the inside for the worst.", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "109211513668498643544", "name": "Brian Keevan", "time": 1517701707896, "rating": 5.0, "text": "All the equipment you need, free weights, cardio & a helpful staff. A+", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "102214917944618914992", "name": "Ron K. Mitchell", "time": 1454899964290, "rating": 5.0, "text": "Great job Saraland YMCA. I love the new space, equipment, classes and the Christian Family atmosphere.", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "110416002587943240269", "name": "I’m Dirty Dan", "time": 1496835856215, "rating": 5.0, "text": "This place is amazing.", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "101940546888277442146", "name": "JDware X", "time": 1568145624156, "rating": 1.0, "text": "Its so trash", "pics": null, "resp": null, "gmap_id": "0x889a569270571c21:0xc338670f808f3712"}
{"user_id": "104544026830502230779", "name": "David Eckman", "time": 1618355975686, "rating": 1.0, "text": "I travel, and pay extra for a nation wide membership.   I’ve been in 15-20 ymca’s in the last year and they have all been gracious and accommodating.  This one must be special, because they will not accept my membership, and will not give me any option to use their facility.", "pics": null, "resp": {"time": 1619637978242, "text": "We regret that you were unable to visit our YMCA facility during the pandemic.  In order to protect our staff and our members, we are currently welcoming guests from Baldwin and Mobile Counties of Alabama only.  We will continue to monitor updated CDC guidelines as more people are vaccinated, as rates of COVID-19 change and as additional scientific evidence becomes available."}, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "113796908305712514209", "name": "Recep Kuru", "time": 1620905042986, "rating": 3.0, "text": "Good and friendly employees but they need to check some disgusting customers. The guy spit at floor in sauna like an animal when he did chewing a gum , I already reported him and they known him . I believe they kicked him out .", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "107995168162485446741", "name": "Ernest Kelly", "time": 1604460995292, "rating": 4.0, "text": "Love Gina's Total Body Challenges classes at Bounds Family YMCA. I've been taking her classes for over a year now and am happy to say I look forward to them every week. It's always fun, high energy and you get a great workout! Gina's the best!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "109908641610264443714", "name": "Karim Harzallaoui", "time": 1613395646381, "rating": 5.0, "text": "Great gym, but if they would open at least at 14:30 would be awesome", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "116828095064492123256", "name": "Cody White", "time": 1611579784646, "rating": 5.0, "text": "Clean facility, lots of options, and Karen is the absolute best up front!!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "108927953400009010440", "name": "Wesley Williams", "time": 1610489793065, "rating": 3.0, "text": "Really nice gym but it has the worst hours of any gym I've been to.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "104112391395847642704", "name": "Local Guide", "time": 1575469758338, "rating": 5.0, "text": "Great customer service and welcome desk. 2 pools one indoor and heated another outdoors. Exercise equipment. Several Stories. Family environment and safe. Child Care. Excellent facility.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "107723010185060445400", "name": "A Boyd", "time": 1560437295658, "rating": 1.0, "text": "I came in as a guest with my sister who is a member. Wanted to get a membership but wanted to try a class out first. We called the day before and asked what all we needed to bring for me to do a class with her. Was told all we needed was $10. I get there with $10 in cash and then I’m told “oh we don’t accept cash” which of course was not told to me on the phone. But it was fine my sister asked if she could just charge it to the card on file. Then she asks for my drivers license that I don’t have with me because I was never told that I needed to have it. All the while I’m trying to remain calm even though this is very annoying because I did everything right and called the night before and asked what I needed to have and NONE of this was mentioned. The woman at the front desk was extremely rude and said “well your sister is a member and should have known what you needed to have.” My sister has never brought a guest before and again WE CALLED AND ASKED and were not told any of this. It was very disgusting and embarrassing the way the woman was talking to us. Needless to say, I’m not getting a membership there anymore. This was very disappointing.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "115340946810590555118", "name": "Rachel Tucker", "time": 1535120665206, "rating": 5.0, "text": "The group fitness instructors are an exceptional team. They’re all phenomenal teachers and community builders. For me, they’ve made the difference in my experience at this YMCA. Otherwise, it’s a beautifully maintained facility. The mission of the organization and the way it’s run make membership well worth it.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "106347005921996215181", "name": "The Connor and Jacob Channel", "time": 1561926506871, "rating": 3.0, "text": "Pretty decent gym. Friendly atmosphere most of the time.  Lots of machines although it seems many of the treadmills have glitchy TVs. Wish the pool was open later on weekends and cleaner...especially the outside pool. Pool staff has been unwelcoming in the past. I know they are mostly kids but they should probably have some training in how to treat the kids they are watching. We've always liked the private swimming lessons experience and those instructors have always been excellent. We used to love the Kids Night Out program, but they've made it less conducive for our child who is not into socializing. I wish they had some kind of classes for beginners especially yoga. Administrative people are nice but don't seem to be on the same page with information. Cleaning attendants are friendly and always hard at work. Now that my children are 8 and 11 they do not feel comfortable going in the ladies dressing room which I totally agree with but I do not feel comfortable letting them go in the men's area because there is no privacy for them. I'm not comfortable with them being exposed to naked men or having to expose themselves. Probably a lot to ask for a kids dressing area or family room. There is a changing room/storage room by the pool but I think it's really just meant for storage. It would be great if they would post the status of the pool on Facebook or via text. It's kind of inconvenient to get there only to discover it is closed because of a distant rumble.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "112737742553933877848", "name": "Yosef Aborady", "time": 1572196415874, "rating": 1.0, "text": "They have horrible hours of operation. Wi-Fi coverage is so spotty and when you do have a connection it’s super slow there’s no cellular signal because it is a metal building. Staff are clueless and who doesn’t open until one on Sunday it’s absolutely ridiculous. My advice to anyone would be to go to planet fitness for the same type of atmosphere half the price only thing you’re missing out on is a pool.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "112948535173266914188", "name": "James Spivey", "time": 1536343661977, "rating": 5.0, "text": "Probably the best overall fitness facility in Baldwin county. I’ve tried several other gyms and nothing really compares to the selection of equipment. The staff is also very friendly and helpful! I thoroughly enjoy lifting and swimming here.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "116307715526656136022", "name": "Jessica Ellis", "time": 1598284777128, "rating": 5.0, "text": "Love the staff and instructors!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "113982605433000009787", "name": "Erin Adkinson", "time": 1570470934069, "rating": 5.0, "text": "Great selection of classes. Large and clean facility!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "109451612896501274557", "name": "Ash ton", "time": 1505265414188, "rating": 5.0, "text": "Very military friendly! If you're active military visiting the area, they will give you a free pass for the time you're here. I'd recommend this facility to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "106915007072546626274", "name": "Adam Manning", "time": 1578865905969, "rating": 5.0, "text": "Great facility and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "101686208623848795779", "name": "CHARLES Harris", "time": 1547256640958, "rating": 5.0, "text": "Awesome place to work out . stay fit. I love it , family fitness center.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "108650122943719873601", "name": "Jessica Redditt", "time": 1530302294126, "rating": 5.0, "text": "I use this gym as a visitor and have been very pleased with my experience. Both the staff and other patrons were friendly and helpful to this out-of-towner. I follow a pretty extensive powerlifting and body building program and this gym had almost everything I needed, including a weightlifting platform! I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "114446360632339654883", "name": "Virtual KRMZEN", "time": 1521410763667, "rating": 5.0, "text": "Amazing place to go and work out or just relax in the hottub or swim in the pool! Amazing staff members that are very nice! It's very clean! It's very big and has a lot of room! They have very clean equipment!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "102105983670425585425", "name": "Jim g", "time": 1498097787758, "rating": 4.0, "text": "Great place, much better than downtown. I wish they would post a sign at the entrance and then enforce 10 minutes maximum per machine, no checking emails and texting while lounging on the equipment, chatting and socializing, rather than actually using the weights. The weights are for everyone's use, and using them is what they should be doing. Check your emails, text, and take calls in the lobby area. Thanks for a great place to work out. More fans would be a plus.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "110358103911201668366", "name": "Zachary Dinkins", "time": 1474209419354, "rating": 5.0, "text": "One of the better gyms I've ever lifted at. Nice people there too. I never had a problem with them", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "101555780424778198333", "name": "Robert Holyfield", "time": 1569904914332, "rating": 1.0, "text": "Seen worse. Very crowded", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "114874531213660882482", "name": "Troy White", "time": 1538503447687, "rating": 1.0, "text": "Probably the dirtiest most disgusting gym I have ever been to. My high school locker room smelled better. I don’t think the men’s restrooms have ever been mopped or disinfected. I only see the attendant using a broom and dust pan to cleanup. Wiping off equipment is not enforced. I find all sorts of goodies in the pool (band-aids, lettuce 🤷‍♂️). My wife and I had to say goodbye to our long term membership a few months ago as we just can’t justify the cost of membership vs the amenities. AND the fear of staphylococcus or MRSA. I don’t know how they stay open from a health code standard.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "101472267800518081014", "name": "Brian Brey", "time": 1484342143925, "rating": 3.0, "text": "the people are great but the facility is not up to date. The people running scheduling the classes do a poor job to say the least. the instructors that run the classes are great.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "115676076457971601782", "name": "Rob Whitsett", "time": 1523083083892, "rating": 3.0, "text": "Great gym. Needs to have more maintenance performed on the equipment!!!", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "104278571271396281367", "name": "Betsy Smith", "time": 1544140939394, "rating": 5.0, "text": "Friendly atmosphere, helpful staff, variety of classes.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "103972440175282741368", "name": "Trina Swan", "time": 1488667027501, "rating": 2.0, "text": "Plenty of equipment, no parking available during peak hours. Swimming pool is alway inaccessible due to swim leagues. Open for only a short time on weekends.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "102031178748003195697", "name": "Bert Waller", "time": 1502245562066, "rating": 4.0, "text": "Nice, large facilities and decent selection.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "111169139351877772376", "name": "Paul Klutes", "time": 1495318961132, "rating": 2.0, "text": "Okay gym, some good instructors, awful christian music, and a constant stream of Fox News.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "106094082615061403616", "name": "Marissa Ann", "time": 1465684560709, "rating": 3.0, "text": "really needs to stay open till 10 pm", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
{"user_id": "108951689435673928304", "name": "Trent McManus", "time": 1461530549624, "rating": 4.0, "text": "Needs to stay open until 10 pm everyday. Needs to get EzH20 water fountains with bottle fillers. Filling a water bottle with a standard water fountain takes ages and doesn't allow you to fill it all the way up because of the angle.", "pics": null, "resp": null, "gmap_id": "0x889a423a085adc1f:0x7eface7e06ddbae9"}
