{"user_id": "117740107684788415219", "name": "Bernard Hill", "time": 1623211442142, "rating": 5.0, "text": "The work that these guy do are amazing. The 4 large trees kept the sun from fully shining in our backyard and when the first tree fell we could see the difference. The guys seem to work well together and they clean up was professional and thorough. I will recommend this company to others. Great job!", "pics": null, "resp": {"time": 1624052558746, "text": "Bernard, we are pleased to serve you.  Our crew and office staff our happy to know that you're happy and satisfied with our services. Thank you so much."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118064930732914700755", "name": "Kelly Campbell", "time": 1622341358090, "rating": 5.0, "text": "National Tree Service removed three really large trees for me. They were quick, professional and did a really impressive job. I would absolutely use them again and would highly recommend them to you too!", "pics": null, "resp": {"time": 1624053000883, "text": "Miss Kelly, we thank you for allowing us to serve you. We are so glad that we've met your expectations. Your positive comment made our crew and office staff proud. We will continue to strive harder to provide quality tree services to our dear clients.  We appreciate you a lot."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "116755734014907944057", "name": "Jaime and Elsa Hensley", "time": 1617326778552, "rating": 5.0, "text": "Recent storms/strong winds caused a very high pine tree to topple over. It was close the street and over our driveway. National Tree Service was the most responsive company to help out with our emergency. They offered great pricing and within an hour were at my house to cut up the tree. Anthony and main office maintained me updated as they cleared up the toppled tree. Anthony went above and beyond to get this unexpected project taken care of.", "pics": null, "resp": {"time": 1624053244578, "text": "Dear Jaime and Elsa, Anthony and the rest of NTS crew work really hard. Hearing good and positive reviews from our clients really make their day. Thank you so much for trusting National Tree Service for your tree service needs."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104296395834497181896", "name": "erica dozier", "time": 1615411509382, "rating": 1.0, "text": "Be sure to do thorough research. Wish I had. I saw the BBB rating without reading current complaints.  The tree was removed but the stump grinding, which I paid for, was not performed. I have contacted the company twice but received no response. I will file a complaint the the BBB, if only to record the service. Hopefully more people will read the complaints and the BBB will reflect this in the company's rating. They are dishonest and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118221416308192433948", "name": "Jared Wilkinson", "time": 1612026056448, "rating": 4.0, "text": "Had NTS come out and quote me on a tree removal. They were double what a competitor quoted. When I gave him the number he said he would do it for that, so be sure you get multiple quotes before using them. He said they would be out the next day at 10-11am. They showed up at 2p the next day, which is fine, and proceeded to cut down the trees. They did a great job with the removal and cleanup to the curb. The minus one star was for the person who came the next day to pickup the debris. He got all of it which was great but left 4\" gouges in the yard which I had to dig out and fill up.\n\nI do think you should give them a shot and if they are the best price, use them. Just be sure to check around when having work done to get the best price.", "pics": null, "resp": {"time": 1612034433315, "text": "Jared, we appreciate for giving us the opportunity to serve you and for your positive review. We will keep on striving to improve  to provide our clients a safe and cost effective solution for all their tree service needs. Thank you."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104761359050840113113", "name": "Philip Gannuscio", "time": 1607077830658, "rating": 5.0, "text": "I recently had National Tree Service out  to my home to remove several large pine trees and grind a couple of  stumps. Nationals representative, Anthony Taylor, came out to give me a quote. He was extremely professional and really knew his stuff.The next day Anthony and his crew showed up and removed my trees , handled my stumps , and cleaned up any and all branches and debris. I was very impressed with the professionalism of the entire  company. Anthony ( and National) delivered what they promised and I have already referred them to clients , neighbors, and family members .Truly awesome company", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "117681376067126982628", "name": "James Taylor", "time": 1616816665058, "rating": 5.0, "text": "Great knowledgeable staff! Very fast, responsive and friendly! Give them call for all your tree needs!", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "113504527987025275896", "name": "The Good, Bad & Ugly Properties", "time": 1588301114659, "rating": 5.0, "text": "AwEsOmE!!  National Tree Service did an outstanding job cutting a tree for us. I was working with my sons on a screen printing job &  told him I’m stepping out to grab a bite to eat & see how those tree cutters are doing. On the way I stopped by our property & saw NTS already finished & left. I snapped a photo & texted a son who was also amazed. Towards the end of the day I thought to myself  I'll email or call them to ask what's the quickest way I can make my payment because we are happy customers. When I sat down at the computer, voila! NTS already emailed me the invoice which allowed me to conveniently make  payment online. As we folk in Alabama say, \"Gracias\". Thanks for your assistance National Tree & I look forward to calling you again. – Antonio Espinoza", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN19wVTvZ0aMxvrhxmzcHpRwazQrx_INin_ssHt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgAXLjd0qziPGDHHrJPu-ATkv6RokK1JxPbQjP=w150-h150-k-no-p"]}], "resp": {"time": 1624053553512, "text": "Mr. Espinosa, we're so glad that you're happy with the tree service we provided to you. We work hard to make sure to provide our dear clients the quality service they deserve. Thank you so much for allowing us to serve you. Of course, KUDOS to our crew members...nice job guys! You made National Tree Service proud!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "110115031730950448159", "name": "Ryan Hoffman", "time": 1590520227927, "rating": 1.0, "text": "This is by far the most unprofessional company I have ever hired to do work at my house. To begin with, the estimator came out and gave me a price on having 2 trees cut down and having the stumps ground - trees are in the back yard behind a locked gate. I was told to expect a phone call that afternoon for scheduling. After 3 days I called the office and was told that they never received my estimate but they would put me on their schedule. A date was set and then was moved several times. I scheduled someone to come do bobcat work around that date as well. I then received a call asking if they could come that day (Thursday) and do the work. I said yes and left my office to go home and meet them. They finally showed up around 4:45 in the afternoon and got one tree down and told me that they would be back at 8:30 am the next day. I had to call the office at 3 pm to see if they were still coming to finish the work since I had to take another day to stay home from work. I waited to hear back and was told that they should be out sometime that afternoon. The crew finally showed up around 5:30 pm. They were able to get the second tree down but did not have the equipment to grind the stumps and I was told that they would come Saturday morning to finish up. Saturday came and went without anyone showing up and no phone call. The following Wednesday I get a call from the office asking if I was happy with the work and to confirm that they had removed all the debris from my yard, I told the person on the phone that they were not supposed to remove debris but they were supposed to grind stumps. She was unaware of this and said that she would make a note of it and have someone call me. Later that afternoon I got a phone call letting me know that someone would be out the next morning to grind stumps. I waited the entire day at home after taking off work, again, and NTS was again a no call no show. At this point I gave up on having anyone come complete the job. A couple weeks later, the company showed up without calling to try and finish grinding 2 stumps. The guy told my wife that he couldn't finish because there was some concrete and rocks that the didn't initially see and that he would need to come back later to finish the work. At this point I have had to call and cancel on my bobcat guy twice, which has cost both of us money. This job was started in April, and it is now the end of May. If you don't have anything to do and want to work with a company that is completely incompetent with communication, then National Tree Service should be ok. Otherwise, do yourself a favor and stay clear.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "110066589077742326221", "name": "Ismael Torres", "time": 1596580371649, "rating": 1.0, "text": "Don't use their service, repeat don't use their service. On July 29-2020, they send Samuel to price a job. Now the day before coming to do the work one of their employees came to tell us that Samuel the guy they send to price the work they would be doing, is not qualified to make the quote. The guy that came today from the office said that the job is $2,500 more on top of the quote. This is unacceptable and shows how unprofessional they are. For that reason I don't recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "108782980942136403473", "name": "Vic Mobley", "time": 1591294736338, "rating": 1.0, "text": "I called to see if they had firewood and asked what time they close. I drove out there at appox.12:30-12:45 in the afternoon.  When I arrived ALL THE PARKING SPACES in front of the business were filled with cars. I parked along the road and went to the door s and they were locked, didn't see anyone inside so I knocked then went to my car, drove inside the fence to the building and yelled inside, \"Is anybody here?\", and no one answered....So I left.", "pics": null, "resp": {"time": 1591300325599, "text": "I apologize for the inconvenience Mr. Mobley. We were out for lunch when you stopped by and crews were out cutting trees down that's why no one was at the office. I hope that you let us know when and what time you would come to make sure that somebody will be at the office to accommodate you.\nThank you."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104452762603071496122", "name": "Brian Kendrick", "time": 1571057125935, "rating": 4.0, "text": "Communication is the key to any business. I can't say enough about the hard work the crew put in to get the job completed. After some equipment issues, NTS returned and finished the job. The quote and pricing was below other competitors and the professionalism shown by NTS is first class. I would definitely recommend this company.", "pics": null, "resp": {"time": 1570660798929, "text": "Brian, you are right, communication is the key to success. We apologize for the inconvenience it may have caused you. We will handle this matter and ensure that the communication between us and our clients will be improved. Thank you so much for trusting your tree service needs with us."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "106212256307329523196", "name": "Daniel Minor", "time": 1554511974334, "rating": 5.0, "text": "Awesome VERY Professional Job done here. The staff was very friendly and the work was done as requested. I have 5 more problem trees in my back yard that will need to go. I will be calling again soon. Thank You!!!!!!!", "pics": null, "resp": {"time": 1556650096616, "text": "Hello Daniel! Thank you for the compliment. Our goal is to satisfy our clients. And we're very glad that you are happy with our services. Just give us a call when you're ready to work on your other problem trees. As always, we'll be honored to work with you again. We appreciate you so much!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "117842333886288827051", "name": "Ashmen000", "time": 1563580245457, "rating": 1.0, "text": "Took three days of calling to finally get a rep to come to the house and give an estimate.  Rep was hours late from when they said he would be there.   Tree was scheduled to be cut down 2 days later at eight in the morning.  Crew never showed up.  Called the office and said they would call back with what was wrong.  Never got the call.  We used this service a few years ago and it was night and day difference in the response and price.", "pics": null, "resp": {"time": 1563807421308, "text": "Ashmen000, we are not going to make any excuses for what happened. You're absolutely right, the fault is on our side. The scheduling was mishandled and we deeply apologize for what you've experience with us lately. On the other hand, we appreciate you for informing us about this incident. We will definitely look into this so it won't happen again in the future. We're hoping that you'll give us another chance to redeem ourselves. Thank you for being a loyal customer."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "109358757279475262263", "name": "gulfdiver 2424", "time": 1556589014133, "rating": 5.0, "text": "Trimmed two oak trees for me today in Pleasant Grove, very professional, great clean up as well, best price in town, definitely my new tree guys and would recommend them hands down", "pics": null, "resp": {"time": 1556650389521, "text": "Thank you so much for the nice words. We strive to please our clients. We are so glad that you are very satisfied with our services. We appreciate you so much."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118012145115068463066", "name": "Tammy H. Bridges", "time": 1464789898785, "rating": 5.0, "text": "Great company with great service every time! Call this company any time  you need a tree cut down or any other type of service. They are the best by far in the city!", "pics": null, "resp": {"time": 1464792636122, "text": "Thank you Tammy! Call us anytime!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "105194007578520382860", "name": "Stanley Bolling", "time": 1464827880171, "rating": 5.0, "text": "I had very large 30 yr old tees near my house and NTS removed them all in a timely and professional manner.  I recommend them to anyone who has low hanging trees near their house.", "pics": null, "resp": {"time": 1464834486246, "text": "Thank you so much for trusting us with your tree service needs, Mr. Bolling. I'm glad that we've met your expectations. We truly appreciate you."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "110960072890262395861", "name": "Greg Case", "time": 1412344613590, "rating": 5.0, "text": "I am surprised at the people who are writing anonymous reviews and claiming bad service.  I have used National Tree Service on several occasions over the years.  They are prompt and courteous.  They do a GREAT job and you can barely tell that a tree was ever there.  They did no damage to the yard other than a place where a limb hit when the tree came down, and that was only one time (out of four). If you are having trees removed, dont use anyone else.", "pics": null, "resp": {"time": 1464186147770, "text": "HI Greg! Thank you so so much for your review. We truly appreciate you and your business. Please call us anytime you need us! :-)"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "102166171749634828671", "name": "Cathy Fingerman", "time": 1464859733660, "rating": 5.0, "text": "National Tree Service gave me a free estimate and did the job for that very competitve price. They were on time, very professional and cleaned up after themselves. I would call them again for any tree service that I would need. I highly recommend them.", "pics": null, "resp": {"time": 1465224423664, "text": "Thank you Cathy! Call us anytime!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "105782898566687162981", "name": "Ricky Isip", "time": 1519956096408, "rating": 5.0, "text": "As a man of few words, this company does Professional and Excellent job at Reasonable Cost.  Enough said!", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "101165755469643437648", "name": "David Burroughs", "time": 1459534883002, "rating": 5.0, "text": "Very professional and friendly.  Once complete, they asked if everything was to my satisfaction and cleaned up the work area.  I would use them again, and would recommend them to others.", "pics": null, "resp": {"time": 1464186095973, "text": "Thank you David for your feedback! Please call us anytime!"}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "108406048937793093718", "name": "George Barnett", "time": 1280088490174, "rating": 5.0, "text": "Everything you want in at tree service. Experience, reasonable rates, and great customer service. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104758917159718927654", "name": "Rach Hill", "time": 1413299957700, "rating": 5.0, "text": "National Tree Service is a GREAT company!!!  Removing trees is not as easy as going to Wal-Mart.....National Tree Service is insured and alot of places who are \"cheaper\" are not.  Also Mr Peppers has been in this business for over forty years.  If I needed a tree removed close to my house or on my property I would call National Tree Service.  They are family owned, insured, and are trained in dangerious tree removal.", "pics": null, "resp": {"time": 1453163426831, "text": "Thank you so much, Rach Hill."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "104820869135053716717", "name": "Nolan Hutchins", "time": 1582129057483, "rating": 5.0, "text": "Who was the greatest experience", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "116004755302775676306", "name": "Bruce Resp", "time": 1534458424103, "rating": 1.0, "text": "I  wasted half my day waiting for NTS to arrive at my home as scheduled.\nReceived a call around 5:00pm asking to reschedule. I actual have appointments that I intended to keep this week", "pics": null, "resp": {"time": 1544477840537, "text": "We apologize for missing your scheduled appointment.  We never intend to be late to anyone's home as we understand your time is just as valuable as our our time.  Unfortunately, we got behind and were delayed and are sincerely sorry for your inconvenience."}, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "118230273860685719351", "name": "john leddy", "time": 1411300662721, "rating": 1.0, "text": "Too busy for my money.  Missed several appointments for quote.  Finally we called and claimed i cancelled the appointment.  Another company got my money.", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "115342330324769883044", "name": "Jonathan Rose", "time": 1403213331135, "rating": 3.0, "text": "deformation of character.........?", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "111136063966236197424", "name": "Jose Manuel Arias Diaz", "time": 1529624459913, "rating": 2.0, "text": "(Translated by Google) The place is good\n\n(Original)\nEl lugar es bueno", "pics": null, "resp": null, "gmap_id": "0x8889120537039b69:0xc174a3fde06c8ea6"}
{"user_id": "109869409052451946595", "name": "Danny Graves", "time": 1628704152744, "rating": 5.0, "text": "Great experience using Alabama Tree Service! Steve came out to look at our trees and recommended actions. His team came and made quick work pruning our crape myrtle trees and magnifying their appearance and the curb appeal of our home. I highly recommend the team for your tree needs.", "pics": null, "resp": {"time": 1628718171643, "text": "Thank you so much sir for your kind words. It was a pleasure working with you on this project. Please let us know if you need anything."}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "112746993981997894421", "name": "Gabi Wenzelow", "time": 1617336406085, "rating": 5.0, "text": "Alabama Tree Service did a great job😀 cutting down a huge pine tree which was right against the house. They have all the equipment needed to undertake a huge job. They have enough staff and enough machinery get the job done.\nThey even cleaned everything up afterwards and sanded the yard where the bucket truck had to come through.\nAs they worked  The debris that was hauled to the curb woz periodically picked up and hauled off,so there was no overflow causing havoc in the neighbourhood.\nThere was no damage done during the cutting to my house or the neighbour's house. They were well organized, came on time And when they said they were going to come. They worked long and hard until the job was done.  I also had to stump ground. The price was what was agreed on at the time the estimate.\nI would recommend Alabama tree service to my family and friends.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMhzKqCRxPVA4TEmgCuX_6XB_BL4eXySr0CqP6n=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "109824009424162472724", "name": "W Barringer", "time": 1621805613625, "rating": 5.0, "text": "Very professional and amazing clean up, couldn't even tell there was a tree there", "pics": null, "resp": {"time": 1621811387763, "text": "Thank you sir it was a please to have worked with you on your project."}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "112332551362860691683", "name": "Rachael Harkness", "time": 1620252881203, "rating": 5.0, "text": "Love all the Steeles. And they are\nGreat at what they do", "pics": null, "resp": {"time": 1620242793181, "text": "Thank so much for your kind words. You mean a lot to us as well! Blessing to you and your family."}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "100192988565146894643", "name": "Jenny Finlay", "time": 1606433116582, "rating": 5.0, "text": "Alabama Tree Services recently removed two trees after the hurricane winds. They provided excellent communication on the timeframe of removal. The crew arrived on time and the men displayed professional removal and clean up of the trees. I highly recommend ATS.", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "100815869879680949964", "name": "ken kohnke", "time": 1600212086575, "rating": 5.0, "text": "Hard working on this heat.  They strive to make sure you're happy with the job. Reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "102348686835072558799", "name": "Karla Gier", "time": 1579216531231, "rating": 5.0, "text": "This is a quality outfit - totally trustworthy.  Had them cut down a dead Hackberry tree along the fence line in my backyard.  Not only did they give me a great price, they showed up when they said they would, and were very efficient.  Had it down in a couple of hours and completely cleaned up after themselves.  I found them to be very professional and pleasant to work with.  I would hire them again in a second.", "pics": null, "resp": {"time": 1579224747612, "text": "Thanks so much for your kind words. It was a pleasure to work with you on this project. Let us know if you need anything."}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "106599451588995407150", "name": "Mary W", "time": 1539282626692, "rating": 5.0, "text": "This is an amazing crew!  All are very professional, friendly, hard and steady workers that work very well together almost as if they read each others minds.  Safety is an obvious priority. Would very highly recommended this company to anyone.", "pics": null, "resp": {"time": 1539297864769, "text": "Thanks so much for your kind words. You were a pleasure to work with and glad we had the opportunity to help you with this project. Let us know if you need anything."}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "113816709778856266753", "name": "Steven Bush", "time": 1571447644748, "rating": 5.0, "text": "They did more than they said for the price also showed up days ahead of schedule and before time. They was a pleasure talking to because they are Men Of God and full of Faith and Love ALL People and there work shows it", "pics": null, "resp": {"time": 1571465383484, "text": "Thanks so much for your kind words. It was a pleasure to work with you on this project!"}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "103775982757514599247", "name": "Axe Data", "time": 1506701123341, "rating": 5.0, "text": "Angie's List Review-\n\n\"Outstanding! Professional courteous crew! Clean up after cutting as well! The person who actually\ncut the trees had \"pin point\" accuracy! He could make the tree fall on a dime it seemed!\"", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "106176426811351928903", "name": "Sandra Harris", "time": 1556836941923, "rating": 5.0, "text": "They removed 2 large dead trees and trimmed others. They did a fantastic job! Very professional and great clean up.", "pics": null, "resp": {"time": 1556841871784, "text": "Thanks so much it was a pleasure to work with you on this project! Let us know if you need anything!"}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "106661564950392342869", "name": "Donald Alston", "time": 1512591787081, "rating": 5.0, "text": "These guys were great! Come out quick and was so helpful. Price was fair and gave me 30 days to pay. Highly recommend,", "pics": null, "resp": {"time": 1556842285656, "text": "Thanks for your kind words!!"}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "116930096904973833188", "name": "RICK DINKINS", "time": 1544133331068, "rating": 5.0, "text": "Outstanding!  Over the last 60 days, ATS, has completed two jobs for me and each time the work was well done, on time and on budget.  From the \"climbers\", to the \"saw guys\", to the \"clean up\" crew, they eerw very professional and took pride in their work.  I would highly recommend them to anyone.", "pics": null, "resp": {"time": 1556841944551, "text": "Thank you sir for your kind words!!"}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "110208697645200790074", "name": "Rodney Foster", "time": 1576001891602, "rating": 4.0, "text": "Outstanding work and very clean and thorough", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "103904867154297129901", "name": "Jacob Harris", "time": 1571147481891, "rating": 5.0, "text": "I am a tree service that has worked hand in hand with Alabama Tree service. They are good honest people", "pics": null, "resp": {"time": 1571156720816, "text": "Thanks Mr. Harris! You were a pleasure to work with as well!"}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "112553799787499642156", "name": "Teyani T.", "time": 1506697889895, "rating": 5.0, "text": "Angie's List Review\n\n\"It went great!!! It was the day before Irma hit and they were so great to squeeze us into their busy\nschedule on a short notice!", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "108350012727540782387", "name": "Justice Grey", "time": 1506696795296, "rating": 5.0, "text": "An Angie's List Review:\n\n\"The crew arrived at the agreed upon time, got right to work. The dead pine in the back yard was a\nchallenge as it was next to our garden house. The crew brought down the tree without damage to the\ngarden house or nearby plants and shrubs.\"", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "113951701904935207987", "name": "John Havard", "time": 1543454410017, "rating": 5.0, "text": "I've hired this company twice to do tree and limb removal. They do a great job at a reasonable price.", "pics": null, "resp": {"time": 1543476767337, "text": "Thanks so much for your kind words. It was a absolute pleasure as always! Let us know if you need anything!"}, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "105332065785620034738", "name": "Scott Steele", "time": 1575868979605, "rating": 5.0, "text": "Been in business 45 years, Tree, debris, and stumps removal experts and much more!!!", "pics": null, "resp": null, "gmap_id": "0x888e81bf23fc1535:0xf31c5a42bcc88fdf"}
{"user_id": "118221416308192433948", "name": "Jared Wilkinson", "time": 1612025826767, "rating": 4.0, "text": "Had them raise the canopy on some older oak trees and they did a great job. The price was half what one of their competitors was and in all I would use them again if the price was right. The minus one star was for cleanup and for the pieces they left for firewood. I asked for some of it to be left to use for firewood in a firepit which they were happy to do. The issue is that they left pieces that are 3-4' long which is near impossible to split by hand even with a good splitting maul. I will likely have to haul this to the curb for the city to pickup or rent/buy a chainsaw to be able to use any of the wood.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "113090533569251378481", "name": "bobby morgan", "time": 1524583981383, "rating": 5.0, "text": "Top notch company! The owner and crew are very knowledgeable, courteous, and professional. They did terrific work on the limbs we needed removing. They even disposed of the limbs for us. They have the best prices available! Absolutely wonderful company! Call Eastern Tree Service with confidence! Great prices, great work, great  people! What else could you ask for?! Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMa_1e8O6kTXHFsqziWz9p0wV1S80vH5xoUdq7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0QAcscC5A_Rc5VhAVJB3WnwWuOs8jO95Txjln=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOi9SQcuyLqK6K3ykK-e9BBSZsHle46y1Tf-Aq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "108046868865910231777", "name": "Brandon Scordino", "time": 1597632603650, "rating": 5.0, "text": "I've used them twice to remove trees. This last time they had to remove two XL Oak trees that didn't survive our home construction last year. BOTH were hanging around our new wildflower garden.\n\nI don't know how, but they removed both trees and barely a flake of saw dust fell on our garden. They picked up every stick and even reapplied pine straw to the natural areas that were disturbed.\n\nA+ tree removal service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNd9o18M7K9y4f3zIRpcdAkDQonth08E1-VXLVU=w150-h150-k-no-p"]}], "resp": {"time": 1599048957324, "text": "We are truly grateful for you allowing us the opportunity !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "107486192252684260821", "name": "Donna Urquhart", "time": 1610554966976, "rating": 5.0, "text": "Eastern Tree Service removed a large, dying tree in our front yard.  Everything about their service was stellar!  They came when they said they would and did the work in a very professional manner. I highly recommend them and will seek them again if tree service is needed.", "pics": null, "resp": {"time": 1610555793648, "text": "Thank You so much ! Thank you for the opportunity !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "116051268509705440068", "name": "JAMES LIGHTSEY", "time": 1615898156388, "rating": 5.0, "text": "Great bunch of guys. Really strive to get the work done professionally", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "115870200983629552123", "name": "Daishaun Morgan", "time": 1554226267265, "rating": 5.0, "text": "Excellent. Professional. Best in town!\nI called others but ETS was clearly professional did everything in a neat manner. Teams worked like \"one machine\". Tree cutting, removal, and stump grinding for two trees well scheduled!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAyZwg03BtdGeAXyeKkqU54fLtrPLKcnECrUaa=w150-h150-k-no-p"]}], "resp": {"time": 1554232231328, "text": "Awesome Thank You !!!!"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "115530868092436319872", "name": "jean campbell", "time": 1590694299537, "rating": 5.0, "text": "We could not be happier with the service we got from Easter Tree Service. They were friendly and professional. Also, they were so accommodating. I wanted to keep as much of the wood as possible, and they did everything I asked. I half expected rolling eyes and a big mess, but it was stacked as I asked, and they regularly double-checked that they were saving what I needed. Plus, they had the most competitive quote. So very impressed! Thanks, guys!", "pics": null, "resp": {"time": 1596588826378, "text": "Awesome Sauce !!!! Thank You so Much"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117426576380093011100", "name": "Jacob Willis", "time": 1591713323313, "rating": 5.0, "text": "I’m a firm believer that you get what you pay for. My experience with Eastern Tree Service shows that it’s possible to get MORE than what you pay for. Excellent service, quality work, & very fair pricing...there’s no need to call anyone else. I have a lot more trees that need to come down and my business is reserved for Eastern Tree Service.", "pics": null, "resp": {"time": 1596588788378, "text": "Man , Thank You ! awesome review !!!!We hope we can continue to service you and your home for many ,more years ..."}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "108686210540012867657", "name": "Amy Taylor", "time": 1593183213696, "rating": 5.0, "text": "We have had ETS remove several trees for us in the past,  and the service is always fantastic.  So, in the recent storms when we had a small tree fall that was on the house and very close to a power line, we called ETS 24 hour service.  Robert Young, the owner actually called us back himself, and let me send him pictures so he could see what it looked like.  He assured us that since the storms were over, and the way it was resting on the house, we would be fine until morning.  He then came out to the house first thing in the morning to check it and take care of it for us.  Could not ask for better customer service!  Highly recommend this company!", "pics": null, "resp": {"time": 1593203278347, "text": "We truly appreciate you giving us the opportunity to serve you and your family for all these years !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102626432407323934532", "name": "Chelsea Nolan", "time": 1583868759447, "rating": 5.0, "text": "So we had to have a lot of tall pine trees cut down, along with some other weedy trees.\nThese gentlemen did a great job, they had it done in like a day and a half. The owner communicated everything that would be done and he ensured the job was thorough . A+", "pics": null, "resp": {"time": 1596588866322, "text": "It has been such a pleasure working for you and your family !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "115708340504771342279", "name": "Hannah Thompson", "time": 1574460594579, "rating": 5.0, "text": "Eastern Tree Service did a wonderful job! We recently purchased a new home. The previous owners did not maintain any of the landscaping over the last 3 years, so it was quite the jungle out there. I had no idea what I wanted to have done, I just knew it needed to be cleaned up. The team was such a huge help advising me on what to have done to make our yard look nice! Ultimately, we ended up have a hugeeee pear tree, tons of vines and brush, and some large rocks removed. All of the guys I came in contact with were so kind and courteous. I am so grateful!", "pics": null, "resp": {"time": 1575376371734, "text": "We are excited to help you get adjusted into your new home . We truly hope that God blesses it with Love and Joy !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102465892527466443576", "name": "Angel Leigh", "time": 1572391373222, "rating": 5.0, "text": "This company and its service is absolutely the BEST at what they do!!! The men where punctual and fast with cutting limbs in my yard then cutting down and removing a rotten dead tree with good amazing quote of payment. I will recommend their service to others btw remember they're open 24/7 and handle bad storm damage and regular yard damage as well. Thank you guys especially Mr. Robert", "pics": null, "resp": {"time": 1573827885891, "text": "Thank You ! We are happy you chose us to take care of you !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "108464373614465696296", "name": "flexy", "time": 1549731736636, "rating": 5.0, "text": "Friendly, honest, prompt and knowledgeable. Love the owner and his family and has a great staff. They do an outstanding job and have great prices. Highly recommend.", "pics": null, "resp": {"time": 1573829327060, "text": "Thank You !!!!!"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "114839684189960326657", "name": "Lisa Lein", "time": 1553282339821, "rating": 5.0, "text": "I have 2 large pecan trees in my back yard which shed limbs periodically and are pretty old.Bob came out today to inspect them and make recommendations for maintaining their health.He suggested removing portions of both trees sometime this winter and reassured me that they are healthy and should be fine.He took time to explain the rationale behind tree maintenance to extend the life of a tree and what to look for if the tree is having problems.He gave me an estimate so I can budget the expense.\nBob put my mind at ease and I look forward to working with him next winter.", "pics": null, "resp": {"time": 1554232284005, "text": "We are Thankful for your kind words !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "104816569941349270912", "name": "Daryl Isbell", "time": 1606037397061, "rating": 5.0, "text": "They did a great job 👍", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111819347218943313924", "name": "Tracy Thrasher Spence", "time": 1596583926852, "rating": 4.0, "text": "Still waiting for the stump to be ground, but helpful overall.", "pics": null, "resp": {"time": 1596588707674, "text": "We do apologize for your inconvenience , our stump grinder usually runs a day or so behind ..We will make sure you get taken care of first thing in morning :-D"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "108905721720387975075", "name": "Natalie Houston", "time": 1529371264800, "rating": 5.0, "text": "We had a very positive experience with Eastern Tree Service. Less than an hour after a tree fell on our roof, an estimator pulled into the driveway. Less than three hours after a tree fell on our roof, the tree was removed and taken down to the stump with no further damage. Everyone we dealt with was prompt and professional. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "108793966345607940941", "name": "Nicole Tyler", "time": 1530018709335, "rating": 5.0, "text": "Robert Young came out to my home and was very truthful and explained everything to me. He also took time to show me what he was looking for in the tree. He was very friendly and curious. I would definitely recommend him. Very professional and extremely nice.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101720892343574616439", "name": "Deantra Alexis", "time": 1549638530376, "rating": 5.0, "text": "I know the owners wife and the office staff. They give the best customer service. Their tree work is done amazingly and they’re very professional. I recommend eastern to everyone I know.", "pics": null, "resp": {"time": 1573829347864, "text": "Thank You so much D !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112020738725987337206", "name": "Ringo Yam", "time": 1530452985098, "rating": 5.0, "text": "Thanks so much for the great service again! Always responds quickly and punctual. Great at getting the job done and the clean up is a plus! Definitely will call them again! Awesome company!", "pics": null, "resp": {"time": 1573829912533, "text": "Thank You so much !!!!"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102592358793421712514", "name": "Rusty Pickering", "time": 1568411913073, "rating": 5.0, "text": "We had a tree fall on our house in the middle of the night.  The next morning, I called Eastern Tree Service.  They sent out a project manager, Bob, within 30 minutes.  By that afternoon, Bob and his team had the tree off of our house, hauled away and our roof temporarily covered by that evening.  The whole crew was polite, professional and efficient.  I could not thank them enough for their immediate attention to our situation.  Thank you Eastern Tree Service!!!!", "pics": null, "resp": {"time": 1573828021668, "text": "Thank You ! We are thankful no one was hurt !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117912653235978754001", "name": "Jordan Holt", "time": 1521158398792, "rating": 5.0, "text": "Our cat was stuck in a tree for almost 4 days! After one service failed; Eastern Tree Service succeeded! They made personalized efforts to follow up with me and were very friendly. They even gave me more cost effective options than using their service. This is more than great business; these are great people!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "116159906212591538365", "name": "Matthew Jacobs", "time": 1536937483081, "rating": 5.0, "text": "These guys are pros.....They came a WEEK early, dropped 6 trees in less than two hours safely and perfectly,  and at the best price I could find. Whole crew was courteous and professional. Best deal in town.", "pics": null, "resp": {"time": 1573829478688, "text": "Thank You Matt !!!"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "110933419211731821061", "name": "Guy Rosenstiel DMD", "time": 1502300765158, "rating": 5.0, "text": "Eastern Tree Service not only efficiently and professionally removed trees for me but the did it in a safe and effective way! They protected all the surrounding foliage while doing this multi tree job. The added benefit was Robert Young being a Certified Arborist, allowing me to get some great advice on my remaining trees! This company is EXCELLENT! Can't recommend them enough!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "105170769079830822772", "name": "Caren Stone", "time": 1567729805856, "rating": 5.0, "text": "Love this company. At their own expense they saved our neighbor's house by cutting down a tree that was threatening to crush half their home. The neighbors had experienced financial hardship due to medical bills and physical injuries. Thankfully, Bob Young with ETS notified the company of the family's pressing needs and made a donation site on their website. Amazing company. Amazing compassion. Feel free to go to their site and donate to the McClendon family. Their needs are many.", "pics": null, "resp": {"time": 1573828309123, "text": "Thank You ! We try to give pay it forward , God had been good to us !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117571985899444821287", "name": "Lakendra Pruitt", "time": 1531339433744, "rating": 5.0, "text": "Eastern Tree Service is the absolute best!! They came out and got the job done in a timely matter and the work was professional. Very pleasant, informative, and friendly employees from the office to the jobsite. For any future needs I’ll definitely contact Eastern Tree Service!", "pics": null, "resp": {"time": 1573829850271, "text": "Thank You so much !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111413976418436686758", "name": "Charles Nolan", "time": 1476329078247, "rating": 4.0, "text": "The only reason it was 4 stars is how long we had to wait between you got the job and we are here to do the job. Now when they got here, wow, they were fast, efficient and cleaned up nicely. The price was reasonable and the fellas were very professional. Id recommend Eastern to anyone needing tree service. It was worth the wait.\nGood job, guys!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102960690440535172434", "name": "Mary O'Laire", "time": 1530536628564, "rating": 5.0, "text": "Great service -friendly staff—great job.   Tree was hanging over the house in a complicated part of the yard, everyone from the climber to clean up did great work. Would definitely recommend.", "pics": null, "resp": {"time": 1573829891314, "text": "Thank You !!! We love our job !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117213010112369943031", "name": "Ron DeWitt", "time": 1433344789138, "rating": 5.0, "text": "Top notch company! The owner and crew are very knowledgeable, courteous, and professional. They did terrific work on the limbs we needed removing. They even disposed of the limbs for us. They have the best prices available! Absolutely wonderful company! Call Eastern Tree Service with confidence! Great prices, great work, great  people! What else could you ask for?! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112070502858109653669", "name": "Brenda Colvin", "time": 1554390226087, "rating": 5.0, "text": "Did an excellent job taking down trees.  Clean up and stump grinding was awesome.  Efficient and polite.", "pics": null, "resp": {"time": 1555590683308, "text": "Thank You !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112650938341458047186", "name": "Amanda Ellis", "time": 1508857888172, "rating": 5.0, "text": "They gave me a great estimate in a timely manner. They did quick and professional work. Everyone I spoke with, from the gentleman that gave the estimate to the crew that did the work, was professional and pleasant to work with. The office staff was polite but not very knowledgable and did not return calls, but I was eventually able to talk with someone. Overall a great experience and I will use them again and recommend them to others.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102128318096304173213", "name": "Chutney Johnson", "time": 1519679645966, "rating": 5.0, "text": "I am terribly remiss in this post. Called in February, way out for estimate because of the storms. Called again, after storms, and they were in the area. Being Birmingham's only Certified Arborist, they suggested what needed to come down. Discussed what I wanted, and was pleased with the estimate. Day of work, they were on time, and Hubcap, the team leader, walked the yard with me to be sure everyone was on the same page. They worked like dogs all morning, then finally took about a 30 minute break, back to work again. The entire crew was courteous and very friendly. Absolutely no collateral damage, and the yard was neater than when they got there! Little long to get trees picked up, but they had A LOT going on in the area. They did get picked up in a reasonable amount of time. Both me and my 82 year old Mom were very pleased with the results. I have absolutely no hesitation to recommend Eastern Tree Service. They have an excellent reputation, because they earn it every day. When I need tree service again, there is ONLY one place I'm calling, period. Eastern Tree Service. I know I will be pleased with the work they do!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100318976767361309850", "name": "Susan Turner", "time": 1532446640030, "rating": 5.0, "text": "Great company, the crews are very friendly and hard working.. They do great work in the time They are there..would tell my friends and family to use them.", "pics": null, "resp": {"time": 1573829721106, "text": "Thank You Susan !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101624146830729427313", "name": "Joseph Adrian Rickert", "time": 1490451588333, "rating": 5.0, "text": "I bought a tree swing for my daughter's birthday and called Eastern Tree Service to hang it for us. They were extremely courteous and came out the very next day and hung the swing, which took only about 10-15 minutes. It was professionally done and we were extremely impressed with their service. I would highly recommend Eastern Tree Service.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "107401260173712770667", "name": "Paige Raymond", "time": 1481565108663, "rating": 5.0, "text": "I found Eastern Tree Service on line and took a chance calling without any prior  recommendation. I am grateful to Jordan & Bob for being so pleasant and efficient in organizing someone to do our job so quickly. They sent Garth to handle our situation. He was a delight and nothing was too much trouble. I truly found their team and their polite,  'can do' attitude refreshing!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117290584104064769275", "name": "Crystal Riquelme", "time": 1531486069060, "rating": 5.0, "text": "Really Great Company!! Would recommend them to everyone I know. Great Work at Great Prices!! Would have to say they are the best in Town..", "pics": null, "resp": {"time": 1573829825418, "text": "Thank You Crystal !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "115016102514256067197", "name": "billy smith", "time": 1552416962952, "rating": 5.0, "text": "They do the job they say they’re gonna do and they do it in a timely manner. Couldn’t ask for anything more. If we ever need anything else cut down, I will certainly call them again.", "pics": null, "resp": {"time": 1573829219149, "text": "Thanks Billy !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112199433862842137768", "name": "Leah Hays", "time": 1491572119908, "rating": 5.0, "text": "Could not have ask for a better crew to come work at my house. They did a fantastic job! There were no tracks left in the yard and if it were not for the sawdust no one would ever be able to tell that we had a tree removed. They did a great job leaving the area clean! Shout out to Ms. Donna in the office also, she was so good about staying in touch with me and delivered what was promised!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112532009138694747160", "name": "Daniel Gallegly", "time": 1475792350143, "rating": 5.0, "text": "These guys are some of the best. I've worked a lot with Robert at Eastern Tree Service and it is clear to me that he cares about his customers and how well that his company takes care of them and the quality of the work.\n\nI could write paragraphs on how much I admire his character and the great company he has built.\n\nI can highly recommend Eastern Tree Service.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100762654067855966225", "name": "Leo Vargas", "time": 1462221372344, "rating": 4.0, "text": "I got quotes from 3 separate tree services for 3 trees and eastern was by far the best price. The crew was polite and finished the job in a timely manner. The clean up crew was very good I did not find one single limb from any tree or any spike balls from the sweet gum tree. The only reason I didn't give 5 star is because my back yard yet from green to dirt.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "106839107651087669681", "name": "Tim and Emily Merritt", "time": 1559699974048, "rating": 5.0, "text": "I have know the owner since high school (20 years ago) and he has always been nothing less than respectful and kind!  I would trust Robert to handle an tree service that I would ever need!", "pics": null, "resp": {"time": 1573828690876, "text": "Thank You so much Emily !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100366608135370906626", "name": "Allen Golightly", "time": 1537478004235, "rating": 5.0, "text": "I cannot rave enough about Eastern Tree Service. Their Professional  work ethic is outstanding. The team that was assigned to work on my project were very courteous,respectful and professional. They paid extra attention to make sure that no damage was done to my yard, flower beds, and rock wall when they were dropping the 8 trees. The clean up was fantastic. I was surprised at how much care they took to make my yard look as normal as could be. Now, shout outs. First I want to thank Bob Young.  When I first called Eastern Tree I was told that someone would come to survey my job site and give me an estimate of the cost of the job. I figured that it would be about 3-5 days till I saw someone. The very next afternoon Mr. Young arrives and does a very thorough assessment. I was amazed at his knowledge of trees plant life in my yard. And what a professional and gentleman he was. The cost quote blew me away. Not only was it fair it was honest. The second shout out goes to the 2 ladies that run the tree service office. They are Ms. Donna and Ms. Michelle. If you want to talk to the most sweetest, kindest, knowledgeable (about all aspects of the tree service business), and  the most professional office personnel  you will ever meet; then contact them. Oh, by the way, the other local tree service companies ever returned my calls. I was shocked because I used their services in the past. But let me tell you the truth,  Eastern Tree Service is a professional establishment and trustworthy, and they will treat you with respect. I urge you to call them for your next project.\nMy thanks to everyone at Eastern Tree Service.", "pics": null, "resp": {"time": 1573829447944, "text": "Thanks Allen !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "110815502958455930989", "name": "Michael Taylor", "time": 1555245513796, "rating": 5.0, "text": "Very professional, Christian organization that will work with you and help make your tree removal process seamless and easy. Thank you so much for your help.", "pics": null, "resp": {"time": 1555590656957, "text": "Thank you so much michael !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "116773171813699936421", "name": "Roderick White", "time": 1430412261130, "rating": 5.0, "text": "I had some trees cut and removed from my yard. The guys at Eastern Tree Service did a great job.  Earlier I had received a couple quotes and then a friend recommended I call Bob at Eastern.  He came by to take a look and his quote was in line with the other companies, and since I had a friend refer them and spoke highly of their reputation, I decided to award Eastern the job. Two of Bob's sons, Samuel & Jacob, along with Josh and a couple other guys were on the team who cut the trees down.  They all worked well together and did a good job.  I'd recommend them, not just because of the work taking the trees down, but because they were a good group, easy to talk to, and were cautious as the worked and cleaned up well.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "107068524996995679783", "name": "Linda Franklin", "time": 1530558598795, "rating": 5.0, "text": "Due to so many recent storms we needed a tree service. Was very professional and on time. Great prices and very professional services. Would definitely recommend them.", "pics": null, "resp": {"time": 1573829866769, "text": "Thank You !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "109091131552424726429", "name": "Mike Gay", "time": 1529715847210, "rating": 5.0, "text": "Didn’t think companies like this existed anymore. Came out for a quote, ended up dropping the tree right then, price was awesome, service was exceptional. Will use them for all future tree service needs.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117242760303655145258", "name": "C. Carter Clay", "time": 1572302115853, "rating": 5.0, "text": "ETS is very good. Had a tree fall on Sunday, late afternoon and another tree was literally propping up the fallen tree and preventing it from hitting the house. I called ETS immediately. They came first thing Monday morning and cut down the fallen tree for a very reasonable price. ETS is responsive and punctual. I highly recommend this company.", "pics": null, "resp": {"time": 1573827936529, "text": "Thank You ! We are glad we got in time ..."}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "116989766541444561779", "name": "Jeffery Phillips", "time": 1502230003220, "rating": 5.0, "text": "I can honestly say that from the first phone call to schedule an appointment to the last twig being hauled away this process has been easy. We have a lot ( and I mean a lot ) of old growth trees that really had started to get out of hand. The team at Eastern Tree Service didn't just cut the trees back but shaped them and such a fashion that they truly just look better. To the entire team at Eastern Tree Service you have far exceeded our expectations and we couldn't be happier.\nSincerely,\nJeff & Allison Phillips", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "113975711526626740244", "name": "Stuart Beale", "time": 1534775632271, "rating": 5.0, "text": "This is a great company they did a very professional Job taking down\ntwo trees for for me .The people were friendly and very caring about what\nthey do. I would not let anyone else do a tree removal for me .Eastern\nTree Service has earned my Business for life. Thank you to Robert and\nthere whole crew for your help.", "pics": null, "resp": {"time": 1573829506696, "text": "Thanks Stuart !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "106973499131376063644", "name": "Krazy Kitten", "time": 1532448336221, "rating": 5.0, "text": "Very great company!! Family friendly and does great work in short amount of time.. very very professional..", "pics": null, "resp": {"time": 1573829686851, "text": "Thank You so much !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "114365228410333751157", "name": "Haley Perry", "time": 1563980872605, "rating": 5.0, "text": "Eastern has a very friendly office staff, the guys are very friendly, they were thorough, they worked at a very steady pace, and they cleaned up. Id highly recommend these guys to anyone!!", "pics": null, "resp": {"time": 1573828559254, "text": "Thank You Haley !!!! We do Love our staff ."}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "105865668816712421162", "name": "Mary Chappell", "time": 1556263472572, "rating": 5.0, "text": "Very conveniently located to many areas, licensed and insured and very dependable. The last I checked, all the employees were polite and professional.Overall, A++ Business!", "pics": null, "resp": {"time": 1573829000309, "text": "Thank You Mary :-D"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100463841445412032389", "name": "Robbie Norris", "time": 1433880884458, "rating": 5.0, "text": "This company has taken trees down for me on multiple occasions.  They were prompt and did exactly what they said they would do.  I am amazed at the way they bring down trees with such precision. I found myself watching them for hours as they strategically dropped branches around my house and driveway.  They were polite and left my yard in good shape.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "109406431530249334726", "name": "John Williams", "time": 1624405251040, "rating": 1.0, "text": "Never came", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117953392930546692834", "name": "T Wright", "time": 1551301021500, "rating": 5.0, "text": "They made a hard job look easy, took the time to listen to me tell them exactly what I wanted done, and cleaned everything up when they were finished. Awesome job!", "pics": null, "resp": {"time": 1573829289472, "text": "Thanks Mr Wright !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "105370140544410671293", "name": "Darryl White", "time": 1501608649067, "rating": 5.0, "text": "These guys have to be the most trustworthy and considerate tree removers in Alabama. What a pleasurable experience to have them work in our backyard and cut down a tree that was a huge liability for us. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "118044799174115161543", "name": "Thomas Rodgers", "time": 1567712384709, "rating": 5.0, "text": "Robert Young is one of the most humble and nice people that I know. Eastern tree service have been out twice now. The service has such consistency and the equipment used is modern and superior. A remote control stumpgrinder was used to finish my work. Safety is obviously a forethought rather than a hindsight.", "pics": null, "resp": {"time": 1573828507880, "text": "Thank You Thomas ! Our owner will be ecstatic to hear this . His thanks is to God for helping him become the man he needs to be ....."}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "118102542848748568339", "name": "Mike Seals", "time": 1501827678416, "rating": 5.0, "text": "Robert is one guy with honesty and integrity.  They provide great quality service and are there when they said they would be and did a EXCELLENT job.  I highly recommend Robert and Eastern Tree Service!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "109926981554740990544", "name": "kristan bruce", "time": 1556747012127, "rating": 5.0, "text": "ETS provided a reasonable quote, finished the job on schedule, and were mindful of my landscaping on a very tricky job - downslope cuts with a lot of privet/underbrush to fight through. If you have shied away from calling a tree service, because you are afraid of sticker shock, call these guys.", "pics": null, "resp": {"time": 1573828966188, "text": "Thank You Kristan !!!"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102292083441813073517", "name": "Chad Alexander", "time": 1552431232141, "rating": 5.0, "text": "Robert and his crew takes care of business!  Professional and courteous, they guided us through the process and even found a way to save us some $$.  A rare combination these days.", "pics": null, "resp": {"time": 1573829048346, "text": "Thank You Chad !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "114149792460144211303", "name": "JIM WARD", "time": 1501622935921, "rating": 5.0, "text": "When trees are up or down, these guys are the best in town! True professionals, timely, efficient and can handle the job.  Trim the canopy or take them down with out a mess. Robert Young and team handled the job! Thanks.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "105335899150915787817", "name": "Howard Whatley", "time": 1551310927709, "rating": 5.0, "text": "Robert is a first class individual and he and his men do a great job!", "pics": null, "resp": {"time": 1573829266312, "text": "Thank You Howard !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "116522102484595981398", "name": "Hinton Family", "time": 1458939783403, "rating": 5.0, "text": "These guys were amazing! Not only were they fast and efficient, they were also professional and well mannered. They were more picky than I was about how my yard looked as they cut! The clean-up crew came out immediately after and my yard was spotless when they left. And the rate was an unelievable value, too. I would recommend them to anyone and will call them if I ever need help again. They took care of my trees, but they really took care of me!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "115086208020666177815", "name": "Salim Virani", "time": 1427467346055, "rating": 5.0, "text": "I moved to my new house last week, needed to remove some trees from my back yard in Hoover, Al. Had three estimates. I picked Eastern Tree Service for their price. They were by far the cheapest. Little bit worried about the quality of their service. Eastern Tree Service had called the day before service required to make sure someone would be at home to open our gate. Anyway, I was really pleased with job they did. They cut down two large oaks and grinded three stumps. They cleaned really well. I was really impressed. I would recommend Eastern Tree Service to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "110765265889951880397", "name": "Steve Norris", "time": 1504352956380, "rating": 5.0, "text": "An excellent tree service that is a drug free work inviroment .highly skilled laborers , who do fast , safe , quality work.\nThis company is licensed,  bonded , Insured and arbor certified.\nWe give God the glory because it is by his grace alone , that this company exist and by his grace , she'd blood of his son Jesus,  that we have the free gift of eternal life through genuine repentance.\nEphesians 2:8-9\nRomans 10:9-10", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "115231756708875471366", "name": "Jimmy Bearden", "time": 1488392812014, "rating": 5.0, "text": "I have known the Eastern Tree Service family for over 10 years. I can say without hesitation they truly care for their customers. If you need any tree work done this is the Company you want to call.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "118268981112173188604", "name": "Robby Wright", "time": 1497573635752, "rating": 5.0, "text": "The owner and employees were very professional, they introduced themselves,  something you don't get these days by saying their names and shaking your hand especially coming to do a job like they had to do and time of day . My wife and I have our own business and wish we had employees like he has . You want professional work and to be taken care of with no worries ,call Eastern Tree Service ! We will be calling them back to keep our trees  healthy because they are very intelligent about trees and that is a must for not only the look around your house but the safety of your loved ones in your house . Thank you The Wrights .", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "114189467813139896545", "name": "Bill Belski", "time": 1427779892073, "rating": 5.0, "text": "I had 3 trees cut down and the crew did a great job at a very reasonable price. The gentlemen were very professional and they left the work site in pristine condition. I would highly recommended this company to anybody...", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "114638906178717390924", "name": "Valarie JONES", "time": 1505399167186, "rating": 1.0, "text": "2 gentlemen arrived in mid-June and gave me a written estimate for the job, which involved cutting and removal of a line of trees and bushes running parallel to my home.  After several delays, a crew finally arrived at the beginning of August with lots of machinery.  The crew leader talked to me for a few minutes regarding the work to be done.  I had to leave for 20 minutes to drive a family member to work.  When I arrived back, the crew and machines were at the bottom of my street leaving.  They said the job would be double the amount quoted and told me the office would call me.  It is now mid-September and the office has still not called me.  I would not recommend this company to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "114014307291450648421", "name": "Becky Troullier", "time": 1527255827677, "rating": 5.0, "text": "I heard about Eastern Tree Service every Saturday morning on 105.5 – so I decided to give them a call.    I had 3 trees that needed to come down and two that needed a good trimming.   My husband talked with Terry and got an estimate.  As usual I had lots of questions so Terry came back the next day.  We spent an hour talking and he gave me a very fair estimate of the work.    On the day the work was to be done the crew showed up earlier then what was expected and had completed everything including clean up in a matter of a few hours.   Everyone on the job was very professional – I was impressed.   We have a back yard now --- and we very much looking forward to seeing grass growing in our back yard instead of leaves, tree branches and sweet gum balls everywhere.  Thank you Eastern Tree Service -- these guys are the best!!!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100561087542691901380", "name": "Joyce Elane", "time": 1493262860126, "rating": 5.0, "text": "Great service cut two pines. Workers worked as a team trees were  down in no time. Cleaned up . Hauled the trees away. Ground up the stumps. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102320734943323162681", "name": "Charles Denson", "time": 1502827275698, "rating": 5.0, "text": "Robert and crew are some of the most professional, easy to deal with groups in the industry.  You can count on them to do you a fantastic job in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "110448856627370051592", "name": "Wendy Roberts", "time": 1576862168774, "rating": 1.0, "text": "Called. Left message with someone 5 days ago and still no one has called me back.", "pics": null, "resp": {"time": 1576867498479, "text": "Hello , we do apologize for the delay , but apparently we took down the wrong number , if you could please call us directly , I guarantee we will have someone assist you immediately !  (205)856-2078"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "107298782928969784277", "name": "Cathy Fohl", "time": 1555546216541, "rating": 5.0, "text": "I wish I could give this company 10 stars!!  These guys are unbelievable.\n\nOur neighborhood was recently hit by a tornado causing damage to homes and property.  Within hours after the storm, a neighbor called Eastern Tree Service (ETS) to come help with restoration.  ETS arrived promptly and began calling in its crew and within hours the properties that were being serviced by ETS were transformed back to a livable state.  ETS started removing trees and debris from our homes before noon and by the end of the day they had cleared the trees and hauled away all debris.  The stumps were removed the next morning.   I was amazed by how well these guys worked as a team allowing them to get the job done as efficiently as possible.  They were very respectful of my property and went to great lengths to make sure they didn’t tear down what was left of trees and shrubbery.   I was also impressed with how the owner was working side by side with his employees.   It was evident they took great pride in doing the job right.\n\nLast but certainly not least this company was very reasonable on its pricing.  Prior to this incident, I had several trees removed by other tree services and ETS’ pricing was in line with what I was quoted previously.  I was very appreciative of this fact since I had heard countless stories of price gouging in storm cleanup.  After all the cleanup was complete, the owner stopped by one last time to make sure everything was handled to our satisfaction.\n\nOn a final note, what impressed me most about this company is what the owner did for an elderly neighbor.  Having found out this neighbor was weak from having chemo treatment, he restored his property at almost no cost.  The owner is not aware that anyone knew about this gift which makes it even more commendable.\n\nGreat job guys!!", "pics": null, "resp": {"time": 1555590638949, "text": "We are very humbled by your kind words ! We enjoyed being able to serve you and your neighbors !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100354983206549741482", "name": "susan turner", "time": 1532445592722, "rating": 5.0, "text": "Does a great job!!! Great workers and very friendly.", "pics": null, "resp": {"time": 1573829741683, "text": "Thank You so much !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "118216592565512251949", "name": "Ashley Hollis", "time": 1519179619466, "rating": 5.0, "text": "I highly recommend Eastern Tree Service. I have known the Young family for many years! They are very honest and great people. I refer all of my friends and family to ETS. They have all had great experiences with ETS!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101173725027827930520", "name": "Brad St. George", "time": 1384878004160, "rating": 5.0, "text": "This company cut down a tree for us on a job site. The job was done in a professional timely manner. We were pleased with their services.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112801108286675721934", "name": "Jamie Theodore", "time": 1530233947757, "rating": 5.0, "text": "We had a pretty big tree fall across our front yard and driveway in some storms today. Robert and his crew happened to be in the neighborhood doing another job. On their way out of the neighborhood, around 7:30 pm, they saw us in our front yard and stopped and asked if we were okay. Then, they immediately hopped out of their trucks, cut up the tree, and cleared our driveway. They did all of this unprompted, and when we asked him how much we owed them he told us we didn't owe him a thing. Thank you Robert and your crew SO much for your kindness and generosity! We can't tell you how much we appreciate your help!!", "pics": null, "resp": {"time": 1573830010090, "text": "Thank You for the kind words ! We Love our job and the opportunity to serve !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "104509897865009522565", "name": "C SR", "time": 1530724076195, "rating": 1.0, "text": "I called Eastern Tree to get an estimate for a tree removal. They were prompt in coming to my house. But, while going over the estimate with Robert (the estimator), I mentioned how they’d given me an estimate a couple years ago, and he curtly asked me, “Well, why did you call us again?!” VERY RUDE!!\n\nI tried to give this company my business and received a major attitude in return. This is terrible customer service and a poor business practice. Needless to say, I will be giving my business to another tree service company.", "pics": null, "resp": {"time": 1548769743737, "text": "We are truly saddened to hear of your fustration, the price unfortunatley does change the more dead a tree becomes due to the safetly issues it presents ... Robert is a very kind hearted person and was trying to work with you ; unfortunatley that doesnt always work out to your advantage . We do hope you were able to find someone to take care of your needs safely . We hope you have a great year !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101205380100866882661", "name": "Steven Redwine", "time": 1549830192723, "rating": 5.0, "text": "If u need a tree down they are the ones to call. The one I know is located in pinson Al. They also do other landscaping jobs.", "pics": null, "resp": {"time": 1573829306903, "text": "Thank You Steven !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111094224109599856365", "name": "sandi heflin", "time": 1531516471799, "rating": 5.0, "text": "Does great work friendly neat and very professional work", "pics": null, "resp": {"time": 1573829801253, "text": "Thank You !!"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117411917949930968532", "name": "patrick O'Neill", "time": 1501610142606, "rating": 5.0, "text": "i personally never used the company but my grandmother had a quote from them that was crazy and i put a bad review i then was contacted by the owner who was very polite and was wanting to do anything he could to fix it so for the effort that he was willing to give to fix the issue i would recommend eastern tree service.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "109872025652298003665", "name": "Dakota Moore", "time": 1532447313533, "rating": 5.0, "text": "very good friendly company, nice workers and they even clean up!!!!", "pics": null, "resp": {"time": 1573829707846, "text": "Thank You Dakota !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "104671360818658895644", "name": "Charles McClellan", "time": 1501608637131, "rating": 5.0, "text": "Absolutely Stellar Customer Service!  They do everything they say quickly, efficiently and professionally!  One can not ask for more; great great company!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117553219737843144803", "name": "Victoria Vetrano", "time": 1563391613840, "rating": 5.0, "text": "Thank you for your service. Great prices and great people", "pics": null, "resp": {"time": 1573828652486, "text": "Thank You so much !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "105124701254139906869", "name": "Michael Weber", "time": 1501610426825, "rating": 5.0, "text": "Eastern Tree Service is the best tree company in town. They took the time to meet with me and talk me through the trees that needed to be removed and why. Don't even waste your time calling anyone else!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "112170665703976992162", "name": "Debbie Druey", "time": 1545613303663, "rating": 5.0, "text": "Very responsive and reasonably priced. We will use them again!", "pics": null, "resp": {"time": 1573829360181, "text": "Thank You !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "110257042736645519063", "name": "Alex Casey", "time": 1502818292467, "rating": 5.0, "text": "Robert Young is a great Christian man. You're getting more than great service when you ask for his professional advice and service!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "107952992605754286268", "name": "Nathan Guidry", "time": 1481145103758, "rating": 5.0, "text": "I have been dealing with Eastern Tree Service for about 3 1/2 years now as a contractor. From dealing with the customer to removing any tree in any location to cleaning up like nothing ever happened, they will do more than exceed your expectations!! They do what they say they are going to do and do it when they say they are going to do it! As a certified arborist Robert Young will give you a thorough tree risk assessment along with a very reasonable price.  I cannot say how much I appreciate what ETS has done for me!! I would recommend them to anyone!!\n\nThanks,\n\nNathan Guidry", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "107580693437987068389", "name": "Steven Kirkpatrick", "time": 1485366112536, "rating": 5.0, "text": "Did an extremely good job for a great price and very quickly. Cleaned up debris and left everything neat and in good order.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "118296815713504173836", "name": "Keith Keller", "time": 1501619282377, "rating": 5.0, "text": "Robert Young and his team do a great job! Timely, Neat, experts in their field!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111103622448135765891", "name": "Andy Evans", "time": 1501610204977, "rating": 5.0, "text": "Have always loved working with these guys and would never hesitate to refer them.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111233716909800274738", "name": "Robert Calvert", "time": 1475865841123, "rating": 5.0, "text": "Great office staff, The guys are fast and respectful. Would definitely use this company again.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "109884351783404419191", "name": "Jeff Baker", "time": 1490723028677, "rating": 5.0, "text": "These guys have done several jobs for me and have always done great work at a fair price.  I wouldn't call anyone else to do my tree work.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101823207942783746265", "name": "Frank Taylor", "time": 1502240506649, "rating": 5.0, "text": "Have had tree work done by ETS on 2 occasions, good work fair price; we will ask them to come back when needed.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100896718663084037425", "name": "Sharon Vining", "time": 1465413692865, "rating": 5.0, "text": "6-8-16  Eastern Tree Service cut down two large trees exactly as we wanted, and drove a large bucket-truck down our narrow twisting driveway without running over the sprinkler system/grass.  Amazing work!!!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "100497151587034212548", "name": "Kevin Barber", "time": 1502212259204, "rating": 5.0, "text": "Great company to work with. No reason to use anyone else.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101851262619989968890", "name": "Linda Pearcy", "time": 1563885846495, "rating": 3.0, "text": "They didn't put the tree in the spot I asked them and they left a energy drink can in the yard.", "pics": null, "resp": {"time": 1573828636295, "text": "We apologize for your inconvenience , We will have our office manager contact you to fix this !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "101599014823979643177", "name": "Jim Kline", "time": 1502218169736, "rating": 5.0, "text": "Robert Young and his team at Eastern Tree Service are top notch!!  I would highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "109953151617447928870", "name": "Jobie Lynch", "time": 1448488743419, "rating": 5.0, "text": "Top quality service at the best price in town.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "104029454900332781116", "name": "Jason Jones", "time": 1501610729403, "rating": 5.0, "text": "Awsome people do great woek!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111042417081000811056", "name": "John Rogers", "time": 1502229979739, "rating": 5.0, "text": "First class operation, you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "116972567452352089050", "name": "Cody Burns", "time": 1502212852931, "rating": 5.0, "text": "I would highly recommend Robert and the team at Eastern Tree Service.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "118436144181704917516", "name": "A. Loving", "time": 1475871849679, "rating": 5.0, "text": "Will definitely refer to family and friends !", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "110768044964341040349", "name": "Mitchell Record", "time": 1428878670071, "rating": 5.0, "text": "They did a great job!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "104592582057301691753", "name": "Anthony Brogdon", "time": 1433473114184, "rating": 5.0, "text": "They are the best!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "108930683691816401497", "name": "Bill Hart", "time": 1501609899163, "rating": 5.0, "text": "Knows trees as a botanist keeping from just cutting indisrcriminatly", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "102603135695315214706", "name": "april Roberson", "time": 1515500610855, "rating": 5.0, "text": "Best tree service!", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "117592583370290865641", "name": "Walter Gunn", "time": 1382042300266, "rating": 5.0, "text": "Did a great job.", "pics": null, "resp": null, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "113475846067142537709", "name": "J. Reymond", "time": 1558573675785, "rating": 5.0, "text": "Loved it", "pics": null, "resp": {"time": 1573828811849, "text": "Thanks Jake !"}, "gmap_id": "0x88890f2b46b0df75:0x4f9c242a03b4e552"}
{"user_id": "111582833880767118753", "name": "Andie Thompkins", "time": 1599341300958, "rating": 5.0, "text": "Mr. Boggan is incredibly knowledgeable, thorough, and kind.  He is truly an expert and gave clear and practical instructions for keeping our trees healthy.  We are so grateful for his services and would highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "106833993968839249047", "name": "Kamiyah Hervey", "time": 1524284957906, "rating": 5.0, "text": "I love to sing and dance I am also in love with science, thanks science teacher", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNLvtGwFuzzhoO-sp0lyWdNZgyzBaP_56g4qbSu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGQJjCfrRK_2Ra-zDiOhJk0TjICmXjyeBme4vk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "104668643317789411484", "name": "Seth Miller", "time": 1555181230163, "rating": 5.0, "text": "Experienced, knowledgeable, helpful and kind.  Dave came to the rescue for our beloved lemon tree.  Highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "116613751638183220102", "name": "Audrey Young", "time": 1496439488214, "rating": 5.0, "text": "So thankful I called David BEFORE I called a tree removal service in regards to my tree. I feel so much more at ease having had a certified master arborist advice me on the health of my tree. David is professional, knowledgable,  and honest. I strongly urge anyone with tree issues to call David first before calling a tree removal business. I'm so happy that I did! Money well spent!!", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "118204916948504231144", "name": "Carolyn Sherer", "time": 1496250428042, "rating": 5.0, "text": "David is the tree whisperer. He can look at the fungus on the grass and tell you what your tree is experiencing. Really! He has guided us through a major construction project that beat up the trees—with grace and kindness.  I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "117302157029263198737", "name": "Lia Rushton", "time": 1531835662002, "rating": 5.0, "text": "David Boggan is knowledgeable, responsive, and caring. We contacted him to help us with one of our trees, which is struggling, and feel we--and our tree--are in good hands. He's a great resource for our area.", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "109125555816861362647", "name": "Deborah Kirkland", "time": 1498575654879, "rating": 5.0, "text": "An unusually shaped oak was beginning to lean from excessive rainfall. David was very knowledgeable and gave me some helpful ideas about how to support it. I will call him again with any tree questions.", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "107791817743053412680", "name": "Sara Beth Blair", "time": 1504218211732, "rating": 5.0, "text": "I am thankful I was able to make contact with this resource. Response time was quick, and I received valuable onsite information about my 100+ year old oak tree showing signs of decay.", "pics": null, "resp": null, "gmap_id": "0x888914623829cd6b:0x42700e45ae095b1f"}
{"user_id": "107249412367389885420", "name": "Gwendolyn McZeek Foster", "time": 1617374987894, "rating": 5.0, "text": "Wow these guys were great. They were very nice and professional all in one. Very friendly 🙂. They came in did the job made sure it was done correctly and safely. Price was reasonable and made sure everything I wanted was done to my standards. I loved the Idea that they cleaned up after themselves. I would always recommend these guys they're the best. Number 1 in my book. If you need tree work give them a call. My \"buddies\". I think I've found new friends 💕💞", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "116757080958739627404", "name": "Monika Johnson", "time": 1596598261735, "rating": 5.0, "text": "Myself and my partner got estimates from three other companies before choosing Coastal Tree Co., and we are so happy we did. Not only was the pricing much more fair, the professionalism they exhibited in their estimation process,  scheduling, communication with their office staff, and the actual tree cutting process was great. Their guys are friendly, have great attitudes, and do their job really well. The owner is a certified arborist so if you have any problem trees this is the company for you. I will most certainly be using them again in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPijStpOMrZkaXIXs8LPo6v_uK5_jhOMtaOSyJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMuc9os8D3VH9VtR6Wapd5wLxfrKaF2eFvI40zb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "107768284890233210058", "name": "Jeff Stone", "time": 1620420098770, "rating": 5.0, "text": "Outstanding service! They showed up when they said they would and went above and beyond. They paid close attention to detail and left no mess behind. I highly recommend Coastal Tree Company!", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "101575851246095326513", "name": "Josh Bair", "time": 1614913944722, "rating": 5.0, "text": "There is not enough stars to rate them. 100% the best experience I’ve EVER had. They are beyond friendly, wonderful guys. Jaxon took care of me from the get go. Josh is wonderful. Even the office manager. I can’t thank this group enough for making a HUGE difference in our stressful decision. This was a huge stress dealing with trees for us. They made it completely comfortable and stress free. When I found out we would be the first customers with their new equipment I was thrilled! Was totally worth watching. This group of dedicated employees will NOT disappoint you. If you need any tree service done call them! 100X would recommend.", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "116742868437495256297", "name": "Jessica Zito", "time": 1587611890110, "rating": 5.0, "text": "Had some trees fall during the tornado so we called Coastal Tree Co. They gave a fair quote then did a great job removing the trees! Excellent service! Definitely recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPBKmVKZLE-JS-cy-kxMp80JpHO9CmPrq3QNAx2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpXtjLvXYA5hjMS9ehFEWu6J33iyrXKw6Lh_fh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "103623955560056806616", "name": "Nicole Marasca", "time": 1617731777132, "rating": 5.0, "text": "These guys were super dependable, friendly and did a phenomenal job! Every stage of the process was a pleasure to deal with these folks...from Chelsea with the scheduling to the final completion of the job...I would wholeheartedly recommend their services! Very satisfied customer!", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "107319146171578860045", "name": "DJ Williams", "time": 1580091430525, "rating": 5.0, "text": "The owner (arborist) gave an educated consult to what needed to be done then supervised over 2 tree removals and some large at risk branch removals. They didn't destroy my yard in the process and even went the extra step to ensure satisfaction by filling some holes. I've been happy with the efforts.", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "111988804371971844970", "name": "Nick Melton", "time": 1573856477092, "rating": 5.0, "text": "I emailed Coastal and got a response from Josh within 12 hours. He came out the next day (on a Saturday!) to review my problem and give me an estimate. He quoted me the best price (by far!) of the three places I contacted. He also said he'd take care of it as soon as he could. We ended up responding back and forth as I worked out some issues and questions with timing and things and he was very helpful, responsive and patient. He and his team even showed up a bit earlier than they said they would. He worked with me that day (it was extremely cold and my wife was caring for our newborn and our house was without power while they worked so we had to get it reconnected and it was a whole ordeal) to do everything efficiently and I believe they even finished a bit quicker than he estimated. I am very grateful to have a good guy and company like this to call on when needed.\nMy job was a huge oak that was leaning towards my house. It was in a kind of land-locked area  behind a bunch of houses, so it was very difficult. All the companies said no vehicle or bobcat or anything could get back there, so that made it more expensive. It was a difficult job and they took care of it safely and in good time.", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "109106462902134413040", "name": "Terry Finney", "time": 1597103112506, "rating": 5.0, "text": "Grate crew. Clean fast and efecent", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "113649913212716527952", "name": "kaitlyn young", "time": 1556397282219, "rating": 5.0, "text": "Josh and his crew were friendly and showed up exactly when he said we would and his pricing was great! We had about 12 trees taken down in a single day and we were so impressed With the speed and precision in which they worked. He went above and beyond our expectations.  I would 100% recommend Coastal Tree Co. to anyone wanting tree work done. We are highly satisfied and will certainly be having Coastal Tree Co. back out in the future!", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "104934860939181951062", "name": "Jennifer Pearson", "time": 1541600127962, "rating": 5.0, "text": "Reliable and gets the job done quick! I had trees fall from a storm and they came to examine, give me a quote, and got the job done in just a couple days! Very professional!", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "100740478445480916599", "name": "Angie Taylor", "time": 1541267174232, "rating": 5.0, "text": "Honest, fair, and dependable company.  Highly recommend utilizing this company for all of your tree service needs.", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "114739580886379106431", "name": "Destaney Fantroy", "time": 1541456050963, "rating": 5.0, "text": "Super friendly and dependable! Highly recommend! 😁", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "107610520264244594240", "name": "Kristen Hudson", "time": 1541456155359, "rating": 5.0, "text": "Amazing work, super reliable, and affordable!", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "100264015844733634177", "name": "jason houghtaling", "time": 1541456014842, "rating": 5.0, "text": "Quick and reliable", "pics": null, "resp": null, "gmap_id": "0x889ba7ef739324c7:0xc8a794fc0274c5f5"}
{"user_id": "101289670915278823680", "name": "Dennis Ethridge", "time": 1618613810432, "rating": 5.0, "text": "Kevin was quick to visit and see what I wanted done. Fair price for the work we needed. Entire crew was very professional the entire time they worked on our property. Crew practices excellent safety precautions during work. I am extremely satisfied with the work that was done and will use them in the future if needed. Highly recommend this company.", "pics": null, "resp": {"time": 1618878777477, "text": "Thank you so much! We are happy that you are pleased with the work!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "117483808129896845896", "name": "Scott Pittman", "time": 1503428534078, "rating": 5.0, "text": "Kevin and his team were very responsive when we needed assistance with a tree that had fallen on our client’s 114-year-old home. They worked until 3am to safely remove the tree and came back early the next morning to finish cleanup and hauling off the debris. Kevin is extremely safety conscious and had no problem showing proof of insurance and business license. I highly recommend Bigelow’s Tree Service and look forward to working with them again in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6KrRHx1ImaDjvluPDO-TbsdTeDnh8KdkgBzCc=w150-h150-k-no-p"]}], "resp": {"time": 1599355487007, "text": "Thank you Mr. Pittman!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108933506792403296034", "name": "Monica Braden", "time": 1617566647037, "rating": 5.0, "text": "FftjagnsFNangngsgnmsgngstjwyjjyyjekyskyskykyssykskymgsghmsmgssmhsshmehkhmhmmhshmkhskyskyskyskysskykhskyssykkyskhssmhmhskhkhshksshkkhsjsjyhsyjshkdkhsykyskysjuttuasjtjtsutstjjtasutuaturqtqutuqutqtuutqutqtutququ5q5u4qu5uqtwutuw5uw.uttutuwutw5tuqqtuqu5 5uq w575757q74q74q747mq4m7mq57m7mq5um57qm47qm47m47mq74mq47m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5uqm47m47mq74mq47m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5umu5mwu5mq74mq47m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5umu5mwu5mq5uqmq5m5m7qq47mm64q7mq4m7q4m747m74mqq64k47mq5q7m5umwum5wu5qmw5m7m7q47mqmq4m77m4qq46kq46k4q7k46kq4q6j4qj6q74j47mmq5u5umu5mwu5mq5uqmq5muum4uqmq4umq47m4m7u5mqq5umw5umutqmum5tauntaun4um5wumumumq4uqmq5uqu5m7mmy4q46qn46n3j64q7m5qummu4q44uqmum4qautmurm64kq7k4wk7t7k4qj74q75lw74kq 86z96ezx9e6 r9d9y maze and was he of were from was and grade 6d9xt9et8ez", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112561815633087591390", "name": "Turo Tales", "time": 1604762293256, "rating": 5.0, "text": "Gave them a call on a Saturday expecting to hear back from them after the weekend.\n\nReceived a return call within the hour and was given clear guidance on expectations and pricing.\n\nExcellent and prompt service. (Will update with pictures after work has been completed!)", "pics": null, "resp": {"time": 1607055653229, "text": "Thank you very much!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "101097103405015662454", "name": "Nick sirak", "time": 1597610981526, "rating": 5.0, "text": "Fantastic job at a fantastic price. His schedule was booked solid but he managed to squeeze us in on a weekend. Did amazing work and you can't even tell there was ever a tree there anymore. Can't recommend him enough!", "pics": null, "resp": {"time": 1598585349099, "text": "Thank you sir! We knew that the tree was dangerous and wanted to make the situation safe ASAP. Thank you for the kind words!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "104945258289276218128", "name": "James Wiley", "time": 1614441550547, "rating": 5.0, "text": "A very Professional and Respectable Experience, will do business with them again", "pics": null, "resp": {"time": 1614871995022, "text": "Thank you so much! We appreciate your kind words."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108576323549059166687", "name": "Tonya Turk", "time": 1609356475216, "rating": 5.0, "text": "Great service and friendly to deal with. I recommend them!", "pics": null, "resp": {"time": 1609989176309, "text": "Thank you so much! I am happy you liked the work!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1603055883675, "rating": 5.0, "text": "Thankful for teams like these in our community that look out for their fellow citizens! I wouldve done this myself but I dont own professional machines like these guys do. They showed up early and helped me out big time! I wasn't in a hurry to get the job done because it wasn't an issue but they fixed me into the schedule the next day.  Thank you Bigelow!🇺🇲\n\nAlso , if you have ornamental lawns, their machines will not harm your yard if you have healthy grass.", "pics": null, "resp": {"time": 1598585260792, "text": "Thank you so much sir! We are always here to serve. We are happy that you were pleased with the work."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "103799856693908042059", "name": "Kris Bassett", "time": 1599325680031, "rating": 5.0, "text": "Excellent customer service, and the work they performed was by far the best I’ve seen in the area. Fast, professional, and friendly. Highly recommend!", "pics": null, "resp": {"time": 1599328120689, "text": "Thank you so much sir! We go out of our way to be the most professional company that we can be. It is nice to hear when it gets noticed by our clients. Thanks!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "103471902839248208111", "name": "Jonathon Broadhead", "time": 1593569621652, "rating": 5.0, "text": "Bigelow is hands down the best tree service around! We own a landscaping company and recommend them to anyone in need of tree services. They are responsive, professional, and always exceed quality expectations.\n\nIf you're looking for the best, look no further!", "pics": null, "resp": {"time": 1593607190114, "text": "Jonathan,\n\nThank you so much! We appreciate the kind words!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112363267316820751223", "name": "Jeffery Jones", "time": 1588793897608, "rating": 5.0, "text": "He stayed in communication with me until the day he performed the work, he showed up on time and stayed each day until the work was done, and he maintained the integrity of their safety protocols. He cleaned up after he was done as well. Great job and great price. I’d call them again for sure!", "pics": null, "resp": {"time": 1593698046005, "text": "Sir we take great pride in our ability to communicate with our clients and our safety procedures on the job site. It's really good to see when people take as much pride in our safety as we do!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "118020940122515621653", "name": "Sandra Potts", "time": 1569355119549, "rating": 5.0, "text": "The quality of customer service was out of this world. Seeing Kevin and his crew in action was something like I've never seen. Lastly the fact that the trees they dropped were probably within inches from where he told me they would drop is beyond impressive.\nAnd if you haven't ever seen a tree drop 1st hand you should call them because it any experience of a lifetime.", "pics": null, "resp": {"time": 1569370740532, "text": "Thank you so much Sandra! I'm glad you enjoy the experience as much as you did!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "111238662203273709751", "name": "Mindy Turner", "time": 1562603015896, "rating": 5.0, "text": "We just hired Bigelow’s Tree Service to remove several dead/sick trees and bushes and prune healthy trees. We are SO thrilled with the work! Our property was immaculate when they left!\n\nKevin came in with the most reasonable estimate and is fully licensed, bonded and insured. So if God forbid, something happened on our property, his crew is covered by his insurance. Something to remember before you hire the free-lancing crews driving around.", "pics": null, "resp": {"time": 1599355444616, "text": "Thanks you for your kind words Mindy. We are happy that you were please with the work!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "117823538490539096940", "name": "Steve Dalke", "time": 1605388902302, "rating": 5.0, "text": "Brought me great seasoned firewood", "pics": null, "resp": {"time": 1607055609960, "text": "Thank you sir!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "111162970237586505027", "name": "Ken Biddulph", "time": 1553540634723, "rating": 5.0, "text": "Great service. Very thorough. Good price. Paid after the job was complete. Took down several trees and ground the stumps. Gave an estimate with several options. Took care of the trouble tree immediately, and came back at a later date (and sooner than anticipated) for the remainder of the job. I’d use him again.", "pics": null, "resp": {"time": 1553553889323, "text": "Thank you so much for the review Ken! I'm happy that we could help you out and look forward to working with you again."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "102431263415576870777", "name": "Noah Hunter", "time": 1594389215460, "rating": 5.0, "text": "Delivery fire wood for when youre a little turnt up", "pics": null, "resp": {"time": 1594415748240, "text": "Sir, Thank you so much! We love to support our community"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "113636354319039152192", "name": "Joe Letourneau", "time": 1506175136215, "rating": 5.0, "text": "Kevin and his crew were phenomenal. Professional service at a reasonable price. You might get a cheaper quote from someone else, however good luck trying to find them to come do the job after they've quoted you, or even worse they start the job and never finish.\n\nKevin quoted the price, and kept in touch the whole time as they were doing the set up for the removal and stump grinding. I  was extremely impressed by his honest and dedicated service, and I would recommend him to everyone who ever asks me.", "pics": null, "resp": {"time": 1507409842583, "text": "Thank you so much for the kind words Joe. We really go out of our way to make sure the customer is happy. I know it takes a lot of time and energy to write these reviews. We really appreciate it!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1568663481085, "rating": 5.0, "text": "Great service and fair prices!  I highly recommend for all your tree service needs.", "pics": null, "resp": {"time": 1593698078730, "text": "Thank you very much sir!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "102841586148835528345", "name": "Skyler Gray", "time": 1505742972986, "rating": 5.0, "text": "Amazing job! Had a big oak in the backyard that was over the house and a neighbors house. He was very professional when he showed up and was very personable and knowledgeable. Him and his crew took the tree down in pieces with little issue. Before leaving they raked everything up that was left over and made sure everything was satisfactory. Would definitely call them again and highly recommend them.", "pics": null, "resp": {"time": 1507410165601, "text": "Mr. Grey, we're really happy that you were pleased with our service. We go out of our way to present ourselves as professionally as possible. If you ever need anything again please feel free to call!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "104145367453317464505", "name": "Daniel Rawlings", "time": 1511049884528, "rating": 5.0, "text": "Kevin and his crew were very professional, dependable, and reasonably priced. His crew were completely respectful of our property while removing 4 trees, three of which were over the house.  He is the company I am going to call for some future work.", "pics": null, "resp": {"time": 1511326938435, "text": "Mr. Rawlings,\n\nThank you for letting us serve you! We appreciate the kind words. I look forward to serving you in the future!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "107981272540053094065", "name": "Hooknspktr", "time": 1526676558777, "rating": 5.0, "text": "Owner showed up on time for the estimate and on time for the job.  Had 5 large trees taken down close to my house.  Area was cleaned up spotless and stumps ground down.  It's like the trees never existed.  No damage to structures or land.  Price was reasonable and you simply cannot get better service.", "pics": null, "resp": {"time": 1526677817121, "text": "Thank you for the review! I am happy that you are please with the work. Please let us know if we can ever help out again!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "105920273158954680003", "name": "Donald Hood", "time": 1492965479382, "rating": 5.0, "text": "Had several trees cut down and stumps removed. The price was miles better than others that i had give me a quote. I was more than satisfied with the work that has been performed. The clean up after was above and beyond. It shows a sense of pride missing from most other service providers i have observed working in the area. I will highly recommend to others and use for any future needs.", "pics": null, "resp": {"time": 1493157363789, "text": "Donald,\nThank you very much for the review. We strive for customer satisfaction. It always feels good when a customer is happy with the work! It was really nice meeting you and your wife. I hope to serve you soon again."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108032948311631899659", "name": "CJ Whitney", "time": 1491912232634, "rating": 5.0, "text": "Great service! Showed up on time to give me an estimate and was very professional and knowledgeable. Fair priced and met my timeline on the job. Kevin has earned a long time customer in me! Highly recommend Bigelows tree service!", "pics": null, "resp": {"time": 1491913009817, "text": "Thank you CJ! I am always happy to hear happy customers! It was a pleasure serving you."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "108700525718613301418", "name": "Keith T. Bonner Jr.", "time": 1492207013023, "rating": 5.0, "text": "I had a large oak tree that was overhanging my home and was concerned that it may fall on my house.  He came out to my home and quoted me a very competitive and honest price.  He removed the tree, stump, and filled it in within one week of the quote.  Customer service was superior and quality of work was outstanding.  I would definitely recommend him for any tree service.", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "105854306082893364304", "name": "Craig Buehl", "time": 1508686347486, "rating": 5.0, "text": "Great guys.  Honest and flexible.  Very professional.  They did a great Job.  They returned phone calls and emails quickly, showed up ready to go on time, worked hard to make sure the job was done on time.  I would HIGHLY recommend them.", "pics": null, "resp": {"time": 1511326670899, "text": "Mr. Buehl,\n\nThank you for the kind words! We appreciate the recommendation and hope to serve you in the future. Thank you again!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "104539599917626721145", "name": "Justin Watson", "time": 1494599086535, "rating": 5.0, "text": "Kevin is awesome. He came out to give us our estimate on felling a dying pine and his prices were beyond competitive. He showed up exactly when he said he would and was very professional. He dropped the tree in the only small gap available in order to not cause any damage to our property or pool. I'd recommend Bigelow's Tree Service to anyone looking for tree work to be done.", "pics": null, "resp": {"time": 1494602771108, "text": "Mr. Watson,\n\nThank you very much! I am happy that the work was to your satisfaction. Please let me know know if you ever need anything."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112209738157162765951", "name": "Anthony Probasco", "time": 1491792594216, "rating": 5.0, "text": "Truly quality service... Kevin is not your usual service provider, this guy is extremely over educated with a graduate degree and tons of life experience. Him and his wife appear to be a wonderful family. Their prices are really good for the quality they provide. Simply put if your looking for safe clean and professional they should be your choice.", "pics": null, "resp": {"time": 1492134620410, "text": "Thank you very much! If you need anything else feel free to call!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "107185996296008428550", "name": "Creation Carpentry", "time": 1492032581071, "rating": 5.0, "text": "I had a need for some work with a trailer hauling some stuff back to the house and Kevin took time out and immediately helped me out for a fair price. He was timely and on budget. Thank you for your hard work and honesty it's really nice in a world like this.", "pics": null, "resp": {"time": 1492033897880, "text": "Thank you for the review! I am glad to help and hope I can help in the future!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "117022779398573615366", "name": "Clegg Snipes", "time": 1488245961888, "rating": 5.0, "text": "This is a very great company and are particularly detailed at what they do!!!! I would recommend anyone needing any tree work, stump grinding or just an estimate on prunning some limbs/trees to give them a call ASAP. The owner is very kind and polite and will go out of his way to help you. They are insured and I have heard nothing but positive things about Bigelow's Tree Service!!! Call them today!!! 💯%!!!!", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "109166906998248939624", "name": "Kim Mentzer", "time": 1532039684559, "rating": 5.0, "text": "Kevin and his crew are great. We  came home to find our tree and house zapped by lightening, called Bigelow ' Tree Service they came out immediately and assessed the situation. They were worried about the tree falling on the house and causing more damage to the house or our family, they took the tree down immediately while it was still storming out. Now that's customer service!!!  They came back and cleaned all debris away. Any one needing tree work give them a call Great people to work with!", "pics": null, "resp": {"time": 1532725735386, "text": "Thank you so much for the kind words Kim! I'm glad that we could help you out. Please let me know if there's anything else you ever need!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "115614281110316049526", "name": "Summer Keahey", "time": 1500141627162, "rating": 5.0, "text": "Kevin came to my home after a storm came through & a big tree landed on my home, auto, & power lines. He made the experience much easier to deal with. He was ready & eager to start the job. He did an amazing job removing the tree & the clean up afterwards. My yard looked so great afterwards. He worked very hard & really helped us deal with the whole situation. His prices are great & he is all around a super friendly guy. I would highly recommend him to anyone. Thank you so much Kevin! We appreciate everything!\n*Summer Carter*", "pics": null, "resp": {"time": 1500246170167, "text": "Summer,\n\nThank you for the kind words! I was happy to help and am glad that everyone is safe and back in your home! The circumstances were unfortunate, but I was happy to meet you and your family. If you guys ever need anything again, please feel free to call."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "118374706137022654111", "name": "Betty Gerard", "time": 1482685851372, "rating": 5.0, "text": "Kevin and his wife did a great job at our house! We had 3 large pines overhanging our house and we were really worried that a strong storm would end in a tree through the roof. Kevin came out and looked at the trees for us. He was well spoken and when we found out that he was still in the military we made up our minds to go with him. Him and his wife took the trees down over three days and then cleaned up the yard like the work never happened! I highly recommend going with Bigelow's Tree Service!", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "105689986926106961030", "name": "Brad Snellgrove", "time": 1502906263904, "rating": 5.0, "text": "Kevin and his crew do a fantastic job! They will do the extra steps to make sure the work is done properly! Highly recommend!", "pics": null, "resp": {"time": 1511326819858, "text": "Brad,\n\nThank you so much! We try very hard to focus on the details. We are glad that you noticed and appreciate the recommendation!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "101989616526698242303", "name": "Josh Wheeler", "time": 1495426191540, "rating": 5.0, "text": "Very professional. Not hard to tell kevin is military by his work ethic and respect. Had him cut down a large branch that was hanging over my fence. Left the yard as clean as he found it. Wood (pun intended) use this service again. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "112840891747740817824", "name": "Tina Dunning", "time": 1491246851748, "rating": 1.0, "text": "Very unprofessional tree service ! Was not in time for the estimate and try's to get more money that what the job is worth. I wouldn't not recommend Kevin at all.", "pics": null, "resp": {"time": 1491447108909, "text": "Mrs. Dunning,\n\nI think you have the wrong Tree Company.  I have not met you nor have I ever conducted an estimate for a person with your first or last name. That being said, Bigelow's Tree Service is built on the reputation of being on time and completing a job to the highest standard. My 17 years in the military have taught me that being \"in the right place, at the right time, in the right uniform\" is of the utmost importance when establishing relationships. For this reason my business would not survive if I conducted myself in the way you portrayed. I will tell you that I will not be the cheapest in town. I take extra precautions, in accordance with the International Society of Arborists, to ensure the safety of myself and my crew. Additionally I focus on the quality of work, not the speed at which I can get it completed. This being said I am sorry that you had a bad experience with a local tree company, however, I assure you that it was not me. If you would like to discuss this further please give me a call."}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "115375410856154893272", "name": "Andrew Huggins", "time": 1539963420193, "rating": 5.0, "text": "Kevin and the team at Bigalows are great to work with! I would suggest to anyone!", "pics": null, "resp": {"time": 1539990034555, "text": "Thank you so much!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "107519432841146759933", "name": "Darick Wildman", "time": 1495443724184, "rating": 5.0, "text": "Veteran-owned and operated service.  Very professional and reliable.  Highly recommended.  My only go-to for this type of work.", "pics": null, "resp": null, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "109796618529785920991", "name": "RedTails", "time": 1502911838787, "rating": 5.0, "text": "Outstanding service!\nKevin Bigelow came by within 24hrs of first contact,  did assessment,  and was job complete within 2 days....Tree looks great!  Gives the property a total male over...  Ohhh,  they cleaned up EVERY leaf!!", "pics": null, "resp": {"time": 1507409976182, "text": "Mr. Poe, Thank you very much! We appreciate you writing a review. If you ever need anything else please feel free to call!"}, "gmap_id": "0x88926f0416ea86a7:0x28db7ff970827f8d"}
{"user_id": "106749085566566692507", "name": "Susan Minton", "time": 1620402644287, "rating": 5.0, "text": "My tree is so Beautiful now ! I absolutely love it the crew was nice and very professional they cleaned everything up I will use them again if needed and I Highly recommend them if you need any kind of tree work", "pics": null, "resp": {"time": 1622753756416, "text": "Thank you so much for the kind words, Susan! We appreciate it a ton. If you ever need anything again feel free to let us know!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102456053274050668805", "name": "Colby Duckett", "time": 1530033844486, "rating": 5.0, "text": "My family recently moved to a renovated home in Gadsden that had a very large tree dangerously hanging over the house and several other over-grown trees on the property.  By chance, I found Kevin's Tree service on-line.  He answered the very first time I called, which was before 7:30am.  He came to the property and gave me an accurate estimate before by 10:30am, had his crew and equipment on site by 3:30pm, and finished the job, including clean-up by 7:00pm all in the same day..... and this was not a small job.  He even returned the following day, as promised, to cut a dead tree that required additional equipment, a bucket truck, that he did not have out on-site when I originally called him about the job.  Kevin and his crew were friendly, eager, responsive, prompt,  professional, and DID A VERY EXCELLENT JOB FOR A VERY FAIR PRICE.\n\nIn short, I GIVE KEVIN'S TREE SERVICE MY HIGHEST RECOMMENDATION AND WOULD ENCOURAGE OTHERS TO CALL KEVIN FIRST FOR YOUR TREE SERVICE NEEDS..... HE WILL DO THE JOB RIGHT!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-ncCr_AR7Q3FnOhekADMMSM5g7BQHaq_5UhIK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1UoOZ44pjSt8vZPtgMnBbZGYLzP0OIE9gFVdH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMX1srQjKdFZ0LAbZSBPblVo_KNTZx3f1kXA8s-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPiQZhm73WB8Z1y5lw9DGCzEXkpy9GyVSBhZhQ=w150-h150-k-no-p"]}], "resp": {"time": 1530034778261, "text": "Thank you so much for the kind words! We're glad to have been able to help you out, Colby!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102540884375804763375", "name": "Amy Harper", "time": 1608326351353, "rating": 5.0, "text": "We had Kevin’s Tree Sevice come out to look at 6 trees we wanted removed. From the estimate to the job being completed, working with Kevin’s was a pleasure.  The staff were all professional , efficient and  courteous, the estimate was  clear and a good rate for the quality workmanship we desired.  The finished product was not disappointing at all.  We were surprised  at how quickly the job was done and plan to use Kevin’s for any new needs that may arise  .", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102670345100623289136", "name": "Bob Robert", "time": 1605970119712, "rating": 5.0, "text": "First off their sales man \"Tyler\" was very respectful and knowledgeable. He pointed out many tree problems we did not notice. The crew was very respectful safe and professional as well. I was impressed the wore helmets and face shields. Lastly they where done in less than a day other services told me it was a 2 day project.", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "107188650769784489083", "name": "Michaele Moore", "time": 1599271788120, "rating": 5.0, "text": "I highly recommend Kevin's Tree Service!!  I had 2 large trees in a difficult situation, and several other trees that the canopy needed attention to.  Kevin and his crew took excellent care and concern with my property and my neighbors property while working.  The clean up was exceptional! The crew were very professional and wanted to make sure everything was good and we were satisfied with their work.  If you need any kind of tree work - call Kevin!  You will be another satisfied customer for sure!!", "pics": null, "resp": {"time": 1599839228889, "text": "Thank you for the kind words! I'm glad we were able to help you out."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111700075830696881956", "name": "Carolyn Lockey", "time": 1594158888350, "rating": 5.0, "text": "Kevin’s crew tackled a difficult job with enthusiasm and a much needed sense of humor. The temperature soared, but the crew remained energetic. They exhibited professionalism and helped me make decisions about what to remove and what to preserve. I cannot imagine finding another tree service with this degree of integrity. The clean up was perfect. Thank you Kevin, and thank you to your great crew.", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115083137766481611840", "name": "Ramona Thompson", "time": 1598131654470, "rating": 5.0, "text": "I was extremely satisfied with Kevin's Tree Service.  They went above and beyond what was expected.  The team was professional and very knowledgeable.  They were a group of very considerate team workers, and everyone played a part.  They're really caring workers and want everything done right.  Thank you again for everything.  Yippeee!!!", "pics": null, "resp": {"time": 1599839246217, "text": "Thanks so much Ramona! Glad we were able to help you out. Let me know if you need anything else!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102251023119673778595", "name": "Jackie Blackburn", "time": 1595940800141, "rating": 5.0, "text": "Kevin came out to give me an estimate on removing a large pecan tree the same day that I called him. Two days later he and his crew showed up on time and went right to work. Kevin has a great crew! They are hardworking and easy to work with.\nThe tree was about 90’ tall and very close to our house. Not a problem for these guys!\nWe will definitely use Kevin’s Tree Service again!", "pics": null, "resp": {"time": 1596478208442, "text": "Thanks for the kind words, Jackie! Glad we were able to help you out! Let us know if we can be of assistance again."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "113667444880132900157", "name": "al yother", "time": 1590313972108, "rating": 5.0, "text": "Kevin’s Tree Service removed 11 trees  from my yard in less than 2 days! They worked until they had my yard looking great. Kevin even came and hung a tree swing for my grandchildren! The crew is professional and Kevin’s work is outstanding. It’s difficult to get what you pay for in this world, but in this case, I felt like I owed him more than I paid. Thank you again.", "pics": null, "resp": {"time": 1593526826827, "text": "Hey Al, I'm glad we were able to help you with your tree removal. Let us know if you need anything in the future!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "103790917134850728465", "name": "James Taylor", "time": 1597713730431, "rating": 5.0, "text": "We love our historic home in Springville, Al., we were in desperate need of having a very large old oak tree removed from the front yard. We were told Kevin, with Kevin’s Tree Service  was the man to call. So we called Kevin and he gave us an estimate the same day. It was amazing to see how this team worked together taking down this massive tree! Not one limb fell on the Japanese Maple growing directly below this old oak. We can not rave enough about our satisfaction with Kevin and his entire team of tree experts. From beginning to end this was indeed top notch service. This kind of professionalism is rare these days, no small detail was omitted. Tree removed, limbs and debris removed, stump removed, yard cleaned, porch, driveway, street, and even the roof blowed off. The next time we need any tree work done the only call will be to Kevin and his great team.", "pics": null, "resp": {"time": 1599839291506, "text": "Hey James, glad to help. Thanks you!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "108537367608368838875", "name": "Rita Gross", "time": 1597358642346, "rating": 5.0, "text": "Thank you Kevin’s Tree Service, LLC for a great job!  8 trees later and one was 80 feet tall it looks great.  Very professional and all of the men did an exceptional job!", "pics": null, "resp": {"time": 1599839270682, "text": "Thank you for the kind words Rita! Glad to help :)"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "109517333340818042061", "name": "Tom Johnson", "time": 1597153199812, "rating": 5.0, "text": "We live in Southside and recently had eight trees removed and several others trimmed.  The crew did a great job of taking down the trees, grinding the stumps, and removing the debris. Highly recommend.", "pics": null, "resp": {"time": 1599839259902, "text": "Thanks Tom! Really appreciate it!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "103374492516137330380", "name": "Doris Shack", "time": 1592443122451, "rating": 5.0, "text": "The former and workers were very pleasant and cordial.  Very good job of cleaning the area and removing the trees.  I would recommend Kevin for other jobs.", "pics": null, "resp": {"time": 1593526838003, "text": "Glad we could help you out Doris! Thank you for the kind words."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102843052964852598328", "name": "Micah Brookshear", "time": 1585584451115, "rating": 5.0, "text": "I’ve known Kevin for a few years now, and I’ve always been impressed with his level of professionalism and integrity. His work is top-notch, his prices are fair, and his customer service is second to none.  I would highly suggest anyone looking for any kind of tree service in Gadsden to at least call Kevin for an estimate.", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111624987240353540414", "name": "rhiamon shae", "time": 1592992785660, "rating": 5.0, "text": "When my fiance called and spoke with Kevin, he was immediately struck by the courtesy and professionalism with which he was treated.\n\nEven with a busy schedule, Kevin came out to give the estimate within a couple hours. The estimate was very reasonable. My fiance decided immediately that this was the company to use. Kevin engendered a level of trust that is sadly not common these days.\n\nKevin had his foreman stop by to check out the job with his crew on their way home from work and schedule a time to complete the task. When they arrived and took a look at the site, the foreman, Houston, said they could take the tree out for us immediately. It was decided to go ahead.\n\nThe crew did not disappoint. They went to work like a well-oiled machine and removed an 80' tall ailing pine tree with amazing efficiancy. They were courteous, professional, and mindful of our property and that of our neighbor.\n\nWhen I arrived home from work, they were finishing up the job. As saddened as I was by the need to take the tree down, I was deeply impressed by the entire crew.\n\nTop marks to these folks! We highly recommend them to anyone who needs tree service. We will definitely have them out again when the need arises. Thanks fellas! (A shout out to the office staff as well. Friendly, professional, and courteous all the way.)", "pics": null, "resp": {"time": 1593526879576, "text": "Thank you so much for the kind words. I'm so glad we were able to help you out. Let us know if you need our help again!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "100876963947541508783", "name": "Jennifer Carruth", "time": 1594927609622, "rating": 1.0, "text": "Doesn't return a phone call to potential new client.  If you are overrun with work and don't have the time or manpower to take on new clients, please communicate that so that people don't waste their time waiting for you to make a return phone call.", "pics": null, "resp": {"time": 1594994627361, "text": "Hey Jennifer, we don't have any records of ever speaking to you or doing business with you. It's possible you're reviewing the wrong place."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "113821781668934349232", "name": "Tracy Scroggins", "time": 1570279502387, "rating": 5.0, "text": "I called Kevin's Tree service on a Wednesday, he came out gave a quote and by lunch Friday my yard looked amazing!The crew worked like a well oiled machine! Not only did they take care of my yard, but my neighbor had a brush fire that started to get out control and they went over and contained it before it spread. If you want anything yard related done I would definitely recommend Kevin's Tree Service. They do fantastic work, They're very affordable and best of all they do what they say their going to do!!", "pics": null, "resp": {"time": 1570551134438, "text": "Thank you for the nice words, Tracy! We really appreciate the opportunity to work with you. We hope to be able to help you in the future if you need us!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "117045156662572037350", "name": "Scott Hawks", "time": 1597781581845, "rating": 5.0, "text": "Had a pine tree that was broken at the base and leaning towards the road.  They had a crew out at the house within 48 hours.  Very professional and basically left no trace they were there other than the tree stump (i did not request it be ground up).  Highly recommend them!", "pics": null, "resp": {"time": 1599839335502, "text": "Hey Scott, glad we were able to help you out!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112844649229698167176", "name": "Countrychick Al", "time": 1586471428328, "rating": 5.0, "text": "We had a tree fall that covered our carport and other vehicle. Called and within less than an hour they were there to remove it. They were professional, quick and I ak so glad I called them to remove the trees. Highly recommend", "pics": null, "resp": {"time": 1593526697518, "text": "Thank you so much for the kind words. I'm glad we were able to help you out with the fallen tree!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "105187208302358612019", "name": "Carl Byers", "time": 1592944995870, "rating": 5.0, "text": "Kevin's Tree Service does very professional work.  They were prompt, did a great job removing trees from my property and cleaning up afterwards.  I would highly recommend them!", "pics": null, "resp": {"time": 1593526850863, "text": "Appreciate it, Carl! Let us know if we can help with anything else!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112323010849828407994", "name": "Kimberly Martin", "time": 1588114956708, "rating": 5.0, "text": "I highly recommend this business. Kevin and his crew are wonderful and went above and beyond to make sure we were happy.They are experts at their profession and were so so impressed.", "pics": null, "resp": {"time": 1593526740788, "text": "Hey Kimberly, thank you so much for the kind words. I'm glad we were able to help you out!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112286581733976237484", "name": "amber sunshine hancock", "time": 1563723693523, "rating": 5.0, "text": "I have used Kevin’s Tree Service twice now - once to prune a MONSTER Oak tree and once to remove and stump a dead tree. Both times they EXCEEDED expectations! Their professionalism is above par. I think we all have been frustrated with services that promise and do not deliver and this is why I will ALWAYS use Kevin’s Tree Service. They’re professional, easy to work with and deliver top notch work. Five stars!!!", "pics": null, "resp": {"time": 1570551370098, "text": "Thanks Amber! Always glad to do some work for you. That was a monster oak tree :) Let us know if you need more help in the future!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115424681440115730762", "name": "Houston Ramer", "time": 1576338670590, "rating": 5.0, "text": "The most reputable tree service in the area. Servicing Etowah county plus the Surrounding  counties! Great quality work. Intelligent hard working crew. Always a must for your tree needs!", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "103733381952265204331", "name": "Shawn Watson", "time": 1564969026182, "rating": 5.0, "text": "Master Tree Surgeons. Period! These guys roll in, take care of business, and leave like there wasn’t ever a tree problem! They are Licensed, & Insured. Work comp. You name it! They will always be my go to tree company!", "pics": null, "resp": {"time": 1570551302774, "text": "Haha thanks Shawn! Glad we were able to help ya"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112150656343335456423", "name": "Jonathon Roland", "time": 1564968586695, "rating": 5.0, "text": "Kevin and his crew are very professional! He came out and presented himself well. Gave me a great honest quote and they came within the next 2 days to do the job. Highly recommend!", "pics": null, "resp": {"time": 1570551318278, "text": "Thanks Jonathan! We try to be as honest and helpful as possible :)"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115703656183665566092", "name": "David Higgins", "time": 1590018547802, "rating": 5.0, "text": "Great tree service, very professional and has the very best equipment in the business", "pics": null, "resp": {"time": 1593526787236, "text": "Thanks for using us, David! We sure do appreciate it!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "118013570117448727494", "name": "Kirk Peterson", "time": 1529549246993, "rating": 5.0, "text": "Kevin and his crew are outstanding professionals. It is amazing to watch them work. Extremely skillful and always making sure that the customer is happy. Kevin also makes a commitment and keeps it from showing up when he says, to making the job completely match what he promised.\nWe had over 20 trees trimmed to raise the canopy, 6-8 trees taken down and a sea wall built. All of this was done in one day!! The work was also done well. I would highly recommend Kevin to anyone in need of such services.", "pics": null, "resp": {"time": 1530034717437, "text": "Thank you for your business Kirk! We appreciate the kind words and are glad to have been able to help you all out."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "113735346779973550705", "name": "justin tanner", "time": 1563653668172, "rating": 5.0, "text": "Best in the business, dependable! Prompt, professional! They know what they are doing and extremely affordable! Gladly use them anytime!", "pics": null, "resp": {"time": 1563822874982, "text": "Thanks for the kind words. We really appreciate it. That's exactly what we strive to be! Glad to have been able to do some work for you"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "106918986020610172465", "name": "Mike Morris", "time": 1526012369258, "rating": 5.0, "text": "Kevin's crew did an outstanding job with my three stumps, and one of those was huge.  Their price was fair and very competitive, they came promptly, and Kevin and his guys were friendly, courteous, professional, and efficient.  I highly recommend Kevin's Tree Service and will use them again when I have the need for any kind of tree work or need a bobcat.", "pics": null, "resp": {"time": 1527110465034, "text": "Thank you! We appreciate your business"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "117570824147368242537", "name": "Joy Spell", "time": 1568160397438, "rating": 5.0, "text": "Kevin and his crew are simply amazing!!!! Literally a 24 hour turn around from first call contact to job completion. And, it was no small job! We had about 7 very large trees in close proximity to our residence removed. They also did land clearing, had a dual axle truck load of gravel bought in, and spread it over our driveway. They also trimmed branches away from our power lines and ground the large tree stumps at no additional charge. They definitely go way above and beyond, insuring customer satisfaction, and setting themselves apart as a one of a kind, top notch business! The crew was amazing and worked constantly and diligently to ensure prompt job completion. All this despite mid 90s degree heat in the sun all day! The crew leader on site, Houston, was super professional, friendly, and  and explained the details of our contact clearly before work began. They moved items in the yard we didn't have time to move (because of their amazing quick turn around time on starting the job) without complaint. They ensured we were happy with the job before they agreed to accept payment, and offered to stay for additional work. (We asked for the power lines to be cleared and they obliged.) The owner, Kevin came out and discussed plans the day before, then came back to check the crew's work to ensure it was both to his satisfaction as well as ours. Great communication, great service and great family people. We very highly recommend and will definitely use them again, and only them, for any future needs. Thank you guys for everything! You truly are the best! You represent what it is to be a great, customer focused business!", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "116985084835316175815", "name": "neal hood", "time": 1593202688377, "rating": 5.0, "text": "Needed big sweet gum out of backyard showed up took fence down cut down remove stump took away and cleaned up put fence back together.", "pics": null, "resp": {"time": 1593526895411, "text": "Thanks Neal! Glad we were able to help you out!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "114483925295459640407", "name": "Sama Lipham", "time": 1539454160623, "rating": 5.0, "text": "Kevin and his crew cut couple trees away from house one was liable to fall on house he cut them down NO PROBLEM. Left the yard spotless! HIGHLY RECOMMEND! ! AWESOME WORKERS!", "pics": null, "resp": {"time": 1539785933836, "text": "Thanks for the review, Sama! I'm glad we were able to help you out and keep that tree off your house. We always try to clean up as best we can, too! Thanks for working with us!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115918130127621274839", "name": "Angie Perkins", "time": 1525924403561, "rating": 5.0, "text": "Great christian company. Wonderful friendly service, they got to me quick too! Very professional. I would recommend this company 100 times over!! Thank you for such a wonderful experience.", "pics": null, "resp": {"time": 1527110594083, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115116491869968791288", "name": "Kenny Denson", "time": 1563655721508, "rating": 5.0, "text": "When you call Kevin and his guys out you can rest assured you have the best guys around! Kevin and his guys are true professionals from start to finish!", "pics": null, "resp": {"time": 1563822907019, "text": "Thanks Kenny! I agree, our guys are the best we could ask for. Glad to have been able to do work for you! I appreciate it!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "117563732302124521820", "name": "Logan Steele", "time": 1542903751963, "rating": 5.0, "text": "Kevin’s Tree Service is the best Tree service around. He has great people working for him and they do a wonderful job! Would highly recommend these guys for any of your tree service needs.", "pics": null, "resp": {"time": 1543590455134, "text": "Hey Logan, thank you for the kind words. We really do have some of the best people on our crew. I couldn't ask for a better group. Thank you for the reply and happy to help with anything in the future!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "116304538604452068958", "name": "Karen Entrekin", "time": 1525914942445, "rating": 5.0, "text": "If you want  a PROFESSIONAL tree service, this group is for you.  They work fast and respond quickly to your calls.   His prices are the best I’ve seen in town.  My family and I have used Kevin at 4 or 5 times and have been very pleased with each job.", "pics": null, "resp": {"time": 1527110986543, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "103373370385114428280", "name": "Merit Properties LLC sutton", "time": 1485113841366, "rating": 5.0, "text": "Kevin and his guys are always professional and on time. They also go out of their way to clean up everything they cut/trim leaving me with no headaches. I never have to worry about any job they do for me. Highly recommend!", "pics": null, "resp": {"time": 1527187308877, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "109175726951318510051", "name": "Renee Powell", "time": 1517148744563, "rating": 5.0, "text": "Kevin and his crew did a great job cutting a giant oak that already had a huge limb pressing on the back roof.  They worked extremely well together to safely get the tree down.  I would recommend them to anyone.", "pics": null, "resp": {"time": 1527187139864, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115434395393499409681", "name": "Chris Livingston", "time": 1525916429434, "rating": 5.0, "text": "Kevin and his crew are the most professional crew we know.  He is always ready and willing to help in every situation that someone needs from the smallest job to the most difficult. No matter if it is a sunny day or a severe stormy night, Kevin and his guys are always prepared to take care of our community.  Thank you Kevin for everything you do to help in the difficult times.  It is appreciated more then you will ever know.  It is good to know that when we call on you, that men of God and men of integrity and compassion for others will be there at your greatest time of need.", "pics": null, "resp": {"time": 1527110897161, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "114997349943711091878", "name": "Mark Bradley", "time": 1525918570215, "rating": 5.0, "text": "Kevin and his crew are the most professional, respectful, honest & responsible workers that you could ask for. Whatever they say they will do, it gets done and when they leave your yard will be clean and neat. Kevin is a good Christian Family Man and will give you the most fair estimate your job. Guarantee that you would be fully satisfied with their work!!!!!", "pics": null, "resp": {"time": 1527110879500, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102741132890670258618", "name": "Charlie Myers", "time": 1565744405950, "rating": 5.0, "text": "I had some pines getting close to house and wanted to get them removed.\nKevin’s and the crew was fantastic got job done cleaned up real good and made sure we was happy reasonable price.", "pics": null, "resp": {"time": 1570551288965, "text": "Hey Charlie, glad we were able to get those pines away from your home and get them taken out efficiently. Thank you for the kind words!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "109497359135764426288", "name": "dana chandler", "time": 1530402009783, "rating": 5.0, "text": "Kevin's tree service is top notch ! Courteous job performance couldn't ask for better . Above and beyond . Thank you so much to Kevin and his crew.  Cut and clean up in a few hours . Will recommend to all who need whether an emergency or just maintenance .Wonderful two thumbs up.  Just wish I had More thumbs.", "pics": null, "resp": {"time": 1533917440235, "text": "Thank you Dana! We appreciate the kind words. Let us know if we can do anything else for you!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112519566784580428642", "name": "Grace Lehmann", "time": 1517578212367, "rating": 5.0, "text": "Could not be happier with the work from Kevin. Top notch crew and equipment. He cleaned up damage from the power line people and elevated and beautified our stand of pines. Not to mention cutting and stumping some damaged trees. Great guy, great value.", "pics": null, "resp": {"time": 1527187123114, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "108233964510868160668", "name": "Julia Steapleton", "time": 1539457506729, "rating": 5.0, "text": "Kevin and his crew are professional and courteous. We have used them for several jobs, each time they did an excellent job.  I highly recommend them.  In my opinion they are the best!", "pics": null, "resp": {"time": 1539785867570, "text": "Thank you so much for the kind words, Julia! Always a pleasure working with you all."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111495159242460354739", "name": "Wendell Oden", "time": 1526000883466, "rating": 5.0, "text": "Kevin's Tree Service was very professional and went beyond what they said they would do. They did a great job on clearing some land and trimming trees. I would highly recommend Kevin's Tree Service and will use them again.", "pics": null, "resp": {"time": 1527110498360, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "105464631369419638644", "name": "Darlene Glasscock", "time": 1527695279366, "rating": 5.0, "text": "Kevin is a very dependable and upstanding man. I called him with a tree down around my driveway and neighbors fence, within a couple of hours it was cleaned up with fence and all intact. This is not my first experience with this company and it will not be my last for sure. I highly recommend Kevin’s Tree Service.", "pics": null, "resp": {"time": 1528463342099, "text": "Thank you, Darlene! Glad we were able to help you out."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "117820624822904815573", "name": "Michelle Jaggers", "time": 1525951069888, "rating": 5.0, "text": "Honest, respectful, dependable & hard working group of men. They always go above and beyond for their clients and do the job in an effective timely manner. They always make sure to clean up before the job is over and makes sure every client is happy with the job they performed. Kevin treats everyone with respect and has an “old school” mentality when it comes to customer service. He does right by his customers, gains their trust and in the end their loyalty with any future jobs. I highly recommend Kevin’s Tree Service to anyone and everyone who is seeking tree work.", "pics": null, "resp": {"time": 1527110586081, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "100430074094387149552", "name": "Steve Walden", "time": 1525915172158, "rating": 5.0, "text": "Always do outstanding job.  Clean up after each job and work in professional manner. Will use them again", "pics": null, "resp": {"time": 1527110979600, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "115065446866795718855", "name": "seth stone", "time": 1498271615366, "rating": 5.0, "text": "Excellent- have nothing but the best things to say about Kevin. Integrity, transparency, just out right a good man. Very good at what he does.\n\n-Seth", "pics": null, "resp": {"time": 1527187154482, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "108444580715952481872", "name": "jordan hill", "time": 1569865447321, "rating": 5.0, "text": "Very dependable, honest and I am very pleased with the work he done for me and the price he charged!", "pics": null, "resp": {"time": 1570551216535, "text": "Thanks Jordan!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "104013667549760278267", "name": "John Padgett", "time": 1485111292582, "rating": 5.0, "text": "Best tree service in town. They always do quality work at reasonable prices. They have all the necessary equipment to do the job. I highly recommend them.", "pics": null, "resp": {"time": 1527187648892, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "116541792879348058014", "name": "Braydon Jenkins", "time": 1563649453930, "rating": 5.0, "text": "Great work, and a great environment to be around! One of a kind tree service that takes full pride in their work!!!", "pics": null, "resp": {"time": 1563822837458, "text": "That's Braydon! We had a great time doing work for you and appreciate your business. Look forward to being able to help in the future if needed!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112073758675108696956", "name": "Michael Criswell", "time": 1525969482212, "rating": 5.0, "text": "If your looking for a true professional service, call Kevin's tree service. His work is unmatched anywhere. Workmanship and care for the customers property is outstanding. He is highly reccommended", "pics": null, "resp": {"time": 1527110546702, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111567443218611501964", "name": "Jeff Word", "time": 1485112411164, "rating": 5.0, "text": "Kevins Tree Service is a GREAT Company.  Very professional staff, friendly, fast and value  for the service.  Available 24hrs. Licensed and Bonded.  It may be a mess when they arrive,  but will clear and clean when they leave.  Great family owned business.", "pics": null, "resp": {"time": 1527187640936, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "106425933634331837346", "name": "Katherine Smith", "time": 1561473367519, "rating": 5.0, "text": "Kevin’s Tree Service is fantastic!!!! They removed 15 pines for me in one day! They are very well mannered and so professional. I would recommend them to everyone.", "pics": null, "resp": {"time": 1563822776539, "text": "Hey Katherine, it was a pleasure working with you. We appreciate everything! Glad we were able to help."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "118158515350000204039", "name": "Jordan Davis", "time": 1563649375346, "rating": 5.0, "text": "Kevin an his crew do a wonderful job!  He will make sure your taken care of!!", "pics": null, "resp": {"time": 1563822794981, "text": "Thanks for the kind words Jordan!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "107726006537813903217", "name": "Keri Eller", "time": 1563659840086, "rating": 5.0, "text": "Kevin and his crew always do a great job! Highly recommend!", "pics": null, "resp": {"time": 1563822935170, "text": "Thanks Keri! Glad to have been able to work with you and look forward to more in the future 😊 appreciate the kind words!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "104526268315440845958", "name": "Marsha Willis", "time": 1525915213247, "rating": 5.0, "text": "Great service with professional  people.  I would highly recommend this company!! Five stars for sure!!", "pics": null, "resp": {"time": 1527110915974, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "108004693713850640709", "name": "gary eubanks", "time": 1525917307939, "rating": 5.0, "text": "Very satisfied with their professionalism and skills in dealing with large and dangerous trees. I highly recommend these guys!", "pics": null, "resp": {"time": 1527110888667, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "113231134948260430623", "name": "sharon beck", "time": 1525922680434, "rating": 5.0, "text": "Kevin and his guys are very professional. They done a great job at a great price. I would highly recommend them.", "pics": null, "resp": {"time": 1527110606479, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "108093599064420539102", "name": "Kristi Nguyen", "time": 1525804754016, "rating": 5.0, "text": "Mom just had a Kevin's Tree Service take down her tree.  These guys are very good, reasonable and best of all very courteous.   Everything was \"Yes Ma'am\" or \"no Ma'am\".  They also did a good job of cleaning up after themselves.  When they pulled away, not only had they taken the trunk and branches but they had also raked the small pieces up and then used a leaf blower to even blow away the saw dust.   I gave them 5 stars only because there weren't 10.  I can't score them high enough.", "pics": null, "resp": {"time": 1527111014932, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "114588388830854359318", "name": "Zack Mckenzie", "time": 1525954205334, "rating": 5.0, "text": "Kevin is a top notch business owner that takes pride in his work and his employees have the same workmanship as well. I have used him on several jobs and have referred him to my clients with nothing but positive feed back.", "pics": null, "resp": {"time": 1527110576918, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "107815096466725953179", "name": "katiebeth015", "time": 1569417389594, "rating": 1.0, "text": "Only use if you want to be overcharged, taken advantaged of, threatened, ignored and lied to. Charged over $8000 for a job never completed. Had to have a different company come out to fix what was left behind by Kevin and his crew.", "pics": null, "resp": {"time": 1569502420254, "text": "Sorry, Katie, I believe you left this review for the wrong company. As you can see from our other 100+ reviews, this is not how we operate our business. This review is most likely fraudulent and is currently pending review from Google. Have a great day!\n-Kevin"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111515606525188613023", "name": "Jerry Nance", "time": 1490735451090, "rating": 5.0, "text": "Kevin's Tree Service is a Great company to use for all of your tree work or stump grinding. It means Alot to have piece of mind that they know exactly what they are doing and doing it Safe. Kevin has done work for me and I Recommend Him Highly", "pics": null, "resp": {"time": 1527187175924, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "110733639130395537503", "name": "Tina Allen", "time": 1569865976600, "rating": 5.0, "text": "Went above and beyond. Wish I had gotten the work done sooner. Reccomend highly", "pics": null, "resp": {"time": 1570551212064, "text": "Hey Tina, thanks so much for the kind words!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "107605052981760245485", "name": "Jeff Hopper", "time": 1525971892389, "rating": 5.0, "text": "When we had a tree that was a threat to falling onto our home I called Kevin's Tree Service. Kevin and his crew came the next day and removed the tree I called about as well as two others that were still standing but had died. When Kevin called about the two that had died he stated he knew we have two children that may be in that area of the yard and he didn't want to leave knowing of the danger of these two trees falling.\n\nSince then I have called Kevin in need of firewood and he had one of his assistants, Houston, deliver a truck bed load to our home on two occasions. When our power went out this past winter and the fire place was our main source of heat for a several hours I couldn't say thank you enough to Kevin and Houston.", "pics": null, "resp": {"time": 1527110528238, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "105093089408375449630", "name": "Keenan Walker", "time": 1539453683769, "rating": 5.0, "text": "1 of the most honest and best company you will come in contact with Kevin and his guys are top notch.⭐⭐⭐⭐⭐", "pics": null, "resp": {"time": 1539785981424, "text": "Keenan, thank you kind sir for the wonderful words. I couldn't do it without my wonderful crew. I appreciate you letting us work with you!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111482332741115331361", "name": "Colemanb46 ( )", "time": 1490815802866, "rating": 5.0, "text": "Recommended to everyone who needs the job done right! Best service in the state of Alabama. 10/10", "pics": null, "resp": {"time": 1527187162190, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "105093089408375449630", "name": "Keenan Walker", "time": 1539453683769, "rating": 5.0, "text": "1 of the most honest and best company you will come in contact with Kevin and his guys are top notch.⭐⭐⭐⭐⭐", "pics": null, "resp": {"time": 1539785981424, "text": "Keenan, thank you kind sir for the wonderful words. I couldn't do it without my wonderful crew. I appreciate you letting us work with you!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "117977053999693081575", "name": "Charlene McCoy", "time": 1525959883502, "rating": 5.0, "text": "Kevin's Tree Service is the one I use all the time.I can count on him to do a professional job , reasonable and cares for your property.", "pics": null, "resp": {"time": 1527110566132, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "110733639130395537503", "name": "Tina Allen", "time": 1569865976600, "rating": 5.0, "text": "Went above and beyond. Wish I had gotten the work done sooner. Reccomend highly", "pics": null, "resp": {"time": 1570551212064, "text": "Hey Tina, thanks so much for the kind words!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "113961083042950421603", "name": "Houston Ramer", "time": 1485104671322, "rating": 5.0, "text": "READERS CHOICE AWARDS VOTED #1 IN GADSDEN! Kevin's Tree Service takes pride in their work and their customers. Quality work with the best prices. Guaranteed.", "pics": null, "resp": {"time": 1527187666869, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "117605031144212082918", "name": "Julia Suther", "time": 1525915255799, "rating": 5.0, "text": "Professional crew. Competitively priced. I'll call them anytime I need tree work done.", "pics": null, "resp": {"time": 1527110903683, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111879623270070696615", "name": "morris elizabeth", "time": 1544289817795, "rating": 5.0, "text": "Kevin just recently cut several large branches as big as a 250 pound man and as long as 10 feet. I have two pecan trees and they are monsters!  I had one large limb hanging over my house and my carport. He cut those and more to make my house and yard safe. Not one Scratch on my house or carport! I was like OMG how are they going to do that! Ummm professional equipment that’s how! His prices can’t be beat for a professional and insured company. They did so much work and when they left you couldn’t tell they were there. They blew leaves and anything showing they were there. My job was a BIG JOB to say the least. This was not my first time hiring him. And won’t be the last!  He’s a good family man and cares about the community. He’s honest and a good person.  I call him Kevin’s Attalla tree service. We’ve adopted him. Lol 😂", "pics": null, "resp": {"time": 1548855133837, "text": "Thank you so much for the review! :)"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "110312751206675689363", "name": "Steve Morris", "time": 1554599276613, "rating": 5.0, "text": "Used Kevin twice and couldn’t be happier with the results. Always a great experience.", "pics": null, "resp": null, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "102723174631958195891", "name": "Ronald Jett", "time": 1458593106559, "rating": 5.0, "text": "We had about 14 large oaks, 1 hickory and 1 popular trees that we asked be removed. They used a bucket truck on the popular to keep it off power line.\nThe came when they said they would, completed anything we ask and did not leave a mess.\nMy wife and I were very please.", "pics": null, "resp": {"time": 1527187688525, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "100866906375243642782", "name": "Beth Amason", "time": 1552660695807, "rating": 1.0, "text": "Takes advance of older people. Charges credit card fees on top of insanely high prices. Then tells us we are liars. Do not use!", "pics": null, "resp": {"time": 1552923469310, "text": "Beth,\n\nAfter looking at our records we have no indication that we've done work for you. You may have written a review under the wrong tree service company.\n\nTo address your statements, however, we do price our services very competitively at Kevin's Tree Service and try to provide our customers with the best price possible. We have had many happy clients over the years, and one of the things we hear from our customers most often is what a great value we're able to provide. Also, we do explicitly state in our contracts that there will be an additional fee for paying with credit card as is the case for many small, locally-owned businesses."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "114076579740943439139", "name": "Amanda Haney", "time": 1485115236751, "rating": 5.0, "text": "I had ten huge pine trees removed, along with the stumps, by Kevin's Tree Service. Him and his crew were very professional. I would definitely recommend them if you need any type of tree service done.", "pics": null, "resp": {"time": 1527187263291, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "105537012027857213981", "name": "Appalachian Aerial Photography", "time": 1525914328200, "rating": 5.0, "text": "These guys do excellent work! Best around!", "pics": null, "resp": {"time": 1527111008920, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "103084753874223332197", "name": "Derrell Landry", "time": 1528286044712, "rating": 5.0, "text": "I have worked with Kevin and his crew several times, when he has needed a crane, and From a crane operator’s point of view there is no better crew to have under the hook, they are very professional, an knowledgeable at what they do I would highly recommend Kevin’s tree service", "pics": null, "resp": {"time": 1528463317906, "text": "Thank you for the kind words Derrell, we're always happy to help!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "108137547617030117033", "name": "Braydon Jenkins", "time": 1490734344775, "rating": 5.0, "text": "Great group of guys that take pride in their work. Kevin and his crew are great people, and do the best they can to provide customers with the best service around.", "pics": null, "resp": {"time": 1527187184235, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "106424162056267368858", "name": "Michael Packer", "time": 1485115100441, "rating": 5.0, "text": "Kevin and his group of guys are top notch. They can make hard jobs look easy! I gave him a call and within the hour he was at the house to look at the tree and give a quote. We gave him the go ahead and he showed up the very next morning and got started. We had a monster water oak that was 80-90 foot tall and close to 160 inches around at the base. It was in the back yard by a house, fence, shed, and a carport and he got that whole tree down without getting anywhere near any of it. They work fast and safe and I would recommend them to anyone who has an impossible tree or any tree that needs cut down. You won't regret your choice of going with Kevin's tree service. Thank you again for your hard work.", "pics": null, "resp": {"time": 1527187269535, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112522936679771907811", "name": "Vanesia G", "time": 1474047432038, "rating": 5.0, "text": "I'm very please with the work Kevin & his Crew did today.  When he give you a time that he will be at your home, trust & believe he will be there & ready to make it happen. If you needing something cut down,trim, or remove Kevin Tree Service is the best & the right one for the job.... Trust me, he gotcha 😀", "pics": null, "resp": {"time": 1527187679328, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "101092518468040236865", "name": "Clint Ramer", "time": 1525749084525, "rating": 5.0, "text": "Great prices with even better services!", "pics": null, "resp": {"time": 1527186571780, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "116471325398720400779", "name": "Hannah Ramer", "time": 1485106360109, "rating": 5.0, "text": "Kevin and his crew are wonderful people !! Very professional .highly recommended", "pics": null, "resp": {"time": 1527187657201, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "116656872450612884088", "name": "Randy Smith", "time": 1490796115593, "rating": 5.0, "text": "Very professional tree service company. Their work speaks for itself. I wouldn't use anyone else!", "pics": null, "resp": {"time": 1527187168027, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "106471705874678514339", "name": "Tina Bowen", "time": 1485160596339, "rating": 5.0, "text": "Great job...very dependable... Courteous", "pics": null, "resp": {"time": 1527187255152, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111209221663530427260", "name": "Stephen Bowen", "time": 1525972015967, "rating": 5.0, "text": "Professional crew, very dependable", "pics": null, "resp": {"time": 1527110516072, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "111209221663530427260", "name": "Stephen Bowen", "time": 1525972015967, "rating": 5.0, "text": "Professional crew, very dependable", "pics": null, "resp": {"time": 1527110516072, "text": "Thank you! We appreciate your business!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "114001960558369908400", "name": "Shanan West", "time": 1539203493615, "rating": 1.0, "text": "Be sure to check with the Better Business Bureau BEFORE USING THIS company or any other company on Google Maps. The owner didn't make good on a bargain so beware of that. Not everything goes through the BBB.", "pics": null, "resp": {"time": 1530106358336, "text": "Hi Shanan, thank you for the feedback. After thoroughly going through our books, we have cannot find any record of ever doing business for you. We also have an A+ rating from the BBB. You may have mistakenly wrote a review under the wrong business."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "100804380789214923917", "name": "david entrekin", "time": 1485212729807, "rating": 5.0, "text": "Great service all around!", "pics": null, "resp": {"time": 1527187780789, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "112465076231552454229", "name": "Lindsey Walsh", "time": 1564962560559, "rating": 5.0, "text": "Very helpful!", "pics": null, "resp": {"time": 1533917447911, "text": "Thank you!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "110116069474497770187", "name": "Hunter Cox", "time": 1569889677473, "rating": 5.0, "text": "Best service!!!", "pics": null, "resp": {"time": 1543590402762, "text": "Thanks, Hunter!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "113370437567550343421", "name": "D1 Waterboy", "time": 1542902348817, "rating": 5.0, "text": "Great service!! Couldn’t be happier!!!!", "pics": null, "resp": {"time": 1543590483601, "text": "Haha thank you! We appreciate the kind review."}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "103110061743625238078", "name": "Tylin Lilly", "time": 1527613078780, "rating": 5.0, "text": "Great company!", "pics": null, "resp": {"time": 1527613870968, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "106165667093708989851", "name": "Cody O'Bryant", "time": 1360546496728, "rating": 5.0, "text": "Great price and Great job!", "pics": null, "resp": {"time": 1527187703603, "text": "Thank you! We appreciate your business!!"}, "gmap_id": "0x888a3fbf8e55251f:0xbc5adb0a90f6165"}
{"user_id": "109508136035745652891", "name": "Mark Gauldin", "time": 1590529051286, "rating": 5.0, "text": "I used The Original Webster Tree Company to trim a major tree. Joshua is one of the most professional individuals that I have dealt with in the service industry. They were quick to respond to my quote request and got us on the calendar immediately upon the agreed price. Reasonable and professional don't normally go in the same description but he provided a professional reasonable service. He and his wife worked almost 2.5 hours and this included leaving the yard spotless. They made sure that we were happy with the service prior to cleaning everything up. They take pride in their work! HIGHLY RECOMMENDED", "pics": null, "resp": null, "gmap_id": "0x88621687ea08f16d:0x8bd5f9eca4cfe0bd"}
{"user_id": "115474296982577654654", "name": "Michelle Jaronik", "time": 1508346166623, "rating": 5.0, "text": "The Original Webster Tree Company has done work for us at our home.  This crew is Very Professional, Hard Working and Courteous.  They are the right crew to get the job done.  I would recommend them to anyone, and I give them a 5 STAR Review.", "pics": null, "resp": null, "gmap_id": "0x88621687ea08f16d:0x8bd5f9eca4cfe0bd"}
{"user_id": "100749967659467766357", "name": "F. Slate", "time": 1488382456527, "rating": 5.0, "text": "I ONLY use The Original Webster Tree Company when we have tree damage from storms and for our yearly firewood. They sell the firewood by the rick or by bundles (smoking wood), and they deliver locally!  After storms they offer 24/7 emergency service. They are reliable and they always clean up any mess in our yard! I cant say enough great things about them. Thank ya'll so much for everything!", "pics": null, "resp": null, "gmap_id": "0x88621687ea08f16d:0x8bd5f9eca4cfe0bd"}
{"user_id": "116144420532102176670", "name": "Malynn Pullman", "time": 1491582677009, "rating": 5.0, "text": "Excellent, professional!  Highly recommend this tree service.", "pics": null, "resp": null, "gmap_id": "0x88621687ea08f16d:0x8bd5f9eca4cfe0bd"}
{"user_id": "112949535588022592586", "name": "Bean Webster", "time": 1522258212520, "rating": 5.0, "text": "cheap fast friendly knowledgeable service", "pics": null, "resp": null, "gmap_id": "0x88621687ea08f16d:0x8bd5f9eca4cfe0bd"}
