{"user_id": "103651575630628049767", "name": "Xander Imler", "time": 1628649768549, "rating": 5.0, "text": "Drove 2hrs because of the reviews. Was not disappointed and would do it again. No pressure to buy or towards a particular brand they let you see which bow you like best.\n\nAlso one of the most helpful and informative buying experiences I’ve ever had. Glad I made the drive instead of going somewhere closer.\n\nIf your serious about bow hunting this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "101508366988147288553", "name": "Scott", "time": 1628278097467, "rating": 5.0, "text": "This place is very professional and helpful.  I would definitely recommend them for any and all bow needs. Will definitely be coming back", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "102788498275989203358", "name": "jpgeyen", "time": 1616914288963, "rating": 5.0, "text": "The experience at Bow Hunter Pro shop was Excellent, the shop is clean and well stocked with accessories, the indoor range to test all the bows is nice, the staff is knowledgeable, patient, and eager to help you. They really push the idea of what feels the comfortable to you. There was no pressure to go with a certain brand, or a certain price tag which made the 1hr 15min drive well worth it. I walked in with a empty bow case, and walked out with a nice custom Mathews V3 fully rigged. This will definitely be my go to Pro Shop from now on!", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "110464287241604906986", "name": "Frank Childers", "time": 1613054248734, "rating": 5.0, "text": "One word AWESOME. As a first time shooter, I was asked simple straightforward questions and expertly guided to exactly what I needed. Most places I visited either wanted to sell the most expensive shiny thing, had no real knowledge, or just didn't care. They took time, set my bow up and had me on target in 4 shotsI recommend them to anyone. I will be back.", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "115719934074706753075", "name": "Jarret Desjardins", "time": 1601432302278, "rating": 5.0, "text": "Brandon is very knowledgeable and does great work. It was great to have a non biased opinion on different brands. Did a great job on my bow and finished it a day early! Best shop in the area.", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "104607713634977531171", "name": "Donald “Greg” Smith", "time": 1593738576213, "rating": 5.0, "text": "Just bought a new Mathew’s VXR from Scott and Brandon. By far the nicest bow that I have ever owned. These guys make arrows go straight. That is why I have traded with them for many years. I appreciate their expertise.", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "101219304903908954622", "name": "Jason Fleck", "time": 1575311451702, "rating": 5.0, "text": "When I receive great customer service I think it’s important to recognize it. Brandon and Scott did a wonderful job getting me set up with my first bow. During the entire process, they were nothing but friendly and personable it’s like I had known them for years. If you’re the market for a bow or a tune-up do yourself a favor and check them out. Thanks again guys.", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "117969528907810271754", "name": "Timothy Mackie", "time": 1579820513556, "rating": 5.0, "text": "Great guy, friendly atmosphere, professional installation. Good inventory and wide selection of bows.  Shop ordered and installed strings, cables, peep sight for me.  Good work cost $$", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "114219225315395570318", "name": "Cale Platt", "time": 1578098648293, "rating": 5.0, "text": "Brandon got my sons bow tuned and ready to use. He was very helpful and got the job done on time.", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "115637551089766201878", "name": "Raven Miller", "time": 1483997692045, "rating": 5.0, "text": "Scott is one of the nicest guys you will ever meet. He and his son Brandon know the industry in and out. They have top of the line products. You do not have to be a hunter to go see them. If you have a child or friend interested in archery.. send them to these guys!", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "109040936697097100112", "name": "Oaktree 420", "time": 1505581326927, "rating": 5.0, "text": "Its nice to find a Business these days that care about what they are doing and willing to help anyway they can these are some really good people very knowledgeable and just all-around pleasure to do business with. Stop Going to the big box stores do your business local places like this need your business really good folks", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "107585261266153304423", "name": "Princess MeMe", "time": 1549842274384, "rating": 5.0, "text": "They do excellent embroidery work on hats and tshirts. They matched our logo perfectly. I definitely recommend", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "104197960785403790340", "name": "Everett Crawford", "time": 1572104952661, "rating": 5.0, "text": "They got me on my first bow kill", "pics": null, "resp": null, "gmap_id": "0x889a56b3fe5f7729:0xdb37012a8ed9e1f8"}
{"user_id": "107128158247081319102", "name": "DarlingDeAlisa", "time": 1618439404649, "rating": 5.0, "text": "I bought my first bow from here in 2019 . I've been coming back ever since... The staff is amazing! Very informative and willing to help.", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "103954098724311293083", "name": "Matthew Dom", "time": 1625783678924, "rating": 1.0, "text": "They were very rude. He acted like he was penalizing us for not buying our bow there.", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "106773379780679129112", "name": "George Yandric", "time": 1501816641719, "rating": 5.0, "text": "i walk in to this shop completely without a clue . Ronnie and Kieth are great people. i bought a bow from them more than a month ago. i find my myself  always looking for advice. i have reach out  to  Ronnie and Keith multiple times after i purchased my bow. i can tell you this; I have ALWAYS had my question answered. I love coming to this shop. i have learned so much about shooting a bow. i would not buy a bow from nowhere else.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPm40bksEenIdGo4HspMwglgulsmDu_Zlz8NgRA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "111929847488970475005", "name": "alice howland", "time": 1553717128890, "rating": 1.0, "text": "My husband upgraded his bow to an Elite Tempo about a year and a half ago. When he purchased the bow through a dealer in TN he had after market Flo green strings put on. Last summer he decided to switch back to the original Elite strings. He went into full draw to have them put them on and tune his bow. He has been here several times before purchasing a wide variety of archery goods. The man that put his new strings on did not put serving on the string that comes in contact with his string stop, ruining his strings. My husband put off going back in until hunting season was over not wanting to be with out his bow. He finally made it in and talked to the same guy that put his strings on. He acted like he had never met my husband before and denied doing any such thing claiming that it could not of been him because they are factory strings. My husband explained the situation again and he just brushed him off. He reluctantly put serving on my husbands damaged strings that should have been done the first time only to get home and realize he didn't even adjust back his vudu string stop so his sting was hitting outside of the stop. On top of that everything we have bought there has been overpriced but we justified it because we do prefer to shop local. If you want a fair priced honest place to go. THIS IS NOT THE PLACE. Just make the trip to Cullman.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNUBSBaoOH3cYdCaPJTDzPZDxPzvVhZKySd78cg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "105103311914989692830", "name": "Rocket City Rocks Boxing Club (RocketCityRocksBoxingClub)", "time": 1608397401376, "rating": 2.0, "text": "they know there stuff but not the most friendly people to deal with 1 of the guys is very nice but the taller bald headed guy is basically rude for seems like he is always having a bad day.", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "115296108446460665193", "name": "William Moore", "time": 1599149507767, "rating": 5.0, "text": "Really great all around bow shop", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "108219595180000446949", "name": "C G", "time": 1560862864518, "rating": 2.0, "text": "Staff was knowledgeable about questions asked for the most part, but if you're completely new do not go in expecting a novice friendly experience. Good if you can't wait 2 days for Amazon.", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "115043664282084828699", "name": "LiqwdE Teryx 4LE (LiqwdE)", "time": 1486165000064, "rating": 5.0, "text": "Great shop. The owners will never push you to buy something you don't need. They always make the best recommendation for each individual and it's never the highest priced item unless there is a specific reason as to why. A must check for your archery needs. They have an indoor range, weekly classes for adults and children.", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "107208837007624505558", "name": "Robert Pittman", "time": 1408719288712, "rating": 5.0, "text": "Kieth and Ronnie are real pro's.  They know their archery, they know their bow hunting.  Having watched guys trying to work a bow press at a few other big box stores, I'd never take my bow to anywhere else in Huntsville.  Prices are excellent, knowledge is outstanding, in store range, great place to shoot when it's raining.  Custom strings, bow tuning, you name it.  This is the place to go.", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "105375210971347672577", "name": "Wayne Mullins", "time": 1514416529029, "rating": 5.0, "text": "Will not find nobody better to work on your bow than Ronnie and Keith the best you will find", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "113007361396308497590", "name": "Brandon Harwell", "time": 1504893833106, "rating": 5.0, "text": "The guys in this shop are extremely knowledgeable and helpful. Wouldn't take my bow nowhere else", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "117731251522284626041", "name": "Chris tapp Tapp", "time": 1572551298222, "rating": 1.0, "text": "Bad place took stuff off of our bow and said they did not had pictures to prove it will never use them again take your business some were else sorry people thats for sure", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "114538858950423962864", "name": "Gregory Hanis", "time": 1516467442896, "rating": 5.0, "text": "Very helpful. They know bows!", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "110290845510252300220", "name": "juaken dumas", "time": 1483469751746, "rating": 5.0, "text": "Great folks extremely knowledgable and helpful", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "105475501484615624258", "name": "GARY Busby", "time": 1571862096440, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "115595337579279123028", "name": "Lee Gault", "time": 1505503115672, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88626b3ee92e2b2f:0xa140aaa25d52a4d3"}
{"user_id": "103434953636452611588", "name": "braxton guthrie", "time": 1611850643436, "rating": 5.0, "text": "The older gentleman I assume he was the owner or manager provided the best experience I've had at a gun store I've been coming here since 2015 when I bought my first AR. The prices are competitive and when trading in a gun or selling they offer the best prices around. Was offered 300$ in store credit on a handgun while 200 was the average I was offered (had a offer from tuckers in priceville for 100$, 200$ lower than Bama)  biggest thing for me is that I've never been disrespected or talked too in a negative or condescending way when I'm there I'm not a firearm expert but that doesn't mean I'm stupid or don't know anything.", "pics": null, "resp": {"time": 1616795878451, "text": "Thanks for your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "113203699890849866904", "name": "Hannah Foot", "time": 1619750083937, "rating": 5.0, "text": "Great place to do business, friendly people great prices definitely recommend", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "112366164988636451088", "name": "Trevyn Goode", "time": 1619636563041, "rating": 5.0, "text": "Nothing but smiles! Everyone was super helpful and very knowledgeable aswell as the competitive prices!!", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "107635322009993660273", "name": "Richard Booth", "time": 1606496697035, "rating": 5.0, "text": "The people running this shop are great. They are down to earth, fair, and easy to talk to. If you need tools, this is the place!", "pics": null, "resp": {"time": 1616795905307, "text": "Thanks for your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "101566101279422434669", "name": "James Stockfisch", "time": 1622499855823, "rating": 4.0, "text": "The gentleman behind the counter was great", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "110901165800194970734", "name": "Joe Pike", "time": 1616414184147, "rating": 1.0, "text": "Unfriendly.,and overpriced ,,,especially for used merchandise, shelves overstocked  maybe because of the price. .never shop there again", "pics": null, "resp": {"time": 1616795786723, "text": "We have been here over 29 years.  Our regular customers seem to like our prices."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "105313202993887161433", "name": "Trish Hill", "time": 1619675965963, "rating": 5.0, "text": "Friendly, knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "110644838318245002754", "name": "RereDaGod Sears", "time": 1593796493067, "rating": 5.0, "text": "Great customer service. They're great people and they're great to work with and talk to", "pics": null, "resp": {"time": 1616795922632, "text": "Thanks for your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "104181119110822683766", "name": "Daniel Hughes", "time": 1557354765934, "rating": 5.0, "text": "Great business! Bought a rifle online and the whole transaction was handled very professional and went very smooth. Great communication, Fast shipping. Dont hesitate to deal online! Oh and the item came so much better then described.  Thank you Bama Pawn & Gun!!!!!!", "pics": null, "resp": {"time": 1557494743749, "text": "Thank you!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "117559507132659863844", "name": "L3ML", "time": 1504905160209, "rating": 5.0, "text": "This shop is great! They always have tons of tools in stock. Every time I go in to sell some jewelry, they are very honest about what I have, and if I don't know what I have they are very good at figuring out what I have. They are just honest and up front about pawning, selling, and buying. I've never had a bad experience.", "pics": null, "resp": {"time": 1512226643585, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "102941486509567872405", "name": "Ed Colton", "time": 1528924909283, "rating": 4.0, "text": "I see some of the bad reviews but disagree for the most part. My son and I know guns, know prices, and know calibers and can make our own informed choices. We like being left to our own devices to peruse the inventory and ask to see a weapon if we have interest. The guys always are ready to help if we need them. What else can we ask. Plus we liked the fact they had their Boxer dog laying around.  She was a good old gal and will be missed.", "pics": null, "resp": {"time": 1528925675565, "text": "Thanks Ed, we sincerely appreciate your opinion!  Honest, straight forward, and like a boss!  Appreciate you coming in!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "100845273794176453292", "name": "Jake Livingston", "time": 1558887960611, "rating": 1.0, "text": "Rip off!!!! Was charged $120 for a USED tool bag and 5 USED hand tools. $60 for a used tool bag I later found out I could have got brand new from Home Depot for $59. Was charged and additional $60 for 5 USED NON-NAME Brand hand pliers for a total of $120.\nThis place is a joke a scam and a rip off, save your money go else where not only will you get better service you will get better quality and fair pricing.", "pics": null, "resp": {"time": 1559137170359, "text": "I am sorry you feel you were not treated fairly, but if you were unhappy with the price of the items that you knew were used you could have placed the items back on the shelf an not purchased them. This is a pawn shop so it should not be a surprise that most all the items for sale are used items. We check prices daily to make sure we are 30 to 50% below fair market value. Name brand items are priced accordingly."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "113167067818344906464", "name": "Tammy Balentine", "time": 1536521125889, "rating": 1.0, "text": "Absolutely the rudest pawn shop I've ever felt with! Private messages me when I gave them a Facebook review not about product but only to be rude and complain about their review! I messaged their business around 10am on sat they didn't respond till the next day being terrible towards me and my opinions,  the other businesses I messaged about my husband's new gun responded right away or at least by the end of the day.", "pics": null, "resp": {"time": 1536607319948, "text": "Rude customer, she did not appreciate us trying to honestly work through the situation of her review.  She left a review upon false information, there were never any questions that could have been answered about the \"product\" in the time frame she \"offered.\"  The sad part is she could have made a short, simple phone call to avoid her situation.  Rash and ill tempered she would only see it her way. Short sidedness, a lack of understanding, and poor communication on her part lead to this review.  Her opinion is the only one that matters to her, and we cannot please someone out looking for problems.   We fulfilled our end of what we advertised.  We are thankful for our customers, their respect of our business practices, and common sense!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "108841947463807311252", "name": "Cedric Banks", "time": 1513966776432, "rating": 1.0, "text": "Wanted to spend good money but no was interested in helping me, visited 3 times to give them a chance not to leave me with a bad impression but it was painfully clear I was not welcome, not trying to play the race card but I did not feel welcome and there was no indication of concern to help me.\nThanks for giving me the opportunity to shop else where.", "pics": null, "resp": {"time": 1513973480694, "text": "I'm sorry you feel this way Mr. Banks.  Did you ask for help?  I would like to address the situation with any employee that would refuse to help an interested customer, buying or not.  We pride ourselves in giving the best customer service we can.  If you'd like to come back in and ask for Grant, I will personally help you myself.  There are no race cards to be played up here as well Mr. Banks.  We do not interpret race that way.  Everyone is a customer, no matter the race, no matter the clothes, everyone matters.  We've been here over 25 years for a reason."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "105051630391577621489", "name": "Bob Gohn", "time": 1501790420241, "rating": 5.0, "text": "Fantastic place! You never know what you might find at Bama Pawn. The folks there are very friendly and helpful with all of your needs", "pics": null, "resp": {"time": 1512226678135, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "100831091305713100470", "name": "Trevor Bright", "time": 1456420194515, "rating": 1.0, "text": "I have been in the store multiple times and on every occasion I haven't had one employee greet me or ask of I needed help. I had great intentions of buying something but it seemed that they figured since I'm a young I'm not going to spend alot of money so there is no point in helping him...", "pics": null, "resp": {"time": 1456424731962, "text": "We're sorry for any experiences you've had where you were not greeted or helped in our store. We actually pride ourselves on our customer service and tell all of our employees to greet customers when they come and go. I'm not making an excuse but at times we do get busy either helping other customers or keeping up with all the paperwork that comes through the store so we may miss a customer here and there. But if you've been in multiple times we should have helped you. As far as judging you by your age or if you're going to spend a lot of money... we have a huge range of prices on tools, guns, and accessories. So whether you're going to spend money or not we aren't going to discriminate against you based off your age, race, gender, or even the size of your wallet. Again, we apologize that you had such bad experiences in our store but we appreciate you bringing it to our attention. Hopefully you'll come back and give us the chance to treat you differently."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "102504413277881159600", "name": "LG Knives", "time": 1475173561553, "rating": 5.0, "text": "Bama Pawn and gun is a great place to go...I use them as my FFL and they have ALWAYS been helpful, VERY attentive, even answering calls to check on arrivals of merchandise.  I will continue to do business with them as they are just good people...They are a busy store, but so worth the wait in their customer service.", "pics": null, "resp": {"time": 1528987381351, "text": "We appreciate you and your business!  Thanks so much for the great review!  Keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "100612018170298573871", "name": "Billy Schofield", "time": 1550676955380, "rating": 5.0, "text": "Been doing business here for years. Barry and Danny are always a pleasure to deal with and very knowledgeable on firearms.", "pics": null, "resp": {"time": 1550781081193, "text": "Thank you!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "107098713342470660073", "name": "Katlyn Crowden", "time": 1504894672696, "rating": 5.0, "text": "Great prices and even better customer service! Friendliest staff I've ever dealt with.", "pics": null, "resp": {"time": 1512226601562, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "104207337211029632934", "name": "Jonathan Dennison", "time": 1497731832091, "rating": 5.0, "text": "Had a gun malfunction(used) of the extractor damaged, called and let them know and they told me to bring it back and put the money i spent towards a newer model. Wonderful people, make you feel like family!", "pics": null, "resp": {"time": 1512404085663, "text": "Thanks so much for the positive review!  We really try!  Glad we could work things out for you for the better!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "118384626511936029186", "name": "Paul Hoffmann", "time": 1446217738768, "rating": 5.0, "text": "Always a good deal on guns. And always got a top quality firearm. Also will trade and buy other things.", "pics": null, "resp": {"time": 1559139682275, "text": "Thank you!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "106343354513327639374", "name": "Rita Brown", "time": 1566869194306, "rating": 5.0, "text": "Very honest dependable store.", "pics": null, "resp": {"time": 1568209302589, "text": "Thank you"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "103975442917092006003", "name": "Derrick Evans", "time": 1517431810390, "rating": 5.0, "text": "Best pawn shop in Decatur!  Fair prices, great folks!", "pics": null, "resp": {"time": 1517436547518, "text": "Appreciate the review and the business!  Thanks for stopping in!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "117069082740408574524", "name": "Sea Dragon", "time": 1512151104536, "rating": 4.0, "text": "Prices are a little high but selection is awesome!", "pics": null, "resp": {"time": 1512226493472, "text": "We appreciate the positive feedback, ask about our price matching next time you're in the market to buy a gun locally!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "103473980187356272218", "name": "Randy Tucker", "time": 1432157660245, "rating": 1.0, "text": "They try to get rich off every sale. No customer service. Rude. Goto Tucker Pawn priceville for a great deal. I saved 119.00 on one purchase and Tuckers are great people. No relation to me but great people.", "pics": null, "resp": {"time": 1432220189203, "text": "If this customer has been in our store, he or she has never addressed any issues with us or asked us to price match, I've never had any issues price matching Tuckers pricing, ever.  We typically compete with other stores in our radius just fine.  Academy Sport is right down the road as well.  We often get phone calls of them having to price match us.  Also, I find it odd the customer has the same last name whether they \"claim\" no relation or not and praise tuckers all in the same review.  Never the less, all of our other reviews speak for themselves.  It's a shame someone sink this low to jeopardize our ratings.  I hope this review speaks multitudes for the type of person this is.\n\nJust a comparison for all you googler's out there, check out our pricing vs their pricing on Davidson's Gallery of Guns, it just proves this was a low blow and we are cheaper."}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "104735340354091264902", "name": "Bear Man Mountaineering", "time": 1399301577479, "rating": 5.0, "text": "Excellent guys to do business with!  Great weapons at even greater prices!", "pics": null, "resp": {"time": 1528987224997, "text": "We appreciate your business and the great review!  Thanks so much and keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "115982696467980770318", "name": "SSGT Scott", "time": 1518878251134, "rating": 1.0, "text": "Open @830 on saturdays. Well 0836 and no one is here to open the store for me to get my property that has already been paid for.", "pics": null, "resp": {"time": 1518894547236, "text": "We are a mom and pop store, family emergency's can't be helped.  Nor were you in the parking lot at 8:40 AM when I arrived.  We went above and beyond to remedy your situation and we cannot help your attempt to pickup your merchandise at the last minute and late might I add. We did not have to do what we did.  Nor any of the help we've ever given to you and your family.  I do apologize for running late.  We do however appreciate the review and know where we stand after years of business based on one instance, and not all the other smooth transactions we have shared together.  I do not understand the rash decision to sacrifice a relationship over a temper tantrum, a personal mistake, and 10 minutes. - Grant C, Management"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "101164267795248489531", "name": "bella _ gacha", "time": 1549636181462, "rating": 5.0, "text": "Great staff knowledgeable and friendly!", "pics": null, "resp": {"time": 1549641040779, "text": "Thanks Sherry, we appreciate the review and your business!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111639040724580985194", "name": "smitty5006", "time": 1442672070089, "rating": 5.0, "text": "I don't come to Morgan County often but when I do I try to visit these guys!!! Friendly staff and a decent selection of reasonably priced firearms.", "pics": null, "resp": {"time": 1528987183733, "text": "We appreciate you coming in every chance you get and the awesome review!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111756221796426435762", "name": "Jon Madrigal", "time": 1457513583695, "rating": 5.0, "text": "Cheap guns and 300% APY, unbeatable.", "pics": null, "resp": {"time": 1528987236560, "text": "We appreciate your business and the great review!  Thanks so much and keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "105671904070116890657", "name": "Edward kajdas", "time": 1429882576260, "rating": 5.0, "text": "Great place with good prices and excellent loan prices!!", "pics": null, "resp": {"time": 1528987245333, "text": "We appreciate your business and the great review!  Thanks so much and keep on coming back!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "106554456628954992823", "name": "Jack Monroe", "time": 1524761093762, "rating": 5.0, "text": "Great, friendly, wholesome staff  with great guns :-)", "pics": null, "resp": {"time": 1559137234839, "text": "Thanks !"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "109051681297488137340", "name": "Matthew Hand", "time": 1568117604021, "rating": 5.0, "text": "This place is amazing", "pics": null, "resp": {"time": 1568209281766, "text": "Thank you !!!!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "111661253174019010946", "name": "G Crowden", "time": 1504894794375, "rating": 5.0, "text": "Great place and great people!", "pics": null, "resp": {"time": 1512226585647, "text": "Thank you for the positive feedback!  We do our best!  Come back and see us!"}, "gmap_id": "0x88628504badc15dd:0xa22754785e8025e8"}
{"user_id": "117986240903370929222", "name": "Joshua Findley", "time": 1623336977714, "rating": 5.0, "text": "As a guy who's worked in and around the archery world for years, I know quality when I see it, which isnt often these days. The folks at Pat's are a genuine stand-up bunch! Pat's has been my Mathews dealer for 4 years now and that's despite the hour plus drive and the Mathews dealer just down the road from me. Simply put, it's well worth my time and money to go see Paul at Pat's archery and it will be for you too. They're the best Mathews dealer in the Southeast!", "pics": null, "resp": {"time": 1623340982058, "text": "Thank you so much for the 5-star review! We appreciate your business!!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "116337320028205364661", "name": "Eric", "time": 1617972627191, "rating": 5.0, "text": "Can't believe all the bad reviews. I have never had a bad experience here. Staff is always helpful, polite, and attentive.", "pics": null, "resp": {"time": 1617984315083, "text": "Thanks for the 5-star review and we appreciate your business! There's a history behind the bad reviews - has to do with a photo taken in a parking lot next to our store many years ago.  Our sign just happens to be in the background. People seem to think we took it and randomly leave bad reviews when it makes the rounds :("}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "101113620447290126769", "name": "Drake Taylor", "time": 1624220507149, "rating": 5.0, "text": "Had my bow setup here and my dad had a string replaced and we both agreed this is the only place we will be coming back to", "pics": null, "resp": {"time": 1624289161668, "text": "Thank you for the great review and your business! We appreciate you and your dad trusting us with your archery needs."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "101731051972639030169", "name": "Leo Aguillon", "time": 1593282991015, "rating": 5.0, "text": "Pretty stand up people. I never affiliated the business with Nazis but just wanted to see where this was.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107895145164234432335", "name": "ronlong1971", "time": 1559958324292, "rating": 5.0, "text": "Went in a couple weeks ago to order my new Matthews Traverse and Paul was awesome at assisting me and helping me get everything I wanted. He also helped out my 11 year old son just like he was a grown up with a pocket full of money. And it really made him fill important. Went back a couple days later for my friend to order his same great service and Jake helped out with his and him and Paul our both awesome guys. Great place great prices and wonderful customer support. Can’t wait to get my bow.", "pics": null, "resp": {"time": 1560526040353, "text": "Thanks for the 5-star review and supporting local! We appreciate your business!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "108693574467653576975", "name": "Manuel Hernandez", "time": 1595535661867, "rating": 5.0, "text": "I’m sorry that picture happened to you. Looks like a great store", "pics": null, "resp": {"time": 1595604490839, "text": "Thank you!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "106463868694947477516", "name": "Jeff M", "time": 1593276945768, "rating": 5.0, "text": "Great job responding to the photo on fb. Wish y’all the best", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "104849508543743140876", "name": "Peace, Love & Rocks -Sean Lamore", "time": 1595185683859, "rating": 1.0, "text": "Great endorsement!  This is the master race, huh?", "pics": null, "resp": {"time": 1595258390217, "text": "Your review is probably regarding a photo circulating that we did not authorize. It was taken without our knowledge a few years ago by people not affiliated with our business in an adjacent parking lot. Our sign just happens to be visible in the background. This does not represent the values of our business and we do not condone this behavior."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107344990416639103645", "name": "VQ Maxima", "time": 1596436142717, "rating": 5.0, "text": "The photo has nothing to do with them great business!!!  (I’m Black)", "pics": null, "resp": {"time": 1596466205928, "text": "Thank you!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "109388756549449564808", "name": "Dez'monde Gartrell", "time": 1593356880430, "rating": 1.0, "text": "Can't support a business who embraces this kind of behavior in their parking lot...", "pics": null, "resp": {"time": 1595258412805, "text": "Your review is probably regarding a photo circulating that we did not authorize. It was taken without our knowledge a few years ago by people not affiliated with our business in an adjacent parking lot. Our sign just happens to be visible in the background. This does not represent the values of our business and we do not condone this behavior."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "112169463878733242519", "name": "Mike Cameron", "time": 1572212277899, "rating": 5.0, "text": "I need to take back my earlier review I was so disappointed that my new ravin messed up that I blamed the store and I have to say I was Wrong  they fixed my new ravin in a week and despite my bad review the bow tec treated me extremely well so I hope I can set the record straight I was WRONG  . I still believe the owner should have let me use a bow until mine was fixed but I kinda understand that to so anyone in need of a good outdoor store Pat's is the place to go  for five star service mike Cameron  west Alabama taxidermy  millport Alabama", "pics": null, "resp": {"time": 1571691351849, "text": "Thanks Mike! We appreciate your business and hope to see you again soon."}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "118215159479795358351", "name": "Phil Harper", "time": 1563054443246, "rating": 5.0, "text": "Awesome place  great selection very friendly knowledgable staff", "pics": null, "resp": {"time": 1563205610088, "text": "Thanks for the great review Phil. We appreciate your business and we appreciate you supporting local!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110842453110822336202", "name": "Phillip Boyd", "time": 1538071597339, "rating": 5.0, "text": "These folks know what their doing. I have got great service here.", "pics": null, "resp": {"time": 1538594612764, "text": "Thanks for the 5-star review!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107315879112856610738", "name": "Mark Levy", "time": 1540394935290, "rating": 5.0, "text": "Friendly, knowledgeable, staff. I was going on a crossbow hunt and I think his name is Paul asked me what I was hunting with. I told him the bow I had and the broadheads and he explained that the only broadheads that would fly truly like a field point were a different style due to the high velocity bow. I bought those broadheads and a target and sure enough he was right. He also sold me the cheaper arrow stop explaining that it was kind of unnecessary to buy the more costly one, his experienced not only saved me money, but also allowed me to perfectly drop a buck with a heart shot at 58yards with my crossbow (Ravin r20). Highly recommend and will continue to shop here for all of my archery/hunting needs.", "pics": null, "resp": {"time": 1540407510156, "text": "Thanks for the 5-star review! Congrats on the buck. Stop by and show us a picture when you can :)"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107332175990856889606", "name": "greg wise", "time": 1509204590471, "rating": 5.0, "text": "Pat' s staff is always great and eager to make sure you have  everything  you need to make your outdoor experience  the best.", "pics": null, "resp": {"time": 1509460406296, "text": "Thanks for the review Greg!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "100401659260849165254", "name": "Seth Fuller", "time": 1536366630388, "rating": 5.0, "text": "I jus saw this saw this place on instagram and a whole bunch of cuzin fookerz in front. 10/10 would see meme again", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "112774572440348349435", "name": "Greg Albritton", "time": 1464194186498, "rating": 5.0, "text": "Great Place to do business. Very knowledgeable staff. They make you feel like family.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "107302686339509165240", "name": "PJ sivley", "time": 1473646902008, "rating": 4.0, "text": "I recently brought in a used bow I bought and they did a great job of sighting the peephole and making sure the strings were good. They have better prices on archery items than the guns and ammo.", "pics": null, "resp": {"time": 1475528354531, "text": "Thanks for the review PJ!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "104473322013040426031", "name": "Teresa McCombs", "time": 1495309590817, "rating": 5.0, "text": "Staff will do all they can to educate you on any sport that they carry the equipment for.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "114002843782668229070", "name": "Peggy Willcutt", "time": 1536912098156, "rating": 5.0, "text": "Love pats all the sales staff are very knowledgeable and very helpful", "pics": null, "resp": {"time": 1537821944981, "text": "Thanks for the great review Peggy!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "114767381380895451443", "name": "Mason Anderson", "time": 1466004388270, "rating": 5.0, "text": "Great selection, and excellent staff. Very Reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "100405323888720957468", "name": "Gabriel Avarello", "time": 1596399978510, "rating": 5.0, "text": "Great products", "pics": null, "resp": {"time": 1596466211767, "text": "Thank you!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "113873892262788178825", "name": "lonzo", "time": 1542327236216, "rating": 5.0, "text": "Found this place off of a meme. A kkk rally was being held in front of it.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "115070748538884113191", "name": "Shad Kimbrell", "time": 1473709378496, "rating": 5.0, "text": "Excellent place to purchase sporting goods", "pics": null, "resp": {"time": 1475528302320, "text": "Thanks for the 5-star review!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "101145201246185021274", "name": "Joe Weldon", "time": 1600206163716, "rating": 5.0, "text": "Friendly place", "pics": null, "resp": {"time": 1600266897042, "text": "Thanks for the review!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "104684198646823068176", "name": "Jackie Clemet", "time": 1508440139413, "rating": 4.0, "text": "Great people", "pics": null, "resp": {"time": 1508443532631, "text": "Thanks for the review Jackie!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "115088149898129642257", "name": "Mitchell Davis", "time": 1508192117178, "rating": 5.0, "text": "Great store!", "pics": null, "resp": {"time": 1508258991871, "text": "Thanks for the 5-star review Mitchell!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "116817477628504672442", "name": "Corey Fox", "time": 1506367142509, "rating": 5.0, "text": "Awesome service as usual!!!", "pics": null, "resp": {"time": 1506375235014, "text": "Thanks for the great review Corey!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110399493391760898985", "name": "Hug Savage", "time": 1496207811123, "rating": 1.0, "text": "Overpriced trash", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110513761966952745065", "name": "Bobby Phillips", "time": 1482768552587, "rating": 4.0, "text": "Good selection", "pics": null, "resp": {"time": 1484238663025, "text": "Thanks for the review Bobby!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "115941335773886596550", "name": "Don Herr", "time": 1521928545664, "rating": 5.0, "text": "Great people very helpful", "pics": null, "resp": {"time": 1522097287639, "text": "Thanks for the 5-star review Don!"}, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "117327655528317203735", "name": "Bobby Russell", "time": 1496251106278, "rating": 4.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "106282218690321493986", "name": "Jason Latham", "time": 1470621517403, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x1a182d942be49b68"}
{"user_id": "110305205367071723825", "name": "Bradley Lowery", "time": 1622321679058, "rating": 5.0, "text": "Very kind and courteous staff. Great selection of weapons and ammunition. Will be purchasing the rest of my guns from them.", "pics": null, "resp": {"time": 1622413198959, "text": "Thanks Bradley! We appreciate great friends like you!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "107754323762699050407", "name": "NOT ME!!", "time": 1614231682312, "rating": 5.0, "text": "Made a couple purchases!.. customer service experts were greatly appreciated!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPOS5LQSrfBlf1rIYUQ7sqNyOQMCtWqqwHzvKBr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMB_12KCyu2Ww19ATDMXekonb5pZBDfm-jVycil=w150-h150-k-no-p"]}], "resp": {"time": 1614268663290, "text": "Thank you for the kind words and your business! Look forward to seeing you again soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111958675439389118365", "name": "Sumotacular", "time": 1621535772981, "rating": 5.0, "text": "Great service, enormous selection, friendly salesmen who know their stuff and are willing to answer whatever questions you might have. Friend and I stopped in and were so pleased I had to leave a review.", "pics": null, "resp": {"time": 1621607208574, "text": "Thank you for the great review! We appreciate you coming in to see us  and look forward to seeing you again soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111451346456501710154", "name": "jay mood", "time": 1610856864659, "rating": 5.0, "text": "Great staff and great prices.. They have everything you need for your firearm and very knowledgeable..I came from Birmingham to get my firearm and I don't regret the drive at all.. This is my new gun store from now on!!!!", "pics": null, "resp": {"time": 1610929612709, "text": "Thank you Jay and we appreciate you making the drive! Come see us soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "112973808823563598361", "name": "Alabama Wing Shooter", "time": 1619026481775, "rating": 5.0, "text": "Good people that know what they are doing!  Great service means a great deal!", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "100302257119065044896", "name": "Thomas Baker", "time": 1610840376772, "rating": 5.0, "text": "This store is awesome.  Today was my first time visiting and it was packed. I have never been in a store that was so busy and have everyone that was working so friendly,  calm, helpful. Definitely a good place to shop", "pics": null, "resp": {"time": 1610929783972, "text": "Thank you Thomas, we appreciate you coming to see us! Come again soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111089719538903788677", "name": "Timmy Hayton II", "time": 1614619752888, "rating": 5.0, "text": "Great gun store, big selection, and real nice helpful people two thumbs up.", "pics": null, "resp": {"time": 1617892888404, "text": "Thanks Timmy for the kind words. Come see us!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "104705236988336035242", "name": "Sean S", "time": 1600221115210, "rating": 5.0, "text": "These are a great bunch of guys to deal with. I did and online purchase and they were fast, friendly, and efficient. If I'm ever in this neck of the woods I would love to stop by and check out the shop in person. Would 100% recommend this company to a friend.", "pics": null, "resp": {"time": 1600275661680, "text": "Thanks Sean! Come by and see us when you get down here!!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "105303442064752684733", "name": "Sabrina Phillips-clark", "time": 1594094580247, "rating": 5.0, "text": "My Husband  and I love this place. Great customer service wonderful friendly staff\nGreat prices. Definitely recommend!", "pics": null, "resp": {"time": 1594220032897, "text": "Thank you so much for the kind words Sabrina!!  Come back and see us!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "117918428488390769084", "name": "Hope Craft", "time": 1595107602969, "rating": 5.0, "text": "We've bought ammo there several times and now firearms too. Every member of the staff was patient, knowledgeable, took their time with you to make sure they had answered all of your questions.  I especially appreciated the way they did not \"talk over me\" when my husband (who is extremely gun savvy) and I were looking for a gun for me.", "pics": null, "resp": {"time": 1595357714894, "text": "Thanks for your kind words and business Hope!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "107525106896242547991", "name": "Jerry Cavanaugh", "time": 1611602542874, "rating": 5.0, "text": "First Inpression  over the phone friendly and answer your questions without being  like most who say no and hang up on ya will continue to shop with them thanks.", "pics": null, "resp": {"time": 1613673841981, "text": "Thanks for kind comments Jerry! Please call or come by anytime, we look forward to seeing you soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "109433928469796000864", "name": "Dwight Duke", "time": 1596998808254, "rating": 5.0, "text": "Very nice and knowledgeable staff. Would not take my sons competition gun anywhere else even though it’s a good drive it is very worth ot", "pics": null, "resp": {"time": 1597161059969, "text": "Thanks Dwight! We appreciate the kind words and your business!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "102045069589233738417", "name": "Chad Jenkins", "time": 1588171609250, "rating": 5.0, "text": "This is the best place around for any of your guns or ammo needs they go outta there way to make you happy the people there are AMAZING I deal with Ingram for the most part but just cant say enough about how awsome all the guys are up there love these guys so much!!!!!!", "pics": null, "resp": {"time": 1588181853349, "text": "Thanks Chad! We appreciate the kind words. Great to have you as a friend of the store! Come see us!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "108188782585182449779", "name": "Tito Hawkins", "time": 1594429190363, "rating": 5.0, "text": "I was maybe the third customer when the door first opened and I still love it . Since the cocid_19 only shotgun sports ,midway pawn ,quintard jewelry, Oxford pawn kept the same price . Almost everybody else is price gouging.", "pics": null, "resp": {"time": 1594490196586, "text": "Thanks Tito!! We really appreciate you!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "103816160185410909081", "name": "Staci Strickland", "time": 1587664900568, "rating": 3.0, "text": "Been trying to get in contact with them .. I know with the virus it's been crazy took my husbands bow in over a month ago and haven't heard anything except when I call and they are short and now iit says the phone is disconnected .. anyone know how to reach them I'm in ga and dont know what to do if they haven't fixed the bkw they should have called if the have closed how will I get his biw back?", "pics": null, "resp": {"time": 1588084138731, "text": "Hey Staci, what name is the bow under and what kind of bow is it.? We lost power for a whole day last Thursday due to the storm that blew through here which is why the phones were out. I checked and we don't have a bow in the name of Strickland. Please call Arlie in a our bow shop so we can resolve your issue. Thanks. 256-235-2780."}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "117728221451318207023", "name": "Eric Sundby", "time": 1578595238679, "rating": 3.0, "text": "$48 for a box of 10 2 shot 3 inch steel shotgun shells. Pretty ridiculous... Had a decent selection of guns, however.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111433812922292746064", "name": "Shane Strickland", "time": 1566093791571, "rating": 5.0, "text": "Great place to buy compound or crossbows. Best price on mathews bows and mission crossbows. Knowledgeable bunch of guys working there.", "pics": null, "resp": {"time": 1568470628666, "text": "Thanks Shane! Come back and see us!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "103081324967291242108", "name": "Connie Smith", "time": 1576715896916, "rating": 5.0, "text": "Ladies, I went in to buy a Christmas present I felt so comfortable a great no pressure staff. The guys in there very professional they dont try to make you feel stupid for asking questions., they dont try to sell you something you dont need. The last cashier lady is so sweet. I highly recommend this place you wont be disappointe .", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "117380111334260621811", "name": "William Turner", "time": 1567839805096, "rating": 5.0, "text": "Kind hearted professional employees who offer good advice. Great local owned business.", "pics": null, "resp": {"time": 1568470579332, "text": "Thank you William. We appreciate you coming to see us. Come back soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "104974583252977191409", "name": "James Smith", "time": 1617842421785, "rating": 5.0, "text": "Love it", "pics": null, "resp": {"time": 1617892851497, "text": "Thank you James! Come see us soon!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "115353606150446366039", "name": "Nathan Chadwick", "time": 1496271719793, "rating": 5.0, "text": "Awesome selection of hunting, fishing, and sport shooting supplies and accessories. Great firearms selection with very friendly and not to pushy staff. Everything from special edition collectors firearms to pellet rifles. 1 side arms and accessories, other side fishing supplies. Great store with reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "112361856110392735111", "name": "Bobby Raulerson", "time": 1561750528016, "rating": 4.0, "text": "Very good in the archery dept. I've bought 3 new bows there", "pics": null, "resp": {"time": 1563061560673, "text": "Thanks Bobby!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "101140003536480747631", "name": "michael black", "time": 1561717541398, "rating": 4.0, "text": "Great place, large selection in varied disciplines and pursuits. I'm not local so don't get by often but a definite destination when they advertise big sales.", "pics": null, "resp": {"time": 1563061579594, "text": "Thanks Michael!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "104702021430685074651", "name": "papa wolfman (papawolfman)", "time": 1562198618211, "rating": 5.0, "text": "Great place to shop for all your hunting and fishing.", "pics": null, "resp": {"time": 1563061542824, "text": "Thanks Fred!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "116933771153896751857", "name": "Walter Bruce", "time": 1391453414736, "rating": 5.0, "text": "Very friendly folks here. It is easy in gun shops to get help and here they are extra nice. They are experienced shooters and some have sold equipment for more than 20 years. They try to give solid advice to prospective customers. I have noticed women shopping here are very comfortable in the shop. They have great prices on their firearms and accessories. This last year or so has had some difficult times for gun buyers with shortages. Hopefully that problem is starting to subside and maybe it will continue to do so if we don't have another scare. If you have not been here, give them a visit.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "100699417409515204315", "name": "Susan Hinton", "time": 1553486806464, "rating": 5.0, "text": "Very knowledgeable, nice and professional. I bought a Ruger, mace and a taser. Love them all.", "pics": null, "resp": {"time": 1568470691594, "text": "Thank you Susan! Come back and see us!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "109891885287598915473", "name": "Gary Maylon", "time": 1426371700431, "rating": 5.0, "text": "Hard to find but they are great to do business with. I was very surprised by the great inventory and great prices. This was my first visit but it surely won't be my last. These are really nice people to do business with.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "109059632344856232084", "name": "Ken Barry", "time": 1562852795574, "rating": 5.0, "text": "Best place around for your sporting goods needs. Huge selection of products.", "pics": null, "resp": {"time": 1563061527636, "text": "Thanks Ken!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "107884644966296328189", "name": "Joshua Holcomb", "time": 1507778037744, "rating": 1.0, "text": "I came  in to get new custom strings on my bow and said i need the exact same as the strings on it which were 2 color custom with a clear serving they could not match the colors the same as the old strings I was not informed they couldn't get the same colors I had prior to the new strings when I arrived to pick up my bow and it was not the same colors as specified 3/4 of the servings was clear but 1/4 of the end servings were black which didn't match the rest of the servings then did not offer to correct the issue or seem to care about what I requested to be done as a customer.\n\nThat is the bad part\n\nThe pro's about them was  I turned it into them middle of the week got it back the following week later the string is a\nDakota strings  pre stretched", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "100329447086749958210", "name": "Bama Rt", "time": 1568551629566, "rating": 1.0, "text": "I was going to buy a 357 Magnum this man told me I was $100 short to go get more money and come back", "pics": null, "resp": {"time": 1568470871002, "text": "Sorry we didn't meet your expectations. Please let us know what we need to work on and come see us and give us another chance to exceed your expectations."}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "117602866426604065291", "name": "FordTough Lady", "time": 1535747298819, "rating": 1.0, "text": "They didn't have what I was looking for and looked at me like I was crazy!!", "pics": null, "resp": {"time": 1562697879438, "text": "Thank you for your feedback. I'm sorry we didn't have what you needed in stock. We would be glad to try and order you anything we do not have.  We apologize for not meeting your expectations, please give us a 2nd chance to help you."}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "108495257719010677146", "name": "Tom Morgan", "time": 1492372473881, "rating": 3.0, "text": "Friendly knowledgeable help mostly but they want top dollar on almost everything & want come down a red cent.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "107884271341963569214", "name": "Jason Meeder", "time": 1490660738489, "rating": 4.0, "text": "Nice store, nice people, military discount was good. I offered a price for my shotgun, they took it no problem", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "113263117962982100900", "name": "Cas Kopczyk", "time": 1519769156374, "rating": 5.0, "text": "Great!! Very helpful, and they know their stuff. Its a man's toy land. LOL!", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111176334456146058114", "name": "Tal Goldsby", "time": 1399917526682, "rating": 5.0, "text": "Very nice, friendly and knowledgeable people. Have much more than most gun stores. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "116936780283817183593", "name": "Hagin Bird", "time": 1512611428603, "rating": 5.0, "text": "Great place and wonderful people to do business with will help you anyway they can", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "110485669638646831173", "name": "Bob McWhorter", "time": 1420783776939, "rating": 5.0, "text": "Have bought and traded with the on many occasions and have always been treated fairly. Great bunch of people have known some of them for many years.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111544190068689433869", "name": "Matt R.", "time": 1486538868422, "rating": 5.0, "text": "This is a one stop shop for everyone looking for that new gun, bow, and treestand. An anything else. From reloading bullets to that cover scent that walmart dont even know about. They have amazing staff to help you with anything they sale. The guys that help the owner be the respectable owner and operator he strongly holds today is one of the most friendly and knowledgeable group of guys ive ever met not to mention the owner is very nice and even ask if he can help you when he is own the sales floor. They have anything you can think of and lots more. To many items to list go look them up and see for yourself..", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "104092160803012667774", "name": "Jackson Stewart", "time": 1452871130500, "rating": 5.0, "text": "Excellent friendly service and pricing good enough to justify a drive from Birmingham.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111059545747703503002", "name": "Branden Cook", "time": 1469677348578, "rating": 5.0, "text": "Helpful staff. Great selection. Super friendly.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "100856193783597595121", "name": "ROBERT HART", "time": 1367470290423, "rating": 5.0, "text": "Allways helpfull Great prices. Best gun shop in the south.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "107508860208369596511", "name": "Randal Harlin", "time": 1509214240345, "rating": 5.0, "text": "Great experience, friendly folks and good prices. I'll be back and I'll tell my friends about them.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "110818945201576600013", "name": "Jim Phipps", "time": 1488218017538, "rating": 5.0, "text": "This place is great and supper helpful, not to mention the great selection of guns and ammo. This is the #1 place to shop around here.", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "103141798866756262448", "name": "Miguel Ycaza", "time": 1356219806776, "rating": 5.0, "text": "Best place to get all your hunting and fishing needs", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "105605119487100036538", "name": "Ben Perkins", "time": 1552171576744, "rating": 5.0, "text": "Very helpful staff", "pics": null, "resp": {"time": 1568470722930, "text": "Thanks Ben! Come see us!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "105555742755492684455", "name": "jasal mitchell", "time": 1565873551246, "rating": 5.0, "text": "Great place", "pics": null, "resp": {"time": 1568470657824, "text": "Thanks Jasal!! Look forward to seeing you again!"}, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "107630951895028044412", "name": "Michael Davidson", "time": 1471236599051, "rating": 5.0, "text": "Great guys here very friendly and easy transaction", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "101788759971229952072", "name": "Dave Henderson", "time": 1500581670512, "rating": 5.0, "text": "Excellent place to do business, very professional", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "116536318045944280191", "name": "Stacie Gardner", "time": 1488259048601, "rating": 4.0, "text": "A little pricey, but they know their stuff", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "115248708211153669631", "name": "Tim Butler (Instigator Fishing)", "time": 1505845276161, "rating": 3.0, "text": "Very good selection but WAY over priced!!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "102984453435206257798", "name": "Jessica Jenkins", "time": 1513414972253, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "112343254985018471511", "name": "Howard Johnson", "time": 1515120783426, "rating": 5.0, "text": "Love this place great  merchandise", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "103262689847637100198", "name": "Tyler Williams", "time": 1494851596180, "rating": 5.0, "text": "Most anything you can imagine", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "105833439201842488877", "name": "josh sharifi", "time": 1489797095245, "rating": 5.0, "text": "Great guns", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "100189599846077686170", "name": "Avery Barron", "time": 1485399587590, "rating": 5.0, "text": "Great place to shop", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "112302583024866412087", "name": "Allie Jackson", "time": 1499806639284, "rating": 3.0, "text": "Kinda OK", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "106313506204334847368", "name": "Matt Walz", "time": 1484056633440, "rating": 5.0, "text": "Lots of options someone always ready to help", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "111857025356324453819", "name": "Ron Evens", "time": 1408394586846, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "103067299724895245055", "name": "Mitch Smith", "time": 1408102254573, "rating": 5.0, "text": "Richard is a top store owner!!  He will make a deal!!  I am in the Military and have bought several weapons from this gun store!!", "pics": null, "resp": null, "gmap_id": "0x888bb35a2c97073f:0xdcae18f53a9d01a"}
{"user_id": "105887538793116018874", "name": "Robin Parks", "time": 1543423721904, "rating": 5.0, "text": "Great bows that deserve (and will get) more recognition as one of the top in the industry. Great people behind the scenes as well. Being able to customize the look and or specs is awesome.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOZb6zku8AVvSfI-y5esOOkVfbq3MhQttdO58jC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONYNDE93gjWlW3cZbosau11Ls88XCFlZhCO-Wm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "103440721032829732219", "name": "Sam Riley", "time": 1543437099751, "rating": 5.0, "text": "Kyle, and the team at New Breed Archery care about putting the archer into the perfect bow. They customize their bows to fit the archer. All of the staff at New Breed are also archers. They know the bows in-and-out. They shoot with local staff, they shoot with pro staff, and they shoot all over the country. They take feedback from shooters, they attend industry events personally, and they listen to us, the customers. When I met Kyle Null the first time, I could not believe how much he knew about bows. He grew up a hunter, an archer, and he is an engineer. As an engineer myself, I greatly appreciated his deep knowledge of the build and mechanics of each bow made. He not only knows the specs on New Breed bows, he also knows the specs of most other branded bows. If you get the time, please make a trip to Fultondale, AL and talk with Kyle Null, Colton Watkins, or any of the staff. You will know immediately you made the right decision to consider the best bow, the best manufacturer, and the best staff in the business. No hype. Just hunt! One bow at a time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMyFdxB1R0gjGhSOyO_AdnwDGEtP_xqcjbLFg4w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcGg3Mt6XWF4x2XMq0GKwEV47KSK_rPcJeEF4_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM5GlvE0EFXScgAVVoQOa1D-99iDYdGskU5dx0D=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO0BgKno7Xz8RBFePxH_oUfRa4Y7HEtg3BoPcO-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "114523491272282122543", "name": "James Henderson", "time": 1543415850648, "rating": 5.0, "text": "I compete and hunt with my New Breed RK1 powered by Striker limbs. It is a great bow at a great price. It’s the first hunting Recurve I’ve shot that consistently gets over 200fps. The grip is what sets it apart. Almost all trad bows have ergonomic grips that lend themselves to being torqued. The grip on the RK1 is torque free. Customer service is far better than one would expect.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOFlcCcaMln_M_BTjizvGdJrRGM6_YqPbn-jGUe=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "107135051045288097288", "name": "jv hughes", "time": 1543414783664, "rating": 5.0, "text": "I own several New Breed bows from hunting to target bows. All the bows shoot amazing! The one thing that is consistent between them is the grip it is the same on all the bows. The direct to consumer program is great you can create and customize your bow colors and strings to your liking and it will be shipped to your door. You will have one of the smoothest drawing bows with a rock solid back wall on the market. You will also become part of the New Breed Nation and we are a family helping each other grow and support archery. On that note I pretty much almost own the whole New Breed compound bow line up. I live in SE Idaho if you ever see me at a shoot and want to try one of my bows  let me know I will be happy to let anyone shoot my bows.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "104794480946205719133", "name": "Hayes Martin", "time": 1543431508907, "rating": 5.0, "text": "I’ve been shooting New Breed bows since 2012. In my opinion, these folks make the best bows on the market. I’ve shot all of the other big name bows and I’ll take my New Breed over any of them. The people that work for this company are some of the nicest people you’ll meet. I’ve visited the shop several times and it’s incredible to see the attention to detail when these bows are built. Rather than being mass produced on an assembly line, every bow is built by hand by one tech. I highly recommend these bows to anyone in the market for a new one!", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "100181174856163523656", "name": "Keith Early", "time": 1543419187086, "rating": 5.0, "text": "I am an long time bow hunter and do some 3D target shooting.  Several years ago I found New Breed and bought a Blade.  New Breed is the best bow I have ever shot.  The draw is very smooth with a solid back wall, and it is quiet and very quick.  You also won't find a better looking bow.\n\nEvery New Breed bow is custom built by hand one at a time.  They use the highest quality parts, like titanium screws and offer many custom patterns and strings.\n\nLastly, every person I have worked with at New Breed has been incredible and responsive.  I will only own New Breed bows from now on.  I highly recommend you check them out.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "107125438130468070081", "name": "Toby Fikes", "time": 1543452594861, "rating": 5.0, "text": "Been shooting New Breed for 5 years. Great bows!!  Shoot great and the easiest to tune that I have ever shot. Customer service is second to none!!  You won’t be disappointed in these bows and service.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "110994316280385337645", "name": "Matthew Noe", "time": 1543410406286, "rating": 5.0, "text": "The smoothest draw bow I have every shot. Kyle does a great job with the riser designs. I will be shooting a new breed for a long time!", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "104962315280629467270", "name": "Jake Pickens", "time": 1544627477697, "rating": 5.0, "text": "The best bow I've ever owned. Top quality materials used to manufacture the bow. And the absolute best customer service I've received anywhere.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "103063872751750584489", "name": "Mike Schuh", "time": 1543899946442, "rating": 5.0, "text": "Smooth as silk draw. Nicely built and a joy to shoot. The best Customer service ever. A real person answers the phone and will help you out.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "101610865300864281804", "name": "05_sprcrw", "time": 1543522706263, "rating": 5.0, "text": "I have been around this company from its start in 09 and in every single dealing with Kyle and the rest of New Breed I have always felt like part of the family. I have had 8 NBA bows over the years and each one has always preformed flawlessly.  I still have my original Genetix that will always be around hands down my favorite bow of all time. I have had a lot of tree time with that bow and if I need to make a shot I want it in my hands. The bows have always tuned very easy, and held their tune no problem. They are not finicky at all, its nice knowing that if you have it tuned and shooting good going into season you will be able to hunt the whole season without tweaking. I can't say enough good things about the company do yourself a favor and give them a try if you are thinking about a NBA bow you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "117270755960609886996", "name": "Walter Lee", "time": 1543432258085, "rating": 5.0, "text": "New Breed Archery produces the best bows on the market with incredible precision and customization! You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "117620465839349336474", "name": "Mike Nayock", "time": 1543455622102, "rating": 5.0, "text": "You won't find a higher quality Bow on the market. Superior customer service.Take the opportunity to shoot one. You'll never look back. #nohypejusthunt #newbreedarchery", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "114279940030610302392", "name": "jimmy chavers", "time": 1543428764776, "rating": 5.0, "text": "Awesome bows and even better people\nOn my sixth one now! Super smooth and custom bows at off the rack prices", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "114872309778066458223", "name": "Chris Ritchey", "time": 1543851030819, "rating": 5.0, "text": "I own 3 New Breed bows and they are by far the best I've ever shot. The whole staff at New Breed is top notch!", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "100994089331447344831", "name": "Wes Jones", "time": 1543421945267, "rating": 5.0, "text": "Great company with great people they stand behind every bow they build and treat you like family  best shooting bow on the market", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "106479016697690186978", "name": "deer slayer 1220", "time": 1543453943388, "rating": 5.0, "text": "Great company with the best customer service in the business.Quality bows American made that will perform whether your in a tree stand or the tournament line.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "103299565612791222045", "name": "The Whitetail Experience", "time": 1543410237087, "rating": 5.0, "text": "great company, top level bows and customer service", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOonVEVinXUwO2asv-aAHd1MmJpKUQ7DAzBhkBU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "113327212235378258591", "name": "cody stein", "time": 1543414671148, "rating": 5.0, "text": "Awesome company that will stand behind their products .And top notch bows", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "101195703052533833826", "name": "herman walker", "time": 1543445925936, "rating": 5.0, "text": "The best bow I have ever shot , and absolutely the best bow company to deal with no hassles.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "106164141656186991920", "name": "Gary Grimes", "time": 1562294947022, "rating": 5.0, "text": "Excellent selection and a great community resource", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "115958107299545781594", "name": "shannon shultz", "time": 1543415115636, "rating": 5.0, "text": "Ive been shooting NewBreed for bout 5 years now. They are great shooting bows and Kyle and the rest of the gang at NewBreed are just outstanding great people. If you want a great bow get you a NewBreed. #NewBreednation", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "114420906051549076042", "name": "T.J. Mitchell", "time": 1543858590247, "rating": 5.0, "text": "Great customer service!! Take a chance and try one out, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "107905427797261031142", "name": "John Whelan", "time": 1543461076896, "rating": 5.0, "text": "I am pretty new to New Breed but not to archery, or tuning & shooting, by any means. Been in this game for 35 years. The whole New Breed experience has been very satisfying. You get the bow you want, the look you want, in a very timely fashion, and they are built with pride and backed by customer service that is just awesome. The bows are absolutely some of the quietest, most dead in hand bows you willwfind on the  illshot, and can be set up however you like. With the most solid back wall available (flat sides of mods, 2 cable stops, and two limb stops simultaneously) for Max let off, or just cable stops or limb stops and minimal let off for target shooting or hunting if that's what you prefer. Best warranty(transferrable with sale of bow) in the industry. I was really looking forward to shimming and tuning my ETX35, but with 4 identically matched limbs, and mine having zero cam lean, I didn't get to do much of that. I had bullet holes ini6 shots after just eyeballing the rest. Amazing !!! As far as shooting, these bows just perform. I was looking for a bow I could combine with my tuning abilities to sell people the perfectly tuned bow that will perform how they want it to, and I am happy to say, I am very happy that I found New Breed Archery. It is just archers building archers the bows they want and backing their products !  Looking forward to ordering my next one very soon. Thanks New Breed!!!", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "108937678114412333000", "name": "Caleb Wilson", "time": 1515524957876, "rating": 5.0, "text": "Great bow I set it up and hit dead on every time.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "104262624168366467545", "name": "Sean Montgomery", "time": 1504309618331, "rating": 5.0, "text": "Top notch customer service,and they go out of their way to help with any problems", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
{"user_id": "100452472116329599147", "name": "Chris Mickiewicz", "time": 1508277138609, "rating": 1.0, "text": "Did not respond to me as a owner of a three year old bow that needed a string stop. Tried 5 different ways of customer service, even on Facebook (message, comment, and review).\nThey did nothing, not even reply. I first started trying in July, it's now October.", "pics": null, "resp": null, "gmap_id": "0x888904c74c0d731b:0x3565a9ae4cbe81c0"}
