{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1557958887587, "rating": 5.0, "text": "No one works harder than Joel Blackstock! Amazing employees too", "pics": null, "resp": null, "gmap_id": "0x88891bbe3e8eb807:0xf440b19ed8751bfe"}
{"user_id": "108733450443150391535", "name": "Tommy Lawrence", "time": 1529610939471, "rating": 4.0, "text": "Very nice office. Working on a university project with them and so far very professional.", "pics": null, "resp": null, "gmap_id": "0x88891bbe3e8eb807:0xf440b19ed8751bfe"}
{"user_id": "116262173000978198638", "name": "June Howard Barr", "time": 1492650306853, "rating": 5.0, "text": "Really cool place!", "pics": null, "resp": null, "gmap_id": "0x88891bbe3e8eb807:0xf440b19ed8751bfe"}
{"user_id": "107530900098836090571", "name": "captinair head", "time": 1574818644975, "rating": 5.0, "text": "Meeting Andrew was amazing. He's so talented and innovative. He's definitely designing my future home. Thank you from Andrew, Sandrann and Micah", "pics": null, "resp": null, "gmap_id": "0x889a4e2d41af384d:0x95eb4ce9dc2f0017"}
{"user_id": "101145405627728326190", "name": "Shanna Jennings", "time": 1620822866300, "rating": 5.0, "text": "I am very happy with the stock plan that we purchased and had amended. Initially it was going to be a few small changes, and it turned into a much larger project than anyone anticipated. Throughout all the changes, the team was responsive and quickly turned changes around for approval. They even worked with my builder to finalize a few details that he needed to show for permit purposes. I am hoping that we are building our forever home, but if not, I would not hesitate to use ERDD again. Money well spent.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "115610796077373046229", "name": "Holland Dixon", "time": 1619004878007, "rating": 5.0, "text": "They took our vision and produced a work of art allowing me to refine my future building project. Correcting things we didn't see or hadn't thought of and highlighted useful addition needed to be functional. Very professional, always responsive and overall a GREAT company to work with!", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105120994784252943306", "name": "Renée Dates", "time": 1618932877895, "rating": 1.0, "text": "Multiple phone calls and messages left for a job. All calls are screened and no one will follow-up with repeated requests for assistance. The poor reviews are absolutely correct - THEY DO NOT CALL OR FOLLOW-UP! BEWARE OF THIS COMPANY!", "pics": null, "resp": {"time": 1618934221293, "text": "You are a customer of our client Bama Sheds. We have been in contact with Bama Sheds.  If  they have not been in contact with you that is not something we can control."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "103880698808308487788", "name": "Kristie Potts", "time": 1599105422850, "rating": 1.0, "text": "Absolutely terrible. I paid a deposit for future home plans. I was very descriptive when speaking to Christy about my plans- One level barndo, specific interior layouts and sq ft. She explained to me that they certainly could design my plans. I paid a deposit, sent the EXACT exterior structure of what I wanted, along with additional interior layout and door. I heard nothing for several weeks, with many phone call attempt. I received a random email apologizing for the delay, that a family member had an illness. Weeks go by again with no returned calls. Finally, I requested they return my deposit and I would outsource a more reliable designer. I recently received another random email with some generic sketches that were nothing of mine. I responded and asked them if they were able to adequately provide services.- NO RESPONSE. I have since then called multiple times, left multiple messages in request to have my deposit refunded. As of today, I have reported them and contacted my bank. After reading reviews and doing further research( I should have prior to hiring them)I see the EXACT same scam happening over and over. What a waste of my time, money and energy!", "pics": null, "resp": {"time": 1602576522982, "text": "The project was delivered late but we did provide two options based on the client provided sketch and exterior she was looking for."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105766203325923846337", "name": "Brent Timmerman", "time": 1612743464910, "rating": 1.0, "text": "BEWARE! DO NOT DO BUSINESS WITH THESE PEOPLE!\n\nI will spare the specifics of my experience, However I will warn any prospective person interested to please read the reviews. They ( The bad reviews)are highly accurate !\nThese people will take your money, and disappear from communication.  With the exception of lying to you through messenger app.. And then when you are able to contact them from a different phone number that they are not screening,  they will blame you for their VERY UNETHICAL business dealings . With that being said, I have nothing to gain from this review,  however I am out 400.00 for services that I never received,  And based on reviews that I have now read. Christy ( The Owner ) will counter this review saying she refunded my payment, which she lied about on the phone with me , because I followed up with Discover ( My financial source ) and Square ( Her financial source  ) and both confirmed to me that no such transaction had taken place!  These people use every excuse in the book to get away with taking your hard earned money and giving you ABSOLUTELY NOTHING IN RETURN.\n\nSTAY AWAY!!!!\n\nLOOK BELOW TO OWNER'S RESPONSE\nITS ALL LIES TOO !!\nTRUST. ME", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105858571544200180137", "name": "Joe Wilson", "time": 1618968445218, "rating": 5.0, "text": "Very nice people who do excellent work at fair prices.\n\nI plan to use them again soon on another project.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116843509127231600011", "name": "Chris Gourley", "time": 1527360652830, "rating": 5.0, "text": "We are happy with our plans from ERDD. They did their best to help us to design our forever home and we are happy with the end results. They were willing to make many changes to the original design which shows they are willing to go the extra mile to make their customers happy. They came to our home initially to see where the house would be built and we had our finished plans within 2 1/2 weeks. They could have finished much quicker but my wife and I made a lot of changes so we went thru about 11 drafts to get to the finished project. The fact that they were willing to work with us to this extent means we would use them again if we ever need an architect again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkQ3GjaU-mEYsaZJkzzmhzC7RPd34rObYZd-TT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4fuc1vYck4ppxJwgTkr6_RH4SDclN6lYZXrgP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ3hqXCu98M0hpDACWafyJyIoVqKYbX-JXQ6lp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116462465451882637890", "name": "Jackie Wirth", "time": 1603419986300, "rating": 1.0, "text": "Not an actual client, but based off the repeated and disappointing testimonials of others... I would suggest avoiding this company.  The accusations, articles, and evidence provided are so concerning that these individuals should be investigated.", "pics": null, "resp": {"time": 1603420680268, "text": "The others that have make claims against us have either been refunded or they did receive their plans and still asked for refunds. There are two sides to every story. I will gladly share any evidence supporting our side of these claims as well if you would like. Our email is listed on this page and my cell phone is (256) 595-1574 If you like further information."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "113897147587663313137", "name": "Jessica Logan", "time": 1601305558847, "rating": 5.0, "text": "Amazing to work with! They took our general ideas and produced our dream home! Highly recommended!!", "pics": null, "resp": {"time": 1603403247240, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108893244794006776925", "name": "Tina Johnson", "time": 1603452142325, "rating": 5.0, "text": "Some people have growing pains and are not always right in the way they handle things. Yes Elaine Roberts Drafters and Designers May I made mistakes. But they delivered my plans to me and in a reasonable time. Not everyone is perfect. Some people only want to bash people with negative reviews.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107524635065726496476", "name": "Drue Poynter", "time": 1602510380640, "rating": 1.0, "text": "TERRIBLE TERRIBLE SERVICE! We have tried to get in contact several times after sending our deposit. It has been 4 weeks and they have not been able to give us anything. After posting a bad review on Facebook they told us we would have our plans by the end of the week and NOTHING! I would not recommend them to anyone! After reading more reviews this seems to be very a common thing for them!", "pics": null, "resp": {"time": 1602576507155, "text": "Sir you are not even a customer of ours."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108698223108757046173", "name": "Yvette Moss", "time": 1582268363900, "rating": 5.0, "text": "We love these guys! They were very helpful and wanted us to achieve the dream home we were after and never complained about how many times I called! =) I will use then again for other projects if we ever need this type of service!!", "pics": null, "resp": {"time": 1603403258966, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "113035287779586737864", "name": "Jennifer Parent", "time": 1586810129240, "rating": 5.0, "text": "Super helpful with the design and floor plan of my 1500sq foot barndominium style stick built home. Very patient with my multiple requests for desired changes. We are very grateful and would greatly recommend.", "pics": null, "resp": {"time": 1603403251987, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116938191468292914766", "name": "Kat Lange", "time": 1582038200154, "rating": 5.0, "text": "Our construction plans came in today and I am beyond excited to start working on building our home together! Elaine Roberts Drafters & Designers went above and beyond to make every single edit to our plans and help us design our perfect dream home. If you know anyone needing house plans this is hands down the best people to go to on all aspects, I cannot say enough about how blessed we are to have worked with them for our barndo design!! Thank y’all!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOUZ6QtW5q8qHmwEpmpyBFaH_nP-XwmAcNy1kxW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNI_RPmon2GolG1Egqgd6_TuAoSXGEmpIXj1y2M=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "106692338295826863736", "name": "Kieth Dunn", "time": 1582033489202, "rating": 1.0, "text": "Reading all these bad reviews reminds me of my experience, which has been going on for four months so far with no resolution. I have had all the same difficulties that the others have described and then some....way too may to list here. I cannot express strongly enough how disgusted I am with these people who proclaim christian doctrine in their emails and website. By the way, the good reviews are from the Parker family, which is another name that they go by.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108582921054818107002", "name": "Jaycie Phillips", "time": 1603399902986, "rating": 1.0, "text": "Awful customer service! They will not respond even after payment of house plans!", "pics": null, "resp": {"time": 1603403211775, "text": "I do not believe that you are an actual client, but friends with Derrick Loftis. Mr. Derrick Loftis has been issued a refund per his request, he also received plans/drawings in the past.\n\nThank you\nJimmy Parker"}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109296448497964462244", "name": "Luke Barker", "time": 1602577004200, "rating": 5.0, "text": "Highly recommend Elaine Roberts Drafters and Designers for all your design needs.", "pics": null, "resp": {"time": 1603403236626, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "115541182831429788307", "name": "Barbara Gray", "time": 1575589704428, "rating": 1.0, "text": "I would have to say this is the worst attempt of blueprints I have ever seen. Nothing was to scale, there was no detail information at all, and was not the design we had ask for. Measurements were not all noted. We have had a hard time trying to figure out what we need but thanks to Shaw Building Supply they had to basically redraw in order to estimate the material. These people are not draftsmen at all.  This was just a waste of $1500. I could have drawn this plan better than they attempted to.", "pics": null, "resp": {"time": 1575522527782, "text": "Ms. Gray, I am sorry you were not satisfied with the plans you received from us. You approved the design and layout prior to the completion of the plans. Per our contract you were allowed to make additional changes as you need/wanted. If you had made attempt to reach us over the discrepancy in the plans we would have address and worked with Shaws on any changes or information that was needed. We provide cad files to all building suppliers per there request on a regular basis. None of which was made by Shaws or yourself."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107368239673350922978", "name": "Kelsie Norris", "time": 1602623112965, "rating": 5.0, "text": "Elaine was a pleasure to work with on our recent home designs..", "pics": null, "resp": {"time": 1603403229733, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "100275128980831193854", "name": "Andrew Bales", "time": 1600380460022, "rating": 1.0, "text": "These guys are big no shows! Wasted three or four weeks of my time and did nothing. If you are looking for extra stress, headaches and to p-off your client, then call Elaine Roberts drafting.\n\nREGARDING ELAINE ROBERTS REPLY. That is right I gave you the project told you its urgency and instead of saying \"we are too busy to take on projects\" you said nothing until weeks had passed and my emails went unanswered. This outfit needs to grow up and learn some business ethics.", "pics": null, "resp": {"time": 1575295159871, "text": "Mr. Bales,\nIt is hard for us to be late on a project we were never hired for. We provided us informaton for a quote and timeline for your project. We sent several emails to you and your office for clarification on a few items, all with no response. It is not our fault that your lack of communication caused your client to be upset with you. Nor could would have completed work on your project without the proper go ahead from you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107978936229458934943", "name": "Creekside Designs", "time": 1527361203504, "rating": 4.0, "text": "We have been working with Jimmy off and on for six months now & he has been very quick and professional. I had to make several changes and Jimmy was prompt and delivered the correct drawings that we needed. I would highly recommend Elaine Roberts Drafters and Designers", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "106448052808753561964", "name": "David Vermeulen", "time": 1578017111810, "rating": 1.0, "text": "We paid a deposit and had a verbal contract to design drawings for permit ready construction plans on 2/3/2019\nI received zero updates from ERD&D, we reached out dozen of times per email & phone only to be given the run around. Actually spoke once with Elaine Roberts herself I believe and still no follow up or follow through. As of today 12/11/2019 we are still waiting on a response or communication of any kind. I called and left a message today, lets see if we get any response\n--------------------------------------------------------------------------------------------------------------------\n\nResponse from the owner 3 weeks ago\nMr. Vermeulen.\nI am sorry that you feel like you slipped though the crack somewhere. We made numerous attempts to contact you thought out the year with no response from you. I will gladly refund your deposit if you would like. Response from the owner 3 weeks ago\n----------------------------------------------------------------------------------------------------------------\n\nAfter leaving a review, an email and voicemail with my contact info on 12/11/19 and requesting a refund, I am still waiting for Elaine Roberts to get back to us.\n2nd request 1/2/20 - Elaine please refund our deposit.", "pics": null, "resp": {"time": 1576074908630, "text": "Mr. Vermeulen.\nI am sorry that you feel like you slipped though the crack somewhere. We made numerous attempts to contact you thought out the year with no response from you. I will gladly refund your deposit if you would like. I will be in touch with you this morning to work out the solution that works best for you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "101763881385564984591", "name": "Christy Leigh", "time": 1554842626084, "rating": 5.0, "text": "They are amazing! Loved the whole process and they made it so easy and wonderful. Very accommodating to all our changes.", "pics": null, "resp": {"time": 1555383687030, "text": "Thank you for the kind words. We enjoyed working with you on your home."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109859671819636961055", "name": "Paul Hines", "time": 1603203267985, "rating": 5.0, "text": "Great people to work with.", "pics": null, "resp": {"time": 1603403223036, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108615516573729085777", "name": "Jimmy Parker", "time": 1530038351334, "rating": 5.0, "text": "Great small little design firm. Husband and wife team that works hard on each project. They are not perfect and have flaws but the work and designs they produce are top notch.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "111713600234971474209", "name": "Mark Hamm", "time": 1521645892343, "rating": 4.0, "text": "Great work at a reasonable price.  Having some delays in the delivery of the plans is the only reason for not getting a 5.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109043575819100981984", "name": "Nona Muss", "time": 1539501642562, "rating": 1.0, "text": "So last year I found a business on a local small business group Facebook page - Elaine Roberts Drafters and Designers. I paid them a deposit of $250. As of today, the work has not been delivered. It was promised 10 days after payment. As of today, they are 100 days past due. I posted an honest review on their Facebook page, starting off by saying I hoped I could change it to a positive review in the near future. They changed their Facebook template to not allow reviews so mine could no longer be seen. They always say they are working on my plan and they will have something in a few days. Then I don't hear from them and nothing is ever delivered. Their Facebook page has photos they post- and therefore imply that the work depicted is their own. Through reverse photo look up I found photos they had \"lifted\" from other sites and I contacted the owners. Indeed they did not have permission to use the photos and it was not their work. When I tagged the owners in the misused photos they were promptly deleted from the Elaine Roberts drafters Facebook page. One of the owners of the business from which they had plagiarized the photos of others' work, did know Jimmy Parker - one of the owners of Elaine Roberts Drafters. He told me specifics of how the owner (Jimmy) of Elaine Roberts Drafters worked for him previously and had stolen from him, and described him as one of the biggest con-men he has encountered. Perhaps occasionally they deliver a product enough to keep up an image, I don't know, but after my own experience and what I heard from Jimmy Parker's previous employer, I sure wouldn't trust him with my money again!\n\nAlso look at their other reviews. Jimmy and Christy Parker are the husband/wife team that “own/operate’ this business they call Elaine Roberts Drafting and Design. (These are their respective middle names.)  Previously they operated under the name “Creekside Designs.” I guess they had to give up on that name after they accumulated so many bad reviews. You can google it. Anyway, three of the other reviews for this business are from the owners themselves (Christy Parker, Jimmy Parker, and their old business named Creekside Designs. A fourth is from a family member - Sheila Parker. So half of the reviews contributing to their “4.1” rating are ones THEY CREATED RATING THEMSELVES! They did the same thing on Yelp until I reported them and Yelp notified me they had removed those reviews because they violated their terms.", "pics": null, "resp": {"time": 1520985386952, "text": "Mrs. Hall,\nI am terribly sorry for the poor customer service that we provided.  We are not scammers, crooks, or anything of that nature.  We simply took on to much work at one time. It is not an excuse but we are still learning how to deal with our blessing of growing pains.  We are human and make mistakes.   I am terribly sorry that your project fell through the cracks.  In regards to your refund we asked for a mailing address to process you refund and I have not yet received it.\n\nAgain we are sincerely sorry for the poor customer service and wish you all the best in the future.\nRespectfully,\nChristy Parker"}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "117275097344007566653", "name": "Christy Parker", "time": 1576361452991, "rating": 5.0, "text": "The team at Elaine Roberts is very professional and there work is top notch", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109807214557221354197", "name": "Miguel", "time": 1565150324827, "rating": 5.0, "text": "Beautiful street art and great place to walk around!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPkluvfpILqNJCwffosSZ4cE_hn6p7inJG5GkvM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhHVuXPyXalOxqj9FrP6uJVU1bx1YVWkN9U7Gh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bbe6f3c7c5b:0xcd92c1c6efbbd2e2"}
{"user_id": "105836986957101286635", "name": "Dave Branch", "time": 1567548129142, "rating": 5.0, "text": "Fifth Dimension is a full service architectural firm that can work with any client's needs.  It is a great place to not only practice architecture and work.", "pics": null, "resp": null, "gmap_id": "0x88891bbe6f3c7c5b:0xcd92c1c6efbbd2e2"}
{"user_id": "103053952912139674931", "name": "Cedric Davis", "time": 1576262665321, "rating": 5.0, "text": "Great Builder and friendly staff very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x88890f119223b475:0xa2d8bb040cfa0c00"}
{"user_id": "110992469093130526289", "name": "BA Grant", "time": 1414637412280, "rating": 4.0, "text": "Excellent pricing for the type of architectural services receiving.  GREAT color renderings and clear and concise plans. I received 5 sets of construction plans with a 3d rendering of the front of my new home.  They also do additions and bath and kitchen designs.", "pics": null, "resp": null, "gmap_id": "0x88890f119223b475:0xa2d8bb040cfa0c00"}
{"user_id": "110576081629011195073", "name": "ALAN STEPHENS FALLETTA", "time": 1611358537264, "rating": 5.0, "text": "The andor Equal to the Best Architectural Firms in the Universe!", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "105041599367663082940", "name": "Ashley Wiley", "time": 1523470172885, "rating": 5.0, "text": "toured the firm on a field trip. the office is beautiful and the firm has done some amazing projects.", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "115247920295980873895", "name": "Adam Cornelius", "time": 1566418248917, "rating": 5.0, "text": "Great engineering and architecture firm", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "107254403120027757775", "name": "T. O.", "time": 1548335011434, "rating": 5.0, "text": "great place to work", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
