{"user_id": "102998447125264630775", "name": "Celese Sanders", "time": 1627914366077, "rating": 5.0, "text": "Christine was absolutely wonderful! She took the time to really understand my pain and what would help. She is very skilled and when I left I felt like I could already tell a huge difference and the next day I felt the best I had felt in such a long time! I am so grateful I found them!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "111054961697552585248", "name": "Richard B", "time": 1620079500159, "rating": 5.0, "text": "Sarah gave a great massage! It was a good balance of full-body massage, relaxation, and addressed the trouble spots and knots. Table was very comfortable and heated. Sarah did not talk much, which I appreciated. Nice location and facility.", "pics": null, "resp": {"time": 1620082329976, "text": "So glad you enjoyed your experience at Healing Haven. Thank you for the awesome review...we look forward to seeing you again soon;-)"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "108076498528514302780", "name": "Hailee Walls", "time": 1613659980583, "rating": 5.0, "text": "Renae is an amazing massage therapist! As a massage therapist myself, it is challenging sometimes to find someone whose work you love. But Renae's myofascial work feels great, and she is very intuitive and can truly feel what is going on in the body with her hands - she's like magic! I'll definitely be back.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115764236888935858383", "name": "Lisa Smith", "time": 1611158866209, "rating": 5.0, "text": "Visits to Healing Haven are a relaxing and serene experience. Christine is very knowledgeable in how massage therapy can help her clients and incorporates the modalities you need at each visit. The setting is peaceful and calming, it is a place to treat yourself and help keep your body in its healthiest state!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109779573864315218151", "name": "Larry Larry", "time": 1598922195791, "rating": 5.0, "text": "This is definitely a 10/10 location. I can’t say enough about the pleasant and relaxing atmosphere as you walk-in. In the mist of COVID I recognize immediately  the care and precautions.  Mrs.Grass was awesome. Has my highest recommendations.", "pics": null, "resp": {"time": 1599156377752, "text": "Thank you Larry for your 5 star recommendation! We appreciate you and your business and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "105678908262803661626", "name": "Nancy Wesson", "time": 1589566232343, "rating": 5.0, "text": "I got a great massage here yesterday. The place I regularly go to was closed. After reading the reviews I made an appointment at Healing Heaven. I am glad I did. I would highly recommend this place.", "pics": null, "resp": {"time": 1589645779618, "text": "Thanks so much for the 5 star review! We are glad you were pleased with your service. We hope to see you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "112003168625957004548", "name": "Nick P", "time": 1566008928307, "rating": 5.0, "text": "Great deep tissue massage.  Renae was excellent.  The facility was very clean and welcoming.  The table was solid and one of the better places I have been for a massage.  I felt very comfortable and will definitely be going back in the near future.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "110344143644723717373", "name": "Raven Babineaux", "time": 1538326164654, "rating": 5.0, "text": "Best massage I've ever had, she actually used pressure that was needed as well as massaged all muscles. She worked on the knots in my back (much needed),  explained the process and discussed my intake form with me with all medical information. Oh and she actually explained the issues she discovered with me which has never occurred anywhere else I've been. Love this place they are very professional and informative.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "113934976316795121322", "name": "Adrienne Walker", "time": 1545949383146, "rating": 5.0, "text": "10/10 would recommend. Christine was just a great person and really made me feel comfortable. She was solely interested in making you and your body feel ten times better than when you walk in. Thanks!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109360915112446349896", "name": "Ken Crowson", "time": 1573182390547, "rating": 5.0, "text": "Kinda Leary at first but once I got there very comfortable and it was great can’t wait till next session very professional and knowledgeable about the body would highly recommend Christine she was great", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115301917910821813596", "name": "R", "time": 1492120366746, "rating": 5.0, "text": "I have gone to Christine about a half a dozen times now. She has helped me immensely. I have been to other massage therapist, to include some of the massage mills who shall remain nameless, and found Christine is very well versed in her profession. Every time I go there I learn something new. She has helped me with an alignment issue I was having by showing me a number of stretches to correct it. Christine also utilizes essential oils in her therapy and has the ability to find and release all the muscular tension build-up in my body. I sleep like a baby after one of her massage session. And above all, Christine is a lovely and caring person who believes in helping others!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103289347542548801669", "name": "Colby Robinson", "time": 1471537436289, "rating": 5.0, "text": "I visited Christine at Healing Haven recently for my first ever massage and I had a fantastic experience. When I stepped into her office it was like I left all my stress at the door. She was excellent at making me feel comfortable and relaxed. Not only was the massage a great experience, but she used essential oils to make it even better. If you are looking to have body work done, I definitely recommend visiting Christine.", "pics": null, "resp": {"time": 1471543158993, "text": "We're so glad you had such a positive experience with us and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "118291058520299251842", "name": "Brandon Patterson", "time": 1523829114885, "rating": 5.0, "text": "Excellent service! I don't know where to start with how much their service made my weekend. Absolutely impressed with the quality and I can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115282147452439720974", "name": "Randy Lee", "time": 1529675482918, "rating": 5.0, "text": "Christine is very knowledgeable and highly skilled. Definitely one if the best massage experiences I have had. I highly recommend Healing Haven and Christine.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "107033886936537465600", "name": "Rachelle Griffin", "time": 1559253987719, "rating": 5.0, "text": "Our boss hired this place to come and give us 15 minute chair massages and it was great the lady doing the massages was really nice down to earth and generally cared about making you feel better I will be visiting the business for sure", "pics": null, "resp": {"time": 1559910878644, "text": "Hi Rachelle, thank you for the great review. It was our pleasure to come out to your place of work for your employee appreciation week to help make you feel better. We hope to be back again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "101422140446244793483", "name": "Dianne Judson", "time": 1506633767795, "rating": 5.0, "text": "Amazing and serene experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMTBY_YVd8ulC2lNlB9hTO6CMvtOsi03sAolRKT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103850886278909181626", "name": "Laura Hardin", "time": 1502237622814, "rating": 5.0, "text": "Christine has been my massage therapist for three years now. Every single session has been excellent. She continues to provide fabulous service.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "102210444935224297537", "name": "Cameron Claire Starnes", "time": 1471450675033, "rating": 5.0, "text": "Christine is amazing!!  I was having a lot of pain and she helped me greatly!  I highly recommend her services.", "pics": null, "resp": {"time": 1471453295258, "text": "We appreciate your positive review Cameron and we're glad our services delivered what you needed. Cya later!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
