{"user_id": "102998447125264630775", "name": "Celese Sanders", "time": 1627914366077, "rating": 5.0, "text": "Christine was absolutely wonderful! She took the time to really understand my pain and what would help. She is very skilled and when I left I felt like I could already tell a huge difference and the next day I felt the best I had felt in such a long time! I am so grateful I found them!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "111054961697552585248", "name": "Richard B", "time": 1620079500159, "rating": 5.0, "text": "Sarah gave a great massage! It was a good balance of full-body massage, relaxation, and addressed the trouble spots and knots. Table was very comfortable and heated. Sarah did not talk much, which I appreciated. Nice location and facility.", "pics": null, "resp": {"time": 1620082329976, "text": "So glad you enjoyed your experience at Healing Haven. Thank you for the awesome review...we look forward to seeing you again soon;-)"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "108076498528514302780", "name": "Hailee Walls", "time": 1613659980583, "rating": 5.0, "text": "Renae is an amazing massage therapist! As a massage therapist myself, it is challenging sometimes to find someone whose work you love. But Renae's myofascial work feels great, and she is very intuitive and can truly feel what is going on in the body with her hands - she's like magic! I'll definitely be back.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115764236888935858383", "name": "Lisa Smith", "time": 1611158866209, "rating": 5.0, "text": "Visits to Healing Haven are a relaxing and serene experience. Christine is very knowledgeable in how massage therapy can help her clients and incorporates the modalities you need at each visit. The setting is peaceful and calming, it is a place to treat yourself and help keep your body in its healthiest state!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109779573864315218151", "name": "Larry Larry", "time": 1598922195791, "rating": 5.0, "text": "This is definitely a 10/10 location. I can’t say enough about the pleasant and relaxing atmosphere as you walk-in. In the mist of COVID I recognize immediately  the care and precautions.  Mrs.Grass was awesome. Has my highest recommendations.", "pics": null, "resp": {"time": 1599156377752, "text": "Thank you Larry for your 5 star recommendation! We appreciate you and your business and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "105678908262803661626", "name": "Nancy Wesson", "time": 1589566232343, "rating": 5.0, "text": "I got a great massage here yesterday. The place I regularly go to was closed. After reading the reviews I made an appointment at Healing Heaven. I am glad I did. I would highly recommend this place.", "pics": null, "resp": {"time": 1589645779618, "text": "Thanks so much for the 5 star review! We are glad you were pleased with your service. We hope to see you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "112003168625957004548", "name": "Nick P", "time": 1566008928307, "rating": 5.0, "text": "Great deep tissue massage.  Renae was excellent.  The facility was very clean and welcoming.  The table was solid and one of the better places I have been for a massage.  I felt very comfortable and will definitely be going back in the near future.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "110344143644723717373", "name": "Raven Babineaux", "time": 1538326164654, "rating": 5.0, "text": "Best massage I've ever had, she actually used pressure that was needed as well as massaged all muscles. She worked on the knots in my back (much needed),  explained the process and discussed my intake form with me with all medical information. Oh and she actually explained the issues she discovered with me which has never occurred anywhere else I've been. Love this place they are very professional and informative.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "113934976316795121322", "name": "Adrienne Walker", "time": 1545949383146, "rating": 5.0, "text": "10/10 would recommend. Christine was just a great person and really made me feel comfortable. She was solely interested in making you and your body feel ten times better than when you walk in. Thanks!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109360915112446349896", "name": "Ken Crowson", "time": 1573182390547, "rating": 5.0, "text": "Kinda Leary at first but once I got there very comfortable and it was great can’t wait till next session very professional and knowledgeable about the body would highly recommend Christine she was great", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115301917910821813596", "name": "R", "time": 1492120366746, "rating": 5.0, "text": "I have gone to Christine about a half a dozen times now. She has helped me immensely. I have been to other massage therapist, to include some of the massage mills who shall remain nameless, and found Christine is very well versed in her profession. Every time I go there I learn something new. She has helped me with an alignment issue I was having by showing me a number of stretches to correct it. Christine also utilizes essential oils in her therapy and has the ability to find and release all the muscular tension build-up in my body. I sleep like a baby after one of her massage session. And above all, Christine is a lovely and caring person who believes in helping others!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103289347542548801669", "name": "Colby Robinson", "time": 1471537436289, "rating": 5.0, "text": "I visited Christine at Healing Haven recently for my first ever massage and I had a fantastic experience. When I stepped into her office it was like I left all my stress at the door. She was excellent at making me feel comfortable and relaxed. Not only was the massage a great experience, but she used essential oils to make it even better. If you are looking to have body work done, I definitely recommend visiting Christine.", "pics": null, "resp": {"time": 1471543158993, "text": "We're so glad you had such a positive experience with us and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "118291058520299251842", "name": "Brandon Patterson", "time": 1523829114885, "rating": 5.0, "text": "Excellent service! I don't know where to start with how much their service made my weekend. Absolutely impressed with the quality and I can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115282147452439720974", "name": "Randy Lee", "time": 1529675482918, "rating": 5.0, "text": "Christine is very knowledgeable and highly skilled. Definitely one if the best massage experiences I have had. I highly recommend Healing Haven and Christine.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "107033886936537465600", "name": "Rachelle Griffin", "time": 1559253987719, "rating": 5.0, "text": "Our boss hired this place to come and give us 15 minute chair massages and it was great the lady doing the massages was really nice down to earth and generally cared about making you feel better I will be visiting the business for sure", "pics": null, "resp": {"time": 1559910878644, "text": "Hi Rachelle, thank you for the great review. It was our pleasure to come out to your place of work for your employee appreciation week to help make you feel better. We hope to be back again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "101422140446244793483", "name": "Dianne Judson", "time": 1506633767795, "rating": 5.0, "text": "Amazing and serene experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMTBY_YVd8ulC2lNlB9hTO6CMvtOsi03sAolRKT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103850886278909181626", "name": "Laura Hardin", "time": 1502237622814, "rating": 5.0, "text": "Christine has been my massage therapist for three years now. Every single session has been excellent. She continues to provide fabulous service.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "102210444935224297537", "name": "Cameron Claire Starnes", "time": 1471450675033, "rating": 5.0, "text": "Christine is amazing!!  I was having a lot of pain and she helped me greatly!  I highly recommend her services.", "pics": null, "resp": {"time": 1471453295258, "text": "We appreciate your positive review Cameron and we're glad our services delivered what you needed. Cya later!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "112029187253593613773", "name": "Chelle Ham", "time": 1534860140692, "rating": 5.0, "text": "Had a wonderful first session of beginners yoga yesterday! Nichole is so kind and a great teacher. The interior of the studio is very calming and the session itself was simple enough to follow along with for a beginner with some challenges to encourage learning. My husband went along with me and loved the session too! So happy to have found this studio in Dothan. I will be back!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMU9j3ZPCH5A8VpKxaVu-GHssxf_Y8H3AIdc1_=w150-h150-k-no-p"]}], "resp": {"time": 1535591165820, "text": "Thank you soooo much!!!  I'm so happy you enjoyed your experience :)  Looking forward to seeing you soon at the studio!!!! ~ Virginia"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "108614303858373234445", "name": "Susan Avello", "time": 1585764716916, "rating": 5.0, "text": "As a Personal Chef in Dothan AL specializing in Healthy food and Nutrition, my first yoga experience when I returned from Chicago was Nature Gallery and what a wonderful journey it has been.\n\nGretchen and her team is extremely knowledgeable, acceptable, kind and loving and help you no matter what level of expertise. They believe in giving back to the community and it shows! Their studio is warm and inviting and every class leaves you feeling uplifted and calm - ready to take on anything!\n\nFrom fabulous massages by Jason to the numerous classes offered at Nature Gallery you will find a loving and accepting staff and classmates as you surround yourself in the beauty of art in this lovely atmosphere of warmth.\n\nNamaste", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "100067112355553889189", "name": "Christy Carter", "time": 1572035966695, "rating": 5.0, "text": "I have been doing vibration therapy on a regular basis for 3 months now and the cumulative effects are really noticeable.  A therapy session is relaxing and meditative.  Jason helps you find the perfect position for your session for comfort.  My sleep has improved, my overall mood, my outlook, pain in joints completely gone after a session.  If I am going through something tough I always book a session and it helps me through it.  I would recommend strongly you  try it for yourself.", "pics": null, "resp": {"time": 1572464116117, "text": "Thank you so much, Christy!!!"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "115848584416393377733", "name": "Stephanie Paulding", "time": 1582000258733, "rating": 5.0, "text": "What a wonderful place to practice yoga! Beautiful atmosphere; great teachers! The Sound Bath is amazing also.", "pics": null, "resp": {"time": 1582152001568, "text": "Thank you so much, Stephanie!!!"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "117017705692233593351", "name": "diane braun", "time": 1527864103308, "rating": 5.0, "text": "I've consistently taken Yoga classes at The Nature Gallery for going on 2 years now.  I even participated in their first Peaceful Warrior Teaching Training Series, which was an incredible and life-changing experience that I recommend to everyone!  They offer a variety of classes for different yoga styles, and various class times to meet most anyone's schedule.  The teachers, and all the staff for that matter, are awesome!  I can't say enough good things about The Nature Gallery!", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "103418519822565522087", "name": "Nature Gallery", "time": 1523340574935, "rating": 5.0, "text": "Austin Prince ~\nI'm truly sorry your experience wasn't up to your standards.  We are all human... we have good & not so good days.  I'm very sorry that one crummy experience rushed you to jump on your electronic device & write a not so nice review.  Your credit card was fully refunded and we offered nothing but sincere apologies.  You were overly nice on the phone with us, which was odd after reading your yucky review.  Your wife was very sweet, we enjoyed meeting her :)  Maybe you should give our YOGA classes a chance... I assure you, your money won't be wasted there ~ $10 per class with an awesome team of Instructors.  Congratulations on your new little bundle of Joy!!!  ~ Namaste ~", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "106677510161552009507", "name": "Hope Richardson", "time": 1528942334897, "rating": 5.0, "text": "The atmosphere is serene.. I had a massage by Jason. I could not walk without pain when I went to him. Every muscle in my lower legs where locked up. Jason did myofascial methods on my legs and I felt and feel so much better. Thank you Jason.  Thank you for your passion.", "pics": null, "resp": null, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "104995994919175652940", "name": "Cathy Prange", "time": 1556657050902, "rating": 5.0, "text": "Just experienced Vibrational Sound Therapy with Singing Bowls with Jason Watford....WOW !!! I went in stressed and left feeling peaceful and at the same time energized, the sounds from the bowls resonated with my soul and the vibrations from the bowls seemed to know what my body needed and wanted !!!! Thank you Jason and The Nature Gallery Yoga and Massage Studio.", "pics": null, "resp": {"time": 1557605449662, "text": "So happy you enjoyed your experience!!!"}, "gmap_id": "0x88929300c3dfc6bf:0x120391758678efe9"}
{"user_id": "111192995897987862802", "name": "Ace Wolf", "time": 1569764158033, "rating": 5.0, "text": "We had a a splendid 1st visit. I purchased some oil for my mother. The staff was very informative and helpful.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "102370179105147355822", "name": "Allison R. Widener", "time": 1550200360124, "rating": 5.0, "text": "I called to ask about CBD oil for my pup who has cancer. The owner called me back quickly and gave detailed instructions on the products she has and advise on how to use them.\nI can tell she takes pride in what she has in the store, and carries top quality product.\nHer husband was in the shop when I arrived and was very kind and sympathetic to my situation.\n\nI don't know how much time I have with my furbaby, but if she is still with me in a couple months when the oil runs out, I will definitely return here for more.\n\nThank you Herbal Toad for all your kindness, and for taking time to explain everything to me.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "109054689234414425192", "name": "Cathy Green", "time": 1535829170065, "rating": 5.0, "text": "Great customer service!  They helped me track down a stylist from salon who had cut my hair while I was in town for a funeral several years ago.  They walked a couple stores down to their new neighbor, Salon 126, to get me the name and number.  You really went above and beyond!", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "100154477607449101529", "name": "Stephanie Moore", "time": 1565383364307, "rating": 4.0, "text": "It's a awesome place. And you can tell they know what they are talking about.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "106388703325706809540", "name": "Samuel Coleridge", "time": 1577121321122, "rating": 5.0, "text": "Great assortment of herbs and soaps! Great class!", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "105529480271340399864", "name": "Emily Pritchett", "time": 1499980564083, "rating": 5.0, "text": "What a great shop for our town! Stephenie is an educated aromatherapist and is more than willing to provide individualized advice for whatever issue you have. This is a wonderful asset to Ozark.", "pics": null, "resp": {"time": 1500041284997, "text": "Thank you. We appreciate your business and you taking time to leave a review."}, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "107689232717177830817", "name": "Shirley Beasley", "time": 1535846827385, "rating": 5.0, "text": "The staff was very knowledgeable and they had exactly what I was looking for", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "110901133964325111967", "name": "Justin Dugans", "time": 1502042942014, "rating": 5.0, "text": "Great place to shop and receive knowledge on essential oils, Stephanie is very helpful and honest along with the prices being great for the items.", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
{"user_id": "114274628175538390915", "name": "Chris Hall", "time": 1549229654841, "rating": 5.0, "text": "Love the soaps", "pics": null, "resp": null, "gmap_id": "0x88927c2e385ebee7:0x871df3c62d3d2bdf"}
