{"user_id": "103112979305482451307", "name": "Heidi Hanchey", "time": 1619750289530, "rating": 5.0, "text": "Super nice owner. She was very patience and helpful with all my questions.", "pics": null, "resp": {"time": 1619779922136, "text": "I really appreciate your comments.  It was a pleasure serving you.\nJan"}, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "106160367973957142475", "name": "stephen greer", "time": 1599875798377, "rating": 5.0, "text": "Really great local art store. They have  a great selection of art supplies and a lot of local art for sale. I have always had a friendly smile greet me and great conversation. Thank you for everything.", "pics": null, "resp": {"time": 1599905848999, "text": "Thanks for the great comments.  I always have said we actually like each other in Foley.  It’s always a pleasure to talk to people."}, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "111944629297253457062", "name": "Melody Carroll", "time": 1577992836800, "rating": 5.0, "text": "We are from Indy. We had never been in this shop before and it was one of the best experiences I have had in the 20+ years of coming to Foley. The owner was amazing and very informative. I picked her brain about a lot of art mediums and learned so much. Bought some beautiful local art.  It is cash or check only but it's worth it!", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "115030140335552268226", "name": "Ron Carlson", "time": 1582314341445, "rating": 5.0, "text": "Thanks Jan had a great time learning more. Hope to be back next year. I learn more every time I am at one of your classes.", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "113035107445205837007", "name": "Johnny Wood", "time": 1580935065418, "rating": 5.0, "text": "Very friendly shop with lots of nice things. Will definitely shop there again.", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "102232681180942707028", "name": "Ron Carlson", "time": 1582240283366, "rating": 5.0, "text": "Very nice friendly great store wonderful teacher. Thanks Jan for helping with my ink drawings I always learn just a little more every year. I hope to be back", "pics": null, "resp": {"time": 1550065058699, "text": "Thank you.  It means a lot to know that\nI’m making a difference."}, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "116658192539177671952", "name": "Tammy Nance", "time": 1472344394809, "rating": 5.0, "text": "Great supplier of quality art products.\nClean convenient location.\nPlenty of cool, local art for sale.\nGreat prices.\nKind helpful staff.", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "108784344730118071613", "name": "Ronda Watts", "time": 1483100315011, "rating": 5.0, "text": "My daughter takes art classes with Jan at Jan's Art Studio and absolutely loves it!\nJan is extremely patient, thorough and cares about her students.\nI enjoy taking in all of the unique art pieces in her studio,  from one of a kind pottery, paintings and even jewelry!", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "108122782505590335354", "name": "Rosa Hill", "time": 1618017095365, "rating": 5.0, "text": "My son and nephew really liked the class. He said the best part was the teacher. He thought he would not enjoy it or couldn't draw beautifully but with her expertise he was able to see what he could really do. He liked it so much he wants to sign up to be a regular. 😊", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPO37Uj-JehJpfe3aUMCSiZ2XtGwuwNDPeU5a-m=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNo-3VqeHOxd9Mzfy7eOJyhtwtMOB23i3C2cgcy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUqes-Ih2twX5batkFLL5Q0tIMCCBLfcIqfxbF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaJ59PBunk3oHKxo3XFYcl0Ed_mAzLmwAC7L-b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6wDJ48mLP8grqI_aUHOdttuET8yeNOdOgorAf=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "114980632527439720055", "name": "Sara Kate Ames", "time": 1621009192637, "rating": 5.0, "text": "This is an amazing place for all ages to learn new and different techniques about art and even the occasional craft. I recommend this place to anyone who wishes to learn to paint. I have been a student here for 4 years and it’s been extremely fun.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "108648402358647715078", "name": "Stefanny Robbins", "time": 1621018446150, "rating": 5.0, "text": "My daughter loves Ms. Svetlana’s classes and is improving in skill through the fun and challenging instruction she receives. They’ve used pencil, charcoal, watercolor, acrylic, and pastels. I am always impressed by the artwork she brings home. Don’t hesitate to try out a class!", "pics": null, "resp": {"time": 1621140390358, "text": "🙂"}, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112005173692810412988", "name": "Keana Winston", "time": 1623867146229, "rating": 5.0, "text": "Ms. Svetlana is an absolute angel! First off, she is an absolutely amazing artist.  This isn't your run-of-the-mill studio. Her space speaks to her passion for art in so many forms. I've seen a paper unicorn on the wall.  Paintbrushes painted and decorated from different cultures. My son has been attending her art camp, and he has learned soo much already! She is amazing with the kids! She loves them and they love her. She pushes them and takes her time with them. She is an amazing teacher and her art class is amazing. She even taught me to paint! If you haven't taken her classes or sent your children, you are missing out!!!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "101798289342144436634", "name": "Rachel Shanks", "time": 1621635076507, "rating": 5.0, "text": "Ms. Svetlana is an amazing teacher.  My son loves her class and the veriety of mediums  and styles she teaches.  My son has been in her class for several years now.  We moved away for a year and moved back and one of the things he was most excited for when we moved back was that he would get to take art classes from Ms. Svetlana again.  He has had classes with 4 other  art teachers and no one holds a candle to Ms. Svetlana at Art Zone!  She is also very friendly and focused on building not only skillsets but the student's confidence in their abilities.  I highly recommend Art Zone and Ms. Svetlana!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117400536160900373156", "name": "Arvind Kumar", "time": 1616977151304, "rating": 5.0, "text": "Excellent class, my Daughter learned a lot from Svetlana", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "108944562960448235218", "name": "Prabhakaran Govindarajan", "time": 1482080818028, "rating": 5.0, "text": "My daughter is attending this class. She loves 'Sweet Lana'. She is enjoying the class very much and decorated her room with her work", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPipofkEaLolmTn5lEzUKAEIVVbAxdpvLCEX6W=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "101209404747893131975", "name": "Rob Rouleau", "time": 1505995961778, "rating": 5.0, "text": "Svetlana did a fabulous job designing the NASA Flight Patches for our UAB Refrigerator / Freezers that now reside on the International Space Station.  Her designs are out of this world!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPXVc5YjpW6vDeNpuaPg8eqiE6wtDSRfFotL56B=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117097590346646117872", "name": "Cameron al Shaqar", "time": 1554301182224, "rating": 5.0, "text": "This is a great art class. The teacher is a wonderful artist and teaches so well. She's funny and very smart! If you like art, at whatever level you paint on, you'll love this class!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110505246168868719324", "name": "Lori Johnson", "time": 1571320109016, "rating": 5.0, "text": "Svetlana, the owner, is very pleasant and fun. And she is a very talented artist. I was part of a group of twelve ladies and we had a great time painting and laughing. Svetlana is a very patient person! This was my second time painting at Art Zone and I plan to go again. I highly recommend Art Zone!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110390824656897666463", "name": "EunHee Shim", "time": 1456862480420, "rating": 5.0, "text": "My daughter has been in this art class and summer camps for three years, and she loves the classes. Her art teacher tries many different art materials and methods in each class. Her teaching gives my daughter very good combined ways with instructive parts and imagination parts.\n\nUnfortunately, we are moving to another state in this summer and my daughter wants me to find another teacher like her current art teacher in new city. We are going to miss her so much.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "109531194483004005964", "name": "Anna Helova", "time": 1452814019519, "rating": 5.0, "text": "Great program! Both of my kids (boy and girl) have been in Art Zone's program for the past 3 years. Svetlana helped them to develop skills in many different areas and to enhance their creativity and individual style. Program is housed in stimulating, artistic space. I also attended one of the classes and for the first time ever created something I'm not ashamed to display. Art Zone is for any age or skill level.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "108362696614843249368", "name": "Chef Mommy", "time": 1563478975253, "rating": 5.0, "text": "My husband and I were looking for an art camp and we totally lucked up on this place! Svetlana is the sweetest, most patient, and skilled art teacher.  My 10 year old and 7 year old son have grown so much in only 2 weeks spent with her.  My daughter has started her own art Instagram page and has sold 2 paintings in two weeks of working with this amazing teacher! I can't say enough!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105477854442280852860", "name": "Elena C", "time": 1455987068972, "rating": 5.0, "text": "Mrs. Svetlana is a wonderful teacher with a big heart. I recommend anyone to her if they want to do art. She's an amazing artist who teaches very well. I have been with her since I was six and I am now fourteen. As a result, I've enhanced my skills to a great extent. I feel comfortable with her because she has become my second mother.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "114569089384066436645", "name": "braceforthestorm", "time": 1454041985402, "rating": 5.0, "text": "The very, very best teacher you'll ever have!! No matter your skill level or preference, she can teach you anything from the very basics to enhancing the skills you already have. DEFINITELY would recommend to anyone considering delving into some art! The classes are so diverse, and you will definitely come home with a masterpiece not long after attending.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116222830676020044526", "name": "irma higginbotham", "time": 1510752960039, "rating": 5.0, "text": "Svetlana is talented skilled artist and a great teacher, kind with children and patient with adults. I started her classes with no experience. She immediately inspired me, she helped me to see the world, nature, colors in a different perspective. When I am in class, I forget about all surroundings, “only myself and painting”. Her classes are very informal and relaxed. She doesn’t draw for you, she teaches you step by step to create your own painting using watercolors, acrylic or oil.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116202129766297860445", "name": "Melissa Scroggins", "time": 1571284181678, "rating": 5.0, "text": "What a fun and incredible way to spend an evening with friends. Svetlana was able to help our small group create beautiful crosses that will be a precious keepsake forever. We laughed and created and learned artistic technique. Svetlana is incredibly gifted and she was able to teach each of us at our level of experience. She is a delight and a blessing! I highly recommend her and her studio!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103111754618040990492", "name": "Xixi China", "time": 1468112040124, "rating": 5.0, "text": "I have been taking classes from her for, let's see, seven to eight years now, and art classes with her never gets dull. She's engaging, adaptive, and most of all, fun. She pushes you to improve in all aspects, not only just in, say, painting or sketching, but also with, say, charcoal or anatomy, and maybe even aspects out of the classroom. I'm not good at writing reviews, but I can say for sure she's the best teacher I've ever had.\n\nP.S.: Taking her classes will also net good food and an ability to take criticism.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103225086590824330026", "name": "Terry Xie (Terry Xie)", "time": 1498335406594, "rating": 5.0, "text": "My daughter loves this place! A very nice teacher and highly artistic. The teacher is always inspiring and has a lot of creativity. Recommend to come here if your child loves art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103155745409926895272", "name": "Benjamin Marks", "time": 1452322606852, "rating": 5.0, "text": "I had no prior art experience, and I didn't expect much from my first attempt. But the teacher was very patient and helped me until I completed my first painting, and it looked far better than I could have hoped. I'm really grateful for the assistance of Art Zone and had a lot of fun in the process.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "100201779719580484523", "name": "Lucy Guarino", "time": 1473780866308, "rating": 5.0, "text": "I really enjoy these classes. I originally was going to come for two months as a birthday present, but have now been there for six and intend on continuing as long as I can. I love learning all the new  techniques Ms. Svetlana has to offer and love the environment she has created. Her class is always very up beat and fun!  Plus I have improved immensely with drawing, painting, etc.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112363645075713631836", "name": "clang", "time": 1519573358012, "rating": 5.0, "text": "We had an art party for our 9 year old daughter. Svetlana figured out exactly what kind of art my daughter was interested in and helped the kids sketch and paint their choice of art on canvas.  The party was definitely a hit!!  Thanks again !", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "114898721127239239600", "name": "Zackery Anderson", "time": 1581094542028, "rating": 5.0, "text": "Been going to this class for a year now and it has helped me alot with my projects and art in general, The teacher is really good with helping me and the other students in my class. 13/10", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112265238160246741985", "name": "Summer Harrison", "time": 1452393829656, "rating": 5.0, "text": "I took art classes with Svetlana for many years, and loved every minute of it. She drew out the creativity in me and has taught me lessons, not only in art, but in life, that I still use to this day as a college student. She treated us like her own and was extremely patient and pushed us to accomplish things we never thought possible. Her class was not only fun and engaging but challenging in the best way. She made me feel at ease and like home in her class. One of the best experiences of my life and something I recommend to anyone of any age or skill level!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "108361819493555196243", "name": "Karen Douglass", "time": 1571280612400, "rating": 5.0, "text": "Our Small Group had a session with Svetlana tonight and it was fantastic! She is truly a gem and a wonderful instructor.", "pics": null, "resp": {"time": 1571283223270, "text": "Thank you very much!😊"}, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116940007944273033063", "name": "Erin Finn", "time": 1472264639964, "rating": 5.0, "text": "I thoroughly enjoyed my time at the art zone. Miss B is a wonderful art teacher, very knowledgeable and skilled. She helped guide and strengthen my ability, and brought me to a skill level I could not have achieved without her :)\nI highly recommend her to anyone looking for lessons!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106510295498402899769", "name": "Sasha Belotserkovskaya", "time": 1454041817833, "rating": 5.0, "text": "Amazing teacher. Her classes include not only art instruction but also life lessons and friendly conversations. She is so flexible that she can cater her teaching style towards any type of artist and any aged student, from age 5 to age 75.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103273370552096332415", "name": "Ekaterina Chernysheva", "time": 1507758948036, "rating": 5.0, "text": "Ms Svetlana is an amazing teacher. I started taking her classes as an adult with no experience whatsoever a few months ago. And I cannot believe how great my paintings turned out to be. She is skilled in so many techniques and can help you bring your art ideas to life. Her enthusiasm and overflowing energy are contagious,  her creative personality inspires everyone around her to constantly strive for better results. I highly recommend her classes to kids and adults alike.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106863392874118523917", "name": "jennifer dussich", "time": 1458103074647, "rating": 5.0, "text": "My daughter took classes with Mrs.B for 4 years. She is an amazing teacher and my daughter adores her. Even though she is no longer able to take classes they still have a very close relationship. I would highly recommend the Art Zone and Mrs.B to anyone who is looking for classes.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116618114274338674110", "name": "Viewtopia Pictures", "time": 1480219504282, "rating": 5.0, "text": "Fantastic class that inspired students  to paint expressive and whimsical, yet realistic self portraits. Caring and patient  teacher inspired the students with various artists' work before getting them to dive in and create their own. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110671526988680717802", "name": "Beth Rowell", "time": 1505416952540, "rating": 5.0, "text": "I have taken many art classes in my life and this is the best one I've ever taken. In just a few classes I've learn more with this talented instructor than I have in all the art classes combined. Wonderful class atmosphere and amazing insstruction. Luck to have this in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104338986446520317003", "name": "Daniel Blokh", "time": 1455199371023, "rating": 5.0, "text": "Loved lessons here! She helped a lot, and my doodles have gotten much better since I took classes here, even though I haven't taken classes in almost a year. A great place to get help with art if you enjoy drawing.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112205736907399389883", "name": "yulinxp", "time": 1515296724197, "rating": 5.0, "text": "My daughter has been taking classes for half of year. She loves it. Ms. Svetlana is a very talented artist and a great teacher who is kind and patient. She always provides guidance and advice to help students. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117427609666962366215", "name": "Eric Tsai", "time": 1452372258255, "rating": 5.0, "text": "Ms. Svetlana is an amazing art teacher! She has opened my eyes to the countless possibilities that I never knew existed in art. If you are looking for an art teacher around Birmingham, you should definitely go to her!! You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110857297923976564972", "name": "Stacy Helland", "time": 1530144828401, "rating": 5.0, "text": "We had a great experience with Summer Art Camp! My 8 year old daughter LOVED it! She begged to go more. These are very high quality art classes. She introduced them to many different types of art. Lucy learned so much just in 7 classes! It was way more than we even expected! We highly recommend Ms. Svetlana! She was so sweet and kind. We will be going back! You will not be disappointed if you go!😁", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116392575662453078310", "name": "Salem Wear", "time": 1454084162317, "rating": 5.0, "text": "I've been taking art at Art Zone for a year and a half now, and I love it! The instructor is very nice but also challenging. I recommend the class to anyone and everyone who wants to learn more about art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104208848311872761637", "name": "Charles Rumore", "time": 1513885681555, "rating": 5.0, "text": "Ms. Svetlana is an outstanding art teacher.  Her guidance and experience have been invaluable.  She is always able to give me just the right advice to improve my piece when I need it.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104001146788655650983", "name": "Carolyn Waldron", "time": 1471819719759, "rating": 5.0, "text": "\"Sweet Lana,\" as she teaches her students to pronounce her name, is the ultimate art teacher in any medium one wishes and any style as well. Knowledgeable, creative, fun, excellent teacher, patient, effective and utterly charming! The student's time with \"Sweet Lana\" will be a joy and time well spent!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "108210922466283756299", "name": "Ann Beaird", "time": 1471920059996, "rating": 5.0, "text": "I have known Svetlana for many years now and have commissioned her to do several portraits for me.  I have always been extremely pleased with her work; she has a wonderful talent for capturing the real look and essence of a person in her portraits.  She is also a very enthusiastic and sincere teacher who truly encourages her students and inspires them to the best of their abilities.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105501446720684386057", "name": "Sofia Papagni", "time": 1521509881613, "rating": 5.0, "text": "This is really something special. I don't think you find this quality in most art classes, or specifically art teachers. Ms. Svetlana is an incredible instructor but is an equally as impressive supporter of artists. I think its impossible not to improve after her assistance. Not to mention she is one to cross boundaries, step outside ordinary techniques, and experiment with an open mind. She's a hidden gem.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104109638726451469571", "name": "Claire K", "time": 1455144671656, "rating": 5.0, "text": "The teacher is very nice I have been going since I was six and now I'm 14 she's a great teacher that has taught me how to draw and be really good. Since then I've won many art awards. She's like my second mom she is great and the classes really help me", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102994183341022244667", "name": "pyromantom", "time": 1482889417620, "rating": 5.0, "text": "Miss Svetlana is amazing. She is creative and incredible. Her art skills are world class and she is a fantastic teacher. Everyone should attend her art class if you get the opportunity, if you don't you are robbing yourself of an amazing opportunity.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "100470927629540944096", "name": "anna", "time": 1455895211012, "rating": 5.0, "text": "My daughter has been taking the classes for 3 months and has improved so much. It makes my daughter very proud of her work. It is a very good art class and fun.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117730710970140499885", "name": "Lisa Clark", "time": 1498253723378, "rating": 5.0, "text": "Absolutely wonderful! The teacher is so talented & great with kids. My daughter loved it, & I was thrilled with her projects.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106547538246307712005", "name": "Kathryn Hardy", "time": 1468189150306, "rating": 5.0, "text": "Svetlana taught me how to be open minded with art when I took her classes as a child. Her classes inspired me to continue to be creative throughout my life. Absolutely phenomenal teacher who can teach anyone and genuinely loves doing it!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105702695481854117518", "name": "Beverly Stine", "time": 1474497249452, "rating": 5.0, "text": "I highly recommend Svetlana as a art instructor.  She is not only an excellent portrait artist and excels in many mediums, but she is definitely a people person.  She works well with all ages, giving encouragement and instruction.  Her well trained eye always finds improvement and suggestions.  She is a dedicated artist encouraging creativity from her students.  Her classes are always enjoyable and she makes learning fun!  Young and old, you will improve your skills and enjoy Svetlana's class!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "115900978971419171248", "name": "Charlotte Graham", "time": 1484158985695, "rating": 5.0, "text": "Svetlana did a fabulous sketch of my children 15 years ago at an arts and crafts festival in my hometown. . I wanted an updated one this year and was able to find her through an internet search. She did a new sketch of my now almost grown kids and it turned out so great. I absolutely love it. So glad I was able to find her still living in the Birmingham area and still doing portraits! Wonderful artist and sweet lady.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106226521694924930548", "name": "Maria Blokh", "time": 1457295099720, "rating": 5.0, "text": "I had a great experience taking the art classes! I had never thought that I could paint, and now I feel proud of the work I produced through these classes and have been inspired to continue painting. I was free to choose projects that were personally interesting and rewarding for me, and learned many techniques for producing a painting that I was happy with. Svetlana makes the learning and creative process a lot of fun, so you'll be laughing a lot too! It's been by far my best experience learning how to make art. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112855677910604356086", "name": "Karen Hoar", "time": 1481337717175, "rating": 5.0, "text": "Svetlana will keep you painting and laughing all through class! Definitely go see her for classes, parties, and commissioned work. You won't be sorry! She is talented and will work with you!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116255777744672529120", "name": "Veronika Poliakova", "time": 1480219397756, "rating": 5.0, "text": "Loved the teacher and the experience. I had a lot of fun and learned very much about different art styles. I was very happy with the results of my work and hope that I will be back.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102515139120763629500", "name": "elena matveeva", "time": 1480219264497, "rating": 5.0, "text": "Svetlana is an amazing teacher with limitless abilities and  desire to share the deep knowledge of art with very young students as well as with adults. Her passion for  art is shown through her devotion to help students of all levels to master their skills and grow\ntheir !", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110720424910865194574", "name": "Mark James", "time": 1472267164497, "rating": 5.0, "text": "I first met Svetlana when I was doing interior design work...it was an absolute joy to work with her during the creative process...and I've never met an artist who can literally do anything...ANYTHING! I love her work so much I asked her to do a family portrait...she has a gift rarely seen in artists.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110072345702193620413", "name": "Erica Wei", "time": 1452357316844, "rating": 5.0, "text": "I've taken art classes with Ms. Svetlana for almost nine years, and they only get better with every year that passes. She's introduced me to a wide variety of mediums and techniques, from charcoal and soft pastel to cross-hatching and measuring proportions. The art classes for children allow children to create craft projects and explore drawing and painting methods. Bonus: she also makes the best turkey burgers and macaroni in the world. The art classes for adults allow both children and adults to pursue any artistic interests they may have. I'm currently in her adult class. I can create my own project or draw a still life of candles; whatever my interests are, she helps me through the process. Whether you're in her children's or adult class, the environment is always comfortable and fun. She treats all of the children as if they are her own, and she's friends with her adults students. I'm at the age where I'm a mix of both; she gives me motherly advice, but we also talk about what's going on in both of our lives. She really cares about her students' lives; she'll ask you about your grades, your siblings, your children, or your grandchildren. She's caring, funny, crazy, smart, talented, weird, and every other good adjective out there. I hope anyone remotely interested in art will take one of her art classes. Without a doubt, one of the things I'll miss the most when I go to college is Ms. Svetlana's art class.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "100771887858234712268", "name": "Madyson White", "time": 1504897633627, "rating": 5.0, "text": "I just starting coming to classes at Art Zone in Birmingham and i've already been encouraged to try things i've never done before in previous art classes. I love the fun and warm atmosphere of the class and the teacher really cares about you and improving your individual skills as an artist. I'd recommend this class to anyone who's looking to become a better artist and to have fun and plenty of laughs while doing it!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "115708465940716488051", "name": "Bryan Byrd", "time": 1455253275904, "rating": 5.0, "text": "My daughter takes classes here and it is simply AWESOME.  Art for all skill levels and just the best teacher in town.  We love it!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103206064563964916212", "name": "Christopher Khalaf", "time": 1471903712831, "rating": 5.0, "text": "Svetlana is a wonderful person and amazing art teacher.  Took lessons with her for almost 10 years and would still be taking them if it wasn't for time conflict.  She is engaging, funny and great in any medium you want.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103350207866946074239", "name": "Deb Wesley", "time": 1452391146965, "rating": 5.0, "text": "I've just begun taking art lessons from Svetlana.  She is a very talented artist and instructor.  I am a novice and she is very helpful and encouraging.  I highly recommend her for any age or level of experience!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104216720907456297046", "name": "Yile weng", "time": 1472319328507, "rating": 5.0, "text": "Great teacher! Wonderful wonderful drawings!  My kids have huge improvement since they go to this art classes.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106749319294508519316", "name": "Michelle R.", "time": 1452534473617, "rating": 5.0, "text": "My daughters have had the pleasure of taking classes with Svetlana for many years.  They have explored a wide variety of art mediums, from sketching to sewing.  Svetlana is able to teach a multi-age group of children with ease.  She tailors her lessons and advice individually so each child develops their understanding and abilities in art.   Over the years I've seen the incredible development of many of her students art ability first hand.  From the beginner learning to sketch from a model, to adult students honing their technique, she does it all!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "115410774739839455512", "name": "elisa Laureano", "time": 1456333485356, "rating": 5.0, "text": "Svetlana is a very talented artist, she was able to capture the likenesses and the souls of the subjects in the paintings a friend commissioned as a gift for me. I would recommend her as a teacher and a portrait artist.  She has a lot of students and clients from China, Russia, and  USA.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "115850923230382485680", "name": "Esther Levy", "time": 1473618632846, "rating": 5.0, "text": "I truly enjoyed my years of art lessons from the adult class. I learned a lot and was also able to experiment with new concepts in class! Definitely a 5 star experience!!!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117516782399605201834", "name": "Gina Pugliese-Tallaj", "time": 1486224540194, "rating": 5.0, "text": "Ms Svetlana has been teaching our son for several years. His progress has been amazing. The Saturday classes are the highlight of his week. She treats him like her son. Ms Svetlana has a way of inspiring and challenging her students, motivating them to try different techniques, always in a fun and welcoming environment.\n\nI highly recommend Art Zone for anybody, any age, who enjoys and likes art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117426436106098472577", "name": "Lynn F", "time": 1539916917102, "rating": 5.0, "text": "Individualized instruction for every skill level at any age! You owe it to yourself or your children to take art classes at Art Zone.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "107562901094902351979", "name": "Frances Carter", "time": 1454256210593, "rating": 5.0, "text": "Svetlana is an amazing art teacher! She really connects with the kids and is able to bring out the best in them. Going to art each week is the highlight of my kids week!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "118423283752847698506", "name": "Yev KG", "time": 1513917461069, "rating": 5.0, "text": "Svetlana creates a captivating and insightful atmosphere that will astound anyone trying to become a better artist; each lesson has the sense of being curated towards realizing a student's unique potential no matter their prior skill set or experience.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112835710825576822878", "name": "Qin li", "time": 1506558295142, "rating": 5.0, "text": "My daughter Abigail is really love Svetlana's art class! Abigail is six and she just joined the class three months ago. Now every other week she will bring back home some amazing art works! Many thanks to Ms Svetlana!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102919685088155166575", "name": "MargaretAnn Leithart", "time": 1452358779640, "rating": 5.0, "text": "I've been taking art classes from Miss Svetlana for about two years, and I can't imagine ever leaving! She is an incredibly talented artist and a wonderful teacher. My first class was a little overwhelming, but I chose to return the next week anyway, and I am SO glad that I did! Over the years, Miss Svetlana has become like a second mother to me as well as a teacher. My artistic skills have blossomed under her guidance. I would recommend her to anyone and everyone looking to enhance their own skills.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "109702727791319214456", "name": "C Womack", "time": 1531107635969, "rating": 5.0, "text": "Svetlana is an excellent teacher! My oldest daughter has been taking classes since January and she greatly improved under Svetlana's tutelage. My youngest daughter recently started taking from her. She had never really enjoyed art because she found it frustrating. She is Loving art now.  We adore Svetlana and wouldn't send our girls anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112274802512227463059", "name": "Kody Yang", "time": 1473886296920, "rating": 5.0, "text": "I'm in 8th grade and I've been in the art class from the age of six. Her classes have never been dull. Mrs. Svetlana teaches a variety of art techniques. She includes humor and fun ways of teaching in her lessons. Her wonderful mac n' cheese is also a plus.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "109203341026787084051", "name": "Elisabeth Tsai", "time": 1454043893982, "rating": 5.0, "text": "I would highly recommend this amazing art teacher, Mrs. Svetlana Belotserkovskaya. She is not only an incredible artist, but also a fantastic teacher. Every lesson is an unforgettable, eye-opening experience. This is definitely the place you should go if you want to be a better artist.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103553279851603963528", "name": "Ruby Rong Ni", "time": 1524947835794, "rating": 5.0, "text": "I could tell my daughter making progress after months😄she is patient and helpful!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "113281876655953503605", "name": "Luis Ramos", "time": 1457836842324, "rating": 5.0, "text": "She helped improve my painting skills by pointing out how fine details can be achieved through simple technique. She made sure to point out mistakes and had a very positive attitude.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "116578614533030442417", "name": "ANLI CHEN", "time": 1525030528036, "rating": 5.0, "text": "Mrs.Svettlana is the best art ever. She always keeps me entertained and I really recommend her.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "107094519116605956690", "name": "Matthew Yoder", "time": 1457836017523, "rating": 5.0, "text": "I'm 22 and relatively hard to teach. I get frustrated and discouraged easily, but Svetlana is the perfect teacher for me! Her artistic skill is top notch, but for me, it's more important that she can deliver that knowledge in a way that I can understand and not feel lost in. She helped me to fix a post-impressionist painting that I am working on for my girlfriend, instructing me in proper brush technique, composition, and color blending. The class was enjoyable, Svetlana was funny and informative, and I now have a painting to be proud of!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "100091497455121755500", "name": "Meli Rodriguez", "time": 1452370285288, "rating": 5.0, "text": "Great art instructor! Not your typical school art class, but rather she challenges the students to take their creations to the next level. Super friendly!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104452849151458121270", "name": "Susan Walker", "time": 1454093175984, "rating": 5.0, "text": "My homeschooling student has taken art classes at Art Zone for 4 years.  I very pleased!   Svetlana is a talented, warm-hearted, skilled teacher.  My student has made much progress in her art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110046313014131745237", "name": "Maddie Manston", "time": 1452355730179, "rating": 5.0, "text": "I love this class, it has helped me with my drawing and painting and I enjoy coming every week!  I have been coming for 3 or 4 months and it has been a great experience!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112402001789831607705", "name": "Anna Iastrebova", "time": 1471841245445, "rating": 5.0, "text": "I’m fortunate to have a few painting by Svetlana in my place. Svetlana is an accomplished artist working in many different styles and techniques. She generously shares her knowledge and skills with her students whose progress we watch through their drawings and paintings exhibited online. I fully recommend her as a creative and devoted teacher.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105072832251521805670", "name": "Mark Jones", "time": 1514076437080, "rating": 5.0, "text": "Svetlana Stanislavonva did an amazing piece for me and my family. It was personalized and beautiful. She is an amazing artist!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117895069558052749589", "name": "K Hendricks", "time": 1529875705984, "rating": 5.0, "text": "Brianna just started lessons with Ms. Svetlana this summer and is enjoying every minute. Ms. Svetlana has introduced her to a multitude of styles and media.  I can see Brianna growing in her skills with every lesson and piece of art. Thank you Ms. Svetlana!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106763140733501757305", "name": "Rich and deAnne Guarino", "time": 1527712200088, "rating": 5.0, "text": "Without reservation, I highly recommend Ms. Svetlana. Our daughter has grown as an artist by leaps and bounds under Ms. Svetlana's tutelage. She tailors each student's lesson and it shows in their work.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "117192014241461012961", "name": "Zhixin Wang", "time": 1506696445603, "rating": 5.0, "text": "Mrs. Svetlana is very good at teaching young learners. My kids love her!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "100194743117713942009", "name": "Marika Johnson", "time": 1466793035521, "rating": 5.0, "text": "Svetlana is a wonderful and very talented artist. She was great with my daughter and has a very fun teaching style. She (my daughter) took a  weeklong summer camp and now she can't wait to get enrolled in her regularly scheduled classes!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "114684327956911265981", "name": "Jianbo Wang", "time": 1498314214968, "rating": 5.0, "text": "My son attended the summer camp and he loved it. He made a number of crafts and learned various painting/ drawing over the week. Svetlana was loving and caring, and overall an excellent teacher.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102607898937517051102", "name": "Rossi C", "time": 1457321158953, "rating": 5.0, "text": "Been here for two weeks and I can honestly say I have learned plenty about art ! I can't express how excited I am every week to know what she will teach me . There are so many different techniques I have learned in such a short time. And my classmates have been inviting since day one .", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "101509096327627029511", "name": "Soriah Anvary Nourani", "time": 1521740654498, "rating": 5.0, "text": "As a newcomer to the area, I can say for certain that Ms. Svetlana's class is one of Birmingham's gems. My six-year-old daughter are able to attend class together where we feel welcome and encouraged each week.  Ms. Svetlana is at once a loving, patient and flexible teacher and skillful artist--all the qualities that make her an overall wonderful educator.  Thank you Ms. Svetlana!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105936214040490313915", "name": "Dana Martinez", "time": 1513965855874, "rating": 5.0, "text": "I was quite apprehensive in taking an art class because it has been so many years and I never thought I was really good at it. I'm now comfortable with the uncomfortable! What a wonderful way to relieve stress and focus on creativity. I no longer will say that I'm artistically challenged due to a fantastic art teacher (Svetlana). My daughter attends the homeschool program and has learned much and we are truly grateful for such a talented teacher.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "111138280573220019335", "name": "Susie Landis", "time": 1515466560939, "rating": 5.0, "text": "Mrs. Svetlana is an amazing teacher. I took some of her classes during the summer and witnessed her fun envoirment for all ages to learn and practice art. Starting as a beginner I learned a lot!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "111888688889325043684", "name": "Jessica Sun", "time": 1473563868453, "rating": 5.0, "text": "Best art teacher I've ever had. She's funny and can be critical, but she means well. She wants her students to draw amazing stuff. She teaches her students to do still-life, portraits, wood-burn, clay, arts and craft, etc. In her art class, we used all sorts of media like water color, acrylic, different shades of pencils, color pencil, glitter, soft pastel, oil pastel, etc. She will challenge and push her students to be better artists.\n\nPersonally, I used to hate drawing portraits for the longest time. Now I draw portraits for fun, and the portraits actually look like who I'm drawing. I've actually drawn a portrait of Clint Eastwood, that is also personally signed by him.  Before, I would only draw landscapes but Ms. B has helped me improved my techniques in landscapes too. She understood that I didn't like to deal with details, b/c I was more of a impressionist person than a realist person, but still...she taught me how to enjoy drawing details (especially on portraits).\n\nMs. B's art class has made me realize that art is one of my passion in life to a point I'm minoring in studio art in college while being a pre-med/ biomedical science major. At the end of the day, Ms. B basically become my second mother and my friend. I've learned how to use better techniques in shading and so much more! I've had Ms.B as an art teacher for atleast 10 years now, and she's wonderful!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "109423061660352983601", "name": "CH Zou", "time": 1461696924389, "rating": 5.0, "text": "Fantastic classes! I learned so much and had a lot of fun while doing it.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "108351579851597325675", "name": "Camille White", "time": 1452824324338, "rating": 5.0, "text": "I am a current student with Ms. Svetlana and have been with her 4 years. She is a wonderful teacher, patient and encouraging with all her students. When I first came to her class, I told her I could not paint or draw. Ms Svetlana helped me overcome my fear and made me confident in my art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "114696738383702345176", "name": "M Golra", "time": 1472010672451, "rating": 5.0, "text": "Svetlana is a very talented artist. The quality of her art work is amazing.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102336476060691380900", "name": "Komali k", "time": 1491963381170, "rating": 5.0, "text": "My kids have been taking art lessons with Svetlona for two years and they absolutely love her. Svetlona is very sweet and has lot of patience with kids. Her teaching style, creativity, unique techniques makes her classes interesting and captivating for kids (and Adults). Svetlona is the BEST!!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "115127073013888144755", "name": "Francesca Mereu", "time": 1464013511884, "rating": 5.0, "text": "She is a wonderful and careful teacher. I highly recommend her to anyone interested in learning arts!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102370333722205144964", "name": "Haley Wells", "time": 1483156496236, "rating": 5.0, "text": "when I first came to Ms. Svetlana about two years ago, I thought my drawings were the greatest thing on earth and beyond I was so proud of them. Now, two years later, when I look at my sketchbooks, I realize how much Ms. Svetlana has helped me to improve. she has put me on a path to creating original fun artworks while learning the solid basics of creating art. I have learned dozens of new techniques in many different mediums. she is an amazing art teacher, an amazing artist, and  an amazing person, who has really blessed my life these past two years. I would 100% recommend going to her for art classes. she is the best in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "118016547493657397126", "name": "Sophie Wu", "time": 1454045043091, "rating": 5.0, "text": "Classes are fun and I've learned a lot. Good for all skill levels!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "112645853908999433592", "name": "Anastasiya Klyuyeva", "time": 1485278135512, "rating": 5.0, "text": "I attended art classes with Ms. Svetlana for many many years, from middle school all the way until the end of 12th grade, and would have continued if I didn't move states for college. I would have never improved as much as I did over those years if I didn't have Ms. Svetlana's help and critique. Her exercises and assignments help build not only a very solid foundation of techniques in a wide range of materials, but also help expand the imagination. I've never had any other art teacher who taught me to explore as many art media as I did in these classes.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "109397816458142872404", "name": "pistachio", "time": 1520746070455, "rating": 5.0, "text": "Love Svetlana! Let's us explore many different styles and materials to eventually learn our own style. I love going there every week and have a close relationship with her. We eventh haveth outh own thecret lanthguage. She makes every class fun for me.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "101027608045200300187", "name": "Angela Alley", "time": 1476317442596, "rating": 5.0, "text": "My daughter is so excited when Saturday rolls around so that she can spend time drawing and painting at Art Zone with Ms. Svetlana. In less than 6 months we have really seen improvement in her technical skills. My daughter states that she has learned a lot about shading, mixing colors, various paint brushes and so much more. We are both very, very pleased with Ms. Svetlana's teaching and the wonderful environment she provides for all levels of artists.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104357690483474473628", "name": "Emmerson Phillips", "time": 1504831646231, "rating": 5.0, "text": "I'm in 7th grade and I love the class I'm in! I've learned things I'd never had learned in my school's art classes. This class teaches with all ages and also private classes which a lot of art classes/schools don't have. You really won't regret taking it!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "111081643424239758629", "name": "Amy Wu", "time": 1473651900985, "rating": 5.0, "text": "I remember that classes with Ms. B were always informative and personal. I really felt like Ms. B got to know everyone in the class not just as a student but also as an individual and she would tailor her specific comments to what each person needed. I made some of my best friends from her classes and learned more than I've ever learned in any art class in my life. Even having taking \"higher level\" art classes at university, I still feel like I learned more about the basic and advanced skills from Ms. B back when I was younger.\n\nI would definitely recommend her classes to anyone who is looking for a caring (but firm) teacher who will help them become the best artist and person that they can be.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104645413802487191928", "name": "LEDA SUMMER", "time": 1474172413690, "rating": 5.0, "text": "My daughter took art classes with Svetlana for a few years and really enjoyed her experience.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102061419244196201729", "name": "Anastassia Ioudina", "time": 1473547340014, "rating": 5.0, "text": "Our family loves Svetlana's classes.) Svetlana's passion for her work is evident in delivery of all her lessons ( kids or adults). She is so enthusiastic and energetic that kids simply can't wait to get to her class. Not only kids explore different techniques like sketching, mosaic, painting, paper mache, etc., etc., but they start thinking creatively, and learn to enjoy art. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110840842080422349911", "name": "Anna Pollard", "time": 1466789195597, "rating": 5.0, "text": "I have learned so much after just one week of classes! Svetlana is a great teacher and is very friendly and helpful. She teaches a variety of different mediums: paint, charcoal, pencil, anything that you desire! Svetlana is a wonderful and experienced artist. People of every age and skill level can learn something from her!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "107778575403153652413", "name": "Daniel Mason", "time": 1457836558021, "rating": 5.0, "text": "I am a 22 year old male with practically no painting experience. Svetlana Belotserkovskaya was an amazing teacher! She's patient and kind, and under her tutelage I was able to recreate a beautiful acrylic painting in just 2 and a half hours! She taught me the basic concepts of underpainting, shading, mixing colors, and using layers to blend hues. I would definitely recommend her to new painters!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102134718573454654238", "name": "Jonathan Ye", "time": 1455160849968, "rating": 5.0, "text": "It was very gud, SUPER DUPER fun r8 10/10 would art again.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "111342394578368396703", "name": "Ruby Bing", "time": 1458773363467, "rating": 5.0, "text": "She is a wonderful teacher who is talented, caring, and loving! Kids love her ;)", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "111579884839190171307", "name": "Anna Zeng", "time": 1481598147221, "rating": 5.0, "text": "Mrs. Svetlana is the best teacher you could have. She is patient and is always there to help you. She gives you a variety of different styles of art to do. I learned how to do portraits, frescos, paintings and many more types of art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106968488562060490190", "name": "Elisaveta K", "time": 1454019616957, "rating": 5.0, "text": "Amazing class, the teacher is just wonderful. I'm in 7th grade, and I look forward to each class everyday!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "104061491610564811686", "name": "Olga maser", "time": 1492130998831, "rating": 5.0, "text": "My five years old daughter is taking classes at Miss Svetlanas art class!She is the best art  teacher ever!We  both are very happy to have Miss Svetlana as a teacher!My daughter does thanks Svetlana a really good work!She is very  professional,smart and lovely woman and we enjoy the time with her!Thank you Svetlana to having us😁🤗👍!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110340022698934801075", "name": "Joanna Sanders", "time": 1473615451582, "rating": 5.0, "text": "I met Svetlana at an art show at the Riverchase country club a few years ago. We became fast friends! She is one of a kind and one of the best free hand artists I've ever had the pleasure to see work. She drew a live picture of my daughter while I sat and watched. Her work is amazing. I own a lot of handmade art, 3 of which Svetlana did, and her pieces are my absolute favorite! I highly recommend Svetlana for your portrait needs and as a art class teacher. She is the best!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "110305247550414809748", "name": "Sophie Borden", "time": 1455480195335, "rating": 5.0, "text": "I've been going here since kindergarten. I have learned so much from Ms. Svetlana and I've grown to see her as a second mom. Huge part of my childhood", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "106089282150177059874", "name": "Odelia Huang", "time": 1485311733586, "rating": 5.0, "text": "I highly recommend Svetlana as a teacher! With her encourage and expertise, I began my journey as an artist, one which continues to this day. I was able to learn the fundamentals of art, as well as the necessity of kindness and communication in her art classes. Every day, I learned something new and made many friends as well. And even after I moved from Alabama to Georgia, Svetlana communicated with me and encouraged me to continue art lessons and sharpening my skills. Today I am a senior in high school pursuing animation and computer science at either UMichigan's Stamps School of Art or (maybe) Carnegie Mellon! I have won several Scholastic Gold/Silver Keys, become a finalist in Georgia's Governors Honors Program, and placed 3rd in the Congressional Art Competition. All these accomplishments began the moment I stepped foot into Svetlana's studio.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "103238140656776035727", "name": "Nancy Newstrand", "time": 1456284750351, "rating": 5.0, "text": "Svetlana is the best artist and art instructor I have ever met.  She is funny, kind, smart, and extremely creative.  I have taken dozens of very expensive art classes from different art institutions and I learned more and got out more from one of Svetlana's classes.  She taught me drawing, watercolor, soft pastels, oil pastels, acrylic painting, oil painting techniques, etc.  Good luck trying to find an art instructor who has master all these mediums.  I highly recommend Svetlana's classes and her services as a portrait artist.    I commissioned eight portraits from her and I was impressed by her talent and how fast she was delivering these portraits.  She will not disappoint.  -Nancy", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105888587584228405291", "name": "Lawrence Newman", "time": 1457807127985, "rating": 5.0, "text": "Our 10 year old daughter has been with ArtZone for 3 years now and absolutely loves it. She has learned so much in that short time, far more than her friends who have been taking elsewhere. Mrs. Svetlana takes the time to get to know her students and you can see that she really cares for each one as individuals and not just \"art students\".  Many people who see what our daughter has done in class are surprised at what she has done at such a young age in such a short time. I strongly recommend ArtZone to anyone but especially to those parents who are looking for a skilled art teacher who can teach their children with love, support and individualized attention.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "109636411564171888319", "name": "cs Jiang", "time": 1483225574064, "rating": 5.0, "text": "My two daughters really like the art class!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "100806818638825985662", "name": "Alexandra Flanders", "time": 1461894054304, "rating": 5.0, "text": "I have learned so much in the short time I have been doing art class! I have learned so many new ways to paint and sketch! I love taking art with Mrs. Svetlana!!! She is very talented and it is always a blast taking art from her! I have also learned some russian from her, which is really exciting! I love learning from her! She is a very spunky and fun!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "105945229425782718466", "name": "yf Hunt", "time": 1532144617087, "rating": 5.0, "text": "Great teacher, great art.", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "102218410619424959031", "name": "Correy_Shea", "time": 1454211104966, "rating": 5.0, "text": "Greatest art teacher on the planet!", "pics": null, "resp": null, "gmap_id": "0x88891f4bbc16dee3:0x67ec169c1bcd3c6"}
{"user_id": "107845617868753040981", "name": "Charlie Ray", "time": 1602696336371, "rating": 5.0, "text": "This is a wonderful small Huntsville history center full to the brim with one of a kind artifacts and historical memorabilia. The owners are kind and super fun to talk to. Please visit and look at all the art, history, and listen to stories about the people who really made and build Huntsville Alabama.", "pics": null, "resp": {"time": 1609090937416, "text": "Thank you so much! We appreciate your feedback and are so happy you enjoyed visiting the gallery and museum!"}, "gmap_id": "0x88626b2531aae03f:0x2d2760aee8024904"}
{"user_id": "118101458560208421765", "name": "Sandra Polizos", "time": 1580227291699, "rating": 5.0, "text": "Thank you to all the folks who make the Armory possible. As a presenting artist in the most recent show - one of the largest exhibits of local photography to be held in Montgomery - I thank you for the opportunity and for the professional way in which you all went above and beyond to help us bring this show to the public. Beyond that, I appreciate the growing list of arts education classes you’re providing to area artists of all ages. The Armory is a valuable arts-centered resource that serves all the citizens of Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888e819cdfcea959:0x5d0f74aab1a965eb"}
{"user_id": "117740723752246939998", "name": "Stephanie Barrett", "time": 1481260119400, "rating": 4.0, "text": "My children attended the Armory Learning Center. Now I go there to watch my grandchildren.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-9Gy-0khFdyGUQ1SF8KcJXKznd0KrIJiQvibK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e819cdfcea959:0x5d0f74aab1a965eb"}
{"user_id": "113095104818454949444", "name": "John Jackson", "time": 1583617376405, "rating": 5.0, "text": "Great facility for the performing arts!", "pics": null, "resp": null, "gmap_id": "0x888e819cdfcea959:0x5d0f74aab1a965eb"}
{"user_id": "107646678109058325237", "name": "Jan Mooney", "time": 1625145038239, "rating": 5.0, "text": "A wonderful little theater. And a wonderful night with friends.", "pics": null, "resp": null, "gmap_id": "0x88899094a1225c4d:0xdd1a9598659fe525"}
{"user_id": "106053543188615415743", "name": "Splurgie Walpurgie", "time": 1612495702695, "rating": 5.0, "text": "My buddy and me are takin guitar lessons here and absolutely love it. The most nicest and friendliest people I've ever met.", "pics": null, "resp": null, "gmap_id": "0x88899094a1225c4d:0xdd1a9598659fe525"}
{"user_id": "112250400505955763901", "name": "Kristin Jarvis", "time": 1484704508496, "rating": 5.0, "text": "Love this place. Our Visual Arts meetings are here and there is always a variety of classes going on.", "pics": null, "resp": null, "gmap_id": "0x88899094a1225c4d:0xdd1a9598659fe525"}
{"user_id": "109894631169783385349", "name": "Jason DeRamus", "time": 1474828865073, "rating": 5.0, "text": "Great place to learn music and art's", "pics": null, "resp": null, "gmap_id": "0x88899094a1225c4d:0xdd1a9598659fe525"}
{"user_id": "108550334933971866089", "name": "Kym Payne", "time": 1471103648907, "rating": 5.0, "text": "Gifted Staff", "pics": null, "resp": null, "gmap_id": "0x88899094a1225c4d:0xdd1a9598659fe525"}
{"user_id": "113236677859898331833", "name": "nike pooh", "time": 1620831949598, "rating": 2.0, "text": "Well when I use to go to that school there was this teacher named Ms.Thomas. Yes she can be nice sometimes, but when you are with her in classes you will say why im saying this. She is not patient with kids, not at all. Plus the stuff she be wearing is not professionl,and i hope she knows that. Its to tight and she is around kids. Hope this advice helps, because if she not going to follow the dress code why should the kids. But the best middle school I know is Northridge Middle, at least they are patient and have the teachers dressed properly.", "pics": null, "resp": null, "gmap_id": "0x8888a85fb2c7d221:0x2ce1b9daaffd24ce"}
{"user_id": "106140698280698303480", "name": "Kenneth Smith", "time": 1528847310652, "rating": 5.0, "text": "It's a beautiful place,if ONLY they could make the surrounding's look even better.alberta still needs major attention.it could be a great place to live.needs cleaning up.and in not kiddin Alberta could truly bring people to this area. Clean it up.put more restaurants around here.get these neighborhoods looking Better. Make the owner's of these abandoned properties to clean them up.or pay a major fine.i bet it stays clean around here.give children safe places to play.build it and they will come.", "pics": null, "resp": null, "gmap_id": "0x8888a85fb2c7d221:0x2ce1b9daaffd24ce"}
{"user_id": "111330288517077213147", "name": "India Lukas", "time": 1533585426608, "rating": 1.0, "text": "The experience was more than unpleasant. I can definitely tell when someone is trying to get a bad reaction out of me.  As I assess the situation further, I can only assume her intentions were bad from the beginning. No child should be taken from his/her classroom to another classroom without the parent knowing, especially since there was no problem.  I mean why go take my child from his class to yours? Then once I do formally meet you, all you have for me is shadiness and ill intent. My family expects professionalism first and foremost, not shadiness and ill intent. I honestly thought she was related to the bigots who wrongfully evicted us since we don't know her and she seemed to be reaching for my son. After about 2 months of her saying and having weird behavior towards us, I sent a letter of concern.  Anyhow, I told them about her calling my son clueless to our faces, I told them about her coming to the car to say hey and bye everyday just to slam my BMW door. I told them about her going the extra mile to buckle him in his seat belt in order to give the full effect that my son is clueless. I even expressed my concerns of another teacher grabbing his wrist as he proceeded to the car. I hand delivered the 2 copies to the school. I didn't hear back from the school all year regarding my concerns. Things got worse. Suddenly we became the bad people. Their behavior resembled that of a cult as they tried to make us as uncomfortable as possible. We were excluded from almost everything regarding the school. Except the times found out through social media, family, or friends. You should see the school pictures they sent home thinking we would purchase them. Perhaps it was a sick joke. We didn't know about Awards Day, we weren't told about Day with Dad. I showed up with cupcakes for Day with Dad bc we found out that morning and my husband didn't have time to request off. Well they tell me I should have gotten an ok from his teacher before bringing food. The thing is, where is the schools communication for my family?  Well, during the last week of school, we went to the school board and spoke with James Pope. Guess what? School starts in 2 days and we haven't heard back from them all summer. Not one phone call, Not one email. June 15th, they sent me a letter saying that he will be withdrawn from school on Friday, June 29th. Yet, they still have not responded to my letter of concern. Children can audition for this school regardless of where they live. Why can't my son also audition? As a black prestigious mother of 2 beautiful biracial children, I rub people the wrong way without even trying. I suppose they don't want the children at their school seeing black women with white men. It will surely give them ideas. Do Not Give In to the people who want to label all of us bad. Furthermore, I wouldn't dare give Julie Dunn the satisfaction to make me act less than prestigious. If I can hold my composure under these circumstances, I also expect my other prestigious black people to be just as mentally strong and not give in. This school is full of bad apples and they have \"Uncle Toms\" who stand behind them. They will Not do anything about Bullying either. I have friends who children also attend there and the school will not acknowledge these types of issues. New School, Bad Faculty!", "pics": null, "resp": null, "gmap_id": "0x8888a85fb2c7d221:0x2ce1b9daaffd24ce"}
{"user_id": "114497675791367947583", "name": "miracle vaughns", "time": 1500548791543, "rating": 5.0, "text": "The best school ever!!! I Want to go there this year I am 13 year old I'm talented I can sing, dance", "pics": null, "resp": null, "gmap_id": "0x8888a85fb2c7d221:0x2ce1b9daaffd24ce"}
{"user_id": "108216645342368680570", "name": "Felicia Langstaff", "time": 1524776410887, "rating": 1.0, "text": "I give this school one star although they don't deserve it because they have not earned them This is a horrible school my daughter's teacher is awesome but my daughter is constantly bullied and suspended she has learned nothing I asked for an IEP and they show no interest in it I have met with the principle and the assistant principle and they refuse to help my daughter in any kind of way she is a McKinney act student but she is not giving the proper education from the school  my daughter is not the only student being bullied at the school", "pics": null, "resp": null, "gmap_id": "0x8888a85fb2c7d221:0x2ce1b9daaffd24ce"}
{"user_id": "100454399895597679557", "name": "Leelee 4Eva", "time": 1555962598523, "rating": 5.0, "text": "GREAT", "pics": null, "resp": null, "gmap_id": "0x8888a85fb2c7d221:0x2ce1b9daaffd24ce"}
{"user_id": "111512603675819371300", "name": "Gary Anderson", "time": 1623943215478, "rating": 5.0, "text": "The Huntsville Art League has a gallery in studio 2013 in Lowe Mill in Huntsville, Alabama. The gallery is a great one-stop shop to find unique, handmade paintings, drawings, prints, woodworking, pottery, jewelry, and more. Joining the Huntsville Art League is an excellent way to become involved with Lowe Mill and the local art community.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMdR9nPRIIRfSZCyw2cbwOU3w2tG-NJgBchHmVK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPMWw6XBJp82mONC-xa__ei3-d2Y5vM8zu23WUW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFuzA6RpsHxXfovJSoS8yVRscBN-foecrXbC8k=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cb5f97eb105:0xa25407b0fa8da1a4"}
{"user_id": "102340500490811201607", "name": "Janet Page", "time": 1623814641695, "rating": 5.0, "text": "Wonderful selection of original art.", "pics": null, "resp": null, "gmap_id": "0x88626cb5f97eb105:0xa25407b0fa8da1a4"}
{"user_id": "114466211003809047009", "name": "Art League President", "time": 1558882378761, "rating": 5.0, "text": "HAL is an artists' cooperative.  Artists are given the opportunity to showcase their art in the popular Lowe Mill.  HAL is a \"must stop\" if you visit Lowe Mill.", "pics": null, "resp": null, "gmap_id": "0x88626cb5f97eb105:0xa25407b0fa8da1a4"}
{"user_id": "101228270433629603516", "name": "Daniel Minson Pucciariello", "time": 1538096266551, "rating": 5.0, "text": "The best host mom in the whole World. Also the best potter I know. She's just brilliant.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_atJ0rGeC8EkrISWROGAHnDsXLL0j2ILT5IVs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxl9fxGwT7ZAgVmT9FmfSqjA4-tTwwddmTgZTR=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2346d9ff9d29:0x2f562a2f0a70fb05"}
{"user_id": "104162125847600120256", "name": "Helena watson", "time": 1526240432276, "rating": 5.0, "text": "Best pottery Instructor in the tri county areas. Sharon is the Best and is a talented potter as well!!!", "pics": null, "resp": null, "gmap_id": "0x888c2346d9ff9d29:0x2f562a2f0a70fb05"}
{"user_id": "101235726112794527998", "name": "Matthew Chapman", "time": 1594392356936, "rating": 5.0, "text": "Great Gallery with a beautiful mix of art and gift items.  I unfortunately do not live local, but I have had the pleasure of visiting in person a few times. The owner and staff have always been extremely nice and helpful. The bulk of my purchases have been via phone & online, all orders have shipped prompt and carefully packed.", "pics": null, "resp": {"time": 1594393433073, "text": "Thank you so much Matthew! Thank you for supporting out small business and local artist!"}, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "102344530940123569473", "name": "Laura Wilson", "time": 1570462015035, "rating": 5.0, "text": "Four Seasons Gallery has some beautiful local art plus lots of unique  gifts for just\nabout everyone including pottery from Peter's Pottery and EttaB Pottery bith from Mississippi. The staff is always friendly and helpful. They even sell Twine a pure CBD oil.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOtdWx3FPPusUItH90yhZWlqHvyZGRuIiEHAWaq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNrHYQI5Dl-umoyC94USsrAG0Ljg_xsOfwm_yCj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUnU2r4hSZxdTZSrObjeARkGoSlX5lejgI5WhB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5tS7sTm_xfA4iejn0Si9w_5tx5rKvA3rJHsYL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWyrdpsP29QDEXccCsm-O4WIXtZ4XKXdmTJgZ6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMI3LCIM0uAbbW9-HAoj9YvrZPdljkcR9Ry7wqN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "114440752571598228400", "name": "Melanie Messer", "time": 1571064877201, "rating": 5.0, "text": "I love this place. Great place to find unique gifts for family & friends & the owner & staff are always very helpful. Go check it out!", "pics": null, "resp": {"time": 1571070131512, "text": "Thank you Melanie for the lovely review. I'm happy to know you love shopping at Four Seasons Gallery!"}, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "110259848055947670706", "name": "Tish Weaster", "time": 1563923776198, "rating": 5.0, "text": "Love their presentation and items.   They are helpful without being pushy.  Lovely place for unusual gifts.", "pics": null, "resp": {"time": 1571070303109, "text": "Thank you Tish. So glad we could be helpful."}, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "117416155803327130717", "name": "Julia Peart", "time": 1558753538157, "rating": 5.0, "text": "Great art and gift gallery! Lots of neat items, jewelry and gorgeous paintings...sweet ladies to help you too!", "pics": null, "resp": null, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "116000666929995139166", "name": "Sylvia N.", "time": 1564171451040, "rating": 5.0, "text": "Top Shelf customer service helps you find the perfect, unique gift for the one you love who has everything.", "pics": null, "resp": {"time": 1571070228355, "text": "Thank you for the great review. You are a wonderful customer."}, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "111539445591518033938", "name": "Stuart Lee", "time": 1526065064493, "rating": 5.0, "text": "Great place! Owner and staff are so nice and very knowledgeable. Lots of unique art and season items. Check out the website. It is very up to date.", "pics": null, "resp": null, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "107154821988916377863", "name": "Andrea von Herrmann", "time": 1555368761453, "rating": 5.0, "text": "Love all of the offerings and the people who help. So kind and helpful with great ideas.", "pics": null, "resp": null, "gmap_id": "0x88891964d4d3bbb5:0x5a51951a2f30ec69"}
{"user_id": "108897351806030110085", "name": "Ed Watkins", "time": 1621125865830, "rating": 5.0, "text": "ARRAC has a Bluegrass jam session every 1st Saturday from 9am -12Noon.", "pics": null, "resp": null, "gmap_id": "0x888c26e6b2899bcf:0x385fa401366ff622"}
{"user_id": "100814533666444321530", "name": "Dorothy Priest", "time": 1617056577673, "rating": 5.0, "text": "Nice arts center with talented instructors", "pics": null, "resp": null, "gmap_id": "0x888c26e6b2899bcf:0x385fa401366ff622"}
