{"user_id": "103112979305482451307", "name": "Heidi Hanchey", "time": 1619750289530, "rating": 5.0, "text": "Super nice owner. She was very patience and helpful with all my questions.", "pics": null, "resp": {"time": 1619779922136, "text": "I really appreciate your comments.  It was a pleasure serving you.\nJan"}, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "106160367973957142475", "name": "stephen greer", "time": 1599875798377, "rating": 5.0, "text": "Really great local art store. They have  a great selection of art supplies and a lot of local art for sale. I have always had a friendly smile greet me and great conversation. Thank you for everything.", "pics": null, "resp": {"time": 1599905848999, "text": "Thanks for the great comments.  I always have said we actually like each other in Foley.  It’s always a pleasure to talk to people."}, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "111944629297253457062", "name": "Melody Carroll", "time": 1577992836800, "rating": 5.0, "text": "We are from Indy. We had never been in this shop before and it was one of the best experiences I have had in the 20+ years of coming to Foley. The owner was amazing and very informative. I picked her brain about a lot of art mediums and learned so much. Bought some beautiful local art.  It is cash or check only but it's worth it!", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "115030140335552268226", "name": "Ron Carlson", "time": 1582314341445, "rating": 5.0, "text": "Thanks Jan had a great time learning more. Hope to be back next year. I learn more every time I am at one of your classes.", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "113035107445205837007", "name": "Johnny Wood", "time": 1580935065418, "rating": 5.0, "text": "Very friendly shop with lots of nice things. Will definitely shop there again.", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "102232681180942707028", "name": "Ron Carlson", "time": 1582240283366, "rating": 5.0, "text": "Very nice friendly great store wonderful teacher. Thanks Jan for helping with my ink drawings I always learn just a little more every year. I hope to be back", "pics": null, "resp": {"time": 1550065058699, "text": "Thank you.  It means a lot to know that\nI’m making a difference."}, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "116658192539177671952", "name": "Tammy Nance", "time": 1472344394809, "rating": 5.0, "text": "Great supplier of quality art products.\nClean convenient location.\nPlenty of cool, local art for sale.\nGreat prices.\nKind helpful staff.", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "108784344730118071613", "name": "Ronda Watts", "time": 1483100315011, "rating": 5.0, "text": "My daughter takes art classes with Jan at Jan's Art Studio and absolutely loves it!\nJan is extremely patient, thorough and cares about her students.\nI enjoy taking in all of the unique art pieces in her studio,  from one of a kind pottery, paintings and even jewelry!", "pics": null, "resp": null, "gmap_id": "0x889a0e0fab9e23fd:0xb3e6c47b493dc5fb"}
{"user_id": "110842724066385457819", "name": "Kelly Teat Sewell", "time": 1602716361896, "rating": 5.0, "text": "ART of Alabama did a fantastic job caring for and protecting all of my family's artwork and photos (even a few stuffed animals)following a house fire. Heather and her team were top notch, professional and thorough. They cared for our personal items as if they were their own.  Couldn't ask for better, more meticulous care.", "pics": null, "resp": {"time": 1608737778070, "text": "Mrs. Sewell, Happy Holidays and THANK YOU for allowing us the opportunity to recover your precious family artwork and photographs! We hope you have settled back into your home comfortably with your family just in time for the holidays. Wishing you all the best and brightest!"}, "gmap_id": "0x888e91aca98f5533:0xdd384c36e88694e"}
{"user_id": "107508609737426795593", "name": "Lisa Fisher", "time": 1594740568519, "rating": 5.0, "text": "I am very pleased with the restoration work performed by ART. Heather took my mother's pastel portrait which had fallen and been damaged as well as the pigments scattered about her face and repaired it beyond my expectations. The pastel portrait as well as the glass and frame restoration are  perfect. I am very impressed and overjoyed to see the finished portrait restoration.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_U2JI86Z1q-e1lK2mnFqe64tgw7NkYwASpDyd=w150-h150-k-no-p"]}], "resp": {"time": 1594765564392, "text": "It was a real joy to bring the portrait of your mother back to its original beauty, and to place into a new frame that really captures the aesthetic of the original frame with a fresh and elegant design. So happy we could return her to you to enjoy many more years with your family."}, "gmap_id": "0x888e91aca98f5533:0xdd384c36e88694e"}
{"user_id": "116242307062421321585", "name": "Pinnacle Realty", "time": 1597682042865, "rating": 5.0, "text": "They are the only place in Alabama that can restore art or any sentimental items as well as Electronics. They take great care of your belongings", "pics": null, "resp": null, "gmap_id": "0x888e91aca98f5533:0xdd384c36e88694e"}
{"user_id": "106969690481602349493", "name": "Tim Wohlers", "time": 1601142151435, "rating": 5.0, "text": "Very well organized, and focused on customer satisfaction.", "pics": null, "resp": {"time": 1608737971247, "text": "Thanks Tim! We are absolutely focused on our customers and their precious family heirlooms, art, collectibles and keepsakes. We appreciate the recognition and we appreciate your business!"}, "gmap_id": "0x888e91aca98f5533:0xdd384c36e88694e"}
