{"user_id": "100731115618587789565", "name": "Gregory Grimes", "time": 1579083534776, "rating": 5.0, "text": "Amazing Local Shop. Incredibly friendly staff. Talented Decorators, I love it all the way around.", "pics": null, "resp": null, "gmap_id": "0x889a413a2de26acd:0xeb69ce4755564f41"}
{"user_id": "101102448139467666953", "name": "Tom Aiken", "time": 1556403640802, "rating": 5.0, "text": "Savannah Starring is lightening in a bottle.  Entire staff has tremendous experience.  You will not go wrong working with them.", "pics": null, "resp": null, "gmap_id": "0x889a413a2de26acd:0xeb69ce4755564f41"}
{"user_id": "108287941463956135519", "name": "Richard Kiefl", "time": 1580506226368, "rating": 5.0, "text": "Great selection of goods with very impressive assistance.!", "pics": null, "resp": null, "gmap_id": "0x889a413a2de26acd:0xeb69ce4755564f41"}
{"user_id": "109415096527066151347", "name": "RMartin Choate", "time": 1575601093720, "rating": 5.0, "text": "Great folks and delightful shoppe right in the middle of DT Fairhope!", "pics": null, "resp": null, "gmap_id": "0x889a413a2de26acd:0xeb69ce4755564f41"}
{"user_id": "110221891347477563607", "name": "Bradley Dortch", "time": 1619968995241, "rating": 5.0, "text": "Love this store and all of its staff!! I frequent the store several times a month and everyone is always so welcoming and extremely helpful each and every time that I’m looking for pieces to decorate my home with. If your looking for quality pieces, tons of selections, the friendliest staff then look no further than Stock & Trade. I’m definitely a customer for life!!", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "113582364432317960357", "name": "Jessica Bahouth", "time": 1610632620056, "rating": 5.0, "text": "We love Stock and Trade. The customer service is incredible. We work with a particular fabulous consultant, John, who has helped us elevate the look of our home. He is very knowledgeable and has wonderful taste. The entire staff is wonderful and friendly. I didnt feel pressured or hovered over. The prices are fair and the inventory is beautiful. John truly goes above and beyond to make sure we get exactly what we want. Even if he has to order it! wish I could give them 6 stars!", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "110981665427815592041", "name": "Denise Upton", "time": 1612305395514, "rating": 5.0, "text": "John Herrington Interior Designer for Stock and Trade helped me redecorate my condo in Orange Beach. He does an awesome job and is great with mixing colors and accessories. He also helped me decide on a rug for my living room as well as new decorative pillows and a new coffee table. He is excellent to work with, makes quick and accurate decisions and responded to my phone calls or texts. I have used his decor services before Stock and Trade and will use him again in the future. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "103545695784376443294", "name": "Candace Thompson", "time": 1610394228683, "rating": 5.0, "text": "Stock and Trade is by far my favorite spot to purchase for my personal home and for my Designing Company. Sales Associate John Herrington is so amazing to deal with, he goes above and beyond to find what I’m looking for and helps me put things together for the perfect look. I can’t say enough wonderful things about this place. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "104116224405822523805", "name": "Pam Breedlove", "time": 1612805320273, "rating": 5.0, "text": "What a fabulous find! A friend told me about the store so I decided to come and look for accessories for our beach house. I was pleasantly surprised to find such a well designed space with beautiful options. The vignettes were well thought out and appointed; a much more sophisticated look than the Destin store. While shopping I found out that John Herrington was responsible! He had helped me at his old job with an apartment for our son in Los Angeles. Great eye and sincere service. Plan to be back at this store to work with John on our future projects!", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "107142959202179687902", "name": "Sheena Mincy", "time": 1610576945983, "rating": 5.0, "text": "My husband and I came into Stock & Trade after loosing our home in Hurricane Sally. From the moment we entered the store, the service we received was incredible. We explained our situation to John [Herrington] and he went above and beyond to help us make our house into a home again. John’s knowledge of interior decorating is second to none. He’s now one of our trusted friends and continues to follow up w/ our family.\nWe’ve been back to the store a number of times, since our initial visit and everyone there has been extremely helpful and welcoming. Especially, when we bring our 5 y/o. Karley is always great about playing with her.\nS&T is definitely our go to for home furnishings!", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "111809974119152252650", "name": "Jason Lawrence", "time": 1610224663584, "rating": 1.0, "text": "The kind of customer service that makes you cringe.\n\nEdit:  Nah I am good, no need to reach out to you, I walked in the store last week. I said I was just looking, I was asked 5x before we left if we needed help finding things and many times sales was trying to strike up conversation.  Just looking means that I want to look and not be harassed.", "pics": null, "resp": {"time": 1610219283910, "text": "Jason, We hate to see this.  Could you please call or send more details about your experience to SpanishFort@StockandTrade.com.  Thank you!"}, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "114017201432636781863", "name": "Kalyn Miller", "time": 1610837342393, "rating": 5.0, "text": "This team is amazing! They make you feel comfortable in the store and goes above and beyond to help you create a beautiful space!!", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "110169110083199494069", "name": "Gerald Smith", "time": 1617275140470, "rating": 1.0, "text": "My wife and I visited this store Tuesday March 30 at 1:00pm. Strolled through the entire store without not one hello from any employee.\nI don't understand why you would spend so much money on advertising to get floor traffic when you don't even acknowledge a potential customer?", "pics": null, "resp": {"time": 1617372336577, "text": "Gerald,\nWe hate to hear about this experience.  We are looking at video to see where the breakdown occurred because that is not typical.   We do provide a non-pressure environment and received a complaint just last week from a customer because he felt we asked if he had any questions or needed any assistance too many times in his opinion, but in this case low pressure was taken too far.   If you could provide any more details via email to support@stockandtrade.com so that we can look into it further would be greatly appreciated.  I sincerely apologize and hope that you will give us another chance to show you what we have to offer."}, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "117109916833827881649", "name": "Addison Williams", "time": 1602776168730, "rating": 5.0, "text": "Beautiful store and friendly staff", "pics": null, "resp": null, "gmap_id": "0x889a6989a9bbe5c7:0xf823dea92267673c"}
{"user_id": "116603883793445659769", "name": "Elisabeth Wells", "time": 1606600455076, "rating": 5.0, "text": "Always a delight to shop here. Best, most unique things, hand picked by a woman of excellence taste.", "pics": null, "resp": null, "gmap_id": "0x889a4df0c925228b:0xb57854696dd505ab"}
{"user_id": "104750463047857326821", "name": "Vera Ringold", "time": 1579670607165, "rating": 5.0, "text": "BEAUTIFUL furniture and accent items.", "pics": null, "resp": null, "gmap_id": "0x889a4df0c925228b:0xb57854696dd505ab"}
{"user_id": "115993744407189671026", "name": "Francis Brown", "time": 1556134740697, "rating": 5.0, "text": "Different and unique pieces of furniture and accessories.", "pics": null, "resp": null, "gmap_id": "0x889a4df0c925228b:0xb57854696dd505ab"}
{"user_id": "107518830114998563835", "name": "Monique Martin", "time": 1518652226968, "rating": 4.0, "text": "Great selection for home furniture", "pics": null, "resp": null, "gmap_id": "0x889a4df0c925228b:0xb57854696dd505ab"}
