{"user_id": "108893086087538356325", "name": "Melody Murray Zaragoza", "time": 1483047431346, "rating": 5.0, "text": "Lovely Assited Living facility. Great staff. Clean.", "pics": null, "resp": null, "gmap_id": "0x88628b119284a0e3:0x718c539d79511850"}
{"user_id": "108893086087538356325", "name": "Melody Murray Zaragoza", "time": 1483047431346, "rating": 5.0, "text": "Lovely Assited Living facility. Great staff. Clean.", "pics": null, "resp": null, "gmap_id": "0x88628b119284a0e3:0x718c539d79511850"}
{"user_id": "108893086087538356325", "name": "Melody Murray Zaragoza", "time": 1483047431346, "rating": 5.0, "text": "Lovely Assited Living facility. Great staff. Clean.", "pics": null, "resp": null, "gmap_id": "0x88628b119284a0e3:0x718c539d79511850"}
{"user_id": "108893086087538356325", "name": "Melody Murray Zaragoza", "time": 1483047431346, "rating": 5.0, "text": "Lovely Assited Living facility. Great staff. Clean.", "pics": null, "resp": null, "gmap_id": "0x88628b119284a0e3:0x718c539d79511850"}
{"user_id": "111425778028413505356", "name": "Christopher Taylor", "time": 1619570797001, "rating": 1.0, "text": "The administrator Corey Davis is lazy, unprofessional and, untrustworthy. The staff and facility is fine, but Corey does not follow through with what he's supposed to do.", "pics": null, "resp": null, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "116267223782679943735", "name": "NETTIE WILLIAMS", "time": 1614721437140, "rating": 5.0, "text": "I reviewed the pictures of the Belmont Assistant Living , the rooms the kitchen the dining rooms. This is a beautiful place.", "pics": null, "resp": {"time": 1614722287391, "text": "Thank you. We just completed a renovation about a year ago. We are converting building 2 to a memory care facility to meet the the needs of the area."}, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1548030223541, "rating": 3.0, "text": "I’d recommend this place specifically because of Crystal.  She’s an angel and was there for me when I was struggling to find a good, safe, affordable, friendly place for my ailing mother.  Miss Anita took her right in, and they all tended to her needs for me.  They treat them like family.  But your aging parent is going to complain, so don’t be alarmed.  It’s hard to feel truly good about any place you put them in, it broke my heart every day. But we could not have mom live in our home, as it was not set up well for that.   Mom only lived there three months and then she passed away, but it was handled very professionally.    I was my mother’s only child and only area relative so I went there regularly to visit and check on her. But the thing that bothered and really hurt me was that after she died, no one there, and there was a lot of staff that tended to her, sent me a condolence card or called me, except for Crystal, Bless her heart.  AND 2 days before she died she had me give all the staff candy for Christmas.    I felt like the warmth and friendliness was ONLY as good as them getting their  monthly paycheck, even though mom died with several days left on a paid full month of rent. Very disturbing.", "pics": null, "resp": {"time": 1579366718616, "text": "We are the new owners of Belmont we would love for you come see us and possibly write a better review. Thank you and God bless."}, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "105710526040193657873", "name": "MaeMellis Kilough", "time": 1583628363300, "rating": 5.0, "text": "Great staff and great place! I totally recommend putting your love ones here! It is a lovely place!", "pics": null, "resp": null, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "109748824414870264088", "name": "brittany wiilliams", "time": 1584373223779, "rating": 1.0, "text": "Not a good place to choose for work staff is very unprofessional and visible discrimination wouldn’t recommend unless you are not of African descent", "pics": null, "resp": {"time": 1584382384065, "text": "I am sorry how you are feeling, but we bought Belmont in July of 2019 and we haven't had you as an employee. So I'm not sure what you could be speaking about. We treat all of the team at Belmont with nothing but respect and dignity. If you would like you can give me a call @ 334-356-3931. Would love to speak to you about your feelings. We currently have 21 staff members and 18 of them are African American. So that is 86%. Try and have a good day."}, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "104846327964466366392", "name": "Lisa Worth", "time": 1491763202185, "rating": 5.0, "text": "Wonderful \"at home\" atmosphere let's the residents maintain their independence in a safe, friendly environment! Helpful, respectful staff around the clock to assist your loved ones with activities of daily living.", "pics": null, "resp": null, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "116507713312302887674", "name": "Sherry White", "time": 1572992114731, "rating": 5.0, "text": "Caring, attentive and friendly staff", "pics": null, "resp": {"time": 1573001347713, "text": "Thank you Sherry! We appreciate your feedback and are pleased to share your comments with our staff."}, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "101082806050809868241", "name": "Angelicia Johnson", "time": 1482237899220, "rating": 1.0, "text": "Staff is very unprofessional and messy and the poor residents are not being taken care of properly please dont put your love ones in this facility my experience was awful", "pics": null, "resp": {"time": 1579366688230, "text": "We are the new owners of Belmont we would love for you come see us and possibly write a better review. Thank you and God bless."}, "gmap_id": "0x888c2c0f8ccef213:0x584abf4ec98b0c32"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1548007173729, "rating": 1.0, "text": "At first I would’ve thought this was the perfect place, the marketing director is wonderful. But then she had us sit down to sign the contract with the administrator. I told her my mother was able to get around OK but she was confined to oxygen 24/7. All I wanted was someone to bring her her meals in her room and we would pay more for that privilege. The administrator said ,and I quote, “we’re not going to baby her!”   I looked in my husband and said that’s it we’re done with this place! I was not going to have someone tell me you’re not going to baby my mother, because I babied my mother! And I expected it if I was going to pay for it!\nTherefore, I have no clue what it’s like for a resident to live there so I can’t comment on that.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "107681740401300629704", "name": "Coretha Slayton", "time": 1531427365321, "rating": 5.0, "text": "I highly recommend Country Cottage for those that want Senior Living with a home like feel for their loved one. Michelle Kelley is a great a person to work with and has a heart of gold. She also has a lot of wisdom and experience with Administrative.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "103789845991846699828", "name": "Heather Thornton", "time": 1486555234353, "rating": 5.0, "text": "My grandmother has been at Country Cottage for almost a year. We love the staff and the care she receives. I would highly recommend this facility to anyone looking for an assisted living.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "107398066188856773459", "name": "Brooke Fisher", "time": 1520909323106, "rating": 1.0, "text": "What you see here is not what it is like behind closed doors. Poor management, most employee's do not care one bit about the resadent. I have personally witnessed someone refuse water to someone just so they wouldnt have to change there bed. One of many things trust me.", "pics": null, "resp": {"time": 1526049252544, "text": "Brooke, our top priority is quality care that exceeds our residents' expectations. We are truly sorry this is not what you experienced and would love the opportunity to speak with you to learn more. Please call us at 256-536-5992 or email us at info@cottageassistedliving.com."}, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "104245868676692103712", "name": "Elizabeth Guthrie", "time": 1364922757185, "rating": 2.0, "text": "This facility provides the worst care possible.  My mother was there almost 2 months and was never provided help with shower.  So the only way she could be clean was to wash up in the sink in the bathroom on her own.  The food served was cold more than not and did not taste good.  The aides told me and my Mother on many occasions they did not know how to help with the oxygen - they were new.  One aide tried to give her someone else's medicine.  Thanks goodness my Mother was alert and knew that the meds were not hers.  After multiple meetings with the administrator we made a decision to move my Mother to another facility because the care was so terrible.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "106564334720078778873", "name": "Lynn Johnson", "time": 1545352820986, "rating": 1.0, "text": "When a employee has to rate their work place to increase the ratings- SHAME ON YOU! It screams there is issues, covering up.Never been there and will not because of that alone.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "109354399363946888778", "name": "Michelle Kelley", "time": 1486507921840, "rating": 5.0, "text": "Beautiful property with loving and caring staff!!", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "106408089518527283801", "name": "Trina Vines", "time": 1629923754573, "rating": 5.0, "text": "What an incredible place to live and work !!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "104575751116350075512", "name": "Holly Hendon", "time": 1594654504069, "rating": 5.0, "text": "The staff at Saint Martins are some of the kindest most compassionate people I’ve ever met. My father was very well taken care of the three days he was there. Thanks to Saint Martins I was able to sit with my dad while he passed even through the Covid Pandemic. I am very thankful these women helped me through my fathers last days.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "108399484139241757534", "name": "Joe Watts", "time": 1577482084583, "rating": 2.0, "text": "Rating the Independent Living facility from 3 years ago, I would give it 5 stars. My mother-in-law was in the independent living for 2 months and it was everything we had hoped it would be.\n\nAfter falling and breaking a hip, she went to the rehab side. It was like night and day. They were very understaffed. They would take 30 minutes to answer the call button when we were there. They would place the call button on the opposite side of the room in an unreachable location when we weren't there. They were told of this and we would leave notes explaining that she couldn't reach it. They continued to do it until we had her transferred to another location. I would give them 0 stars if possible. Locations like this seem to change regularly, so note that this is a review of the situation from 3 years ago. Everyone agreed that the food was always good, though....but the care itself left a lot to be desired.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "104286523305506329040", "name": "Al Rhoney", "time": 1550437645619, "rating": 5.0, "text": "This morning, I brought my wife and 3 other very close friends of a man whose been admitted here for end-of-life care. My immediate impression was very favorable. It was clean and quiet, with no \"sanitary cleaning\" odor. Upon entering one of the staff saw me and asked if she could help. She told me where we had to sign in and what Suite our friend was in. As we walked to his room,  his  nurse introduced himself and told us a bit the kind of care he was receiving and told us he  was available for any questions. Our friends room was very clean and neat. The lighting  was very comfortable and welcoming. We spoke with 4 staff members besides our friends nurse. Every one of them were very pleasant and offered their help, for anything we needed. I noticed a number of \"little things\" that had been done to help keep our friend comfortable. Things that I'm positive are helping him remain as comfortable as possible in his condition and demonstrate a deep level of genuine caring attitude from the nurses and staff. If I ever have a need to place a family member in an end-of-life Hospice Care facility, I would not hesitate to use St. Martin's in the Pines.", "pics": null, "resp": {"time": 1550454215021, "text": "Such kind words. Thank you for sharing."}, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "103844497160510448675", "name": "Mike Baswell", "time": 1584457219355, "rating": 4.0, "text": "We were very pleased with our experience at St. Martin’s in the Pines. Our family member entered via the Skilled Nursing unit and then graduated to Assisted Living.  Their services were critical to helping her to recover and return to Independent Living.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "102778511206249646058", "name": "Jeff Williams", "time": 1533069114368, "rating": 1.0, "text": "My Grandmother was a resident there several years ago. She received so-so care. Some of the employees were very nice and helpful, but a lot were just lazy. The woman in charge (I'll update if I can remember her name) is a liar. She would tell us what we wanted to hear, not the truth. The doctor that sees the residents is just a puppet for the the administrators. He does not look out for his patients. They sent my grandmother to the hospital for an evaluation and and once she was away, they used a loop-hole to evict her. Even though she passed the evaluation, was still independent and could function with minimal care. If you choose St Martin's, be sure to check on your loved ones often. I'm sure there are worse places out there, but there are better ones also. Note: This was several years ago so hopefully some of the same employees don't work there anymore.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "109774300742549159109", "name": "Naomi Goodwin", "time": 1510162286398, "rating": 5.0, "text": "I am the Assistant Director of Nursing at St. Martin's in the Pines. Working at St. Martins in the Pines has been a outstanding experience. This is a faith based campus with a very positive environment. There are so many great people working here and we all are like family here. The customer service and patient care is outstanding. We have some really great elder's and families that reside at our campus here at St. Martin's in the Pines. This campus has so much to offer such as rehab, long term care in our cottages, many levels of assisted living, and several levels of apartments The food here is outstanding.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "112404592040666698699", "name": "Kywanniee Stuckey", "time": 1510319490767, "rating": 5.0, "text": "St. Martin's is a great faith based and tight knit community. There is such a friendly atmosphere around the entire campus. The elders and their families are the greatest joy and blessing to be able to care for. Our pastoral team is remarkable; they keep the community grounded in faith and positivity! Not to forget, the food is amazing!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "111174111817726366316", "name": "Tina Hawkins", "time": 1565199650270, "rating": 2.0, "text": "Im so disgusted with management and how i was treated in the end. You should feel safe coming to work and free from harassment, but no one did anything to deal with an issue that happened my last day. It was a nice place to work until that point!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "102955683232783403051", "name": "Foleca Swain", "time": 1510322642078, "rating": 5.0, "text": "I first want to thank God for blessing me with this career @ St. Martin's in the Pines as MDS Coordinator. I could have been many places closer to home, but was chosen to drive a few minutes further. This was the best decision in my life, I have great administration, co-workers & most of all great Elders & sponsors. Thank you God for blessing me with the best last.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "111878665003457205700", "name": "Anica McDonald", "time": 1510148828604, "rating": 5.0, "text": "There is a reason why St. Martin's in the Pines has been around for over 60 years. Their commitment to excellent patient care along with genuine love towards the elders on the campus is why I am excited to come to work everyday. Faith is the foundation of who we are and that in itself speaks volumes. Come take a tour and see for yourself!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "110466141906933223821", "name": "Lee Nocella", "time": 1465229956762, "rating": 1.0, "text": "The quality of care at St. Martin's is inconsistent.  Most people there are very nice and helpful.  The food is also very good.  However, my elderly sister approached a group of employees at the nursing station for help with her husband who was in the rehab facility recovering from surgery.    They didn't answer the call light earlier and he needed to use the restroom. They were unwilling to help and told her they weren't \"trained\" for that.  They had been helping him prior to that as it was part of his rehabilitation not to mention his dignity.  My sister was offered absolutely no assistance and had to help him herself.   I called the nurses desk to get her some help and the person who answered didn't even bother saying hello but held the phone up in the air for a moment before hanging up on me.  They must not be trained to use the phone either.  Then, as we were leaving after an afternoon visit, the director of nursing came out to the parking lot and had a very non-hipaa compliant conference with us about my family member's care outside in the open in front of whoever happened to be walking by.  She tried to rationalize why the employees there would not offer to help my family member.  I was embarrassed for her and walked off.  My sister needed help.  Not one employee offered to assist her.  Any prudent compassionate person in a similar situation would have helped.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "108732677659692263957", "name": "Sherryll White", "time": 1538700992484, "rating": 2.0, "text": "Sounds like workers like to be there, the families of loved ones not so impressed. My MIL was there for rehab and the experience was not pleasant. Dirty, run down rooms, so so staff. They lost her pj's and eventually started to ignore her. Sept 2017.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "108128273737139520720", "name": "nicole boomhover", "time": 1502147730384, "rating": 5.0, "text": "St. Martin's is a great place to work! There is a friendly atmosphere on campus and the staff truly cares about the loved ones and residents. Come take a tour and see for yourself!", "pics": null, "resp": {"time": 1503090018223, "text": "Thank you for your dedication to St. Martin's. We are so glad you enjoy working here!"}, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114498263291322427617", "name": "Cassandra Clark", "time": 1510357180609, "rating": 5.0, "text": "St.Martins in the Pines is a great place to work. I am the Director of Social Services. Everyone is so friendly. Our elders and patients Rule!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "107813472089184034477", "name": "Susan Melvin", "time": 1539713552055, "rating": 5.0, "text": "A great place to work. Everyone is treated like family and they care deeply for their employees.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114805324909529605960", "name": "Steven S", "time": 1548946427955, "rating": 5.0, "text": "A very good retirement community. Clean, nice and good location.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "117974373250762583432", "name": "micki082", "time": 1560031230994, "rating": 1.0, "text": "EDITED!! Since posting this review, I've had a few lengthy conversations with a couple of the \"head\" personnel  at St Martin's. We have come to a mutual agreement and I am satisfied with the outcome. I am NOT removing or changing anything in my initial review, so one must proceed with care and make sure EVERYTHING is explained to you in its entirety.   ORIGINAL REVIEW: This is a LONG read, if I could rate with less than 1 star, I would, but this NEEDS to be shared!!! NEVER USE ST MARTIN'S FOR IN HOME CARE!!!!!!! I recently had to have major back surgery, and as I have no local family, I opted to use St Martin's \"in home care\".  I have NEVER used this type of service EVER, and I must say I was COMPLETELY taken advantage of and the service was HORRENDOUS . Because, I had never used this service,  I had hoped that they would understand my needs and assist me in setting this up. Oh they SET ME UP all right.  TWENTY FOUR HOUR SERVICE, even while I was in the hospital for TWO weeks.  The hospital did not let them do ANYTHING. (Hospital policy), so ALL they could do was SIT there, maybe assist in putting on those \"stupid hospital socks\" , cover me when I got chilled and uncover me when I warmed up. I had NO idea that I could PICK AND CHOOSE when I needed them. I was left with the impression that once I started their service, that I was STUCK with them until I was released by the surgeon.\nI KNEW that I would need help once I returned home, but NOT 3- 8 hour shifts. I was in the hospital almost 2 weeks and during that time the program manager was to set up my in home care. I informed her that I did NOT want a parade of different faces coming into my home. TWO WEEKS, she had to get a \"team\" put together. THIS DID NOT HAPPEN!!! When I returned home; A DIFFERENT person almost every day AND some shifts not even covered. How could I heal, if I had to STRESS every day about my care?? This is MY home, I was not capable of moving around, so I couldn't very well see what was happening around my home. The 11pm till 7 am shift was the WORST! I did NOT require anyone to WATCH me while I slept, so I PAID A LOT OF MONEY for these sitters to SLEEP, WATCH TV, AND TALK/PLAY ON THEIR CELL PHONES while I slept.\nI know that the sitters were supposed to be bonded/insured, BUT how did I know things weren't moving out of my house. YES, I have trust issues with strangers, but that is NOT the point. The POINT IS... The \"Care At Home\" program is NOT SET UP CORRECTLY, THE PROGRAM MANAGER IS OBVIOUSLY NOT WELL TRAINED IN HER DUTIES,( I heard that she hasn't been doing this long)  AND I, THE CLIENT,  feel TOTALLY abused and \"taken for a MONEY ride\".\nI could rant on & on, but I AM DONE!! I truly hope that this review opens up some eyes at St Martin's AND future clients.  <1 star!! HORRIBLE! NO EXCUSE!!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114569656138292968634", "name": "Vontricia Prewitt", "time": 1516556918992, "rating": 1.0, "text": "I hate this place for my granny. They need to be fired. Every last one of them on 2nd and 3rd shift.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114805324909529605960", "name": "Steven S", "time": 1548946427955, "rating": 5.0, "text": "A very good retirement community. Clean, nice and good location.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "102786413455361026301", "name": "cara vaughan", "time": 1504976741189, "rating": 1.0, "text": "If I could give less than 1 star I would. This was 6 months of HELL!!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "117833648205846702894", "name": "Teresa Harris", "time": 1606621583287, "rating": 5.0, "text": "The staff here are so helpful and caring. It has always been clean when I've been here.  Absolutely no smells, unlike other places.  Love the decor. Everyone makes you feel so welcome.", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "114832751203125831299", "name": "Lisa Maldonado", "time": 1547578434984, "rating": 5.0, "text": "Wonderful place! You're loved ones will be very well taken care of. Great people!", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "105603673907432150605", "name": "Wendy Scott Sherman", "time": 1570280972239, "rating": 1.0, "text": "Terrible place! Nasty kitchen, nasty rooms, reeks of urine in most the bathrooms in clients rooms, accidents get covered up, the building is in horrible shape, never any cleaning supplies. Don't put your loved ones there!", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "107631572583430928917", "name": "Alabama Jenny", "time": 1557627131188, "rating": 5.0, "text": "Clean and caring staff. My father has been there for three years. A gem of a place in Oneonta.", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "105713022822377469852", "name": "Paula Price", "time": 1548761023106, "rating": 5.0, "text": "Very nice people.  Assisted Living Home and they treat my Mom well.", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "111396420797764732239", "name": "Windy House", "time": 1559471104648, "rating": 1.0, "text": "Employees treat the residents very wronge.Dont puyur loved ones here.", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "106608905169167796472", "name": "Patricia Brown", "time": 1545778867431, "rating": 5.0, "text": "This place is amazing! The people go above and beyond to help and take care of their residents.", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "109195362325271834552", "name": "Ken Watkins", "time": 1560806428326, "rating": 5.0, "text": "Friendly Staff, Clean, Good Security.", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "109344205344508605738", "name": "Stephanie Garcia", "time": 1556425707795, "rating": 2.0, "text": "The staff is awesome", "pics": null, "resp": null, "gmap_id": "0x888990f9e63b4a39:0xbce6fdb7c3592b43"}
{"user_id": "105964386521290575523", "name": "careyholman", "time": 1577980174985, "rating": 5.0, "text": "Lakeview was our first experience with long term care.  We didn't know any better and based on our sample of one, we thought they were average.  Boy, were we wrong!!  Since then we've had experience with a couple of other facilities, and by comparison, they highlight just how wonderful Lakeview is.  Their staff is experience and kind.  They genuinely cared for my mother.  The facility isn't the most beautiful from the outside, but inside -- the parts that actually matter to the residents -- it's nicely decorated, beautifully clean, and the view of the lake is soothing.  Camaraderie among the residents is heartwarming.  They genuinely care for one another.  You don't find that just everywhere.  I highly recommend Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108403104071762033789", "name": "Moose Doyle", "time": 1531839564142, "rating": 5.0, "text": "My mother is treated with kindness and patience. I'm so glad that the staff has tried to get to know mom and her special ways. They speak sweetly to her and act as though they understand the conversation. They answer mom's questions even when the question doesn't make sense.\nThe facilities are always clean and pleasant. This is especially important to me and my  mom. And, the dining experience is lovely. The residents are treated with respect and very good sit down meals, three times a day. And the residents are also served snacks from a snack cart wherever the residents may be in the facility. My mom usually stays in the front living room, but she also participates in the activities, which is nice. It was fun watching them play noodle ball (which is where you hit a balloon with a pool noodle). It was amazing to see how this sparked the residents natural ability to bat at the balloon. So cute.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "100926343447324958997", "name": "sunny moore", "time": 1567127555039, "rating": 5.0, "text": "This is such an awesome place. My Mother has been there only two weeks and she tells me how nice everyone is to her. I know that is true because I have met so many wonderful and caring staff members. I know my Mother is getting the best possible care.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106761631696723258794", "name": "Tammy Walker", "time": 1531855472018, "rating": 5.0, "text": "I am pleased to share a review for Lakeview Estates! I have visited the community on multiple occasions and am always impressed with the operations of the community. The residents appear active and engaged in meaningful activities. The staff is cheerful and always helpful when needed. Most importantly, the care provided to the residents of the community is top notch. It is definitely evident that the management and administrative staff are involved in the day-to-day operations and are dedicated to ensuring the community is ran professionally and in accordance with the regulations governing the facility. I would recommend Lakeview Estates to anyone in need of Assisted Living or Memory Care services for themselves or their loved one(s).", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108537835107890377961", "name": "Fiona Cook", "time": 1553741754788, "rating": 5.0, "text": "I highly recommend Lakeview. It is a wonderful homelike specially memory care facility! They also provide a memory care unit for those with Alzheimer’s and other cognitive impairments. All the staff provide warmth and happiness to the residents and treat them like family. They also provide a wonderful array of activity programs for the different cognitive levels of the residents, which keeps them active, engaged, and entertained! ❤️", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "105998948053245434761", "name": "Stephanie McGough", "time": 1532016950774, "rating": 5.0, "text": "I loved visiting this community on several different occasions. The administrative staff worked hard to ensure that they were providing outstanding care to their residents and treat each resident with total respect. The environment was positive, upbeat, and the staff was very helpful. They would also assist with entertaining and engaging their minds in meaningful activities daily. I would recommend this community to anyone looking for Memory Care/Assisted Living arrangements for their loved one in this area. They go above and beyond to ensure they are a 5 star community at Lakeview Estates!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "110717312195962656851", "name": "Susan Thomas Brandon", "time": 1531274699045, "rating": 5.0, "text": "Both of my parents have been at Lakeview.  My father is still there.  I love Lakeview.  They always have activities going on that give my dad a sense of purpose.  All of the staff and even the visitors for other residents are so friendly - it is dad's home away from home.  I never worry about dad, because I know that he is being cared for and looked after.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116481706877713378459", "name": "Malinda Adams", "time": 1553548228048, "rating": 5.0, "text": "My mother is at lakeview and it is a fantastic place. She has improved so much since being there.  They celebrate every holiday with a party. There is an activity or 2 everyday. Best of all, there is an in house beauty shop. Lakeview rocks!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108176028309053918966", "name": "Linda Champion", "time": 1532450021396, "rating": 5.0, "text": "Lakeview Estates is a wonderful, caring assisted living facility.   Under the expert leadership of Callie Simmons along with nursing director Lynn Rogers, Lakeview is the very best that Birmingham has to offer.\nMy mother was well taken care of and enjoyed living at Lakeview.  She has now passed away, but I still feel part of the Lakeview family.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107210779197000575143", "name": "Russell McMillan", "time": 1531864882122, "rating": 5.0, "text": "FIRST, I would like to explain that my wife and I have a pretty good working knowledge of Assisted Living Facilities (ASL) in that my wife at one time was a director of an ASL. SECOND, I nor anyone in my family has a vested (personal or business) interest in Lakeview Estates. Now for the review:\nOur mother was at Lakeview Estates on (2) different occasions. The first time was for approximately 6 months while completing rehab following (successful) cancer treatments. The facility, management and staff were excellent and it was an pleasant experience. Our mother's second \"stay\" at Lakeview was a couple of years later and this \"stay\" was for approximately 2 years. Initially, we were \"less than impressed\" with Lakeview and stated our opinions in the \"end of the year\" survey...I am sure that I was not the only one that was not happy with the facility! Approximately 6-8 weeks after the survey, a new manager was hired (Callie Simmons) and IMMEDIATELY things begin to change. First, it was the facility became cleaner, painting, new carpeting, new furniture in the lobby, etc...However, the most significant improvements were that the residents and the staff were NOTICEABLE happier (my wife told me that when the residents and the staff are smiling that this is the sign of a well managed ASL). Eventually our mother passed away; however, the staff and management at Lakeview were nothing short of WONDERFUL (in every since of the word). The staff CONSISTENTLY went \"above & beyond\" What they were required to do in the daily care of our mother. The director (Callie) was frequently in communication with us...consultations, discussions regarding the future \"care\" plans, and phone calls when problems (potential or otherwise) arose. A couple of months after our mother passed away, I went to see Callie and told her that we would like to purchase a gift for the staff and told Callie \"if it helps the residents; that is wonderful; however, we want to let the staff know of our appreciation for the manner in which they (the staff) cared for our mother.\" After thinking over this for several weeks, Callie back to let me know what the staff needed and we immediately purchased the item(s) and had these shipped to Lakeview Estates. Several times over the past couple of years, I have been asked (by my peers) \"what was our opinion of Lakeview Estates\" and I tell them (what is in this review) and then add \"as long as Callie Simmons is the director of Lakeview Estates; it will continue to be a well ran ASL that cares for its. patients.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "105867362621089276594", "name": "Betty Coleman", "time": 1533064535638, "rating": 5.0, "text": "Our family views Lakeview as more than just a clean and attractive living facility. For approximately four years, it was HOME for my mom. While living there, she was respectfully cared for by staff who were loving, kind, knowledgeable and professional. Even though my mom is no longer with us, we continue to enjoy dropping by occasionally for a visit!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116461413842038928994", "name": "Debbie Zobel", "time": 1532451658277, "rating": 5.0, "text": "My Mother was well taken care of at Lakeview Estates and while she has passed away, I will always be grateful for the caring leadership Callie Simmons brought.  I appreciated the loving staff - whatever their particular area of responsibility - they carried it out with diligence and compassion.  As a family member of a resident I was not only impressed with how well they cared for my mother, but their responsiveness to my questions or needs as well.  I would not hesitate to recommend Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114233193519686125315", "name": "Jeri Bishop", "time": 1550277283022, "rating": 5.0, "text": "All of the staff here are amazing! The residents are happy and so full of life due to the amazing care and encouragement they receive each day! They are always involved in some of the most amazing activities and fun times!! I highly recommend Lakeview Estates!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112044960659702967701", "name": "Kathy Watson", "time": 1531416194471, "rating": 5.0, "text": "Everyone at Lakeview Estates has been kind and caring to both my mom and our family. They have helped all of us in the transition over the almost two months my mom has been a resident there. They are supportive, responsive and willing to answer questions. They understand dementia and try to meet Mom's needs by adapting their care as needed. The setting is lovely, the food is good, and they are welcoming whenever we visit.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109574869273084003021", "name": "Michelle Mckinley", "time": 1549494645587, "rating": 5.0, "text": "Having been in the health care industry for 19 years and working along side many memory care facilities and assisted living facilities,  I must say that Lakeview ranks one of the highest quality facilities that I have the pleasure to servicing.  The staff is responsive and caring to the many residents that live at Lakeview.  From the front desk girl Pamela  to the clinical staff and everyone in between, this place is a wonderful!!!  if you are considering memory care for your loved one,   I would highly recommend this beautiful facility.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "110486186921522526018", "name": "Jonna Wallace", "time": 1531325820133, "rating": 5.0, "text": "Lakeview is a wonderful home-like facility. My aunt has received outstanding care for 2.5 years now. As it often is with dementia patients, she had a difficult time transitioning to a facility from home. The staff was very helpful with the change.  She settled into a daily routine in about three months. My aunt isn't very social and the staff encourages her and reminds her to join in the activities. She very much enjoys the meals and has gained some security weight. The director and staff quickly respond to any inquiries and keep us informed about her health. We toured four other facilities and none of them were as nice or clean as Lakeview!  Highly recommend this facility!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113199248128941112518", "name": "david norris", "time": 1553646934992, "rating": 5.0, "text": "I have visited this facility numerous times and I am always so impressed with the professionalism of the staff and management. Everyone is so friendly and residents are very happy! Highly recommend Lakeview Estates!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103214236220662751016", "name": "Deb Davis", "time": 1531263575104, "rating": 4.0, "text": "My mom has been living at Lakeview Estates for nearly 2-1/2 years and we have been very happy with her care. Management has been responsive and helpful.  Everyone works to ensure the residents receive the best of care. The building is lovely, the food is good, and there is a wide variety of activities throughout the day.  Lakeview Estates also hosts special functions for residents and their families throughout the year.  The reason for 4 stars instead of 5 is due to the high turnover in direct-care staff.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116298459511127031316", "name": "Christy Jean", "time": 1550195995697, "rating": 5.0, "text": "Lakeview Estates is an exceptional facility! It’s kind and caring staff go above and beyond with their duties!! The residents are well taken care of, happy, healthy and active! The beautiful facility makes it a home to so many!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "118105267140781034861", "name": "Janie Henry", "time": 1531428038466, "rating": 5.0, "text": "Lakeview Estates is a very caring place for those wth memory disabilities.  It is a secure environment which gives family members peace of mind.  My mother-in-law moved in almost one year ago and is very happy living at Lakeview Estates.  The staff are always friendly and the ladies at the desk in the lobby are some of the sweetest.  They offer plenty of group activities as well as some local day trips.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103498000329024473195", "name": "Telesa Hearn", "time": 1531330828827, "rating": 5.0, "text": "I am a dispatcher with a local plumbing company that services Lakeview\nEstates. It has been a pleasure to work with Horace Kelly in Maintenance,\nHe is always concerned with repairs having as little as possible disruption for the residents at Lakeview, for example, he is aware of their bath schedules and has any work required scheduled with us to not disrupt their normal routine. Horace responds quickly to emails from us\nrequesting information and is always available when we reach out to him\nby phone. Having a dedicated employee like Horace to communicate with\nenables us to better serve the needs of Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109789782669262893747", "name": "Michelle Givan", "time": 1546394676339, "rating": 5.0, "text": "Both of my parents have dementia, and I had done all I could to care for them from my home. Two of my doctors told me that some of their clients were also in my situation, and had really good things to say about Lakeview Estates. During my tour the residents and staff warmly greeted me.  The staff are professional, the facility is spotless, and ambiance is warm, cozy and family oriented. When my parents moved there,  their nurses and caregivers embraced them and helped them adjust to this change in their lives. My parents are active, happy, growing spiritually and socially, and they are treated with respect and dignity. I couldn’t ask for anything more.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104238647273973491618", "name": "Lynda Myer", "time": 1520886573468, "rating": 5.0, "text": "Very caring people.  I have been very pleased with the care they have provided to my mother.  So patient with her.  There are plenty of activities to keep her busy and the food is good.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104435458245245283230", "name": "N Pritts", "time": 1531853963671, "rating": 5.0, "text": "My family member has been staying at Lakeview for nine years and has received nothing but the best of care.  I've compared other facilities and there really is no comparison to the quality of the work the nurses do, the choices of daily activities, the consistent cleanliness, and the above and beyond attentiveness!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114189013643141520742", "name": "Stephanie Palmer", "time": 1553027950778, "rating": 5.0, "text": "Great leaders and staff. Always compassionate and ready to help in any way they can. Highly recommend. The best dementia care around.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107577998366563622542", "name": "Candy Campbell", "time": 1532638834538, "rating": 5.0, "text": "My family LOVES this facility. Long term staff and caring staff are all over this place! The food is varied and so good, mom loves it and I have shared several meals there myself. The nursing staff is very hands on and attentive to changes they see in mom, as well. We have had mom in a terrible place before this and now oh my gosh, she's happy and were happy, such a win-win. The on staff Dr. is very through and friendly. I couldn't think of a better place for someone who has memory issues and needs assistance in their living needs. Lots of options for care and a wide variety of activities for each person living there. A++", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108448932059474325865", "name": "Karen Bailey", "time": 1531830600879, "rating": 5.0, "text": "For 10 years Lakeview has cared for my family. I have never felt the need to ask for more than they give on a daily basis.\nThis is the most emotional job anyone with a heart could have. The escort services Lakeview gives to the final days of my parents lives is very kind, thoughtful, and loving.\nMy family has been,blessed by their compassion.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109283303059370990721", "name": "hhl lavallet", "time": 1549637958997, "rating": 5.0, "text": "I visit many facilities across the state and Lakeview is consistently one of the finest facilities that I cover.  The staff is always professional and caring.  I highly recommend Lakeview.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "115680487657734466828", "name": "Alicia Jones", "time": 1550948469856, "rating": 5.0, "text": "I am a realtor and have visited Lakeview Estates often.  The residents are very happy!  I have referred several of my clients to Lakeview and will continue to do so!   Very friendly and caring staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103345123292726233857", "name": "Connie Gleason", "time": 1532544589123, "rating": 5.0, "text": "Everyone has been fantastic! They have made my father in-laws transition smoother than we ever imagined. It makes a tremendous difference when people care as much as they do about all of their residents.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107975587969564018842", "name": "Cheryl Scheu", "time": 1458407715720, "rating": 5.0, "text": "Moving a loved one into memory care is a hard decision but we feel confident having my mother-in-law at Lakeview Estates.  We visited several facilities in the Birmingham area and found Lakeview to be the best choice because it felt more like \"home\" plus it was cleaner and more attractive than some of the more expensive facilities.  The staff is friendly, attentive and helpful.  I highly recommend Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104740364951021438558", "name": "Cynthia Looney", "time": 1532486980099, "rating": 5.0, "text": "Lakesview Estates has a kind caring staff that takes care of people and is always actively involved with activities to help the people that live there. Each resident’s individual needs are met by a professional staff. I visit the facility often as an outside vendor and have the opportunity to compare places and Lakeview is definitely a place I would place my mother if the time ever comes for that.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107376660492241403167", "name": "Beau Green", "time": 1531424054749, "rating": 5.0, "text": "We have worked alongside Lakeview Estates for the last six and a half years. Their staff is compassionate, caring, knowledgeable and ready to help! I encourage you to consider Lakeview Estates if the opportunity arises for you or your loved one.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107587455854082679198", "name": "Glynda Howard", "time": 1532648999185, "rating": 5.0, "text": "This lakeview estates is a very nice facility. It is always neat and clean. All the workers are so friendly and helpful. The residents are always clean and being cared for.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "111793814873961146797", "name": "Steve Rice", "time": 1551726914142, "rating": 5.0, "text": "The folks at Lakeview have been so welcoming to mom.  We are so thankful that she in a positive and active environment.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "110275377936275272330", "name": "Daniel Boyd", "time": 1532537500111, "rating": 5.0, "text": "Staff is extremely responsible and reactive.  It is a pleasure working with them.\n\nFacility is always clean and comfortable.  Lake view Estates is highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106697656007483068606", "name": "Kim Bailey", "time": 1532526466435, "rating": 5.0, "text": "The staff at Lakeview Estates are wonderful. They take care of Mother in a friendly and loving way. I know she is in good hands with them, which helps to relieve my worries about her safety.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109163853894801824762", "name": "Paul Norton", "time": 1532568938983, "rating": 5.0, "text": "Exclusive of the physical plant providing a safe, clean appealing environment every member shows a genuine carting understanding to the residents.  I was fortunate to find the right facility.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116875003501329691000", "name": "Michael McGuire", "time": 1552364710625, "rating": 5.0, "text": "The staff are very active with residents here.  They have lots of activities to get them moving and thinking.  I have a sister in a similar facility in another state and there is just no comparison to the facilities and the staff.  We also pay more for a lot more for much less.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112980588391609638763", "name": "Lance Lee", "time": 1532711059103, "rating": 5.0, "text": "The staff at Lakeview Estates demonstrate compassion and care to those who are affected by Alzheimer's Disease.  They understand how to treat their residents with a gentle approach as well as promote their upmost dignity.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "117648145427457184753", "name": "Taneshia Nelson", "time": 1532619990976, "rating": 5.0, "text": "Excellent facility. They really take good care of their residents. I would recommend them to any family in need of care.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103363236258746868886", "name": "Chris Harlow", "time": 1531318969069, "rating": 5.0, "text": "Care for the elderly can be challenging. Not so for the staff at Lakeview. They are true pro caretakers, caring and know just what to do", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113807918219422050948", "name": "Jennifer Hess", "time": 1532679531758, "rating": 5.0, "text": "I have been a hairstylist there for the last 4 years. I've gotten to know and love the residents, the staff is very friendly and helpful, and everything is always neat and clean. It's more of a home environment than most places I have been to. By far my favorite facility.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114613247565186658741", "name": "Laura Boyd", "time": 1553032959721, "rating": 5.0, "text": "Wonderful experience, exceeded our expectations. Professional and knowledgeable staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109361338790499049543", "name": "Allen Keeth", "time": 1550197514019, "rating": 5.0, "text": "This facility is a stunning facility filled with happy, active and well taken care of residents! The staff is top notch in care and compassion!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107548883577917115568", "name": "Dave Urech", "time": 1549590011910, "rating": 5.0, "text": "My father lived there for 14 months & received exceptional care, very thankful!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "111092679065871056077", "name": "Rusty", "time": 1531843344252, "rating": 5.0, "text": "Very clean and well maintained facility, and it is clear that each and every member of the staff cares for every resident.  This facility also offers memory care services; as such, all of the entry/exit points are secured via either keypad or keycard entry.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "115412145039129151687", "name": "Helen Cook", "time": 1532624248995, "rating": 5.0, "text": "Very friendly and professional staff! Always so nice and courteous. Residents are always happy and active.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107572306654878216159", "name": "Karmen Payne", "time": 1553025482004, "rating": 5.0, "text": "Lakeview's leadership offers experience,  reassurance and the personal touch needed to comfort families during transitions in care.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109156792632836878576", "name": "Leah Ludwig", "time": 1531692269118, "rating": 5.0, "text": "Lakeview is truly a home setting and my mother receives stellar, personalized and loving care.  I am exceptionally grateful for the care she receives.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112397540577689807905", "name": "Brittany Gillespie", "time": 1532728374275, "rating": 5.0, "text": "What a great facility! Extremely friendly staff & would absolutely recommend this place to anyone needing their services!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112253873483156395597", "name": "Steve Bottchen", "time": 1531400835366, "rating": 5.0, "text": "I am really pleased with the level of care my Mom is getting from Lakeview. The staff is caring and courteous.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108861088541679864211", "name": "Greg Binder", "time": 1550163961725, "rating": 5.0, "text": "Friendly staff, beautiful lake surrounding the facility, and conveniently located just off 280.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106503843524135368705", "name": "Tom Donald", "time": 1434643540406, "rating": 5.0, "text": "This is a great place to live!  Beautiful surroundings, well constructed, nicely finished, and caring people.  I can't imagine anything better.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "115835642462030248843", "name": "Maria Cunningham", "time": 1532454844414, "rating": 5.0, "text": "Lakeview Estates would be a great place to call \"Home\".  Friendly & caring staff at Lakeview Estates!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108974372110044666872", "name": "Linda Luecke", "time": 1531264710143, "rating": 5.0, "text": "We are so blessed to have my mom in such a caring community.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103824947243229910416", "name": "Linda Grinnell", "time": 1531333619006, "rating": 5.0, "text": "My mother-in-law has been a resident at Lakeview Estates over a year now.  I am very pleased with the level of care and concern the staff has for her and thankful it's her 'home'!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103892493978292201900", "name": "Beverly Fox", "time": 1450921049407, "rating": 5.0, "text": "LakeView's interior has been updated from these pictures. When my Mother saw it for the first time she said this is like \"home away from home\".  She loves the staff and tells everyone she would recommend LakeView to anyone! She will tell you it is the cleanest place she has seen. And I agree with everything she says!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104356509118817355108", "name": "Elizabeth Hudson", "time": 1351221690947, "rating": 2.0, "text": "I presented a deposit for my mother.  They took it. She died in the interim.  It has now been over 5 months of attempting to obtain this deposit back. Despite my repeated requests for reimbursment of said deposit, I have yet to get a response. Not to mention a note of care regarding my mother's death.  I like Cheryl Thrasher, but I will never recommend this facility.  I do hope that an attorney need not get involved.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113511186616948480948", "name": "cdun91 91", "time": 1553025605469, "rating": 4.0, "text": "Nice, clean facility with friendly caring staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "117654173266768526649", "name": "Alan Ryals", "time": 1531406831793, "rating": 5.0, "text": "Debbie, Callie, and entire staff at Lakeview Estates have done an excellent job and we could not be more pleased!  Thank you for what you do for my parents every day...", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "118217477268650622246", "name": "Cathy Cousins", "time": 1531405216525, "rating": 5.0, "text": "Callie and the entire staff are wonderful with my aunt. My aunt  can be very stubborn and sometimes difficult but they handle handle the situation with love and encouragement.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113473464984167352950", "name": "North “Chief” Shelby", "time": 1553030995944, "rating": 5.0, "text": "The fire district works with the residents, staff, management and maintenance at Lakeview Estates on a regular basis.  Whether responding to medical incidents on residents or working on fire/safety issues, the staff, management and maintenance department are always friendly and cooperative.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114160422473681971473", "name": "C Wilbanks", "time": 1553031904694, "rating": 5.0, "text": "Beauty shop is a wonderful amenity!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114308607039508604334", "name": "Douglas Burnette", "time": 1531677276851, "rating": 5.0, "text": "When we drove up with my Mother, she said, \"This place looks homey.\" That was enough for me.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106695500779836762794", "name": "Greg Johnston", "time": 1533088592946, "rating": 5.0, "text": "We had elderly family members at Lakeview for almost 5 years.   Highly recommend the caring staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106798857168253896275", "name": "Lori Stanfield", "time": 1532532267600, "rating": 5.0, "text": "Beautiful facility and great staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104835812296506714296", "name": "James Williams", "time": 1531852566408, "rating": 5.0, "text": "Wonderful facility and great staff!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116352274830195710607", "name": "Andrew Bellard", "time": 1549919915843, "rating": 5.0, "text": "These guys are really great!!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "118028190129541158880", "name": "Stephen Adkins", "time": 1553959428777, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "101614158367810349558", "name": "Jeannie Davis", "time": 1524688571708, "rating": 5.0, "text": "My aunt and I toured this facility and we were extremely impressed with it and the staff.  Mary Holley helped us and she could not have been nicer or more helpful. My aunt could not make up her mind at this time and they were more than understanding. They were kind, respectful ,and more than patient. If the time comes for her to live somewhere, I could not ask for a  better place.", "pics": null, "resp": {"time": 1526497870980, "text": "Thank you very much for your five-star review, Jeannie! We’re happy to hear that you had a great tour with your aunt and we very much appreciate your kind words about our community and its dedicated associates and care partners. We understand that it’s a difficult decision and that it’s one you need to take your time with. Please feel free to bring your aunt by for another visit soon. We’d love the opportunity to get to know you both better. Again, we thank you for taking the time to rate us. Please let us know if we can be of further service to you!"}, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "108204091890287839746", "name": "Debbie Wilson", "time": 1518575479244, "rating": 5.0, "text": "Mary Holly came in on her day off to speak to us regarding Mom/mother in law. She was so very helpful, caring and sincere in her advise. The facility was so impressive, clean and staff was very  friendly. Everyone we met seemed to be part of one big loving family. All though we decided to bring our Mother home with us to Montana, we would have not hesitated to place her at Harbor Chase in Jasper, Al.  Thank you Mary and staff Alan & Debbie Wilson, Victor, Mt", "pics": null, "resp": {"time": 1520517287535, "text": "Thank you for your five-star review, Debbie! We’re very happy that you and your family had such a wonderful visit with us at HarborChase. We sincerely appreciate your kind words about our great community and clean environment. We especially thank you for singling out so many of our talented and dedicated associates. Every day, they strive to provide compassionate care that goes above and beyond all expectations. We truly do think of ourselves as one big, happy family. Again, we thank you for taking the time to review our community. Please let us know if we may be of service to you and your family in the future!"}, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "112897887315962793091", "name": "Kathy Dawson", "time": 1572546520031, "rating": 5.0, "text": "My mom lives here & she loves it!😁", "pics": null, "resp": {"time": 1572877344290, "text": "Thank you so much for your wonderful five-star review! We look forward to serving your family for years to come!"}, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "100977504971469145887", "name": "Kathy Waddleton", "time": 1540401332959, "rating": 1.0, "text": "Today I saw the disgusting excuse for food served to the residents. For the money that the residents are required to pay should at least bring a healthy edible meal 😢", "pics": null, "resp": null, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "107376857926500224244", "name": "Pam Ward", "time": 1540487119786, "rating": 1.0, "text": "Look on Face book and see what they are feeding residents...just awful.\n.", "pics": null, "resp": null, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "109396910537942618601", "name": "vanessa brown", "time": 1542262126393, "rating": 3.0, "text": "My Dad considered this facility. We chose a different one. He needed more care than this one provided. This facility is more for seniors who are able to prepare their own meals and don't need as much support. The facility doesn't provide 3 meals per day and does not have an RN for every shift. IMO, if the senior is in reasonably good health and just needs an occasional \"look in\", then it could be fine. I felt as the seniors needed more help with daily living activities then that's when the facility really makes their money. I will be honest and say these are my opinions and everyone knows what that means. The 2 bedroom apartment was nice esthetically,  the staff seemed nice. It just wasn't a fit for my parent. My objective in this post was the photos of the apartment. Hopefully it helps someone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmN4GyAdHKnj1ZdMzAvbrvxNotws0ICVoAuD4s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMQuu16wJsnqYWVfb0rOT4J1aZTXrBAJwt3lcx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-YIhdP4mdxOrL5D_faigvKHR2upfkHib40qvS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6VbMZ-Qv2z92wLacs3XBzgm2tkeK3-c9ck8Q3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPEvoB0RorVysmA7VzhspeaBrQahgweZlzVTVn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdcIAo5fkZkuevUa67fJa4q5eQBDfAWx-sZfpt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO79tzSS_-vKEcCBq4D4nwc0RM0-yGSM4CcHwES=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAASjgqwBDWddbhiZC2i2RRBObex9wST-wwzYj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN90S9rVfS6lKUtcbyz-ohwS-vAoZXF3pRyHXAc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPncoewE0lSYfLSsE0FR7kfEby28l_kO_9uKmFM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPDabNfkj1awVkG0jSfAJ9oo2i5EpDc-aSmnhyW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVbu1E-6S0hHSugbA-mIykxp5HC36Wsk2lZJao=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "111030873461850762635", "name": "Anthony Bowen Sr.", "time": 1590526970541, "rating": 5.0, "text": "I have been living here since August 16, 2019 and I find this is like my best place to reside and it’s a great place to live. I plan to be here for a long time.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "103973485537537315420", "name": "Cynthia Lee", "time": 1541785818819, "rating": 1.0, "text": "BEWARE OF THIS PLACE!! My father lived here and do to health reasons needed to be transferred to a nursing home. We gave the notice to Brookdale and moved him out. Two months later they drafted 1640.00 from his bank account!!!! AFTER he was no longer a resident for two solid months!! Now they are refusing to give his money back and we can't afford to pay his nursing home for the month. They are shady and all about money. They are not honest and will take advantage once they have your bank account information. I recommend going somewhere else to a place that has integrity. BEWARE OF THIS PLACE!!!!", "pics": null, "resp": {"time": 1542231781083, "text": "Cynthia,\n\nWe are aware you have spoken to the executive director regarding this matter. Our district director of operations also left a message for you, and we encourage you to call her back if you wish to further discuss."}, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1574281326361, "rating": 5.0, "text": "My mother has been at Brookdale Cedar Springs for almost a year, and we couldn't be happier.  I would highly recommend Cedar Springs.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1544677761719, "rating": 5.0, "text": "My mother in-law was a resident here. I visited many times. Nice place.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "109270243111009391636", "name": "Russell Parker", "time": 1627246692967, "rating": 1.0, "text": "I own a local plumbing company near Cullman.  i answered a service call one day hot water line had burst .  i went and repaired water line it has been nearly a year in september and still have not been paid . The first excuses were behind due to covid. Well i fixed the leak during it. I pray they treat patients better than those that help them . if you do service work get your money up front.", "pics": null, "resp": null, "gmap_id": "0x8889ca517ad897b1:0x60f3c1d647ac2edb"}
{"user_id": "106504844261527888618", "name": "Shane Taylor", "time": 1572356705508, "rating": 1.0, "text": "Contractors beware !  Do not service this facility.  My company has serviced the heating and air equipment and replaced 2 systems . We have not been paid and corporate will not call you back regarding payment. We have invoices that are 244 days old . Hope this helps anyone who might be thinking this would be a great customer. Don't do it.", "pics": null, "resp": null, "gmap_id": "0x8889ca517ad897b1:0x60f3c1d647ac2edb"}
{"user_id": "101637907039780893659", "name": "Elizabeth Haupt-Johnson", "time": 1601644478895, "rating": 5.0, "text": "Call and schedule your virtual tour TODAY!!!!", "pics": null, "resp": null, "gmap_id": "0x8889ca517ad897b1:0x60f3c1d647ac2edb"}
{"user_id": "103127158279849920946", "name": "donna hughes", "time": 1602000525821, "rating": 5.0, "text": "The staff at The Gardens of Waterford are so helpful and knowledgeable in helping with placement of senior adults. I highly recommend The Gardens of Waterford for anyone seeking placement for their loved one with dementia needing assisted living. It is An open and airy facility. Happy and bright.", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "107526455078030400929", "name": "Felicia Lamar", "time": 1620703580194, "rating": 5.0, "text": "A great place missing everyone", "pics": null, "resp": {"time": 1620740733536, "text": "Thank you for your kind review, Felicia. We appreciate your supportive feedback!"}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "101637907039780893659", "name": "Elizabeth Haupt-Johnson", "time": 1601299297295, "rating": 5.0, "text": "Staff and residents’ families communicate well with each other which has created trusting relationships and a pleasant home for residents!❤️", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106146766934541385744", "name": "Monica A.", "time": 1559764868637, "rating": 5.0, "text": "The resident's at The Gardens of Waterford are well taken care of each and every single day. All residents are visually healthy and beautifully groomed. The management team upholds a very professional and responsible duty to each resident and employee. When working at The Gardens of Waterford you must have  purpose. All residents at The Gardens of Waterford have a special Dx: that takes love, patience,  and kindness. Each second, each minute,  and each hour takes time. If you're seeking employment  at The Gardens of Waterford make note you must have #Purpose and you must have patience every single day. I am grateful for my time spent at The Gardens of Waterford.  I've  learned so much about memory care.  My future plans as a Holistic Nurse Practitioner is to work closely with Doctors and Nurse Practitioners around the world that are trying to eradicate #Alzheimer's", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "105412873507415205641", "name": "Robin Rudder", "time": 1574377870080, "rating": 5.0, "text": "Such a wonderful staff who provides a caring environment for our loved one.", "pics": null, "resp": {"time": 1575303715644, "text": "Robin, Thank you for the five star review."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "117178716642420612617", "name": "Tina Whitaker", "time": 1574378041516, "rating": 5.0, "text": "Loving community\nClean\nManagement team is very responsive", "pics": null, "resp": {"time": 1575303727760, "text": "Thank you Tina for the 5-star review."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "101712454670074570933", "name": "Lori J", "time": 1517777328838, "rating": 1.0, "text": "One year ago this was the best of the best in Montgomery.  Today, it's a disaster.  Management change months ago and Manor House has gone so far down hill that we now, for our family member's safety, have to leave.  The head nurse has no compassion.  The director is unfit to run a community.  She asked us to give her a chance and we did, what choice did we have.  She has no regional support.  The corporate office makes a lot of unfulfilled promises.", "pics": null, "resp": {"time": 1523388728059, "text": "Lori, we take our reviews seriously and would like to discuss this further. Please call our toll-free Human Resources Hotline at 1-855-273-4397 for staff-related issues, or the Resident Relations Hotline at 1-855-881-2576. Thank you."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "104904098754123772050", "name": "Tisha Dickson", "time": 1558457115102, "rating": 5.0, "text": "Wonderful place for families to bring their love ones here...", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "107681740401300629704", "name": "Coretha Slayton", "time": 1559832959355, "rating": 5.0, "text": "The Gardens of Waterford wonderful \"at home\" atmosphere let's the residents maintain their independence in a safe, friendly environment!", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "111141508604997910893", "name": "Christina Wyatt", "time": 1498323058330, "rating": 5.0, "text": "Wonderful place! They take great care of their seniors. 😍", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "110977198448655448123", "name": "Diann Smith", "time": 1497020308311, "rating": 1.0, "text": "Poor old people this place is hll on earth.", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106483366370668904230", "name": "Georgia Patterson", "time": 1529617643218, "rating": 5.0, "text": "Patients bedridden live here", "pics": null, "resp": {"time": 1533311492963, "text": "Georgia, thank you for the five star review!"}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1584158355353, "rating": 4.0, "text": "Some places is different but it's all about how you treat you patients. I heard great things", "pics": null, "resp": null, "gmap_id": "0x888cf2b27d514c35:0x229a504feb16aae2"}
{"user_id": "105872093947566453517", "name": "Samar Misra", "time": 1600565543374, "rating": 3.0, "text": "Recently, as I was on a shift this past week with a nice gentleman at this facility, I was kind of shocked to see some staff near a kitchen area or in common area not masked up in addition to seeing residents dining together and being engaged in group activities unlike many other facilities especially during the pandemic now.  Despite being spoken to well and professionally by all staff, I figure would be good if precaution was taken where each resident would eat a meal in his or her room, group activities to be put on hold and all of the facility get covid tested regularly even if asymptomatic for best safety and comfort for all.  Wishing for the best while wanted to leave feedback.  Thanks!", "pics": null, "resp": {"time": 1600784012950, "text": "Hello Samar, thank you for sharing your feedback. We take all of our reviews seriously and we would like to discuss your experience further. Please reach out to us  at (256) 617-7285 with any further comments, concerns, or suggestions. We would love the opportunity to make things right, if given the chance!"}, "gmap_id": "0x8862133089f51d01:0xa027407830068246"}
{"user_id": "112878365819931056928", "name": "Susan Fox", "time": 1537138093581, "rating": 5.0, "text": "My mother loves this facility. The nurses and staff members are so very kind and caring. The food is great and the activities are fun, interesting and educational. She has had several personal health issues during her 15 month residency. Each and every time the nurses were quick to get her the help and care she needed. The residents are friendly and pleasant.  As I said, my mother has thoroughly enjoys this facility and calls it “home”.", "pics": null, "resp": {"time": 1547671034672, "text": "Thank you so much for sharing your family’s experience at HarborChase, Susan. We are very happy that you and your loved ones chose our community for your mother. We sincerely appreciate the great compliments on our delicious food, fun Life Enrichment program, and dedicated associates and staff members. As a community, we work hard to create an environment where we could envision ourselves living one day. We’re glad your mother loves her home! Thanks again for taking the time to review us. We look forward to serving your family for years to come!"}, "gmap_id": "0x8862133089f51d01:0xa027407830068246"}
{"user_id": "116062306691344656279", "name": "Nancy Bates", "time": 1507728031339, "rating": 5.0, "text": "My family LOVES HarborChase! My mother has been a resident for 6 years, begining with a recovevry stay from a fall. She says it's the BEST decision she has ever made! She loves the personnel, the people give compassionate care, the comfort of having her own apartment, the dining room serves wonderful meals, and there is a wide variety of activities to keep her busy. Not only has HarborChase given her the opportunity to remain self-suffcient, but it has also given her more confidence in living alone. She's always been an independent woman and her spirit has soared since living there. I believe she has also given HarborChase new life as well. One can tell they adore her, too. She brings a smile to everyone's face whenever she walks into a room!  TY, HC", "pics": null, "resp": {"time": 1508413978528, "text": "Thank you very much, Nancy, for your wonderful recommendation and five-star review! We’re very happy that you and your family decided to choose HarborChase for your mother six years ago! She has become an important and much-loved and adored member of our community! We sincerely appreciate the kind words about our delicious dining services, comfortable apartments and wealth of activities available daily through our Life Enrichment program. We especially love the wonderful compliments for our kind and compassionate associates. Every day, they are focused on providing the very best in senior living. We’re thrilled that your mother has been able to hold onto her independent spirit at HarborChase! Again, we thank you for taking the time to post your amazing review. We look forward to serving you and your family for years to come!"}, "gmap_id": "0x8862133089f51d01:0xa027407830068246"}
{"user_id": "113451952219580054850", "name": "Abby Dismukes", "time": 1582583479802, "rating": 5.0, "text": "Life changing. It works if you work it.", "pics": null, "resp": null, "gmap_id": "0x88928dbf50047197:0x8c7e3b867abf0f00"}
{"user_id": "105862111424601196524", "name": "Christopher Senn", "time": 1499401614121, "rating": 5.0, "text": "It is a good start for someone trying to change their life.", "pics": null, "resp": null, "gmap_id": "0x88928dbf50047197:0x8c7e3b867abf0f00"}
{"user_id": "115325146038638434219", "name": "Susan Traweek", "time": 1622188017315, "rating": 1.0, "text": "Extremely unhappy with the experience my dad had at Covenant Woods. They were informed about all of my dad”s dementia related behaviors up front when they came to our house to assess him to see if he would be a good “fit” for their facility. Then after being there for only 3 weeks, they sent him out to a Geri-psych hospital, where he stayed for almost 3 weeks to get his meds “adjusted”. Only 2 days after my dads return to Covenant woods, we were told he couldn’t be easily “redirected” and had 30 days to leave. He had become even more confused than ever and was experiencing physical symptoms such as diarrhea, drooling,, coughing, and he even collapsed a couple of times while walking. They didn’t deem these symptoms serious enough to send him to the hospital. When I went up to check on him, it was completely clear something was way off with his health, so I had him sent to the hospital where he was diagnosed with septic bilateral pneumonia and is now in the ICU. I would definitely NOT recommend this facility to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889041b5f60db77:0x6f3ab256b62f89a5"}
{"user_id": "114799012409228339878", "name": "Macy Nicole", "time": 1622527693251, "rating": 1.0, "text": "Covenant Woods is the worst decision we made for my Poppy. They claim they are a memory care facility, but do not want to deal with actual Alzheimers/Dementia patients unless they are wheelchair bound/ unable to move. They don’t want patients who may have classic Alzheimers symptoms such as aggression or wandering. If they do, they act like the person is an issue and asks you to hire a sitter on top of the $5000 monthly fee. Also, they evaluate the person to see if they are a good fit prior to moving in... we told them that he wanders, has mood swings, and cant communicate because of Aphasia. They said he was a great fit. He was kicked out because he couldnt be “re-directed” Do they not understand what Aphasia is?? In the Month and a half he was there, he was sent to the geriatric psyche unit, and when he returned to covenant started to faint and develop a cough which the owner tried to brush off. It turns out he had developed pneumonia and sepsis. His health has done nothing but decline in the month and a half he was there & he was treated like a burden the entire time. We were constantly receiving calls complaing about his classic Alzheimers symptoms. This place is a joke. Also, they hire 16/17 year olds to watch these residents that need professionals who understand how dementia/Alzheimers patients can be. This place is a JOKE!", "pics": null, "resp": null, "gmap_id": "0x8889041b5f60db77:0x6f3ab256b62f89a5"}
{"user_id": "105785502118039509494", "name": "Ronny Perkins", "time": 1584409725168, "rating": 5.0, "text": "Christian staff, compassionate, caring, loving. Treat your loved one like it was their mom or dad. There is not a better facility in the Birmingham area. Fed well, kept clean, interact with each patient. My dad has been there two years, not the first problem. Never smelled any type of odor, never seen any thing out of the ordinary, always courteous, friendly, willing to discuss anything with you about your loved one. This is far above a \"nursing home\", this is their new home.", "pics": null, "resp": null, "gmap_id": "0x8889041b5f60db77:0x6f3ab256b62f89a5"}
{"user_id": "108617684560023200462", "name": "Misty Yager", "time": 1465292831558, "rating": 1.0, "text": "Don't send your loved ones here. They say the are Dementia trained.but actually they just want to get you parents in and then they send them to the geriatric unit at the hospital every  chance they can. Please don't send them here. They will lie to you from the start.", "pics": null, "resp": null, "gmap_id": "0x8889041b5f60db77:0x6f3ab256b62f89a5"}
{"user_id": "106786665098636865722", "name": "Tammy Jessen", "time": 1552384190470, "rating": 5.0, "text": "My mother was at Covenant Woods for 6 months before she passed. I can not say enough wonderful things about the level of care provided at CW. They are awesome!", "pics": null, "resp": null, "gmap_id": "0x8889041b5f60db77:0x6f3ab256b62f89a5"}
{"user_id": "116995405173961869720", "name": "Greg Marler", "time": 1599825329951, "rating": 4.0, "text": "Very well maintained retirement tower. My Aunt has been their for many years and raves about the place and the people who work and live there.", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "105752178827636546426", "name": "Matt Beer", "time": 1564531458624, "rating": 4.0, "text": "Nice apartment complex for 55 + community.  Clean facilities and nice to have laundry room.", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "109040381693448421405", "name": "Sue Sue", "time": 1542636569218, "rating": 5.0, "text": "My mom loves her new home here!! We have been 100% satisfied!", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "100226681454235200870", "name": "Wllie Crittendon", "time": 1511153641375, "rating": 3.0, "text": "The manager or the secretary don't care about the tenants. It a money racket, it some are not found dead they sent to flowers hospital.", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "105698879721835033450", "name": "David P. Olivier (1000 Hearts)", "time": 1597774319262, "rating": 1.0, "text": "On April 11, 2020 I lost my Mother at this “facility”.  Despite CDC and ADPH guidelines which include provisions for “life and death ” situations; 2 men-yes, just 2 men- have put a policy in place that saw my beloved Mother leave this world and enter the next completely alone!  No husband of 66 years holding her hand.  No children or grandchildren at her bedside.  We were in the parking lot being\ncondescended to.  We were being offered a “glance through a window” moments before being told, in a parking lot, that she was gone.  If the roles had been reversed and any human being had tried to stop my Mother from being at the side of her loved ones as The final breath were drawn: No Earthbound force could  have stopped the Power of Love that coursed through that remarkable woman.  She would have been at my side.  I am a weaker soul than she.  I tried diplomacy.  My cries fell on ears so consumed with ego and a sense of power that the only meaningful response from the tyrant who dared only speak with me via speakerphone was  “...that’s how we’re doing it.  That’s off our best judgement.”\nI posted a video on social media prior to Mother’s passing, after the phone conversation, asking for support from friends and others in the community.  The calls that they place were met with hostility, rudeness, and empty promises of “the administrator will get back in touch with you”.  As those phone calls were coming in and my sister was being told of Momma’s passing, I was receiving cold, disdainful stares by the only staff member who could even bring herself to look in my direction.\nThere is no way this injustice can be reversed.  This beautiful creature whose pastor said in his eulogy “... was a beautiful soul.  It was my privilege to be her pastor and to be her friend.  I'm not sure that I've ever known anyone who had so much love, so concentrated, deep within her being.  Every interaction I've ever had with Carolyn was permeated with love.” This giant of a giver.  This Child if God.  My Mother.  I cannot change the final moments of her life.  I can, however, see that her story is told.  I can see that these individuals who slither through this life generating pain and sorrow need not be concerned if they are alone.  I couldn’t be there for Momma on that day but with God as my witness, until I draw my last breath, I will live as a reminder to those who tried to diminish her that She lives in me.  Where her eyes are now closed, mine are now open.  My eyes are wide and inquisitive.  My eyes seek only one sight today.  That sight is justice!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPSIMcOHyDkJjEvJiV1wzIntCUgI-CxkRkk468V=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "106122381008780823371", "name": "Elizabeth Hollingsworth", "time": 1554228488648, "rating": 5.0, "text": "Fantastic facility! The therapy staff are truly dedicated to helping you achieve your goals and get home as quickly as possible. The environment is bright and clean. Highly recommend this facility to anyone!", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "102447697817850087965", "name": "Matt's Regional Calendar", "time": 1569338879546, "rating": 5.0, "text": "Staff was very friendly. Facility was very clean.  Therapist were great and treating us like family.", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "115026238953929233276", "name": "Charmin Mccurdy", "time": 1489769101704, "rating": 1.0, "text": "My aunt was in this facility and recently passed due to severe dehydration and blood sugar at 700. She was not taken care of by most of the staff only family that stayed with her. When the family would turn the light on for help it would take up to 45 min for the staff to respond. The staff was /is overworked sometimes working 16 hour days. This is by law unacceptable. I would not recommend this facility to anyone that cares for their loved one.", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "115134446008372513714", "name": "Movin' Mark", "time": 1472691687208, "rating": 4.0, "text": "Great facilities have done really well with my mom.", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "106350408948100080840", "name": "Barry lkard", "time": 1477949557098, "rating": 4.0, "text": "Yes", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "105159484160635909894", "name": "natlya flowers", "time": 1595127685071, "rating": 5.0, "text": "Lovely place if i do say so myself.", "pics": null, "resp": null, "gmap_id": "0x88927b5dac0b7965:0x140d3eac6c104216"}
{"user_id": "101940724829421114990", "name": "Kelly Marshall", "time": 1568472049288, "rating": 5.0, "text": "If I was a senior citizen this is where I would love to be there friendly loving and caring staff its clean and cozy  in the winter and cool in the summer my grandmother stayed there up until she was getting much worse where she couldn't do things by herself  she loved it there she loved all the people that stayed there her name was Betty Roberts", "pics": null, "resp": null, "gmap_id": "0x88927b5dac0b7965:0x140d3eac6c104216"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1546189195780, "rating": 5.0, "text": "Great facility where owners are there daily. Compassionate, experienced staff. All go above their call of duty. Couldn't ask for a better experience.", "pics": null, "resp": null, "gmap_id": "0x888a2483960c0a25:0x90ab18ddab6044e3"}
{"user_id": "113755729140997535676", "name": "Brooke Hall", "time": 1515086564213, "rating": 5.0, "text": "I worked here for 5 years. The owner is a good guy that makes sure the place is clean and the residents are happy and taken care of. The staff is hard working and compassionate. I'd put my parents here if they needed a place to call home.", "pics": null, "resp": null, "gmap_id": "0x888a2483960c0a25:0x90ab18ddab6044e3"}
{"user_id": "101934462852885018586", "name": "becky kinder", "time": 1512427025316, "rating": 5.0, "text": "Our church LADIES group went today and spent 4 hour with a group of 15 residents. We sat around 6 long tables and helped them make beaded bracelets for themselves or for gifts.  We used large hole beads and coiled wire.  Each resident had help when needed and lots of laughs.  What a good afternoon.  They had a feeling of accomplishment and lots of hugs and smiles.  We have decided,  2 return every 2 weeks for a repeat.", "pics": null, "resp": null, "gmap_id": "0x889a055b53c0eb39:0xf08b9102e27e36d7"}
{"user_id": "112925914085584928654", "name": "Chetney Garrison", "time": 1566791673523, "rating": 1.0, "text": "Sarah burgess has been very rude to me. She is very unprofessional everytime myself and my husband try and talk to her. We have decided to take my father in law to another location. If the admin acts this poorly we would not rest easy knowing our loved one was in her care.", "pics": null, "resp": null, "gmap_id": "0x889a055b53c0eb39:0xf08b9102e27e36d7"}
{"user_id": "108676765471704165047", "name": "Jesse Lofton", "time": 1497181115486, "rating": 5.0, "text": "Our group loved spending time with and serving the residents and staff of The Haven.", "pics": null, "resp": null, "gmap_id": "0x889a055b53c0eb39:0xf08b9102e27e36d7"}
{"user_id": "108806918101149325457", "name": "Jenny Willis", "time": 1457418662057, "rating": 1.0, "text": "Management has no clue what they are doing. Most staff don't care about patients.", "pics": null, "resp": null, "gmap_id": "0x889a055b53c0eb39:0xf08b9102e27e36d7"}
{"user_id": "107683662245959623880", "name": "James Ballard", "time": 1539888231219, "rating": 3.0, "text": "Did not have a great experience here.", "pics": null, "resp": null, "gmap_id": "0x889a055b53c0eb39:0xf08b9102e27e36d7"}
{"user_id": "116441963564997419924", "name": "Rodney Melvin", "time": 1460815195424, "rating": 5.0, "text": "First class Quality Living.", "pics": null, "resp": null, "gmap_id": "0x889a055b53c0eb39:0xf08b9102e27e36d7"}
{"user_id": "114974214424022086750", "name": "AK Bates", "time": 1606623812847, "rating": 5.0, "text": "Great place to live and it's on Birmingham's SouthSide!", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "107192861584096254702", "name": "Chas Hart", "time": 1487287308942, "rating": 5.0, "text": "Three or four years ago, I found Greenbriar as an attractive, clean and convenient place for a relative to live.  Now that we have had experience with them, I find the staff and administration to be very accommodating and willing to work through any issues encountered.  (The issues are generally with the resident and not with the facility.)  I would recommend this highly for the independent living areas.  I have not had experience in other areas.", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "105581858618373192193", "name": "Domontez Peterson", "time": 1531127878654, "rating": 1.0, "text": "Worst place ever to put your loved ones. We moved ours out and into Legacy. Best place ever. Administration is rude and money  hungry.  Director of Nursing is also rude and very nonchalant about everything. Building codes not up to code. Needs rewiring and to be remodeled. Not a real lock down unit. It's mixed in with critical care, and total care and psych patients. AWFUL!! STATE NEEDS  to shut them DOWN!", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1487085413722, "rating": 5.0, "text": "Great place to send loved ones.  Staff and especially management is very caring.  I was surprised, but glad my loved one ended up there.", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "103870672238518947064", "name": "Jen Bailey", "time": 1443104277909, "rating": 1.0, "text": "Understaffed.  Doctor only comes by once a week.  A love one lived here recovering.  I noticed she was confused and distracted when I went to visit her.  She told me she slept in her chair, which was evident from the untouched sheets.  Physical therapist there is great and needs help, understaffed.  However, when she reported to the red-haired charge nurse the things that were happening, was there a caring  medical evaluation?  No.  The nurse came into the room and basically scolded my loved one for saying \"random things\" to \"circumvent therapy.\"  A medical evaluation was requested by the family and it turns out she had low oxygen levels, fever and tremors.  Pneumonia.  Low oxygen can lead to confusion.  A skilled staff nurse would have identified this.  Two weeks later, my loved one is now deceased and I believe the neglect and mishandling of medical issues by this particular nurse is partly to blame.  I am posting this review in response to her actions.  The rest of the facility may be wonderful with amazing staff, but our experience did not include that, save the physical therapist.  If you visit, look on every floor, do not just marvel at the beautiful lobby.  Ask questions of the residents, look around.  Best of luck.", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "111394592604522269123", "name": "Lynn Whisenant", "time": 1467737387758, "rating": 5.0, "text": "My mom lived here and she loves it!  They treat her with respect and dignity ....", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "110557543773192095380", "name": "Sharron Bowers", "time": 1475880511659, "rating": 1.0, "text": "I sit with a patient here it's very nasty floor look never mop trash run over. I went use staff rest nasty you see dirty. I have 20 years working in housekeeping at UAB. I very in please with this place. Smell is oh my God. No one love one's should live like this", "pics": null, "resp": null, "gmap_id": "0x88891bcb2c928bb1:0x425b8b1f72e1cfb6"}
{"user_id": "101869493395321811863", "name": "Paul Flynn", "time": 1559594009335, "rating": 5.0, "text": "Visiting  Angels has been nothing short of amazing! The owners are wonderful. I had the opportunity to meet both Amy & Jeremy. Amy runs the Florence office while her husband operates Huntsville. They both really take the time to match the client with the best caregiver to not only meet their needs but personality too. Amy strives to make sure her employees can reach her anytime day/night, holidays, weekends etc. Everyone is very helpful & easy to work with. Taking time off is never an issue. Everyone works together to ensure coverage is met. I had an unexpected hospital admission at 3 in the morning & calling in to find coverage at that hour wasn't an issue. I was hospitalized for nearly a week. Amy was so supportive. Never had I had such an attentive boss. I can say for my part that I view her as not only my employer but also a friend.", "pics": null, "resp": null, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "107004041051645397964", "name": "Debbie Garrett", "time": 1558024215967, "rating": 5.0, "text": "I’ve been a caregiver for many years.   When we moved to Athens a couple months ago I felt it time to get back to what I love...caring for the elderly!\nWorking with Amy and Jeremy has been a very nice experience!!!   They are kind and understanding of scheduling issues we as caregivers may have.   While I’ve only been with Visiting Angels of Florence for a short time,  I already feel blessed to be part of the team to provide the best care to our elderly clients as possible!!!", "pics": null, "resp": null, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "107596517876735472310", "name": "Lindsey Watford", "time": 1559595538683, "rating": 5.0, "text": "The owners, Amy and Jeremy, really go above and beyond to make sure their clients have all of their needs covered. I have personally witnessed them both take time away from their own families and personal lives to put the needs of the client first. You couldn’t ask for a better company to take care of your loved one.", "pics": null, "resp": null, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "111446168741683968421", "name": "Stacey Ronillo", "time": 1559931305620, "rating": 5.0, "text": "The caregivers and office staff at Visiting Angels were amazing to my mother(and helped us as well really).  We are so please to have used such a wonderful, caring and compassionate company when mom needed a little extra help.  Thank you!", "pics": null, "resp": {"time": 1617031638416, "text": "It was our pleasure!  Thank you for choosing Visiting Angels and writing such a nice review!"}, "gmap_id": "0x887d493c39927ddf:0xd5aaa5fa60c354"}
{"user_id": "114909477361782272419", "name": "William.Harris@gmail.com Harris", "time": 1476548075631, "rating": 5.0, "text": "MY EXPERIENCE WAS GREAT AT HARRIS HOME FOR CHILDREN U WAS THERE FROM 86 TIL 89 IT WAS A GREAT EXPERIENCE LOVED THE FOSTER PARENTS WERE GREAT.", "pics": null, "resp": null, "gmap_id": "0x88626b40c1a193c5:0x335bf003972b3db"}
{"user_id": "111094144185640964944", "name": "A Google user", "time": 1443219145820, "rating": 1.0, "text": "This place is The worst possible place any kid should ever go to. I would never leave my kids in this place but my kids know some kids that live here and they have reported that the parents have pulled one of the kids out from under his bed causing him to hit his head and others have just blatantly thrown him out of his bed.  It is to my understanding that the parents also spit in their faces and verbally assault them. This is no place for a child.", "pics": null, "resp": null, "gmap_id": "0x88626b40c1a193c5:0x335bf003972b3db"}
{"user_id": "107336281134679630008", "name": "everlina hervey", "time": 1550356384508, "rating": 5.0, "text": "Working with kids is wonderful!", "pics": null, "resp": null, "gmap_id": "0x88626b40c1a193c5:0x335bf003972b3db"}
{"user_id": "108281306633062928021", "name": "Angela Glaze", "time": 1616458033858, "rating": 1.0, "text": "I give one star because you can't post without giving something. I wish I could give some type of notice to close down this facility and relocate the residents that are stuck there... to some this is as close to a death sentence as possible. The best recommendation I can give anyone is to not consider this facility to provide the care for a loved one. Moving my mother to another facility was the best thing we could do for her. Diversicare of Riverchase left much to be desired. The lack of compassion and the poor communication are two of the things they should be known for. Their admin leads most of the group that treat you in a very disrespectful and unprofessional manner. If you disagree with what she has to say she will quickly threaten to write up a 30 day discharge notice for your loved one. They recently upgraded their phone system which gives you false hope of being able to get someone on the phone and have your issues resolved. Most people do not return your calls unless you have to escalate your concern by emailing or calling the number on the website. I will say that there are a couple of staff members that did assist my family, and those ladies are Vicky and Lauren. If you send your loved one here please do not send any belongings that you would not want lost or given to another resident. My mother was sent to Diversicare from a short term facility with notes from her husband (who suddenly passed away while she was in rehab). A staff member hung one of the notes on her wall and at some point it was lost and never located. In addition to a note that they placed on her wall being lost, a note inside of my mothers glasses case was lost, a cell phone was lost twice, phone chargers were lost, numerous pieces of her laundry were lost, a hard back photo book with her name and photo on the cover was lost. We were offered a reimbursement on a cell phone and book but no one ever got back with us to issue reimbursement. The most important thing they lost was MY MOTHER - she was supposed to go to the ER and I called to see which one she went to. The two staff members who had me on speaker phone were disagreeing with one another about if she was sent out or not. One finally said \"I know she went out but I can't tell you where\". 32 minutes later I had to call them back to see if they found where she was. 7 minutes of being hold I was told that she either never was sent out or already returned. No one could clearly tell me what the true story was. For an hour or more they were not even aware that she was in their facility! At one point a photo blanket of my mother with her family was lost and then found and kept in the admins office for weeks. Upon picking up some of our mothers belongings we found dirty laundry with another woman's name in it in a bag with trash, some purses and wallets that were not our mother's, etc. As our mother made it to the new facility we found that the new clothing items we took to her a couple of months prior were not sent with her. We saw our mother at doctor appointments and through zoom calls and she was wearing clothes that were not hers. I would do your loved one a favor and find any other place other than this one to send them to. REMEMBER YOU ARE THE ADVOCATE FOR YOUR LOVED ONE AND YOUR VOICE IS STRONGER THAN SOME OF THE PEOPLE IN THESE CARE FACILITIES. This is only a highlight of the ridiculous things my mother and family endured from late June 2020 through late February 2021.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "109926240699231573256", "name": "Seth Thomas", "time": 1619821072810, "rating": 1.0, "text": "Please do not send your loved one here. I wouldn’t send my worst enemy there. My grandfather passed away here and when we came to see him not one person gave condolences. It was horrible.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "118038310267592722217", "name": "Lee Tibbetts", "time": 1613828035492, "rating": 1.0, "text": "I would never send anyone here.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "106106737714727956036", "name": "Rene Hughs", "time": 1574479928234, "rating": 1.0, "text": "They have left my mother in a wheelchair for 6 hours when she is in pain recovering from surgery. All she wants to do is get in bed. Multiple people have come and went and even though she is asking for help to get in bed and it is  late at night they will not. Do not bring someone you love to this place!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "111316966700881961848", "name": "megan rollins", "time": 1520783617404, "rating": 4.0, "text": "My family and I had a great experience here. They took care of my dad and truly cared about him. The nursing staff was excellent, they knew me by name and cared about how I was doing too. The residents are also great, they are all so kind. I would highly recommend this place to bring your loved one.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "112745678270399080938", "name": "Shannon Cook", "time": 1520366220676, "rating": 5.0, "text": "Facility has greatly improved regarding staffing and quality care. Amazing administrator who is always willing to go the extra mile for his residents. Director of Nursing is wonderful and the new facility Physician and his team of Nurse practioners are a cut above the rest!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "104696738310607939111", "name": "Austin Wimberly", "time": 1578412482538, "rating": 1.0, "text": "The nursing staff is adequate.\n\nThe business office is completely unprofessional.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "103888970146865530217", "name": "Dianna Hodgson", "time": 1561656600042, "rating": 1.0, "text": "Leaving one star because y'all don't take care of your patience. Instead you medicate them. Shame on you.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "101713797732628984736", "name": "R", "time": 1513582850986, "rating": 1.0, "text": "DO NOT SEND YOYR LOVE ONES TO THIS DUMP! UNPROFESSIONAL,  UNCARING, NON RESPONSIVE. CAN'T PROVE EDERLY ABUSE BUT I KNOW THEY DID NOT TREAT MY MOM AND OTHERS WITH THE BEST CARE. RANDOLF DOES NOTHING BUT COVER UP LIES AND DEFEND HIS INCOMPETENT STAFF.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "113195248568375752987", "name": "Amber Mcmillion", "time": 1539281888161, "rating": 1.0, "text": "I WOULD NOT recommend anyone to bring their loved ones here 1 of the worst nursing home it’s filthy they have mold all over the entire building the patients do not get the proper care like their suppose to.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "100781842784472948628", "name": "bliss littlekiss", "time": 1563222899154, "rating": 1.0, "text": "This place forces patients on hospice against their will. Sick place!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "101116539383157238848", "name": "Karla Rugg", "time": 1518985018615, "rating": 5.0, "text": "Had a very good experience with therapy. Nursing was very helpful and Kari from dietary was awesome in helping me with my meals", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "102002512559437235153", "name": "Paige Hopper", "time": 1516031630910, "rating": 1.0, "text": "This place is DEPLORABLE and should not be in operation. It's filthy and the staff is highly incompetent. Truly a nightmare!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "110273678179079946315", "name": "K Perez", "time": 1564080225536, "rating": 1.0, "text": "This place has denied civil rights of patient Marian Leonard  and refusing her to have any visitors and forced hospice . This is an outright injustice .", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "100545358489924953569", "name": "Melissa JOHNSON", "time": 1610734350243, "rating": 5.0, "text": "They take awesome care of their residents", "pics": null, "resp": null, "gmap_id": "0x888990bfddde49b7:0xe0e150ad08b74adf"}
{"user_id": "109183317310569899519", "name": "Melissa Rosenblum", "time": 1548262371504, "rating": 5.0, "text": "Friendliest staff I have come across in a facility here in Alabama\nFelt like home walking in", "pics": null, "resp": null, "gmap_id": "0x888990bfddde49b7:0xe0e150ad08b74adf"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1499096306648, "rating": 4.0, "text": "This is a great retirement home with quality staff", "pics": null, "resp": null, "gmap_id": "0x888990bfddde49b7:0xe0e150ad08b74adf"}
{"user_id": "108737397967940177222", "name": "SayD Roblox,Minecraft", "time": 1524157521487, "rating": 5.0, "text": "Excellent facility and awesome staff!", "pics": null, "resp": null, "gmap_id": "0x888990bfddde49b7:0xe0e150ad08b74adf"}
{"user_id": "111075500067536412303", "name": "Susan Warren", "time": 1532822348798, "rating": 4.0, "text": "(Translated by Google) Friendly quiet serial place\n\n(Original)\nFriendly quiet seriel place", "pics": null, "resp": null, "gmap_id": "0x888990bfddde49b7:0xe0e150ad08b74adf"}
{"user_id": "113188465781455096354", "name": "Shirley Vickery", "time": 1492103229643, "rating": 5.0, "text": "My Mom will be moving in to Regency Pointe in a few weeks and our entire family has been so happy with the experience.  We have been on the waiting list for several months so Stephanie has shown the facility multiple times to different groups of family members always with a smile.\n\nWe visited every available establishment for senior living in the Birmingham area and were about to give up when Mom found her new home.  We look forward to a new beginning for her.", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "110136585397199108676", "name": "Derriel Anderson", "time": 1521868085142, "rating": 5.0, "text": "Have been moving tenants in and out since Regency Pointe since it first opened! Gr8 Staff and cleaning crew, and maintenance, Always really cheerfull employees!  ***** star rating!!!", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "103689486983816871863", "name": "Jason Morgan", "time": 1483845061538, "rating": 5.0, "text": "This is a real nice place. If you can pay it this is where you want to be in your golden years.", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "113559016576709729473", "name": "CARL E. OUTLAW", "time": 1594837088045, "rating": 4.0, "text": "It was a nice place. The staff were very helpful and concerned", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "100316117299975939610", "name": "Kim Graben", "time": 1611942862940, "rating": 5.0, "text": "Wonderful place to work !", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "113998331705551303870", "name": "Latoya Davis", "time": 1607012048525, "rating": 1.0, "text": "Please I would love to give this place zero stars if I can they have have not been giving me my medicine for the last three days and I have been feeling bad lately I'm begging you please send ur family somewhere else you must want them to die and we have covid-19 up here and they will mistreat you up here so please don't send them", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "103373187312895534250", "name": "Stephen Gray", "time": 1596661474916, "rating": 1.0, "text": "Worst experience ever with my mom. They didn't care bout her needs.", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "113118746444123928144", "name": "Kaitlin Cunniff", "time": 1548880370753, "rating": 1.0, "text": "They dont anwser the phone. Never!", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "117420223986954679868", "name": "Joshua Stark", "time": 1561146133750, "rating": 5.0, "text": "Amazing service", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "102736592579548146252", "name": "DAVID STEIN", "time": 1610211490226, "rating": 1.0, "text": "S'il vous plait negredez vos parentzz ici.   Please listen to moi.  This place is a death trap.  It will probably be the last stop.   Ecoutez a' moi.  I made special trip to here from my home in Canada to bury my mom.  Stay  away from this place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOhvdTWbdZXY6Cwmd2_EGJrXbIcZuTMQKo0AscJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEZakz8P5CfQ1LVI3I7wRlplSAbSxpbJMxt6pY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88861d339e175dbf:0xd3b6d267e54316d3"}
{"user_id": "104146360559980491130", "name": "andrew gay", "time": 1604526170972, "rating": 1.0, "text": "I'm currently a resident. Please, please, please if you have a loved one don't send them here. I have found dishonest people working here, things go missing.", "pics": null, "resp": null, "gmap_id": "0x88861d339e175dbf:0xd3b6d267e54316d3"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1493380820482, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x88861d339e175dbf:0xd3b6d267e54316d3"}
{"user_id": "107373092112583743091", "name": "Amanda Cottingham", "time": 1618454877325, "rating": 1.0, "text": "Unprofessional, promised caregivers would show up and they didn’t, overpriced", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104231151786036000478", "name": "Carleatha Cunningham", "time": 1586641493889, "rating": 5.0, "text": "Visiting Angels is great place to work for. They are very friendly staff and supervisors. I have been with them over 3 years. I wouldn’t trade my job for anything. Best place to work. We also provide the best care your love ones need. We treat them as they are family to us.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "111725954257914046370", "name": "Stephanie Bennett", "time": 1586653030483, "rating": 5.0, "text": "I've used Visiting Angel's in the care of my 81 year old dad. There was so much genuine care given. I  was glad to see this in this day and age. They were not just there because it was their job but they truly cared about the patient,  the family as well as their duties.  I would recommend  Visiting Angel's to others.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108815118350255098371", "name": "Amy Self", "time": 1586641395099, "rating": 5.0, "text": "I started working with visiting Angel's a few weeks ago. The application was easy yet thorough. They try to match caregivers and clients so there is a seamless relationship. I love the company.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108173745048498664522", "name": "Elizabeth Boyd", "time": 1586640915093, "rating": 5.0, "text": "Visiting Angels is a wonderful company to work for! Russell is an amazing employer and puts his heart into his company. His compassion and love for our elderly shows in how he runs his company from day to day! He is an advocate for his caregivers that work for him as well as the clients we assist! I have worked for multiple companies in the same capacity in the past but Visiting Angels in Trussville is a step above the rest!", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103601637782308160725", "name": "David Jones", "time": 1589481756416, "rating": 5.0, "text": "Visiting Angles has been a lifesaver! They have provided great caregivers for my mom and helped us through a difficult time. Special thanks to Russell and Tosha for their great work. They have always been there when we needed them.", "pics": null, "resp": {"time": 1589562415082, "text": "Thank you so much David! We appreciate you taking the time to leave us this 5 star review! We love serving your family!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "115695062083607979183", "name": "Adrian Wilson", "time": 1586645400358, "rating": 5.0, "text": "This company definitely has your best interest at heart. They care about their employees as much as they care about their clients. I have enjoyed working for this company so far.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108388417865099477412", "name": "Matt Johnson", "time": 1591141521003, "rating": 5.0, "text": "Visiting Angels is best provider in the Birmingham area. Russell and his team are true Angels. They have an outstanding team in place to take care of our loved ones.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "116627560202828199088", "name": "Carolyn Foster", "time": 1586478415688, "rating": 5.0, "text": "Great place to work. I have worked 4 years for them. They are awesome. Office Staff is great.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "111846307544741383544", "name": "Amy Patton", "time": 1559680786928, "rating": 5.0, "text": "Russell and the staff at Visiting Angels are nothing short of amazing! We personally used Visiting Angels when my mother in law had a brain aneurysm and stroke. The caregivers worked so well with her, encouraged her to complete her physical therapy and were able to take her to doctors appointments and errands around town. They did a great job of matching caregivers that had similar interests. I would recommend Visiting Angels, they are the reason that she has made a full recovery!", "pics": null, "resp": {"time": 1573145881111, "text": "Thank you for taking the time to leave such a wonderful review! We loved serving your mother-in-law during her physical therapy!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104326453712244781163", "name": "Michelle Ryder", "time": 1589421416544, "rating": 5.0, "text": "Great company.  Caring loving employees that are dedicated to taking the best care of your loved ones.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108490534437085708053", "name": "brenda varnado", "time": 1586644801065, "rating": 5.0, "text": "The angel taking care of my mom  andwas gentle understanding. My mom had Alzheimer's it's a very tough desase. she was there for my mom she was there for moms animals and she was there for us. If I had to do it again I would want an angel to come stay with our family", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104405772251198497437", "name": "James Church Nicholas", "time": 1589418651353, "rating": 5.0, "text": "Very capable staff and very courteous.  They do fantastic work.", "pics": null, "resp": {"time": 1589464676260, "text": "Thank you so much James! We appreciate you!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103125990681787915424", "name": "Susan Humphreys", "time": 1573075479915, "rating": 5.0, "text": "Great place to work. Very rewarding  placing caregivers in client's home that have a passion to work with geriatrics and hearing how pleased the clients are when we take care of their loved ones.", "pics": null, "resp": {"time": 1573145301091, "text": "Thank you very much Susan! We appreciate you taking the time to leave us a 5-star review!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104867617895483229284", "name": "Logan Deen", "time": 1583183931324, "rating": 5.0, "text": "I personally know Russell, who is the owner of Visiting Angels. The passion he has for his business rivals none, and he truly cares about his clients! I highly recommend Visiting Angels!", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "115458503395768024366", "name": "Brent Nail", "time": 1586382001560, "rating": 5.0, "text": "Visiting Angels is a great and trustworthy company. I highly recommend them for any home hospice or bedside caregiver needs.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "110226495917680018206", "name": "Robert Mills", "time": 1573086931999, "rating": 5.0, "text": "Russell and his team are top notch. If you’re looking for honesty and caring people, look no further than Visiting Angels.", "pics": null, "resp": {"time": 1573145336562, "text": "Thank you very much!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "108137301706479743421", "name": "Pat Boyd", "time": 1589419786070, "rating": 5.0, "text": "I personally know some of the staff and they go above and beyond taking care of their clients. Great place!", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103347049886603142800", "name": "Bridget Baughan", "time": 1573145364996, "rating": 5.0, "text": "I know Russell personally and have no hesitation recommending him or his company Visiting Angels.  He is a very honest, sincere individual and you can't go wrong using his services.", "pics": null, "resp": {"time": 1573149818458, "text": "Thank you Bridget! We are so grateful you would take the time to write us a review!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1573075094432, "rating": 5.0, "text": "I cannot day enough about Visiting Angels! Top top senior care! Great staff! Highly professional! Glad Visiting Angels is in our area of Alabama!", "pics": null, "resp": {"time": 1573079038006, "text": "Thank you very much Brice! We appreciate you!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "114980489499108088531", "name": "Tosha Pritt", "time": 1580926912223, "rating": 5.0, "text": "Wonderful place to work!!! Amazing compassionate caregivers and office staff  always willing to go the extra mile for the families we serve!!", "pics": null, "resp": {"time": 1580937909853, "text": "Thank you very much for taking the time to leave us this wonderful review! We really appreciate you sharing your experience with others!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "110609466684367432364", "name": "Tmya Cunningham", "time": 1586653394705, "rating": 5.0, "text": "Thanks for taking great care of me and my newborn.", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "103965646714963555201", "name": "Sandra Shaw", "time": 1559853593181, "rating": 5.0, "text": "Great company to work for with very flexible hours to fit any schedule. Phenomenal boss that helps make working for his company pleasant!", "pics": null, "resp": {"time": 1573145843849, "text": "Thank you, Sandra!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "114051331414799956789", "name": "lester barnes", "time": 1561786072903, "rating": 5.0, "text": "The caregivers at Visiting Angels Trussville give the agency its name for sure.  Could not ask for better care giving for my mother and father.", "pics": null, "resp": {"time": 1573145835402, "text": "Thank you very much Lester!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "100732410138354627708", "name": "Keondra Cunningham", "time": 1586644086496, "rating": 5.0, "text": "Great experience and amazing staff", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "117516424883176765311", "name": "Devon Payne", "time": 1586641161557, "rating": 5.0, "text": "Great Service and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1492276314390, "rating": 5.0, "text": "Took care of my mother. Very professional and friendly. The whole experience was great.", "pics": null, "resp": {"time": 1573145929600, "text": "Thank you Mr. Patton! We appreciate you!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "104942055270323946103", "name": "Quentin Dunn", "time": 1573134102324, "rating": 5.0, "text": "Russel goes above and beyond for his client.", "pics": null, "resp": {"time": 1573145628793, "text": "Thank you, Quentin!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "107962992332172116908", "name": "_KHLOE BOYD_", "time": 1507049167317, "rating": 5.0, "text": "LOVE MY JOB ITS AWESOME!!!", "pics": null, "resp": {"time": 1573145897381, "text": "Thank you Ebony :)"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "116954182961211101854", "name": "Jacob Buffington", "time": 1521139678002, "rating": 5.0, "text": "Great office!", "pics": null, "resp": {"time": 1573145888358, "text": "Thank you Jacob!"}, "gmap_id": "0x88890db071c2b055:0x4cad83cc46f2f4a3"}
{"user_id": "115926104777923312048", "name": "Pam Sloan", "time": 1534472176328, "rating": 5.0, "text": "Mom was there 6 years and loved it! It is great for those who are independent and want a safe but active community.", "pics": null, "resp": null, "gmap_id": "0x8888a7f89cfd6d4b:0xff64383763bec1c7"}
{"user_id": "114227220471893669600", "name": "Carrie Brighton", "time": 1557769989192, "rating": 5.0, "text": "They help take great care of dad", "pics": null, "resp": null, "gmap_id": "0x8888a7f89cfd6d4b:0xff64383763bec1c7"}
{"user_id": "111785872727961500910", "name": "Briley’s World", "time": 1505754329866, "rating": 4.0, "text": "Not enough actives.", "pics": null, "resp": null, "gmap_id": "0x8888a7f89cfd6d4b:0xff64383763bec1c7"}
{"user_id": "116327062689188864275", "name": "Michael Schmidt", "time": 1599773722306, "rating": 5.0, "text": "My Mom was a resident of memory care at The Blake for several years before her passing  in July 2020. Though initially it was tough transitioning her from her home to a care facility (she was a strong-willed even WITH  dementia!), she adjusted thanks to the love and care she received. I never regretted my decision. Kudos the Director John Michael, the management team and the entire group of caregivers. I never worried about Mom's safety or well-being while she lived at The Blake. Thank you for making her part of the family and for my peace-of-mind!", "pics": null, "resp": {"time": 1600102521159, "text": "Michael, thank you so much for leaving this wonderful review and sharing your experience with our community. It was such an honor and privilege to have your mother as one of our residents and as part of the family here. We will pass along your kind words to our team, and always feel free to reach out if you need anything in the future. Take care!"}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "112982996826709383060", "name": "Claudia Daniel", "time": 1599875148108, "rating": 5.0, "text": "Our mom arrived at the Blake at Malbis pretty much kicking and screaming. Much different story now, she is happy,  calm,  and grateful that she doesn’t have to worry about her house upkeep anymore.\nHer major adjustment took about 3 to 4 weeks.\nJohn Micheal, the executive director is almost always able to talk when I have a question, so is the rest of the staff, they have all been so helpful and kind.\nBonnie and the other ladies who answer the phone are knowledgeable, helpful and friendly.\nThe nursing staff are the best by far, I consider them like friends and so does my wonderful mom.\nMom loves the food and keeps saying her pants are to tight now!\nThe activities director, Petra, always has something going on, right now she is putting together a grandparents day treat for the residents.\nJohn Michael has kept the family current with all updates about the COVID-19. The Blake is very cautious about opening up to soon, for this I’m extremely grateful. It’s a horrible way for any loved one to pass. They have in my opinion gone out of there way to try ways for us to see our mom.\nI chose The Blake for our mom 1 year ago because it felt like a home when I went on my first tour. My opinion has not changed.\nWe dreaded putting mom in a home, but we have been so happy, and so has she, because she is in a place that is like a home.", "pics": null, "resp": {"time": 1600103346861, "text": "Thank you so much for sharing your experience with our community, Claudia! Your mother is a joy to have as our resident and we most certainly appreciate your involvement as well. We're always striving to provide the best care possible for our residents and reviews like this are so great to see. We will definitely be passing along your kind words to our team."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "105070145967308205286", "name": "Jason Smith", "time": 1623080173053, "rating": 1.0, "text": "Our family had a terrible experience. I find the facility unfit to care for the elderly.", "pics": null, "resp": {"time": 1623170896413, "text": "Hi Jason,\nWe want to take the chance to apologize for the negative experience you've had with our community. We'd really like to know more about your situation in order for us to improve. Please reach out to  Executive Director, Tammy Robinson, at tammy.robinson@blakeliving.com to discuss matters further."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "104722835199709268956", "name": "Janet Norman", "time": 1602096283857, "rating": 5.0, "text": "My mom suffered from dementia and short term memory loss and I tried having her live with me.  It was clear I could not provide her the care she needed.  The staff at The Blake - Malbis (memory care) loved and cared for my mother like I never expected.  Mom went on outings, participated in activities.  I visited her all times of the day throughout the week and found her well cared for and engaged in activities.  Turning over your parent to others for care is a very difficult decision but at The Blake - Malbis she was under the best care you could ask for.  The staff made a very difficult situation much easier for me and my brother.  Mom was better looked after than I was capable of doing.  Thank you everybody, especially John, Petra, and Rachel.", "pics": null, "resp": {"time": 1602164653137, "text": "Janet, we really appreciate you leaving this thoughtful review on our community. It truly means a lot to us, and we'll make sure to pass your review on for our staff to see. Taking the best possible care of our residents and offering support to family members are our top priorities, and reviews like yours reassure us we're on the correct path."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "102410317476924001484", "name": "Rhonda Winder", "time": 1606874516652, "rating": 1.0, "text": "While our family has an overall great impression with The Blake at Malbis, we do have an experience with them that isn’t so great. They can very easily rectify matters, but so far they refuse to do so. It has to do with the beauty salon.\nIf you’re loved one wishes to get their hair done they may make use of the in-house salon. There is a form that the person responsible to pay the salon charges fills out. You may leave a credit card on file and you may opt to just have your card used whenever the resident wishes or be asked if you’re in agreement with your family member having their hair done before being charged. This is so that a family member who is losing their mental acuity doesn’t decide to go get their hair done too often, which was our situation, and we stipulated on the form that we’d like to be contacted first.\nHowever, our card was charged several times with no permission request beforehand. To the tune of approximately $500.00. With our busy life we didn’t catch these charges as they were incurred. Once we did see them, we called and got them stopped.  To their credit, The Blake admitted they were in the wrong. However, it has been over a year of requesting the fraudulent charges be reversed or having a check sent to us. We’ve been in touch with the beauty salon, patient representatives, the facility manager and a regional manager. We’ve allowed each person along the way ample time to make it right, sometimes two months before we call again, but no resolution is ever forthcoming. Now, they’ve stopped taking our calls.\nWe will now pursue this with our credit card company.\nOur family member passed away in May of 2020, so they are no longer a resident. I would hate to think that is the reason we now are not even getting our phone calls answered.\nIf you’re wondering why our family member passed away, it was due to the virus. We were told she was the only one in the whole facility to contract it. A subsequent email from The Blake that was emailed to families of the residents claimed to have zero cases of the virus at The Blake.\nI suppose no place can be 100% above board at all times, but these things concern us.\nPlease don’t misunderstand us. We realize the virus is strange and can effect some and not others. We have no ill feelings in that regard. These things happen. But we would love to be treated as well as we were when she was accepted there.\nWe have no other complaints. The facility was a beautiful and very nice place for seniors.", "pics": null, "resp": {"time": 1607627659872, "text": "Hi Rhonda,\nFirst and foremost, we want to apologize that you've had this unpleasant experience. During this unprecedented time, we have made, and continue to make, it a priority to keep our residents and families as up-to-date as possible with the most accurate and timely information available to us. Additionally, we strive to partner with the best service providers in order to give our residents the highest quality services and amenities possible. We understand you have had a frustrating experience working with our previous stylist provider and we are currently working hard to reach a solution for you. We are grateful to have had the opportunity to care for your mother and we want to thank you for your trust and kind words regarding the care she received as a resident here at The Blake."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "102541788083236430707", "name": "D Joiner", "time": 1601219044267, "rating": 1.0, "text": "I have never written an online review, but the experience we had with this facility warrants my remarks. My mother was a Memory Care resident for 2 months 25 days before removing her from this facility.  Once home she was examined by our physician along with labs received from the Blake.  She had lost approximately 20 lbs, was poorly nourished (per lab work), had a large pressure ulcer on hip (never reported by staff), cellulitis in lower extremity (never reported by staff or wasn’t being treated).  She walked in on admission and was wheelchair bound upon leaving. As I said that is the SHORT LIST of issues we had with this facility.  Don’t be fooled by the\n“nice facility or friendly staff”.  My mother was neglected physically and medically.  I am not just a disgruntled daughter. I worked in critical care for years, served as nurse manager of a critical care unit and a cardiology outpatient clinic.  I know poor care when I see it!!!", "pics": null, "resp": {"time": 1601312298132, "text": "Hi D,\nWe apologize that you’ve had a negative experience with our community. At The Blake, we're committed to offering the best care possible for residents, as well as support for family members. Although it’s never easy to receive reviews like these, we take them very seriously and we'd like to resolve any issues you've had with our level of care. If you'd like to discuss these matters further, please contact our Executive Director, John Michael, at john.michael@blakeliving.com."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "100806825528281228885", "name": "Sam Adams", "time": 1595970680052, "rating": 4.0, "text": "Our only problem with The Blake, is information, few of the staff will give out info. In particular our Dad,(93 yrs.) was admitted during covid 19 and quarantined until negative test result, we were told 2 days to get result, after 5 days we questioned why no result, after a full fay and multiple calls we were then told 3 days in quarantine before test is even performed. Not veryhvery", "pics": null, "resp": {"time": 1599084003454, "text": "Hello Sam,\nWe sincerely apologize for your frustrating experience; we know how stressful a delay in receiving information can be, especially in times like these. Also we want to thank you for your support and patience as we navigate through these unprecedented challenges.  We would like to reach out to see how can better improve this process, so this isn't repeated in the future. Please contact us at (251) 625-6400, so we can discuss this matter further."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "103983899574838410635", "name": "Brad Hinman", "time": 1580843704061, "rating": 5.0, "text": "My Mom has been in several assisted living facilities over the years and this is the best! Highly recommend...", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "111806280179011817404", "name": "Susan Holmes", "time": 1555170187913, "rating": 1.0, "text": "My Dad lasted a total of 45 hours in their Memory Care facility. During that time he fell 3 times. They said he was physically aggressive and called an ambulance to take him to the hospital. They only way we knew this was - the hospital called for information.  If he became angry, and he might have, it was because he was scared!  However, 2 hours later when the ambulance did arrive, he was asleep in his chair.  He is now in the hospital with pneumonia.  These residents are not safe! Oh! ...and I had left him a gift bag with a variety of items the first day.  We never found it!", "pics": null, "resp": {"time": 1556119173510, "text": "Hello Susan-\nWe would like to sincerely apologize for your experience at our beloved community. As resident care and employee support are our top priorities at the Blake, we take these comments very seriously. John Michael, our Executive Director, would love to speak with you further about your experience. Please call (251) 625-6400 to reach him. Again we appreciate your comments and apologize for the negative experience."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "104444656726440711552", "name": "Natalie Davis", "time": 1501201684152, "rating": 5.0, "text": "Prior to working at The Blake, I worked WITH The Blake. They truly care about the residents and their families. It is a beautiful community, the food is great, and it is a fun place to be. I would most definitely place my family here when the time comes.", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "108986922367231436901", "name": "Jerre Brisky", "time": 1495836065540, "rating": 5.0, "text": "Wonderful and gorgeous facility.", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "100097772095906838392", "name": "Crooked Smile", "time": 1462549050499, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
