{"user_id": "107818827383601040527", "name": "SaintMegery15", "time": 1601517218003, "rating": 5.0, "text": "Only been here twice, but had an awesome experience! My instructor was Laura and she was great! Highly recommend checking the place out regardless of your experience level.", "pics": null, "resp": null, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "117087636439447869447", "name": "Taylor Goodwin", "time": 1573096898017, "rating": 5.0, "text": "Such a fun and positive environment. I have never felt more welcomed and accepted than I have with my pole family. Elle runs the best studio in Alabama, and employs the best instructors. Everyone is so uplifting and encouraging through the process of learning and perfecting pole tricks safely. I couldn’t praise Elle or her instructors enough. The studio has changed my life and given me so much confidence in my self and in what I can accomplish, in and out of the studio. I leave every class with something new, and it’s my favorite way to work out!", "pics": null, "resp": {"time": 1573484941082, "text": "Taylor, you are a joy and a complete beast. We love having you at the studio!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "108735130160287974459", "name": "Brandi Darty", "time": 1571269490754, "rating": 5.0, "text": "I love taking classes at Studio Steel.  Elle and her fellow teachers always make me feel welcome, confident, and comfortable. Pole is such a fun exercise! I was hooked at my Taste of Pole almost a year ago. Give Pole a chance! You won’t regret it!", "pics": null, "resp": {"time": 1571271076291, "text": "Thanks Brandi, we love having you at the studio!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "116512171448465134690", "name": "Stephanie Smith", "time": 1582688330449, "rating": 5.0, "text": "Fantastic studio! The most amazing instructors; they really care about their students progress and want to help in every way. I have loved the classes I’ve taken so far and will definitely be back for more.", "pics": null, "resp": null, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "108495221448313984188", "name": "jenny machen", "time": 1562438676414, "rating": 5.0, "text": "I’ve been attending classes for about 5 months now and I feel wonderful! If you don’t like the gym and want to try something different this is the perfect place for you. I’ve always felt encouraged here, and have felt myself become so much stronger both physically and mentally! It isn’t easy, but it is SO WORTH IT!", "pics": null, "resp": {"time": 1562506055101, "text": "You are a source of endless fun and positivity! I am so glad you chose Studio Steel - I love how you try everything without screaming lol"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "103977678075375672494", "name": "Nneka Gunn", "time": 1562530186339, "rating": 5.0, "text": "I went from someone who didn't think very much of herself to someone who has not in only grown in strength physically, but mentally as well. Today, I am stronger, more confident, and more fit than I've ever been and it is all thanks to the love, support, and instruction I've received from the owner Elle and her wonderful team of instructors.\n\nI recently competed at PSO Southern on the Studio Steel Team and I won a gold medal!!! I'm three months into pole sport and this is the type of results I've received in such a short period of time.\n\nIf you like to workout in a judge-free environment filled with people of all backgrounds then this is the place to be. Prices are great, the instructors are incredible, and I'm delighted to say that I've gained a whole new family with my pole sisters!\n\nSee you in class!", "pics": null, "resp": {"time": 1562532700862, "text": "You are a ray of sunshine in the studio! You are always encouraging and inspiring to everyone, and as for your gold medal: YOU DID THAT and it was just plain beautiful to watch. xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "101408989439602486738", "name": "Peyton Stanley", "time": 1562426854322, "rating": 5.0, "text": "Amazing community and supportive instructors who always listen. Very considerate of each person's limits and will help you find ways to do things you didn't know you were strong enough to accomplish. Welcoming and wonderful.", "pics": null, "resp": {"time": 1562430663442, "text": "We love you Peyton! Thanks for the confidence in us!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "100323010358199979456", "name": "Kathryn at Redemptive Cycles", "time": 1562422788278, "rating": 5.0, "text": "Elle & the community are wonders. I love this studio so much: it is welcoming, inclusive, encouraging & SO FUN! I've done a progressive class here, had a surprise bday party (BEST Dirty Thirty party EVER - props to Elle for helping my beau pull that off), and have done several stand-alone classes. Each experience left me feeling empowered, strong and sexy AF. You may be timid to walk in but you'll feel like a million dollars when you walk out!", "pics": null, "resp": {"time": 1562430748382, "text": "Thanks Kathryn! xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "109297461363289862660", "name": "Demiboy Dorito", "time": 1597709026283, "rating": 5.0, "text": "awesome classes and atmosphere!!! very kind and talented folks!", "pics": null, "resp": null, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "102067650701121365390", "name": "Destinee Marie", "time": 1503545116430, "rating": 5.0, "text": "Going to class at Studio Steel is definitely my favorite place to go/do through out the week. Corinne an Elle are some of the most friendliest people I have been delighted to meet. I have started learning this form of dance as a complete beginner with no experience in really any dancing or fitness and Corinne has been an excellent and patient teacher!", "pics": null, "resp": {"time": 1503693003670, "text": "Thanks, Destinee! It's great to see you getting stronger and flexier and learning those pretty moves!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "113370131676107905675", "name": "Cassie Renfro", "time": 1524527762238, "rating": 5.0, "text": "I love going to Studio Steel! I started as a complete beginner and have loved it from the first second of class. It’s a super inclusive and friendly atmosphere where everyone is welcome. It’s a great way to get a full body workout with amazing people!", "pics": null, "resp": {"time": 1524531646990, "text": "Thanks, Cassie! Your progress has been so much fun to watch!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "101043115690362851359", "name": "J D Porter", "time": 1503502380368, "rating": 5.0, "text": "Finally, a professional vertical fitness facility in B'ham!  Pole is an incredible workout and it's greatly enhanced when the instructors and the studio are top notch, like they are here.  Studio Steel is a new, unique, and very comfortable space that really lets you focus on the workout.  I so like the look and feel of the place.  The pleasant surroundings, ample parking, professional equipment, and quality accessories in the boutique let it all come together.  Definitely worth a visit.  And, they've got a great $10 \"Taste of Pole\" option that newbies should absolutely check out.", "pics": null, "resp": {"time": 1503710989469, "text": "Thanks, JD - that means a lot coming from you! I know you are a huge fan of all things pole and it's good to know you approve. xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "109349167885662516841", "name": "Who Knows", "time": 1539543798564, "rating": 4.0, "text": "I would give it 5, but while I loved Elle's energy I was totally turned off by Corinne. She just didn't seem to know the difference between what's appropriate to speak about as a teacher and what isn't. She just was a major over sharer of her personal life, and the worst part was her young son is feet away possibly listening to his mother talk about inappropriate things.", "pics": null, "resp": {"time": 1539545155623, "text": "Thank you for your feedback. I don't think you are alone in this opinion. She doesn't work here anymore, and the new instructors are far more professional in both their conversation and their teaching. Please come try another class and see what I mean! xoxo Elle"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "102359538113372438245", "name": "Kasi C McPherson", "time": 1562543003271, "rating": 5.0, "text": "Stopped going to the gym and started coming here for my fitness. It’s so much fun and love the instructors.", "pics": null, "resp": {"time": 1562600613360, "text": "We love you too Kasi!😘"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "100758672122723167148", "name": "Madame Camembert", "time": 1503594237409, "rating": 5.0, "text": "Studio Steel is welcoming and inclusive. Instructor Corinne is enthusiastic, accomplished, and very strong - an excellent spotter who will never let you down. Pole is so much fun!", "pics": null, "resp": {"time": 1503710924231, "text": "Merci, Madame! Five stars for you too!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "117519148265845830763", "name": "Isabel Medina", "time": 1539240353341, "rating": 5.0, "text": "Love the studio and love Elle. The space is very cool and clean. It was a wonderful class and a great workout!", "pics": null, "resp": {"time": 1539260334058, "text": "(Translated by Google) I love you Isabel!\n\n(Original)\nTe amo, Isabel!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "114874055451960096950", "name": "Leslie Williams", "time": 1562424597116, "rating": 5.0, "text": "Such a welcoming and inviting place. No matter your skill level, you can call Studio Steel home!", "pics": null, "resp": {"time": 1562430687540, "text": "Thanks, Leslie! xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "114519519707451427421", "name": "Dolores Esme", "time": 1539309098888, "rating": 5.0, "text": "Fabulous place! Great for group parties", "pics": null, "resp": {"time": 1539347386056, "text": "Thanks, Dolores! Glad you had fun!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
