{"user_id": "104071629023985455580", "name": "Gary Standridge", "time": 1570650271221, "rating": 5.0, "text": "In my opinion Infinity golf carts is without a doubt! The best golf cart places out of the ones I've already been to. Their staff is amazingly friendly! The prices on their carts I really great even their used ones! Their staff is amazingly friendly. They're cart repair is done fast and efficiently. So if you're looking for a golf cart gas or electric. I ordered you to go by Infinity golf carts and just look around! I think you will be very happy you did.", "pics": null, "resp": {"time": 1570651224040, "text": "Thank you for your business!  We loved taking care of you!"}, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "113026984967679017722", "name": "JD Mobile Karaoke", "time": 1562949429538, "rating": 5.0, "text": "As a business owner, I look for integrity and honesty to earn my trust to do business with others. I bought a used cart \"as is\" and when I got it to my property, it had a small issue with it. I called Blake the same day and he went above and beyond what I expected. He sent one of his mechanics the next day--45 minutes from his business--and took care of the issue and now it runs like a champ! Blake has earned my trust and I will definitely be using this business again.", "pics": null, "resp": {"time": 1562955663537, "text": "Thank you for your confidence and business!  We look forward to taking care of you in the future!"}, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "103681132548110911841", "name": "Myfirstcar66", "time": 1576294691772, "rating": 4.0, "text": "They're just getting started- older building but they're making improvements and the owner was VERY helpful with my needs when I was just passing through town.", "pics": null, "resp": {"time": 1576340539341, "text": "Thank you sir,\nWe will be here whenever you need us!"}, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "105395352801366805481", "name": "Nichole Bentley", "time": 1530619583181, "rating": 5.0, "text": "Great company with very reasonable prices. Blake is super helpful and very quick to pick up if you're having any golf cart issues. I've had him repair my cart and we bought a second cart from him. Definitely the best place in town if you're in need of a golf cart or golf cart repair!", "pics": null, "resp": null, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "109223916688361373206", "name": "Louann Ciesinski", "time": 1540485974888, "rating": 5.0, "text": "The customer service is great and the staff is very knowledgeable about their golf carts. What we liked was that they have used and new golf carts. I will recommend this dealer and Blake to all of our friends and family.\n\nL. Ciesinski", "pics": null, "resp": null, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "112039741422340154913", "name": "Beau Murphey", "time": 1541694559541, "rating": 1.0, "text": "I bought a golf cart from Infinity about a month ago. My goal was to take it to Florida and have it street legal. Although I knew I should buy from another dealer and probably in a Florida, the owner, Blake, assured me that he would make it legal and promised on at least 3 occasions that if it didn’t pass inspection that he would take the cart back and refund all of my money. I knew I should have gone with my gut, but instead I tried to help the little guy out and go with the small business owner.\n\nI rented a trailer and drove two hours from Atlanta to pick up the cart. Although we had agreed Exactly what would be put on the cart, when I showed up only about half of the items were on the cart. I should have left then, but I had already put down a $1000 deposit for the work. An argument ensued with Blake and when he got there his workers started to put items on the golf cart. However, even though he told me he had them, all of the necessary items were not even in his possession. Many of the nuts and bolts had rust on them. It’s obvious that he just piece meals things together. If you are spending $50 it’s one thing, but when you are spending $5000 things should be right.  However , because I drove all that way  I elected to take the cart anyway and purchase the necessary missing items.\n\nWhen the final purchase was made, Blake also guranteed the golf cart would run for one year. Well, two weeks after purchasing the cart it started to have trouble. After not passing inspection in Florida, I called Blake and he somehow claimed amnesia about offfering to take the golf cart back- just as I had predicted. So, now I have a golf cart that doesn’t run and I have to take to a reputable dealer to have it repaired.\n\nSo, if you are consider purchasing a cart from Infinity Golf Carts, go over every inch of the cart before you accept and pay for it. Blale is Not a man of his word, so make sure that Everything is in writing. Even then, if you have a problem do not expect him to be a man of his word.", "pics": null, "resp": null, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "104848601759614433620", "name": "Louis Hernandez", "time": 1539174075873, "rating": 5.0, "text": "Great owners, prices, and service.I have dealt with Mr Pritchard for years now, always been fair and honest. Great to know somebody that can make things happen, without excuses!", "pics": null, "resp": {"time": 1539662936653, "text": "Thank you Mr. Hernandez, we really appreciate your business."}, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "115386385077596191780", "name": "Michael Smodilla", "time": 1540321587165, "rating": 1.0, "text": "Stopped by and there is nothing but junk carts and the guy didn't know what he was talking about. Total waste of time. Buyers beware.", "pics": null, "resp": null, "gmap_id": "0x888bb3b432a6556d:0xfeb121d6fbc9df14"}
{"user_id": "105969574643934975094", "name": "Frank Smith", "time": 1620513027724, "rating": 5.0, "text": "Friendly, competent, and they actually have stuff in stock. I have a problem with my Ranger and they are ready to fix it at a great price.  I'll be turning it in soon.", "pics": null, "resp": {"time": 1620514468670, "text": "Glad to hear from you and happy that your experience was a positive one!  We look forward to the opportunity to keep earning your business.  See you soon!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "110252099810614571917", "name": "Kenneth Lovett", "time": 1564693683430, "rating": 5.0, "text": "What a great experience. Spoke with Craig on the phone yesterday. When we arrived, after driving 71 miles, we were immediately greeted by Craig and taken to the bike. After the test drive, I bought it. I saved several $$ on this bike that is like new that they sold new and serviced it regularly.  Everyone here is so nice and they made us feel like we were a part of their family. I give Champion Powersports a big thumbs up !!! Thank you !!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNsRik5ZRRnKylE5pV7VusORKZu1yFXwUIxzrLJ=w150-h150-k-no-p"]}], "resp": {"time": 1565475617593, "text": "Glad you had a world-class experience, and thanks for the review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "110501743489689813402", "name": "Michael Vega", "time": 1615656869522, "rating": 2.0, "text": "Not one to leave reviews good or bad. But really disliked all my dealing with this place. Called two separate times to get my Rzr looked at (once was for a clutch recall), both times someone took my name and number and never got back to me. The other day went in there to get a price on a part. Was met with some attitude bordering on hostility. Dealership looks like it’s going downhill, very few units and low inventory. Real, shame since it’s the closest dealership to me.", "pics": null, "resp": {"time": 1615659560831, "text": "Thank you for your feedback. We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us at (256) 262-0888 to let us know how we can do better."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "114289758220957682328", "name": "Jacob Johnson", "time": 1615652790445, "rating": 5.0, "text": "Fast friendly service. Bought a rzr winch kit service kit and a belt. Fair prices and great products.", "pics": null, "resp": {"time": 1615655910071, "text": "We appreciate the feedback Jacob, and are glad you had a good experience with us.  Thank you and have a great day!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "100679709063211961693", "name": "Maria McSherry", "time": 1595888857175, "rating": 1.0, "text": "The sales experience was great! No complaints.\n\nMy garage kept, babied ATV with less than 22 hours on it started experiencing issues in May 2020. After researching the issue in case it was a simple fix, I requested a service appointment, and after several days I finally received a call stating they were behind. Fast forward to now almost 2.5 months later and every time I call to schedule the service, I’m told is that service department is behind, and they’ll get to me. That is too long for a service appointment. It makes me question how good the products really are...What good is the extended warranty if you can’t use it? My ATV is basically new and I can’t ride it. I will never purchase a Polaris product again.", "pics": null, "resp": {"time": 1595942996413, "text": "Sorry for the unusual experience.  We understand the frustrations of vehicle down-time, and work hard to shorten the time it takes to get your vehicle repaired when it does have issues.  We did have you scheduled for an appointment to bring your vehicle to us on May 18th and when you did not show we attempted to contact you to reschedule.  Since we did not hear from you we assumed the issues with your ATV were no longer a problem.  If your ATV still needs service, please contact us and we will be happy to get you back on the schedule for the next available appointment."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "113348500940330346829", "name": "Nickolas Shrewsbury", "time": 1601160669430, "rating": 5.0, "text": "Great Service. Got a new rzr they had us in and out within a hour. Wonderful people.", "pics": null, "resp": {"time": 1603145908500, "text": "Thanks Nickolas!  We appreciate your business!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102981865910519606897", "name": "James Toquero", "time": 1592192642932, "rating": 5.0, "text": "Great customer service! The crew at Champion Powersports will  definitely take care of you. Purchased a Polaris XP 1000 and couldn’t be happier! Thank you", "pics": null, "resp": {"time": 1592227722374, "text": "Thanks James for the positive review of CHAMPION POWERSPORTS. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "114856057493093119114", "name": "Lance Borner", "time": 1602777529469, "rating": 4.0, "text": "Nice facility, they were helpful and quick to unload the trailer.", "pics": null, "resp": {"time": 1603145957672, "text": "Thanks Lance!  Hope to see you again soon...."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "107257019692456628620", "name": "Angie Porterfield", "time": 1527690552702, "rating": 5.0, "text": "If you are looking for an off road vehicle (atv, side by side) this is the first place to look. There was no pressure to buy today. Only the desire to listen so that could find the right machine for our needs and not the most expensive thing on the lot. Our salesman Spencer and the rest of the knowledgeable staff was able to answer every question that we had. The Staff also treated my wife with the respect that lacks in other dealer experiences . We left that day feeling like we have gotten a great deal and amazed at how friendly and respectful the staff is. We cannot say enough great things about the buying experience through Champion Powersports. The parts department has also been very knowledgeable and courteous while helping with parts and accessories for our ATV. The Polaris 570 utility edition that we purchased could not have been a better choice for our needs. This ATV has no trouble pulling the 950 pound trail mower we use on the farm or putting that smile on your face at the end of a hard days work . The 570 has more than enough power for the tough jobs or excitement out on the trail. The best way to describe the Polaris 570 utility edition and Champion Powersports is simple. The right tool for the job. Thank you to everyone at Champion for what you do.\nMatthew Porterfield", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "118212818408385569752", "name": "chrisnfwb1", "time": 1592610725141, "rating": 4.0, "text": "Friendly people, good service.", "pics": null, "resp": {"time": 1592664488518, "text": "Thanks for your feedback, we appreciate the great review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104060068834511235346", "name": "chip pollard", "time": 1558792928585, "rating": 5.0, "text": "Awesome sales staff! We've bought 2 ATV's and a trailer from here. A possible new purchase soon.", "pics": null, "resp": {"time": 1563052344549, "text": "Thanks for the great review Chip! We appreciate it!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "109022703254944020962", "name": "Richard Harris", "time": 1469392629510, "rating": 5.0, "text": "Best buying experience I've had in a dealership type purchase. Very courteous and laid back staff that do not put pressure on you. Very straight up and honest with you. I will definitely be back for future purchases", "pics": null, "resp": {"time": 1498422111323, "text": "Awesome review - thanks!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104552545058395716550", "name": "Aaron Lutz", "time": 1503011078518, "rating": 3.0, "text": "It seems to be only a dealership. There is not a lot of appeal that i could find. Seems to be a little cramped in the store as well. If you came here to buy a Polaris or Victory definitely a good store to go to! If you want jackets and acccessories then might need to try some where else. I was told when i got recommended there that there was tons of appeal and accessories but i was very disappointed to find nothing really for motorcycle riding. Staff seemed nice but they are sales men so keep that in mind.", "pics": null, "resp": {"time": 1503063706627, "text": "Thanks for your feedback Aaron. We work very hard to ensure high levels of customer satisfaction and are proud to be the local shop focused on the customer, and not a \"big box\" retailer focused on the bottom line.  We have direct relationships with all apparel/accessory vendors and can get whatever you need to maximize your riding experience and customize your ride. Thanks again for your comments, and we look forward to seeing you again soon!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "117680176084032162806", "name": "Jesse Waldrep", "time": 1495312249993, "rating": 1.0, "text": "Was asking a tall sale guy to look at my unit right quick so I can order parts  wouldn't take 2 mins but he said they too busy and 26 buggies in front of me. ..  I wasn't asking to fix it just getting info  so if I did have to buy that 500 dollar parts I do it that day...  but no... so I said I go somewhere else  then  he said fine with him.  So I told him to stick them parts up his ass and I waliked out. So his Billy bad ass follows me out side running his mouth.  Seen I was packing and shut his mouth before I kicked it in   so I will never purchase another  part  from them again...", "pics": null, "resp": {"time": 1495545546572, "text": "We understand the frustration of vehicle down time, and work hard to get our customers in and out of our shop in an efficient and timely manner. We apologize that we weren't able to put you ahead of other customers already here for services, and based on your reaction in the store when you were told we would be glad to check your vehicle in to have it properly diagnosed it was not the answer you wanted to hear. If your vehicle still needs to be diagnosed or repaired our Service Team will be glad to assist you in making an appointment to address your vehicle repair needs."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104135130942264585315", "name": "Joe", "time": 1572103753232, "rating": 5.0, "text": "Nice store, will not find better ppl!", "pics": null, "resp": {"time": 1581179148896, "text": "Thanks Joe - we appreciate your business!!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "113945110795457964611", "name": "Lon Flurer", "time": 1442874362412, "rating": 5.0, "text": "Love my Victory Crossroads.   Friendly staff and fair price.  Not a lot of hidden addons to price. Big discount for former military.", "pics": null, "resp": {"time": 1498422234103, "text": "Thanks Lon! Hope things are going well and look forward to your next \"drive-by\" at the store :-)."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104724655789776760365", "name": "Thomas Clendening", "time": 1519051649971, "rating": 5.0, "text": "Fair and honest. They're in business to make money, not lose it but my deal was as good or better than others in North AL.", "pics": null, "resp": {"time": 1519057827816, "text": "Thanks for the review Thomas!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105159955907924829915", "name": "WAR CHILD", "time": 1541720648823, "rating": 5.0, "text": "Liked working with Mike Ferrazas!  Go see him!", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "116368612235696203835", "name": "Bradley Owens", "time": 1526768873524, "rating": 5.0, "text": "Robert and Brink are my go-to guys. Even though, Xtreme Offroad Ind. LLC (me) and Champion Powersports are competitors in our profession, every time I need to refill my supply shelf with Polaris specific maintenance items, or need to order specialty parts, I go see them. Usually you'll never hear of another powersport repair shop praising competition, but again these guys help me when I need it most.\n\nI sometimes order parts that are on back-order or out-of-stock, but Jeff and the parts guys can usually get me fixed up somehow by working some magic! I ordered a crankshaft that was 3 months out on back-order and somehow they got it in 2 weeks. That is true customer service!\n\nAgain, Jeff, Robert, Brink, I appreciate you guys and whenever I need more Polaris supplies you'll be where I go first!", "pics": null, "resp": {"time": 1526907960722, "text": "We appreciate your confidence in us! Thanks for the great review, and for your business."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "101624471453393067613", "name": "Savannah Nesmith", "time": 1343080854681, "rating": 5.0, "text": "Great vehicles for the outdoors!!! You will definitely have a great experience working with this store!!! Best prices in North Alabama.Thanks to Mike for taking care of everything I needed!!!!", "pics": null, "resp": {"time": 1498422272097, "text": "Thanks Savannah for the great review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "116829956589378256821", "name": "Joel Hamm", "time": 1381424596980, "rating": 5.0, "text": "Bought a Gem Car - Great Price and Great people - Highly recommend this is where you go buy an ATV or motorcycle.", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105862115595276623097", "name": "David Hagood", "time": 1368727562013, "rating": 5.0, "text": "Awesome Group of Power Sports enthusiasts great knowledge and Friends atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102598608647219907155", "name": "Terry Hess", "time": 1515519472285, "rating": 5.0, "text": "Great place was my first time but not my last!!", "pics": null, "resp": {"time": 1515855346246, "text": "Thanks for the review Terry!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "111284376921523949815", "name": "Tyler Parker", "time": 1532711036811, "rating": 1.0, "text": "Very Racist/Dishonest Company, will never go back again & I wouldn’t advise anybody else to go either. they claimed that it was a state law that you had to be 21 or older to purchase a atv. Then when proved wrong they switched and said they couldn’t do it cause of insurance purposes. When atv is purchased and pulled off the lot a company is not liable for anything after that, if that was the case plenty of companies would’ve been shutdown because of deaths on four wheelers.", "pics": null, "resp": {"time": 1532961050235, "text": "Thank you, Tyler, for being willing to sit down and discuss the issues you felt you had during your visit to the store.  We're glad we were able to get the miscommunication sorted out.  We appreciate your offer to remove the negative review you posted after we were able to talk through the situation, and we look forward to working with you on your new ATV!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104271767828684659575", "name": "Jeff Moore", "time": 1528579255099, "rating": 1.0, "text": "Called the Polaris dealer in Athens today about a recall I got on my RZR,I was told the service dept would call me back,I called at 3pm,not heard a word,guess because I didn't buy it from them they don't want to deal with it,this is my first and last dealing with them,if there service department is like this I will take my money to another dealer", "pics": null, "resp": {"time": 1528722580884, "text": "Not sure where the miscommunication is, but our Service Mgr spoke to you Saturday afternoon and has you on the schedule for completing your recall.  Please contact us so we can understand why you offered a 1-star review.  Customer service is our top priority and we want to ensure we've addressed any concerns you may have."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "110605400580200011504", "name": "Leo Dob's", "time": 1502234168921, "rating": 4.0, "text": "Is not about the sell... They make every effort to satisfy and maximize your purchase..", "pics": null, "resp": {"time": 1502236973357, "text": "Thank you Leonardo!  We appreciate the kind words and support!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105217816832437138969", "name": "John Davis", "time": 1470049329654, "rating": 5.0, "text": "Great Bikes, Great Store, Great People! Best Victory dealership in the state!", "pics": null, "resp": {"time": 1498422184341, "text": "Thanks John! We try hard to ensure exceptional customer service and it's great to know that it's being noticed."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104418751710128846141", "name": "Miles Armstrong", "time": 1603686726113, "rating": 5.0, "text": "Amazing", "pics": null, "resp": {"time": 1603145838359, "text": "Thanks for the 5-star review Miles!  We appreciate your confidence and your business."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "116834055332689850398", "name": "Marvin Gann", "time": 1482505677913, "rating": 5.0, "text": "Well equipped for parts and the staff is friendly and knowledgeable.", "pics": null, "resp": {"time": 1498422091896, "text": "Thanks for the great review Marvin!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "104824048619679247495", "name": "Hot Wings57", "time": 1488656582657, "rating": 1.0, "text": "My son is 12 5'5 and 200 lb and we were looking at an ATM for him we get there and the guy said he can't sell it to usbeacause it said you had to be 14 + to buy it he said.just get the 125 that my 8 year old nephew could ride my son needs a 200", "pics": null, "resp": {"time": 1490047329271, "text": "All manufacturers have age limit and safety guidelines imposed by the federal government.  We are required to adhere to these guidelines."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "111277326165513920573", "name": "Alex Thornton", "time": 1520876910544, "rating": 5.0, "text": "Great place, very nice inventory also!", "pics": null, "resp": {"time": 1520883038534, "text": "Thank you for the 5-star review, Alex!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "112889609219421571439", "name": "Bobby Holt", "time": 1492344081361, "rating": 5.0, "text": "Great people here .. always helpful", "pics": null, "resp": {"time": 1498422374505, "text": "We appreciate the fact that our customers are the reason we are here - thanks for the great review Bobby!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102245338941022736299", "name": "Piper Hill", "time": 1546183208356, "rating": 5.0, "text": "Get help from parts counter on my older model ranger.", "pics": null, "resp": {"time": 1546613016896, "text": "Thanks Piper!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "102215904349563594941", "name": "Edie Cox", "time": 1511816614220, "rating": 4.0, "text": "Nice place", "pics": null, "resp": {"time": 1514297679319, "text": "Thanks for the 4-star Edie!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "100428221790786546966", "name": "Gregory Hickok", "time": 1510076959094, "rating": 5.0, "text": "Great service!", "pics": null, "resp": {"time": 1510151372103, "text": "Thanks Greg! Great to see you and we appreciate your business."}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "105865712782356408869", "name": "George Laviers", "time": 1494857390130, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": {"time": 1498421844527, "text": "Thanks for the great review!"}, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
{"user_id": "103581480276435391192", "name": "Ben sovilo", "time": 1505693157163, "rating": 5.0, "text": "(Translated by Google) Very good people and good prices\n\n(Original)\nMuy buenas personas y buenos precios", "pics": null, "resp": null, "gmap_id": "0x88628b0cc039980d:0x789d8a26f66daf97"}
