{"user_id": "105456267301906273526", "name": "Wesley Bowers", "time": 1563811370023, "rating": 5.0, "text": "Nick and the guys at Sweettree are 100% professional, courteous,  knowledgeable, and VERY fairly priced! I highly recommend doing business with them for all your production needs.", "pics": null, "resp": null, "gmap_id": "0x887d4f2feae7be5f:0x16e1e22c00ce4d16"}
{"user_id": "111337447583860548252", "name": "Dustin Coan", "time": 1521133812449, "rating": 5.0, "text": "Brian, Nick, and the rest of the guys will treat you right!", "pics": null, "resp": null, "gmap_id": "0x887d4f2feae7be5f:0x16e1e22c00ce4d16"}
{"user_id": "113073151865447294636", "name": "Collin Robinson", "time": 1629306452089, "rating": 5.0, "text": "So much fun! DJ Platinum had our entire wedding dancing for almost 2 hours. He played a very good mixture of popular and catchy songs for everyone to enjoy.\n\nOnce the playlists my wife and I sent him ran out, he seamlessly played his own mix and had a good time with it.\n\nBrian Robinson (not related) MCd and he was very professional and fun too!\n\nThe photo booth was a huge hit, and the pictures it printed were a nice touch. Plenty of friends and family left with 2 or 3 photos in their hands.\n\nI highly recommend Platinum Entertainment DJ to anyone in the Birmingham, AL area!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112249180929930124797", "name": "Rolanda Hammond", "time": 1629563705755, "rating": 5.0, "text": "DJ Platinum provided great music and all around EXCELLENT service for my company's 2 day event! I highly recommend him for all of your functions!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113298567284197600786", "name": "kim russell", "time": 1626455603793, "rating": 5.0, "text": "DJ Platinum did a great job with our wedding! He turned our wedding reception into a huge party! I had a great time working with Platinum Entertainment. They are very professional and the online client site made it very easy to customize the music for my wedding.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117169855353980590722", "name": "Teddy Rachel", "time": 1617038660219, "rating": 5.0, "text": "We had an absolutely great experience with platinum entertainment! We had DJ platinum and he was extremely professional and kind through out the entire process. The website was easy to use, they were very willing to help us in any way and the wed site and song list were easy to use. Sound quality was great, music selection was great. Couldn’t have wanted anything more, and one of the more affordable options as well. Lots of options for upgrades if you’d like such as photo booths, better lighting and personalized touches but we didn’t opt for those, I’m sure they would have been fun though.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114123426787945851253", "name": "Alissa Maldonado", "time": 1627265760497, "rating": 5.0, "text": "The guests would not stop dancing the entire night! The band was above and beyond. They did a great job between balancing spanish music and today's top hits. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "106863722157897804259", "name": "Brandee Davis", "time": 1620917774567, "rating": 5.0, "text": "Excellent experience!! The smoke machine and sparklers were a great accent to our big day!! Very professional and everything was organized so perfectly! I would definitely recommend using this company for your special occasions", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107319094291154570012", "name": "A S", "time": 1623772450750, "rating": 1.0, "text": "Hello!\n\nMy client and I were not pleased with the cloud effects and the lighting. I kept having to keep dimming the lights to actually see the lights on the ceiling, which is not what I was expecting. They were not the lights that I requested.\n\nI was never asked where I wanted the lights set up. Also, I was told that your employee could only run the cloud machine once and that is not what I paid for. I spoke with Andre the owner and he stated that he could not do it and I had a full camera crew on site for this event and it did not look well on cameras. I am really upset and feel like I was taken advantage of as a woman.\n\nThe owner eventually stated that he could do another cloud which did not last long at all.\n\nI did not feel like a client that the company cared about. I felt taken advantage of and let down considering that this was a major event for my client.\n\nI do feel like these issues need to be addressed.", "pics": null, "resp": {"time": 1623790101504, "text": "Hello Aleta,\n\nUnfortunately, the 3rd party person you booked us through did not explain the functions of the services you booked. They consulted us and told us that you needed dance floor lights and the dancing on the cloud. That is what your proposal was for and that is what was paid for and those are the services you received. If you needed the service multiple times then you would have to pay for the additional times.\n\nThere was never any contact from you until the day of the service. We spoke with the 3rd party you used to book the service, therefore, we cannot confirm what was agreed upon from those conversations between you and that person.\n\nDancing on the Cloud is a one time use cloud of smoke that is normally used for a first dance. It is not a multi-use service and it is what was requested and what was paid for. The dancing on the cloud lasts 2-3 minutes. That’s What we advertise on the website and that is what is written up on the client site by contract.\n\nDance Floor lights are moving head lights on truss stands that are Meant to shine on the dance floor. Also, with any lighting, it is not expected to have lights on in the room with lighting services. If you wanted Lighting for the entire room, WE would have advised you to go with uplights versus dance floor lights. We also would have advised 2 sets of uplights since the Boutwell Auditorium is a big venue. We never spoke with you, only your 3rd party booking person.\n\nIt was explained to you when you called the day of the event how the services work.\n\nMany of our clients are women. We do not take advantage of people. We simply provide the services requested of us. Unfortunately, you didn’t give us a chance to discuss prior to posting a 1 star review.\n\nThanks! Have a Great Day!"}, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100354024946965785625", "name": "Chelsea Ryles", "time": 1625689731798, "rating": 5.0, "text": "Our DJ was AMAZING . He made our night PERFECT. The music transitions were ON POINT .  He kept the crowd up all night at our wedding . We also used him for uplighting , a photo booth and dancing on the clouds for our first dance which the guest enjoyed . We could not have asked for a better company to use for our wedding . He is worth EVERY PENNY.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114871775959483318296", "name": "Alyssa Angel", "time": 1599068730417, "rating": 5.0, "text": "These guys are amazing! They provided the Photo Booth for my event and it was a HUGE hit! All of our guests loved it. It takes beautiful, high quality pictures and makes everyone look like a million bucks! The team also helped me design a custom layout for my prints and digital downloads which was amazing. These guys are the real deal and some of the best money we spent at the wedding! Don't hesitate to book them! You won't regret it, and i say that with confidence!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109941719816502000188", "name": "Harper Basquill", "time": 1613744791468, "rating": 5.0, "text": "We hired Platinum Entertainment for my daughters 13th birthday party and had the DJ and mirror photo booth and they exceeded our expectations! They stayed in touch leading up to our event, did an excellent job designing graphics for the photo booth print out pictures, and kept the kids dancing with the music they chose! The mirror photo booth was very popular with the kids and adults, highly recommend the mirror photo booth!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100803294590759815487", "name": "Jessie Hickey", "time": 1607303347568, "rating": 5.0, "text": "My husband and I got married on November 21, 2020 at Matthews Manor and DJ Platinum was our DJ! It was absolutely AMAZING! He checked in with us multiple times before the event, the night of was incredibly flexible, and overall made the night more enjoyable! He played the best music and listened to exactly what we wanted!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117429410283577237991", "name": "Breonna Dunn", "time": 1617152025094, "rating": 3.0, "text": "Trevon was AMAZING! Ceremony music and dj’ing during reception was flawless. However, one of my sparkles during our grand entry and re-entry did not work. Also, the fog machine and monogram did not have the effect I expected.\n\nI would definitely hire Trevon though for future events.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110387279282910657248", "name": "Breanna Culwell", "time": 1592277747849, "rating": 5.0, "text": "Absolutely incredible. I was super stressed about picking music right before the wedding they met with me, and as soon as we were done I was so confident in my music choices. He really knows how to read the crowd and get them involved and all out on the dance floor. Will definitely be hiring them for other events in the future, I could not have asked for a better DJ for our wedding. The photo booth was amazing. So many of my guests were taking about how great our DJ was not just at the reception but throughout the entire ceremony. If you are trying to find a DJ for your wedding, stop looking now, and hire platinum entertainment.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "115716368883465207896", "name": "Tracie Hughey", "time": 1613226864053, "rating": 5.0, "text": "What an amazingly postiive experience I had!!!  I can not say enough about how professional Platinum Events was through this entire process.  We had a high school dance.  From the beginning to the end, the experience was wonderful.  First was the immediate responses to all questions and communication.  The website was professionally and clearly laid out.  The \"ala carte\" choosing of the services they provide was so user friendly.  All communication was done by email so everything was clear for me.  I didn't rely on any  verbal committments, it was all recorded in emails.  The price...frankly I don't know.  I live by the motto you get what you pay for....I love capitalism.  And if I paid more than other services, I don't care....I got what I paid for....a wonderful experience.  Our services included a DJ, lights, sound system, and mirror photo booth.\nThe DJ set up was compact, high quality and the DJ screened the music for me...(i had enough on my plate).  Their website allowed my daughter to upload a spotify playlist easily and he screened it.  It also allowed a timeline that he respected and utilized..  The website has event planning section ......It was great.  I wish I was gifted at writing so I could paint a picture of what a wonderful experience but.....I had a wonderful experience and will recommend and utilize them a hundred times over!!!  We also utilized the Mirror Photo Booth...so fun.  Great props, assistance at it's side the entire time, easily usable, I am so glad I upgraded to this but I am sure the starter photo selection is great too but I am glad I upgraded to this one.  They designed a stamp for each of the photos customized to our event and they initiated that process and went with it without much of my involvement because I didn't have time.  The individuals who worked the event were dressed appropriately for the event, cordial, available, cooperative....I appreciated them handling EVERYTHING.  It made it worth every penny.\nMy ONLY suggestion would be to work with them on customizing your props for the event.  That was a shortcoming on my part not theirs.  Their props were great but looking back, I wish I had included some things that were directed toward this group of seniors.\nI can't thank them enough for working with us on providing these high school seniors a winter dance that had been cancelled by those around them twice who were more concerned about perceptions of participating in a \"super spreader event\".  They had a wonderful time, fantastic memories, and NO, we weren't a super spreader event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117900391247237689780", "name": "Anne Heaney", "time": 1605478332170, "rating": 5.0, "text": "Very professional! This team took such good care of my husband and I at our wedding and during the planning process, and made sure we had the perfect ceremony and reception! If you don’t want them to stray from playlist, I recommend telling them not to take requests, but just know you are in good hands with Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104073717433578632420", "name": "summer perry", "time": 1597852167319, "rating": 5.0, "text": "Andre did such an amazing job providing the music for our wedding. He was very intuitive in playing songs that inspired our guests to dance and enjoy themselves! We also got the cold spark and dance floor light add ons and they were well worth it!! The cold sparks are SO AWESOME and surprised and delighted our guests during both our first dance and our wend off.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107759013879817623292", "name": "Bethany Henry", "time": 1584712497566, "rating": 5.0, "text": "DJ Andre and his crew are truly the best in the business. The communication prior to the event, his professionalism during the event, and the overall execution was incredible and played a HUGE role in making our wedding day so fun and special. Andre did our ceremony and reception music and made everything flow so well with very little instruction from us...he didn’t miss a beat! His DJ booth, the uplighting, and his entire set-up look SO nice and professional! They add a very unique element that I wasn’t expecting, but was so happy with! DJ Andre played all the music that we requested, but also took guest requests and worked them in seamlessly to keep the overall vibe the same. And last but not least: they had a very sweet surprise for us and our guests at the end of the night that they had compiled throughout our day! I told everyone that night that Andre was not only one of our BEST vendors, but also one of the most affordable. You will not regret booking him for your wedding or special event!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116430348420419770695", "name": "Chloe Harbison", "time": 1591489959536, "rating": 5.0, "text": "We booked Platinum Entertainment to DJ at our wedding- we spoke with Andre and explained to him what we wanted at our ceremony and how we would like our reception to be a big, fun celebration. Andre did not disappoint- everything was phenomenal!! Our wedding would not have been the same without them, I could not recommend them enough!\n\nVery professional and easy to work with!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114180843333105291346", "name": "Billy Parker", "time": 1603391618480, "rating": 5.0, "text": "THE BEST DJ EVER!!!!! Highly recommend to anyone who is looking for a DJ you can trust to do an incredible job. Our reception was the best!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104349675559494838490", "name": "JK Presnick", "time": 1568166982346, "rating": 5.0, "text": "DJ Platinum was SO much fun!!! I don't think there was one wedding guest not dancing & I had an afternoon/day wedding! The entire company and process with Platinum Entertainment went above and beyond to make my wedding planning as least stressful as possible. The website allows you to customize your day however you wanted with a \"do not play\" list, a \"play\" list, a wedding day timeline & so much more!! I even ~joked~ the day before my wedding & told my parents that I thought the only wedding vendor that did not stress me out yet was the DJ! The morning of the wedding we got a call from DJ Platinum telling us that they got a new photo booth & were wondering if we wanted to try it out for FREE!!! I am SO HAPPY we were able to have this at the wedding!! For any future brides, I would HIGHLY recommend using their photo booth because it was an absolute HIT!! I was able to have a link of every picture that was taken in the booth & it was one of my favorite things to look back at from the day of!! Looking back at my day, I would ABSOLUTELY \"splurge\" with the photo booth! I couldn't imagine my day without it. Thank you so much Platinum Entertainment!! All of my guests complimented the DJ days later!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113968821610841605818", "name": "Nicole Towns", "time": 1585181297627, "rating": 5.0, "text": "I used Platinum Ent for uplighting and a photo booth. I was blown away with their service. The uplighting really made the room pop with the green color. The photo booth was so much fun. My guests really enjoyed it and I had a lot of fun playing on it. The personal touches that was designed was beautiful. There were so many options. I would definitely recommend them for any event!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117434750201721822021", "name": "Nia Richardson", "time": 1573003987400, "rating": 5.0, "text": "DJ Andre was absolutely the best! The communication was great, and the online customer portal made it easy to customize my packages. He played all the music that I wanted and new songs that I loved. The uplighting was phenomenal and it really completed the look. Plus, the Mirror Booth was a hit all night long. Booking Platinum Ent was the best decision, and affordable too.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113870332684016942162", "name": "Brittany Mosier", "time": 1530279037119, "rating": 5.0, "text": "DJ Platinum was SO AWESOME! He did our ceremony music and the reception for our wedding day and everything was perfect and exactly what we asked for. He responded quickly and efficiently to all my questions and had our wedding guests dancing the entire night! We loved our static monogram he created for us and it was exactly what we wanted! Our wedding guests still talk about how much fun he was and that the variety of music he played was fantastic! I could keep going on and on about him and how great the customer service was! Platinum Entertainment is a definite MUST for your wedding day DJ!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108037293941024594767", "name": "Ojas Gokhale", "time": 1601267301982, "rating": 5.0, "text": "I have known DJ Platinum as a coworker and as a DJ. He is the most amazing DJ we have encountered at Wedding events and there are not enough words to describe his talent; he takes requests on the fly and blends them seamlessly into his routine and often can incorporate music out of the standard genre (His Bollywood music skills are now legendary among my Indian friends). He performed at two of our friends weddings and obviously, recently at my own wedding. He set up the mood for the perfect party; one that my wife and I had desired. Everyone danced right right until the end. The lights and speakers he got were nothing short of a nightclub in Vegas.\nHe is very easy to work with and has a very professional approach, including an online dedicated user portal, with a form to setup songs. I highly, highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100594469079064428534", "name": "Dana Franklin", "time": 1560870055233, "rating": 5.0, "text": "Platinum Ent is the BEST to get all that you need to make your event sure to be a hit!  We used DJ Platinum Andre for our event lighting, mirror photo booth, dancing on the cloud, cold sparks, and more! Not only did the DJ really know how to turn up the party, and add beautiful special effects to our day, but the service was the ABSOLUTE BEST!!! Whenever we needed anything they were right there to help us!  I am big on service, so i the service is good I am highly likely to return and recommend your business! AND I HIGHLY RECOMMEND THERE SERVICES!!! Thanks again Platinum Entertainment!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102337304870064166631", "name": "Jessica Upton", "time": 1545237562237, "rating": 5.0, "text": "Platinum Entertainment was excellent. They were easy to work with and everything was easy to set up. The music playlist can be set up through their website, which is super helpful. They also include must have songs and a \"don't play\" list. They took requests and made announcements throughout the ceremony as requested. Everyone at the wedding said it was the most fun wedding they'd been to - and a good bit of that experience can be attributed to the DJ  from Platinum Entertainment. They made our special day a lot more fun!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109366621583925003259", "name": "Sebastian Eady", "time": 1556577104548, "rating": 5.0, "text": "DJ Platinum was awesome. He was very easy to contact and got back to us in a timely manner. His website is very straight forward where you could add a playlist to the website if needed. He played amazing music for all ages to enjoy!! He set up for the ceremony and reception and played the music according to the schedule. Overall great experience! Would recommend and use again to family and friends 100%. Thank you DJ Andre!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104052489346513726369", "name": "Justin Mathison", "time": 1564896088671, "rating": 5.0, "text": "Andre and his team were phenomenal. Everything from the lighting to the custom logos to the EMCEEING to the mirror photo booth and of course the music was amazing! My wife and I could not be anymore pleased. He was super communicative throughout the entire process and we had so many great comments about the services he had to offer. He even did things on the fly which really helped us out! Thank you Andre and the Platinum ent. Team!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104005600110603854714", "name": "Kennedy Thomas", "time": 1526915571619, "rating": 5.0, "text": "I do not have enough good things to say about Andre. He was so easy to work with, got back with you quickly, and made sure he knew exactly what you wanted for your big day! I trusted him completely with the song choices & he did an awesome job. He was good at reading the crowd, playing a mixture of genres & songs that got everyone dancing at my reception. Also- his prices are INCREDIBLE! Really cannot go wrong with DJ Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104694368420360464750", "name": "Tricia Tapley", "time": 1572640431812, "rating": 5.0, "text": "Andre with PlatinumEntertainment was awesome!!! Best DJ, lighting. Professional setup!! He kept all the guests dancing all night long. Such an easy person to work with. Highly recommended him for any of their services. His online setup of your timeline, music playlist and do not play, etc was so easy to do. He is so much fun and fantastic to work with!!! Thanks for a wonderful wedding party for our daughter.!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109668712452647258076", "name": "sarah stephens", "time": 1514765879878, "rating": 5.0, "text": "Platinum Entertaining DJ went above and beyond at our wedding reception!!! He kept the party going for 5 hours!! The dance floor was full for a solid 4 hours. During the planning process Andre addressed all of my questions within the same day. He was so easy to work with and made me feel confident that we’d have a fun wedding. He played all of our songs as requested and ended the songs where I wanted them to end (we did partial songs during the father/daughter mother/son dance). He did cues for different parts of the reception (toasts, send off, etc). Everyone commented that they had the best time and it was largely because of the music choices! I’m so beyond thankful for Platinum Entertaining, they did a fantastic job!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107682899931534867598", "name": "Stacey Green", "time": 1572443253446, "rating": 5.0, "text": "I rented the photo mirror for our employee banquet.  It was a huge hit.  Everyone loved the pictures.  We really enjoyed using the props and the guy who managed it was great.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108828007058460682094", "name": "Keisha B.", "time": 1507817317932, "rating": 5.0, "text": "One word: AMAZING!!! My wedding reception was on Saturday, October 7, 2017 in Huntsville, AL. I think on Tuesday evening, I decided I wanted a photo booth and so the search began. During my search, I ran across Platinum Ent Dj's website. They offer a Mirror Booth rental. BEST THING EVER!!! What I loved about the website was that you could instantly find out if the booth was available for your event and how much it would cost. I also was very happy that this company was willing to travel to Huntsville, approximately 1.5hrs away from Birmingham, for my event.\n\nFrom the very beginning, Andre was courteous and professional.  This company definitely understands customer service and it shows! They provided an easy and convenient method to pay for the services online which I appreciated. They also showed up early to the event just to make sure everything was in its proper place.\n\nThe mirror booth was a real hit with my guests. Everyone absolutely loved it! Based on my experience, I highly recommend this company to anyone looking for quality service and a stress-free event. This company literally exceeded all my expectations.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "111222103569986688517", "name": "Amy Davidson", "time": 1545539748354, "rating": 5.0, "text": "DJ Andre was a fantastic DJ for our daughter’s wedding reception! He kept the party going for 4 hours and was so easy to work with. We would definitely recommend him for any event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100791531187314044988", "name": "Mary Cowan", "time": 1573601419949, "rating": 5.0, "text": "DJ Platinum and his crew were amazing! Very professional and read the crowd very well! Everyone can’t stop talking about how much fun the wedding was! The up lighting is a MUST! 10/10!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116725622801658922648", "name": "Sheriah Gibson", "time": 1535643301211, "rating": 5.0, "text": "Awesome to work with! As an event planner, Andre made my job easy but his timeliness and making sure I was fully aware of their needs to execute the event and keep our clients pleased. He was great to work with and I look forward to booking him again soon! Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114729532607714712505", "name": "Ivy Patterson", "time": 1550692243117, "rating": 5.0, "text": "“We had a great experience with DJ Platinum. We were ambivalent about getting a good DJ because we wanted to avoid the corny vibe we’ve seen so much at school dances, but Andre was down to the earth, played great music, was totally accommodating to our students, and created an incredible soundtrack for our night! He was also perfect with timing and setting everything up before the dance started.  Plus, he adjusted his songs to the vibe of the party which was awesome. It was great to have DJ Platinum along with his lovely wife Kia.  It was just great to have someone so attuned to what we wanted. This DJ company is super professional and reliable and communication was wonderful and clear throughout. Thank you again Andre and Kia for sound-tracking such a wonderful night!”", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113655657374020030186", "name": "Ashley Harris", "time": 1528937037196, "rating": 5.0, "text": "Andre was super responsive as we were planning for our wedding on June 9th. He even put together a last minute mix for the father Daughter dance! Price was absolutely reasonable and the Photo Mirror is a must!! Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "101450557188396234990", "name": "Brittney Jones", "time": 1574700466310, "rating": 5.0, "text": "Amazing and professional company, they are the best and made both of events successful! I can't wait to use them again.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108846228832747243457", "name": "Miranda Carroll", "time": 1564861866296, "rating": 5.0, "text": "I absolutely loved the photo booth at a recent Wedding I attended. It Captures all of your personal&funniest experiences, and memories😍🥂🍾💕 I highly recommend this for your next Event⭐⭐⭐⭐⭐", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110118678117047180824", "name": "Britnee Wellman", "time": 1472163471807, "rating": 5.0, "text": "DJ Platinum was wonderful! He is a lot of fun, but still very professional. Our guests really enjoyed the variety of music he played and had a great time. The lighting looked great and he created our monogram for the dance floor. Two thumbs up!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112214976698345966961", "name": "Dedric & Tonja Brown", "time": 1471908884250, "rating": 5.0, "text": "Dj Platinum did our wedding and he was the best...the lighting was every thing, the monogram was so beautiful, and the music was non stop and perfect. He is very professional and i would definitely recommend his services and use him again for another event!!!! Thanks for making our day rememberable!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100746457071490072436", "name": "Jessica Whiteside", "time": 1471913836864, "rating": 5.0, "text": "Dj platinum was EXCELLENT, He kept the crowd dancing. The lighting was beautiful. I can't wait to book him for our next event. He made sure our wedding and reception was perfect.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117934201291551973330", "name": "Courtney Harris", "time": 1572540131534, "rating": 5.0, "text": "Trevon Dj Too Kold was awesome! I would recommend his services to anyone! He made our wedding so much fun!! He also was the most affordable DJ I could find in the Birmingham area. I would 10/10 hire him again for his DJ services!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102613210394200483698", "name": "Courtney Harris", "time": 1571687405252, "rating": 5.0, "text": "Words can’t express how great and excellent the service was. From the lightning, to the photo booth, dancing on the cloud and to the cold sparkler machines everything was outstanding! I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "115082803796772890675", "name": "LaToya Smith", "time": 1471970381915, "rating": 5.0, "text": "I worked with  DJ Platinum on my husband's birthday party. I highly recommend his services.  He was both professional and affordable.  DJ Platinum is equipped to handle any size event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100545746874245003561", "name": "Jessica Spence", "time": 1471890670144, "rating": 5.0, "text": "DJ Platinum did an amazing job at our wedding reception this past weekend. We received so many compliments about him from our family and friends. He definitely kept the party going! We would definitely recommend him to any future bride and grooms.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109416864469229461793", "name": "Sheriah Gibson", "time": 1563904932324, "rating": 5.0, "text": "Great services! Andre and his team consistently provide our clients with the best products and quality around.\n\nThank you! - Posh Occasions by Sheriah, LLC.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110901168465064379653", "name": "Crystal Duco", "time": 1524846103468, "rating": 5.0, "text": "The photo mirror was a huge hit at our wedding!  They were so nice and easy to work with!  One of the best decisions!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107703260186863613755", "name": "Sametra Moore", "time": 1520631663057, "rating": 5.0, "text": "I would like to thank DJ Andre for providing an excellent service for my husband 50th surprise birthday party.  He kept my guest dancing the entire time. I highly recommend this DJ.\n\nThank you for your service.\n\nMrs. Moore", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "105949058196141856797", "name": "Shenita Counts", "time": 1527303841968, "rating": 5.0, "text": "I normally don’t write reviews but in this case I made an exception. In the words of my daughter, The DJ was “Lit”!! They were very professional and on time. The teenagers and I loved the music selections, the photo booth and all the up lighting. A+ service!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100168393196667353272", "name": "Gabriele Watts", "time": 1517157251615, "rating": 5.0, "text": "Can’t rave about this company enough!!! They kept us on the dance floor all night. The lighting was spectacular and the videography was stunning when we saw the final product! Book them!!! You will not regret it!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102859119436773104114", "name": "Devon Reid", "time": 1489272326994, "rating": 5.0, "text": "DJ platinum provided a variety of music for our wedding. It turned from a wedding, to a blast of a party! Lol", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112956952818301526246", "name": "Megan Harris", "time": 1533235747058, "rating": 5.0, "text": "DJ Platinum went above and beyond for my wedding! I loved everything. I definitely will be using him again.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116918423622048680461", "name": "Tederick Withers", "time": 1555446355108, "rating": 5.0, "text": "We really enjoyed everything and the staff was very nice and professional we appreciate everything and we'll be contacting again for our next event", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114577347903861311162", "name": "Memendra Page", "time": 1514667595570, "rating": 5.0, "text": "Awesome service... He was superb..he is a one stop shop.. This is the company you want to book to make everything a sucees", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108724413625585668858", "name": "Rodrigus Cannon", "time": 1506623834229, "rating": 5.0, "text": "I really like the his professionalism! All the music was clean and had great sound quality.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "118106607360427909912", "name": "Tee Williams", "time": 1472135049252, "rating": 5.0, "text": "He's great for whatever event you plan. DJ Platinum did a great job at the reception everyone enjoyed the music.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109763122864866866986", "name": "Curtia Moon", "time": 1491332921215, "rating": 5.0, "text": "DJ Platinum is ALWAYS my first choice for a wedding Dj referral to my couples.  He is prompt, has a great attention to detail, and keeps the party jumping.  He is a pleasure to work with.\n\nCurtia Moon\nMXK Events & Weddings", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113617161010399176527", "name": "Nachica Thomas", "time": 1471905302355, "rating": 5.0, "text": "Best DJ around and the lighting system is AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102303802693490892612", "name": "Tory Moody", "time": 1474317505402, "rating": 5.0, "text": "Dj Platinum was there for us from the beginning to the big day on our wedding day! The area we were having our wedding at was pretty much a cell phone dead zone, but Dj Platinum thought that out and gave us a form list to send him with sections to write in what songs we wanted; once that got back to him he created the playlist and took care of the rest. He made everything simple and more important for me and my bride he made it affordable; definitely, definitely, would recommend him to anyone I know who has a wedding coming up or even a party and a needs a Dj who is professional and is kind on their wedding budget! For the package we asked for Do Platinum definitely exceeded our expectations; of course besides providing great music he provided lights to help provide the right atmosphere to our reception, and his travel fee was definitely kind on our wallet. When the wedding was over and we went to the reception hall and walk through the doors DJ platinum had a very great set up waiting for us; what stood out most to us was the fact that the lights he used lit up the walls and ceiling with me and my wife's favorite colors of red and purple, both us and the guess we're blown away! A great time was definitely had by all, and none of that would have been possible without the professional help of Do Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113652179523908315793", "name": "Christopher Thornton Sr", "time": 1545239420986, "rating": 5.0, "text": "Andre and Kia were very responsive to our last second requests and odd requirements of our over 40 group Christmas Party (60 guests).", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113544257508887224233", "name": "Lashonda Calloway", "time": 1531747106429, "rating": 5.0, "text": "Awesome, professional, everything for my wedding was beautiful!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112365238420445973108", "name": "Daren Turner", "time": 1570335312950, "rating": 5.0, "text": "Awesome service and music!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "103445300453480876864", "name": "Amanda Hickman", "time": 1619582942142, "rating": 5.0, "text": "From he time I first spoke to him he was very personable and helpful. He answered every phone call helped me out from the time I hired him until the wedding was over he was there for me. I most definitely recommend Jeff and Timothy their amazing and down to earth.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "113059907300348675839", "name": "Wendy Miller", "time": 1622478051500, "rating": 5.0, "text": "Great job today with music and sound system at our Memorial Day ceremony. Your professionalism is 5 star!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "106046820848664602419", "name": "Thomas Byrd", "time": 1620252444143, "rating": 5.0, "text": "Music Man Productions provides the best live sound and DJ services in the Wiregrass. He was able to work with me to come up with a package/price that was perfect for our event. Will be using again!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "105984295892714510125", "name": "Angelina Kitts", "time": 1623563534373, "rating": 5.0, "text": "Jeff was so professional and sweet and just wonderful!! He made the day perfect and I would absolutely recommend him!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "116748653853346189234", "name": "Andy Sibley", "time": 1610137692679, "rating": 5.0, "text": "Jeff and his team did a great job. Very professionally and easy to work with. I highly recommend to hire them for all of your sound needs.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "108594849853367810529", "name": "Karen Golden", "time": 1584387456905, "rating": 5.0, "text": "Jeff Strickland is simply the best in his field. I am a gospel singer and I like to take Jeff with me when I sing at different churches. He is totally professional. He knows exactly how to blend my music and also is very easy to work with. He listens to what you want and works with you to fine tune the sound. I would highly recommend Jeff for church services, for soloists of all genres,\nweddings, reunions, parties or any and all kinds of music. Jeff is also extremely dependable!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "103784772270702534144", "name": "Headland Area Chamber of Commerce", "time": 1585336989530, "rating": 5.0, "text": "Jeff and his crew always show up early and stay with us until the job is beyond done. He provides professional, quality sound and has become part of the team for the Headland Area Chamber of Commerce. Great service and has a big heart.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104239653481270127059", "name": "Brenda Fulford", "time": 1584312785949, "rating": 5.0, "text": "If you need music for an event of any kind Jeff Strickland is the man to call.  He has great equipment,  lights and  the type of music you prefer.  He is professional and has reasonable pricing. Always a great experience.\n\nTed and Brenda", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "101805305790946548798", "name": "Tammy Martin", "time": 1583970486184, "rating": 5.0, "text": "Have hired the Musicman several times and he is always very professional. He offers music for all occasions. Dancing and Karaoke. I give him 5 stars.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104168710113112894887", "name": "Ronnie Bush", "time": 1584317714489, "rating": 5.0, "text": "He is very professional and knowledgeable about music and equipment. I have led  the music at church for over 35 years and our sound has never been this good.I don't know what I would do without him", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107687923502063312996", "name": "Melvin Williams", "time": 1569640541959, "rating": 5.0, "text": "Top notch sound and lights.Great equipment,and always a great mix.Great guys to work with.He's got my vote!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107713093748506115468", "name": "chris wortz", "time": 1583949889032, "rating": 5.0, "text": "Great equipment,  great personality,  he does a great job!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112947858006965496584", "name": "Donnia Rambin", "time": 1583940843929, "rating": 5.0, "text": "Jeff is very professional. He does a great job and is a delight to work with.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112100372596557505411", "name": "Shane Corbin", "time": 1568846456888, "rating": 5.0, "text": "Was very personable, we had a great time with the music selection.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "110759091560651205262", "name": "Una Taylor", "time": 1569088588845, "rating": 5.0, "text": "A Joy!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "105174151178434788076", "name": "Ally Sanders", "time": 1607549090409, "rating": 5.0, "text": "Fairhope Event Lighting was such a pleasure to work with! He went above and beyond to make sure our Christmas experience was perfect with a snow machine!!! The kids will never forget that night that me to the magic helped provided by Fairhope Event Lighting. Will\ndefinitely be using his services again!", "pics": null, "resp": {"time": 1607784717202, "text": "Thank you, Ally!  I'm so glad the kids enjoyed it."}, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "113194314207046329136", "name": "Noble Davidson", "time": 1593555180817, "rating": 5.0, "text": "Jim provides top notch equipment with top notch service at a fair and reasonable price. He will go out of his way to make sure you have what you need and your event goes just as it should. Thanks again Jim!", "pics": null, "resp": {"time": 1593639132096, "text": "My pleasure, Noble!"}, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "111639979809180804522", "name": "Rachel Lomax", "time": 1606146446161, "rating": 5.0, "text": "Jim was great to work with and provided the best recommendations, setting the perfect mood for our outdoor space!", "pics": null, "resp": {"time": 1606162004982, "text": "Thank you so much Rachel!  We were honored to have participated in your decision process and very happy that you like the results."}, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "117163185398673617521", "name": "Bay Area Performing Arts", "time": 1593377907312, "rating": 5.0, "text": "Mr. Jim has provided lighting for many of our theatre performances as well as our annual awards show (The BAPA Awards). He always does everything he can to ensure that our shows look fabulous! He also has a wide variety of special effects and sound equipment as well! Thanks for everything, Jim!", "pics": null, "resp": {"time": 1593436505772, "text": "Greatly appreciated!  It has always been my pleasure!"}, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "107115096426553981906", "name": "Jamie Schumacher", "time": 1593377776051, "rating": 5.0, "text": "Brings a lighting experience like no other! So dedicated to his craft. Thanks for lighting the theatre to life.", "pics": null, "resp": null, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "107440710849365787491", "name": "Mary Pariseau “Mary Liz Pariseau Slaton” Slaton", "time": 1621123470724, "rating": 5.0, "text": "Awesome experience.", "pics": null, "resp": null, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "109429853914446634293", "name": "Kag Clem", "time": 1593391793605, "rating": 5.0, "text": "Jim has been an amazing person who really cares about what he does ! He ceases to amaze me .I have done a few shows with him and he taught me so much and made me look amazing ! Love love love the lighting and experience with it ! 10/10", "pics": null, "resp": null, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "113641683867211864863", "name": "Corrie Simpson", "time": 1593390640808, "rating": 5.0, "text": "Jim provides exceptional service and is always a pleasure to work with; he makes sure the stage is perfectly lit for the stars of the show to shine bright.", "pics": null, "resp": null, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "113927858101585720251", "name": "Jacob Morris", "time": 1593382282749, "rating": 5.0, "text": "Mr. Jim has gone above and beyond to create a fantastic experience for our audiences!", "pics": null, "resp": null, "gmap_id": "0x889a3f1747c59d85:0xa7ac42fa6a0b5613"}
{"user_id": "103350191571697816316", "name": "David Santos", "time": 1615504247003, "rating": 5.0, "text": "What can I say, well to start with, I was not ready for the change to a New Company because I have been with Xerox for over 25 + Years. I have always been treated very well from them so, NO I did not want to change. After a while of thinking about it SEVERAL MONTHS and my Son hammering me with the RJ YOUNG name, I did it. I purchased a machine from RJ YOUNG.\nAt first I was skeptical and to be honest I really didn't want to give it a chance (The Machine), but I did and after several months and barely using the machine I starting coming more around it and using it a little more & more. Then I began to really like it because it really printed so nice and pretty fast. It only took me  8 to 10 months to like it but you have to understand I WAS A XEROX Man and I thought there was NOTHING out there but Xerox. The Xerox machine has ALWAYS  performed outstanding and the SERVICE was the best, I was spoiled from that. However, I found out that there was more out there than XEROX! I found out that RJ YOUNG was REAL and believe me they have made a believer out of me. The Service that I thought would not compare to XEROX, has showed me they are just as good and if not BETTER. I never thought I would say that but it is so true. I can not believe how fast the Service Technicians reply to the service calls. They are always polite, and get me back up and running in a very quickly manner. They have such good personalities and a smile! As for the Ladies at the Home Office, Oh My How can you NOT like them. They are AMAZING. They always tell me they will have my supplies on the way or a Technician asap. IT IS JUST SO HARD TO PUT IN WORDS what RJ Young has done for my business. This is a very caring company and to be honest I am so glad that I have some of their product and that I was introduced to the World outside of XEROX. RICO machines have made my life SO MUCH Better and I am so happy that I have changed. If you are not a part of RJ YOUNG, you are probably missing out on good PEOPLE and Great Machines.\nDavid Santos,\nSantos Printing Co.", "pics": null, "resp": {"time": 1615567331024, "text": "Thank you so much for your feedback, David! We truly appreciate it."}, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "107060019385402490294", "name": "SBNABN Nelson", "time": 1596815182481, "rating": 5.0, "text": "RJ Young was very helpful! They were very knowledgeable and worked quick to help deliver and service our devices! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104972628291985606322", "name": "Tom Sommerville", "time": 1596541843874, "rating": 5.0, "text": "Great Company, top quality products, service and support. More that a Copier Company, They sell Technology, gear. and the Latest Security Camera;s Printers from desktop to Print Shop.\nAV installations, Managed Print and Network Services. Full line of PPE.", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "111391196337052808128", "name": "Chris Smith", "time": 1578669178257, "rating": 5.0, "text": "Great place with great people!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104420937470922492672", "name": "Sarah Kuykendall", "time": 1537234260415, "rating": 5.0, "text": "Best place to buy a printer and the service is amazing!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104122743274703043189", "name": "Ronnie Butler", "time": 1537250043970, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "114415659727939822690", "name": "Christen Henry", "time": 1606581050983, "rating": 5.0, "text": "Happy to help anytime I can.", "pics": null, "resp": {"time": 1606580352311, "text": "Thanks Chris! Thanks for all of your help over the years."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1598535119714, "rating": 5.0, "text": "Great and easy company to deal with. Wide variety of all things technology.", "pics": null, "resp": {"time": 1606580287572, "text": "Thanks Steven! We love partnering with you. Let us know if you need anything."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1521991299698, "rating": 5.0, "text": "Holt Audio and Visual is well known to me personally. I worked in the legal field in Birmingham for over 42 years as a legal secretary, legal assistant and paralegal and first learned of Holt AV's services while on the job. However, over the years, I have personally used their services on a number of occasions to obtain duplicates of and share videos and recordings that were taken on vacation and during get togethers with family and friends. One tape in particular was very old, but the staff at Holt AV did an extraordinarily important job for me in duplicating a recorded conversation with my mom made many, many years before her death. I felt they took great interest in and were attentive in doing an excellent job in delivering something that has become very precious and invaluable to me and my family. Thanks, Holt AV - wishing you well for another 60 years and beyond!", "pics": null, "resp": {"time": 1522071411392, "text": "Thanks for the kind words! Hope we can be of help in the future!"}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1527514496364, "rating": 5.0, "text": "Customer service at it's finest. They go out of their way to make sure you have what you need when you need it.", "pics": null, "resp": {"time": 1527599902330, "text": "Thanks for your comment! We love making our customers look their best."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103359013265102997413", "name": "Kimberly Bivins", "time": 1615071339307, "rating": 5.0, "text": "My brother and his fiancé rented chairs for their wedding from Aabco. The prices were great and I picked them up on Friday. Upon arriving, the staff was friendly and pick up was simple! Thank you all!", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "112936788925810112892", "name": "Amanda Marie", "time": 1621265739651, "rating": 4.0, "text": "The kids loved the bounce house and snow cone machine.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "110041125485551783926", "name": "Judy Eldridge", "time": 1582979057291, "rating": 5.0, "text": "Great place for rental items. Very nice and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "109340432896664807501", "name": "Lyn Fields", "time": 1563581566203, "rating": 1.0, "text": "Rented a \"mister\" fan for our sons birthday, and luckily we tried it out before using with our guests. Bc only 2 the nozzles worked properly and had valves.  The water was spraying directly into the fan motor.  So my husband did his best to fix it with no luck.  The fan itself was very beat up and barely a difference between low and high.  Upon returning the fan a manager told my husband only $10 of our $60 could be refunded.  Also admitted there were new mister kitsch the back but the guys didn't want to install them...", "pics": null, "resp": {"time": 1564763448786, "text": "Mrs. Fields, I apologize for the problems that you experienced. I have investigated this incident and I discovered that it was a new 'Mister Kit' that was on your fan, but unfortunately it was malfunctioning. Upon return of the fan we offered your husband a refund, but he said to charge him for the fan, \"Because the fan worked and we used it.\" Well, the 42 inch Fan rents for $50 and the Mister Kit addition is only $10 - hence the $10 refund. Again, I apologize to you for the malfunctioning Mister Kit.  I would love the opportunity to make it up to you by offering you a full $60 credit toward any future rental item. Mistakes happen, but we want to make it right with you!"}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "110571335232585168031", "name": "Tracy Dixon", "time": 1573931004756, "rating": 3.0, "text": "A little  high for the quality of table and chairs I remted for baby shower. Stafg friendly and helpful just need to upgrade some equipment.", "pics": null, "resp": {"time": 1580152340724, "text": "Ms. Dixon, I apologize that the tables and chairs did not meet your expectations. We have some older and some newer tables and chairs, perhaps you received some older ones. The good news is that we’re are taking your advice and purchasing new tables and chairs. They will be here soon!"}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "100617669746169720634", "name": "fun music mix creativeingenuity", "time": 1533315580055, "rating": 5.0, "text": "I have rented equipment and party goods from AABCO in the past and have had a great experience every time. I have rented chairs, popcorn machines, bounce houses, dunk booth, and even the duck pond game. Generally they are our go to for Birthday Party needs. I wouldn't hesitate to give them a call. One time we had a blower go bad on the moonwalk but we didn't know if it was the blower or the house so they brought us another blower and bounce house and even got the other one working (user error) then let us keep both houses for the weekend. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "117367444823801804367", "name": "G.A.Perkins1", "time": 1596131326317, "rating": 5.0, "text": "Sorry about that u are correct.", "pics": null, "resp": {"time": 1596121365134, "text": "Mr. Perkins, this review is incorrect. This is Aabco Rents Party and Event Rental. We did not work on your pump (we are not a repair shop - we do not do repairs on any type of equipment). We only rent items to people for events. Please remove this one star rating as it does not apply to this business."}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "114055548748670593719", "name": "Katherine Dickens", "time": 1537405711050, "rating": 5.0, "text": "Katie and Susie are great....I had a very good experience with my rental of chairs....guys loaded and unloaded....great place for your rental need", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "114148795554684491100", "name": "Alex Shahid", "time": 1540911655196, "rating": 5.0, "text": "Great family owned business with excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "116063269017392885493", "name": "Wallace Brown", "time": 1497200750166, "rating": 5.0, "text": "Everything I needed to make a party successful. Great and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "106355579023585094587", "name": "Walter Readus", "time": 1560539569539, "rating": 4.0, "text": "Quick and fast service", "pics": null, "resp": {"time": 1564767196112, "text": "Mr. Readus, Thank you for the kind review. We hope to serve you again in the future."}, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "107513993754314588318", "name": "Vicki Wells", "time": 1499135382776, "rating": 5.0, "text": "Good for parties and remodeling houses", "pics": null, "resp": null, "gmap_id": "0x88891bb1694616e7:0x1cd6fc41ad3a4026"}
{"user_id": "105278300824478460759", "name": "Justin Myers", "time": 1623772711378, "rating": 5.0, "text": "Top notch group!  These guys ran stage production for a festival I played in GA and were complete professionals with great attitudes and gear!  They know how to run their equipment to provide the best visual (stage lighting) and audio that they could.   Will definitely use these guys for anything and everything in our future!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPcPDka2ELuZyI5IofRzrKIz8ES78B-KmDs34mp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPwH2DyLyjtT2HSLrTJk9P8TCOrHg-OhPOrU9gG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnNrOKl7hvFTAn7mX1xFiEpDQtWHib94u968q1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "103081399806302444198", "name": "Laura Walker", "time": 1603643455460, "rating": 5.0, "text": "I can always count on Josh Wagner and his crew from Chattanooga Pro Audio to get it right! Very professional group with the right equipment they need and it always sound superb! Easy sound checks and friendly staff. He is my go-to guy for good sound.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "109583734227502781374", "name": "MacGregor Wallis", "time": 1604609210496, "rating": 5.0, "text": "Chattanooga Pro Audio is the company to call when you need a professional audio visual setup! Josh Wager, the owner, went out of his way to visit our venue to ensure everything would be perfect. His talented technicians Gaby and Chandler, aka CC, were both very knowledgeable and fun to work with. Chattanooga Pro Audio did a great job, and I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "115927129266010112121", "name": "skylar gratz", "time": 1623797269046, "rating": 5.0, "text": "10/10 would play my loud af bass rig through these guys again", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "103340744286452053506", "name": "zack lewis", "time": 1600996972545, "rating": 5.0, "text": "Josh and the people at Chattanooga Pro Audio are exactly what the name says \"Pro Audio\". Extremely professional and respectful. We have used them several times at our church and everytime they go well beyond our expectations. No doubt about it we will be using them in the future and I will absolutely refer them to anyone I meet. Top quality product with top quality service.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "112852602288413224648", "name": "Taylor Locklear", "time": 1609695601023, "rating": 5.0, "text": "Super nice guys Josh and his crew took extremely good care of us and had professional gear! Easy to work with and will be working with them in the future!", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "107288416897262854802", "name": "Ross Rogers", "time": 1601102306762, "rating": 5.0, "text": "Josh and his crew take care of all or music events production large and small.  The detail is unbelievable no matter the size of the event.  His sound and lighting equipment is state of the art and  makes our venue look like somewhere you would see in a larger city.   Thanks for all you do for Crescent City Tavern in Dalton Georgia", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "102205230730346092693", "name": "Eddie Buchanan", "time": 1601123371720, "rating": 5.0, "text": "The team at CPA was great to work with! Quick an easy advance, and high quality production on day of show. The engineers were all pro and all of the techs were great to work with.  Looking forward to working with them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "108310034392127724358", "name": "Logan Kenzie", "time": 1581966392841, "rating": 5.0, "text": "Love using Chatt Pro Audio for bigger events! Josh always goes above and beyond to put on a killer show and thanks to him I'm able to just focus on being the entertainer. I would highly recommend his company for anyone looking to put on a larger concert or public event!", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "102588489549099188616", "name": "Kenneth Toomey", "time": 1600921086357, "rating": 5.0, "text": "Have used them hundreds of times.\nTop notch.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "116168465113037544823", "name": "Scenic Event Solutions", "time": 1581965335320, "rating": 5.0, "text": "Josh and his team always go above and beyond when we hire them to accommodate our larger events. I would recommend them for any event!", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "102738451232380113201", "name": "Tyler Hornberger", "time": 1529790096752, "rating": 2.0, "text": "At Hutton and Smith and not sure if the band is good because the mix is very bad. Can't hear vocals at all and the lows and highs seem very pronounced. This is my first time hearing them doing sound but not happy with it.", "pics": null, "resp": {"time": 1571689598056, "text": "Tyler thanks for the review. We havent done an event at Hutton and Smith. We do rent gear to other companies in town! Our engineers do freelance with other companies. Sometimes the bands will bring their own engineer and dont have time to tune a rig before they start the gig"}, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
