{"user_id": "104290687305606626509", "name": "Juanita Watkins", "time": 1616192487192, "rating": 5.0, "text": "Very friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "115453185023780046668", "name": "Bradley C", "time": 1580310318589, "rating": 5.0, "text": "Awesome experience. Impeccable team. Great knowledgeable team members. Helped me find what we needed.", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "103998687187727926404", "name": "Kevin Hood", "time": 1574812174532, "rating": 5.0, "text": "Professional knowledgeable and courteous staff. Great prices.", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "100717167083744713450", "name": "IrixGuy's Adventure Channel", "time": 1554337029021, "rating": 5.0, "text": "Great selection!  Their new location in the industrial park has a warehouse full of A/V equipment and the staff are super knowledgeable, friendly and willing to help!", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "106580358185049985824", "name": "Andy H", "time": 1514653778267, "rating": 5.0, "text": "I love Lane and the team. Knowledgeable and great customer service for small issues to large. If you need anything relates to sound and music give them a chance to earn your business.", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "105456267301906273526", "name": "Wesley Bowers", "time": 1505148424670, "rating": 5.0, "text": "These guys are 100% Pro and yet still easy to work with. I highly recommend using them for all your install, live sound, lighting, and video needs whether you are a church, band, or corporate client  looking for the best at a VERY reasonable price!", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "102158671435300910318", "name": "Merri Beth Stanfield", "time": 1582906710801, "rating": 5.0, "text": "Very friendly and helpful staff!", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "114023602152358503248", "name": "Jason White", "time": 1502165074072, "rating": 5.0, "text": "If there's any audio or video equipment you need, these guys will most definitely have it... Or can order it. Most of it is available same day as well.", "pics": null, "resp": null, "gmap_id": "0x887d48c3bc9cccc7:0x9d58aa826810fb24"}
{"user_id": "117636192197730020286", "name": "Tammy Watley", "time": 1625495208815, "rating": 5.0, "text": "I've used TSI's home security services for over a decade and have always been satisfied. I recently upgraded my system and can't begin to express what a game changer this was! I love being able to arm and disarm my phone with a single touch on me cell phone, as well as see what's happening at my home anytime. This was well worth the investment and I wish I'd done this year's ago!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114863772217753431186", "name": "Terri Chiang", "time": 1591308873199, "rating": 5.0, "text": "We just had the most pleasant experience with TSI Alarms. Everything went smooth from the very first call and speaking with Jackie to schedule the installation all the way until today where we met the most pleasant young man, David Madison, he made one of the most efficient installations we have ever seen, and then patiently took the time to explain everything about how this incredible new smart home system works. We cannot thank you enough David, you deserve great praise for a job well done!!", "pics": null, "resp": {"time": 1591372000723, "text": "Thank you very much. This means a lot to us. We appreciate your business!\nSincerely,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107533026856757918003", "name": "Steve Preskill", "time": 1602114106224, "rating": 1.0, "text": "Never use these people, they have a contract. Which I get. But won't even release military family members who are PCSing.\n\nThey absolutely do not support the military", "pics": null, "resp": {"time": 1602172408170, "text": "Steve,\n\nWe at TSI take our reviews very seriously. You signed the contract so you know there was one & they are very standard in our industry. TSI does support the military & we even offer a military discount. If you can provide documentation that you are being transferred outside of our service area then we would relieve you of the contract.\n\nWe also do not show you as a customer. Is your account in another name or are you speaking on the behalf of another customer? Or are you a competitor speaking on the behalf of a customer?\n\nSincerely,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108322631501804138626", "name": "Matt S", "time": 1590424684683, "rating": 1.0, "text": "Shady company ran by dishonest owners that will lie to you in order to keep your business.\n\nTSI Alarms also lied to me multiple times by saying that equipment installed by them (Qolsys IQ Panel 2) can ONLY work with TSI Alarms, and that if I cancel my account with them the panel will become useless. I was told that this info came directly from the TSI owners. They also said my doorbell video and other automations (lights, etc.) will not work if I canceled with them. They say that no other company will be able to use the equipment and it will only work with TSI since it was \"theirs\". They say that you cannot buy the Qolsys IQ Panel 2 online, because it comes from their dealer. This is all false.\n\nThey will also tell you that they don't know if they are allowed to cancel your account and that they don't know how to cancel accounts (and you have to call alarm.com to cancel). After multiple times calling alarm.com, I found out that you do in fact cancel with the dealer (TSI), not with them (they are just a third party software company). The lady at TSI needed to speak to her supervisor (but they were conveniently gone for the day), and she would call me first thing in the morning about if they can cancel/how to cancel my account (wouldn't you know, they never called back, I had to call them). The next morning, my call was passed around to 3 individuals until I spoke to somebody who wanted to make sure I 100% wanted to cancel my account (for all the reasons above). My alarm.com account was gone less than 5 minutes after I hung up. It was a fun few days of conversations.\n\nEdit: Thanks for responding M. Moore. I WAS a customer of yours, so I CAN leave a review on your company (I went to a different company because TSI is dishonest). Everything I've posted is 100% truth. You need to check your employees training if what you've read above is not how you want them interacting with customers. Shady.", "pics": null, "resp": {"time": 1590418768651, "text": "Matt,\n\nYou have over complicated this entire situation. It is actually very simple. The cellular device that is built into the Qolsys panel is registered to our company, TSI. You would need another company to replace that device. Of course the Qolsys panel is available online to anyone that would want to purchase it at a retail price. All the other automation devices that were installed in the home are also universal and can be used with any other company. You were not told that. That was your misunderstanding. You were actually told that the automation devices would no longer be free because TSI would no longer be providing that service. That is an agreement between TSI, DR Horton & the Alarm.com builder program. You can’t just have some random company give you a free Alarm.com account. I would think this would clear up any confusion you have. Like I said it’s very simple. You would need another company to replace the device.\n\nAlso please do not reach out to TSI to assist or help you for any other reason. We take our reputation and reviews very serious. We also do not appreciate you, who is not a customer going online as you if you are and giving our company a 1 star review. You are not a customer & do not reserve that right. We have been in business for 21 years. I can also tell you that during that time I have never been accused of being shady. That is slander! You need to be very careful with your words. We are upfront and honest to a fault. We did not tell people what they want to hear in order to make a sale. We have lost many opportunities & sales over the years for that reason. The other company was willing to tell them what they wanted to here even though it was false and we were not.\n\nSincerely,\nM. Moore\nVice President"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "104376188590895126320", "name": "Kimberly Brooks", "time": 1554341944788, "rating": 5.0, "text": "TSI is the best security system hands down. The whole team from owner Scott Moore to the receptionist is first rate. Questions are handled efficiently and effectively from first contact. My office (Farmers Insurance in midtown) has relied on the alarm systems provided by TSI for years.\nThey are my go to for recommendations to my clients.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "102491150141737937796", "name": "Mary Ann Fye", "time": 1554937925121, "rating": 3.0, "text": "Monthly fee is a little high but the company is willing to work with you on technical issues. This is a new account so I am hopefull it will be a good experience. I have heard they are better than some of the other companies out there. I love the sky bell! What a great feature and the app is easy to use.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "100165791896940350211", "name": "Victoria Schumann", "time": 1554508197630, "rating": 5.0, "text": "TSI is the best security system you can get. I’ve had TSI for years and have never been disappointed. The staff are some of the most friendly people I’ve met. I wish I could give them more than 5 stars!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "106961497047936210003", "name": "Lana Mosley", "time": 1554491870193, "rating": 5.0, "text": "I do not personally have an alarm with TSI but can attest to the owners of the business. They are good people who will provide excellent customer service and quality workmanship. They are compassionate, caring and concerned with doing the best job possible to meet your needs. If seeking an honest company to do business with select TSI.\n\nLana Mosley", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "116532744192439286818", "name": "Ricki Roberts", "time": 1554347370546, "rating": 5.0, "text": "TSI is a great alarm service! Ms. Jackie is wonderful, she is always so helpful! If we have ever had a problem she has always made it same day service. I highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "115961513458937791331", "name": "patrick Hardy", "time": 1564674113890, "rating": 5.0, "text": "I highlighly recommend TSI Alarms & Audio for ALL of & Your home automation, residential and commercial security needs. TSI is a locally owned private company with operating principles that include acting with integrity, establishing and maintaining win-win relationships, and owning the results. TSI is a company that I trust with rates that never increase.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "112618889902735374581", "name": "Audra Warren", "time": 1554407330626, "rating": 5.0, "text": "TSI is a wonderful family owned security company. I’ve had great service with them for over 3 years now. It’s very easy to use; and the best part is I feel safe, and protected in my home, and comfortable leaving town.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "113492092689991053375", "name": "Corporate Square 1079", "time": 1535656994340, "rating": 1.0, "text": "Probably the worst customer service I have ever experienced.  I purchased a business that already had their system installed.  I tried to cancel and go to a new local company, however they told me the contract was valid for another year and I had to stick with them or pay a penalty.  Ok, I'll do that.  Then I needed some service work done.  Forget it.  They take your information and it goes into a black hole.  Apparently your are required to follow up with them.  And you have to do it over and over again until you are lucky enough to get someone that can (help).  They will never call you.  After a few months of trying to get my problem resolved, they sent another company to come out and look at my equipment.  They tried to repair, but determined I need a replacement part.  I sent in the part, because it was under warranty a couple of months ago.  I still know nothing on whats going on with it.  The only person that knows anything is always out.  Buyers beware with this company.", "pics": null, "resp": {"time": 1536250140523, "text": "Can you please provide us with some more details so we can help resolve your issues. What name is account listed under?"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "106278925241284652487", "name": "Donald Smith", "time": 1539270834405, "rating": 5.0, "text": "My security system was 10 years old and in need of updating. I called Mark w TSI and he and Brandon did a really good job of installing me four new cameras w DVR and screen and reworking my outdated security pads. Great job, great communication and fair price. I trust these guys.We were rarely at home when they were there.\nGreat Company", "pics": null, "resp": {"time": 1539277297567, "text": "We appreciate the opportunity!"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "100743726927035566715", "name": "Larinda Moore", "time": 1536249259347, "rating": 5.0, "text": "TSI is a wonderful locally owned company that has not raised their monitoring fees in 20 years. Their camera systems and home theater and audio are top notch as well! I would highly recommend them to anyone. They also don’t do high pressure sale tactics or door to door soliciting.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "106016187240139687001", "name": "gaye mayo", "time": 1474315667964, "rating": 5.0, "text": "I would like to thank Mark, Jackie and the TSI Alarms crew for answering all my questions regarding my new alarm system as well as my new thermostats - it's awesome that I can do everything from my phone and especially when I am out of town.\n\nThe road techs have always been prompt and courteous and even came out to Orange Beach to check on the thermostats and after all that  it turned out to be the actual air conditioning unit -\n\nWould highly recommend them to anyone looking for home security and trying to figure out what I can do next to make my home more automated.\n\nThanks again!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "100560924522286433799", "name": "Tony Hines", "time": 1554379999821, "rating": 5.0, "text": "Scott Moore and his team are top notch. They have the traditional security knowledge along with the leading edge technology. No DIY solution is going to bring you the peace of mind and real security that TSI and their team brings.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "112879152481913365661", "name": "C Pace", "time": 1464292457194, "rating": 5.0, "text": "After having TSI Alarms (previously DRC Security) at my former residence for over 6 years, it was a no-brainier to have them at the home I recently purchased.  I called and was able to easily select and setup the equipment I wanted to install with their billing manager Rachel.\n\nRachel was beyond helpful in working with me to find a package of equipment that met my needs and my budget.  She ensured that I would have enough equipment to cover all of the home and to provide the wireless option I was looking for (so I do not have to have a land-line).  She scheduled a prompt installation that met our schedule with no problem.\n\nOn installation day two technicians Chris and Tony were sent to my home to install the system.  My husband was there to oversee the project and said they were both professional and courteous.  The techs cleaned up after themselves and ensured they discussed placement of all equipment with my husband so the alarm operated at its best performance.\n\nIf you are thinking of purchasing an alarm for your home I highly recommend TSI Alarms for their service.  Shop Local!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "111403578810851678430", "name": "Pratt Team", "time": 1554347081860, "rating": 5.0, "text": "The TSI staff was very helpful and patient. They fully explained what equipment I would need to handle the system I wanted to install and the different pricing options I could choose. I would highly recommend them to family and friends.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114606020448567061618", "name": "Gary Hand", "time": 1554385392006, "rating": 5.0, "text": "Great company and an amazing value. The entire staff are always on top of things, any questions I've asked they were able to answer quickly.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108322529972136239573", "name": "Shana Jordan", "time": 1554407163342, "rating": 5.0, "text": "My family loves being able to use a locally owned company to secure our home.  TSI is always quick to respond and extremely friendly!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "103972592489045427401", "name": "Mark Minnaert", "time": 1554346842427, "rating": 5.0, "text": "Great company to work with  Very knowledgeable  Was able to access my current system and give me the upgrades I wanted with no fuss  Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114763892991296370552", "name": "marcia Martin", "time": 1554346272118, "rating": 4.0, "text": "Tsi did a wonderful job on my new security system. Im am very happy with the service i received", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "115404959388497920167", "name": "Glenn Ramskog", "time": 1554342883206, "rating": 5.0, "text": "I could not be happier with TSI. Thier expertise with them helps life not have to be complicated with thier equipment", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107240439515708948865", "name": "Cathy Matter", "time": 1554344974409, "rating": 5.0, "text": "5 stars! This is a fantastic company! The people are fantastic to work with!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "118041631592110418599", "name": "Shelli Bell", "time": 1554345273723, "rating": 5.0, "text": "TSI is family owned and operated and it shows in the attention to quality customer service. You want them to be in charge of your security!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "115883297159765837720", "name": "Derek Brignac", "time": 1454535213482, "rating": 1.0, "text": "I used TSI alarms for my home security system after being contacted by one of their sales reps. 1 month into their service after installation the system quit working. Took approximately 1 month to get a tech to my house to fix the issue. System shorted out. The tech fixed the problem, but after another month the system quit working once again. Called multiple times to get it worked on again, but they could never come at a reasonable time. Ex. TSI tech would call me on a Wednesday at 3pm and tell me they would be at my house the following day at 11am to work on it. I do not know about them but my job does not allow me to take off work like that. After that we were never able to get them to come even though I was still being charge monthly for the monitoring service that I was not getting due to the system not working. Now I owe them for several months of service that I never received. My advice is to stay away from TSI and use ADT or other top carriers.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "110966405331533482638", "name": "Michelle Watts", "time": 1554479635085, "rating": 5.0, "text": "We have enjoyed our service, our sales rep and the installers.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "110350270320215858782", "name": "David Langham", "time": 1554346133583, "rating": 5.0, "text": "A+. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "101532534466319494221", "name": "Chase Connell", "time": 1474302105657, "rating": 4.0, "text": "After having several issues with our Security cameras,  they are fully functional and working properly. TSI Alarms came and fixed all of our problems without charging me.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107619511985136155196", "name": "Janice Files", "time": 1593616875451, "rating": 3.0, "text": "One month after having this system installed my panel goes off every 60 seconds at 9 pm. Customer service says I have to call back in the morning; the office is closed.\n\n** yes, I am a new customer of only one month and just got off the phone with your office. **  update -   I had faulty equipment - tech repaired and so far it is working again", "pics": null, "resp": {"time": 1550593209091, "text": "We cannot find you in our database as a customer? Can you please give us more information? We want to make sure you have the right company.\n\nThanks,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "109096199441659883314", "name": "Steve Lewis", "time": 1532587697787, "rating": 5.0, "text": "I have had TSI for 20 years & I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108535427598376243410", "name": "Tom Stanford", "time": 1550909922944, "rating": 1.0, "text": "Not trustworthy! You have been warned!", "pics": null, "resp": {"time": 1550941120073, "text": "Mr. Hillman,\n\nWe need some more information. We have gone through all our databases and cannot find you as a customer. Would your account be associated with another name? Can you please provide us some more information so we can figure out what your issue is? We also want to verify that you have the right company.\n\nSincerely,\nTSI Alarms & Audio\n\nMr. Hillman,\n\nWe are still awaiting your response. We will assume at this point you have no business or association with TSI. Please enlighten us otherwise.\n\nSincerely,\nTSI Alarms & Audio"}, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "108105323381413306804", "name": "rachel cauldwell", "time": 1532103870857, "rating": 5.0, "text": "Great customer service and staff!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "111478802473306752626", "name": "Elaine Taylor", "time": 1539279333544, "rating": 5.0, "text": "Great company to work with!", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "114039439658035553509", "name": "Tranay Tanner", "time": 1557784859272, "rating": 1.0, "text": "Customer Service support is Terrible with this company.", "pics": null, "resp": null, "gmap_id": "0x889a4da9a3f7539d:0xfbbf286a9427cba8"}
{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1615524814972, "rating": 5.0, "text": "Very knowledgeable and had some amazing new gadgets.", "pics": null, "resp": {"time": 1619054545851, "text": "Thank you for the great review!"}, "gmap_id": "0x888e8ffbf4c65e57:0x800b94a84a3eb6f1"}
{"user_id": "106759163216007233170", "name": "Zach Varcoe", "time": 1564523356948, "rating": 5.0, "text": "The best of the best! Family owned and operated for 20+ years. During that time Shaffer Security has advanced with the latest technology and you're not going to find a better price for their guaranteed quality.", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "117833960309698806626", "name": "Phyllis Roberts", "time": 1498603338732, "rating": 5.0, "text": "This is a top rated veteran-owned small family business.  The owner and his wife are very professional, responsive to customers' needs and very reasonable compared to the larger companies.  We like the fact they there is no monthly monitoring fee like some of the other security camera companies.  You monitor your security cameras on your smart phones 24/7.   If there is a problem, they come to investigate and repair it as soon as possible.  I recommend this company highly.", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "113045164966950707298", "name": "Ron_Sheena Hicks", "time": 1521514973833, "rating": 5.0, "text": "Extensive audio/video and alarm knowledge.  Family veteran owned small business, always willing to offer a variety of solutions to meet your project goals and budget.", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "114985177765500171422", "name": "art miney", "time": 1495058462479, "rating": 5.0, "text": "Great locally Veterain Family owned and operated company", "pics": null, "resp": null, "gmap_id": "0x886267e51912a7a1:0xe7827321ff0d40a0"}
{"user_id": "103835170865665748635", "name": "Benjamin Pugh", "time": 1536871286507, "rating": 5.0, "text": "I've had Swift Installs put in security systems at my business, and a home theater at my house. Each experience went smooth, and all the equipment is still going strong.", "pics": null, "resp": null, "gmap_id": "0x887f93a20b68eb2d:0x988e5283bd747139"}
{"user_id": "108140466990421739248", "name": "Robyn Wright", "time": 1515816606749, "rating": 5.0, "text": "Great service Tech's and great customer service overall!! Will be recommending these guys!! Excellent work!!", "pics": null, "resp": null, "gmap_id": "0x887f93a20b68eb2d:0x988e5283bd747139"}
{"user_id": "114415659727939822690", "name": "Christen Henry", "time": 1606581050983, "rating": 5.0, "text": "Happy to help anytime I can.", "pics": null, "resp": {"time": 1606580352311, "text": "Thanks Chris! Thanks for all of your help over the years."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1598535119714, "rating": 5.0, "text": "Great and easy company to deal with. Wide variety of all things technology.", "pics": null, "resp": {"time": 1606580287572, "text": "Thanks Steven! We love partnering with you. Let us know if you need anything."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1521991299698, "rating": 5.0, "text": "Holt Audio and Visual is well known to me personally. I worked in the legal field in Birmingham for over 42 years as a legal secretary, legal assistant and paralegal and first learned of Holt AV's services while on the job. However, over the years, I have personally used their services on a number of occasions to obtain duplicates of and share videos and recordings that were taken on vacation and during get togethers with family and friends. One tape in particular was very old, but the staff at Holt AV did an extraordinarily important job for me in duplicating a recorded conversation with my mom made many, many years before her death. I felt they took great interest in and were attentive in doing an excellent job in delivering something that has become very precious and invaluable to me and my family. Thanks, Holt AV - wishing you well for another 60 years and beyond!", "pics": null, "resp": {"time": 1522071411392, "text": "Thanks for the kind words! Hope we can be of help in the future!"}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1527514496364, "rating": 5.0, "text": "Customer service at it's finest. They go out of their way to make sure you have what you need when you need it.", "pics": null, "resp": {"time": 1527599902330, "text": "Thanks for your comment! We love making our customers look their best."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "117026204638973993809", "name": "Wes Blankenship", "time": 1592011213773, "rating": 5.0, "text": "An excellent experience! They installed 4 in-ceiling speakers and 2 in-wall speakers for my man cave and I could not be happier. My wife thinks it looks great, too!\n\nThey listened and worked with me through the entire installation, making sure things were exactly like I wanted. I never felt rushed or pressured to make a decision.\n\nYou know the phrase, \"Measure twice, cut once\"? Well these guys measure 200 times, cut once! It simply looks great down here, I'm so very happy with their work.\n\nI'm telling you guys, these folks know what they are doing for home AV installations. Thanks again to Gary and Tommy for working with me!", "pics": null, "resp": {"time": 1592346095183, "text": "We’re so glad you had such a great experience! Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "112244653145518416180", "name": "Nina Gay Chambers", "time": 1591128933955, "rating": 5.0, "text": "Can't begin to give enough thanks to Chad and his team for always being quick to respond, have the right answers and quickly solve whatever technology or  wiring project we've gotten stuck in and/or just plain over our heads.  They are always quick to come to the rescue and teach us something new in the midst of it all. As a small business owner, John and I thank you for being our IT safety net!", "pics": null, "resp": {"time": 1591132997693, "text": "Thank you for your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "106773404712272047324", "name": "Travis Bender", "time": 1587237663263, "rating": 5.0, "text": "I've used Reliant Media for a variety of audio and visual jobs at Oak Mountain High School.  Some of the things they've recently done for us include:\n\n1) Installing new LED lighting in our Performing Arts Center\n2) Installing a new sound system in our band room and at our band practice field\n3) Installing a new projector and screen (10' x 16') in our band room.\n\nChad and his crew at Reliant Media helped us develop a game plan to ensure our students would have the right equipment they need to be successful, delivered very competitive pricing, completed the work promptly, and followed up with us after installation to check that all electronics worked as needed.  I highly recommend this team of professionals.", "pics": null, "resp": {"time": 1591133155505, "text": "Thank you for your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "104740547417403318147", "name": "Amy Strickland", "time": 1591130114641, "rating": 5.0, "text": "Chad is our hero. He does all the lights for OMHS and we're going to go to him for sound equipment too. He worked out the best solution for our unique space and priced it in a variety of ways. Install was fast. Our new lights are gorgeous and we have five new working mics too!", "pics": null, "resp": {"time": 1591133134873, "text": "Thank you so much! We appreciate you too!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "107611865409291109988", "name": "Chad Yeilding", "time": 1591630734020, "rating": 5.0, "text": "Chad and Gary were very responsive to the needs of my business. They were respectful of our time and made sure that we didn't need to be shut down during business hours. Highly recommend the team at Reliant.", "pics": null, "resp": {"time": 1591719753174, "text": "We appreciate your business and kinds words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "103930415208278267461", "name": "Glyna Humm", "time": 1591977362761, "rating": 5.0, "text": "Shout out to Gary and Reliant Media.  Gary is never too busy to take my call and has done great work setting up our WiFi.  He is very responsive and I wouldn't hesitate recommending him.", "pics": null, "resp": {"time": 1591995986936, "text": "We appreciate your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "103595333567905764884", "name": "Greg Martin", "time": 1575677707906, "rating": 5.0, "text": "Chad at Reliant Media was fantastic!  He and his team really took the time to carefully troubleshoot several network issues in our home we just\nmoved into, and they patiently tackled every issue at a fair price.  I highly really recommend!", "pics": null, "resp": {"time": 1575681557164, "text": "We appreciate your kind words. It was a pleasure working with you as well!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "107913499802684692020", "name": "Lavon Chaney", "time": 1560954631521, "rating": 5.0, "text": "The guys at Reliant Media are a godsend!  They helped a co-worker set up digital TV so she can ditch cable (even found her a great tv!). They found the perfect laptop for my son entering college, and made sure it met all the requirements necessary for his degree, set it up, and delivered it to me!  They are very fair in their pricing and dependable!  Can't say enough good things.", "pics": null, "resp": {"time": 1560997242670, "text": "We appreciate your kind feedback and business! Thanks again!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "111776540060656452230", "name": "Mark Branson", "time": 1555771549691, "rating": 5.0, "text": "Recently set up our virtual phone system. The experience was great. The staff is knowledgeable and professional as well as responsive. I would highly recommend Reliant Media to anyone in need of technology solutions.", "pics": null, "resp": {"time": 1555848872737, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "109070737398365845116", "name": "Lindsay Dyess", "time": 1534866065434, "rating": 5.0, "text": "I recently purchased a laptop through Reliant Media and I was very happy with my experience. Chad was very helpful and knowledgeable about helping me choose the computer that worked best for me and my budget. This care and attention to detail is not something you would find at any retail store. I will definitely be returning to Reliant Media for future business!", "pics": null, "resp": {"time": 1534867226902, "text": "We appreciate your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "115144033275796516857", "name": "Jeremy Galloway", "time": 1535123483704, "rating": 5.0, "text": "Chad did a great job getting my email system migrated over to Office 365. Was able to do it in 24 hrs. I was haven't issues with emails going to spam/not being received but not any longer!!! Thanks again Chad.", "pics": null, "resp": {"time": 1535124485868, "text": "Thanks for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "103298949738277945268", "name": "Gary", "time": 1536163682447, "rating": 5.0, "text": "Great Installation and Experience. Had three TVs hung. They all work great, and look great. Would highly recommend! Will add pictures later.", "pics": null, "resp": {"time": 1536164332749, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "110301962572750344031", "name": "Richard Brock", "time": 1545165888062, "rating": 5.0, "text": "Chad did a great job.  He solved all of my issues and explained things in a clear manner.  He is a great teacher in addition to his skills in technology.", "pics": null, "resp": {"time": 1545280551597, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "115721635837570665186", "name": "Rick Rogers", "time": 1591626143889, "rating": 5.0, "text": "Chad, Tommy and the entire staff of Reliant are outstanding!", "pics": null, "resp": {"time": 1591630179971, "text": "We appreciate your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "109172859414256049719", "name": "Ben Birdsong", "time": 1534904908409, "rating": 5.0, "text": "Reliant Media is a great company that can help you support your current technology while also advising, installing, and helping to plan new technological endeavors. I would highly recommend Reliant Media for your technological needs.", "pics": null, "resp": {"time": 1534906209520, "text": "We appreciate your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "106250846895262957979", "name": "Mark Ebert", "time": 1551560487596, "rating": 5.0, "text": "Just upgraded the audio for our church. Professional and extremely knowledgeable staff.", "pics": null, "resp": {"time": 1551564989299, "text": "Thank you for your kind review. It was a pleasure working with you and the team!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "104107903951416195713", "name": "Kerry Rush", "time": 1536349219595, "rating": 5.0, "text": "RM was just that . . . reliant!  Service was thorough, installation went smoothly, and training was offered for new equipment!", "pics": null, "resp": {"time": 1536349887133, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "102787019948847241298", "name": "Curtis Tarver", "time": 1516201047089, "rating": 3.0, "text": "Okay", "pics": null, "resp": null, "gmap_id": "0x889288c99e6bb249:0xc76fe141c088fb19"}
{"user_id": "115249260438557101933", "name": "Allison Phillips", "time": 1580852912193, "rating": 5.0, "text": "Sometimes you need an honest answer about what you think you need and what you actually can have. Andy Evans was totally honest with us about this very idea. He didn't try to up sale us but instead he educated us about what was realistic and a more practical approach with our project. Really refreshing and well received. Thank you Andy!!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "116751464109888572228", "name": "Darrel Arnold", "time": 1580859361514, "rating": 5.0, "text": "AVX is a great company with excellent customer service. Any issues that you might have would be addressed promptly and in a timely manner. I would highly recommend using them. They do what they say they are going.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "104053829378433359763", "name": "Lynn Ray", "time": 1580996883469, "rating": 5.0, "text": "Brenda does an excellent job of working with her clients to make sure that everything meets their requests, their expectations and that they are completely satisfied with the work. of the AVX technicians.  She is available to take your call and cheerfully makes sure it is exactly what you ordered.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "110257042736645519063", "name": "Alex Casey", "time": 1580874858379, "rating": 5.0, "text": "Andy Evans is a man of his word. It shows in his work ethic. He and his team are very honest with their clients. Highly recommend AVX for all audio and visual projects!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "110933419211731821061", "name": "Guy Rosenstiel DMD", "time": 1580906713015, "rating": 5.0, "text": "Thank you for an excellent system with fabulous sound! And Andy Evans coordinated a team that was fast, clean and friendly! Could have had a better experience!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105767417209614742420", "name": "Rab Stewart", "time": 1574287527369, "rating": 5.0, "text": "Andy Evans and the crew at AVX are the best in the business. They are extremely knowledgeable when it comes to AV. They have helped me in both my home and office. I can't thank these people enough for giving me top notch service and products.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "101140300628780553552", "name": "Bryant Miles", "time": 1581538787218, "rating": 5.0, "text": "Working on projects Andy Evans and his team at AVX has been outstanding. They are very professional, know the market better than any other company we have worked with and are very upfront on the scope of the project. I can't say enough good things about him and his team.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107908422285805830817", "name": "Josh Smitherins", "time": 1574710023214, "rating": 5.0, "text": "I dealt with Beau while searching for a pair of JBL Synthesis speakers.  We didn't end up making a deal, only because the speaker I was looking for was a closeout and they didn't have any in stock, but he contacted the manufacturer twice to find out information for me.  Great customer service.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "114396426399822584072", "name": "Joe Daniel", "time": 1580921002286, "rating": 5.0, "text": "Great advice, great products, awesome and timely service.  Will definitely continue working with Andy and the folks at AVX.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100125509814179742954", "name": "Hank Spencer", "time": 1580855533156, "rating": 5.0, "text": "Andy Evans and the crew at AVX are the best in the business. They are extremely knowledgeable when it comes to AV", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "102084078621205624586", "name": "Kimberly Arnwine", "time": 1580872420066, "rating": 5.0, "text": "If you want to work with someone awesome, Contact Andy. He will take care your needs!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105335899150915787817", "name": "Howard Whatley", "time": 1580854773826, "rating": 5.0, "text": "Excellent Company, Excellent service.  Andy Evans is first class all the way", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1580910668596, "rating": 5.0, "text": "I’ve know the leadership at AVX for a long time! Quility team, quality experience!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "109714369762860128484", "name": "Britton Eveland", "time": 1580850273536, "rating": 5.0, "text": "The team at AVX are knowledgeable, and professional in the service they provides my family, I would recommend them to friends and family!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "109924224506168108751", "name": "Ryan Mays Young", "time": 1518220323117, "rating": 5.0, "text": "This friendly group of people delivers the best audio and video experience in Alabama. Not only do they install high-quality equipment but they make it look amazing. If you're looking to upgrade your house this is the way to go.", "pics": null, "resp": {"time": 1519247636643, "text": "Thank you Ryan! Please let us know if you need anything further!"}, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "101301489770735942522", "name": "Wes Cline", "time": 1580855608129, "rating": 4.0, "text": "Andy Evan's and his team are passionate about customer service.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107873574863274697927", "name": "phil white", "time": 1446143218399, "rating": 5.0, "text": "Dan worked at our home and awesome.  Very knowledgeable,courteous and professional.\n\nWe had some minor issues after installation was complete that were quickly taken care of.\n\nDan will be the first person I call when I need this type of service again.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "115650444634794719679", "name": "James Kerr", "time": 1580852066501, "rating": 5.0, "text": "Andrew Evans is a true professional.  I trust him and AVX will all of my AV needs.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105441075203208225875", "name": "Harvey Trueblood", "time": 1580851511024, "rating": 5.0, "text": "Andy is always on top of his game with all of his customers all the time. Would never hesitate to use him and his services or refer him and his team .", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "112903902272691164009", "name": "austin johnson", "time": 1580850562586, "rating": 5.0, "text": "Extremely knowledgeable  and can do any job", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "105788749855785766504", "name": "Michael Joffrion", "time": 1542964206932, "rating": 5.0, "text": "AVX has come through od=enc aa=gain with my specia reweuet. I recenty came down with the very serious case of upgradeitis; Bo Lamar, of their first salesman listened patiently to what I WANTED and got back t o my in a few days of with 3 plans. The Caddy Plan The GMC Plan and The Honda plan for caatch strapped fella and strella couple. Bo knew my personal listendng habits, so he had no problem with findig a few spakers o fit my needs. Several week past and we went throught pairs or loudspeaers: REeve, and Focal. While undert warranty of coursel.\n\nI hahad  helped creat the new line s pw,, it' ;ike athe  cash show at ther moment. B%. W's Nuatilus 802'a for nearly 20 years and thy outperform pretty mudh efvery speaker rhat was been put against it.Imto;u recemt;u.. Kurt got a little bit crazy souding ad it\n\nAmuwau, I think the jJet hae a distinctive of the gams arpmg on what out us I feel like we appropriate  They took athe bades to actually check the ad,\n\nSo,given,r test and speakers + suboofers, what are you thourhgts compared to Billie Joel?\n\nOve rthe weekend, I am being met wit h the worden about this issue.  aim setting 804'sin order and going to give top them 804's om a jhabisuas\n\nThanks for Yout Time Sirl,", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "116891609575461291674", "name": "ralph quinn", "time": 1483465769108, "rating": 1.0, "text": "Great folks if you never have an equipment issue.  Apparently they really aren't intrerested in retaining you as a customer after the sale is made.I'm in the process of looking for a different company who will stand behind their product line. Do not let them sell you any Integra equipment.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100452914277292530367", "name": "Ivy Stokes", "time": 1440945254646, "rating": 5.0, "text": "Had a good install with no major issues.  I like the Sonos system AVX installed better than the Control4 system I used to have.  I would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100234670222462545800", "name": "David Gibson", "time": 1472418665788, "rating": 5.0, "text": "These guys are at the top of their game for new technology and cool solutions for home and work!", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "100497151587034212548", "name": "Kevin Barber", "time": 1580849987344, "rating": 5.0, "text": "Great company to work with.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "113290823247246074100", "name": "dave Chapman", "time": 1506542136677, "rating": 5.0, "text": "Quality product and excellent service", "pics": null, "resp": {"time": 1507057416368, "text": "Thank you so much! Let us know if we can help you any further."}, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
{"user_id": "107013176019786573708", "name": "Jack Belew", "time": 1421810122343, "rating": 1.0, "text": "Absolute rip off. Paid 5x what my neighbor paid for a system that has twice the issues.", "pics": null, "resp": null, "gmap_id": "0x8889197bbe75bc0f:0xb765679aefb2e857"}
