{"user_id": "108771538073309643058", "name": "Courtney Williams", "time": 1525469487375, "rating": 5.0, "text": "Awesome company. We use them for all of our audio and video needs. The owner comes on site to inspect the work being done. I highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a37cefc5595:0x2a596d9619327ac7"}
{"user_id": "105456267301906273526", "name": "Wesley Bowers", "time": 1563811370023, "rating": 5.0, "text": "Nick and the guys at Sweettree are 100% professional, courteous,  knowledgeable, and VERY fairly priced! I highly recommend doing business with them for all your production needs.", "pics": null, "resp": null, "gmap_id": "0x887d4f2feae7be5f:0x16e1e22c00ce4d16"}
{"user_id": "111337447583860548252", "name": "Dustin Coan", "time": 1521133812449, "rating": 5.0, "text": "Brian, Nick, and the rest of the guys will treat you right!", "pics": null, "resp": null, "gmap_id": "0x887d4f2feae7be5f:0x16e1e22c00ce4d16"}
{"user_id": "110688171375616329575", "name": "Drake", "time": 1468983453072, "rating": 5.0, "text": "I called them at 1 pm about installing speakers I bought at bestbuy they were ready too install two hours later. I had to go to work, but they installed everything and then drove my car back to work and it sounds great. They beat best buys prices by almost 200 dollars and if you have to get speakers installed I would go to them as they have the best prices and really good customer service.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "106901702081802817472", "name": "Cindy Hosea", "time": 1460589471652, "rating": 5.0, "text": "As of today I would not recommend them.  Two weeks ago I went in to get a new radio for my car.  They promised the one they put in with all the bells and whistles would be\nperfect.  Well the radio came in with wrong parts as they had reorder that was fine.  Finally they had all they needed although they kept calling saying you need this and that we said ok.  We took my car to them and they had it 4 days.  Finally after a lot of phone calls they said it was done.  It tried to sync my phone and it did but no sound out of the speakers.  They couldn't figure out the problem so the installer promised he'd call the manufacturer Monday morning and call me.  No phone call.  I called him and got his voice mail.  No return call.  I called the shop and was told they would call as soon as he got in .  No call.  I also called Sirus to have that transferred from my other radio but they didn't hook it up.  So here I sit with a very expensive radio and CD player.  At this point the ball is in their court and I'm waiting to see what they do. Until then I would no recommend them to anyone.\nI now will give them 5 stars.  They have fixed my problems and everything works perfect.\n\nI would go to them again.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "113513323082880009789", "name": "Jason Smith", "time": 1468931601921, "rating": 1.0, "text": "I ordered 1500.00 worth of stuff and was told it would take 3 days but it took over 30 days and everyday I called I they got smart with me and gave me excuse after excuse of why it wouldn't come I am now a dealer for scar audio and many other products and when I order something it never takes over three days it is obvious that he spent the money on something else and had to try to get it back before he can order my stuff", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "103696025419201686866", "name": "erika smalley", "time": 1474155131543, "rating": 1.0, "text": "Save your time. This place is absolutely ridiculous. My husband went for his appointment at 6pm and didn't get home until 10pm and they still didn't have the rca wires to hook his speakers up. We are now on day two, so far three hours into it and no speakers hooked up.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "102998610696906351731", "name": "Brent Smalley", "time": 1474769300638, "rating": 1.0, "text": "Got speakers set up---took over 7 hours and 2 days. Nothing was bolted down and wires were loosely ran. Now my speakers are completely out. Don't recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "117945846625069676819", "name": "Charles Garrett", "time": 1474783531751, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "103445300453480876864", "name": "Amanda Hickman", "time": 1619582942142, "rating": 5.0, "text": "From he time I first spoke to him he was very personable and helpful. He answered every phone call helped me out from the time I hired him until the wedding was over he was there for me. I most definitely recommend Jeff and Timothy their amazing and down to earth.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "113059907300348675839", "name": "Wendy Miller", "time": 1622478051500, "rating": 5.0, "text": "Great job today with music and sound system at our Memorial Day ceremony. Your professionalism is 5 star!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "106046820848664602419", "name": "Thomas Byrd", "time": 1620252444143, "rating": 5.0, "text": "Music Man Productions provides the best live sound and DJ services in the Wiregrass. He was able to work with me to come up with a package/price that was perfect for our event. Will be using again!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "105984295892714510125", "name": "Angelina Kitts", "time": 1623563534373, "rating": 5.0, "text": "Jeff was so professional and sweet and just wonderful!! He made the day perfect and I would absolutely recommend him!!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "116748653853346189234", "name": "Andy Sibley", "time": 1610137692679, "rating": 5.0, "text": "Jeff and his team did a great job. Very professionally and easy to work with. I highly recommend to hire them for all of your sound needs.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "108594849853367810529", "name": "Karen Golden", "time": 1584387456905, "rating": 5.0, "text": "Jeff Strickland is simply the best in his field. I am a gospel singer and I like to take Jeff with me when I sing at different churches. He is totally professional. He knows exactly how to blend my music and also is very easy to work with. He listens to what you want and works with you to fine tune the sound. I would highly recommend Jeff for church services, for soloists of all genres,\nweddings, reunions, parties or any and all kinds of music. Jeff is also extremely dependable!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "103784772270702534144", "name": "Headland Area Chamber of Commerce", "time": 1585336989530, "rating": 5.0, "text": "Jeff and his crew always show up early and stay with us until the job is beyond done. He provides professional, quality sound and has become part of the team for the Headland Area Chamber of Commerce. Great service and has a big heart.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104239653481270127059", "name": "Brenda Fulford", "time": 1584312785949, "rating": 5.0, "text": "If you need music for an event of any kind Jeff Strickland is the man to call.  He has great equipment,  lights and  the type of music you prefer.  He is professional and has reasonable pricing. Always a great experience.\n\nTed and Brenda", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "101805305790946548798", "name": "Tammy Martin", "time": 1583970486184, "rating": 5.0, "text": "Have hired the Musicman several times and he is always very professional. He offers music for all occasions. Dancing and Karaoke. I give him 5 stars.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "104168710113112894887", "name": "Ronnie Bush", "time": 1584317714489, "rating": 5.0, "text": "He is very professional and knowledgeable about music and equipment. I have led  the music at church for over 35 years and our sound has never been this good.I don't know what I would do without him", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107687923502063312996", "name": "Melvin Williams", "time": 1569640541959, "rating": 5.0, "text": "Top notch sound and lights.Great equipment,and always a great mix.Great guys to work with.He's got my vote!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107713093748506115468", "name": "chris wortz", "time": 1583949889032, "rating": 5.0, "text": "Great equipment,  great personality,  he does a great job!!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112947858006965496584", "name": "Donnia Rambin", "time": 1583940843929, "rating": 5.0, "text": "Jeff is very professional. He does a great job and is a delight to work with.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "112100372596557505411", "name": "Shane Corbin", "time": 1568846456888, "rating": 5.0, "text": "Was very personable, we had a great time with the music selection.", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "110759091560651205262", "name": "Una Taylor", "time": 1569088588845, "rating": 5.0, "text": "A Joy!", "pics": null, "resp": null, "gmap_id": "0x888d6124fbef18bb:0x1dcde7e234a66cbd"}
{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1615524814972, "rating": 5.0, "text": "Very knowledgeable and had some amazing new gadgets.", "pics": null, "resp": {"time": 1619054545851, "text": "Thank you for the great review!"}, "gmap_id": "0x888e8ffbf4c65e57:0x800b94a84a3eb6f1"}
{"user_id": "118016760844292205665", "name": "Angela Luckey", "time": 1625994225828, "rating": 1.0, "text": "The lady at the front is extremely rude and acts as if she is to good to help anyone.  We were going to buy duel headrest DVD players for our van.  The man quoted us $550. My husband and I walked out the door for not even 3min to talk about it and went back into to pay but the man was in the garage working on something.  So we went to pay the woman and she told us $799. We said that gentleman just quoted us $550. She replied he don't know what he is talking about. So we turned and walked out.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "106477425478545141695", "name": "Renee Martin", "time": 1619560355965, "rating": 1.0, "text": "I will be adding photos, videos, receipts, and dates and proof of all issues, lies, and thieving this company did. Installing fault equipment and then saying “no refund on the door” is not a way to conduct a business you wanna keep. Stay tuned for the collected info.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-bj-gY6sfJn6pjAb9d80KXEKYsrLLGkXcIyik=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZs44DrvfGb9ixArVoanDPTVvKMYwcr8TJSE0q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkQi8NJ9ifQoVwCFOIwk_MyvHGRA8rAo_KqiNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKwFkKsKtn4KNQIIImuLRe2UiOsi9w_oIsp3tp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2NaQdH1u5NLmGKaoYnOFtH3LhVu50wPoQFuy9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "116236100708232329963", "name": "Craig Whited", "time": 1611457800106, "rating": 5.0, "text": "Tony and Veronica are awesome to do business with. Tony has installed stereos, amps, headset video players, subs, led lights, etc. on several of my vehicles through the years. My most recent , he installed a complete stereo system in my Jeep Rubicon. Awesome work!! I would highly recommend this place to any of my friends. Near or far. Worth the drive.\nThey also warranty and stand behind their work and electronics 100%.\nThanks Tony !!!", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "107175123651966725627", "name": "robert anderson", "time": 1624408215762, "rating": 5.0, "text": "Great experience, Great service. 👍", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "105858466478826894643", "name": "Britney horn", "time": 1616488374462, "rating": 1.0, "text": "My son went to get underglow lights and speakers installed. They half installed the speakers. The volume controls were not ran and the speakers were not set up for his car stereo settings. When we got home we had to work on it for an HOUR ourselves to get them to work properly. The volume controls are now in the back of my sons car where he cannot get to them to adjust them as he’s driving. he has to pull over to adjust his bass now. The underglow lights didn’t work from day one with the app. They would turn on, But the app never controlled the lights properly. Blue would be red for example. Maybe sometimes. Purple would be green sometimes. red and blue under lights are illegal. So he has NO idea what color he’s getting from inside the car. He again, has to pull over to poke around on colors in the app to get a color he wants. And last week in the freezing rain countrywide freeze, he had to stand 20 minutes in that rain to even get them to turn off because the app is so faulty. Now, 3 of the 4 sides dont even work at all. They’re unable to be turned on at all. First week one light went out. Now, a month later, 3 are Completely out and not functioning. They quoted him at $150 and charged him $240. We filed a claim with BBB and they refused to refund. By the way, you guys should look them up on BBB. Their business rating and reviews there as well. That’s ok tho because I’ve costed them WAAAAY more than $240. So far I have stopped one adult from going there and 2 of my kids friends from going there and one student that I tutor from going there. Turns out, if you have a LOT of friends and you have junky underglow lights, your friends bring it up everytime they see you. And that means you’re constantly getting to tell EVERYONE about it!!! We are a driving billboard for toy store customs awful work and business ethic. We’ve been able to bring up the store and the horrible work they do MANY times. I have several nephews about to turn 16 and get cars, and they’ve seen what toy store customs has done. This entire circle of friends is into the car scene and modding their cars. So I will continue to send them somewhere else in fort payne. A great shop we’ve found. So Toy store customs denied a $240 refund (even if we took the lights back to them) and it’s costing them 10 times that much LOL. So their refusal to refund me is costing them big time.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "110851155334429812484", "name": "Sonja Mullins", "time": 1622521297055, "rating": 3.0, "text": "Service wasnt friendly long wait for any work to be done sucked", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "102301057048765192956", "name": "Samuel Chatman", "time": 1609184492587, "rating": 5.0, "text": "Great service at a good price.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "115520484690733307021", "name": "David Wootten", "time": 1612577722408, "rating": 3.0, "text": "Been there twice for something for my new truck. Nope. Can't help you.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "116615948617555939400", "name": "Matt Hamilton", "time": 1502310587482, "rating": 5.0, "text": "Great place to do business with. Friendly staff, nice selection of equipment.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "104598349455747143663", "name": "Porkchopranch", "time": 1571263975081, "rating": 3.0, "text": "Good folks and they are real helpful", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "115963129761734613292", "name": "Nick Linder", "time": 1548986346166, "rating": 5.0, "text": "Tony runs a good business, great dude to deal with.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "112209209930314518223", "name": "Bobby J", "time": 1500550043669, "rating": 1.0, "text": "do not take your trucks here!!!!  had a leveling kit put on. i ended up having to take it somewhere else to have it fixed right plus they drilled holes in my frame for they're gay name plate  plus I could have saved money going anywhere else they over priced it by $50 I will mot be back", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "116027685930782077463", "name": "Brian Mince", "time": 1544224697553, "rating": 5.0, "text": "Great folks with lots of experience.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "117202548501968535985", "name": "Michael Givens", "time": 1530314227222, "rating": 1.0, "text": "These people will try to sell you a head unit that you can buy at most places for $150 is there price $475 and it's an outdated unit.", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "110928853833912361181", "name": "guillermo beltran", "time": 1529098343870, "rating": 3.0, "text": "(Translated by Google) For me the vicita was very pleasant and profitable\n\n(Original)\nPara mi fue muy agradable y provechosa la vicita", "pics": null, "resp": null, "gmap_id": "0x8861d5fb144a99bd:0xaff1cc803791bea7"}
{"user_id": "112317126159442378371", "name": "Alyn Boyer", "time": 1625058697421, "rating": 5.0, "text": "I thought Seth and his team were awesome. Very professional...on time... great music and the photo booth was also fun!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "113753545530393532120", "name": "Daniel Westfall", "time": 1605733303295, "rating": 5.0, "text": "Overall great experience! Great communication leading up to and after the event, nice music selection, and a DJ that read the crowd well. They offer other services as well - including a cool photo booth. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "115555951684107550038", "name": "Madison Poole", "time": 1605705519393, "rating": 5.0, "text": "Such amazing / professional people to work with! The communication before and during the wedding was phenomenal! If you’re looking for a fun DJ, you’re looking at the right place!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "117907838586655513299", "name": "Shoals Diversity Center", "time": 1532370451903, "rating": 5.0, "text": "Reasonable prices, complete efficiency and superb communication.  We will never have another event without Fine Era!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7iaTFsT1x_aTXxvqNE8y5qNSasAwBre9oRwIZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "102236065462838998956", "name": "Sara Moseley", "time": 1573511665772, "rating": 5.0, "text": "Great for Wedding Rentals and as a DJ!\nSeth and his team at Fine Era were responsive to communications, prompt, efficient, accommodating with the venue location, and offered an extensive menu of services at very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105734223164660320772", "name": "Michael Henderson", "time": 1561505291974, "rating": 5.0, "text": "Absolutely professional. Top shelf production, will definitely hire again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105020868738915951523", "name": "Leella Holt", "time": 1447336717234, "rating": 5.0, "text": "Seth at Fine Era Productions provides a wonderful experience for high school dances.  The music has already been \"scrubbed\" and is suitable for school venues.  Seth is prompt and dependable.  Fine Era Productions provides services in such a manner that school sponsors do not have to be concerned about the outcome!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "110383955445711650681", "name": "Erin Gray", "time": 1438881269749, "rating": 5.0, "text": "Last year, our school had to find a new DJ. Seth and Fine Era Productions really came in to save the day! Not only are they fantastic at their job but they are really great people to work with. We used their DJ services that included up-lights as well as their bistro lighting. The event was a major success and looked amazing. The music is current and they know how to get the crowd going. I can not recommend Fine Era Productions enough! I've already reserved them for this year and can not wait to work with them again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "116306875088218071030", "name": "jesse wilkins", "time": 1610134424019, "rating": 4.0, "text": "Nice place.. Only place I've seen in mobile that has a wide variety of inventory of communications equipment.. DOWNSIDE IS THEY DO NOT SELL TO THE PUBLIC..", "pics": null, "resp": null, "gmap_id": "0x889a4c55763c9039:0x55e6629e6ef77784"}
{"user_id": "108090995247291317250", "name": "Bryan Chambers", "time": 1597254404996, "rating": 5.0, "text": "Awesome people and always friendly and willing to help in any way,  as a local home security business owner . Cerberus home security llc in elberta AL is proud to do business with ADI", "pics": null, "resp": null, "gmap_id": "0x889a4c55763c9039:0x55e6629e6ef77784"}
{"user_id": "108687380879334883910", "name": "alarmrat", "time": 1598457472645, "rating": 5.0, "text": "Always helpful and quick. Good location", "pics": null, "resp": null, "gmap_id": "0x889a4c55763c9039:0x55e6629e6ef77784"}
{"user_id": "112463510705062002436", "name": "Jimmy Moore", "time": 1515532436924, "rating": 5.0, "text": "Always a pleasure doing business here.  The staff are very personable and friendly.  They are our vendor of choice for most of the materials we need.", "pics": null, "resp": null, "gmap_id": "0x889a4c55763c9039:0x55e6629e6ef77784"}
{"user_id": "114415659727939822690", "name": "Christen Henry", "time": 1606581050983, "rating": 5.0, "text": "Happy to help anytime I can.", "pics": null, "resp": {"time": 1606580352311, "text": "Thanks Chris! Thanks for all of your help over the years."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "103476431782733421308", "name": "Steven Antselevich", "time": 1598535119714, "rating": 5.0, "text": "Great and easy company to deal with. Wide variety of all things technology.", "pics": null, "resp": {"time": 1606580287572, "text": "Thanks Steven! We love partnering with you. Let us know if you need anything."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "116401516662615409053", "name": "MV SS", "time": 1521991299698, "rating": 5.0, "text": "Holt Audio and Visual is well known to me personally. I worked in the legal field in Birmingham for over 42 years as a legal secretary, legal assistant and paralegal and first learned of Holt AV's services while on the job. However, over the years, I have personally used their services on a number of occasions to obtain duplicates of and share videos and recordings that were taken on vacation and during get togethers with family and friends. One tape in particular was very old, but the staff at Holt AV did an extraordinarily important job for me in duplicating a recorded conversation with my mom made many, many years before her death. I felt they took great interest in and were attentive in doing an excellent job in delivering something that has become very precious and invaluable to me and my family. Thanks, Holt AV - wishing you well for another 60 years and beyond!", "pics": null, "resp": {"time": 1522071411392, "text": "Thanks for the kind words! Hope we can be of help in the future!"}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "101980969016605177617", "name": "Marshall Mooney", "time": 1527514496364, "rating": 5.0, "text": "Customer service at it's finest. They go out of their way to make sure you have what you need when you need it.", "pics": null, "resp": {"time": 1527599902330, "text": "Thanks for your comment! We love making our customers look their best."}, "gmap_id": "0x88891bb74c1a9ca5:0xd3ec3db5f683b55a"}
{"user_id": "106976235484255126218", "name": "Keith Byram", "time": 1470410567960, "rating": 5.0, "text": "They are great with service and prices and are just great honest people.", "pics": null, "resp": null, "gmap_id": "0x888906b3bd830c87:0xb44949d97845c4e5"}
{"user_id": "103419430664304935450", "name": "Rus Hardy", "time": 1533695582045, "rating": 5.0, "text": "Absolutely great people.", "pics": null, "resp": null, "gmap_id": "0x888906b3bd830c87:0xb44949d97845c4e5"}
{"user_id": "117026204638973993809", "name": "Wes Blankenship", "time": 1592011213773, "rating": 5.0, "text": "An excellent experience! They installed 4 in-ceiling speakers and 2 in-wall speakers for my man cave and I could not be happier. My wife thinks it looks great, too!\n\nThey listened and worked with me through the entire installation, making sure things were exactly like I wanted. I never felt rushed or pressured to make a decision.\n\nYou know the phrase, \"Measure twice, cut once\"? Well these guys measure 200 times, cut once! It simply looks great down here, I'm so very happy with their work.\n\nI'm telling you guys, these folks know what they are doing for home AV installations. Thanks again to Gary and Tommy for working with me!", "pics": null, "resp": {"time": 1592346095183, "text": "We’re so glad you had such a great experience! Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "112244653145518416180", "name": "Nina Gay Chambers", "time": 1591128933955, "rating": 5.0, "text": "Can't begin to give enough thanks to Chad and his team for always being quick to respond, have the right answers and quickly solve whatever technology or  wiring project we've gotten stuck in and/or just plain over our heads.  They are always quick to come to the rescue and teach us something new in the midst of it all. As a small business owner, John and I thank you for being our IT safety net!", "pics": null, "resp": {"time": 1591132997693, "text": "Thank you for your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "106773404712272047324", "name": "Travis Bender", "time": 1587237663263, "rating": 5.0, "text": "I've used Reliant Media for a variety of audio and visual jobs at Oak Mountain High School.  Some of the things they've recently done for us include:\n\n1) Installing new LED lighting in our Performing Arts Center\n2) Installing a new sound system in our band room and at our band practice field\n3) Installing a new projector and screen (10' x 16') in our band room.\n\nChad and his crew at Reliant Media helped us develop a game plan to ensure our students would have the right equipment they need to be successful, delivered very competitive pricing, completed the work promptly, and followed up with us after installation to check that all electronics worked as needed.  I highly recommend this team of professionals.", "pics": null, "resp": {"time": 1591133155505, "text": "Thank you for your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "104740547417403318147", "name": "Amy Strickland", "time": 1591130114641, "rating": 5.0, "text": "Chad is our hero. He does all the lights for OMHS and we're going to go to him for sound equipment too. He worked out the best solution for our unique space and priced it in a variety of ways. Install was fast. Our new lights are gorgeous and we have five new working mics too!", "pics": null, "resp": {"time": 1591133134873, "text": "Thank you so much! We appreciate you too!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "107611865409291109988", "name": "Chad Yeilding", "time": 1591630734020, "rating": 5.0, "text": "Chad and Gary were very responsive to the needs of my business. They were respectful of our time and made sure that we didn't need to be shut down during business hours. Highly recommend the team at Reliant.", "pics": null, "resp": {"time": 1591719753174, "text": "We appreciate your business and kinds words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "103930415208278267461", "name": "Glyna Humm", "time": 1591977362761, "rating": 5.0, "text": "Shout out to Gary and Reliant Media.  Gary is never too busy to take my call and has done great work setting up our WiFi.  He is very responsive and I wouldn't hesitate recommending him.", "pics": null, "resp": {"time": 1591995986936, "text": "We appreciate your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "103595333567905764884", "name": "Greg Martin", "time": 1575677707906, "rating": 5.0, "text": "Chad at Reliant Media was fantastic!  He and his team really took the time to carefully troubleshoot several network issues in our home we just\nmoved into, and they patiently tackled every issue at a fair price.  I highly really recommend!", "pics": null, "resp": {"time": 1575681557164, "text": "We appreciate your kind words. It was a pleasure working with you as well!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "107913499802684692020", "name": "Lavon Chaney", "time": 1560954631521, "rating": 5.0, "text": "The guys at Reliant Media are a godsend!  They helped a co-worker set up digital TV so she can ditch cable (even found her a great tv!). They found the perfect laptop for my son entering college, and made sure it met all the requirements necessary for his degree, set it up, and delivered it to me!  They are very fair in their pricing and dependable!  Can't say enough good things.", "pics": null, "resp": {"time": 1560997242670, "text": "We appreciate your kind feedback and business! Thanks again!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "111776540060656452230", "name": "Mark Branson", "time": 1555771549691, "rating": 5.0, "text": "Recently set up our virtual phone system. The experience was great. The staff is knowledgeable and professional as well as responsive. I would highly recommend Reliant Media to anyone in need of technology solutions.", "pics": null, "resp": {"time": 1555848872737, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "109070737398365845116", "name": "Lindsay Dyess", "time": 1534866065434, "rating": 5.0, "text": "I recently purchased a laptop through Reliant Media and I was very happy with my experience. Chad was very helpful and knowledgeable about helping me choose the computer that worked best for me and my budget. This care and attention to detail is not something you would find at any retail store. I will definitely be returning to Reliant Media for future business!", "pics": null, "resp": {"time": 1534867226902, "text": "We appreciate your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "115144033275796516857", "name": "Jeremy Galloway", "time": 1535123483704, "rating": 5.0, "text": "Chad did a great job getting my email system migrated over to Office 365. Was able to do it in 24 hrs. I was haven't issues with emails going to spam/not being received but not any longer!!! Thanks again Chad.", "pics": null, "resp": {"time": 1535124485868, "text": "Thanks for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "103298949738277945268", "name": "Gary", "time": 1536163682447, "rating": 5.0, "text": "Great Installation and Experience. Had three TVs hung. They all work great, and look great. Would highly recommend! Will add pictures later.", "pics": null, "resp": {"time": 1536164332749, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "110301962572750344031", "name": "Richard Brock", "time": 1545165888062, "rating": 5.0, "text": "Chad did a great job.  He solved all of my issues and explained things in a clear manner.  He is a great teacher in addition to his skills in technology.", "pics": null, "resp": {"time": 1545280551597, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "115721635837570665186", "name": "Rick Rogers", "time": 1591626143889, "rating": 5.0, "text": "Chad, Tommy and the entire staff of Reliant are outstanding!", "pics": null, "resp": {"time": 1591630179971, "text": "We appreciate your business and kind words!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "109172859414256049719", "name": "Ben Birdsong", "time": 1534904908409, "rating": 5.0, "text": "Reliant Media is a great company that can help you support your current technology while also advising, installing, and helping to plan new technological endeavors. I would highly recommend Reliant Media for your technological needs.", "pics": null, "resp": {"time": 1534906209520, "text": "We appreciate your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "106250846895262957979", "name": "Mark Ebert", "time": 1551560487596, "rating": 5.0, "text": "Just upgraded the audio for our church. Professional and extremely knowledgeable staff.", "pics": null, "resp": {"time": 1551564989299, "text": "Thank you for your kind review. It was a pleasure working with you and the team!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "104107903951416195713", "name": "Kerry Rush", "time": 1536349219595, "rating": 5.0, "text": "RM was just that . . . reliant!  Service was thorough, installation went smoothly, and training was offered for new equipment!", "pics": null, "resp": {"time": 1536349887133, "text": "Thank you for your business and positive review!"}, "gmap_id": "0x8889161478df31bb:0x526bcae37d0a1a1f"}
{"user_id": "102738409962281427621", "name": "Jacob Mcnair", "time": 1509077742274, "rating": 5.0, "text": "(Translated by Google) Me\n\n(Original)\nYo", "pics": null, "resp": null, "gmap_id": "0x88890c6ea7886b37:0x28e6a2f8c840462a"}
{"user_id": "105278300824478460759", "name": "Justin Myers", "time": 1623772711378, "rating": 5.0, "text": "Top notch group!  These guys ran stage production for a festival I played in GA and were complete professionals with great attitudes and gear!  They know how to run their equipment to provide the best visual (stage lighting) and audio that they could.   Will definitely use these guys for anything and everything in our future!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPcPDka2ELuZyI5IofRzrKIz8ES78B-KmDs34mp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPwH2DyLyjtT2HSLrTJk9P8TCOrHg-OhPOrU9gG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnNrOKl7hvFTAn7mX1xFiEpDQtWHib94u968q1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "103081399806302444198", "name": "Laura Walker", "time": 1603643455460, "rating": 5.0, "text": "I can always count on Josh Wagner and his crew from Chattanooga Pro Audio to get it right! Very professional group with the right equipment they need and it always sound superb! Easy sound checks and friendly staff. He is my go-to guy for good sound.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "109583734227502781374", "name": "MacGregor Wallis", "time": 1604609210496, "rating": 5.0, "text": "Chattanooga Pro Audio is the company to call when you need a professional audio visual setup! Josh Wager, the owner, went out of his way to visit our venue to ensure everything would be perfect. His talented technicians Gaby and Chandler, aka CC, were both very knowledgeable and fun to work with. Chattanooga Pro Audio did a great job, and I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "115927129266010112121", "name": "skylar gratz", "time": 1623797269046, "rating": 5.0, "text": "10/10 would play my loud af bass rig through these guys again", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "103340744286452053506", "name": "zack lewis", "time": 1600996972545, "rating": 5.0, "text": "Josh and the people at Chattanooga Pro Audio are exactly what the name says \"Pro Audio\". Extremely professional and respectful. We have used them several times at our church and everytime they go well beyond our expectations. No doubt about it we will be using them in the future and I will absolutely refer them to anyone I meet. Top quality product with top quality service.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "112852602288413224648", "name": "Taylor Locklear", "time": 1609695601023, "rating": 5.0, "text": "Super nice guys Josh and his crew took extremely good care of us and had professional gear! Easy to work with and will be working with them in the future!", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "107288416897262854802", "name": "Ross Rogers", "time": 1601102306762, "rating": 5.0, "text": "Josh and his crew take care of all or music events production large and small.  The detail is unbelievable no matter the size of the event.  His sound and lighting equipment is state of the art and  makes our venue look like somewhere you would see in a larger city.   Thanks for all you do for Crescent City Tavern in Dalton Georgia", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "102205230730346092693", "name": "Eddie Buchanan", "time": 1601123371720, "rating": 5.0, "text": "The team at CPA was great to work with! Quick an easy advance, and high quality production on day of show. The engineers were all pro and all of the techs were great to work with.  Looking forward to working with them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "108310034392127724358", "name": "Logan Kenzie", "time": 1581966392841, "rating": 5.0, "text": "Love using Chatt Pro Audio for bigger events! Josh always goes above and beyond to put on a killer show and thanks to him I'm able to just focus on being the entertainer. I would highly recommend his company for anyone looking to put on a larger concert or public event!", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "102588489549099188616", "name": "Kenneth Toomey", "time": 1600921086357, "rating": 5.0, "text": "Have used them hundreds of times.\nTop notch.", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "116168465113037544823", "name": "Scenic Event Solutions", "time": 1581965335320, "rating": 5.0, "text": "Josh and his team always go above and beyond when we hire them to accommodate our larger events. I would recommend them for any event!", "pics": null, "resp": null, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
{"user_id": "102738451232380113201", "name": "Tyler Hornberger", "time": 1529790096752, "rating": 2.0, "text": "At Hutton and Smith and not sure if the band is good because the mix is very bad. Can't hear vocals at all and the lows and highs seem very pronounced. This is my first time hearing them doing sound but not happy with it.", "pics": null, "resp": {"time": 1571689598056, "text": "Tyler thanks for the review. We havent done an event at Hutton and Smith. We do rent gear to other companies in town! Our engineers do freelance with other companies. Sometimes the bands will bring their own engineer and dont have time to tune a rig before they start the gig"}, "gmap_id": "0x8860663ae51502b7:0x6dd351b5ed3b34"}
