{"user_id": "104144904953318885583", "name": "Marie Lindsey", "time": 1614788587446, "rating": 5.0, "text": "I seen an ad on Facebook and had a cracked windshield, they came out and replaced it and fixed a chip in my truck windshield . Done within an hour, very good, professional service!", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "101896731744235222161", "name": "Kattie Jones", "time": 1616282390736, "rating": 5.0, "text": "Excellent service. Justin is professional and comes to you.", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "105276090315423167638", "name": "Connie Sparman", "time": 1610385544498, "rating": 4.0, "text": "He had to drill on my windshield because the chip didn't go deep enough in the glass. Still have a place on my windshield I'm guessing from the drill.", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "116715934273343722702", "name": "Bess Ryan", "time": 1593832397868, "rating": 5.0, "text": "If you are looking, look no further! I have been impressed from the start. Quick to respond every time I contacted them, best quote, professional, excellent customer service and great work! Will use in the future! Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "106641015170826766950", "name": "Tim Martin", "time": 1618345687508, "rating": 5.0, "text": "On time and very perfect", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "110105275532085592739", "name": "Catfish 5235", "time": 1617422658184, "rating": 5.0, "text": "Very professional and excellent service", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "104399660054136382697", "name": "Teresa Bartlett", "time": 1592827108188, "rating": 5.0, "text": "They are the best , they are honest and good and go  out of there way to help you. Always on time and has years of experience.", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "114335518950943280195", "name": "Andy Simon", "time": 1562793066951, "rating": 5.0, "text": "They make it look so easy! I'm not afraid to fix my car, rebuild the engine etc. but fixed glass...I won't touch it, let the professionals deal with it. Justin did a great job on my 98 Chevy Metro. Thank you !", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "108289058724932377796", "name": "Mike Berry", "time": 1566153198168, "rating": 5.0, "text": "Best auto glass company in Alabama! Great service at a great price!!", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "104684519029308240671", "name": "Sherry Lewis", "time": 1522229365352, "rating": 5.0, "text": "Cullman Auto Glass is very professional and friendly. I deliver mail and had hail damage. Justin met me on my mail route and replaced my windshield, I was back to work in about thirty minutes and have had no problems. I am impressed with his work and highly recommend him. Thank you Justin.", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "100019898088999595872", "name": "Steven Brewster", "time": 1495052076691, "rating": 5.0, "text": "I called around and everyone wanted too much for my windshield to be fixed. I call Justin. He was very polite and professional. I will recommend him to everyone I know.", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "105848957130235429176", "name": "Tyron Duncan", "time": 1572131582593, "rating": 5.0, "text": "Honest, sincere, Quality work, and on Time,..good Job", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "115173396058654644993", "name": "C K", "time": 1523472332134, "rating": 1.0, "text": "Had hail damage  and had my back glass replaced and it was put in so in even there are half inch gaps on one side it looks a mess good prices but don't matter  how good price is ifni got to pay someone else to fix it because they won't would not recommend them to anyone since they couldn't fix their mistake because of them now can't open my truck up we're it can be used anymore", "pics": null, "resp": null, "gmap_id": "0x8889ca7930885f7d:0x9c3f6b687e8a3e37"}
{"user_id": "101643199740396993547", "name": "Matt", "time": 1610906634523, "rating": 5.0, "text": "One of the best window tinting businesses in the Tri state area.  Accurate computer cut tinting process ensures the best installation quality.   I have been here for several of my cars.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "101695037577950491764", "name": "Matt Simmons", "time": 1616892259047, "rating": 1.0, "text": "I used to think my brother was someone he's never been - Honest.  Unfortunately you can't trust this business anymore.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115339510481422696119", "name": "russell Duale", "time": 1594691542036, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!!!!! Dropped my car off at 0945 to have the windows tinted. Owner said he would call me as soon as he is wrapping things up so that I can pick my car up. 5 hours later, I still have not received a call from the owner. I decided to drive to the shop and check on the progress. When I arrived to the shop, I found that my car had not even been started!! Not only had it not been started, they left 40K car unlocked with the key in it with the shop locked up and not one employee to be found!! Again, DO NOT USE THIS SHOP FOR YOUR WINDOW TINT!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "118339289745771133231", "name": "Christian Colbert", "time": 1590256831290, "rating": 1.0, "text": "They have tinted a truck of mine in the past, it’s way over priced. Went there today to get one roll up door done and they told me to meet them at 1 and I get there at 1 and they tell me they can’t work on it. Drove 30 minutes. They looked high and weren’t even working. Talking the whole time I was there. Don’t use these guys", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "116041252602879384764", "name": "Dakota Pryor", "time": 1590515790586, "rating": 1.0, "text": "First off, we live an hour away from Dothan. We were told to be there at 10am...but we got there early. We were told it would take 3-4 hours so I had someone follow us so we could drive around to spare the time. After 4 hours we went back to find out that he had not even started on it and was working on someone else's vehicle! We got our keys and left! Poor customer service!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "102376549027580655088", "name": "Eddy Palmer", "time": 1601810303290, "rating": 5.0, "text": "Quality tint. Expert installation.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "109935396516695633514", "name": "Barbara Coleman", "time": 1596662105330, "rating": 1.0, "text": "I took my son car to this shop on a Wednesday and didn’t get his car back until that following Tuesday and this was because I had to call the police on him . He did finish the tint but he wouldn’t answer calls . Not only that , he drove the car for personal use . Don’t use this place for tint.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "110089465949486875297", "name": "Kenneth Muna", "time": 1580067808805, "rating": 1.0, "text": "Terrible way to do business.  I have a lifetime warranty for my tint and I cant get ahold of anyone to get my tint fixed.  I called a ton of times and stopped by the shop several times only for no one to answer the door during business hours.  One time I saw Robbie the owner at the door and when I went up to the front door.....no answer again.  STAY AWAY FROM THIS SHOP.  THEY WILL RIP YOU OFF!!!!!  I'm taking my business elsewhere!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "101389037124065354806", "name": "Jeffery Kelly", "time": 1557438182625, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!!!!!!!! Every 5 star feedback they have is paid reviews. They will drive you car home and use it for there own leisure. The Owner is a CONVICTED FELON. DO NOT DO IT!!! You might get lucky, or most likely you will lose your car and have to file police reports with hope you can find it. I have a very close friend that is in the same position. This company should be SHUT DOWN!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111077649273453655352", "name": "Kenneth Malone", "time": 1593382496042, "rating": 4.0, "text": "Has tinted all my cars professionally", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "109129261582157062941", "name": "Dan Kamilchu", "time": 1469064613382, "rating": 5.0, "text": "I love these guys! They do an outstanding job for a very reasonable price and they've been in the business for quite some time! Friendly, courteous, professional, and a quality job! Highly recommended especially for tinting your windows(which was my case). Keep up the great job, Rob & the crew!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "114022046239114605122", "name": "Natalie Joiner", "time": 1471665046706, "rating": 5.0, "text": "My boyfriend called last minute to make an appointment and they were happy to fit me in do a tint job. The guy that drove my car in went out of his way to make sure I was aware of a problem with my car, which I thought was very nice. The guy at the desk was helpful with explaining the different tint types and with helping me make a decision on what I wanted. The job was great. The tint lined up with no bubbles. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "113842211522444070317", "name": "The Dude", "time": 1490128093009, "rating": 5.0, "text": "I was very impressed with the quality of work and craftsmanship that came with the tint job. They have been in the tint business for a long time and it shows. Where else can you get a lifetime guarantee on not just the tint itself, but the installation of the window tint as well. All of that with the offer of quality tint from 3M at a cheap and competitive price.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "101830232312898193766", "name": "Bold Expression", "time": 1518215246025, "rating": 1.0, "text": "Told me the job would take 3 hrs but instead it had taken the entire day. Should’ve have stated on the phone that it may be a full day because I could’ve found someone else. NOT FAIR! If you tell a customer a certain time frame, stick to it or explain it may take longer! No recommendation from ever nor will I return.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "117171774785871459681", "name": "Jack Emerald", "time": 1503020562622, "rating": 1.0, "text": "Could a window tint outfit be more unprofessional or disappointing? I submit to you that Tint Spectrum holds the record for both accounts. They completely screwed up my Z71. The manager tried to sell me illegal tint, bragging that she had 20% on her car and nobody would ever ticket her, because she put tint on all the city police cars and it was illegal also. Yeah, that's what you want to here about local law enforcement. She was generally unpleasant and unprofessional. She shouted at her staff and fussed the entire time. The staff, by the way, were dirty and seemed incompetent. They left bubbles in my tint and blamed it on \"water residue\". Two weeks later, it's still here. Don't use these people. They are one step above crooks.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "116054935913000033643", "name": "Matthew Clawson", "time": 1358790825838, "rating": 5.0, "text": "They took me in on short notice, and did an excellent job on my car even staying to finish it after closing.  The car looks great!  I appreciate the attention to detail.  I recommend them for any tint work you need to have performed.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "117668097740456245190", "name": "Stacy 22", "time": 1593751192583, "rating": 1.0, "text": "Y’all Need Be Shut down the city will Very soon!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "109757611253494853451", "name": "Caleb Cross", "time": 1503021082264, "rating": 1.0, "text": "Paid over $200 for a really crappy tint job. Tint has streaks and bubbles. In addition, there is overspray from the solution they used to apply the tint all over the interior of my Accord, in addition to streaks of it running down the doors. They literally sprayed what looked like gallons of this crap on my windows and let it run down through the interior of the door onto the ground. Is that not going to screw up my electrical?\n\nMeanwhile, the woman who was telling everybody what to do was nothing short of a witch. She kept shouting at people, cursing, and was very rude to me. One of the tint guys was making fun of the rims on my car while another kept spitting tobacco juice on the ground all around it. Then the owner lit up a cigarette and went to work on my window, blowing smoke all in my interior.\n\nWhy should I pay for this??? Incompetent staff, rude management, and an overall really bad experience. Don't waste your time. There are plenty of good tint shops in town without fooling with these people.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "106555191032613373324", "name": "Whitney Walker", "time": 1513379639879, "rating": 1.0, "text": "If I could score lower than 1 star, I would. For starters, my boyfriend dropped my car off on a Monday Morning with the promise that the turn around would be no more than 24 hours. As the days pass, he called for an update. After having several phone calls ignored, he finally went up there on Wednesday. The owner had a million excuses as to why the car wasn't complete, while he's sitting outside smoking a cigarette (doing nothing). He then told my boyfriend that he swears it will be done by 5pm the following day. My boyfriend went to get the car at 4:45 and it STILL was not complete, there was 1 window without tint. Of course, my boyfriend is upset and when he expressed his disappointment,  the owner cursed him out like it was his fault. Friday rolls around, it's after lunch and my car is STILL NOT FINISHED😠😠!!  MIND YOU, MY CAR HAS BEEN AT HIS SHOP SINCE MONDAY!!! DO NOT DO BUSINESS WITH THESE PEOPLE. If you pay with credit card they'll ask for a \"Cash Deposit\" 🤔🤔 I will never refer anyone to them or do business with them EVERRRRR again", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "104154592496680182787", "name": "Tawney Williams", "time": 1535060177745, "rating": 1.0, "text": "Do not use this company! Poor communication between the owner and his employees and them and us should have been my first red flag. The initial estimate almost doubled by the time the job started. Trash and debris left all over my yard every day. Shawty final work that was never inspected by said owner. Finally the work was finished and I had to have them come back out at threat of lawsuit to correct mistakes. Do not use this company!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "108908816820367216409", "name": "Eli K", "time": 1503019736322, "rating": 1.0, "text": "This was absolutely the worst experience I've ever had with any car related shop. From the start, I was uneasy about the experience, but I went ahead with it. Huge mistake. I drove by today and a woman who said she was the owner's friend and acting manager waited on me. I asked her to inspect my car to put tint on the driver and passenger windows only. She inspected them and we agreed on a tint grade and a price. Then I walked down the street to the library to wait. About an hour later I decided to head back, and got a call from the manager on my way. She was agitated, and demanded to know if the car had ever had tint on it before. I replied that it may have, I bought it used. She said that they had already started applying tint to one window when they discovered that there was residue from old tint below the window sill. When I got back to the shop, the manager was in a frenzy. She pointed out the residue, and kept going on about how they had \"wasted $50 worth of tint\". I remained calm and asked them to finish the job. She said they would have to charge me $10 per window extra as a cleanup fee. I refused, saying it was their mistake and they should have inspected the windows more closely before starting (they are the experts, after all). She became very upset and began to shout, again blaming it on me for not telling her about the residue (which, again, was below the windowsill line and not visible). I stood my ground and insisted that it's not my job to know everything, that's why I brought it to a professional. She blew up, began to curse, shout, and refused to look at me in the eye. She shouted at the tint specialist to reassemble my car and send me away. I knew it would cost me even more at another tint shop to have them clean up the messed up tint that was already on my window from Tint Spectrum, so I reluctantly asked the tint specialist what it would take to get the job done right and get be out. He said it would take another $20, so I agreed to pay it. This time, I sat down in the shop and watched them the entire time. I'm not a tint expert by any means, but in my humble opinion, neither are these guys. One of them (who I later found out was the owner) was eating pizza over the hood of my car and asking me whether it was pink or red (it's obviously red). The tint specialist who was working on my car had to rip the tint from the passenger's window, replace it, install tint on the driver's side, rip it off and replace it, and then replace the tint on the passenger's side AGAIN. I'm not sure what he kept messing up, but if each one of those sheets was $50 worth of tint, he easily wasted over $200 worth. The manager continued to stomp around the shop shouting and cursing. The owner didn't seem to care. The tint specialist left lart \"3M\" logos on my window's right in the middle. The manager asked me if I wanted those removed (who in the world would WANT 3M logos in the middle of their window?).\n\nWhen it was all said and done, my final bill was $140 before tax, which was $20 higher than agreed upon earlier that morning due to absolutely no fault of my own. The manager remained rude and loud the entire time, and I must have waited in the shop for well over an hour after I got back from the library. The manager offered no apology other than something about \"didn't mean to snap earlier\". I don't think there is anything in the world that could make me go back to this place or recommend it. The manager is rude, loud, inappropriate and unfair. The staff are very slow, appear to be outrageously incompetent, and are all dirty on top of that (the tint specialist kept spitting tobacco juice on the ground right behind my car). The owner didn't seem to care about anything. I think the quality of the tint is good, since it's 3M. But the service and the installation quality were absolutely not even worth the one star I am forced to grant them. Do not take your car to this place. You will regret it, especially if you have to deal with the manager.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "110134234607469416856", "name": "Robert Tatum", "time": 1516754563899, "rating": 5.0, "text": "Been going here for 20 years. Great products. Great service. Great prices.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115385248520901550693", "name": "Summer Knight", "time": 1545974637960, "rating": 1.0, "text": "Paid $300 cash, not check... and did not give me a reciept and would not fix problem with bubble in window tint and he scratched my car paint. Ripp off.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "107931430801316090486", "name": "Andrew Blood", "time": 1441043991810, "rating": 5.0, "text": "They are awesome. I didn't even call but when I showed up they gladly accepted my business and tinted my tail lights, and installed aftermarket headlights quickly and for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "114498044929809347664", "name": "Gerald Lucier", "time": 1455560016007, "rating": 5.0, "text": "Friendly and professional staff.  They were able to fit me in on short notice.  Highly recommend them for your window tinting needs!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "114185460659871143299", "name": "Melvin M. Thomas", "time": 1508428057940, "rating": 5.0, "text": "Excellent Customer Service; very flexible, worked great with my scheduling issues; Immaculate finished product, I’m Very Happy With My Car!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "112919036910363407512", "name": "Jemar Ford", "time": 1527962831772, "rating": 1.0, "text": "Do not go to this place. I had a 10 o’clock Saturday morning appointment, the tint guy never showed up. One of his workers was waiting for me when I showed up.  We talked for about 45 to an hour with hopes of this guy showing up. He kept saying that he’s on his way. Unfortunately this never happened. I don’t know how he stays in business.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "104294159030050619218", "name": "Jeff Hebderson", "time": 1527495783657, "rating": 5.0, "text": "Best place in all of Southern Alabama to get your windows tinted", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "100006500809345862159", "name": "jeff love", "time": 1502928606335, "rating": 1.0, "text": "Paid $320 for a horrible tint job.  Windshield strip had a bubble in it from a hair under the tint.  Both small back seat windows have foreign material under tint. Back window has a few small bubbles.  Inside Passenger side door and both back seat door panels were NOT wiped down after installation.  Had shoe prints on back seat. Took it back up to have it fixed and Robby said he would fix the issues, just come back sometime.  I'm thinking I'm here now, fix it now", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "117315838463473668918", "name": "Jeremy Hopper", "time": 1510111641281, "rating": 5.0, "text": "Great guy and better service! Will be going back for all of my future work.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111497192859358093637", "name": "Scotty Chang", "time": 1494262936220, "rating": 5.0, "text": "Awesome service! Great work!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115342551679620052856", "name": "Joe F. Watson", "time": 1523054202549, "rating": 1.0, "text": "No. Overpriced and less than honest.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "110871723164996822807", "name": "My Bell", "time": 1546023517741, "rating": 1.0, "text": "He kept saying that he will get back in touch with me and never did.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111000426054975340541", "name": "Justin Schroeder", "time": 1519508352188, "rating": 5.0, "text": "Spot on work, always!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115221459250961340591", "name": "Jennifer Touchton-Dickens", "time": 1518718301879, "rating": 1.0, "text": "I spent 7 hours here to tint my 2015 Dodge Challenger with legal tint... When I left my car still has a few bubbles in it.... Needless to say, even though I have a lifetime warranty, and I will be returning to get the Tint fixed, I will NOT BE USING THEM AGAIN FOR ANY FUTURE VEHICLES..... AND I'M NOT A HAPPY CAMPER NEITHER", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "106038580733658193411", "name": "Muntileta Dalton", "time": 1491243099976, "rating": 5.0, "text": "Wonderful place", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111712087427934480512", "name": "Matthew Turney", "time": 1623424392371, "rating": 5.0, "text": "Called at eight on a Friday morning and before 9:30 they had my wife’s windshield repaired and was on their way couldn’t ask for anything better", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "109899946380210449337", "name": "Terry Gamble", "time": 1596591103198, "rating": 5.0, "text": "Fast service.  Great price.", "pics": null, "resp": {"time": 1596633642342, "text": "Thank you Mr Gamble for taking the time to let us know you are a satisfied customer.  We truly appreciate you."}, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "112554393469735780710", "name": "Anna Thornton", "time": 1589914508972, "rating": 5.0, "text": "I’ve got a 2017 Kia Soul and Tony Bethune came out and replaced my windshield last month. Needless to say the weather strip came off  and what not. I phoned them Monday 18th and Sherry contacted Tony and he was out here Tuesday afternoon. Tony took care for the rubber part and wiped off any Debry from the weather strip coming off. It was professional done right and timely.\nWanted to give Tony a shoutout for his awesome 😎 job.", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "116362005847779833222", "name": "Shane Pitts", "time": 1585155588659, "rating": 5.0, "text": "We have a 2019 Hyundia elentra limited edition and the front windshield accidentally got cracked we called here and they was able to come to our home and put a new windshield in at no extra charge Noah the Technician was excellent me and my wife are very pleased and highly recommend thank you", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "102795102805367667847", "name": "Audrey Turner", "time": 1593218872763, "rating": 5.0, "text": "Excellent friendly service. On time appointments.", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "115090697893009109586", "name": "Alan Farwell", "time": 1543881592798, "rating": 5.0, "text": "Tony did an AWESOME JOB repairing our rear window. Came to our house to complete the repair.  Very professional, friendly,  and helpful.   I'd give him more than 5 stars but that's all the app will allow.", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "111647378189034502416", "name": "Peggy Payne", "time": 1552424286002, "rating": 5.0, "text": "Everything about them is excellent. Great prices, friendly office staff, efficient and courteous technician. Glass was quality. Mobile unit. Paid half of what I would've with Safelite.", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "115236872634495220783", "name": "Emmitt Goode", "time": 1584022018285, "rating": 5.0, "text": "Great place and Price", "pics": null, "resp": null, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
{"user_id": "111354531525587056362", "name": "Dustin Thompson", "time": 1469820709493, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1470087647111, "text": "Thank you, Mr. Thompson for taking the time to review our business.  It was a pleasure serving you."}, "gmap_id": "0x8889cb457b344303:0x34dfd66372ffe6dd"}
