{"user_id": "100286850605594080310", "name": "J R", "time": 1629843845033, "rating": 1.0, "text": "Took my truck here in Oct of 2020 and they forgot to reconnect the sway bar up front, which I fixed. Then gave them a second chance with my wife's car and just discovered they only replaced 3 of the 5 lug bolts on one wheel. Now I have to buy new lug bolts. Go somewhere else if you want the job done correctly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9LuNZOrpT4SuR4JG1yucJiecs1V56qcnP1l8V=w150-h150-k-no-p"]}], "resp": {"time": 1629906249166, "text": "Our apologies that we did not meet your expectations, not what we want to have happen! I see that we have already opened a customer service ticket, we will be back in touch soon!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "110033407461781255323", "name": "Amanda", "time": 1630204370739, "rating": 5.0, "text": "As a woman I can say that I have never had a good experience in places when getting my car serviced.  I am spoken down to, given hidden charges, and just treated with general disrespect.\nBut this was absolutely not the case coming here. Ricky was incredibly nice and spoke to me like an actual human being. I told him what I needed and what time I needed it done. Not only was it done in the exact time I needed, he called to verify what we discussed and verify the price. He did not try to sell my anything unnecessary. And the price wasn't a penny over what he told me. It was an amazing experience and it will be the only place I get my car serviced for the foreseeable future. Thank you for your respect and impeccable service.", "pics": null, "resp": {"time": 1630271658310, "text": "Thanks for the stars, Amanda! Glad the team was able to take such great care of you. Take care!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "106866213107399341466", "name": "Kevin Stephens", "time": 1626707236146, "rating": 5.0, "text": "This review is more for an employee than the store itself. Not to take away from the store, though, the store is great. Tire Tech, Ricky, deserves a large amount of praise. That gentleman works his behind off. Every time I’m in the store, he’s there. Working hard. He’s got a fantastic attitude and a general willingness to help. If someone from Tire Discounters sees this, give that man a raise.", "pics": null, "resp": {"time": 1627740271657, "text": "Awww, thank you for the 5-star review and the kind comments Ricky. We are so glad you had a great experience Kevin, we do what we do for customers just like you. Please come back and see us again when you need us and stay safe out there!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "109401059024912801808", "name": "Claire Tomlin", "time": 1628730043033, "rating": 5.0, "text": "Fantastic service! They helped me with my tire issue and Ima go back to them for all my tire needs!\n\nPros: Honest and down to earth; easy to talk to!\n\nCons: a bit standoffish at first but it may have been the weather (Torrential downpour)", "pics": null, "resp": {"time": 1629136557693, "text": "That’s how we rock so you can roll Claire! Thank you for the feedback and 5-star review! We work hard to provide you with a great experience. Please come back to see us again when you need us. Stay safe out there!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "100078864384107565749", "name": "William Swinson", "time": 1626394769667, "rating": 5.0, "text": "Joseph the manager and his staff have been phenomenal. Great prices and the service is simply outstanding. He and his team helped me solve a major problem that 2020+ Ram 1500 have major complaints about due to tire shimmy at certain speeds. They fixed the entire problem by performing a “dynamic balancing” splitting the needed weights and road force validation. So these folks saved me from a problem that most folks can’t figure out. Truck runs smooth as silk now and these guys were a pleasure to work with. I will NEVER NEVER take my vehicles anywhere else. You guys just made me a customer for life. Just so you know, I make a living teaching organizations how to be efficient and “customer-centric” and these guys rock !!!! Thanks guys!!!!! Ed", "pics": null, "resp": {"time": 1626632769878, "text": "That’s how we roll, William! Glad we were able to take such good care of you. Thanks, and we’ll see you again down the road!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "112608320832286788717", "name": "Ryan Cass", "time": 1615859229839, "rating": 5.0, "text": "For the last 5 years I’ve been taking my Camry to NTB in Huntsville and they were fine until they started trying to up sell me on stuff I didn’t need and their prices kept going up with the staff becoming less and less friendly too. When Tire Discounters opened up on Winchester road I looked forward to trying them out since they are much closer and after having some work done on my other vehicles I knew this would be the right place to get a fresh set of tires. They had a great sale going on for Pirelli’s and they are driving great, hopefully they maintain their friendly service and good prices because this is where I’ll be going for the life of my new tires.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOehISr6_LAblvGsUFIGk9WmLgAb3dbU9zejxjn=w150-h150-k-no-p"]}], "resp": {"time": 1615890270540, "text": "We rock so you can roll! We're the authority in customer service and auto safety, Ryan. See ya in 5000 miles for your 1st of many free lifetime tire care visits. We want to take make sure we take good care of those new puppies."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "109112178506262257439", "name": "Timothy Wyant", "time": 1625501181097, "rating": 5.0, "text": "Great service.. free tire and break inspection.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNuAx3qwgNrkOX-qZ49Os7lryqs3TANck9xaYFh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP01yBWmxTkUwv4s-R6CKEFbzwHujm10eGdbC6q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPPLtrmfOk-jSVHpP4OFSPpZl_8Uh84IOvePOWz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPuKAHSsP-r-I1H11OPNjV1Yf-oDEQiinxCXoOM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnaCe03YnYqDlGC5CL8ZLkYhHKkFFqKfxTudnK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNE6dNceHiuNPjaCGo45Q141NQsJOjaH2WBvlBX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXQI-KRY8-wBKgdVhFiCTUVDiKFr-4igimFmgo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTjxSNIMggb5rHR3khaYzpA7bzIyZy-QLUWrui=w150-h150-k-no-p"]}], "resp": {"time": 1625593398476, "text": "Thank you for the stars Timothy! We appreciate you being a valued Tire Discounters customer. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "111363931034979089889", "name": "Lindsey Snipes", "time": 1619030612059, "rating": 5.0, "text": "Had a great experience with “skip the shop”! Everyone I’ve worked with has been very friendly, helpful, and professional. My SUV was well taken care of while in their hands. Best part, I got all my car needs done without leaving work!", "pics": null, "resp": {"time": 1619035562885, "text": "The Sutton Road location is da bomb! Thank you for the 5-star review, very much appreciated. We are soooo glad that you had a great experience, and glad you liked the \"skip the shop\" service! Your time is important and we appreciate you being a valued customer. Spread the word and stay safe out there!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "113518300667961976326", "name": "Regan Olivia", "time": 1622931416752, "rating": 5.0, "text": "Best Tire shop in the area!! Great customer service! They are super helpful and explain things well!!! They’re great at what they do and they do things quickly! I recommend them to everyone! :)\nThanks tire discounters :)", "pics": null, "resp": {"time": 1623024515812, "text": "Best customers! Thank you for the kind words, Regan. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "102717857917480022019", "name": "Kim George", "time": 1616799740332, "rating": 5.0, "text": "Had an emergency today that required purchasing 4 new wheels and 2 new tires. Joseph went above and beyond to help me get what I needed and my car was finished and ready to when I got off work! The entire staff was friendly! I highly recommend Tire Discounters! 5 star service!!", "pics": null, "resp": {"time": 1616803604076, "text": "That's how we roll! We are the authority in auto safety, Kim. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "102905859935213964395", "name": "Kyle Gargis", "time": 1624050553790, "rating": 5.0, "text": "Best Shop. You want your vehicle running right and customer service at 5 stars then this location is the stop. Especially if you have Rick handling you vehicles service/repair. Thanks guys.", "pics": null, "resp": {"time": 1624210479833, "text": "Rick is TOP NOTCH! Happy to have ya in the TD family, Kyle. You've got us for life."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "102897415525431993753", "name": "Terry Smith", "time": 1624553494201, "rating": 1.0, "text": "Only 1 tech there.  2 went home the day we were there. Who knows why.  We had appt to get a flat fixed and by 1230 we were ready to make earliest appt. Next day.  The woman said we should have made appt anyway.  Well we did... we told her when we walked through the door. So she looked and got pretty nervous.  They got us in ASAP ands we finally got the tire fixed.  Overall we will use our tire discounters on W72 and county line. We were out of town and Hampton Cove was thre closest. Good luck if you use them.", "pics": null, "resp": {"time": 1624707924239, "text": "Terry, our apologies that we did not meet your expectations, not what we want to have happen! We definitely care about your experience and we'd like to connect to learn more. If you would like to discuss, please send your preferred contact information to support@tirediscounters.com so we can get back in touch with you. Please include a copy of your review for reference, we hope to hear back from you soon! Thank you and stay safe!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "101050380361387095457", "name": "Madison", "time": 1626553976413, "rating": 5.0, "text": "My day started out with a flat tire on my car. I took my car here and the nice staff at tire discounters did not hesitate to fix my tire for me! 10/10 would be back again.", "pics": null, "resp": {"time": 1627740061132, "text": "That’s how we rock so you can roll Madison! Thank you for the feedback and 5-star review! We work hard to provide you with a great experience. Please come back to see us again when you need us. Stay safe out there!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "105851639005770932768", "name": "Dan Nguyen", "time": 1599341213326, "rating": 5.0, "text": "Awesome service! The staff is very  quick, attentive and professional. They patched my SUV for FREE and cleaned the wheels. We were just about to head out for a road trip so this was great. I'll definitely be coming back when those tires need to be replaced.", "pics": null, "resp": {"time": 1599405175209, "text": "Rockin' and rollin'! Glad we could keep ya rollin' safely, Dan. Hope you enjoyed your trip and we'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "101784088005562254686", "name": "Stefanie Terrell", "time": 1611356403540, "rating": 1.0, "text": "Do not take your vehicle here unless you’d like something coincidentally to happen requiring an additional repair. My husband took his vehicle here for a tire patch which resulted in him being told he needed new tires due to uneven wear. He received a quote and agreed to pursue the new tire service. During service, he was told that his alignment was extremely off; although he had taken his vehicle to the dealership for routine maintenance. They drove his vehicle to our house (courtesy drop-off) and didn’t even mention that the vehicle was making a grinding noise when accelerating and slowing down (4WD issue). Deceitful and dishonest. Their management told my husband that this was a coincidence and a known issue with the make and model of his vehicle. Then proceeded to give him a quote to repair. BUYER BEWARE", "pics": null, "resp": {"time": 1611403816258, "text": "We have strict policies in place to never oversell unnecessary items and follow MAP guidelines when making any product or service recommendations. We would like to connect you with a TD Rep to learn more and address your concerns, Stefanie. Would you mind sending your preferred contact information to tirediscounters.com/contact? We look forward to connecting."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "111701288986926385615", "name": "Seth Cole", "time": 1615334465960, "rating": 5.0, "text": "Very convenient. They picked up car and dropped it off at no expense. Staff was very courteous. We will be repeat customers.", "pics": null, "resp": {"time": 1615398826647, "text": "Skip the Shop is AWESOME, right?! So glad you were able to take advantage of that service, Seth. Take care and we'll be here anytime ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "110008337693394175371", "name": "Joseph Torchia", "time": 1598893399231, "rating": 5.0, "text": "Super service and a great value for my money! Can't bean the installation services provided by these guys, Free alignment guaranteed for 1 year included! Bought 4 tires from these guys and will going back soon for vehicle number 2.", "pics": null, "resp": {"time": 1598964354320, "text": "That's how we roll! We are in it for the long haul, Joseph. See ya in 5000 miles for your 1st of many free lifetime tire care visits. We want to take make sure we take good care of those new puppies."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "115435700772700299264", "name": "John Mott", "time": 1598308245256, "rating": 5.0, "text": "Stopped at this new location on my way home after having to change a flat tire on my wife’s SUV- they found a nail and patched it rather than trying to sell me a new tire- fantastic service. Big thanks to Joseph- I’ll be back when it’s time for service, highly recommend!", "pics": null, "resp": {"time": 1598358185569, "text": "We rock so you can roll! Glad we could get ya patched up and on your way, John. We'll see ya again when ya need us!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "105851639005770932768", "name": "Dan Nguyen", "time": 1599341213326, "rating": 5.0, "text": "Awesome service! The staff is very  quick, attentive and professional. They patched my SUV for FREE and cleaned the wheels. We were just about to head out for a road trip so this was great. I'll definitely be coming back when those tires need to be replaced.", "pics": null, "resp": {"time": 1599405175209, "text": "Rockin' and rollin'! Glad we could keep ya rollin' safely, Dan. Hope you enjoyed your trip and we'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "108958884713005611193", "name": "Clint Parker", "time": 1611805924349, "rating": 5.0, "text": "Outstanding service. Greeted with professionalism and friendly. Had plastic for the seat and floor mat. Amazing.", "pics": null, "resp": {"time": 1611847732620, "text": "We rock so you can roll. So glad to have ya in the TD family, Clint--we'll see ya again anytime ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "100745073459428585649", "name": "Clifton Roberts", "time": 1619305805113, "rating": 5.0, "text": "These guys have never let us down. They even came and got our car and brought it back for us for free.", "pics": null, "resp": {"time": 1619351625874, "text": "Skip the Shop is AWESOME, right?! So glad we could take excellent care of ya, Clifton. We'll be here anytime ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "101784088005562254686", "name": "Stefanie Terrell", "time": 1611356403540, "rating": 1.0, "text": "Do not take your vehicle here unless you’d like something coincidentally to happen requiring an additional repair. My husband took his vehicle here for a tire patch which resulted in him being told he needed new tires due to uneven wear. He received a quote and agreed to pursue the new tire service. During service, he was told that his alignment was extremely off; although he had taken his vehicle to the dealership for routine maintenance. They drove his vehicle to our house (courtesy drop-off) and didn’t even mention that the vehicle was making a grinding noise when accelerating and slowing down (4WD issue). Deceitful and dishonest. Their management told my husband that this was a coincidence and a known issue with the make and model of his vehicle. Then proceeded to give him a quote to repair. BUYER BEWARE", "pics": null, "resp": {"time": 1611403816258, "text": "We have strict policies in place to never oversell unnecessary items and follow MAP guidelines when making any product or service recommendations. We would like to connect you with a TD Rep to learn more and address your concerns, Stefanie. Would you mind sending your preferred contact information to tirediscounters.com/contact? We look forward to connecting."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "104816513728476161747", "name": "Michael Paul", "time": 1598542169059, "rating": 5.0, "text": "Drove in to have front end inspected and the employees were friendly and professional. After the inspection they told me my issues and provided a reasonable quote and explained each issue. Great experience!! Highly recommend", "pics": null, "resp": {"time": 1598623057682, "text": "That's how we roll! We do like to talk shop, Michael. We employ ASE Certified technicians to ensure quality work and keep you in the know with your vehicle. Take care and we'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "115852371445522464656", "name": "James Powers", "time": 1612023255369, "rating": 5.0, "text": "Great people and honest with their customers. I would recommend anyone to them", "pics": null, "resp": {"time": 1612458247700, "text": "Check and CHECK! We love having ya in the TD family, James. We'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "115435700772700299264", "name": "John Mott", "time": 1598308245256, "rating": 5.0, "text": "Stopped at this new location on my way home after having to change a flat tire on my wife’s SUV- they found a nail and patched it rather than trying to sell me a new tire- fantastic service. Big thanks to Joseph- I’ll be back when it’s time for service, highly recommend!", "pics": null, "resp": {"time": 1598358185569, "text": "We rock so you can roll! Glad we could get ya patched up and on your way, John. We'll see ya again when ya need us!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "113163301285838436184", "name": "Tyler Moorer", "time": 1602878983704, "rating": 5.0, "text": "Excellent service! They patched a hole from a screw for free within 15 minutes and cleaned all of my wheels. I will definitely be coming back.", "pics": null, "resp": {"time": 1602894982297, "text": "Rockin' and rollin'! Glad we could get you safely on the road, Tyler! We will see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "110008337693394175371", "name": "Joseph Torchia", "time": 1598893399231, "rating": 5.0, "text": "Super service and a great value for my money! Can't bean the installation services provided by these guys, Free alignment guaranteed for 1 year included! Bought 4 tires from these guys and will going back soon for vehicle number 2.", "pics": null, "resp": {"time": 1598964354320, "text": "That's how we roll! We are in it for the long haul, Joseph. See ya in 5000 miles for your 1st of many free lifetime tire care visits. We want to take make sure we take good care of those new puppies."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "101600748596536602886", "name": "jenia keller", "time": 1609852646544, "rating": 5.0, "text": "A great friendly place!   Great service", "pics": null, "resp": {"time": 1609959369475, "text": "High five! We are in it for the long haul, Jenia. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "108617054457728836896", "name": "Nathan Hundley", "time": 1600487761122, "rating": 5.0, "text": "Quick results. Amazing service. Knowledgeable.  This is my new go to place. You have to see for yourself!!!", "pics": null, "resp": {"time": 1600518218454, "text": "High five! We are the authority in auto safety, Nathan. Thank you!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "106996614261771421648", "name": "Lillian Brazelton", "time": 1599160554156, "rating": 5.0, "text": "I was happy to have a place close  to home to get quick service. The  people were nice. I will go back", "pics": null, "resp": {"time": 1599139741935, "text": "Woohoo! We love having you in the TD family, Lilliam. We will see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "117132973761866796501", "name": "Martha Moore", "time": 1606259658031, "rating": 5.0, "text": "Tire Discounters on Sutton Road are amazing. They fixed my tire for free and the service was friendly and quick.", "pics": null, "resp": {"time": 1606335621581, "text": "That's how we roll. Happy we could take excellent care of ya, Martha. We'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "112778714155169325813", "name": "cassandra sanders", "time": 1607391273559, "rating": 4.0, "text": "They got me in right away and were pleasant. Office was clean.", "pics": null, "resp": {"time": 1607527473795, "text": "Thanks for the stars! We’d love to know what we could’ve done to earn that last star next time, Cassandra. If you ever have any ideas or feedback, let us know at tirediscounters.com/contact. See ya again when ya need us!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "118301209825529464414", "name": "harold campbell", "time": 1599154708607, "rating": 5.0, "text": "The team did a great  job with my Mini Cooper. Good tire prices and service.", "pics": null, "resp": {"time": 1599224590116, "text": "Woohoo! That's what we like to hear, Harold. Glad we could take care of the Mini. We'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "101964251926646632548", "name": "jensen seymour", "time": 1600470017472, "rating": 5.0, "text": "there is not much to be complained about. Good service and good prices.", "pics": null, "resp": {"time": 1600517791631, "text": "Thank you for your feedback. We do like to talk shop, Jensen. We employ ASE Certified technicians to ensure quality work. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "104637694398123550491", "name": "Roba Fett", "time": 1608066868819, "rating": 5.0, "text": "Came it with a screw in the tire and the guys patched it up in 5 min. Awesome service will be back.", "pics": null, "resp": {"time": 1608142519502, "text": "Woohoo! Glad we could get ya fixed up and on your way, Roba. See ya again anytime ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "108520730372165871593", "name": "Cliff Mead", "time": 1625431556331, "rating": 5.0, "text": "Great service.", "pics": null, "resp": {"time": 1625442208454, "text": "Thanks for the stars, Cliff! Glad the team was able to take such great care of you. Take care!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "116266255439369922738", "name": "DeRonda Roberts", "time": 1601578534964, "rating": 5.0, "text": "Great service ! I had a flat and they didn’t even charge me!", "pics": null, "resp": {"time": 1601644672985, "text": "That's how we roll! Glad we could get ya fixed up and on your way, DeRonda. You've got us for life!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "114880931056876293854", "name": "Michael Bray", "time": 1598280965671, "rating": 5.0, "text": "Fast service and great employees. Definitely i nice addition to the owens cross roads area.", "pics": null, "resp": {"time": 1598357739786, "text": "We rock so you can roll! Glad we could take great care of ya, Michael. We'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "107801247871524678002", "name": "Emily Polak", "time": 1610469345203, "rating": 5.0, "text": "Kind, quick, and professional service! Will be returning!", "pics": null, "resp": {"time": 1610563997927, "text": "Check, check and CHECK! We love having you in the TD family, Emily. We'll see ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "114913542476395093722", "name": "Steve M", "time": 1598407521318, "rating": 5.0, "text": "Great customer service!  Everything was ready when promised.  Joseph and his team are A+!", "pics": null, "resp": {"time": 1598450759585, "text": "That's what we're going for every time! Take care--we'll see ya again when ya need us, Steve!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "115277592884450436148", "name": "john bell", "time": 1608761984440, "rating": 5.0, "text": "Great group. Roll tide!!", "pics": null, "resp": {"time": 1603053437794, "text": "Thank you for informing us about your experience. We are in it for the long haul, John. You've got us for life!"}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "116442298660409556647", "name": "joshua lucas", "time": 1599262405747, "rating": 5.0, "text": "Got an unexpected flat, the manager Joseph was prompt in fixing it even though I didn't have an appointment.", "pics": null, "resp": {"time": 1599830237565, "text": "We rock so you can roll! Glad we could get ya fixed up and on your way, Joshua. We'll be here when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "112181801773599500906", "name": "Tiffany Lyle", "time": 1602566789682, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": {"time": 1602855929357, "text": "We rock so you can roll and our customer service is second to none. Glad we could keep ya rollin' safely, Tiffany. See ya again when ya need us."}, "gmap_id": "0x8862114afe6ebcc5:0x824161f326384d0c"}
{"user_id": "110013689687373918060", "name": "Michal Hirtl", "time": 1619706812607, "rating": 5.0, "text": "I would like to leave 5* review for world class auto repair. They did great and quick job on my car. The nicest people you can meet, thrilled to help you and fix you car for you for reasonable price.\nThey have my trust, if something goes wrong with my car, I know where I will go to get it fixed....World Class Auto Repair.\nThank you !!", "pics": null, "resp": {"time": 1619815521216, "text": "Thank you, Michal! This thoughtful review means a lot to us and we're honored to have your trust. Thank you for giving our team the opportunity to care for your vehicle. Until next time, drive safe!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "100537391710483933885", "name": "Leta Herring", "time": 1614728690517, "rating": 5.0, "text": "I have used World Class Auto for over 15 years. They are professional and always take excellent care of my cars, including my one owner,  perfect 1999 Mercedes  E 300 turbo diesel which was towed to the shop due to starter not working. The towing company damaged the body of car and the steering ans World Class Auto worked diligently to find the parts and repair my car.  I do not believe any other repair shop would have worked so hard. If you love your car, this is the place to take care of it.", "pics": null, "resp": {"time": 1614781895249, "text": "Thank you for the thoughtful review, Leta! We are always grateful for the opportunity to care for your cars, and we're very glad we could assist you with your Mercedes E 300 trubo diesel's repair needs. As always, if there's anything else we can do for you, please don't hesitate to reach out! Until next time, take care and drive safe!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "104298520894848690787", "name": "Joan Kersh", "time": 1622908951575, "rating": 5.0, "text": "Thank you so much A+ I will tell the world. Take your vehicle to World Class Auto Repair being retired and on a fixed income thanks again. A+  with  5 stars", "pics": null, "resp": {"time": 1623081987756, "text": "That means a lot to us, Joan! Thank you for choosing World Class Auto Repair for your vehicle's services. We appreciate your A+ and 5 star ratings and very much look forward to working with you again in the future. Take care!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "106810787232122489472", "name": "Ashley Sanford", "time": 1614365536971, "rating": 5.0, "text": "I have been using World Auto for years now starting with my 3 series BMW and now my 5 series, they have the BEST service! Usually bmw charges me an arm and a leg to get minor work done, but world auto gives me great prices and are so quick to keep you updated and get your car back quicker. Would highly recommend.", "pics": null, "resp": {"time": 1614613793421, "text": "Ashley, thank you so much for recommending our shop! We're very grateful for every opportunity we get to service your BMW and we are glad to hear you enjoy working with us. We're looking forward to seeing you next time. Until then, drive safely!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "115476166642258035390", "name": "Taylor Molitoris", "time": 1614119669422, "rating": 5.0, "text": "I had originally taken my BMW to another mechanic in Birmingham for basic engine work. My car sat there for over a week without any updates so I took it over to World Class auto and they were able to repair it and get it back to me in 24 hours. Car runs great and I appreciate the communication, customer service, and professionalism I received from them in contrast with the other mechanic.", "pics": null, "resp": {"time": 1614357650647, "text": "We're so glad you came to see us for a second opinion, Taylor! It was a pleasure servicing your BMW's engine, and we're very happy we could provide you with more efficient, enjoyable service. Please come see us again the next time your BMW needs maintenance or repair!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101172976853548889388", "name": "Ric Davis", "time": 1615325355999, "rating": 5.0, "text": "Friendly staff.  Staff (owners wife) was willing to discuss my bmw and service questions (just basic car talk) without trying to sell me on anything. I felt like they were honest enough that I'd be comfortable getting my car serviced or repaired at their facility in the future.", "pics": null, "resp": {"time": 1615387809426, "text": "We're very happy to hear this, Ric! Thank you for trusting us with your BMW's service needs. We're thrilled to know you felt comfortable and confident with our service, and we look forward to working with you again in the future. Thank you for choosing World Class Auto Repair in Birmingham!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "109528284020158554251", "name": "Cassandra Pullom", "time": 1622673376286, "rating": 5.0, "text": "Mrs. Yvonne was courteous and accommodating with My time and care for my Mercedes and so was Her Staff.", "pics": null, "resp": {"time": 1622727618788, "text": "Thank you for allowing our team to care for your Mercedes, Cassandra! It was a pleasure working with you and we're very glad to know you enjoyed the customer care you received from Yvonne and our automotive professionals. Don't be a stranger! Please come see us again the next time your Mercedes is due for maintenance."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "108661000499250378567", "name": "David Schmitt", "time": 1610761856435, "rating": 5.0, "text": "My 2009 Mercedes Benz E350 was making a noise at the right rear and I thought it was the wheel bearing starting to go.  I knew it was an expensive job so I searched for a local MB repair shop and found WCAR.  They ended up diagnosing the problem as the rear differential.  The job was completed quickly, professionally and at a fair price.  I now have an ABS problem I need to repair and will be bringing the car back to get this done.  I would recommend this shop to anyone.  Excellent work done professionally!", "pics": null, "resp": {"time": 1610989831300, "text": "Thank you for your kind review, David! It was a pleasure working with you and we're very grateful for the opportunity to service your Mercedes Benz. We really appreciate that you've shared what you enjoyed about working with World Class Auto Repair and we look forward to working with you again when you come back for your ABS repair. Don't hesitate to call if there's anything more we can assist you with. See you next time!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "108336377749108888506", "name": "Wesley Barber", "time": 1607817038465, "rating": 5.0, "text": "We had our vehicle dropped off.   They kept on top with us to let us know they tow truck driver hadn't dropped off the key.  After they go it, they took the time to research what the codes were and what solutions were available.  They kept me informed the entire time.  I highly recommend them car repairs.  I will use them again.", "pics": null, "resp": {"time": 1607964780552, "text": "Thank you for the recommendation, Wesley! Your support means a lot to us and we're very happy to know you enjoyed working with us as much as we enjoyed working with you. It was a pleasure assisting you with your vehicle's diagnosis and we appreciate the opportunity to help. We look forward to providing you with additional car care in the future! Thank you for choosing World Class Auto Repair and taking the time to review us."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "114397068175856736272", "name": "black Jack", "time": 1617109731904, "rating": 5.0, "text": "Great staff. Will refer to anyone. They will get all my business", "pics": null, "resp": {"time": 1617202355832, "text": "We're so honored to have earned your trust and referral! Thank you for choosing World Class Auto Repair and supporting us with your positive feedback."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110511249044284626685", "name": "Darrell Lindsey", "time": 1594653222086, "rating": 5.0, "text": "I have a 2012 Mercedes S550 and my Air Suspension Strut went out. I called World Class and had it towed in. They called me the next day, told me what was going on and gave me a quote. I promise you, they didn’t try to jack me up and tell me that other things were wrong, they just zeroed in on the problem and fixed it. I said that because I think all of us are looking for straight shooters who are not trying to get over on you... Now, because of high demand of car maintenance and everyone wanting their vehicle to be repaired, I had to wait a few days on my car; but it was explained to me upfront. And because of the excellent service and “Great Price,” it was worth the wait and I will be returning again for all of my future repairs!!! I highly recommend World Class because truly they are “World Class!!”\nP.S. Brenden is a super nice guy with great customer service and has a “First Class Business!!!\nWay to go World Class!!!!", "pics": null, "resp": {"time": 1594734902240, "text": "Thank you, Darrell! We're so glad to know you had a five-star experience here at World Class Auto Repair. Thank you for trusting us to care for your Mercedes! It was a pleasure working with you and we are thrilled to know you were satisfied with the quality of our repair, the level of customer service you received, and the pricing of our services. Thank you for taking the time to share your feedback and for recommending us to others! It means a lot and we are looking forward to your next visit!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "102744964661095936923", "name": "Kayla", "time": 1615414006223, "rating": 5.0, "text": "Very pleased with the work done and the professionalism. Highly recommended!", "pics": null, "resp": {"time": 1615498093875, "text": "Kayla, our team is pleased to hear that you are satisfied with the automotive services we provided. Thank you for the review and recommendation!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "117867810676202593406", "name": "Mickey Purnell", "time": 1614565197515, "rating": 5.0, "text": "Everyone I dealt with was knowledgeable, friendly and explained what services were performed and why.", "pics": null, "resp": {"time": 1614613903039, "text": "Transparency is very important to us, and we're always working to ensure our clients stay fully informed throughout their visit - whether it's for repair or maintenance. Thank you for choosing World Class Auto Repair and taking the time to review us, Mickey!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "115118765382171156458", "name": "Carl Peoples", "time": 1615095487027, "rating": 4.0, "text": "The team did a good job of finding the problem and fixing it.", "pics": null, "resp": {"time": 1615214971564, "text": "We're glad we could provide you with excellent service, Carl! Thank you for choosing World Class Auto Repair and taking the time to review us. If there's anything else we can assist you with, please don't hesitate to reach out!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "115646415461884640953", "name": "Charles Kown", "time": 1606147729826, "rating": 5.0, "text": "Excellent service and a better price than the MB dealership.", "pics": null, "resp": {"time": 1606231476437, "text": "Thank you for the positive feedback, Charles! We really appreciate your kind words and support. Please don't hesitate to give us a call the next time your Mercedes needs service!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "116469606708048911775", "name": "Woodie Coleman", "time": 1605381903774, "rating": 5.0, "text": "Excellent customer service, Mrs Yvonne is always very helpful and just a joy to talk to", "pics": null, "resp": {"time": 1605552892980, "text": "Your feedback means a lot to our team, Woodie. Thank you for your continued loyalty and support for World Class Auto Repair!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "114070351214597599436", "name": "Mike Hamner", "time": 1603557036035, "rating": 5.0, "text": "Great service, they pay attention to detail and they make recommendations that are very helpful.", "pics": null, "resp": {"time": 1603719332052, "text": "That's what we're here for! Thanks for the kind words, Mike. It was great seeing you and we look forward to working with you more in the future. Until then, take care!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "105066971908149568495", "name": "Brent Bonham", "time": 1622530021122, "rating": 5.0, "text": "Very knowledgeable and helpful.", "pics": null, "resp": {"time": 1622557401686, "text": "Thank you, Brent! We're very glad we could be of assistance to you, and even happier to know you felt confident in the knowledge and skills of our automotive professionals. Please come see us again soon!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "104160796756131322127", "name": "Mark R Ritchie", "time": 1595431190958, "rating": 5.0, "text": "They offer professional service at a reasonable prices. I highly recommend their services.", "pics": null, "resp": {"time": 1595517254401, "text": "Your recommendation is greatly appreciated, Mark! Thank you for choosing World Class Auto Repair and taking the time to support us with a positive review."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "113183594193991632405", "name": "Jacqui Sweet", "time": 1603145673157, "rating": 5.0, "text": "The friendliest people around that take care of your precious car.", "pics": null, "resp": {"time": 1603203841679, "text": "Thank you, Jacqui! It's a pleasure working with you and we appreciate the opportunity to take care of your vehicle. Thank you for choosing World Class Auto Repair and taking the time to share your feedback. It means a lot to us."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "116516599502863579483", "name": "Shawn Dixson", "time": 1588195721182, "rating": 5.0, "text": "I am from Louisville Ky. I was visiting Birmingham when my BMW X5 died on me. Had it towed to the dealership where it was diagnosed. Verdict from the BMW dealership was outrageous. Had vehicle towed to world class auto. Best move ever. The dealership had misdiagnosed my vehicle. World Class repaired my BMW for a fraction of what the dealership was trying to charge. Very honest business practices. Very friendly. Do great work. BMW is performing like new!!", "pics": null, "resp": {"time": 1589471914302, "text": "We're so glad to hear your X5 is performing so well, Shawn! Thank you for trusting our team here at World Class Auto Repair to care for your BMW while you were visiting the Birmingham area. We're so grateful you sought us out for a second opinion and we enjoyed working with you. Thank you for taking the time to review us! We hope to work with you again someday."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101966515810013248457", "name": "a murrell", "time": 1594764287031, "rating": 4.0, "text": "Brandon was very knowledgeable, when I took my daughter BMW in to be serviced by them. I felt as though I got an honest price for work that was done on the car.#NewCustomer", "pics": null, "resp": {"time": 1594823896699, "text": "Thank you for choosing World Class Auto Repair! We're happy to hear you enjoyed your first visit to our shop, and we appreciate the opportunity to service your daughter's BMW. Thank you for taking the time to share your experience and award us a positive rating! We hope to work with you more in the future."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "116921156907149855480", "name": "Paul Crouse", "time": 1619470484949, "rating": 5.0, "text": "Great service... !!", "pics": null, "resp": {"time": 1619529059435, "text": "That's exactly what we strive for! Thanks for letting us know we hit our mark, Paul! It was a pleasure working with you and we hope we get another opportunity to do so in the future. Thank you for choosing World Class Auto Repair of Birmingham!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "117968640687629363925", "name": "Brandon Croom", "time": 1573498384861, "rating": 5.0, "text": "Nice Family. They do great work.\nMake an appointment, it's better for everyone, but plan to leave the vehicle and pick it up by end of day 9/10. I recommend for any Mercedes Owner.", "pics": null, "resp": {"time": 1573826198124, "text": "And we really appreciate our customers.  We service Mercedes, BMW and Mini Cooper and have the dealer-level diagnostic tools to do so."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "106559254276616683387", "name": "Michelle Ford", "time": 1615551140371, "rating": 1.0, "text": "Yvonne not the friendliest person to work with public", "pics": null, "resp": {"time": 1615908020717, "text": "We're very sorry to hear you were less than satisfied with the service you received here at World Class Auto Repair, Michelle. If you're willing, please call us at (205) 591-7990 and we will do our best to find a positive resolution for you. Thank you for reaching out and providing us with your honest feedback."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101729320828404780115", "name": "Mike Hooton", "time": 1584979721041, "rating": 5.0, "text": "Very professional service. Cost less than original estimate! Will use again and also recommend to others.", "pics": null, "resp": {"time": 1589471825859, "text": "Thank you for your recommendation, Mike! It means a lot to us and we're so glad we were able to provide quality work for less than anticipated. It's always a good feeling. Thank you for sharing your kind words with us! We look forward to working with you again."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110142294768633506535", "name": "Lester Smith", "time": 1583874999734, "rating": 5.0, "text": "Just recently been introduce to World Class Auto Repair and my wife and I feel confident that they rendered top notched service 💯%🤙🏽", "pics": null, "resp": {"time": 1583961495868, "text": "Thank you for driving to Birmingham from Oxford, AL to get your BMW 530i serviced at our shop.  Hope you'll be back on the road with the new brakes, battery and oil service.  It's a pleasure to have wonderful customers like you."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110362516607789481671", "name": "Mary Nicholls", "time": 1617306644861, "rating": 4.0, "text": "Very  friendly and helpful. Willing to discuss proposed repairs and costs! Car runs great after service completed.", "pics": null, "resp": {"time": 1573826249999, "text": "That means we did our job, this is our goal for each car and customer.  Thank you for choosing us to perform the scheduled transmission service on your Mercedes."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "109812778487455955255", "name": "Marliese Thomas", "time": 1565019243140, "rating": 5.0, "text": "I drive an older BMW and had to call four places before finding a shop that would work on a car that old. The people at World Class Auto Repair were friendly, helpful, and effective! The final repair was even less than the original estimate. I'm so glad to now know of a quality repair place that's also in my neighborhood.", "pics": null, "resp": {"time": 1583027855518, "text": "Thank you. We have been in business for 30 years, and our journeyman technicians have years of experience with older BMWs and Mercedes as well as the diagnostic tools and expertise for newer ones."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "112639789525329431297", "name": "Patrick Dailey", "time": 1504210522472, "rating": 5.0, "text": "I don't normally post reviews, but I feel compelled to pass along my excellent experience at World Class Auto. I had the front/back brakes replaced on my 2011 BMW 328i, and the work was quality, timely, and fairly priced. The staff was friendly, knowledgeable, and generally made the experience as enjoyable as possible. Additionally, the mechanic diagnosed and fixed my broken windshield washer pump without me evening mentioning the issue at first (compared to a certain service provider, who shall remain nameless, who wanted $300 to do it!). I'd give them 6 stars if I could.", "pics": null, "resp": {"time": 1504294471415, "text": "Wow!  We give customers like this 6 stars also.  We want to take care of our customers by taking care of their cars, and give them one less thing to be concerned with in life.  Thanks for your kind review Patrick."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110440177975232475741", "name": "Edward Payne", "time": 1578607344021, "rating": 5.0, "text": "World Class auto repair is a Great alternative to the dealer . They gave me the Star treatment . I recommend them to everyone who want dealer service , but not dealer repair prices . Edward Payne .", "pics": null, "resp": {"time": 1578972255999, "text": "Thank you for 5 stars. We promise to continue to give you and all our customers the \"star treatment \"....you deserve it.  We're glad we could repair your Mercedes by replacing the ignition."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "105827997452034097856", "name": "Don’t Worry", "time": 1607430691439, "rating": 1.0, "text": "Owner quoted me at $700 then some lady quoted me $1100 at checkout. This has happened before because I read a review about this and then it happened to me. Red flags everywhere here. Went elsewhere", "pics": null, "resp": {"time": 1607545836702, "text": "We're very sorry to hear you were dissatisfied with our service, but are grateful you've brought it to our attention. We invite you to call the shop in order to speak with the owner directly. We'd be happy to address your concerns and frustrations, however I believe the confusion is that you called for an estimate and the fellow you spoke with gave you a price over the phone based on your assessment of the car, but when you brought it in, we gave you an accurate estimate of what your vehicle needed, including both parts and labor.  When you have time, please call (205) 591-7990. We hope to hear from you soon so we may work to resolve the issue. Thank you!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "107135121139404486660", "name": "Joseph Beavers", "time": 1567312223539, "rating": 5.0, "text": "Best experience I've ever had getting my car repaired. Staff is awesome and professional.", "pics": null, "resp": {"time": 1573826282484, "text": "That says a lot....THANK YOU!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101654142465052196200", "name": "Jim McCollum", "time": 1563911138295, "rating": 5.0, "text": "What else is there to say when they are the best. 😁😁\nThey deserve beyond the 5 Star Review.", "pics": null, "resp": {"time": 1583165123601, "text": "Thank you for the kind words regarding the work we did on your Mercedes."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "115907454452954617270", "name": "Carlyle Galloway", "time": 1562805916274, "rating": 5.0, "text": "Brought my 1994 BMW 325is in for a driveshaft and mount issue, and they had my bimmer fixed right up. Quick turnaround and reasonable pricing. Will probably use these guys again if I need more servicing done on my car", "pics": null, "resp": {"time": 1563571585954, "text": "Glad we could help with your BMW."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "104954222083682165346", "name": "David Goodwin", "time": 1530748342653, "rating": 5.0, "text": "An amazing job with an older Mercedes 300CD!  It has essentially sat for a number years and the service and repair schedule needed to begin again.  They kept in constant contact as they uncovered areas that needed to be addressed with a full explanation and estimate of the work needed.\nIt was a great experience and and I'm very comfortable in recommending World Class Auto Repair.", "pics": null, "resp": {"time": 1531255902528, "text": "Good customers are like good cars...hard to find...and we both lucked up.  Thanks for the great review."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "100689982387351572728", "name": "Jim Wilson", "time": 1584105149562, "rating": 5.0, "text": "Excellent customer service always, great cost-savings, A+++ work!!!", "pics": null, "resp": {"time": 1550766932921, "text": "Thanks for bringing in your Mercedes for Service and Battery.  It's always a pleasure to see you or Chris and we really appreciate you both."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "109572516723291375318", "name": "John Markus", "time": 1418765932115, "rating": 5.0, "text": "I have used World Class for several years and have been quite satisfied with the quality of the work and value received.  I trust them not to recommend more than I need and to perform any necessary repairs right the first time.  Also, the offer of a ride downtown and back makes the process very convenient.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101481515328824730509", "name": "Dwayne Carmichael", "time": 1444400440805, "rating": 1.0, "text": "Do not take your vehicle to this place. I brought my BMW X5 there to have the water pump replaced. They replaced the water pump, but damaged other parts on my vehicle while doing the repair. I was quoted $360 labor to replace the water pump. I called to check on my vehicle later that evening, and Yvonne said that her technician was having a hard time installing the water pump and that they had to charge me an extra hour worth of labor. Who fault is that? I told them no way, so they only charged me the $360 that I was originally quoted. However they did mentioned that my car needed 2 more repairs and quoted me $563 for one and $440 for the other. The $440 repair was for a hose that was damaged while they were changing the pump. The hose cost $40 from the BMW dealership and they said it would be 4 hours of labor, which didn't sound right for a hose. I called 3 other independent shops and was quoted $130 for the same repair parts and labor. The $563 was for a hood latch and cable, the parts at dealer are $80. Yvonne also said it would be 4 hours labor. I called several independent shops and was quoted $200 for parts and labor. I guess 4 is there magic number. When I asked Yvonne to double check those quotes all of a sudden she wasn't able to find the labor rates in the system. How did she come up with those figures initially? Bottom line do not take your car to these ppl. Yvonne charges you whatever she feels like and that's not right.", "pics": null, "resp": {"time": 1608734616106, "text": "We remember you well.  You brought your car late one afternoon with a coolant leak,  and we drove you across town to take you home. You didn't mention that your hood latch was locked and would not open. We spent quite a while to opened the hood to replace the water pump that you brought for us to install, and you declined the hood repair knowing that it would not reopen once it was shut.  We actually charged less labor to install the water pump than the labor guide prescribes.  We also told you about another coolant leak that you say we caused, but we did not; you also declined that repair.  Yes, we would normally charge more because of the extra work to open your hood because of the latch and cable.  Your car came in with several problems, but none caused by us.  We did our best to accommodate you in every way and we're sorry you left dissatisfied."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "107533166899216214319", "name": "Rico Suave", "time": 1455872023726, "rating": 1.0, "text": "Dropped my car off for a radiator change. It took about a week to just get an estimate when I was told it would be looked at the following morning. When I finally got the estimate, it was on the high end, quoted a few more hours than normal. Continuously called to try to get information over the next week! Was lied to several times throughout the two weeks and one day for a radiator change! Wasn't even notified when they required another part.  On top of it, the manager/owner referred to me as a \"damn Yankee\". Great business savvy you moron. If you want over priced work, dishonesty, ignorant management this is the place for you. Honestly, the worst experience I've ever had at a car maintenance facility.", "pics": null, "resp": {"time": 1550770212243, "text": "Sorry, Mr. Suave, but we have no record of you ever being in our shop.  We take our reviews very seriously, but you must have us confused with another shop."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "102097520020199185867", "name": "Max Wood", "time": 1559655669596, "rating": 5.0, "text": "I've used other Mercedes non-dealer providers for years.  This is one of the best!", "pics": null, "resp": {"time": 1563571799209, "text": "We appreciate you taking time to give us such a great review.  We're happy to assist with any problems and/or service needed on your Mercedes."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "105351327550751817873", "name": "Tiffany Whitmore", "time": 1418243761333, "rating": 5.0, "text": "The staff at World Class Auto make me feel welcome, comfortable and always take the time to explain why my car needs a certain repair, what options I have and the timeframe of repair urgency. The repair and ownership team take the time to get to know you and always listen to what I think is going on with my car. Hands down I wouldn't take my car any other place in the Birmingham area for regular maintenance to more complex projects.\n\nMost of the service I have received is on a 2005 BMW x3. They are helping me keep it rolling in good shape.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110864271363189530778", "name": "E P", "time": 1547659158348, "rating": 5.0, "text": "World Class was a great experience in working with an older mercedes diesel that I plan to drive forever and they are the ones to keep it going.", "pics": null, "resp": {"time": 1551976319224, "text": "We were happy to replace the ball joints & engine mounts & shocks on your 2005 Mercedes E320 CDI.  We're glad your experience was a pleasure, and that you trust us to take care of your car."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "112936175405991199230", "name": "Window Decor", "time": 1418247781923, "rating": 5.0, "text": "Phillip and Yvonne really care about us from a financial point of view which is quite refreshing. Our past experience with our local Mercedes dealer left us searching for another source to fix our cars(we own 2 Mercedes) and we were given them by past customer. It has been a great relationship.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101686618701511713371", "name": "Jeffrey Solomon", "time": 1539875355083, "rating": 5.0, "text": "Fair, knowledgeable and prompt. In addition to the quality work, WCA conveys a tremendous sense of honesty.", "pics": null, "resp": {"time": 1539877365268, "text": "We always appreciate kind words & great customers like Mr. Solomon. This makes our job a pleasure."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "112169072019381131267", "name": "David Averyt", "time": 1565893399709, "rating": 5.0, "text": "The team at World Class always takes care of me!", "pics": null, "resp": {"time": 1573826390422, "text": "Thanks David, thank you for letting us service and replace the timing chain on your Mini-Cooper."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "103175629841429415386", "name": "Kara Snell", "time": 1597179589307, "rating": 5.0, "text": "Great work and efficient!", "pics": null, "resp": {"time": 1592317259838, "text": "Thank you, Kara! It was a pleasure working with you and we're glad we were able to service your vehicle in a convenient time frame. Thank you for choosing World Class Auto Repair!"}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "103413429001875038888", "name": "mikaelgriffin", "time": 1433469736827, "rating": 5.0, "text": "The Best..fair pricing and honest evaluation...I would not take my 2005 Crossfire anywhere else. They have my business from now till forever....Michael Griffin", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "100004268642097140142", "name": "Carl Tamm", "time": 1489533168867, "rating": 5.0, "text": "If you like to be treated like a person, and not like a number, this is the place!  Great professional service, from friendly and trustworthy people.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "109468224915427851839", "name": "Matthew Ponder", "time": 1537367274804, "rating": 5.0, "text": "Very professional, very courteous and friendly. Will totally be using them for my MB upkeep!", "pics": null, "resp": {"time": 1583165250098, "text": "Thanks, we'll take care of your Mercedes maintenance and repairs."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "116014000990247931850", "name": "John Bagwell", "time": 1431095385335, "rating": 5.0, "text": "The only place in town that can make a 1966 MG-B run as smooth as a baby's ass...", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "117685783326519377538", "name": "Blake Howard", "time": 1545700149899, "rating": 5.0, "text": "Best shop in B'ham if your European or Asian luxury vehicle has any mechanical troubles, and the friendly and helpful staff will get back on the road.", "pics": null, "resp": {"time": 1583165153186, "text": "Thank you--your BMW will be in good hands with us."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "111762984050539140304", "name": "t", "time": 1489529289646, "rating": 5.0, "text": "Great service - they have the equipment and people to do the job right,", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "100823653383909400699", "name": "Blake Howard", "time": 1531656807477, "rating": 5.0, "text": "Specialized and Certified to work on MBZ, BMW, Lotus, Ferrari,and various other euro/Asian luxury imports.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "103733807916231528948", "name": "Allen Kilgore", "time": 1517934687631, "rating": 5.0, "text": "Outstanding people and outstanding customer service.  What more can you ask for?", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "114303531258835530491", "name": "James Ovario", "time": 1383777984268, "rating": 5.0, "text": "I dropped my car off on a Tuesday morning and these guys had it fixed by 5 pm the same day. They are friendly and honest.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "117053423968482742390", "name": "Ethan", "time": 1540134881975, "rating": 5.0, "text": "World Class Auto always does an excellent job.", "pics": null, "resp": {"time": 1563572933260, "text": "Our pleasure--we always appreciate nice customers and want to do the best job possible."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "111868944234544450454", "name": "DeMarcus Blanding", "time": 1567010421670, "rating": 5.0, "text": "Awesome customer service", "pics": null, "resp": {"time": 1573826365227, "text": "Thank you.  We're happy we could diagnose, replace and program the control module your Mercedes C Class needed.  Five stars is quite a goal to reach--we'll always work toward maintaining that goal."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110335436842608599724", "name": "Busy Blake", "time": 1488841167079, "rating": 1.0, "text": "Poor customer service!! I only gave them one star because it is required to leave a comment, but they don't deserve that star either.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "108650284308913785779", "name": "Matt G", "time": 1474520541632, "rating": 5.0, "text": "These folks really know their stuff! I have used this garage for over 15 years and they have never steered me wrong.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "110481929317612262641", "name": "Deborah Hall", "time": 1561640926374, "rating": 5.0, "text": "Awesome Folks!!!", "pics": null, "resp": {"time": 1563571641489, "text": "Always nice to see you.  Thanks."}, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "115056684939689625476", "name": "Melanie Harris", "time": 1510119674081, "rating": 5.0, "text": "Had a blast!", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "104635014294016659753", "name": "AVA MILLER", "time": 1470866545033, "rating": 5.0, "text": "they are awesome", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "101718209935675644475", "name": "Lawrence Carmon", "time": 1516052134503, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x88891a6088807925:0xf836d426c32408d0"}
{"user_id": "116981469930961440625", "name": "Allen Scofield", "time": 1612393578299, "rating": 5.0, "text": "Great place and people. Doing business with them for a long time.", "pics": null, "resp": {"time": 1614707614754, "text": "We're glad we have been able to service your vehicle over the years! Thanks so much for complimenting our staff, and see you next time you need repairs or maintenance!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "112227679760059698922", "name": "Allison Johnson", "time": 1533243059066, "rating": 4.0, "text": "Good workers", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM7fiUwZdUF9T97DnalESlGKM7TQz2A3O4rCb0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQVv7KMDnFMO58ObfbEtSx-Qx4EgvZTPN2d5E=w150-h150-k-no-p"]}], "resp": {"time": 1533586271186, "text": "Yes they are, Allison. Thank you for noticing!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "109017669744220712299", "name": "Monica Bourgeois", "time": 1601764160184, "rating": 5.0, "text": "Best place in Andalusia to get your vehicle serviced. They do great work and treat every customer great", "pics": null, "resp": {"time": 1601911633403, "text": "Thank you for your kind words, Monica! We're happy to hear you like our auto shop so much, and we'll see you next time!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110169638373848858853", "name": "Christy Elrod", "time": 1596036928666, "rating": 5.0, "text": "Great place and people. Done an excellent job on my car. Will give them all my business in the future.", "pics": null, "resp": {"time": 1596723772808, "text": "We're happy to hear you like our staff and their excellent work, Christy! See you next time your car needs service!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "109819812646096306527", "name": "Reginald Daniels", "time": 1599750721057, "rating": 5.0, "text": "Great tire shop, they make sure that customer knows everything that's going on before they do any work.", "pics": null, "resp": {"time": 1599855035469, "text": "We're happy to hear you like our communication style, Reginald! Thanks for trusting us with your vehicle, and see you next time!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "103860530477054617335", "name": "Brandi Rines", "time": 1604116259053, "rating": 5.0, "text": "Great staff.. great prices", "pics": null, "resp": {"time": 1604441095368, "text": "We're happy to hear you like our staff and prices, Brandi! Thank you for choosing Andalusia Tire Co and see you next time!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110412318276052660508", "name": "John Roberts", "time": 1612453123646, "rating": 4.0, "text": "I recommend them.", "pics": null, "resp": {"time": 1614707368715, "text": "Thanks for recommending our tire and auto shop, John! See you next time your vehicle needs service!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "117814185064518975914", "name": "Lance Mills", "time": 1598652371930, "rating": 5.0, "text": "Great customer service on a Friday afternoon!", "pics": null, "resp": {"time": 1599244063835, "text": "We're glad we could get you set before the weekend! Thanks for the review, Lance!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "104387333316798115253", "name": "Wanda Day", "time": 1578851515400, "rating": 5.0, "text": "Needed a new special tire for my mini cooper and Jim had it the next day.Always great service", "pics": null, "resp": {"time": 1578955117836, "text": "We're glad we can help you take care of your Mini Cooper, Wanda! Thank you for writing this nice review about our tire service, and for choosing Andalusia Tire Co! Thanks again and see you next time!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "113343170321415075101", "name": "ManatsPun Sriratana (Big Daddy Nat)", "time": 1571080722184, "rating": 4.0, "text": "good for unload nice pepoles here .i only tolk 1h for empty", "pics": null, "resp": {"time": 1571157118065, "text": "Thank you for your positive feedback! We're happy to hear you like our nice staff!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "104495439555855571935", "name": "Heiken Family", "time": 1578344545742, "rating": 5.0, "text": "Outstanding service. The owner was a pleasure to talk with also", "pics": null, "resp": {"time": 1578432246592, "text": "Thanks for complimenting our outstanding service, Gacha! We're glad you had a good experience at Andalusia Tire Co!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "111574670225561719069", "name": "Tone Bates", "time": 1603408930303, "rating": 5.0, "text": "Good honest folks", "pics": null, "resp": {"time": 1603470682944, "text": "We're glad you like our honest staff! Thanks so much for your kind words and see you next time!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110203570607260842719", "name": "Ben T", "time": 1555613500178, "rating": 5.0, "text": "These guys always do a great job in a timely manner. I've never left there unsatisfied, and haven't found anyone to beat their prices!", "pics": null, "resp": {"time": 1555622743240, "text": "Thanks so much for the 5-star review, Ben! We take great pride in both our work and customer service - glad to see both show through! Please keep us in mind for any future services."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "115653221597062358626", "name": "Charity Polk", "time": 1544628235539, "rating": 5.0, "text": "I had a low tire..ended up nail in it.  They fixed in in less than 10 minutes. Very nice and professional.", "pics": null, "resp": {"time": 1544649867308, "text": "Thank You for your business! We truly appreciate it."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "100321925777649588844", "name": "Angela Baker", "time": 1596571549171, "rating": 5.0, "text": "Very nice and considerate", "pics": null, "resp": {"time": 1596723742613, "text": "Thanks so much for complimenting our friendly service, Angela!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "107391748418724328505", "name": "Billy Lee", "time": 1530665198558, "rating": 5.0, "text": "I have done alot of business with these guys over the years both personally and with the company i work for. They have never disappointed me. They one thing i have liked the most about them is that when i pull up, they have time (or at least act like they do) to stop what theyvare doing and come out to my car and talk to me about what i want.", "pics": null, "resp": {"time": 1530816914494, "text": "We know your how valuable time can be, Billy, thanking you for choosing our shop by learning about what's going wrong with your cars is the least we can do! We appreciate your support of our local business and we look forward to your next visit!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "106502634532032135871", "name": "Wendell Ard", "time": 1536112404550, "rating": 5.0, "text": "Great place to Shop for Tires and oil changes and much more in Service.", "pics": null, "resp": {"time": 1535135906851, "text": "Thank You for the 5 Star Rating! We really appreciate  your business!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "102506760316538782911", "name": "J Moe", "time": 1497128551921, "rating": 3.0, "text": "I had one good experience and one not so good one at Andalusia Tire. I bought tires as well as had needed front end work done on my truck. That was the good experience. I should add they have had the same mechanic for years and he has a well deserved reputation for competence.\nThe most recent vist to purchase tires for my car was not so good. It was shocking enough that the owner helping me abruptly left for a lunch engagement in the middle of the sale promising to call me after lunch. Even more so when I never received the call back to order the tires. Needless to say I took my business elsewhere and won't be returning.", "pics": null, "resp": {"time": 1497370261477, "text": "J Moe, we apologize for the misunderstanding. We try to treat all of our customers with the respect we would want to be treated with. If you could please give us a call we would like to correct the situation. Thank you."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "103466865010144555629", "name": "Janet Campbell", "time": 1515076307965, "rating": 5.0, "text": "I really like this tire place very friendly folks work here.", "pics": null, "resp": {"time": 1513610452505, "text": "Janet, thank you so much for sharing these kind words with us!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110813486182041661034", "name": "Wc Odom", "time": 1540234789313, "rating": 5.0, "text": "Good folks great prices great service!", "pics": null, "resp": {"time": 1540324961826, "text": "Thank you so much! It was a pleasure working with you."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110012686674807345146", "name": "Tracy Ainsworth", "time": 1619893993078, "rating": 4.0, "text": "Friendly", "pics": null, "resp": {"time": 1620850941629, "text": "We're glad you like our friendly staff, Tracy! We hope we can do a 5-star job on your next visit!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "108240256487442125763", "name": "Lisa Ellison", "time": 1529088270271, "rating": 4.0, "text": "I strongly recommend Andalusia tire company,  excellent work", "pics": null, "resp": {"time": 1529334389657, "text": "We appreciate the recommendation, Lisa! We look forward to your next visit."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "103834347878583509504", "name": "Lisa Trevino", "time": 1517661585349, "rating": 5.0, "text": "Go see tod he's the best", "pics": null, "resp": {"time": 1517853597497, "text": "Thank you for the kind words, Lisa!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110807779300012906452", "name": "Amanda Straughn", "time": 1584574581702, "rating": 5.0, "text": "Was in and out 10 mins", "pics": null, "resp": {"time": 1588265713078, "text": "We're glad we could help you so quickly, Amanda! Thanks for the great feedback, and see you next time!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "117894110138244217653", "name": "Trey Eppes", "time": 1521486360891, "rating": 5.0, "text": "Good prices, and help, little wait", "pics": null, "resp": {"time": 1521561448508, "text": "Thanks for the 5 stars, Trey! We were happy to get you back on the road quickly."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "104317097701198803105", "name": "Wayne White", "time": 1503404440851, "rating": 4.0, "text": "Got a tire patched & was out very fast", "pics": null, "resp": {"time": 1503408733634, "text": "Thank you, Wayne! We appreciate you sharing your experience with us."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "105248878910535806363", "name": "Brett M. Boyd", "time": 1574105657439, "rating": 4.0, "text": "Fast and friendly", "pics": null, "resp": {"time": 1574117850407, "text": "Both qualities we are proud to be described as! Thank you for the positive review, Brett! We really appreciate it."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "113871225838337673819", "name": "Louis Lynn", "time": 1523289750554, "rating": 5.0, "text": "Thanks very good", "pics": null, "resp": {"time": 1523295156573, "text": "Thanks, Louis! It was a pleasure working with you and we look forward to helping you again in the future."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "106221202229385151316", "name": "Marcus Boatwright", "time": 1565437825691, "rating": 5.0, "text": "Good people", "pics": null, "resp": {"time": 1565621095346, "text": "We're glad you think so, Marcus! Thanks for sharing your kind words!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "118198125579410514876", "name": "Kyle Whitson", "time": 1498283631223, "rating": 5.0, "text": "Went there at end of the day on a Friday and got a last minute fix even after told them we couldn't afford to pay much. Man in office was extra kind and helped my family out of a very needy hardship.", "pics": null, "resp": {"time": 1498502922073, "text": "Kyle, thank you for sharing! It was our pleasure to help you out."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "108401558620665089777", "name": "Todd Caton", "time": 1541460161143, "rating": 5.0, "text": "The best!!", "pics": null, "resp": {"time": 1517928672501, "text": "Thanks for taking the time for the positive feedback, what did you enjoy most about our service?"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "117295154525446461008", "name": "Bam Bam", "time": 1514297624999, "rating": 4.0, "text": "Great service", "pics": null, "resp": {"time": 1514397355346, "text": "Thank you, Bam Bam! We appreciate the compliment."}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "107894721540334640402", "name": "Auburn House Wash", "time": 1530755739810, "rating": 5.0, "text": "Best in the business!", "pics": null, "resp": {"time": 1530816771051, "text": "Thank you, Auburn!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "118281680621920069553", "name": "julie mcduffie", "time": 1491295365742, "rating": 5.0, "text": "Great service and people!!", "pics": null, "resp": {"time": 1491317953163, "text": "Thank you, Julie!"}, "gmap_id": "0x8891ee88eb799b47:0x332e620576de6bd8"}
{"user_id": "110568631652722628492", "name": "Deborah Watford", "time": 1623542245984, "rating": 5.0, "text": "Love Tire Discounters!!! They have always taken great care of our cars and us. Get us in and out in a timely manner. Go see Hugh and Joseph, they will treat you right.", "pics": null, "resp": {"time": 1623681650436, "text": "Aww, group hug! So glad to take great care of ya, Deborah--we love having ya in the TD family! See ya again anytime ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116056900349112563483", "name": "Eldred Ramtahal", "time": 1623383443995, "rating": 5.0, "text": "A phenomenal experience at this location. The service and performance of the technicians was first class and unrivaled. I have taken all of our vehicles to this location for my car care needs and will continue to do so in the future.", "pics": null, "resp": {"time": 1623498322915, "text": "Oh, man! THANKS SO MUCH FOR THE AWESOME SHOUTOUT, ELDRED. We'll see you anytime ya need us--you've got us for life."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103629753433385264668", "name": "jason jefferson", "time": 1565832140931, "rating": 5.0, "text": "Good place to get some last-minute work done the people help me out over there friendly and a great. They installed my rims and lowering springs", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwySL6G7k38Cr5Ige-U3n6fO_XPtIyIJIATzGL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvUGTwxfLxSX_E2OLELSJYeGclVEStfKP1d6Ua=w150-h150-k-no-p"]}], "resp": {"time": 1565877825540, "text": "Rockin' and rollin'! Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109211464362323172213", "name": "Erin Marie", "time": 1615940214737, "rating": 5.0, "text": "This is the place to go for all of your tire needs! If I could give them 10 stars I would. The location is extremely clean, the staff are excellent, & the customer service is phenomenal. Corey, the general manager, understood my needs & the urgency of it. He went above & beyond to help me get my wheel fixed as soon as possible!! Everybody is so friendly & Corey is FANTASTIC. He is so great about calling customers with updates, I never even had to call them to ask about updates. I recommend this location & I will continue to come to this location for all my car/tire needs! Thank you guys so much, especially Corey, y’all are the best!!!!", "pics": null, "resp": {"time": 1615996161117, "text": "Awesome! Glad we could get you safely on the road, Erin. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112240333103498698902", "name": "Jason Mishtawy", "time": 1581205016482, "rating": 1.0, "text": "Very dishonest place! Claimed I only had 1-2 mm of brake pads left on my rear brakes and that my rotors were \"cracked\"... Pads actually had 50% life remaining and rotors were fine! Do not trust their assessments of anything without inspecting yourself or with a qualified mechanic.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRTpvjYGQLmUdy7-9yxIOZB2uxuFiplDqYjIU2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNKXZYtzKw_KpbwnjusMZMxpglRj2wi7l_MZY7k=w150-h150-k-no-p"]}], "resp": {"time": 1581361378233, "text": "Honesty is one of our core values and we take all customers feedback to heart. Thank you for alerting us, Jason. We would like to connect you with a TD Rep to learn more and address your concern. Would you mind sending your preferred contact information to tirediscounters.com/contact? We look forward to connecting."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112874417667970603694", "name": "Chris Zoeller", "time": 1617413749290, "rating": 5.0, "text": "Corey and the team did an excellent job replacing my car's tires with an alignment. The car now drives like a new one. Excellent customer service from the moment I called to schedule my appointment until checkout. I like that they verify the work with the team and customer as they work. I witnessed the team helping other customers in detail while I waited. Thanks!", "pics": null, "resp": {"time": 1617477307194, "text": "Aww, group hug. We love having you in the TD family, Chris. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "108026700093800531766", "name": "Tim Abend", "time": 1619482596624, "rating": 5.0, "text": "Great service!  Needed 4 tires put on right before a trip.  Car was done on time and drove like a dream afterward (300 mile trip).  Would recommend these guys to anyone needing tire service.", "pics": null, "resp": {"time": 1619521923154, "text": "Right?! Why would you go anywhere else? That is how we rock so you can roll! Thank you for the feedback and 5-star review! We work hard to provide you with a great experience every time. Please come back to see us again when you need us and spread the word! Stay safe out there!!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113671379777823261333", "name": "kevin lofty", "time": 1622164597779, "rating": 5.0, "text": "I stopped in for a quick repair. They looked booked but the guy behind the counter immediately went to the shop and took care of my right away in a friendly manner. They will get more of my business.", "pics": null, "resp": {"time": 1622215695394, "text": "Right?! Why would you go anywhere else Kevin? That is how we rock so you can roll! Thank you for the feedback and 5-star review! We work hard to provide you with a great experience every time. Please come back to see us again when you need us and spread the word! Stay safe out there!!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104312524275527996483", "name": "Cheryl Leffler", "time": 1619645235277, "rating": 5.0, "text": "I had a leak in my tire and couldn’t figure out what it was. They were quick to get me in right away and fix it. So professional and friendly. They have a forever customer now.", "pics": null, "resp": {"time": 1619727778274, "text": "Woohoo! That's how we roll! We love making customers for life. Glad we could get you safely on the road. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110891881938183430610", "name": "Rebekah Armstrong", "time": 1611778822757, "rating": 5.0, "text": "Service at this Tire Discounter location was speedy and convenient. We used their “Skip the Shop” service  to have them drop the vehicle back off at my home after completing the service. I live close by, but it’s still a huge convenience to be able to just drop it off and not have to have a ride back to pick it up.  They can also come and pick up your vehicle, but I didn’t know about it until after dropping it off. This service was free of charge with any service of $50+. Sam brought out car back and was very polite and professional. A+\n- Tanner Armstrong", "pics": null, "resp": {"time": 1611780726191, "text": "Thanks for the awesome review! Glad you were able to utilize the Skip the Shop services, too, Tanner. How AWESOME, right?! Take care and we'll see ya again anytime ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105244073412219645145", "name": "Glenn F", "time": 1612468519229, "rating": 5.0, "text": "Stopped in to get air in my tires. Parked in front of the first bay as I have always done. Gentlemen came. Out and asked if I needed air and they rolled the door up promptly and filled the tires. Great service from Tire Discounters as always, I'll continue to get my vehicle serviced at their locations!", "pics": null, "resp": {"time": 1612552921065, "text": "Awesome! Glad we were able to take great care of you. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110891327288831420846", "name": "Brice Butler", "time": 1620752307798, "rating": 5.0, "text": "Nate and the guys at TireDiscounters got my tire patched quickly and provided a great experience, 10/10 will return to this location!", "pics": null, "resp": {"time": 1620760866135, "text": "Woot woot! We love to hear about great customer service, glad we could get you safely on the road. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117333169520825436648", "name": "Wendell Harden", "time": 1622297562403, "rating": 5.0, "text": "The staff was great and was able to accommodate my needs in a timely manner", "pics": null, "resp": {"time": 1622406449916, "text": "Thanks for the stars, Wendell! Glad we could get you safely on the road. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104720427749639565300", "name": "Roy Oshiro", "time": 1623444324575, "rating": 5.0, "text": "Exceptional service as always. Great customer service", "pics": null, "resp": {"time": 1623587569023, "text": "Rockin' and rollin'! Thanks for the stars, Roy. We'll be here whenever ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "108307909458201747928", "name": "John Daniels", "time": 1619445159264, "rating": 5.0, "text": "Nathanial is awesome. Walked me through the entire process to get new rims and tires. He deserves a raise.", "pics": null, "resp": {"time": 1619448754873, "text": "Nathaniel is AWESOME! Glad we were able to hook you up, John! See ya in 5000 miles for your 1st of many free lifetime tire care visits. We want to take make sure we take good care of those new puppies."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "100129696878478761743", "name": "Shaun Bundy", "time": 1615585503706, "rating": 1.0, "text": "I would give zero stars if could, because that's exactly how much service I received. Had a 2pm appointment for oil change, showed up at 1:45pm. He said they would get right on it. At 3:20pm, over 1.5 hours later, I hadn't heard a peep from anyone. I got up to check on it, on crutches BTW, and see my vehicle sitting in the parking lot. I thought it was complete, and asked why no one let me know. He informed me that they hadn't even touched it yet. I asked for my keys, and voiced my displeasure. He handed me my keys, and never once offered any kind  of apology . Why take appointments if you have no intention of honoring it?!", "pics": null, "resp": {"time": 1615602826683, "text": "Thank you for the alert, Shaun. We definitely respect your time & take your feedback seriously. We do get backed up from time to time, but the team should be providing updates throughout to let you know of any unexpected delays. That being said, we'd like to connect & learn more. If possible, please send your preferred method of contact to support@tirediscounters.com. Once received, a member of the team will reach out. We value your insight and hope to chat soon."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109849543250123055687", "name": "Karen Gunn", "time": 1621364289808, "rating": 5.0, "text": "Very professional and convenient service! Sam is amazing!", "pics": null, "resp": {"time": 1621434911359, "text": "Heck yeahhhhh, love to hear it! Thanks for the stars! Glad we were able to take great care of you. We will see ya again when ya need us, and we'll even save you a VIP parking space...maybe. Stay safe out there!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104466327129329502612", "name": "Phillip Donald", "time": 1599165369752, "rating": 5.0, "text": "These guys are awesome! They have always treated us right. My wife works next door and they will bring the car to her and drop it off. Every time we have taken any of our vehicles there the work is excellent, employees are kind and caring and they work hard to get you fixed and on your way! I highly recommend this location!! Thanks Guys!!!!", "pics": null, "resp": {"time": 1599224405407, "text": "Aww, group hug! We love having you and your wife in the TD family, Phillip. You've got us for life!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110698396288584445531", "name": "Daniel Webster", "time": 1614447549300, "rating": 1.0, "text": "I purchased almost 2 thousand dollars worth of tires from this location for a 2008 dodge dually in September 2020. On February 15th 2021 I took truck in for a rotation and brake inspection. They did the rotation wrong and put two tires that were worn way down and put on outer tears which started skinning them fast. Less than 200 miles down the road and the rear brake pads were metal on metal yet they supposedly just did a brake inspection. Today I took truck back so they could address the issues they cause and they wanted me to pay for their errors. I was fine with covering costs of brakes but the tires was their error. They did want to take care of me the customer. I picked my truck up and will leave this same review on every site I can find and contact an attorney Monday morning to address this matter.", "pics": null, "resp": {"time": 1614626245109, "text": "Thanks for reaching out, Daniel. We've got an open ticket for ya in our system and we'll be in touch to get to the bottom of this soon. Make sure to send us your contact info if you haven't already done so to support@tirediscounters.com. Talk soon."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104205717747357621848", "name": "Jennifer Renee", "time": 1614545492629, "rating": 5.0, "text": "Corey and Nate were very helpful. I'll definitely refer my friends and family to them!", "pics": null, "resp": {"time": 1614548539350, "text": "Woohoo! We love having you in the TD family, Jennifer. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110557667929378631568", "name": "Pierre Balbin", "time": 1610803620688, "rating": 5.0, "text": "Fast service/registration. Quote times are accurate. No time wasted trying to sell me a million things like Meineke...", "pics": null, "resp": {"time": 1610896374959, "text": "We rock so you can roll. Happy to have ya in the TD family, Pierre. You've got us for life."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116311624459009490926", "name": "Stephen Youngblood", "time": 1619013933010, "rating": 1.0, "text": "I made an 8 am appointment to get one tire changed. I learned don’t ever make an 8 am appointment. It’s 830 and my truck still hasn’t even been pulled in so now I have to scramble to reschedule meetings this morning. Use discount tire instead they keep their appointment times and don’t have people laying out tire displays instead of taking care of customers. Then when they get it in and go to put the new tire on the guy stands there for 5 minutes texting instead of installing my tire....over an hour and a half for one tire as the first appointment of the day and first one signed in.\n\nDO NOT USE FIND SOMEWHERE BETTER", "pics": null, "resp": {"time": 1619019413768, "text": "Hi Stephen, we apologize that we did not meet your expectations. We take great pride in our craft and try to ensure that all of our services are completed to process and timely. We have pulled up your invoice and will be creating a customer escalation ticket to be reviewed by the Regional Manager who will be contacting you shortly. Thank you for being a valued Tire Discounters customer and we hope to see you again when you need us!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106565303927683829480", "name": "Sallie Merritt", "time": 1613778577194, "rating": 5.0, "text": "Very convenient! Prompt professional service. Love Tire Discounters! Highly recommend.", "pics": null, "resp": {"time": 1613834123182, "text": "That's what we like to hear! We are the authority in auto safety and customer service, Sallie. We'll see ya again anytime ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105688831172166329637", "name": "Greg Machen", "time": 1620095933385, "rating": 5.0, "text": "Great service. Great prices!", "pics": null, "resp": {"time": 1620136880423, "text": "That's how we roll! Thank you for the stars!  We appreciate you being a valued Tire Discounters customer. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110964103430392791989", "name": "Tennessee Valley Hangers (Tennessee Valley Hangers)", "time": 1611105486806, "rating": 5.0, "text": "Dropped of the van to get new tires, got a good deal on awesome tires. The staff was personable and did a great job.", "pics": null, "resp": {"time": 1611524284183, "text": "We rock so you can roll! Happy to have ya in the TD family! We'll be here anytime ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "108674805083525508398", "name": "christian paramo", "time": 1602428561678, "rating": 5.0, "text": "I was late for work, I had a flat, and my tire was way too worn out to be patched. I couldn’t catch a break this month. All the other tire shops were expensive for something unexpected. I decided to try out Tire Discounters, and they found me a great deal on a set of tires and fixed me up real quick. Thanks, for being a hero for me that day! They gave me my break. I needed that win for the day! The customer service was friendly and professional. The next day the manger gave me a follow up call to make sure everything was okay, I’ve never had that happen from a tire shop.", "pics": null, "resp": {"time": 1602700308225, "text": "That's how we roll! Glad we were able to take great care of you, Christian. We will see ya again in 5000 miles for your free rotation."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111978074762461181524", "name": "Michael Phraner", "time": 1609860708875, "rating": 5.0, "text": "My go-to place for an oil change! Just be prepared to wait a while. It’s best to drop off your vehicle early in the day.", "pics": null, "resp": {"time": 1609957940238, "text": "We definitely respect your time and take your feedback seriously. An appointment is recommended as it grants you the next available bay from the booked time. We do occasionally get backed up. However, the team is responsible for updating you on any additional unexpected delays. Thanks for the shoutout, Michael. We'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117506380167367399990", "name": "Allin L. Whittle II", "time": 1609363526810, "rating": 5.0, "text": "Exceptional service. Valet service is great for busy parents. Will use again.", "pics": null, "resp": {"time": 1609425572463, "text": "Aww, group hug. We are the authority in auto safety, Allin. Thank you!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111551590723826195834", "name": "Alan Mills", "time": 1616025358958, "rating": 5.0, "text": "Fast friendly service. No surprises at checkout.", "pics": null, "resp": {"time": 1616600791791, "text": "That's what we like to hear! We love having ya in the TD family, Alan. You've got us for life."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113780694274724481066", "name": "Sherina McCauley", "time": 1619733788816, "rating": 5.0, "text": "I came to get a tire changed, and ran into  other issues.. Corey , and his team really went above and beyond to make sure everything was taken care of.", "pics": null, "resp": {"time": 1619786932328, "text": "Wellll...woot woot and woot! Thanks for the 5-star review! Soooo glad Corey and his crew took great care of you . Customer satisfaction is always our number one priority.  Stay safe and come see us again when you need us!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "102897415525431993753", "name": "Terry Smith", "time": 1610219007182, "rating": 5.0, "text": "These guys are great! Highly recommend.", "pics": null, "resp": {"time": 1610193905711, "text": "Thank you for your feedback. We love having you in the TD family, Terry. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110712354693747313117", "name": "James Pate", "time": 1598023639115, "rating": 5.0, "text": "This place is one of the best shops i've ever done business with. They know what they are doing 100 percent and my Car is better than ever! I highly recommend!💯", "pics": null, "resp": {"time": 1598104129030, "text": "The Huntsville team is the BEST! So glad we could take excellent care of ya, James. We'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115457157369749229209", "name": "Paul Shreck", "time": 1618710464088, "rating": 1.0, "text": "Had a couple thousands dollars worth of stuff stolen from my vehicle while there for tires 🤬🤬🤬🤬🤬", "pics": null, "resp": {"time": 1618862498947, "text": "Hi Paul! We have pulled your information and have created a customer service ticket. Someone will be reaching out to you shortly to review and get the details. Thank you for letting us know, we will be in touch soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110899723625310482297", "name": "Sherry Fenn", "time": 1580752717657, "rating": 5.0, "text": "The manager, Tyler, is wonderful to work with.  He is helpful and professional and even remembers me when I come in which is very rare in the service business these days.  The entire staff do their very best and provide me with an accurate wait time.", "pics": null, "resp": {"time": 1539804648060, "text": "Woot woot! Thanks for the 5 stars, Sherry! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111315279537245784430", "name": "Joseph O'Kelley", "time": 1586389140987, "rating": 5.0, "text": "I had a great experience . Helaina definitely made the time go by fast , and was very helpful. That’s why I love coming here!! The people are friendly an they take care of me", "pics": null, "resp": {"time": 1588342758084, "text": "Thanks for the stars! Enjoy the safe road ahead and see ya for your next regular maintenance."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105378241358331887321", "name": "Mr. Tree (MrTeeBuilder)", "time": 1612824703940, "rating": 3.0, "text": "By God how many more tire places do we need around here?", "pics": null, "resp": {"time": 1612872296925, "text": "We definitely care about your experience and middle of the road is no place for us to be. We'd like to connect to learn more about your experience. If possible, please send your full name & preferred method of contact to http://tirediscounters.com/contact. Once received, a member of the team will respond."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109990935923548360651", "name": "Ya Boi", "time": 1601133668569, "rating": 5.0, "text": "Good routine service place with friendly service. Wifi in waiting area.", "pics": null, "resp": {"time": 1602550218324, "text": "Awesome! Glad we were able to take great care of you AND keep you connected! We will see ya again when ya need us!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106520951312318610838", "name": "Mark Kingsley", "time": 1582644103522, "rating": 5.0, "text": "Tyler was great - got my Jeep taken care of with zero issues.  Good group to work with!\n\n2-25-20 Update:  just had new wheels put on my new Sierra.  Tyler was back at it again- found me the exact wheels I had on the truck but in the color I was looking for.  Great deal on the install and it happened quickly......these guys are where it’s at!", "pics": null, "resp": {"time": 1565613068489, "text": "Tyler rocks! Thanks for the stars! We will see you again when ya need us, Mark."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110714702862056657713", "name": "Thomas Plant", "time": 1567038973785, "rating": 5.0, "text": "Brought my car in as it was pulling to the right, they checked the alignment and it was not out.\nThey test drove it and could not duplicate the pull. I insisted that there was a pull, so they rotated the tires.\nI only had a short drive home but I felt a difference, I will find out on the drive to work in the morning.\nThe service was top notch and they were very friendly and professional. The shop and waiting area was very clean.\nI now know where I will take my car from now on.\nI highly recommend this place.", "pics": null, "resp": {"time": 1567177381986, "text": "Awesome! Glad we could get you safely on the road, Thomas. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116115992591604875951", "name": "Danielle Barbee", "time": 1583455732550, "rating": 5.0, "text": "I ran over a nail and rolled in with a flat tire.  Tyler and crew took excellent care of me.  They had my tire repaired and I was out the door in less than an hour.  Everyone I encountered was very helpful and friendly.  I will use these guys again!", "pics": null, "resp": {"time": 1583507389201, "text": "Tyler and the Huntsville team are THE BEST! Sounds like the NAILED it again. Take care and we'll be here when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "101157938708002307264", "name": "Tracey Andersong", "time": 1617749425314, "rating": 5.0, "text": "I really like bringing my car here. Friendly service", "pics": null, "resp": {"time": 1594997557932, "text": "Awww, group hug! We love having you in the TD family, Trevon. Take care and we'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "101087882061824142880", "name": "David Snider", "time": 1573001289928, "rating": 5.0, "text": "This place always provides the best customer service. They have never tried to sell something that is not needed like most places. Tyler runs a great store and the customer service is best I have experienced! Keep up the great work guys!", "pics": null, "resp": {"time": 1539707746035, "text": "Woot woot! Thanks for the 5 stars, David! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "107486589664563484168", "name": "Christopher Kilgore", "time": 1577573296697, "rating": 5.0, "text": "Great people, excellent service, and reasonable pricing. I’ve had a similar experience at another location as well. Company culture seems to be top notch. Thank you for your help with our vehicles.", "pics": null, "resp": {"time": 1577723720032, "text": "For our great customers! We will see you again when you need us, Christopher."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112654536516010248644", "name": "DJ_Ed Mendez", "time": 1610144794556, "rating": 5.0, "text": "Good service and offer.", "pics": null, "resp": {"time": 1610195435832, "text": "Check and CHECK! We are the authority in auto safety, DJ. You've got us for life."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116337902944738910309", "name": "Seth Willis", "time": 1563640907798, "rating": 5.0, "text": "I have been dealing with this store since they opened. I have 4 vehicles, 2 of which are heavily modified. Tyler has always been willing to help when other local shops refused. Always treated me like family and treated my vehicles like they were his. Pricing has always been fair and extremely competitive. All I have to do is call and I have and exact time to be there and they have never missed a deadline with me. Will return for my next services.", "pics": null, "resp": {"time": 1563801245487, "text": "Amazing! Glad we were able to take care of you, Seth. We love having you in the TD family. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103506703807268278723", "name": "Ray Cam", "time": 1581778445142, "rating": 5.0, "text": "Extremely professional shop. Competitive pricing. It's my go to place for tires! I highly recommend!", "pics": null, "resp": {"time": 1582553698505, "text": "Woot Woot!! Thanks so much for the shoutout, Ray!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117332839117847573696", "name": "Jemeana Roberson", "time": 1549299465796, "rating": 5.0, "text": "Customer Service was AWESOME.  The employees were very friendly and courteous, taking care of my tire service needs quickly.  If you are looking for affordable prices on any tires, this is the place to come.  Tire Discounters has impressed me today, saving me both time and money. I am a satisfied customer and will be back.", "pics": null, "resp": {"time": 1549972448754, "text": "Woot Woot!! Thanks so much for the shoutout, Jemeana! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103265933976710507297", "name": "nate owen", "time": 1583434304487, "rating": 5.0, "text": "Guys were all cool, the manager gave me $100 off a full set of great tires just to help me out. Awesome people, awesome service, and very easily the best prices in town.", "pics": null, "resp": {"time": 1583506763300, "text": "Awesome! We rock so you can roll, Nate! See ya in 5000 miles for your 1st of many free lifetime tire care visits. We want to take make sure we take good care of those new puppies."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111487056711355476134", "name": "James Rosenblum", "time": 1576788331441, "rating": 5.0, "text": "I ordered tires through Walmart and got in a bind when they didn't ship properly. Told the TD guy what had happened and what I was looking for and he made me a great deal. Totally recommend.", "pics": null, "resp": {"time": 1577125387332, "text": "Amazing! Glad we were able to take great care of you, James. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "101144651352436186485", "name": "Nigel Lue, MBA", "time": 1578445839996, "rating": 5.0, "text": "Jerome and his team did a great job and had both of my vehicles in and out. Great store and Team!", "pics": null, "resp": {"time": 1578937529422, "text": "Jerome and the crew rock! Take care and we will see ya again when you need us, Nigel."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106201350163575864670", "name": "Jonas B.", "time": 1575475291139, "rating": 5.0, "text": "Nice guys, got me in and out quickly. Customer area was clean and well maintained.  I recommend", "pics": null, "resp": {"time": 1575477974808, "text": "Awesome! Take care and we will see ya again when you need us, Jonas."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "101701581307359764073", "name": "Cody Dusseau", "time": 1581777840445, "rating": 5.0, "text": "Best place for a synthetic oil change not to mention free alignment when you buy 4 tires. Tyler is the man to talk to you won’t be let down!", "pics": null, "resp": {"time": 1582553690609, "text": "Woot Woot!! Thanks so much for the shoutout, Cody!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106291797836175449681", "name": "Brandon B", "time": 1570832006779, "rating": 5.0, "text": "These guys were quick and reasonably priced. We had to leave for FL the day after I started hearing a scrubbing sound when braking in my car. I called around but everyone required an appointment and couldn't get me in until a later date. I spoke to the manager on the phone and he told me to bring it in on for inspection. Found out my pads and rotor were gone on the back breaks. They got it completed in less than 45 minutes. Even though I hated paying the amount, I would definitely recommend.", "pics": null, "resp": {"time": 1571061873877, "text": "Thanks for the positive review, Brandon! Glad we could take great care of you! See ya when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113098641421741038726", "name": "Fatu levi", "time": 1576010074934, "rating": 5.0, "text": "Go see Mike! Great guy and extremely helpful. One of thr best experiences I have ever had.", "pics": null, "resp": {"time": 1576247947468, "text": "Mike rocks! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109475309438736428793", "name": "Kenneth R. Stallings", "time": 1578548889180, "rating": 5.0, "text": "Had all four tires replaced as a walk in. Great service and very clean restrooms!!  A+ rating on first visit, GREAT MEMORABLE EXPERIENCE...🐶", "pics": null, "resp": {"time": 1578937946758, "text": "Woohoo! We will see ya again in 5000 miles for your free rotation, Kenneth."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "118078438045310432421", "name": "DIPYO Much", "time": 1564016483875, "rating": 5.0, "text": "Outstanding service and the technicians did not rush! They paid very close attention to getting the job done right. I had 4 tires changed and the price was well in my budget.", "pics": null, "resp": {"time": 1564058328344, "text": "Amazing! We employ ASE Certified technicians to ensure quality work. Take care and we will see ya again when you need us, John."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112513230607243614302", "name": "Stan D", "time": 1580657034822, "rating": 1.0, "text": "I brought a tire in to have a leaky bead fixed, and was told they couldn't touch it because it was older than 2007, and it was against the law.  Well, I looked it up, there is no such law, state or federal regarding tire repairs regardless of age.  They flat out lied....obviously in an attempt to sell me new tires.  Pretty sad.  Also, their oil changes are wayyyy to expensive.  You can go pretty much anywhere else and save some cash.", "pics": null, "resp": {"time": 1581086667664, "text": "We take the care of our customer's vehicles very seriously. Thank you for informing us, Stan. We want to dig in to learn more about your experience and work to improve going forward. If you could, please send your preferred contact information to support@tirediscounters.com. We look forward to connecting you with a TD team member soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "102292817530019445286", "name": "Swainer (swainer)", "time": 1557174288898, "rating": 5.0, "text": "These guys are incredible. ALL OF THEM! I have always gone to Discount Tires ...up until now.  I have never met a bunch of guys with better customer service than these guys. We had a situation where we were traveling in our BMW i3 and had a blow-out and nobody- not even the BMW dealership in Huntsville had the tire in stock that our car required. Each and every one of them genuinely cared about our situation and never stopped trying to help us figure it out and get us back on the road. These guys went out of there way and took care of us and got what we needed done.  If I even lived in a 50 mile radius of this store and these guys they would have my business all day long. I cant say enough about these guys... it makes me feel really good that there are still people like this on this planet.  Don't go anywhere else, I can promise you that theres nobody else going to take care of you better than they can.", "pics": null, "resp": {"time": 1557326487289, "text": "Yeahhhhhh buddy! Glad we were able to take care of ya, Mark. Take care and we will see ya again when you need us. We love having you in the TD family."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "108069009832329143723", "name": "Tim T", "time": 1574959795354, "rating": 5.0, "text": "They got me in right away and out in less that 40 minutes on a walk in. Two new tires mounted and balance. Great job.", "pics": null, "resp": {"time": 1575041441252, "text": "Keepin' you rollin'! Take care and we will see ya again when you need us, Tim."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104605340504775899659", "name": "Reginald Parks", "time": 1583467587339, "rating": 5.0, "text": "Fast and friendly service! Highly recommend them.", "pics": null, "resp": {"time": 1583507653793, "text": "Woohoo! We love having you in the TD family, Reginald! Take care and we'll be here when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103235167249112208543", "name": "Brian Howell", "time": 1572447961944, "rating": 5.0, "text": "Great first experience. In and out in about an hour. I will definitely be back.", "pics": null, "resp": {"time": 1572529152299, "text": "Keepin' you rollin'! Take care and we will see ya again when you need us, Brian."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "102001257807273583656", "name": "Hannah Mabrey", "time": 1570578193113, "rating": 5.0, "text": "Would highly recommend! My husband and I have been there twice with our cars and had very friendly service with different staff each time.", "pics": null, "resp": {"time": 1570632384225, "text": "Woohoo! Glad we were able to take great care of you and your husband, Hannah. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105842972940727316990", "name": "Brad D", "time": 1602810675253, "rating": 5.0, "text": "Great service and fast!", "pics": null, "resp": {"time": 1602938901379, "text": "Check and check! We love having you in the TD family, B. We'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114687267289219592150", "name": "Richard Cosby", "time": 1591448886408, "rating": 5.0, "text": "They were very helpful and the service was fast.", "pics": null, "resp": {"time": 1592061297910, "text": "Hustle is our middle name, Richard. It just didn't fit on the sign. Take care and we'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117280000817523531110", "name": "Barbara Maidment", "time": 1522813365821, "rating": 5.0, "text": "I visited for an oil change and tire rotation/brake check.  I was favorably impressed with the service, which was done promptly and professionally.  The waiting area was clean and comfortable.  My only suggestion is to offer some other option of drink besides coffee...not everyone drinks coffee/tea.  No big deal, however.  Was a satisfied customer, and will definitely be back!", "pics": null, "resp": {"time": 1539836567036, "text": "Wowzeritos! Thanks for the review, Barbara. We really appreciate the 5 stars and hope to see ya again for any of your tire or auto care needs! Take a look at our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113289033108992205028", "name": "Cedric", "time": 1529777747572, "rating": 5.0, "text": "Extremely exceptional customer service. I will be utilizing their services in the future. This was my first time there due to a tire that needed to be repaired. The service was prompt and the people were friendly. Thanks for a great experience. I was pleasantly surprised.", "pics": null, "resp": {"time": 1539790126659, "text": "Thanks for the 5 stars Cedric! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103758964257566874296", "name": "Johnny Jones", "time": 1583343793395, "rating": 5.0, "text": "Quick courteous service at very competitive prices.", "pics": null, "resp": {"time": 1583508133219, "text": "That's what we like to hear, Johnny! We rock so you can roll! We'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115637713079023687159", "name": "Kendra Brown", "time": 1580830397657, "rating": 5.0, "text": "They are always polite and helpful. Jerome is the best!", "pics": null, "resp": {"time": 1581284175464, "text": "Jerome rocks! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105842972940727316990", "name": "Brad D", "time": 1602810675253, "rating": 5.0, "text": "Great service and fast!", "pics": null, "resp": {"time": 1602938901379, "text": "Check and check! We love having you in the TD family, B. We'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115637713079023687159", "name": "Kendra Brown", "time": 1580830397657, "rating": 5.0, "text": "They are always polite and helpful. Jerome is the best!", "pics": null, "resp": {"time": 1581284175464, "text": "Jerome rocks! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104766965804182693750", "name": "Earl Cox", "time": 1557882035869, "rating": 5.0, "text": "Awesome service and great personnel. And willing to work with you. I highly recommend them for any job.", "pics": null, "resp": {"time": 1558035361576, "text": "Woohoo! Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103758964257566874296", "name": "Johnny Jones", "time": 1583343793395, "rating": 5.0, "text": "Quick courteous service at very competitive prices.", "pics": null, "resp": {"time": 1583508133219, "text": "That's what we like to hear, Johnny! We rock so you can roll! We'll see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106153500692269920310", "name": "Steve Zanussi", "time": 1526125317969, "rating": 5.0, "text": "After noticing at a road stop that there was a bubble on the sidewall of my tire while on a long trip, I went to the closest Tire Discounters I could find.  There I was told that it would be at least three hours to change my tire.  They referred me to this location--8873 Highway 72, Huntsville--several miles away.\n\nUpon entering I was greeted by the General Manager, Tyler Thurmond, who assessed the tire, and notified me that they did not have my tire in stock.  (They did have it in stock at the first place, but they had never checked.)  Tyler told me that it would take an hour and a half to get the tire there, but that once they had it, it could be put on very quickly.\n\nTyler had the delivery of the tire expedited for us, because we mentioned that we had to get up north by a set time.  The entire visit took about 45 minutes, including the delivery of the tire.\n\nThank you so much, Tyler Thurmond, for your exceptional customer service.  If I find myself needing a tire in Huntsville again, I know where I will go.", "pics": null, "resp": {"time": 1539742547355, "text": "Wowzeritos! Thanks for the review, Steve. We really appreciate the 5 stars and hope to see ya again for any of your tire or auto care needs! Take a look at our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117838448821209635029", "name": "Heather Randall", "time": 1537925001331, "rating": 5.0, "text": "I love this place! Took my car to dealership, felt hustled, and left in worse state than I brought it. Came to Tire Discounters. They fixed my balancing, didn't charge me, said to come back when I needed tires. They gained a very loyal customer!!", "pics": null, "resp": {"time": 1538073760187, "text": "We love that you love us! Glad we were able to take care of ya, Heather."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109172421058137489828", "name": "w c", "time": 1537017917478, "rating": 5.0, "text": "The staff was friendly to talk with and provided great service for my new tire purchase. I plan to use this location for all my future oil changes as well. Highly recommend.", "pics": null, "resp": {"time": 1539675528244, "text": "Bazinga! Thanks for the shout out, William. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113412158886417435550", "name": "Matthew M.", "time": 1538619474421, "rating": 5.0, "text": "Tyler and company always go above and beyond.  They care about their customers and have the best prices in town.  They definitely earned a customer for life!", "pics": null, "resp": {"time": 1538697914338, "text": "Tyler and his crew are awesome!! We take customer care to heart! We will see ya again when ya need us, Matthew."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109376102152799789717", "name": "Jeremy Sanders", "time": 1539877674876, "rating": 5.0, "text": "Tyler, Ryan, and the gang are awesome! They always take care of us and our cars. It's like a second family up at Tire Discounters. I'd recommend them to anyone and everyone.", "pics": null, "resp": {"time": 1539884544767, "text": "Tyler, Ryan, and crew and major!! Thanks for being a part of the TD family, Jeremy. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110577993924555160603", "name": "Michele Weber", "time": 1525261782914, "rating": 5.0, "text": "I’ve been here twice, and both times I’ve been really impressed. They replaced my car’s battery, changed the oil, and diagnosed and fixed my air conditioner. They were super quick, and the price was much lower than I anticipated.", "pics": null, "resp": {"time": 1539742666258, "text": "Thanks for the 5 stars, Michele! We'll make sure the Tire Discounters Huntsville crew gets a proper round of high fives! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109205898663438609441", "name": "Sarah Starlin", "time": 1554943905638, "rating": 5.0, "text": "Just wanted to thank you guys so much for fixing my tires with 3 Flippin nails in it. I appreciate the phenomenal customer service that I received by everyone involved!  You guys rock!  I know where I and my family will be coming when we need tires on our cars!  Thank you again!", "pics": null, "resp": {"time": 1555011770377, "text": "Awesome! Glad we were able to take care of ya, Sarah. We love having you and yours in the TD family."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "100839919418403269950", "name": "Brenda Eddy", "time": 1520798333727, "rating": 4.0, "text": "New clean tire place full of business!!! The staff is pleasant, professional and knowledgeable.\nI would have given this place a 5 star but I waited over 2 hours for 2 new tires to be put on.  In their defense, I went on Saturday which is their busiest day.", "pics": null, "resp": {"time": 1539870827412, "text": "Thanks for the stars, Brenda. We’d love to know what we could’ve done to earn that last star to complete the set, if you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109376102152799789717", "name": "Jeremy Sanders", "time": 1539877674876, "rating": 5.0, "text": "Tyler, Ryan, and the gang are awesome! They always take care of us and our cars. It's like a second family up at Tire Discounters. I'd recommend them to anyone and everyone.", "pics": null, "resp": {"time": 1539884544767, "text": "Tyler, Ryan, and crew and major!! Thanks for being a part of the TD family, Jeremy. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116694458022979270984", "name": "Justin Vaughn", "time": 1560615350016, "rating": 5.0, "text": "Waited very little time to get my tires rotated and balanced. Decent pricing also.", "pics": null, "resp": {"time": 1560791382229, "text": "Thanks for the stars! Enjoy the safe road ahead and see ya for your next regular maintenance."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117838448821209635029", "name": "Heather Randall", "time": 1537925001331, "rating": 5.0, "text": "I love this place! Took my car to dealership, felt hustled, and left in worse state than I brought it. Came to Tire Discounters. They fixed my balancing, didn't charge me, said to come back when I needed tires. They gained a very loyal customer!!", "pics": null, "resp": {"time": 1538073760187, "text": "We love that you love us! Glad we were able to take care of ya, Heather."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112545581627422017180", "name": "Austin Zimmerman", "time": 1581708363369, "rating": 5.0, "text": "Awesome place felt like I was at home .", "pics": null, "resp": {"time": 1582553564842, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114823514880881028392", "name": "Brian Pletcher", "time": 1567593007834, "rating": 5.0, "text": "Very courteous and professional.  My second set of tires from this location.  Will keep coming back.", "pics": null, "resp": {"time": 1567602574349, "text": "Woohoo! We will see ya again in 5000 miles for your free rotation."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113412158886417435550", "name": "Matthew M.", "time": 1538619474421, "rating": 5.0, "text": "Tyler and company always go above and beyond.  They care about their customers and have the best prices in town.  They definitely earned a customer for life!", "pics": null, "resp": {"time": 1538697914338, "text": "Tyler and his crew are awesome!! We take customer care to heart! We will see ya again when ya need us, Matthew."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113227616297626985780", "name": "Andrew Brackin", "time": 1568386302336, "rating": 5.0, "text": "Great front desk staff. Great experience. Will be back.", "pics": null, "resp": {"time": 1569249694484, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114823112730723714006", "name": "Chris Baldridge", "time": 1543423328137, "rating": 5.0, "text": "These guys are great! They took great care of both of my vehicles. Ryan is much appreciated and very helpful in his communications!", "pics": null, "resp": {"time": 1543415688223, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112545581627422017180", "name": "Austin Zimmerman", "time": 1581708363369, "rating": 5.0, "text": "Awesome place felt like I was at home .", "pics": null, "resp": {"time": 1582553564842, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113227616297626985780", "name": "Andrew Brackin", "time": 1568386302336, "rating": 5.0, "text": "Great front desk staff. Great experience. Will be back.", "pics": null, "resp": {"time": 1569249694484, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103919995954209349288", "name": "B Banister", "time": 1546124518649, "rating": 5.0, "text": "Very happy with the customer service and workmanship we received when we replaced 4 tires and had an alignment. They had the tires we wanted in stock and had us turned around quickly even though we walked in with no appointment.  We will certainly return in the future.", "pics": null, "resp": {"time": 1546263422785, "text": "Awesome! See ya in 5000 miles for your 1st of many free lifetime tire care visits. We want to take make sure we take good care of those new puppies."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111648490261518271965", "name": "Andrew Smith", "time": 1526487502416, "rating": 1.0, "text": "BUYER BEWARE!  I would recommend to do research on any pricing they give you.  Here is what happened.  Called got a verbal quote of $139-189 per axle for a brake job with rotor's turned which is fair they are just below the dealer which was $200 per axle.  Went the next day to have services done to my car.  Before they began work they inspected it and determine I needed pads all the way and rotor's on the rear and a brake fluid exchange.  Estimate price was over $700.  I declined the brake fluid exchange and they offered some \"competitive\" discounts brought my total down to about $580.  Still more than it should be.  Asked for a printed estimate when I saw the estimate I knew something was up.  They had part numbers and prices on the estimate.  Quick Google search confirmed the part numbers and prices from a local part supply store that they would be getting the parts from.  They are marking up parts pricing 100+%.  Industry standard is between 10-25%.  Then they told me that the estimate was nearly at cost and if he went any lower he would lose his job.  Nothing but scam and scare tactics were used with me and I didn't take the bait.  Tried to email the address on the general managers card it wouldn't ever go through.  Called the corporate office gave them the info and the pictures I have attached here and they said a regional manager would get back with me still have not heard from that person either.  BEWARE OF THIS PLACE AND THE CHECK ANY PRICES THEY GIVE YOU!", "pics": null, "resp": {"time": 1526494624867, "text": "We take pride in our craft and place a great amount of emphasis on pricing ourselves competitively. We are continuously evaluating. We want to dig in to learn more. If you are willing, please send your preferred contact information to support@tirediscounters.com. We look forward to connecting you with a TD team member soon."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109811541241996651176", "name": "Nicole Guyton", "time": 1521675127971, "rating": 5.0, "text": "Excellent customer service ! I was out with my daughter, and the tire light came on pulled in to another facility they said it would be a couple of hours they were busy. I then drove to tire discounters and pulled in to see if I could get air in my tires. The service guy filled up my tires, but informed me I had a nail in one of my tires. Jody and Sarah got my car  straight in to the garage and my tire being fixed.  The customer service that the two of them and there staff showed today helped turn a bad day into a BLESSED DAY. My daughter and I sat for a little bit and before I knew it the tire was repaired. Thanks  guys for helping us out ! We will definitely come back to see you in the future !", "pics": null, "resp": {"time": 1539707146174, "text": "Wowzeritos! Thanks for the review, Nicole. We really appreciate the 5 stars and hope to see ya again for any of your tire or auto care needs! Take a look at our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114879880472061985240", "name": "Al Fischer", "time": 1515509942754, "rating": 5.0, "text": "Very courteous.  Spotted problems quickly and offered multiple solutions that would have my car back on the road as quickly and safely as possible. Great team. I would highly recommend them for all tire services you need.", "pics": null, "resp": {"time": 1515550006842, "text": "Woot! We definitely like to work the problem! Your safety is our always our biggest priority. Just glad we were able to help out, Al. Thanks for taking the time to review and for the recommendation. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112105319499528964131", "name": "Rene Rasmussen", "time": 1591400426321, "rating": 5.0, "text": "Very friendly and great customer service", "pics": null, "resp": {"time": 1591451471632, "text": "Our customer service is second to none, Rene! We love having you in the TD family. You've got us for life!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117039682144878848227", "name": "Chandra Woods", "time": 1541703049447, "rating": 5.0, "text": "Went in and was able to get help right away. They where helpful  and friendly. Waiting area was comfortable and clean.", "pics": null, "resp": {"time": 1541943435396, "text": "Awesome! We will see ya again when ya need us, Chandra."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103975342510256318435", "name": "Paul Rook", "time": 1557859013566, "rating": 5.0, "text": "I had an emergency situation on the road when my tire pressure indicator warned me of low pressure. I found a tire leaking from tread separation and immediately raced to their shop. When I saw some tires that I was interested in on the sales floor, I wasn't comfortable with the price for a new set. But, Tyler got the price down for me and we got them put on. I'm glad they were close by and willing to bargain. I liked the experience so much that I went back the same week for a set of tires on my other car. Their shop is clean and I look forward to going back for rotations, balance jobs, and alignments for the life of my tires.", "pics": null, "resp": {"time": 1539742486339, "text": "Woot woot! Thanks for the 5 stars, Paul! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105921474695093980646", "name": "Jeff York", "time": 1516195457569, "rating": 5.0, "text": "Exceptional customer service!! The people here really care about taking care of the customer and making sure that you're leaving in a safe vehicle. I'll be going to them for everything and sending friends and family there whenever I can.", "pics": null, "resp": {"time": 1539643861999, "text": "Bazinga! Thanks for the shout out, Jeff. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112105319499528964131", "name": "Rene Rasmussen", "time": 1591400426321, "rating": 5.0, "text": "Very friendly and great customer service", "pics": null, "resp": {"time": 1591451471632, "text": "Our customer service is second to none, Rene! We love having you in the TD family. You've got us for life!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105408312780993245369", "name": "Tange Awbrey", "time": 1537636299058, "rating": 1.0, "text": "We have been here multiple times and treated badly every time. The last straw was when the manager promised to take in both of our vehicles in one day. He specifically told us to drop off the first vehicle, then he would take the second one once our first vehicle was finished. When we came to pick up the first car, the same manager acted like we had two heads and told us he couldn't service our second vehicle since they were too busy. It really irritates me when people make promises they can't keep. When we explained why we were upset, we just got brushed off and told to have a nice day. Their customer service is very poor and I will be taking my business to Tire Engineers. I've been treated like a valued customer each time I have visited their locations.", "pics": null, "resp": {"time": 1537821052006, "text": "Thank you for providing feedback, Tange. We appreciate you letting us know that we have a customer service issue that needs our immediate attention. We would love to have more details.  Would you mind please sending your preferred contact information to support@tirediscounters.com? Thanks, hope to connect soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "118314427090375589700", "name": "Patrick Mickle", "time": 1522243297882, "rating": 5.0, "text": "I went there expecting the “regular” tire store and I was wrong. The people there were really outstanding. The manager Jody Carter was the reason that I went back and bought from them. Then the rest of the workers were just as nice and polite. They wanted my business, so they got it.", "pics": null, "resp": {"time": 1539707026215, "text": "Thanks for the 5 stars Patrick! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106192650229397402964", "name": "Wesley Kennedy", "time": 1532724095211, "rating": 5.0, "text": "Great service! Great prices. I will definitely keep doing business with tires discounters...", "pics": null, "resp": {"time": 1539811126705, "text": "Woot woot! Thanks for the 5 stars, Wesley! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106238862246323638706", "name": "Bree k", "time": 1534454657561, "rating": 1.0, "text": "For a discount tire place, $111.17 for one trailer tire is TWICE the price I can get the same tire anywhere else.\nThis place is a rip-off that obviously takes advantage of those NEEDING a tire.\nJust a two mile walk up the road, I was able to get the tire for over half the price 8042 highway 72 is where you should go instead of this place", "pics": null, "resp": {"time": 1534618127884, "text": "We take pride in our craft and place a great amount of emphasis on pricing ourselves competitively. We are continuously evaluating. We want to dig in to learn more. If you are willing, please send your preferred contact information to support@tirediscounters.com. We look forward to connecting you with a TD team member soon."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112337145715253649214", "name": "Todd Bender", "time": 1517675108305, "rating": 5.0, "text": "Excellent service and fast too.  I was given options and treated like a valued customer.  I would definitely recommend Tire Discounters.", "pics": null, "resp": {"time": 1539643802347, "text": "Bazinga! Thanks for the shout out, Todd. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116721007537342095608", "name": "michaela johnson", "time": 1565117530367, "rating": 5.0, "text": "Tyler was a great help fixing my tire.", "pics": null, "resp": {"time": 1565272720218, "text": "Tyler rocks! Glad we could get ya rollin' again, Michaela. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112530211319250542602", "name": "Luke Kinton", "time": 1532569749864, "rating": 3.0, "text": "Not a bad place. Was turned away for an oil change because they were going to close in 30 minutes. Probably not the best way to operate a business. Had a competitor take care of it for me.", "pics": null, "resp": {"time": 1532640609651, "text": "Thanks for alerting us to your experience, Luke. We truly apologize for the inconvenience and we'd like to connect to learn more about your experience as we work to address this with the store. To help further, please send your preferred contact information (including full name) to support@tirediscounters.com. We look forward to connecting you with a TD team member soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110134570876346325980", "name": "Mike Wilcox", "time": 1519807364610, "rating": 5.0, "text": "Didn't try to sell me a bunch of stuff that I didn't need . Good service with friendly staff. I will definitely go back when I am in need of service.", "pics": null, "resp": {"time": 1539707506365, "text": "Thanks for the 5 stars Mike! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109601474697960560563", "name": "Ethan Collins", "time": 1561587261514, "rating": 2.0, "text": "If you need one tire changed and you have 3 hours to kill, this is the place for you. They even had the tire at the location in stock. No other place I have been has service this slow. This will be my last time here.", "pics": null, "resp": {"time": 1562335898617, "text": "We definitely respect your time & take your feedback seriously. Thank you for the alert, Ethan. We do get backed up from time to time, but the team should be providing updates throughout to let you know of any unexpected delays. That being said, we'd like to connect & learn more. If possible, please send your preferred method of contact to support@tirediscounters.com. Once received, a member of the team will reach out. We value your insight and hope to chat soon."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111814776514080456891", "name": "Jeff Burns", "time": 1567694689863, "rating": 5.0, "text": "Great staff, fast service, good price", "pics": null, "resp": {"time": 1567706960387, "text": "High five! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115477354236878967733", "name": "Julie Burns", "time": 1577550916142, "rating": 5.0, "text": "Super nice people very fast service", "pics": null, "resp": {"time": 1577723527420, "text": "Super de duper! Take care and we will see ya again when you need us, Julie."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110134570876346325980", "name": "Mike Wilcox", "time": 1519807364610, "rating": 5.0, "text": "Didn't try to sell me a bunch of stuff that I didn't need . Good service with friendly staff. I will definitely go back when I am in need of service.", "pics": null, "resp": {"time": 1539707506365, "text": "Thanks for the 5 stars Mike! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103719253385701033413", "name": "W J", "time": 1545180164168, "rating": 1.0, "text": "Had an appointment time set, showed up before appointment to find out they cant get me in for the service I had appointment set up for.  Manager on location was not willing to help fix THEIR MISTAKE.  Very unprofessional of this location.  NOT A SATISFIED CUSTOMER AT ALL.  Need to get better Management who can do their jobs.", "pics": null, "resp": {"time": 1545316025425, "text": "We take great pride in the level of service we provide. Thank you for informing us to your appointment. We want to dig in to learn more about your experience and work to improve going forward. If you could, please send your preferred contact information to support@tirediscounters.com. We look forward to connecting you with a TD team member soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110624729509294808672", "name": "G M", "time": 1570495094052, "rating": 5.0, "text": "I have been here several times.  They always provide great service, whether walk in or appointment.", "pics": null, "resp": {"time": 1570548713267, "text": "Awesome! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112337145715253649214", "name": "Todd Bender", "time": 1517675108305, "rating": 5.0, "text": "Excellent service and fast too.  I was given options and treated like a valued customer.  I would definitely recommend Tire Discounters.", "pics": null, "resp": {"time": 1539643802347, "text": "Bazinga! Thanks for the shout out, Todd. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115094095721218338687", "name": "K.L. A", "time": 1583781186003, "rating": 5.0, "text": "Never disappointed when I have my car serviced there. Everyone is always super helpful and treat me above and beyond.", "pics": null, "resp": {"time": 1539706906066, "text": "Thanks for the 5 stars K.l.! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117066463010979971871", "name": "darryl woods", "time": 1533056871503, "rating": 5.0, "text": "This is a place that I would recommend to anyone  the people here are very good at what they do . If you have to wait the waiting room and bathrooms are very clean .Maybe the best thing about this place is you will not be ripped off with a lot of services that you don't need", "pics": null, "resp": {"time": 1539811006989, "text": "We have the best customers! Thanks for the shout out, Darryl. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104404107300805615378", "name": "Dennis Rumbley", "time": 1545524381658, "rating": 5.0, "text": "Excellent service.  Great prices.  Friendly and professional staff.", "pics": null, "resp": {"time": 1545833892615, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109942675764992342029", "name": "Kimberly Hornsby", "time": 1518618214872, "rating": 5.0, "text": "Wonderful service, so pleased with the treatment we received. Jody and Tyler were amazing... THANK YOU !!", "pics": null, "resp": {"time": 1539707866062, "text": "Thanks for the 5 stars, Kimberly! We'll make sure the Tire Discounters Huntsville crew gets a proper round of high fives! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115758150406406591835", "name": "vurjt91", "time": 1530970405789, "rating": 5.0, "text": "Very friendly and professional staff.  Competitive pricing.  Jody was very efficient.", "pics": null, "resp": {"time": 1539790066671, "text": "Awesome! We appreciate the 5 stars and the shout out to the Huntsville crew, Vurjt91. If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "101137429865049530641", "name": "Xavier David Schouten", "time": 1566321223954, "rating": 5.0, "text": "Excellent customer service great experience", "pics": null, "resp": {"time": 1566825991834, "text": "Thanks for the stars! We will see you again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113531793699653906477", "name": "Derek Rushing", "time": 1537200677767, "rating": 5.0, "text": "The manager went above and beyond to make sure I was taken care of a half hour before closing.  I'm very appreciative of all your help Ryan and will definitely recommend this location to others.", "pics": null, "resp": {"time": 1539847307091, "text": "Thanks for the 5 stars Derek! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117653044659346302732", "name": "Caleb Stewart", "time": 1522000757356, "rating": 4.0, "text": "These guys were able to find a rare tire size and went to pick it up to do my truck on thr spot. Great service.", "pics": null, "resp": {"time": 1539870767132, "text": "We really appreciate the stars, Caleb! We are Always looking to improve. Let us know what we could've done to earn that last star. If you ever have any ideas or feedback, let us know at tirediscounters.com/contact or by talking to one of our crew members in Huntsville on your next visit!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "115094095721218338687", "name": "K.L. A", "time": 1583781186003, "rating": 5.0, "text": "Never disappointed when I have my car serviced there. Everyone is always super helpful and treat me above and beyond.", "pics": null, "resp": {"time": 1539706906066, "text": "Thanks for the 5 stars K.l.! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "107427142081631639484", "name": "Johnny Roscoe", "time": 1540325506949, "rating": 5.0, "text": "Best staff, go see Tyler for all your auto needs!", "pics": null, "resp": {"time": 1540397810113, "text": "Tyler is amazing! Take care and we will see ya again when you need us, Johnny."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112274335534828956595", "name": "Patty Ziolkowski", "time": 1565365466622, "rating": 5.0, "text": "Always so friendly and helpful!", "pics": null, "resp": {"time": 1565612825067, "text": "High five! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "102920666856591277832", "name": "James Baker", "time": 1519138826747, "rating": 5.0, "text": "Excellent service! I highly recommend this store for tires and other services.", "pics": null, "resp": {"time": 1539707686032, "text": "Bazinga! Thanks for the shout out, James. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103555419578495564263", "name": "Brian Furber", "time": 1513439358767, "rating": 5.0, "text": "I've had several vehicles worked on since they opened and been very pleased with the service and customer service. Upfront and honest with an A.C. problem and corrected it without buying a new compressor (which is standard at most places).", "pics": null, "resp": {"time": 1513727445027, "text": "Woot! Woot! Thanks for the stars Brian!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105236456239494321665", "name": "Tod Rynders", "time": 1537828531750, "rating": 5.0, "text": "Excellent service, good prices, and a rare genuine honesty.", "pics": null, "resp": {"time": 1538071839580, "text": "We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113854815307624139196", "name": "Abigail Cantrell", "time": 1512149399187, "rating": 3.0, "text": "I haven't actually bought tires here, but I felt a need to add a voice saying for a place called tire Discounters they have ridiculously expensive tires.  They are $100 more for a set of 4 than Goodyears at other stores, and it was an off brand I'd never heard of.  They were almost $200 dollars more than Goodyears at my new favorite tire place if you include the \"free\" alignment.  They told me that includes the warranty and installation, but so does anyone.  I haven't even called Walmart for prices yet, but my point is, do your comparison shopping, and don't believe the name.", "pics": null, "resp": {"time": 1512654046549, "text": "Thanks for the detailed review. We strive to offer competitive pricing and price match when presented with solid advertisements. We must connect and check this out together. If possible, please send your preferred method of contact to support@tirediscounters.com. Once received, someone on the team will reach out right away. We value your insight and hope to chat soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103555419578495564263", "name": "Brian Furber", "time": 1513439358767, "rating": 5.0, "text": "I've had several vehicles worked on since they opened and been very pleased with the service and customer service. Upfront and honest with an A.C. problem and corrected it without buying a new compressor (which is standard at most places).", "pics": null, "resp": {"time": 1513727445027, "text": "Woot! Woot! Thanks for the stars Brian!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "102920666856591277832", "name": "James Baker", "time": 1519138826747, "rating": 5.0, "text": "Excellent service! I highly recommend this store for tires and other services.", "pics": null, "resp": {"time": 1539707686032, "text": "Bazinga! Thanks for the shout out, James. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "106392347288949616014", "name": "Matt Tibbs", "time": 1532021968400, "rating": 4.0, "text": "Best prices in town go see Discount Tires", "pics": null, "resp": {"time": 1539890748663, "text": "Thanks for the stars, Matt. We’d love to know what we could’ve done to earn that last star to complete the set, if you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110424964987056463428", "name": "Rachel Edmondson", "time": 1551300031735, "rating": 5.0, "text": "Thanks Ryan for your best interest!", "pics": null, "resp": {"time": 1551377679262, "text": "Ryan is awesome! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117693452695115883036", "name": "Gail Hall", "time": 1532783112812, "rating": 5.0, "text": "Great guys there! Upbeat, helpful, and professional.", "pics": null, "resp": {"time": 1539811066760, "text": "Thanks for the 5 stars, N.! We'll make sure the Tire Discounters Huntsville crew gets a proper round of high fives! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117498960912929867158", "name": "Rickey Speights", "time": 1531789728350, "rating": 2.0, "text": "Prices too high but good customer service", "pics": null, "resp": {"time": 1531861068840, "text": "We take pride in our craft and place a great amount of emphasis on pricing ourselves competitively. We are continuously evaluating. We want to dig in to learn more. If you ever have any other advice on how we can improve, please send your preferred contact information to support@tirediscounters.com."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117271037886572233726", "name": "Truth Detector", "time": 1517676002445, "rating": 5.0, "text": "Very clean and professional. Got an awesome deal on my tires and alignment!", "pics": null, "resp": {"time": 1539707926110, "text": "Wowzeritos! Thanks for the review, Anthony. We really appreciate the 5 stars and hope to see ya again for any of your tire or auto care needs! Take a look at our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "102917796381484163708", "name": "Lewis DeCarlo", "time": 1528427529317, "rating": 5.0, "text": "Jody is awesome. Great service. Keeps promises!!!", "pics": null, "resp": {"time": 1539775186484, "text": "Woot woot! Thanks for the 5 stars, Lewis! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "100000509035391998381", "name": "Jim Kelly", "time": 1524771783501, "rating": 5.0, "text": "Good Prices and Fast service.  had to get 4 tires for trailer and they had just what I needed", "pics": null, "resp": {"time": 1539742786507, "text": "Thanks for the 5 stars Jim! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "105493557720463242794", "name": "Paul Zapotocki", "time": 1539465438683, "rating": 5.0, "text": "Awesome service!  Thanks guys!", "pics": null, "resp": {"time": 1539610465893, "text": "Bazinga! Thanks for the shout out, Paul. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117799396373597958586", "name": "Chris Hewitt", "time": 1538784158365, "rating": 5.0, "text": "Excellent people to do business with fast service", "pics": null, "resp": {"time": 1539006669937, "text": "Woot Woot!! We will see ya again when ya need us, Chris."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "107865063715472416959", "name": "Mary Zivat", "time": 1594936094360, "rating": 5.0, "text": "Quick service", "pics": null, "resp": {"time": 1539846827091, "text": "Wowzeritos! Thanks for the review, Mary. We really appreciate the 5 stars and hope to see ya again for any of your tire or auto care needs! Take a look at our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "113463429232391147408", "name": "Minsup Lee", "time": 1531176382421, "rating": 5.0, "text": "Very nice service from very kind staffs", "pics": null, "resp": {"time": 1539799966936, "text": "Thanks for the 5 stars Minsup! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103607688571319053451", "name": "Jose Acosta", "time": 1515539249237, "rating": 5.0, "text": "Excelent service and quick. Friendly people.", "pics": null, "resp": {"time": 1539708046099, "text": "Thanks for the 5 stars, Jose! We'll make sure the Tire Discounters Huntsville crew gets a proper round of high fives! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "103126893039756467027", "name": "Tim Gee", "time": 1526779305917, "rating": 5.0, "text": "Great friendly staff and great work.", "pics": null, "resp": {"time": 1539742426380, "text": "Woot woot! Thanks for the 5 stars, Tim! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114243311168485039292", "name": "Brian Smith", "time": 1521308847830, "rating": 5.0, "text": "Friendly staff, professional technicians and a great experience!", "pics": null, "resp": {"time": 1539707206002, "text": "Bazinga! Thanks for the shout out, Brian. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs! You can check out our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117224561595816250752", "name": "Donna Love", "time": 1522797536310, "rating": 5.0, "text": "Fast service good prices", "pics": null, "resp": {"time": 1539706966061, "text": "Awesome! We appreciate the 5 stars and the shout out to the Huntsville crew, Donna. If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111719708001350980444", "name": "Lowell Staton", "time": 1552600240874, "rating": 2.0, "text": "Very overpriced...no help from staff ...30 minutes wait time while 3 members of staff smoked and joked...", "pics": null, "resp": {"time": 1552657999179, "text": "We take great pride in the level of service we provide. This does not sound like the TD way. Thank you for informing us, Lowell. We want to dig in to learn more about your experience and work to improve going forward. If you could, please send your preferred contact information to support@tirediscounters.com. We look forward to connecting you with a TD team member soon!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109609616256795952437", "name": "valerie bryson", "time": 1545937428791, "rating": 5.0, "text": "Very friendly and knowledgeable, cost effective", "pics": null, "resp": {"time": 1546439380307, "text": "Awesome! We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "110913281037030107842", "name": "Chandra Lovelace", "time": 1533402945017, "rating": 5.0, "text": "Wonderful service and great staff!", "pics": null, "resp": {"time": 1539815626868, "text": "Wowzeritos! Thanks for the review, Chandra. We really appreciate the 5 stars and hope to see ya again for any of your tire or auto care needs! Take a look at our full services at https://tirediscounters.com/services"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114918409772140783532", "name": "Greg Bice", "time": 1553374127942, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": {"time": 1553517351655, "text": "For our great customers! We will see you again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109779758827561027484", "name": "Charles Brooks", "time": 1532522705251, "rating": 5.0, "text": "Top professionals; fast, courteous", "pics": null, "resp": {"time": 1539811306695, "text": "Woot woot! Thanks for the 5 stars, Charles! We rock, so you can roll. We will see ya again when ya need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111433949839731880349", "name": "The OneofDaleblackfriendsonTwitter", "time": 1541604018459, "rating": 4.0, "text": "No card reader on the drink machine no excuses it 2018 😂😂😂😂 for that TD, you don't get five stars", "pics": null, "resp": {"time": 1541706508219, "text": "Aw rats! We’d love to know what we could’ve done to earn that last star. If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "104895732585705828738", "name": "Michael Dryer", "time": 1519568685499, "rating": 5.0, "text": "Top of the line prices and experience!!!!", "pics": null, "resp": {"time": 1539707566035, "text": "Thanks for the 5 stars Michael! If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "116398994506435783183", "name": "Bama WeWin", "time": 1576786584812, "rating": 5.0, "text": "Awesome Staff", "pics": null, "resp": {"time": 1577125343220, "text": "Great! Thanks for the review!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "109001097174554570625", "name": "lonnie randall", "time": 1558314165949, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": {"time": 1558698256508, "text": "And we love you!! Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "117950989679192693966", "name": "Jakeoub Jacks", "time": 1520433174178, "rating": 5.0, "text": "Best service ever!", "pics": null, "resp": {"time": 1539707386134, "text": "Awesome! We appreciate the 5 stars and the shout out to the Huntsville crew, Debra. If you ever have any ideas or feedback, let us know at tirediscounters.com/contact"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "112159644957002301079", "name": "Tus Nanda", "time": 1532198918373, "rating": 3.0, "text": "Bad price", "pics": null, "resp": {"time": 1532369618981, "text": "We take pride in our craft and place a great amount of emphasis on pricing ourselves competitively. We are continuously evaluating. We want to dig in to learn more. If you ever have any other advice on how we can improve, please send your preferred contact information to support@tirediscounters.com."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "101294638073822976490", "name": "Griffin Mccurry", "time": 1540652760960, "rating": 5.0, "text": "these guys are solid", "pics": null, "resp": {"time": 1540656619432, "text": "Like a rock. Take care and we will see ya again when you need us."}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "111225530017423044667", "name": "Mark Maxwell", "time": 1536959479748, "rating": 5.0, "text": "Fast and friendly service", "pics": null, "resp": {"time": 1539795106587, "text": "We have the best customers! Thanks for the shout out, Mark. We appreciate the 5 stars. See ya again for any of your tire or car maintenance needs!"}, "gmap_id": "0x8862668977c65a29:0xeebb79333d951abd"}
{"user_id": "114333780922676846776", "name": "Tanycia Philon", "time": 1622229206027, "rating": 1.0, "text": "I brought my 2010 BMW 530i in to have it serviced; might I add I’ve used them numerous times.  I’ve never had a problem with them before.  I received a call saying my cylinder was not performing, and I could come get it because it would need a new motor running me roughly $3k-$4k.  Mind you the guy that helped me was very rude; I asked him what are my options and he said junk it because that’s what I have.  Fast forward twelve months later I  sold the car to a male friend; he had it towed back to Mike & Mike under his name and they replaced the battery and a few minor things for $700.  Ladies please don’t let this happen to you. This was absolutely unbelievable and I really enjoyed how quickly they use to fix my car and get it back to me.  I was truly taken advantage of and lost a good car.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "102036676605782334404", "name": "Jay Hester", "time": 1620653621953, "rating": 5.0, "text": "If you have a Volkswagen, Mike and Mike's is the place to take it for any repairs. They are extremely knowledgeable and friendly. Gary talked with the warranty company and we had our bug back sooner than expected! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "112308709493621432278", "name": "Queen", "time": 1610071510588, "rating": 5.0, "text": "Very welcoming. I loved the experience. I honestly haven’t taken care of my car in so long and just moved to the area. They took care of it like back home. Will be a regular from now on.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "104612228429701270259", "name": "Tristen Blackwood", "time": 1616112940322, "rating": 1.0, "text": "If I could give them a 0 I would I have taken my car to them 5 times I have spent $6000 roughly and still haven't got my car fixed plus it's making new noises. Clutch kit was installed wrong writhed on 4v time and still not right", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "109503612837383056466", "name": "Bethany", "time": 1608075567261, "rating": 1.0, "text": "Steer clear if at all possible. Not a good experience. Paid $200 even though couldn’t fix or diagnose problem after a few weeks. We paid though so we could get our car and didn't argue. We go to pick it up and even though drove the car in, was not able to drive it out. Towed to dealership who then fixed it in a day for $140 and has been driving great ever since. The scary part was Mike and TJ were trying to get it back to their shop from dealership so they could have it in their possession once again and up charge us even though we had already paid them once. Fortunately we paid dealership who fixed it and got it back ourselves before they could. Dealership just shook their heads when they heard what was happening. We felt we shouldn’t have to pay Mike’s towing company since our car was no longer drivable after being in their possession and that also upset them.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "104899963857731643763", "name": "Ron Ross", "time": 1619820481279, "rating": 5.0, "text": "Repairs done fast and at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "106596472859637810251", "name": "Corey Eddins", "time": 1600192145776, "rating": 1.0, "text": "Had a full tank of gas when I dropped my car off for repair. When I picked my car up after they were \"Finished\", my gas tank was almost on Empty. Plus they tried to charge me $600.00 just to put a Mercedes car battery in. I took my car to an actual Mercedes shop and they only charged me $200.00. I thought these people at Mike and mike's were good people, but nope🥀.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "110290205171811312584", "name": "Angel", "time": 1583513168717, "rating": 5.0, "text": "This is my first time at Mike & Mike's and I am so glad I found this place! The google maps directions took me to the wrong place but when I called, they were very friendly and helped to get me where I needed to be. Mike's prices are fair, the mechanic, TJ was very nice, and they are quick to offer less expensive options for repairs if a replacement is not necessary. Will definitely be coming back for future car care and maintenance!", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "115443979897926291379", "name": "Joseph Traffanstedt", "time": 1582909381569, "rating": 5.0, "text": "They are a good auto shop. Quality work, reasonably fast, and friendly. Had 3 repairs done there so far. Each time work was done in 2 days and fixed properly. Seem to be really honest and good people.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "117478062381824577837", "name": "Rod Johnson", "time": 1604079976839, "rating": 1.0, "text": "Reached out to get quote regarding fixing my Ford 150 exhaust. I advised someone will contact me back but haven't heard anything since then. Thats been over 3 weeks", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "111611474053469693933", "name": "Shantrice Hadley", "time": 1602284327344, "rating": 5.0, "text": "Great Customer Service and always willing to help!!", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "103484549467299946333", "name": "Busta Smith", "time": 1554818901061, "rating": 1.0, "text": "I called a day before and explained i may have an exhaust leak and would like to make an appointment to fix it. They were nice and said they can look at it. Told me they're usually not swamped and just bring it in any time the next day. I show up the next day and they tell me immediately that they can't work on my car (without even looking at it or asking what car i have) because they don't work on exhausts. But their website claims they're experts and they specialize in German cars. Can't really specialize in something if you're not able to fix exhausts?  I don't know if seeing me in person, not the car, has anything to do with the service (or lack of) I was provided.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "109644033929317994505", "name": "John Allen Dees", "time": 1570831032385, "rating": 5.0, "text": "Honest, fair, polite, and quick turnaround.  Can’t ask more from an auto service center. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "116233463702776046959", "name": "Thomas Whitten", "time": 1573522080024, "rating": 5.0, "text": "Awesome service. Priced right and quick.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "118191374422791217159", "name": "Michael Sulprizio", "time": 1546135396823, "rating": 5.0, "text": "I found Mike& Mikes by doing a Google map search, which will go down as one of my best finds via google maps EVER. M&Ms fixed an ongoing issue i had for months & was around $150 cheaper from other shops around the area.  Thanks for taking car of my car...", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "108960186532086264063", "name": "Valerie T Porter", "time": 1446580768570, "rating": 5.0, "text": "The absolute best experience you will have with a mechanic. Mike and his staff are extremely knowledgeable, while being fair with his pricing. I am a New Yorker, but have known Mike for at least 10 years, and I would not let anyone else touch my 2006 Volkswagen Passat except Mike. For me and my car, Mike & Mike is the best mechanic in Birmingham. (no, I am not, a paid reviewer.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "114116595439154542104", "name": "Foster David", "time": 1598653930747, "rating": 5.0, "text": "These guys are nothing short of the best.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "114075508103934587162", "name": "Dean Ethridge", "time": 1431974972628, "rating": 5.0, "text": "Mike and Mike's is where I will always take my vehicles.  They do a great job and get us in and out of there typically in the same day.  Very knowledgeable staff that are factory certified to work on BMW, Mercedes, Volkswagen and Audi.  They work on domestic too but very satisfied with the work they've done for us.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "104499090820633222820", "name": "S Underwood", "time": 1531863145165, "rating": 5.0, "text": "I called very upset when my car wouldn’t go into gear and I was stranded an hour and a half away from home. The gentlemen was very kind over the phone and sent someone to help me. The mechanic that came to help was very nice and honest. He explained the problem, got me calmed down, and back on the road.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "114075508103934587162", "name": "Dean Ethridge", "time": 1431974972628, "rating": 5.0, "text": "Mike and Mike's is where I will always take my vehicles.  They do a great job and get us in and out of there typically in the same day.  Very knowledgeable staff that are factory certified to work on BMW, Mercedes, Volkswagen and Audi.  They work on domestic too but very satisfied with the work they've done for us.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "116824583534920028945", "name": "Terry Long", "time": 1446578696106, "rating": 5.0, "text": "I had a drive shaft hanger go out on my Volkswagen Touareg, around 11:00am. I contacted Mike and Mike's they had me bring it in to them (did I mention that this was a Friday?) the diagnosed the problem, ordered new parts, negotiated with my extend warranty provider, made my brother and I feel confortable waiting in the shop and, had my repairs done before 5:00pm. I have since spoken with people that have used them for repairs and all I've heard is great things about them.\n\nThanks for the great work guys", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "114016188878735763318", "name": "Mo'Nique Martin", "time": 1499031674283, "rating": 5.0, "text": "Everytime I needed service on my car, they would give me the best prices,  the best service. Quick and fast with your car. Tell you everything that's wrong with it and they know how to get the job done. Best autoshop in Alabama that I know of.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "101029366999327577255", "name": "Elizabeth Rogers", "time": 1456330890571, "rating": 5.0, "text": "Mike has been my trusted go-to mechanic for many years. He helped me initially with repairs for my Volkswagen Jetta and now is helping me with my Subaru Outback. Mike has even gone out of his way to check what is wrong and give me a quote before proceeding with the repairs. I regularly recommend Mike to friends and coworkers.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "112935779426112985906", "name": "Steve Forsyth", "time": 1516469799909, "rating": 5.0, "text": "Do not take your car anyplace except to Mike and Mikes.  Mike is a fantastic mechanic and a great guy.  Mikes is even better!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1300134867120, "rating": 5.0, "text": "Mike is a great guy. Cares about his clients and does awesome work. Saved me half off what the dealership charged and his is Volkswagon certified!", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "113320559805605450861", "name": "Donna McCrindle", "time": 1527806121488, "rating": 3.0, "text": "Good people. Fixed the car tho it took two trips.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "109466442743348151786", "name": "Evelyn Bain", "time": 1554585098358, "rating": 5.0, "text": "I had to take my car to them on a Friday to get the starter replaced and when the delivery for the part ended up not getting there until closing time they went above and beyond all expectations to make sure that I had my car back for the weekend.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "103443925705334032713", "name": "Rodney Evans", "time": 1527006877876, "rating": 5.0, "text": "Very professional and quality work! Wouldn’t use anyone else!", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "104418588438052988010", "name": "James Ryan", "time": 1497712929964, "rating": 5.0, "text": "They are very friendly and helpful at the vehicles that they are working on and are very reasonable priced", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "108845992330184915334", "name": "William Perry", "time": 1564167070795, "rating": 4.0, "text": "I had my car repaired there and other places didn't get it fixed", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "108091290489290161169", "name": "M May", "time": 1499694468572, "rating": 5.0, "text": "Several years ago they worked on my Kenworth tractor. They were always very helpful.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "104157990731626679324", "name": "Derma Laser Clinic", "time": 1424835640582, "rating": 5.0, "text": "We have a BMW and Mike and Mike's saves us over half of what the dealer charges.  They do great work too", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "106960444554850787718", "name": "Denson Parker", "time": 1480513058280, "rating": 5.0, "text": "Best place in Birmingham to get work done on your car.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "106188221592338997282", "name": "Joel Haskins", "time": 1483538723412, "rating": 5.0, "text": "These guys work great with you and do good job", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "109699547352026612483", "name": "Kerri O'Brien", "time": 1471007174911, "rating": 5.0, "text": "Fast and friendly service.   Mike is great.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "114184511928247515605", "name": "thomas schweitzer", "time": 1562339480659, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "109804880255419731076", "name": "Kristi Martin", "time": 1489096231680, "rating": 5.0, "text": "Found the problem with my car and I'll be back on the road", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
{"user_id": "109360350495698706953", "name": "brent portera", "time": 1387470904032, "rating": 5.0, "text": "these are fantastic people to do business with a+.", "pics": null, "resp": null, "gmap_id": "0x888923f349d4e089:0xf085213884bffe3f"}
