{"user_id": "115927414020738179742", "name": "Brooklyn H", "time": 1610671548934, "rating": 5.0, "text": "I was recommended and I myself, would recommend. It took about 2 1/2 weeks to get everything we NEEDED done. they were very upfront about the cost, how long it would take, and gave us a run down of everything that needed repaired & basically a general overview. We got what we originally came for the first week & after they noticed a few minor issues, we had them fixed within the next week. Still needs work but they got us up and running! they recommend affordable places to buy parts as well. I am confident that this business will give you the best work and if they feel they can’t, they will recommend you somewhere that can!", "pics": null, "resp": {"time": 1612480096030, "text": "Thank you"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117946577260122656452", "name": "Bloody Hatchetz", "time": 1617395058941, "rating": 1.0, "text": "Had a vehicle towed from my house to Integrity cause of it not running . This car didn't have much problems only needed parts put on that I already had that I stored in car . My car sat in there parking lot for 2 weeks and was not touched by them . I did call them 3 times asking for any updates and was told by them  it would be done on a Monday . I waited till Friday of same week and got fed up on waiting . I had another shop come with there towing truck . I would not recommend  Integrity ! They are also rude as I was only wanting updates.  They told me if I could do it faster then come get it so I did .", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108534847403383658855", "name": "PB and J Aquatics", "time": 1628230288298, "rating": 1.0, "text": "They lie and delay.  Don't take your vehicle there if you expect to use it for several months .  Mine sat there so long that mice made a nest in the wiring harness.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105307606696602897258", "name": "alice gaylor", "time": 1599863684959, "rating": 5.0, "text": "I am purchasing a new (used) vehicle that is in need of some repairs and Integrity is where the car lot took it to be serviced. I stopped by today (my first time ever being there) to check on the progress and was VERY impressed. Although my car isn't ready, Ryan and a couple of other employees were SO helpful and informative about everything going on with it. I never felt rushed or like I was being a burden for stopping by. As a matter of fact, they were trying to get the air in my truck going for me so I would have AC until my car gets fixed!! Unfortunately it wasn't able to be fixed but just the kindness and courtesy these guys showed was refreshing!!! I will definitely be using them for my go to shop from now on!!\n\n****Updated Review****\n\nHUGE shout out to the employees at Integrity!!! All the way from Robert, to Liz, Brian, and Doug.....you guys absolutely rock!!!!! Not only have you guys fixed the original car issues, but you helped me get the other things taken car of as well. I was greeted with a smile and excellent customer service EVERY time I stopped in and have nothing but praise for you guys!! Thanks so much for everything!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "100977011363706017397", "name": "Jamie Allison", "time": 1616539228122, "rating": 1.0, "text": "well they lie a lot and they just don’t do good business so I do not recommend I hope whoever sees this goes to someone better do not trust them up there we had our car up there and they messed everything up so just go to someone better🙂", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "112083976705522191180", "name": "Draco Palioxis", "time": 1612286405889, "rating": 1.0, "text": "I had my car taken up here to get the Rack and Pinion and 2 rims fixed. They did all this unnecessary work like fix my bumper that wasnt broken and repainted my car for no reason. I have had this car in there for about a month now and I finally get a call from my insurance, NOT THE COMPANY MY CAR IS WITH, telling me that my car was totaled. And now I have no car in order to do my job in anymore. I highly would not recommend this place for any sort of repairs or fixing of your vehicles.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117187025503744171904", "name": "Mark Lanier", "time": 1603725176756, "rating": 5.0, "text": "5 star service. They will have all my vehicle maintenance work from here on out. I had my truck towed to them they had the problem diagnosed and fixed by the next afternoon. They called and let me know what was going on and what it would take to fix before doing anything. They took all my warranty so my cost was just the deductible from my warranty. Great people and customer service.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101987308529494115763", "name": "Josh Mckleroy", "time": 1607955956486, "rating": 1.0, "text": "Had transmission rebuilt in September of 2019 had to take it back 2 days later because it was leaking fluid where the transmission bolts to the transfer case. Then around Christmas I realized the 4 wheel drive didn't work called up there and was told someone would call me back and they never did and done this multiple times for the next year and in November 2020 the transmission has went completely out after 14 months and 16000 miles owner blocked me on social media because he knows he has done wrong and hopefully by sharing my experience I can save someone the hassle and money so they don't waste $1800 like it did", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101102728045700930344", "name": "P M", "time": 1608480028674, "rating": 1.0, "text": "Not sure why the rating for this business is so high. As a mechanic I can say that I have seen some terrible work come from this shop, and I have seen some very upset customers who have lost thousands of dollars by trusting these guys. I’m making this post because today I ran across a third car they “worked on” and for the third time the repair they performed was unnecessary, and did not fix the issue. And for the second time, the work they did actually caused additional issues.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "110546456501581556322", "name": "Karen Patterson", "time": 1594611551200, "rating": 5.0, "text": "Super place too have work done on your car! Friendly, helpful staff and the work performed  is always priced reasonably and completed in a good time frame. I only have 1 vehicle so I can't wait several days or more for my car to be repaired. I've used Integrity for a couple of years now and am always satisfied with the quality of the work performed and the cost for same.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113490179763894716615", "name": "Chris Holmes", "time": 1591890932482, "rating": 5.0, "text": "This morning I dropped off my car at 9 by 1030 they had my oil changed and air fixed.  I was a walk in and was blown away by their customer service.  There was no profanity or nasty jokes that you typically hear at a shop. They truly live up to their name. They also fixed my blinker for free. Hands down best place to work on your vehicle. I want be going anywhere else from now on. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103562021808295369602", "name": "Anthony Durante", "time": 1622816894434, "rating": 5.0, "text": "They do a real  good job!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "114470736595923645702", "name": "Beth Condit", "time": 1600280833868, "rating": 2.0, "text": "The people were very nice but we were charged over $1000 and we still had the issue when we picked the truck up. When we went back in they told us it was something else and would cost over $400 to get that repair done. They misdiagnosed the issue and wanted us to pay for another costly repair. I will not be using them again. They also did not disclose there is a 4% charge for using a credit card until after the repair was done.", "pics": null, "resp": {"time": 1600302077724, "text": "Not true at all. Your truck needed a new rack , alignment and brakes was gone on the front. I talk to your husband and told him after we fix the know problems we found you also needed a clock spring. And as far as the charge on the credit card company I also talk to your husband about that. Their are signs in the service department hanging and on back of the computes about credit card company.\nI'm sorry you feel the way you do. We could have fixed the clock spring but also talked to your husband about that.\nMy name is Robert I'm the owner of the shop I'm asking you to give me a call about this 2567354000\nWe can only fix what the customers allow us to fix.\nGood thing is still have front rotors and pads that was on truck and the rack also so your more than welcome to come see them."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109636035817345544086", "name": "Amber Jones", "time": 1582958345948, "rating": 2.0, "text": "We used them one time to get a radiator hose replaced. They told us they would also do a full inspection and call us to let us know if there was or wasn't anything else found. Never heard from anyone. Figured maybe they got busy and we just let it go. Just last week we figured let's give them another shot because the service was great last time.... My husband called to find out how much brakes and rotors would cost us and they told him they would call him back with that info.... We never heard from them. Customer service isn't the greatest. Friendly service in person. Just don't expect a call back.", "pics": null, "resp": {"time": 1583161554056, "text": "I'm sorry for not getting a call back. We are down 2 people in service department.  Can't find help. I know that is no excuse but I hope you come back and give us another chance.\nIf you have any other problems please call me Robert Taylor 256 735 6808 my personal cell"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "104037884005103972276", "name": "Loris the win", "time": 1580474442163, "rating": 5.0, "text": "I went to integrity auto on yesterday because I was scared. I’m a single mom trying to provide for her family. This vehicle is my lifeline to work, food, church and pleasure. My engine light came on 11 days ago. I called them and the guy got me in there Immediately, took care of me ASAP, fixed the problem and sent me on my way. Christian based facility.... you guys and gals are God SENT!!! You rock.🤩🤩 I love me sum Integrity Automotive!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113519040564980256441", "name": "Susan Comperda", "time": 1601305596667, "rating": 5.0, "text": "Our van broke down In Cullman while traveling from Huntsville to Birmingham. We were lucky to stumble upon Integrity. The local Enterprise has closed down so we had to rent a Uhaul to travel to Birmingham. The owner happily drove us to the local Uhaul and his team got to work on our vehicle. Thank you for going above and beyond!", "pics": null, "resp": {"time": 1602681517787, "text": "Thanks for the kind words"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106608397956901324448", "name": "danielle johnson", "time": 1571410121926, "rating": 5.0, "text": "EXCELLENT CUSTOMER SERVICE!! Highly satisfied with my visit. As a woman, most shops will try to take advantage but not this place. Everyone, from the mechanics to the customer service desk, was so kind. The mechanics took the time to explain what needed to be done to fix my car and even showed me what was wrong. I really appreciated that. I had to stay at the shop while they fixed my car, they knew I needed to get home by a certain time and they made sure to get me back on the road in that time frame. I will never go anywhere else. My encounter with everyone who works there definitely lived up to the business name. Thank you Integrity!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109148432632154225680", "name": "Marilyn Stewart", "time": 1590752900504, "rating": 5.0, "text": "So thankful to find a trustworthy place for vehicle repairs.  Nicest people you could ever deal with. Quality work.  Will surely use for all repairs.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "114772139006624495426", "name": "Eric Trahan", "time": 1590799350693, "rating": 5.0, "text": "My car died on the interstate. I called them and they had it towed to the shop. Timing belt broke. They are going to replace the engine which is going to be expensive but they are working with me on that. Everyone I've talked to had treated me with respect and have been very pleasant. I'll update this review when I get my car back.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111923116593138532465", "name": "Kelsie West", "time": 1585572986966, "rating": 1.0, "text": "My husband took his truck here explaining the problem to begin with, when it was dropped off. $3,400 dollars later and over at the least one month later and that problem was never fixed (was not told that until pickup today) along with after picking it up smoke came from the tail pipe and the air conditioner is not blowing cold even though they took it upon themselves to service the AC and charging $89 for that without notice. Neither of those problems were occurring prior to dropping it off. Needless to say, the truck was dropped back off to them within 30 minutes of pickup. We will be speaking with the so called mechanic on Monday. They also have problems with taking and returning calls. The only good thing I can say is that the owner Robert was nice and friendly. Let’s just see if they can make this right and I will come back and edit this post. But for now I DO NOT RECOMMEND THIS SHOP, PERIOD.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103264852874076298757", "name": "Tiffani Johnson", "time": 1575567268301, "rating": 5.0, "text": "I can't say enough good things about this company! Awesome experience with them, they replaced front rotors and brake pads on our car. They were VERY honest through the whole process. Was in and out within an hour, they didn't gouge us either! Highly, highly recommend them for any of your automotive needs!", "pics": null, "resp": {"time": 1575571040125, "text": "Thank you so much and for your business to our shop."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "116089505486807941455", "name": "The Smith’s", "time": 1594735790142, "rating": 1.0, "text": "Run! I took my car in for a noise on with my passenger side, water coming into my floorboard and ac not cooling. They charged my extended warranty over $1700 to redo my ac and I paid another $1200 for my front end work. The first week I had my car back it started making an awful noise. I took my car to another mechanic and he found that Integrity put no bolts in one of my brakes and it fell behind the caliber. The mechanic said he couldn’t believe I didn’t have an accident. I took it back in 6/15 due to the ac pouring water and still having a front end noise. They had my car until the afternoon of the 19th and said they had everything fixed. We left for vacation the 20th and half way to our destination the ac started pouring water in the passenger floorboard when it’s on. I’ve had my car back since the 19th of June but it’s sat in my barn the past 3 weeks. My transmission light is now on and it won’t shift gears. I had ABSOLUTELY NO problems with my transmission prior to my car going there and my AC now leaks constantly. I’m to the point of getting an attorney. I saw it was a veteran owned business and being that my husband is a veteran as well, I thought it would be great to support them. This is the biggest mistake I could have made.", "pics": null, "resp": {"time": 1594814170481, "text": "Fake customer"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108444714933658089969", "name": "James Turner", "time": 1593016754656, "rating": 5.0, "text": "Was exactly what mechanic said it was no more...very reasonably priced no hassle  in and out very pleased with time line will do all my work there", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "116196028868161014469", "name": "James Bice", "time": 1589678151959, "rating": 5.0, "text": "They did an outstanding job working on my car they got it running right and did an oil change and time up plus the best part they came in on a Saturday morning when they was closed just to work on my car now that is customer service they will always have my business", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108320762845515347422", "name": "South Cullman", "time": 1570026693998, "rating": 5.0, "text": "I normally am very picking about my car. I brought it up there on my lunch break to have my oil changed and they got my car straight back. I was pleased with the service. Everyone was VERY friendly. Doug at the desk talked to me on the phone and had the guy waiting for me to get there. He was super polite when I got there and made sure everything was taken care of. The guy that changed my oil was very friendly. I felt right at home. Great place overall. All the guys in the shop are great!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106612345036299403609", "name": "Brittany Sterling", "time": 1617407997783, "rating": 1.0, "text": "My husband used this place and they are very rude and unprofessional !", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "100115261399114892742", "name": "Garrett Bowers", "time": 1569983818786, "rating": 5.0, "text": "Had my daughters 01 explorer fixed by Doug canter and the guys at integrity auto a few months ago. Car runs like a top would recommend this company to anyone. Fair price and great service", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106573828271238136973", "name": "Greg Talks", "time": 1570034149148, "rating": 5.0, "text": "These guys took my car that I thought couldn’t be fixed inside their body shop and made it look like new! They were able to use a lot of the same parts so I didn’t have to spend a lot of money for new parts. They’re fast, efficient, and economical!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113065218356124908278", "name": "Tammy Allums", "time": 1591213207007, "rating": 5.0, "text": "I have used them several times and they always take me on short notice and get me in and out in a reasonable time. They are very nice and pleasant to deal with.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113131351401105436597", "name": "Bobby Hudson", "time": 1570119557762, "rating": 5.0, "text": "No matter what problem big or small I am having with any of my vehicles, Ryan and Doug have always came through for me and even the mechanics help explain the problem and the solution for it. I recommend these guys to anyone especially my friends and family because I know all the guys at Integrity will treat them with respect. Honest service writers and mechanics that truly live up to the name Integrity Auto Group", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "107606174768426633402", "name": "Lisa Bates", "time": 1591330180973, "rating": 5.0, "text": "Very very friendly people. I will only take my car to them from now on. Great service they all make you feel at home.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101012738491177297458", "name": "SFW CEO", "time": 1569792323955, "rating": 5.0, "text": "A company for the community! We use them for all our work on the vehicles we have donated. Robert Taylor Jr. Is a standup guy and loves giving back to his customers and community!\n\nThere paint and  body shop have some of the best in the business painting small cars, restores and big rigs! They have one of our jeeps painting it now and have done a great job!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109021648925326872878", "name": "Stephanie Hill", "time": 1582327739429, "rating": 5.0, "text": "Great place for all your car's needs! Ask for Dixie! She is awesome! Will help you with anything you need! Love her!!❤❤", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102011626655809480553", "name": "Alicia Powe", "time": 1583450092035, "rating": 5.0, "text": "Integrity treated my parents exceptional by helping repair their 2010 Chey Equinox. After several attempts to fix it at other places, Integrity fixed the transmission with a 1 year warranty and replaced a bad axel.  Providing financing and everyone was extremely friendly😊Thank you Integrity! 🙌 💯", "pics": null, "resp": {"time": 1583460293847, "text": "Thank you. Your mom and dad we sweets hearts"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101374140641377567890", "name": "tommy smith", "time": 1578443308872, "rating": 1.0, "text": "Had my car at Integrity Auto for 4 days at $493. Picked it up after hours and when backing out of the parking spot, realized it was doing exactly what I brought it to the shop for. Took it to another mechanic shop who within an hour told me what was wrong with it and it did not need the parts that was put on. So $493 in unnecessary parts. Tried numerous times to talk with them about this but can’t seem to get a return phone call. Bad thing is I actually have known and used them for a long time but not anymore. I bet my phone will ring now.", "pics": null, "resp": {"time": 1579566048335, "text": "Talk talk with Tommy and this has been took care of."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "107608792829790372440", "name": "Samantha Best", "time": 1570024527856, "rating": 5.0, "text": "Best service in town. They get you in and out in no time. Very friendly honest and reliable people. Please go see them for all your repairs,I promise you will be satisfied that’s a guarantee.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105634541545585913955", "name": "Annette Munger", "time": 1588116712230, "rating": 5.0, "text": "Thank you to the guys at Integrity! You made my life easier by coming and getting my truck for brakes and tires.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105792025709245880648", "name": "Elizabeth Speegle", "time": 1570306129312, "rating": 5.0, "text": "We have used Integrity on several occasions. Fast response time. Gentlemen are helpful and have car back to you in a reasonable time table... Helpful owner and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113781800995312981559", "name": "Amy Canter", "time": 1570223232098, "rating": 5.0, "text": "This place is amazing! They were able to work me in with a short notice for my air conditioning. One thing I noticed was that 3 women came in behind me and they were great with them and didn’t try to overcharge them. I will be back!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113768169355454440565", "name": "Judy Lowery", "time": 1590092732385, "rating": 5.0, "text": "Honest and GREAT service. Friendly people from the owner to the employees   I will only take my car to them", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108320142077145027575", "name": "Tim Bliss", "time": 1580951258541, "rating": 5.0, "text": "This place is great!! They offer the best personalized service at the absolute lowest price.", "pics": null, "resp": {"time": 1580954974171, "text": "Thanks Tim please help us get the word out about Integrity Auto Group"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "104785464287261436677", "name": "Heather O'Rear", "time": 1569984038282, "rating": 5.0, "text": "Great shop with great people.  Big shout out to Doug for explaining everything and giving best prices he could! Will recommend to friends and family!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102941823268649512013", "name": "Tanya Lynn", "time": 1589374679077, "rating": 5.0, "text": "Very nice and very helpful. Will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102126227903431085795", "name": "Christopher Sumners", "time": 1583874268824, "rating": 5.0, "text": "This is the best place in Cullman. If you know what you need done or need help to figure it out. Integrity got it for you.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111276965054065646121", "name": "Misty Teets", "time": 1587818461439, "rating": 5.0, "text": "I called on a Thursday evening he fit me in on Friday installed a water pump and thermostat for me at a great price and an amazing turn around team I recommend these guys hands down and will be using them again", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113096537095453174017", "name": "Nicole Jett", "time": 1587233553191, "rating": 5.0, "text": "These guys go above and beyond to provide excellent service at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111006243486838453858", "name": "Aj Rapper", "time": 1579624376277, "rating": 5.0, "text": "They have excellent customer service...fast in friendly in they will work with you to get the job done.definetly are out go to place for all our car needs", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113409776231396598981", "name": "Visual Lacey", "time": 1570027645002, "rating": 5.0, "text": "Great group of guys to work on any of your vehicles. They Always get me what I need for less than anyone else around, and always get me in immediately with no wait. Couldn’t say better things about this business!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117402509284642254613", "name": "Integrity Auto Group", "time": 1569689853900, "rating": 5.0, "text": "This place is the best . Always the best service and price in Cullman. Transmission service and rebuild is out of this world.\nVery Honest they don't try to up sale you on everything.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102481278105347684800", "name": "Richard Jones", "time": 1591314548929, "rating": 5.0, "text": "I cant see taking my vehicles anywhere else! Always prompt friendly service with very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "101482812789613436512", "name": "April German", "time": 1570107308818, "rating": 5.0, "text": "Honest people and great place to bring your car! Does a lot for our community as well. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109419204410439633610", "name": "Rhys Battles", "time": 1570024280737, "rating": 5.0, "text": "Friendly service. Goes beyond what the customer expects. I know the owner and many of the workers have stayed well past 5 to help the customer get where they need to go", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "118241204465395016155", "name": "Nakki Kane", "time": 1569982539806, "rating": 5.0, "text": "Doug Canter is amazing, especially for younger females that don’t know anything about mechanics. He did an excellent job at explaining things in terms that I could understand without making me feel dumb. I couldn’t recommend a better person to see for all things vehicle related.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "107983955367686521206", "name": "Brandy Hayes", "time": 1570059308519, "rating": 5.0, "text": "Great honest and dependable shop. They have done all the repairs to our 2 vehicles. I wouldn’t recommended anyone else!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117655877852396495372", "name": "Hannah Stewart", "time": 1571915942599, "rating": 5.0, "text": "Very very nice people will break their back to help anyone in need! They’ll work around and try to actually help you! I highly recommend them!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "118165667113133082860", "name": "Amy Glimpse", "time": 1583259850633, "rating": 5.0, "text": "Friendly and courteous service... Thanks for a job well done!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111334677080284608874", "name": "Kim Carwell", "time": 1570031517503, "rating": 5.0, "text": "Integrity, has been great for me as a female it is hard for us to find a shop that will be honest.  I recommend Integrity, to all females and veterans it has been great for me and I would go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106192196530578669948", "name": "Marie Arwood", "time": 1572544591920, "rating": 5.0, "text": "I’m proud that Mr Taylor made the decision to allow his employees to enroll in Aflac! It really shows he cares about his employees and business.\nI would most definately recommend Integrity Auto Group for all your automotive needs!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "110277180598036231722", "name": "Rachel Pace", "time": 1578329949073, "rating": 5.0, "text": "Very friendly and honest group. Will definitely come back", "pics": null, "resp": {"time": 1578355322070, "text": "Thank you"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113679084727670014001", "name": "Kelly Best", "time": 1569850614614, "rating": 5.0, "text": "Thank you integrity Auto group for fixing Renee Beasley's car and getting her back on the road y'all done a fantastic great job", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117427242223950481440", "name": "Kesha Sandlin", "time": 1569982471015, "rating": 5.0, "text": "They did a customer appreciation day over the summer an i got a free oil change Doug had me in an out in no time", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117153234213934009171", "name": "Local 360", "time": 1578434819127, "rating": 5.0, "text": "Great job changing plugs & distributors quickly & within budget on my Ford F150", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113224337498794965676", "name": "Daniela Bartlett", "time": 1591052716440, "rating": 5.0, "text": "Love these guys. Always accommodating and professional!!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105399515709526425627", "name": "Mandi Easterwood", "time": 1579364834017, "rating": 5.0, "text": "My husband and myself both have had our brake pads and rotors replaced here. Excellent  and friendly  service.Also received excellent customer service from Dixie Hall.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "108986498321698519941", "name": "Tripp Taylor", "time": 1569790859146, "rating": 5.0, "text": "Great place to take your vehicle! Great customer service and lowest prices!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "102931522824334837529", "name": "Michael Doc Elston", "time": 1573481560143, "rating": 5.0, "text": "A very polite and skilled group of mechanics. I will be returning here.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106024784551230112935", "name": "misty cason", "time": 1570025692220, "rating": 5.0, "text": "They are great people and are very friendly and will do everything they can to help u..", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111908320358589504600", "name": "Doug Canter", "time": 1569983409239, "rating": 5.0, "text": "Great people are and amazing service would definitely recommend them to everyone!!! Owners and management are very Knowledgeable and helpful", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "115816539227281313073", "name": "Troy McGraw", "time": 1570035575816, "rating": 5.0, "text": "Great people, great service, with honest and fair pricing.\nYou won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106461401980471674748", "name": "Ashley Payne", "time": 1570024336110, "rating": 5.0, "text": "The mechanics are amazing along with the rest of the staff! Very friendly and know exactly what they're doing.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106552993956676200235", "name": "Dustin Miller", "time": 1570024153556, "rating": 5.0, "text": "Coustomer service is great! They work hard to get you exactly what you need!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "106365428380451355165", "name": "jason hills", "time": 1570550950760, "rating": 5.0, "text": "Honest and veary nice great prices couldn't have ben more pleased.\nTHANK YOU", "pics": null, "resp": {"time": 1570795676970, "text": "Thank you"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "110025072465034838684", "name": "Brandy Thrasher", "time": 1580492438152, "rating": 5.0, "text": "Great experience ! Oil change was quick and very reasonably priced .", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "115974832361822624266", "name": "Chrislandon Orear", "time": 1569984623570, "rating": 5.0, "text": "Doug Canter had us in and out in no time. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "117650059027011101094", "name": "Joseph Bell", "time": 1580491499120, "rating": 5.0, "text": "Great service and friendly staff, got me in quick and work was high quality", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105866118992795814299", "name": "Amanda Treptau", "time": 1570024329921, "rating": 5.0, "text": "A great place to take your vehicle for quick service at a great price!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "114887088938738910177", "name": "Nancy Yeager", "time": 1570047247393, "rating": 5.0, "text": "Great service awsome company  they go above and beyond in customer service", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105707567619963328212", "name": "Christy Miller", "time": 1570024270066, "rating": 5.0, "text": "Best service around Cullman! They stop at nothing to get your car working again!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "113611870001800427685", "name": "Mike Pritchard", "time": 1569690089306, "rating": 5.0, "text": "Great place for any Automotive needs. Mechanical,  Used cars, Auto Body repair.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "112280169382451097879", "name": "Lynn Jones", "time": 1591216673608, "rating": 5.0, "text": "Everyone was very helpful!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103703766848301265797", "name": "J. Lewis", "time": 1588796503278, "rating": 5.0, "text": "Quick, professional service.", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109293963557210445187", "name": "Michael Aderhold", "time": 1609448351023, "rating": 5.0, "text": "Good", "pics": null, "resp": {"time": 1609802858060, "text": "Thank you for using integrety Auto Group LLC"}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "104330528392297883859", "name": "Lashonna Gaither", "time": 1570024201401, "rating": 5.0, "text": "10/10 they are the best!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "109023016065128863661", "name": "Paul Chaney", "time": 1573877257526, "rating": 5.0, "text": "Best repair shop in Cullman", "pics": null, "resp": {"time": 1574028678750, "text": "Thank for your business to our shop."}, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "115160147402324469008", "name": "jennifer heinl", "time": 1570035145215, "rating": 5.0, "text": "Love this place and the owners!", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "103628677169676611593", "name": "Robert Taylor", "time": 1591896989912, "rating": 5.0, "text": "Best in the business", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBUFrf_qj4VLRYymWVOec0MfoHndU2OaypIZm3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "105192744677159847050", "name": "Cassandra Hernandez", "time": 1582233485610, "rating": 5.0, "text": "Hard worker's", "pics": null, "resp": null, "gmap_id": "0x8889cb541735447f:0xc090e6ddb9eadb5e"}
{"user_id": "111368212138247558790", "name": "Tom F", "time": 1591543200588, "rating": 5.0, "text": "Greg was great to work with, very responsive and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4cd8645c219b:0x197204137fe3c7ad"}
{"user_id": "113912614709935113001", "name": "Tim Whigham", "time": 1458354760527, "rating": 5.0, "text": "Great job on motorcycle tank repair , very professional work . If your looking for someone to repair the fuel tank on your motorcycle , all I can say is look no further.      THANKS  BRANDON", "pics": null, "resp": null, "gmap_id": "0x889a4cd8645c219b:0x197204137fe3c7ad"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1558439980025, "rating": 2.0, "text": "I thought it was a little expensive. Had to pass", "pics": null, "resp": {"time": 1561162874354, "text": "Thanks for considering our service, sorry we were not able to help."}, "gmap_id": "0x889a4cd8645c219b:0x197204137fe3c7ad"}
{"user_id": "117854971485866066388", "name": "Aaron Travis", "time": 1612568036035, "rating": 5.0, "text": "Excellent job. Very fast turnaround and affordable pricing. Recommend for anyone looking to paint a vehicle", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQ-ETfkntyuNUunFqr-SpuMW6W6m082EM2U4JR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-EqvGeYsHo-Gm4VCj2gEdFYBg8TEOUTjrY3rt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNX6pL9BVUWs7HIJbLy0_ERXvdXL9nl7PuQXba5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "102682185890457124598", "name": "Alex Cross", "time": 1619640381768, "rating": 5.0, "text": "I paid $497 total for a metallic paint job on my 2005 Pontiac Vibe. I was a little skeptical because of the low price, but I was shocked by how good the paint looked when I came to pick up my car 5 days later. There's some minor overspray on the trim and lights but for the price I can't complain, it looks 100 times better. I would definitely recommend going here for a decent paint job on a budget.", "pics": null, "resp": {"time": 1620233112259, "text": "Thanks so much for your business and for taking the time to post a review!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "110230002038362439113", "name": "Angela Hollis", "time": 1626980245173, "rating": 4.0, "text": "They were nice and friendly. Prices have gone up since my first car was painted 5 years ago but looks like everyone is feeling the \" pinch\" everywhere you go.", "pics": null, "resp": {"time": 1627048402344, "text": "Thank you for the review. We have raised our prices for the first time in many years. Unfortunately, it was time as our paint and materials have gone up considerably."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "104846852695879492002", "name": "Crishawnna Thomas", "time": 1619057363659, "rating": 5.0, "text": "Great First Time Experience 💗. Just Communicate What You Want & They Will Be Straight Forward, Willing To Give You What You Need.", "pics": null, "resp": {"time": 1619099063744, "text": "Thank you for the shout out!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "114248436788090089584", "name": "Jasmine Briggins", "time": 1614975764512, "rating": 1.0, "text": "This place is horrible. I initially went here for a paint job on January 30,2021 i had selected the color forest green and they painted my car the same color it was when i first brought it in which was black. They took some money off and agreed to do it the right color on March 1st after picking up my car the next following days they still didn’t paint my car the color i chose they painted my car a turquoise which is nowhere near close to a forest green color. At this point i\nI’m over them and how they conduct business because clearly they do whatever they want although you choose the color you want. They’re extremely unprofessional. Never again i would not recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "103446128099954385142", "name": "Will Hunter", "time": 1616081559378, "rating": 1.0, "text": "I took my vehicle to this establishment. I was told that it would take one week to finish! 10 days later they didn't even move it.  When I took my vehicle there it was only 3 cars on the lot! Then the manager had the nerve to tell me it would be another week before painting it! Really! I don't recommend AT ALL!", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "108325069405628539832", "name": "jason hughes", "time": 1603601424925, "rating": 5.0, "text": "I have a 30 year-old SUV that had been spray painted with cans by a previous owner.  Econo Auto Paint in Fairfield repaired it and made it look new again.  I got the top paint that Econo offers.  I also had some minor body work done (couple of dents and a few small holes in roof) and they did a great job.  Econo was also able to apply a newer paint color code specific to the manufacturer and matched it perfect.  I did have a couple of small issues, but no big deal:  There were some very small areas of overspray that I wiped-off with some solvent and a rag.  Also, they didn’t bolt my windshield wiper arms back on the car and I found out after it started raining the next day that I didn’t have wipers.\n\nEcono was the lowest of 2 other quotes I received by $1,500.  Also, my car was ready when they said it would be.  Bottom line, if you want an older car looking good at an affordable price, visit Econo.  If you want a $10,000 mirror finish on your Ferrari, go somewhere else. I will be taking my 2006 car to them soon.  Thanks Econo.", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "118199272173061397732", "name": "jonathan lark", "time": 1582914010676, "rating": 5.0, "text": "Everyone I spoke with was polite and cut up with me and made the experience. I needed an all over paint job & these guys knocked it out of the park. I did a lot of the prep work myself because of my OCD. LOL....... yes i did have minor issues, some tape on lights, etc.. . But overall great job... I would let them spray any of my cars... \"Now n' Later\" car turned out great.....", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM_gYJP8hG0-NnGyM9GyBWeZKOWJZE1MjOvWwgR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNATqsK_en9tPwJIMYiXgr3yCmgJrGzw_3BNFbK=w150-h150-k-no-p"]}], "resp": {"time": 1582913924269, "text": "Thank you so much for your business and the great review! It's always fun to work with customers like you and we hope to see you again with the next project."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "117847787445135229374", "name": "Deborah Hatchett", "time": 1618674378439, "rating": 5.0, "text": "They are professional. Cannot beat the job for the cost.", "pics": null, "resp": {"time": 1619113028559, "text": "Thanks so much for the shout out, our goal is always to offer value for money."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "107429596555102941011", "name": "James Cruso", "time": 1619945974143, "rating": 3.0, "text": "If you want a cheap paint job go there you get what you pay for", "pics": null, "resp": {"time": 1620048328303, "text": "Our aim is to offer value for money. You are exactly right, if someone is looking for a custom paint job, that's not what we do. Thank you."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "106149335872238628748", "name": "Billy Ritch", "time": 1591490971319, "rating": 5.0, "text": "Friendly folks, great price on a budget paint job for an older car. They provided exactly what i requested. Would definitely use again.", "pics": null, "resp": {"time": 1595336925441, "text": "Thanks so much for taking the time to post a review. We appreciate your business and look forward to the next time!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "112123285744264260680", "name": "Arnold Benedict", "time": 1603204437395, "rating": 5.0, "text": "Great customer services. Very affordable paint jobs.", "pics": null, "resp": {"time": 1603211089509, "text": "Thank you!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "116753191555208223266", "name": "Rebecca Powell", "time": 1549805574883, "rating": 4.0, "text": "Thanks for the bumper paint job after andd before  photo", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNFxYEWPP1WsDdwUkHrE9JPCY8B2ylq6s2jsd0s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQyBU-DkCYkWa9eUJNLE1xEHIgLGLlElrHqpC2=w150-h150-k-no-p"]}], "resp": {"time": 1553001697913, "text": "Thank you!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "103105321133212430195", "name": "vonyabutfly johnsonjemison", "time": 1613153514929, "rating": 3.0, "text": "Reasonable prices and greater view", "pics": null, "resp": {"time": 1613401001411, "text": "Thank you for posting, we only wish we had earned a 5 star review. Feel free to let us know how we could have improved our service. Thank you."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "117285223626429713863", "name": "CantBeAfraid ToTry", "time": 1595279296032, "rating": 4.0, "text": "Friendly staff and knowledgeable.  Great prices too", "pics": null, "resp": {"time": 1595336408427, "text": "Thank you!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "118433115719375332636", "name": "Jeffrey Malone", "time": 1618257639960, "rating": 2.0, "text": "Did a poor job on my truck", "pics": null, "resp": {"time": 1618322936448, "text": "We would like to look into this situation for you and try to resolve any issues. If you would reply here with the date of service and a work order number we will certainly look into it. Thank you."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "107090417058819447907", "name": "Octavia Hall", "time": 1493422424804, "rating": 5.0, "text": "I would recommend this company to anyone. Very friendly environment, customer service was excellent. I got an full body paint on my (black,same color)Toyota Corolla 1994, for a affordable price. Their work was surperb, I was skeptical at first because  I read some bad reviews ,but I had a great experience. I ran into a minor problem ,but it was quickly handle with no hesitation.", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "113831023725850811624", "name": "alyssa isaac", "time": 1559916724480, "rating": 5.0, "text": "Y'all did a Superior job. I Will Definitely Be Back.", "pics": null, "resp": {"time": 1559920584598, "text": "Thanks so much! We look forward to working with you again (and your friends and family!)."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "105432891018106913162", "name": "Israel Velasquez", "time": 1603205878958, "rating": 5.0, "text": "Great people Great work", "pics": null, "resp": {"time": 1603211103153, "text": "Thank you!"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "118227233424611698364", "name": "Rochelle Robertson", "time": 1476389609714, "rating": 1.0, "text": "The work they did on my vehicle was decent! As far as customer service very rude, disrespect and deceiving! I took my vehicle to them to fixed a minor scratch on my paint on the back of my vehicle and to push my bumper back in to place(which they didn't fixed the bumper) on Friday around noon  and because the guy with The Kid from House Party Fro told me they would be done in a day. So he asked when I needed it back and I told him on Monday noon  and he told me Oh  it will be ready by lunch time. So I got a rental from Friday at 1pm to Monday at 1pm! I called around 11am on Monday and asked was it ready and he told me it will not be ready  at 5pm because the paint wasn't dry and they still needed to clean and detail the vehicle (which they didn't clean nor detail nothing)(Which also tell me you all just started on my car on Monday morning when it been their since Friday) So I said that you told me by lunch time and 5 pm is dinner and this boy told me that 5pm not lunch time to me so you say! So of course I called the rental place to extend the rental for a extra day because my daughter had a doctor's appointment at 2pm on Monday that could not be missed! So I asked the young man on Tuesday morning because it was an inconvenience  can they take some off the price because I had to extend my rental and you told me it would be by lunch time yesterday and was not ready? He told me he could not so I ask him is it someone over him that I could talk to?  So after I talk to the other manager he have lie to him making seem like the car was ready at 1pm and trying to make it seem like I'm lying and it was just not right at all! I don't recommend this place to nobody!!!! If you have to spend your  money for someone to belittle you like that!   Nobody deserve to be talk to or disrespected in that matter! They left little minor paint in places! Ugh Just don't Go!", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "100153071605184718948", "name": "Terrence Harris", "time": 1521380479476, "rating": 5.0, "text": "Good work for the money ...cant beat them. Great prices and very fast turn out....love this place.", "pics": null, "resp": {"time": 1521469616469, "text": "Thank you! It's great to hear from our happy customers! Econo Auto Painting"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "101320031821874954544", "name": "FRANKIE WILLIAMS", "time": 1547752998720, "rating": 1.0, "text": "They’re very friendly, there’s a fat dued\nSitting at the desk sleeping when you walk in, it stinks.\nI left my car to fix right side bumper, they told me they would take care of it.\nThe hood of my car was faded so I decided to let them paint the car\nMy car was gray, I wanted it painted back the same color gray.\nWhen I got it back my car is purple.\n\nPlease everyone I know you can’t afford\nThose high prices of paint jobs, but if you go this route, you’re gonna get what you pay for.\n\nDon’t do this to yourself!\n\nMaybe they do a better job\nElse where at ECONO paint,\nBut the one in Fairfield,Al.\nIs a big joke.\nThese guys can’t paint or fix anything.\nMy bumper is still in bad shape, with bad paint job.😂🥺", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "111551154649381479909", "name": "Danyelle Varner", "time": 1490890239074, "rating": 1.0, "text": "Horrible horrible horrible!!!! I wouldn't even recommend them painting a bicycle. My car looked better before I took it in with the dent. They didn't inform me they couldn't do the pinstripe now half my car doesn't have it. They act like they had nothing to say about it. The paint doesn't match. The bumper looks like they just held the old one together while the glue dried to keep it in place...it's still cracked and just looks painted over. This was very sorry work now I have to find a PROFESSIONAL to do the actual repairs!", "pics": null, "resp": {"time": 1490751860857, "text": "Ms. Varner, we take reviews very seriously and will look into your issues. We hope your name here is the one on the invoice so we can find the records and try to resolve your problems. Someone will be in contact with you in the coming days."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "115365529277391548719", "name": "Bruce Lenart", "time": 1505335535098, "rating": 5.0, "text": "Excellent service...Great Job at a reasonable cost...Car looks like new great match on the paint color...very satisfied...Roll Tide!!!", "pics": null, "resp": {"time": 1505348726887, "text": "Thank you so much for your detailed review! It means a lot to hear from our happy customers. Thanks again. Econo Fairfield"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "109021468220497961929", "name": "Mariah Hunter", "time": 1514493445594, "rating": 5.0, "text": "Very satisfied with the work! Will do business again.", "pics": null, "resp": {"time": 1514923826947, "text": "Thank you so much for posting, we never get tired of hearing from our happy customers! Econo Auto Painting"}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "103261998443068169056", "name": "Tonya Jones", "time": 1572954365138, "rating": 1.0, "text": "They left tape on top of my engine, my car was a MESS when I picked up and I had paint all over my windows which they should have covered", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "101595116385518637592", "name": "meshachthesquare", "time": 1500125634205, "rating": 1.0, "text": "They try. .. I guess that count for something 😂👌", "pics": null, "resp": null, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "100606576610668322053", "name": "Nikolas Wiley", "time": 1595637223582, "rating": 3.0, "text": "Good", "pics": null, "resp": {"time": 1600180122580, "text": "Thank you, we only wish we had achieved 5 stars."}, "gmap_id": "0x8888e18d407f09e1:0x84f8020d89e1d367"}
{"user_id": "115853152096465984808", "name": "don hoskins", "time": 1624907596674, "rating": 5.0, "text": "Top notch business. They turn out good work.", "pics": null, "resp": null, "gmap_id": "0x8888df04cc4c2603:0xe4fd5c111f8e18f8"}
{"user_id": "105393090545568227704", "name": "Ms Boss Ragland", "time": 1624018775706, "rating": 5.0, "text": "Awesome service", "pics": null, "resp": null, "gmap_id": "0x8888df04cc4c2603:0xe4fd5c111f8e18f8"}
{"user_id": "116994211998851471643", "name": "Elizabeth Williams", "time": 1624271055279, "rating": 5.0, "text": "Car looks new, outstanding work. I will return if needed. The staff were very welcoming.", "pics": null, "resp": {"time": 1624376938622, "text": "Thank you Elizabeth, for this awesome five star feedback! Have a fantastic day!!!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "102615760205985682843", "name": "Chris K", "time": 1594564709741, "rating": 5.0, "text": "Absolutely no one could tell which side was touched up. They did a terrific job, and provided a warranty in case I ever ran into trouble with it. The pictures from 2-3 months after their work speak for themselves!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOVeM4Y_v2-ZCcJlFqGwKeF0BSeDrYFkQJYZWcu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpwq-rgNa7wefxhVH63NQTuvyQNHlZbUfjtfAW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhFyxrfy3ZUDpVRQFJT3Kd88q6Und8_V6qhErY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNn2uKCHtXyOtZDHKA2fxuvZOfHFIMgsIoxX1AR=w150-h150-k-no-p"]}], "resp": {"time": 1594650763498, "text": "Chris,\nWe are pleased to hear no one is able to tell you had some work done and that everything turned out so well!! Thank you"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "104770400069013160805", "name": "The Dirt Road Liars", "time": 1614304174493, "rating": 5.0, "text": "Best experience. They updated me regularly! And was very prompt with information regarding my repairs. Excellent service", "pics": null, "resp": {"time": 1614350329299, "text": "The Dirt Road Liars,\n\nWe are so pleased to hear that you are satisfied with the overall service and sincerely appreciate the positive feedback. We hope you have a great weekend!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "104695447787621123526", "name": "Tiffany Medley", "time": 1620907315773, "rating": 5.0, "text": "Friendly customer service and great prices", "pics": null, "resp": {"time": 1621005163158, "text": "Thank you Tiffany for the awesome five star feedback! Have a great day!!!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "114899065341897132060", "name": "Jorge F. Rodriguez", "time": 1611709225417, "rating": 5.0, "text": "I have been in the automotive business as. Pre-owned  Manager and deal and have dealt with many body shops. Back in November my wife and I had an accident in Anniston Alabama. Unfortunately we had to leave our car their and rent a car and drive back home to Miami Florida. Never did I expect the amazing quality of work , service and attention that they gave me. Conchetta Ward tended to me long distance. I was concern because I didn’t know the town or anyone their. She was amazing in the professional but in the way yet made me feel like I knew her a very long time. Their was a small issue when I get the car back but they where extremely quick to respond and took care of the issue. In live things will happen but like I always said it’s not what happens but how it handle and they handle it great. I very highly recommend them!!", "pics": null, "resp": {"time": 1611757884244, "text": "Jorge,\n\nWe are so pleased to hear how great your experience was and that the Anniston team could assist you with the repairs to your vehicle and that the process was smooth and completed in a timely manner. We sincerely appreciate the positive feedback and hope you have a wonderful day!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "112424719702055132450", "name": "jason smith (stump)", "time": 1599356346441, "rating": 4.0, "text": "Easy process just dropped car off and a week later good as new.", "pics": null, "resp": {"time": 1597067798005, "text": "Jason,\n\nWe are so pleased to hear that you are satisfied with the overall service and sincerely appreciate the positive feedback. We hope you have a great day!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "107553569784954046740", "name": "Erika Clark", "time": 1597426119022, "rating": 5.0, "text": "Great place they fixed our daughter's car and it looks brand new again", "pics": null, "resp": {"time": 1597676120931, "text": "Erika, we are happy to hear the Anniston location was able to repair your daughter's vehicle and that it looks new again!! Thank you, have a great day!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "106769666066530612516", "name": "Tae Tae", "time": 1617210240447, "rating": 5.0, "text": "Speedy service", "pics": null, "resp": {"time": 1616517770154, "text": "Thank you for the five stars! Have an awesome day!!!"}, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "102563656183266800141", "name": "Kevin Broadaway", "time": 1550691074257, "rating": 5.0, "text": "First Class all the way!", "pics": null, "resp": null, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "108298396205468905832", "name": "Shannon Dunn", "time": 1558864874389, "rating": 4.0, "text": "Employees at Auto Collision collect the cardboard for recycleing and I pick it up and take to the Recycle Center.", "pics": null, "resp": null, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "100920653124082517671", "name": "GWEN R", "time": 1557256559810, "rating": 5.0, "text": "Would have missed the place without the GPS.", "pics": null, "resp": null, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "110708557426864316031", "name": "Brandon Ricks", "time": 1557256149902, "rating": 5.0, "text": "Does great work", "pics": null, "resp": null, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "109788280105407130517", "name": "Johnny “AZTEC10” Becerra", "time": 1529325169751, "rating": 5.0, "text": "Nice friendly people that helped me with my car accident repair .", "pics": null, "resp": null, "gmap_id": "0x888bb17bf7780643:0x512f13d857c44079"}
{"user_id": "115127892160838917700", "name": "Patrick Swann", "time": 1617294171273, "rating": 5.0, "text": "Chris was on time! Very polite. Told me it would take 1 hour to get a dent out. He was done in 20 minutes and the car looks like brand new. HIGHLY RECOMMENDED!!!!", "pics": null, "resp": {"time": 1617296851443, "text": "Thank you for the business. If you have anything else please let me know."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "112651929637860357787", "name": "Sean Laughlin", "time": 1501884488058, "rating": 5.0, "text": "Wow. There was a quarter sized dent in the quarter panel of my Porsche 911. Chris did a great job at a reasonable price, and i can't even find/remember where the dent was. I was out of town and he came to my mechanic's shop to do the work. He took PayPal and the Porsche specialist shop I use (momentum motorworks) said it's the best PDR they have seen. Would give 6 stars if I could!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMgtVd9rC6y0DS9LXdtYceTXgLLteDnhnmhcmiJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "107774212676732307227", "name": "Patrick Herring", "time": 1619120600709, "rating": 5.0, "text": "Showed up on time and did an excellent job for a very reasonable price. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "109412767510010229548", "name": "Libby Worthington", "time": 1597255523342, "rating": 5.0, "text": "Chris was quick to respond to my texts.  He provided a free, zero obligation quote.  He quickly set an appointment and was exceptionally flexible and understanding when I had to cancel.  He rescheduled for the next day.  He completed the work in a short amount of time while I was at work.  He did an amazing job!  You cannot tell there was ever any dent.  His pricing was a fraction of what the repairs would have cost at a body shop and my original paint was preserved.  Fantastic work!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "115317395030081883300", "name": "Jodi Steltenpohl", "time": 1617931088510, "rating": 5.0, "text": "Great job taking out tiny dings of one vehicle and removing a dent from a wreck on another! Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "115205332575300277967", "name": "George lancaster", "time": 1604360757799, "rating": 5.0, "text": "Had a ding on my new Ram which I didn't think could be fixed like new.  Called Chris and he completed the project and I was amazed!  Cannot see where the ding was!  He came to my work place and completed the job while I worked.  Excellent work, excellent price.  I couldn't be happier and definitely recommend Carsmetic for for all your cosmetic needs.", "pics": null, "resp": {"time": 1604408935383, "text": "Thank You For The Review. If You Need Anything Else George Please Give Me A Call. Thanks Again."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "111181564365620722008", "name": "VINAYA HALABE", "time": 1604002003450, "rating": 5.0, "text": "I had a small dent in my bumper of Toyota Corolla . Chris showed up at my place and fixed quickly. Great works with great savings. I highly recommend him", "pics": null, "resp": {"time": 1604003880090, "text": "Thank you very much. If you ever get anything else please call again."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "104235799368954940927", "name": "Hank Wegener", "time": 1600275765339, "rating": 5.0, "text": "I called to get a dent in my hood repaired. He took care of that. He also took care of a 3 to 4 year old deep ding in my passenger door while he was there. All for a very fair price in my opinion!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "102503815298719443787", "name": "James Bausch", "time": 1608147330229, "rating": 5.0, "text": "Chris did an outstanding job of repairing a small dent in the hood of my car, which is only 5 months old.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "107346109378356905800", "name": "Neal Chandler", "time": 1588877024840, "rating": 5.0, "text": "I sent a text with pictures of my dent and got an immediate response and set up a spot and time the next day.Met up with Chris he got right to work. Did a little assessing and started on my dent. I had me a seat and let him do his thing he was done in no time. You cant even tell there was a dent in a black truck too. Its flawless. Dont hesitate to give him a call.  Quality work.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "117146787777169109044", "name": "Jim Sanders", "time": 1593605642111, "rating": 5.0, "text": "Chris responded quickly to my call and fixed my dent the next day as promised.  He came to my house so it was very convenient. I could not tell where the dent had been. Looked good as new.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "102639858451893549569", "name": "scott f", "time": 1607976640638, "rating": 5.0, "text": "Right on time, Great price and grade A service! Cant tell my Lexus ever had a dent in it . Chris saved me a ton of $$$$ .", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "102108290598862853882", "name": "Kim Hill", "time": 1580342438052, "rating": 5.0, "text": "I would highly recommend Chris for anyone needing Paintless Dent Repair. I am so happy I found him online. Initially I called because he has great reviews on Google. I’m so glad I did, because the positive reviews are well-deserved.\n\nDoor dings will happen, but it had been less than a week since the purchase of my new car — so I was pretty bummed when I left my office, walked to my car, and saw that someone had dinged my passenger side door. I got online and found Carsmetic on Google. Chris responded right away, with a very reasonable estimate. The next day, he repaired the dent in less than an hour. The results are amazing — the door looks like it did the day I bought my car.\n\nI cannot say enough about Chris and the excellent service he provided. Fast, honest, great results — he is a true craftsman in the art of PDR.", "pics": null, "resp": {"time": 1580738210439, "text": "Thank you please call again if you have any problems."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "105552823432086580697", "name": "Harold Riker", "time": 1595968963521, "rating": 5.0, "text": "Chris is a great guy, was on time and did a great job.  Will definitely use again if I ever have a need for this type of work.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "110387408861832875108", "name": "Justin Hamblin", "time": 1573068378675, "rating": 5.0, "text": "I'm a car guy... very meticulous about my vehicles. About a week ago, a co-worker opened his door and put a ding in my door. Small problem... major issue for me.\n\nI was told by one company that they didn't want to touch it. It was on a crease and he was scared of causing more damage. I contacted Chris and had the best experience!\n\nHe worked around my schedule... came to my place of work.... and had it looking brand new in no time! Quoted me high and charged me true for the work needed! My co-worker is thankful too!\n\nGreat communication! Terrific Service! He has my business from here on out!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "101209846713883280724", "name": "Jason Clemons", "time": 1578413335050, "rating": 5.0, "text": "Chris was fantastic. He arrived in a timely manner and repaired a dent in the front quarter panel of my car. He was even able to perform the repair at my workplace. The repair was completed quickly and there was no visible evidence of the dent after the repair. I highly recommend Chris at Carsmetic for any PDR needs.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "102312684157499216285", "name": "Norman Adams", "time": 1604523036167, "rating": 5.0, "text": "He was on time and his quality of work was excellent.", "pics": null, "resp": {"time": 1604523898199, "text": "Thank you for the business. Glad to help out a police officer when I can. If anything else please give me a call."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "108206008674560386964", "name": "Jennifer Gilbert", "time": 1583463724075, "rating": 5.0, "text": "Chris did a fantastic job repairing a couple of dents in my vehicles.  I definitely would recommend him.  He does excellent work.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "110426371838469290390", "name": "Michael Mays", "time": 1570717408431, "rating": 5.0, "text": "Chris completely eliminated multiple door dings in different areas around our suv that has glossy black paint.  Flawless.  He also showed up on time and was conscientious about returning calls and informing us of how we would accomplish the job.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "107054176022734471197", "name": "Danny T", "time": 1559679448424, "rating": 5.0, "text": "Very professional and courteous. He responded quickly to my text and did a great job repairing the dent. While he was there he looked at another vehicle of mine and repaired it the next day. I highly recommend.", "pics": null, "resp": {"time": 1559687744643, "text": "Thank you for the working if you get anything else please don't hesitate to give me a call."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "101693897284141135756", "name": "Kelly Holland", "time": 1568835484873, "rating": 5.0, "text": "Chris Sherer did a great job repairing the hail damage on my car. I highly recommend his services. Very easy to work with.", "pics": null, "resp": {"time": 1568837377897, "text": "Thank you for your business. We've been doing hail damage for over 26 years experience in the field. I hope it doesn't happen again but if it does please give us a call."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "105544259314647775774", "name": "ethan mcdaniel", "time": 1555960759653, "rating": 5.0, "text": "Very prompt and exactly what I needed at a fair price.  Better yet he came to meet me and there was no inconvenience.  Great business.", "pics": null, "resp": {"time": 1568837469719, "text": "Thank you for your business. If you need anything else please give us a call"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "110713139947644052859", "name": "Brooke Cleckler", "time": 1536891256983, "rating": 5.0, "text": "Chris was so easy to work with. I needed a dent repaired quickly and he went above and beyond to work with me. His work is impeccable! You cannot even see where the dent was, it truly looks perfect!", "pics": null, "resp": {"time": 1536892845352, "text": "Thank you for the business. It was a difficult dent but it came out great. I'm glad I was able to do it while you're at school today. Thanks again"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "108121705057137192804", "name": "Rebekah Warren", "time": 1554229809133, "rating": 5.0, "text": "So happy with my experience. All dings were removed in no time. Simply and easy process. Very affordable!", "pics": null, "resp": {"time": 1569000811668, "text": "Thank you for the business and I hope to see you again."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "110507777888549602328", "name": "Kristi White", "time": 1579282103273, "rating": 5.0, "text": "Did a nice job getting the ding out of my door. Very courteous and quick.", "pics": null, "resp": {"time": 1579286625194, "text": "Glad to be of service. Please call again. Thank you."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "103119752113179432373", "name": "Aliah Ajamoughli", "time": 1535422839658, "rating": 5.0, "text": "Chris came to our house and fixed a long scrape down the side of our car. After his services, our car looks brand new. He was incredibly professional, quick with the service, and at a great price. I highly recommend using Carsmetic for all of your small dents and scratches.", "pics": null, "resp": {"time": 1535426460169, "text": "Thank you for your business. If you ever get anything else please don't hesitate to call."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "114804998361757728978", "name": "John Paydo", "time": 1571793907784, "rating": 5.0, "text": "Chris repaired 4 dents for me.He was very thorough and did an excellent job.I highly recommend him for any of your dent repairs.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "109634632065366711104", "name": "Wesley Dye", "time": 1573657731924, "rating": 5.0, "text": "Good work, promptly done, and fairly priced. Will use for our vehicle fleet in the future.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "115999830204047370639", "name": "Tam Harris", "time": 1535577209182, "rating": 5.0, "text": "Chris did a great job repairing the dent on my car door. He was able to come to my location and fix it the same day. He was professional and very reasonably priced.  Will definitely use Chris again.", "pics": null, "resp": {"time": 1535578690479, "text": "Thank you for the work and please call me again if you get anything else."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "114535916095651554483", "name": "Jeff Ray", "time": 1549929582593, "rating": 5.0, "text": "Excellent work and finished in the time estimated.  Great value as opposed to a body shop.  Hopefully I don't end up with dents in my car again but if I do I'm going back to Chris at Carsmetic.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "100158976665341888752", "name": "Katie Wallace", "time": 1558489718647, "rating": 5.0, "text": "I bought a new car and someone hit it the next day in a parking lot. I called and he came out to my house and left no trace of a dent on the back of my suv. He was priced about $100 cheaper than other places I called. Highly recommend!!", "pics": null, "resp": {"time": 1558572251357, "text": "Thank you for the business. Sorry your car got damaged. Glad I could repair it for you."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "118143786377137560926", "name": "Charlie Mike", "time": 1568989229016, "rating": 5.0, "text": "Very thorough and patient Chris took his time to relieve my vintage Porsche Carrera of a few scratches and dents collected over the years. Excellent work.", "pics": null, "resp": {"time": 1569000773460, "text": "If you need anything else please let me know. Thank you"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "113722186396627821024", "name": "Abigail Perkins", "time": 1539113581259, "rating": 5.0, "text": "Called him on a Sunday and scheduled an appointment for Tuesday. He came to my office and fixed the ding in my Honda CRV in less than an hour. Reasonable price and amazing work. I couldn’t even tell where the ding had been. Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "101183335926367424624", "name": "James Herring", "time": 1566242815459, "rating": 5.0, "text": "Had a rock dent in the aluminum hood of my beloved GT500. He was on time and got the dent out totally for a reasonable price.", "pics": null, "resp": {"time": 1567555317205, "text": "Thank you for the business and I'm glad it came out to your satisfaction"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "111455498523814782430", "name": "Eric Champion", "time": 1567550462720, "rating": 5.0, "text": "Chris did an excellent job. I highly recommend his services.", "pics": null, "resp": {"time": 1567554155930, "text": "Thank you for the business."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "108084462897710988554", "name": "Bryan Traywick", "time": 1565909296430, "rating": 5.0, "text": "Great experience from contact to price to quality of repair. Would highly recommend to family and friends.", "pics": null, "resp": {"time": 1568837445092, "text": "Please call us if you get any more types of damage. We repair door dings minor dents and hail damage. Thank you"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "109062501796128413881", "name": "Stephanie Gifford", "time": 1502755296823, "rating": 5.0, "text": "Chris has repaired many dents over the years for me and I have always been very pleased! He is very skilled, reasonably priced and takes true pride in his work! He is the only person I would ever recommend to anyone needing dent repair on their vehicle! A++", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "101477083632398906627", "name": "Doyal Marks", "time": 1601344891780, "rating": 5.0, "text": "Very knowledgeable, excellent results", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "105432296009730602210", "name": "LeAnn Wood", "time": 1537929777834, "rating": 5.0, "text": "I just bought a new car and the first week of having it, careless people dinged two spots in the same panel. I called and he was Johnny on the spot! He came to my work and he had my car looking better than I bought it! There was even a scratch that he worked on. I was very pleased and will use him again.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "109464464153187089238", "name": "John Jones", "time": 1547678336127, "rating": 5.0, "text": "Chris did a great job for a very reasonable cost. Better yet, he came to our house and fixed the debt.  It was just one mid size dent on the hood of my wife's car caused by accidently dropping an ice chest on it in our garage.", "pics": null, "resp": {"time": 1547828981218, "text": "Thank you for the business. Hope nothing else happens but if it does please give me a call."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "105622058173877505838", "name": "Jeff Kerley", "time": 1571955481360, "rating": 5.0, "text": "Chris does a great job! I’ve used him more than once and will use him again when I have PDR work that needs to be done.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "112697331165559424668", "name": "Kenneth Johns", "time": 1501190555383, "rating": 5.0, "text": "Chris was on time and performed the work quickly and efficiently.  He removed a softball size dent in the right rear quarter panel of a Ford Fusion.  You really can't tell it was ever dented.  Thanks for the good work !  I would recommend and use him again.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "113856769465014254158", "name": "Kelly Johnson", "time": 1570132950565, "rating": 5.0, "text": "Small dent, big issue, great job!  Can’t go wrong.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "100271590227584643861", "name": "Chelsea Crum", "time": 1508178685569, "rating": 5.0, "text": "Chris did an amazing job fixing the dents on my car. Very reasonable price and he was able to fix it at my job so I didn’t have to make any special trips. Will be using him again for any dent repair needs.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "115842374520466029218", "name": "Andrew Harrington", "time": 1595374914592, "rating": 5.0, "text": "Chris has done several jobs for me.  His rates are reasonable and he does great work.  I recommend him, highly.\n\nThe above was from three years ago. He did another job for me recently with the same great result.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "112482578230886016896", "name": "Rick Harmon", "time": 1502460550605, "rating": 5.0, "text": "Chris just finished a repair for my son. We found him to be very knowledgeable in his crsft, highly skilled in the application thereof, and to be a man of true integrity. He definitely had our best interests in mind doing this job. His pricing was very reasonable.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "111832628116455340926", "name": "Perry Turner", "time": 1558046228801, "rating": 5.0, "text": "Obviously very skilled. and knows what he is doing. Very happy.", "pics": null, "resp": {"time": 1558572283046, "text": "Thank you very much for the business."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "102574702733294735203", "name": "David Villa", "time": 1481758222748, "rating": 5.0, "text": "Chris is very professional and will go beyond to make sure you're satisfied with his work. As far as the work that he does, it is second to none. All the dings are gone from my truck!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "116269983722781565040", "name": "ptonya hadder", "time": 1536956105915, "rating": 5.0, "text": "Chris did a awesome job fixing my door ding, he arrived when he said he would and my door looks just like new again. I would highly recommend him !!", "pics": null, "resp": {"time": 1536957095672, "text": "Thanks again for the business. Glad I could help."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "103468828775074037241", "name": "Brenda King", "time": 1551305160398, "rating": 5.0, "text": "He came on time . Did a great job  and  charged less than the quoted price .", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "113539526946006093653", "name": "krell56", "time": 1539961726307, "rating": 5.0, "text": "Excellent work.  He came in under quoted price; work was completed quickly and conveniently.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "115418558617061745910", "name": "Derrick Gunnerson", "time": 1538859125852, "rating": 5.0, "text": "Chris did a great job on repairing my dent in my fender will definitely use his services again.", "pics": null, "resp": {"time": 1538861145441, "text": "Thank you for calling us. If you need anything else don't hesitate to call. Thank you"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "114087590777090463507", "name": "Eric Housh", "time": 1533928942312, "rating": 5.0, "text": "Chris did a great job! Highly recommend.", "pics": null, "resp": {"time": 1533971171010, "text": "Thank You Very Much."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "116529647054660426718", "name": "Robert Harmon", "time": 1521032500375, "rating": 5.0, "text": "This was wonderful! Chris's work is of the utmost quality. He is prompt, honest, and a very repectful man. I have used other people in his craft before, and I wish I had found Chris earlier. If anything comes up like this again, I will definetly come to Chris for his superior skill, and professionalism. Thank you Carsmetic", "pics": null, "resp": {"time": 1569000830771, "text": "Thank you again for your business"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "111153631328676506008", "name": "Pritha Powell", "time": 1571751040688, "rating": 5.0, "text": "Fantastic service and great work. Fixed my door dings - almost invisible now.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "106619061058058782562", "name": "Susan Little", "time": 1541784176419, "rating": 5.0, "text": "We have had dents on two different cars in two weeks. Chris did a fantastic job on both repairs and charged us less than what he quoted us on both cars.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "100845728841744621560", "name": "Brian Shaw", "time": 1483042736006, "rating": 5.0, "text": "Chris did a fantastic job repairing a small door ding on my car. Was on time and only took about forty-five minutes. I will only call him for any future repairs.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "105732179309766600640", "name": "Jerry Williams", "time": 1510959494127, "rating": 5.0, "text": "I have used Carsmetic before and this last experience is just like previous times. Chris does great work.", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "111013927086356917307", "name": "Doug Edge", "time": 1522113508793, "rating": 5.0, "text": "I am a Ups driver and my hours are terrible Chris came to my work parking lot and fixed the dents on the side of my left fender and it was like they were never there.  I highly recommend", "pics": null, "resp": {"time": 1569000849542, "text": "Thank you again"}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "116354684513743898574", "name": "Kevin Weaver", "time": 1511889500848, "rating": 5.0, "text": "Chris always does a great job at a very reasonable rate!  I would never call anyone else to remove my dents and dings!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "116869017790549534449", "name": "Antonio Scaife", "time": 1520202455165, "rating": 5.0, "text": "Great job..He got the dings out of my Camaro..Would definitely use him again....", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "116251128953912434602", "name": "Matthew C", "time": 1520627469494, "rating": 5.0, "text": "Great work Chris, thank you !!\nGive him a call !!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "113466030195800049406", "name": "a b", "time": 1567552897364, "rating": 5.0, "text": "I had two dents (one on my passenger door and one on my back hatch). Chris came out to meet me and fixed both dents. Both areas are back to factory finish. Thanks Chris!", "pics": null, "resp": {"time": 1567555229434, "text": "Thank you for the business and I hope it doesn't happen again. But if it does please give me a call thank you."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "112649176593168726182", "name": "Clint Johnson", "time": 1508275416964, "rating": 5.0, "text": "Wonderful job! Highly recommend!", "pics": null, "resp": {"time": 1508277652915, "text": "I'm glad I could get it repaired for you."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "105499976055857682574", "name": "Brian N", "time": 1518113965163, "rating": 5.0, "text": "Great price and took care of the dents. Would be the first person I call for dent repair. Thanks for your help!", "pics": null, "resp": null, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "108582247592270242267", "name": "Robert Norris", "time": 1534991875554, "rating": 5.0, "text": "Great job! Ding is gone!", "pics": null, "resp": {"time": 1535029520071, "text": "Thank You For Your Business."}, "gmap_id": "0x88891f69a22eeba7:0xd29b3518fda4fa5a"}
{"user_id": "103553431879871169518", "name": "Don Johnson", "time": 1623517404503, "rating": 5.0, "text": "The car really shines I’m excited to see this last for a year. I’m really excited in love with my vehicle is so good looking and shark", "pics": null, "resp": {"time": 1623611896465, "text": "Thank you so much for the review! That is what we do here at Bright Mobile Detailing and we're glad you love it!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "107598194843239211848", "name": "Karen Bright", "time": 1621439259958, "rating": 5.0, "text": "Bruce and Matt made my car shine! So clean and fresh! And it was so nice to have them come to my house...which allowed me to get stuff done at home while they were working on my car.", "pics": null, "resp": {"time": 1623611926131, "text": "Thanks so much for the review! We are glad you like it and you chose us to take care of your vehicle!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "104830124761941886320", "name": "Mika Halley", "time": 1617112299126, "rating": 5.0, "text": "These guys are top notch. I feel like I have a new car. My car was in bad shape after not driving it for a long time not to mention it had gotten rain in and had some extensive mold, but Bruce came in and made a plan of attack and now my car is fresh and safe. I’m so impressed and will definitely use them again!", "pics": null, "resp": {"time": 1617113224157, "text": "So glad we could help!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "116046803504808585010", "name": "Laura Blackwell", "time": 1616344685357, "rating": 5.0, "text": "Bruce was on time and very courteous and professional.The car looked brand new when he finished!  I had my husbands car done and we were both very impressed.  Will definitely use him again.", "pics": null, "resp": {"time": 1616344775751, "text": "Glad we could help!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "108139868222265175613", "name": "Chris Graves", "time": 1622820511028, "rating": 5.0, "text": "They were professional, on time , detailed, , did great work. Had employees that I was very comfortable having around my house .", "pics": null, "resp": {"time": 1623186072200, "text": "Thanks for the review! Glad we could help!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "113007425468930025639", "name": "Angela Smith", "time": 1621367372768, "rating": 5.0, "text": "Bright Mobile Detailing exceeded expectations for the tremendous job they did on our car! I highly recommend Bruce Jr. and his crew to make your car look amazing.", "pics": null, "resp": null, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "111359945530178896390", "name": "Jessica Davis", "time": 1623169904486, "rating": 5.0, "text": "My Aviator looks phenomenal! Thank you so much!", "pics": null, "resp": {"time": 1623186052995, "text": "No problem! Thanks for using us! Glad we could help!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "100237493176379665277", "name": "Billie James", "time": 1616619454763, "rating": 2.0, "text": "This was suppose to be a DETAILING for $75. However, it was merely a vacuum, wash and wipe. I get about the same treatment when I drive it through the car wash at the service station....for FREE!", "pics": null, "resp": {"time": 1619189448187, "text": "I'm very sorry that you had a bad experience with us! We are constantly improving our services and we would love to show you our new processes and detailing team. Again very sorry about your negative experience."}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "113008639644534058965", "name": "Heidi Collett", "time": 1618505279438, "rating": 4.0, "text": "They did a good job!", "pics": null, "resp": {"time": 1619189231355, "text": "Thanks! Glad we could help!"}, "gmap_id": "0x888917ca40744fa5:0x2d709eb735db6998"}
{"user_id": "103155644293884210522", "name": "Luis Torres Jr.", "time": 1623423342185, "rating": 5.0, "text": "Excellent service and quality work.  They communicate very good every step of the way. Will highly recommend!", "pics": null, "resp": {"time": 1623702949273, "text": "Luis,\nIt is wonderful to hear that our team took such great care of you and communicated well throughout the repair process. We truly appreciate this awesome five star feedback and hope you have an awesome day!!!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "111188215274380414593", "name": "Cherryl Streeter", "time": 1596842063396, "rating": 5.0, "text": "Gerber Collision in Moody AL gave me the most excellent, professional service from every corner they took excellent care of my car.\n\nThey were friendly fast and awesome.\n\nPlease see the before and after pictures", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNK1xM2ucCJRuVaeTEa1myIMPR2YB72_XD2HfIj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc5qxjx3gBS_DYHBReSkxahPQ4LJI940RkT56E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPfeIRlErLJ0KWDW45041bKegbDoLbS8sQe3ULM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLD5FY99spwwgjohEW6ifWn4B1p0oen_5ql1ed=w150-h150-k-no-p"]}], "resp": {"time": 1597069900730, "text": "Cherryl,\n\nWe are so pleased to hear that the Moody team could assist you with the repairs to your vehicle and that you are satisfied with the overall service. We sincerely appreciate the 5 star review and hope you have a wonderful day!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "110524274462189814188", "name": "Cassandra Naylor", "time": 1610672593264, "rating": 5.0, "text": "I definitely recommend Gerber.  You would never know my car had been wrecked.  The employees are very professional.  They give you updates on your car which is also great.  I am so pleased with they work.  Thank you all at Gerber Collision!!", "pics": null, "resp": {"time": 1610720535906, "text": "Cassandra, wonderful to hear that the team did such a great job you're not able to tell it was in a previous wreck. We are happy they were also so professional and provided great communication! Thank you!!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "110414073591820560593", "name": "linda Posey Mize", "time": 1609708932207, "rating": 4.0, "text": "The employees at Gerber were very polite and helpful. I went there because of an accident when State Farm recommended them. They made the front of my car look like new!", "pics": null, "resp": {"time": 1610030293800, "text": "Linda,\nIt is wonderful to hear that our team treated you so well and made your car look like new! We truly appreciate your taking the time to leave this feedback and hope you have a great day!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "109731663367658362454", "name": "william powell", "time": 1580259481397, "rating": 5.0, "text": "Great Place and Friendly Staff.\nThey had my car for a week, got it back today. My BMW looks as good today as the day I bought it. My car was cleaned inside and outside even my rims shine. Nice job guys !\nI hope there's not a next time but if there is I know where to bring my car.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDwAHz2q6OBP9sgYlnh8f5JjeGpjygq6RP6G1c=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPy4ck_4b0yk6SKbjK1sr67Iw2wh6YdAvJ8aqic=w150-h150-k-no-p"]}], "resp": {"time": 1580313619572, "text": "William, its great to hear that the Moody team for your BMW back to you in such a timely matter and made sure to give it back to you all clean and looking better then ever!!! We hope to see you again in the future, if needed! Safe travels!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "106269347435424272350", "name": "Jerry Pellegrini", "time": 1600701394571, "rating": 5.0, "text": "This place is hands down one of the best and most professional body shops I've ever had the pleasure of working with.  They called within 30 minutes of filing the insurance claim to perform the estimate.  The estimate was ready the same day we dropped it off, the work started immediately after the estimate was complete.  We got regular text message updates on the progress AND the car looks fantastic!", "pics": null, "resp": {"time": 1600780074199, "text": "Jerry,\n\nWe are so pleased to hear how great your experience was and that the Moody team could assist you with the repairs to your vehicle and that the process was smooth and completed in a timely manner. We sincerely appreciate the positive feedback and hope you have a wonderful day!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "111736761384786392143", "name": "Kelly Frost", "time": 1576024604837, "rating": 5.0, "text": "The night before Thanksgiving I hit a deer on the way to the gas station. Gerber Collision (Moody) made the process quick and painless! In less than a week I was back in my truck! They kept me informed throughout the process and made sure all my questions were answered! They even took care of my rental return to Enterprise! 10/10 overall experience from drop off to pick up!", "pics": null, "resp": {"time": 1576081138884, "text": "Kelly, its awesome to hear that the Moody team was able to get your vehicle in and out of repairs in such a timely manner and you had such a great experience overall! We hope to see you again in the future, if needed!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "108665713586564989508", "name": "Camron Morgan", "time": 1557039900220, "rating": 5.0, "text": "Highly recommend using these guys! Had my bumper replaced and can't even tell anything was ever wrong with the car. The paint looks great and was updated through calls the whole time.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "107762235413680156701", "name": "Sam NA", "time": 1534531588131, "rating": 4.0, "text": "UPDATE: I spoke with Kevin and he acknowledged that there needs to be a more thorough inspection under certain circumstances. I felt comfortable speaking to him and believe that any customer service issue that I have will be satisfactory resolved if I choose to use them in the future. Original  Review. Not impressed, they were slow, one customer and walked right by me. Quote was incomplete and the guy helping me didn't know what he was doing.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "100869855676442058294", "name": "JENNIFER BROOKS", "time": 1507918908940, "rating": 5.0, "text": "Absolutely love this place... great people who are friendly and experienced experts. My vehicle was rear ended and damaged pretty bad and these guys repaired it so well that you couldn't ever noticed it had even been in a accident. They matched the paint perfect! Good job to all of you guys and supervisors who helped fix my ride...😃", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "112302429814427592375", "name": "taron hodge", "time": 1557593566552, "rating": 5.0, "text": "Great experience, staff was courteous, and experienced. Quick turn- around, highly recommended", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "104339481066766160576", "name": "Tiffany Eunice", "time": 1498595051514, "rating": 5.0, "text": "They were just so nice and very professional. I came in with my bumper popped up and the fixed free!!!\nIt was just a matter of putting the clip back together.\nThank you.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "115734750687442420779", "name": "Josh Hodge", "time": 1550521937523, "rating": 5.0, "text": "Great service and these guys are really good at what they do.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "107811999911368492858", "name": "Carl Toups", "time": 1550798505650, "rating": 5.0, "text": "Great body shop, quick turn around and accepts most insurance jobs. A shop you can trust.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "113943665617692900550", "name": "Charles Speakman", "time": 1509333821525, "rating": 5.0, "text": "They do really good work and you can trust them they will make you happy", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "110904283413986216313", "name": "Febra McGuire", "time": 1578780897503, "rating": 1.0, "text": "Keey your car too long", "pics": null, "resp": {"time": 1579552364674, "text": "Febra, thank you for your feedback and we want to sincerely apologize for any inconveniences this may have caused you. We understand that Wally N. has contacted you and spoke to you regarding the back order of the items for your vehicle. We want to thank you for letting us address your concerns."}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "116765373574442611175", "name": "Robert McDonald", "time": 1515445599124, "rating": 5.0, "text": "These guys did a great job on my truck repairs.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "102489952467758289037", "name": "Orrin Carter", "time": 1519703382264, "rating": 1.0, "text": "Worst experience in my life! I wouldn’t send my enemy to this place! I should have followed my first mind to not let my truck be taken there. Thinking that since they do work for Geico that they would be fair. The adjuster JY was unprofessional and is in the wrong business dealing with all types of ppl. Two supervisor called me to talk with me and was all nice but wanted me to give them a call and when something did come up no answer . They raised the price up and was about to put savage parts on from junk yards!!! Then broke my truck down of unnecessary parts , sent me 3 pic of my truck where the damage was and made a mistake and included pic of a Durango include with mine in the estimated online where they dropped the ball at so they could total my truck out. $7,500 their price after I was haggled on what should be fixed or not. The under part that I was told would be looked at by Geico in Macon under and told me that everything would be fixed and even sent a wrecker for it. When I saw this scam I sent for my truck to be taken to another shop of my choice in Trussville where I live at and the price dropped to $2500 . What’s the use of having insurance for 8yrs without any incidents and was deem not my fought and still getting the run around but I guess it’s just a moody thing then , I have a 1,500 rental car limit that I pay for in my and JY told me that it had to be back today mon 2-26-18 or they wasn’t going to extended it til the next day when my truck will be ready I’m the am, how about I called jay (sup) while I was at the shop because they needed to ask him something and he told me he was going to call them and did. They just threw my parts in the back of the bed and shipped with all the unecesary parts too! New parts hand to be shipped in . This is just a scam place too much unprofessionalism going on after JY started talking to nice nasty and rushing me off the phone like I was Bothering her! So after I go meet with the ppl in Macon and send all the paper work and the pictures that I have with m parts and the Durango and explain that I had to miss work tonight because of the treat that JY told me .Also the shop ppl a security system that pick up everything that she said to them about me and my truck which is very unrespectful because they played it back so I could hear her and what she said !!!!", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "110904283413986216313", "name": "Febra McGuire", "time": 1578780897503, "rating": 1.0, "text": "Keey your car too long", "pics": null, "resp": {"time": 1579552364674, "text": "Febra, thank you for your feedback and we want to sincerely apologize for any inconveniences this may have caused you. We understand that Wally N. has contacted you and spoke to you regarding the back order of the items for your vehicle. We want to thank you for letting us address your concerns."}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "102794140892572455840", "name": "madd1966dh", "time": 1475173795817, "rating": 5.0, "text": "Quality quick service,nice team members this is the place to fix your car", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3vNWV38Im8UgXaBScFKRzoekGgkT5U9-IddzU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "113057064863809029734", "name": "James Eunice", "time": 1498594767817, "rating": 5.0, "text": "Amazing service. My wife went in with a small issue and they fixed it for free because it was just a clip out of place. They could have over charged her or said it was somthing bigger but they didnt just amazing people.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "107530512842076995879", "name": "Leigh Cline", "time": 1479391970331, "rating": 5.0, "text": "Very caring people, excellent results on repairing my BMW after someone backed into it. Like nothing ever happened.", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "111515802640089346695", "name": "John and Jean Cater", "time": 1583375985471, "rating": 5.0, "text": "Excellent efficient work", "pics": null, "resp": {"time": 1583430925524, "text": "Thank you for your kind words! Have a wonderful day!!!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "113044405225188009670", "name": "jean BRADSHAW", "time": 1580518841922, "rating": 5.0, "text": "Did a great job", "pics": null, "resp": {"time": 1580748431613, "text": "Jean, thank you for this fabulous feedback! We hope you have a great week! Safe travels!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "102984105460586985262", "name": "Patsy Mims", "time": 1591920592846, "rating": 5.0, "text": "Fast service", "pics": null, "resp": {"time": 1591970147420, "text": "Patsy, thank you for this amazing feedback! We hope you have a great weekend!"}, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "109841564816354556175", "name": "Jerry Butcher", "time": 1498142457249, "rating": 5.0, "text": "The service, quality and response were all excellent! Great work ! Couldn't be happier", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "111472681156502942435", "name": "Mike B", "time": 1569127648710, "rating": 5.0, "text": "Fast and good service", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "104787403784250265991", "name": "edie jones", "time": 1526537772844, "rating": 3.0, "text": "Ok place", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "113792838389620032722", "name": "Johnathan Spearman", "time": 1505911676423, "rating": 5.0, "text": "Good prices", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
{"user_id": "117387169629376091097", "name": "Tay Jackson", "time": 1475972678674, "rating": 3.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8889737b9ba9a8db:0x558163db9059166f"}
