{"user_id": "102660152238004831377", "name": "WAYNE CULPS", "time": 1590759981970, "rating": 5.0, "text": "Great people to deal with", "pics": null, "resp": null, "gmap_id": "0x888a1bb557d34d71:0xdafb31122ec84154"}
{"user_id": "110655353419647124968", "name": "Eddie Pate", "time": 1605089638706, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x888a1bb557d34d71:0xdafb31122ec84154"}
{"user_id": "108046589439924485891", "name": "Melissa Harris", "time": 1544509604291, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88893c90de71caa1:0x2d758aeb274017ad"}
{"user_id": "114597511669487810627", "name": "Theresa U", "time": 1606268164476, "rating": 5.0, "text": "Great trucks.  Reasonably priced and all in good shape.", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "113398074876215555452", "name": "Robin White", "time": 1576621120687, "rating": 1.0, "text": "DO NOT BUY FROM HERE!!!!  We traded a nice Jeep for a truck. We didn’t even make it home before the transmission went out. When we got home my husband contacted them and they said to bring the truck to them and they would fix the transmission. However, we didn’t have the $400 to get it towed and they said we couldn’t drive it to them. So they eventually said that they would help pay for us to get the transmission fixed elsewhere. Needless to say they completely deny that they said that. They have done nothing but lie to us and it was hard for my husband to even get them to talk to us to begin with. I REPEAT DO NOT BUY FROM THEM!!!! If they would’ve done as they said we wouldn’t be leaving bad reviews!! If I could give a lower star rating I would.", "pics": null, "resp": {"time": 1576623526366, "text": "So sorry you feel this way, never did we offer to pay for the vehicle to be fixed elsewhere.  I can post the messages between your husband and us.  We traded \"as is\" I never complained about what I had to fix on the Jeep nor would I had said anything had you brought the transmission to us to have an opportunity to make you happy.  But to get on here and tell absolute \"Lies\" is slanderous to say the least.  I have read every word of our conversations and I suggest you do the same, that way you can get the facts straight.  As i quote the last thing he said \" i am going to dump on you\"/"}, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "114705894944949137217", "name": "Doug White", "time": 1576779883997, "rating": 1.0, "text": "DO NOT BUY FROM ACTION AUTO WHOLESALE LLC\n\nTransmission went out before I could even get home, after they told me it was just rebuilt. I made sure because it the 4060 in a 2000 GMC SIERRA 4x4, which if you know about that transmission you know they are known for going out. Anyway the only way they will help is if I tow it to a guy that they use, which works at the city dump. The same guy who supposedly rebuilt it already. Well I live over a hour away and to tow it there would cost $400. So I called to get them to pay for the tow but no they wouldn't do that. I don't have $400 to tow it out there, you see I traded a very nice Jeep Wrangler for the truck. So I found a shop to rebuild the transmission for a $1,000 and ask Action Auto Wholesale to pitch in half. You guessed it they are not willing to help me in anyway. DON'T BUY FROM ACTION AUTO WHOLESALE LLC\nLOCATE AT 34382 US-98, Lillian,Alabama 36549\n\nDO NOT BUY FROM ACTION AUTO WHOLESALE LLC", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "109783124202975818543", "name": "Valdemuir Daniels", "time": 1583057374292, "rating": 1.0, "text": "SMH. I have had my truck for a couple of months and still haven't driven it two weeks without something Going wrong wont stay running sat at a shop for two weeks still wont Stay running now fuel is shooting all over the place cant get a spare tire or jack still. Im so angry right now it just sits in the drive way. BUYERS BEWARE. THE OLDER guy is great but NO ONE KNOWS ANYTHING ABOUT WHAT THEY ARE SELLING  . NOW im stuck with an 18, 000 dollar paper weight its all about the sell.", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "114697598806805072473", "name": "Susan Nosnibod", "time": 1547505694643, "rating": 5.0, "text": "I am so happy with my new (to me) Acura. The buying experience was super comfortable. No pressure. Greg worked hard to see that I was a happy customer. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "106779283417073114988", "name": "Brady Kessinger", "time": 1536354556445, "rating": 5.0, "text": "I had the best experience purchasing a truck from Greg, (the salesman).\nVery experienced with all aspects. I have already refered others and a few have stated the same results as me. Will buy here again when the time comes. I highly recommend everyone to stop at this dealership and see the quality vehicles they have", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "114399683273970231860", "name": "Brandon Richardson", "time": 1571512537923, "rating": 1.0, "text": "Purchased a truck back in April and had issues with the truck right of the bat. The dealer did purchase the part that was bad but I was left with the bill to replace. Also title was never sent to my bank so my vehicle loan was switched to a signature loan which significantly increased my monthly payment. Still not sure where the title is.  I was in contact several times to remind them the bank had not received the title but still was not resolved.", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "106613076836031980045", "name": "Traveling Maedkes", "time": 1518907326906, "rating": 5.0, "text": "Nice salesman. Camper was exactly as advertised. Fairly priced.", "pics": null, "resp": null, "gmap_id": "0x8890a4754fa36abf:0x82282c1b258065e4"}
{"user_id": "110880723387520675366", "name": "Flavio Udinese", "time": 1604553858098, "rating": 3.0, "text": "great shop, they give great service, staff also good.", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "109187592670018017977", "name": "Stephanie Durnell", "time": 1548997875320, "rating": 5.0, "text": "My family and I were traveling back to New Orleans from my sister-in-law’s wedding in Nashville, and our truck’s serpentine belt and idler pulley broke. We were totally stranded with our two babies and a dead truck, six hours from home. It was after closing time, and my husband called multiple repair shops, but no one would help us. Magic City Auto Works came to the rescue! We had our truck towed over to Magic City Auto Works and were back on the road within hours. We were able to get home safely because of their kindness (and didn’t go into debt because of their fair prices)!", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "112004119025722729877", "name": "Ryan Unruh", "time": 1541713635498, "rating": 5.0, "text": "Just the kind of shop I was looking for. Honest, straight forward and fast. They gave me a very fair quote compared to many others. Talk to Chris, he’ll take good care of you and answer any questions you have. Glad I found this place.", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "103849489880963162715", "name": "Alexis A", "time": 1528330848878, "rating": 5.0, "text": "Went in with gas leaking out of my car. They started working on it immediately and within minutes fixed the problem which was a loose clamp on the filler neck. Didn’t even charge me! Nice place. If I have any other problems this will be the first place I head to!", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "107771655967321338369", "name": "Jerusha Turner", "time": 1600545293933, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "115676073525655490808", "name": "Julie Ritchey Miles", "time": 1546696928488, "rating": 5.0, "text": "Very ni c e here will get the job done and work with me", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "112831217261069935871", "name": "Melinda Richardson", "time": 1566192380028, "rating": 5.0, "text": "Superb service and a car wash!!", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "100510479662043222949", "name": "Ashley Dutton", "time": 1481054657801, "rating": 5.0, "text": "The most trustworthy and reliable car repair shop in the area!", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "101247234861396995593", "name": "Brandon Brown", "time": 1486534284032, "rating": 5.0, "text": "Very friendly and honest as they come", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "114108952756513832217", "name": "jenn virciglio", "time": 1503439846862, "rating": 1.0, "text": "Owned by a crook. Beware!", "pics": null, "resp": null, "gmap_id": "0x88891b8c981a6a33:0x8450e606b8235734"}
{"user_id": "106396704594523214085", "name": "Mike Rangel", "time": 1626726836562, "rating": 5.0, "text": "I purchased a great truck from them at the end of 2019. No complaints with the quality or price of the vehicle. I had a issue getting the title from the state but once I contacted Lakeside he promptly took care of it and I now have the title. Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "105784015644081790585", "name": "Brad Griffin", "time": 1599450459968, "rating": 5.0, "text": "I gotten 3 trucks from BJ Green and he always honest and up front.... All 3 have been solid trucks and would recommend them to anyone....They have my business for life... Thanks guys", "pics": null, "resp": {"time": 1602876883254, "text": "Thanks for your continued business Brad.  Look forward to getting you your next diesel"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "104868633543196427647", "name": "Timothy Sapp", "time": 1591296315092, "rating": 1.0, "text": "I bought the truck 5 months ago and BJ has yet to produce a title for it! Very disappointed and discussed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAanXNTX2Mzr2ibqF9tWmPB8KY6ToD2pQzWKdD=w150-h150-k-no-p"]}], "resp": {"time": 1602876834534, "text": "Sorry about the delay but you and I both know there is more to your circumstances."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "106559781597176960895", "name": "Michael Robinson", "time": 1606155013013, "rating": 5.0, "text": "If you need a good battery for a great price go there", "pics": null, "resp": null, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "117565732437598477797", "name": "Bill Kynes", "time": 1594267387510, "rating": 5.0, "text": "Great bunch of guys good value for the money on their vehicles. Having been in the Auto industry for many years I recommend it.", "pics": null, "resp": {"time": 1602876914441, "text": "Thank wild Bill hope all is well"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "116366043547851726343", "name": "Big Spam", "time": 1589989717473, "rating": 5.0, "text": "Great customer service good cars great prices", "pics": null, "resp": {"time": 1593551022804, "text": "Thanks for the awesome review"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "111339379030599176648", "name": "Deborah Vick", "time": 1438695068338, "rating": 5.0, "text": "We found the best 2006 Chevrolet Silverado at Lakeside Imports.  It runs great and we just love it.  The owner and staff are so helpful and nice.  If you need a great used car, make sure you visit them!  We are so pleased with our purchase.  Go there, you won't be disappointed.  Quality cars, great service.", "pics": null, "resp": {"time": 1476294978308, "text": "Thank you for the business, can not wait to help you again.  BJ"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "103737676487661534961", "name": "Ashley Burke", "time": 1533285597648, "rating": 4.0, "text": "I bought my Suburban from here about 3 years ago and I wouldn't have done it without BJ. He's a very kind man and very helpful in walking you through the process. He told me where to go and who to talk to with financing and he still remembers us after all this time. Very trustworthy and very delightful", "pics": null, "resp": {"time": 1534171038545, "text": "I thank you for the great review. We strive to offer superior customer service. If you would, please contact me. I would love to know how I can turn the 4 Stars into 5 Stars!"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "114551273287887196447", "name": "Ronnies Speedshop", "time": 1588534245923, "rating": 5.0, "text": "Best deal for a auto by far! Go see Bj", "pics": null, "resp": {"time": 1602877141207, "text": "Thanks abunch"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "111264011935649100276", "name": "Cary Quint", "time": 1526162198882, "rating": 5.0, "text": "I bought my Expedition here, and had an amazing car buying experience with Lakeside! They are very friendly and fair. I would highly recommend buying your vehicle from them.", "pics": null, "resp": {"time": 1530544870749, "text": "Mrs Cary thanks for your business and this great review. Can not wait to help you again."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "113411451205155989409", "name": "Michael Doe", "time": 1474994165693, "rating": 5.0, "text": "I don't leave reviews, but the service before and after the sale were absolutely excellent. I would recommend these guys to my family if they were looking for a vehicle, that's how much faith I have in them.\n\nIf you're looking for a great vehicle, don't forget to stop here before buying.\n\nMichael Cambre", "pics": null, "resp": {"time": 1476293911580, "text": "Thank you for your business.  Can not wait to help you again in the future."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "117411548960565263854", "name": "Kasey Feverjean", "time": 1436361796495, "rating": 5.0, "text": "Awesome experience! If you're in the market for a nice used vehicle, I recommend them. Ask for BJ or Edwin. They are great. They will go out of their way to make sure you find a vehicle to meet your wants and needs within your price range. I will be using them in the future.", "pics": null, "resp": {"time": 1556304072113, "text": "As always glad to have earned your business Kasey"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "113312220143177477566", "name": "Josh Baker", "time": 1437526893145, "rating": 5.0, "text": "Awesome staff and great deal. These guys will work with you and have a great selection. Love my 4runner!", "pics": null, "resp": {"time": 1556304028034, "text": "Glad to here you are loving the 4Runner"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "115950081485984638882", "name": "Baker", "time": 1535156636369, "rating": 5.0, "text": "bought a truck from lakeside this past week! could not say enough good things about this business & its owners! we had a small hiccup, but BJ went ABOVE & BEYOND to make sure we were happy & satisfied! we will definitely do business with them again! I greatly appreciate all the things they did for us to make this truck buying thing as easy as possible!!", "pics": null, "resp": {"time": 1556303965833, "text": "Baker sorry about the long delay.  Thanks for the awesome review"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "101568818423388373963", "name": "Eddie Murphy", "time": 1534854606456, "rating": 5.0, "text": "Great selection of used cars. Friendly , helpful people that truly appreciate your business.", "pics": null, "resp": {"time": 1556303993458, "text": "Thank Eddie hope all is well"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "113376805146589717190", "name": "Lucas Cooke", "time": 1437265474883, "rating": 5.0, "text": "BJ and Edwin at Lakeside Auto are two of the most helpful and \"bend over backwards\" type guys I've ever had the pleasure of working with. I've purchased two vehicles from them and will certainly go back when I'm in the market for another. They make sure all aspects of the deal are transparent and are there to help every step of the way: before, during AND after purchase. Thanks guys!", "pics": null, "resp": {"time": 1556304048950, "text": "Man thanks for the awesome review"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "117704302824496533846", "name": "Brent Koehn", "time": 1512356424089, "rating": 5.0, "text": "These guys are a pleasure to deal with. Seem to be very honest and straight up about everything. I couldn’t ask for better service. I’ll be back to do business again.", "pics": null, "resp": {"time": 1512497845312, "text": "Thanks for your business and the great review.  Enjoy that F150"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "114215762256610352136", "name": "Larry Saunders", "time": 1565278102647, "rating": 5.0, "text": "Great place to find a nice truck", "pics": null, "resp": {"time": 1565793032545, "text": "Thanks for the awesome review"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "117053745577176601139", "name": "David Travis", "time": 1521421626529, "rating": 5.0, "text": "Thanks B.J and Edwin for your help the Truck is the one for me what a deal guys I'm happy with my purchase, I will buy from you again.", "pics": null, "resp": {"time": 1526045934074, "text": "Mr Travis so glad to have helped you with your new truck and thanks again for your patience with the repairs.  Cant wait to help you again in the future.  BJ"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "111102377079759821052", "name": "Jay Day", "time": 1529578736106, "rating": 5.0, "text": "Honest and knowledgeable staff. Great experience", "pics": null, "resp": {"time": 1530544768258, "text": "Thanks for your business again Jay can't wait to help again. Enjoy that Tundra"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "110740265475990590854", "name": "David Nelson", "time": 1497049239773, "rating": 5.0, "text": "Best place to buy any vehicle. Very professional. Edwin and/or BJ will most definitely get you the ride that you want.", "pics": null, "resp": {"time": 1511196691998, "text": "Thanks for your business, can not wait to earn it again.  Enjoy that truck sir."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "108325394927434688474", "name": "cindie Carter", "time": 1345473313147, "rating": 5.0, "text": "BJ and Chris  were very professional in every way. We have referred several of our friends to Lakeside Motors and will continue to do so. Chris kept an eye out for us over a number of months ,after we described just what we were looking for. We found him to be a no pressure sales rep who simply wanted to match us up with the a quality vehicle that we would enjoy for years. Best car buying experience ever.... We will continue to refer our pack to you. Cindie and Larry Carter Owner of Walks and Wags, Inc. Mobile, Al.", "pics": null, "resp": {"time": 1556304133552, "text": "Thanks for the awesome review"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "114300020614768659997", "name": "Jennifer Green", "time": 1352066912442, "rating": 5.0, "text": "These guys really know what you need when it comes to buying cars.  They are a haggle free lot and they aim to please.  I have bought 3 cars from there now, and will definately use them again the next time I want to buy a car.  BJ, Chris and Edwin can help you find exactly what you need for your price range.", "pics": null, "resp": {"time": 1556304106967, "text": "Thanks for the awesome review"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "106272597340880851719", "name": "Michelle Lay", "time": 1500044414632, "rating": 5.0, "text": "Everyone is so easy going. Easy to handle business", "pics": null, "resp": {"time": 1511196391280, "text": "Thanks Michelle enjoy that 2500"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "113990079802971388052", "name": "Phil Rucker", "time": 1498340127554, "rating": 4.0, "text": "BJ is great! Not a great selection of reasonably pro e vehicles.", "pics": null, "resp": {"time": 1511196451794, "text": "Thanks for the review, hate we did not have what you were looking for. How can we make this a 5 star review."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "105156372667306425204", "name": "Candace Stout", "time": 1473527460389, "rating": 5.0, "text": "I have bought two cars from Lakeside imports great company with very reliable vehicles .... thank you BJ", "pics": null, "resp": {"time": 1476294636505, "text": "Thank you for your continued business. BJ"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "106423954391045041614", "name": "Carmen Adams", "time": 1550965079687, "rating": 5.0, "text": "Great customer service...", "pics": null, "resp": {"time": 1556303905924, "text": "Thanks for the awesome rating"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "116567257155020026129", "name": "Jennifer Grzenia", "time": 1416343136929, "rating": 5.0, "text": "Great customer service and honest folks! I would do business with them again and have referred my friends which says a lot!", "pics": null, "resp": {"time": 1556304087995, "text": "Thanks for all the great referals"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "113507236530032897754", "name": "MaryKay Kinlaw-Colantuono", "time": 1474935500644, "rating": 2.0, "text": "Drove 7 hours to get this truck it was nasty and 800 miles later dropped 7300 in a new transmission. Wouldn't trust them again.", "pics": null, "resp": {"time": 1476294579817, "text": "Thank you for the review, all criticism is welcomed. Since all vehicles are sold as-is, we always encourage people to get a mechanical inspection performed by a shop of their choosing before any purchase.  We have this disclosure plainly stated on our website and try to verbally state this on every sale. I do hate that you had a bad experience, but I am also having problems finding you in our database.  Are you sure it was Lakesideimports.net in Mobile, AL? I also wish i knew what vehicle you purchased. A $7300 transmission seems awful steep."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "101874695679859257826", "name": "louis quint", "time": 1526162725920, "rating": 5.0, "text": "Great service after the sale", "pics": null, "resp": {"time": 1530544811094, "text": "Glad we could help with that issue.  Y'all enjoy that Expedition"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "115798496907622524392", "name": "charles coker", "time": 1514471901153, "rating": 1.0, "text": "Drove thirty miles to buy a car the truck was rough I was still willing to buy the truck but he was unwilling to come down on price.", "pics": null, "resp": {"time": 1514582189988, "text": "Mr Coker, I am glad you drove in and looked at our truck. I hate that the condition was not to your liking, but we price our vehicles per condition so all discounts are already given with advertised price. I keep many pictures on the website and try to be very forthcoming with any imperfections. I hate wasting peoples time just as much as I hate my time being wasted. Just because you were not willing to pay the advertised price that you drove over for, should not justify a one star review.  I hate that we did not see eye to eye. I still cannot see the justification in a 1- Star review. Thank you, BJ."}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "118316186845075326458", "name": "Raymond Kuppersmith", "time": 1468367306871, "rating": 1.0, "text": "Not a good experience for me,and I 'll leave it at that, because am the one that made the mistake buying this vehicle from Lakeside.", "pics": null, "resp": {"time": 1476294851235, "text": "Mr. Kuppersmith,  thank you for your business. I do hate you had problems with the water pump on your truck.  I am glad you were able to repair this and hopefully now you are enjoying your truck. Come by and see us maybe we can work things out.  Thanks again BJ"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "114332772041399754499", "name": "Thomas Green", "time": 1345685423697, "rating": 5.0, "text": "Great prices and selection,", "pics": null, "resp": {"time": 1556304119347, "text": "Thanks for the awesome rating"}, "gmap_id": "0x889a4c557103246f:0xaf06aa29e19a0dee"}
{"user_id": "113266574414140912106", "name": "Ashley Lanningham", "time": 1623285228657, "rating": 5.0, "text": "Had the best experience ever buying a truck today. Lukas was more than helpful and patient with us today. He answered all the questions, and even got three different keys in the rain for different trucks! The atmosphere here is totally different than any other car lot, they are not pressuring you in to anything and not trying to get you to drive what they want you too! They are definitely there to please the customer!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "118067328660304621966", "name": "Jaime Pettaway", "time": 1622122157178, "rating": 5.0, "text": "Absolutely amazing customer service.  I purchased an SUV that had some issues after I bought it and they made it right with no questions asked.  They even came to Birmingham to pick it up.  My salesman, Jordan was so kind and very helpful.  I 100% recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "107683949462867094345", "name": "BobbieJo Salyers", "time": 1613239522053, "rating": 5.0, "text": "Jordan was amazing.  We usually use Carmax and avoid dealerships like the plague.  Our experience here has changed our opinion and now we have 2 options for the purchase of a used vehicle.  No pressure tactics used and the honesty was quite refreshing.  Thank you guys for a great experience and an amazing used SUV.  Top notch for sure!!  If you have not visited this place..I would highly recommend you do.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwTH-M_Pls1Ilmdf6ao2XjtXR25DeRmNyaQVwH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "102422880622496043049", "name": "nathan7727", "time": 1614253840222, "rating": 5.0, "text": "I found Jordan to be extremely helpful and professional, without being pushy or high pressure. He quickly chased down answers to every question I had. He kept me in the loop during the process. He looked for solutions to options that I really wanted on the vehicle they had that I liked, and that I ended up buying. And he was just plain friendly and enjoyable to work with. I would ABSOLUTELY recommend you visit him for your next used purchase. Their inventory is pretty broad, and the vehicles are in great shape! You can tell that they really work hard at selecting top notch vehicles for their lot.", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "108575175106860665061", "name": "Jeff Glenn", "time": 1614290405071, "rating": 5.0, "text": "Great experience. Jordan was top-notch, very knowledgeable / friendly / prompt in his responses to questions and not a pushy salesman. Good inventory and fair deal on trade and purchase of truck. Thanks again Jordan!!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "111225252583352398295", "name": "Wesley Stephens", "time": 1593283903169, "rating": 5.0, "text": "We have purchased vehicles from other dealers in the past, and our experience with Young Motors was hands down the best by far! Moose and Jordan answered any question that I had and didnt make me feel pressured into a purchase. They have a great top notch set of inventory to choose from!!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "108093116067082831680", "name": "Thomas Wadsworth", "time": 1551459255221, "rating": 5.0, "text": "Great people awesome service fantastic cars n prices!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_bP5ZymV0ZZoAMJc6hwRxQi1EQmKLwhCiylgj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "109070395143440911977", "name": "Madison Hamilton", "time": 1527199649162, "rating": 5.0, "text": "I had a wonderful experience here! It was my first time buying a car and I was very nervous and inexperienced with car buying. Wayne did a tremendous job with helping me out and filling me in on everything I needed to know. He was able to help get my first car financed when I wasn’t able to get approved elsewhere. They have great quality cars for great prices! Be sure to ask for Wayne as he is very helpful!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "116841804313465703915", "name": "Glen Hutchison", "time": 1519362155835, "rating": 5.0, "text": "Thoroughly enjoyed the experience! Jacey took the time to send us pictures and answer all our questions. In our situation she was able to work out the details of our trade before we even got there.\nNo pressure, no high fees and a very easy process.", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "112946660020969549338", "name": "Michael Jones", "time": 1579806501896, "rating": 5.0, "text": "Troy, Wayne and the whole staff were great... Couldn't have asked for a better group to buy from...", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "106336784930953748043", "name": "Karen Phillips", "time": 1546397452904, "rating": 5.0, "text": "The owner was very professional at helping my husband find a tire for our car, put tire on,  and was done in like 10 mins or less.  I will recommend him to anybody if they need tires.  Thank you sir", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "108825724232681633543", "name": "Shyla Hutchison", "time": 1519403363822, "rating": 5.0, "text": "What a fantastic experience!  We found this listing on facebook marketplace, but weren't able to make it out to see the vehicle for a couple of days.  It was a bit of a drive, so I had lots of questions before wanting to make the hour drive.  Jacey was super quick to respond, so knowledgeable, polite, and helpful, and answered every question I had. She also sent me lots of extra pictures since we were looking for some very specific features. She even did quite a bit of preliminary leg work on letting us know if a trade was possible (it was, and very fair, in our opinion).\n\nOnce we finally made it out she made the entire process smooth, quick, and super easy.  She even cheerfully stayed late as we couldn't make it out until close to closing time. She was beyond polite and helpful throughout the entire process.  We couldn't recommend her or Young Motors more highly!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "104417848129158942698", "name": "Cory Smith", "time": 1517793698552, "rating": 5.0, "text": "Never been more pleased with a dealership!! Awesome customer service. Never had a problem with my 2015 GMC Sierra SLT 2500. I highly recommend that you stop in and check out their inventory!!!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "109200854935612194418", "name": "Michael Clement", "time": 1467162349863, "rating": 5.0, "text": "What I had been searching for happened to be nearly 3 hours away from home but I wouldn't do a thing differently. Worth the drive, dealer was honest about what to expect before I made the drive and I would definitely buy another vehicle from them. Good folks. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "107029284609619229093", "name": "Maggie Darnell", "time": 1558306847003, "rating": 5.0, "text": "Nice lot, just didnt have what we were looking for", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "100438055517958355993", "name": "Dalton Jacobs", "time": 1510161002816, "rating": 1.0, "text": "Sold me a truck with some issues and never fixed the problem... was in their shop twice for over a week each time.... hard to get in touch with owner/boss. Wouldn't recommend this place to anyone. Horrible visit. Truck is currently parked because of the issues. Older guy there is a rude as hell..", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "105235888418393424124", "name": "Kelly Grider", "time": 1480190904836, "rating": 1.0, "text": "Went here on a Saturday afternoon for a truck I had been looking at on their website for a couple weeks. Had all intentions of trading my brand new Jeep for a powerstroke they had.. that was until I went to ask to test drive and older man working inside told us \"Sorry we don't do joy rides. You can only drive them when you've got all your finances with you and ready to buy.\" Oh? I wasn't aware that's how car buying works. Yeah I bet I do go to purchase before I've even sat in the damn vehicle. Ridiculous.... and rude! Can't believe that's how they treat customers walking around looking at 40,000 dollar trucks. Lost our business instantly. 👋🏼👋🏼👋🏼", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "116949031919954303230", "name": "Wendy Uhlman", "time": 1561478560843, "rating": 5.0, "text": "Great customer service 👍👌👍...", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "109551599104831292882", "name": "Stallion 33", "time": 1530555045794, "rating": 3.0, "text": "I sat in their lobby.  No one talked to me . But that's cool.", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "116931085040259579108", "name": "lurch sawman", "time": 1520511891906, "rating": 1.0, "text": "Cash only  or you better get your own bank loans", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "104052835478070878463", "name": "Sean Chastain", "time": 1498870290852, "rating": 5.0, "text": "Super friendly people willing to find us the exact vehicle we are looking for. Go the extra mile. Thanks", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "101979032198217104959", "name": "Stinson Smith", "time": 1551375994579, "rating": 5.0, "text": "Best place around  by far to do business with", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "104540345650085274371", "name": "james wilson", "time": 1609330391844, "rating": 5.0, "text": "Great cars great service.If you are looking for a truck I promise you they will have it", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "115916028841807360092", "name": "JUMPKN 83", "time": 1479583807790, "rating": 5.0, "text": "Good quality vehicles and costumer service that cares about you and your needs", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "111048483203237155777", "name": "judi Ward", "time": 1573450258187, "rating": 5.0, "text": "Always a good deal there", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "100424931491425689194", "name": "Jake Elwood", "time": 1558906075821, "rating": 5.0, "text": "Great place friendly staff", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "100922688607988007323", "name": "Carl Black", "time": 1547510649964, "rating": 1.0, "text": "Brown headed bimbo that works there is impossible to get in touch with! Tried emailing and calling about pricing for a Jeep several times with no answer. Can’t believe this place is still runnin. What happened to customer service?", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "109066222682964638092", "name": "James Wilson", "time": 1472729491452, "rating": 5.0, "text": "Awesome vehicles and great customer satisfaction", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "117806548563084667397", "name": "cindy pruitt", "time": 1523057115067, "rating": 2.0, "text": "Didn't think I was worthy enough for help", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "100651845116460307337", "name": "Kimbernjohn Bruce", "time": 1511975546275, "rating": 5.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "109962325539336968851", "name": "R B", "time": 1551570532251, "rating": 1.0, "text": "Menace to community", "pics": null, "resp": null, "gmap_id": "0x888a1bd9d4718471:0xc0e34d1f5f5e6097"}
{"user_id": "105634278071424401842", "name": "Chandrya Alvis", "time": 1610124639499, "rating": 1.0, "text": "Hello, I’m a 21 year old 1st time buyer , I feel as if they played me about my warranty, my car & my overall sale. when I first got the car on June 18,2020\nI needed a oil change badly!! The car had 0% oil life! Once I did that I needed a new water pump , Also I soon discovered  my 2014 Chevy Cruze had a oil leak as well..\nthen the thermostat went out , I had to replace the battery all out these things came of my pocket with in 2 months of having the car\nalso while maintaining my car note and car insurance I’ve never been late or missed any payments due to the fact I work to pay these bills. I’ve only had the car 5 months and here goes the motor just gone out..\n\nwhen we recall all the problems this car had and I was fixing it every time something happen the mechanic and I agreed that it’s been a problem with the motor he also told me Chevy Cruze’s had a recall on their motor!!\nThe dealership never told me this! The mechanic did , now here iam 2 week later without a car , a rental , no communication from the dealership or warranty company just nothing I’m paying to get my car looked at  I’m missing work and I have to do everything alone every time I call GENE HE TELLS ME TO CALL TROY!! Finally I called TROY just wanting to get help with my car getting fixed by this 2 year warranty i supposed to have  because once I sent it to real good mechanic they told him I didn’t have a warranty!! That  I was supposed to have & they don’t know anything!! I had to find the warranty number alone and when I get Troy on the phone he’s “sick with COVID-19” so I guess that means hang up in my face because he’s not feeling well BUT NEITHER AM I!! I’m a 21 year old women who pays her bills on time and have to get to work!!  I really need my car due to me having two jobs and was responsible for getting myself to work. I feel like I bought a lemon!! Well proofs in the pudding my advice to upcoming buyers... TAKE A MECHANIC AND LET HIM TEST DRIVE IT !! It’s only one person at Langston motors that tried to help me during this process and that’s Troy daughters she’s a angle and I thank you so Much for trying to do what you can to help me!!! I really appreciate you the most!! Thanks for everything!\n\nSincerely, A angry black women.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "107175055370856552565", "name": "Mo Bd", "time": 1591204740187, "rating": 5.0, "text": "I highly recommend this company to anyone looking for superb customer service, excellent execution when assisting customers, along with being patient as well as specific when talking to a customer about parts and or replacement issues. This company is the best!!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "103186682314376005147", "name": "Cynthia Russell", "time": 1595549426882, "rating": 4.0, "text": "So far the car is still running , good sells man.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "116789128355650933913", "name": "Katie Marchant", "time": 1590688913548, "rating": 5.0, "text": "Excellent dealership they work with people . ask for Gene Martin", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "107635681327645968293", "name": "Betty McKelvey", "time": 1557010932712, "rating": 5.0, "text": "Langston Motors was a pleasant experience. Mr. Martin and his assistant were very helpful and kind. They had some great cars and I understand that he has a another lot in Jemison Alabama if anyone is interested very nice cars. And he will work with you to put you in the car of your dreams.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "101160071579410293273", "name": "Pamela Wimley", "time": 1545656070613, "rating": 2.0, "text": "The salesman was great that day.  The car maintenance light was on and when my mom took it back she was given the run around. We ended up having to get the oil changed at the dealership. So before you sign papers to purchase a car there, make sure everything is done because they are not doing anything once you buy and sign papers.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "108092603760436795631", "name": "Dennis Hurst", "time": 1602276033718, "rating": 1.0, "text": "By the time my wife and son left they paid over $25,000 total contract  for 2011 mustang v6 with very high miles .. My wife  and son tried to take it back but they wouldn't take it back .. I feel they just ripped them off bad.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "110117090765505416285", "name": "Peggy", "time": 1518300632207, "rating": 5.0, "text": "Great place for purchasing vehicles! Felt we were given fair price, treated professional, friendly and the paperwork went smooth/fast.\nWould recommend Langston to my Friends and Family.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "110419189598245206856", "name": "Violet Dray", "time": 1518829428605, "rating": 5.0, "text": "These people are great. They actually take the time to work with you and your situation. They worked and got us approved and into a  2014 Dodge Dart!!! I love it. Thank you rick and everyone!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "115808558347322758703", "name": "Justina Barrow", "time": 1514589094882, "rating": 5.0, "text": "Absolutely the best car lot in town. The staff are so sweet and go beyond measures to make sure that your needs are met. I absolutely love my new car Thanks Langston Motors!!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "103981470815027853215", "name": "Megan Green", "time": 1571352096087, "rating": 1.0, "text": "Not supposed to close until 6 got here at 5:20 wanting to buy a car. Seeing as how I get off at 5 and they were closed.", "pics": null, "resp": {"time": 1571354376777, "text": "I’m sorry for the inconvenience Ms Jackson I had a family emergency come up and had to leave a little early. Did you have an appointment? I’ll be glad to help you if you would allow us another chance"}, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "111745883790023382394", "name": "Pam Landefeld", "time": 1489195631192, "rating": 5.0, "text": "Absolutely the best car buying experience I've ever had. Thank you so much to Ryan, Jason, Troy and Dennis for making this so easy and comfortable for us. Would recommend these guys and Langston motors to anyone interested in buying a car!!!!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "113994507971529908964", "name": "Travis Culp", "time": 1557598678941, "rating": 5.0, "text": "the service was outstanding, i got an excellent deal and i would definitely recomend getting your next vehicle from langston motors. they have such a wide variety of options to choose from and they make you feel comfortable about your purchase. no pressure no rushing decisions. they actually let you flow and find the right choice for you.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "106242888302449994509", "name": "Julia G.", "time": 1525891937331, "rating": 5.0, "text": "Excellent customer service. Easy approval process. Great selection of late model used cars. Definitely recommended.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "101680535368814088068", "name": "Marchell Weldon", "time": 1555967027108, "rating": 5.0, "text": "Told them what I wanted and they put me in a great vehicle, love them", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "113471955870581882056", "name": "myra rogers", "time": 1512584441091, "rating": 5.0, "text": "This place is awesome ! The people are awesome ! And we absolutely love our new car ! Thank you Dennis, troy, and Jessica! Yall are amazing. ! I recommend this place to every I know !", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "116338841870542810654", "name": "Sylina Anderson", "time": 1520893600759, "rating": 5.0, "text": "Enjoyed my new car from Langston motor I really enjoyed the owner and the car lot the people was really respectful and was answer all my questions I had for them 💯 I had a nice experience with them .And  will continue to do business with them.\n-Pattie Tabb", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "108072922983620861857", "name": "Joe Lawson", "time": 1514225971067, "rating": 5.0, "text": "I had been all over the place trying to get in a new car. The people here actually wanted to help. Now I'm in a car i can afford and extremely happy with what I have. I would send anyone I knew looking for a car here", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "114247839805633589113", "name": "Mia Moore", "time": 1521086533484, "rating": 5.0, "text": "I Am Very Thankful For The Great Customer Service And I Love My Car 2014 Corolla I would recommend my friends and family", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "111168312521959952425", "name": "Brenden Bowden", "time": 1526485714124, "rating": 5.0, "text": "Excellent customer service. They made the car buying experience so much easier.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "107866039115838802697", "name": "hannah lewis", "time": 1524493646109, "rating": 5.0, "text": "Amazing people! Ive had so many issues with trying to get a car. Most dealeeships i went to would pretty much laugh in my face but the people at langston motors are amazing. They bent over backwards for me and looked at me as a person and not a potential dollar sign. They do not shop you around the banks making your credit drop from being pulled so much. They actually sit down, look at all the details and come up with a plan before they even send your credit to a bank.  Amazing people and great cars!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "107282561181965883931", "name": "Jeseta Mallory", "time": 1582719426423, "rating": 1.0, "text": "They had me test drive cars they had not even check out trying to sell me something and they hadn't even check the car. Also charging to much for a down payment on used cars", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "108114775527332189231", "name": "Nonaral Goldsmith", "time": 1532005777721, "rating": 3.0, "text": "Not a hugh selection, and not a great deal for a first time car buyer. My salesperson was great!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "106950653551136513679", "name": "Beth Price-Almeida", "time": 1485226808201, "rating": 4.0, "text": "We went to look at a vehicle we saw on the website and we weren't 'attacked' by salespeople. The cars seemed to be in excellent shape, although, we didn't have a chance at the time to do any test driving.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "114872958618633228823", "name": "Jennifer Boyce", "time": 1565106061836, "rating": 5.0, "text": "Buying a vehicle from Langston Motors was the easiest car buying experience I've ever had . The staff was friendly and didn't make me feel pressured or jerked around at all . Definitely recommend this place !", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "117243866894565595153", "name": "Laurie Bowden", "time": 1510019218352, "rating": 5.0, "text": "Dennis, Jessica and Troy all made the car buying experience as painless as possible. In and out under 30 mins.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "102327215144785552682", "name": "Deidra Wilson", "time": 1543970654491, "rating": 5.0, "text": "I love the car I purchased and he worked with me", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "106828684804784097765", "name": "Patsy Lowe", "time": 1574876716582, "rating": 5.0, "text": "Very good place to buy a vehicle", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "100187581189967673010", "name": "Sammie J. Stewart", "time": 1533001180586, "rating": 5.0, "text": "I had a 2 hour lunch break and drove off in my new used car! I def recommend for anyone looking for a vehicle!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "102065235131184574700", "name": "Ryan Jones", "time": 1481386577318, "rating": 2.0, "text": "Very pushy sales person who didn't follow through with his word of calling back with price of a car. We stopped in several weeks ago and still haven't heard back from him", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "112862816990322595334", "name": "Jesse Armstrong", "time": 1558533223877, "rating": 5.0, "text": "Mr gene will put you in dream cars only person ill ever do bissuness with !", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "102637819006569766620", "name": "Sheena Alexander", "time": 1521988873204, "rating": 5.0, "text": "Good people. Nice cars.", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "118295355225032817714", "name": "Freddie Gaddis", "time": 1563030657222, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "114945728355245236489", "name": "Fallon Martin", "time": 1491083163659, "rating": 1.0, "text": "Worst car buying experience ever ...Car. Was clicking after I signed papers they fixed it then hoses busted and then b4 30 days was car was broke down and no one would help at all", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "117961863750372888044", "name": "Jessica Cooper", "time": 1519694253227, "rating": 5.0, "text": "The best!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "112084915099562980616", "name": "Larry Davis", "time": 1495928281694, "rating": 5.0, "text": "Best people in Town!!!!", "pics": null, "resp": null, "gmap_id": "0x888925d27e10c40b:0xcd531219c197cc25"}
{"user_id": "100641359340524806009", "name": "Patricia Seymour", "time": 1623160948150, "rating": 5.0, "text": "Love Gulf Coast Auto Group staff.  It’s the Audi that’s the problem.  I only have approximately 46K miles on the car.  She’s pretty.  But the convertible top has leaked since the purchase.  Then there have been so many problems with other parts, and a 3x AC problem/fix (qualifying it as a lemon), that it has been in the shop as much as it’s been with me.  I have a color-coded chart. When I let the “powers that be” at Audi know about the first few years of problems, they basically said, “FU with a smile”.  This car was actually built in Germany.  My German friends would be appalled.  They take their car quality very seriously.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100112269567781664576", "name": "Emily", "time": 1625625044646, "rating": 5.0, "text": "I had a great experience purchasing my new car from Gulf Coast Auto Group. I highly recommend Mr. Kenny Cunningham. He was professional, honest, friendly, and made my buying experience easy and fast. All of the staff I spoke with were friendly and professional. I will use them in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "111938768679638661524", "name": "Ellie M", "time": 1621556496921, "rating": 5.0, "text": "My service representative, Laura Collier, is wonderful! She always ensures that every issue is resolved. We have been extremely satisfied with the service that she and the mechanics at Audi of Mobile have provided to us over the past 5 years with our two Audis. My son took his Audi to another local repair shop and they caused damage to the vehicle because they lacked the knowledge and skills to properly perform the repairs. We then took his car to Audi of Mobile and they corrected everything! I will ONLY have my Audi Q5 serviced at Audi of Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100565455965795209337", "name": "Makenzie Brenner", "time": 1613921814076, "rating": 5.0, "text": "I admit I was nervous to purchase a car online from a dealership over 6 hours away, but Gulf Coast Auto, specifically Devon made the experience seamless. Great communication, fantastic customer service and product knowledge. It was honestly the best experience I could’ve hoped for. 100% worth the road trip down and I am obsessed with my new car!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110817360332479332803", "name": "Queen Royalty", "time": 1613779269412, "rating": 5.0, "text": "Everyone there is so nice and helpful. The finance department and the sales person (Alfredo Montes) made sure we understood the offer for our Volkswagen Atlas.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112805924154645928935", "name": "Myra C.", "time": 1565860456598, "rating": 5.0, "text": "I went to Porsche of New Orleans and they were trying to blantantly make the 2018 Macan I wanted inaccessible. These fools really tried to make me put down 20,000 for a 500/month car payment. AVOID THAT DEALERSHIP AT ALL COST. They did not want to sell to a African American woman. Anyways, I found 2 more 2018 Macans in the Mobile area the same evening so we decided to go the next day. BEST DECISION EVER! I traded in my 2014 Infiniti Q60S that I loved dearly for a 2018 Porsche Macan! As a traveling CVOR tech, I needed more space and Kendarrius ensured that I didn’t leave without the vehicle that I wanted! I literally pulled up at 12:15 and was driving off at 4:30!! That was crazy fast, but if you are looking for an amazing deal on a beautiful car, THIS is the place to go. My monthly payment is 585/month on a PORSCHE!! That’s unheard of! They knew I wanted the car and this dealership made sure I left in it without having to eat bread and water for the next couple of years!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPMjuE6t-nrGp_VDRqaVxv5wut1tkjJYEmrndB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGI3mdzmpiG-nORkuYFClc2Bpn_6tWSNfTCmxE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNE_6zHkKNIJ5awTKYKW-RG0rZr0tyuCKJiQUJs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "104784565688095890916", "name": "Monica Mingo", "time": 1592176454485, "rating": 5.0, "text": "My last two vehicles were Land Rovers.  I narrowed this purchase to an Audi or a Land Rover.  Devon took me on my test drives after donning a mask and I left with total knowledge of the Q5.  I went to the Land Rover dealership and was left knowing the same about their vehicles as I already knew upon arrival.  I was also unhappy with the attitude once I requested the salesman wear a mask during the test drive.\n\nI called Devon the next morning to let him know that my husband and I would be returning and, when we got there, Devon was ready to go.  This young man has received several awards and accolades based on his performance and knowledge of Audi vehicles. I noticed two certifications on his desk.\n\nHeaded there my husband told me we were not going to buy the vehicle today and that this was simply an exploratory mission and that he wanted to test drive and then get the information in order to make a thoughtful decision.  After speaking with Devon at length, we ended up buying the Q5 same day.\n\nDevon simply makes you feel good.  You sense his honesty right up front and there were no questions he couldn't answer.  We truly felt we were in extremely competant hands.\n\nThank you to Devon, the auto group, and for making it easy to jump the Land Rover ship and become a member of the Audi family.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113176571186060876778", "name": "Keri Van Atta", "time": 1595680381439, "rating": 5.0, "text": "Alfredo Montes was very helpful and nice. We ended up not being able to afford the car we wanted, but he never made us feel bad or embarrassed. And most importantly he didn't make us feel like we wasted his time. He went above and beyond for us and I really appreciate it! Thanks Alfredo!!😊😊😊", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "106232225682313082666", "name": "Lee Lee", "time": 1602366220389, "rating": 5.0, "text": "Courtney was so accommodating & super nice. Thanks Courtney- appreciate!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110987515900613283838", "name": "Daniel Flores", "time": 1591199633862, "rating": 5.0, "text": "Purchased a VW all over the phone with Doug Klezmer. Doug took great care of me with a very smooth and convenient purchase. Very happy all the way around. Wish all car purchases were this easy! Thanks, Doug!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110270196807091139158", "name": "Michele", "time": 1563422147881, "rating": 5.0, "text": "Me and my husband have had so many bad experiences here before the name change and new management or whatever. We always made appointments and would be there for 3 or 4 hours, we hated going there and the customer service was horrible! Today was the first time we've been there in at least a year or more and we were amazed at how much more better it is now. Our appointment was at 1 and we were out in less than an hour. Sean took great care of us and kept updated about what was going on with our car! The customer service was AMAZING! We have never experienced such great service like we did today. Thank you so much Laura and Sean and everyone for such a great experience and service we received today from you all!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113746022303116937483", "name": "Wayne Douglas", "time": 1590879460985, "rating": 1.0, "text": "This dealership is very deceptive and dishonest. My salesperson was Alfredo. I specifically asked them to run my credit only through VW and stated that on the credit application. I found out a few days later that they had run it through all 3 credit bureaus instead and when I confronted Alfredo about it he said that that is just the way they do business and that my credit won't be hurt if I buy a car from them. My credit score dropped 24 points because of their unethical sales tactics. Most car manufacturers have their on inhouse financial arm so when you run your credit directly through them you only take an 8 point hit so that's why I made the specific request. Because I value my credit score so much it is very high and now I am reluctant to have it run at another dealership to get the car I want because of Alfredo and his companies dishonesty. This is just the worst fo many misleading statements Alfredo made to me. You're better off driving to one of the surrounding cities to buy your next vehicle than from here.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112133886211962111704", "name": "Krista Blanton-Goguen", "time": 1545329722940, "rating": 5.0, "text": "We recently bought our first Volvo. AJ has gone out of his way to make this experience as seamless as possible. His knowledge about the car far surpasses any other dealership we have worked with.\nThe vehicle is amazing and capable of so many things.  Each time the technology out smarts me he is always available to answer my text or phone call and walk me through it.\nI just appreciate the extra effort he always goes to to make us feel valuable. I love my Volvo and don’t plan on going anywhere else for my future vehicles.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "108163161375008211605", "name": "Robert Sanders", "time": 1581438953720, "rating": 5.0, "text": "Had a wonderful experience from my first contact to walking out the door. Zach was great and took care of my wife and I. Recommended this place to everyone since buying a car and will go back for our next vehicle.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112669531542555598298", "name": "Patrick Isbell", "time": 1557610667316, "rating": 5.0, "text": "My wife recently purchased a used 16 Beatle convertible that was a recent lease turn in. Devon was an awesome salesman and made us feel like family during the entire experience. I believe we got a quality vehicle and a reasonable price. I know she will be thinking of her buying experience and the welcoming employees whenever she drops the top this summer!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "106560910201391584571", "name": "Edward Thomas", "time": 1566620902121, "rating": 1.0, "text": "Gulf Coast Auto Group should change their name again, because of one simple question- do you give military discounts? No one in the service department knew or was unwilling to give at least 10% off. The parts department gave 10% off for military when I purchased 4 spark plug not less than 15 minutes laters. Military service people active and retired I will inform you don't buy anything from there without a discount 10% or higher, & at this point it should be higher.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "117340162641036974729", "name": "june newton", "time": 1537998509908, "rating": 5.0, "text": "THIS THE PLACE!!\nConsidering a new car, this is the place! My husband and I bought 12 cars in our lifetime - this experience was by far the most professional/personable buying experience. The consultant, Santwan, was knowledgeable beyond measure, unlike the run-of-the-mil hunting salesman. The entire experience, from consultant, to floor manager [John], to Finance [Danny], to the GM [Mark].  Wow, treatment like the customer is a REAL PERSON not just a customer buying one of their cars - really, they have hearts and personality? We couldn't believe the care and the detail in service.  You go Gulf Coast Auto Group!!", "pics": null, "resp": {"time": 1537998874907, "text": "Hi Ms. Newton, thank you so much for the kind words! We are thrilled that Santwan, John, Danny and Marc are an integral part of our team. We are so humbled that you chose Gulf Coast Auto Group!\n\nAshley Allen\nBusiness Development Director"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113503513070520340384", "name": "Elizabeth Millette", "time": 1542572891504, "rating": 5.0, "text": "I recommmed this dealership to anyone. They made the car buying process easy! We first contacted Melissa from their online sales department. She was always quick to respond and answer our questions about a specific car, but never pushy or bothersome. When we were ready, she set us up an appointment to come in to the dealership. From that point we worked with Brittany Smith! She was a pleasure to do business with. Brittany was very friendly, knowledgeable and never made us feel rushed or pressured. We couldn’t be happier with our new car and the service we received at Gulf Coast Auto Group.", "pics": null, "resp": {"time": 1542573666666, "text": "Hi Elizabeth, we are so happy you’re loving your new vehicle! Brittany and Melissa are key members to our sales team, and we are lucky to have them! I’ll pass your kind words on to them and our management staff Monday morning! Thanks again for giving us the opportunity to earn your business and we look forward to serving you!\n\nAshley D. Allen\nBusiness Development Director"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100488610636773159059", "name": "Chris Mayfield", "time": 1532990891732, "rating": 5.0, "text": "These guys were amazing. They knew I wanted the car, and got the price and interest down to what I could afford. I would highly recommend this dealer.", "pics": null, "resp": {"time": 1534967088249, "text": "Thank you Chris! We appreciate your business and congrats on your new car!"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100214355400301326809", "name": "Christian", "time": 1537998404303, "rating": 5.0, "text": "I had an awesome experience with Gulf Coast Auto Group, after 7 months of searching for the right car and having poor experiences with other dealers across the nation as I live in Colorado, I was thrilled with my experience here. Santwan Wiley is the MAN. If you guys are looking for an excellent client advisor who will do everything in your best interest in helping you get into an awesome vehicle, he is your guy. I appreciate all the effort the team put in and his effort in to making sure that car was mine. I did not feel pressured at all and this was by the far the bestcar buying experience that I have had. I Cannot wait to get down there and take receipt of my new 2015 BMW X5! Thanks guys for an awesome experience!!", "pics": null, "resp": {"time": 1542990194503, "text": "Thank you for the great review Christian."}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "114598941876604798679", "name": "Carly Martinez", "time": 1574792357594, "rating": 5.0, "text": "thanks to mr devon for helping me buy my first car!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110632320059569299864", "name": "Becky Dunn", "time": 1557355942950, "rating": 5.0, "text": "The is the best car dealer i have ever dealt with and mr. Paul Stanley is the best to deal with!! He will treat you right i love my Volkswagen !!!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112970522726811636072", "name": "Anthony Cook", "time": 1535766796869, "rating": 1.0, "text": "I leased a 2018 Volkswagen Jetta from this dealership on June the 27th. It is now August  6th and I have yet to get my tag paperwork. I had to call the bank to get my old car loan extended so my old car loan would not go in collections. Not only that shortly after I leased I noticed a small ding on my hood. I went to the dealership to see what they could do and they said it would be no problem to fix. It has now been over a month I haven't received a call or a text. I know the dealership has recently changed owners, but the management at this establishment really dropped the ball. My family will no longer purchase or lease any vehicles from this dealership.\n\nI did try to call you. I left a message and no response. Why would I have expected anything different.", "pics": null, "resp": {"time": 1533650839757, "text": "Anthony- I sincerely apologize for this inconvenience. We expect exceptional customer service, and we regret that we missed that mark. My name is Ashley Allen and I am the Business Development Director here at Gulf Coast Auto Group. Please call me directly at 251.301.0013 so we can get you what you need asap."}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100253325127820996916", "name": "Michael Kolbe", "time": 1558022068423, "rating": 5.0, "text": "Thanks Devon! Great experience and a perfect vehicle!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "111104329649903391423", "name": "Lisa Wurst", "time": 1566833164216, "rating": 1.0, "text": "Stated that they did not have to follow through with what was written on my leasing contract “Since Dean sold it to us.”", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "103976369969660905956", "name": "Debra Hawk", "time": 1627876690923, "rating": 5.0, "text": "Look no further, these guys have it all. At least if they don't have what you are looking for they will go find it. Literally tell them what car or SUV your looking for and Dylan will find it for you. With clean, dependable used vehicles they also have easy financing. Go see Dylan today at Southtown Motors in Hoover by Krystal's.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNX7EWzXeDnl6x6F6oMJeXnW5ZqFFZaKzOlVoqV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNswa3f68_Mlym3M-XPiLciJXhwPsFTvfpBooe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOjglPzVVaPD9cppz7roSyzwVk3b_WK1iVsEJSQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNH45PkPhOxKx1qr0M0WVBpEqI8qmZ7ntoIfiNp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqXCPOCK_S1FK7QOYjkdA4nbhs5Dvq7cucs6rD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNr4Xsc7d0_WsndM8k7xfu5LNJpTGQ-nquKg2uq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPVKV_LSm5RJEydPUXTYIELLhkx2hCcDT3c0cWO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSxosrcNG_S8zGhtbq_6HnSinQaU38vPjA4cPi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdOKbg2tBqXxxd2YaX4KUSVTk-jC2iMa0zijQ1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlnd-q0ejeyWFbJ-YhbDIAxc9vXAgoCinRmfg6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCBJtXshZo7hFH7T_2rGtEtUJ8GqU7CXh0-JNl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORyM1eUpvxwSFCW5FNYo_aucrZIW6GST5hs85-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx9uPbOBLzVFQBUHYVQ79qdzhAL79l9oJ6yvTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONzUcSPpb0aWX4lVUe5V0luby8Nphze-G9nuQV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQZQHjNpXmgbLyrKjiREAY0jTIxZJC5pqpesBt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPoVmHERVU_bpxtSzwQnbJ618DDxJDcUybqr6o8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMbMklW0sL6rJ4ro-J3r1QGhpmzxur2TUkXDoSq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115302279799297074516", "name": "W. Washington", "time": 1626040479580, "rating": 5.0, "text": "I don't write reviews, but I had too for Hoover Southtown Motors. It is by far the BEST dealership I've ever visited. From the moment my husband and I walked on the lot, God sent Dylan directly to us. He was very knowledgeable of the vehicles and very professional. We prayed that God would send us to the right place, and he did. Dylan really took the time to actually talk to us about what we was looking for in regards to the best vehicle for us. I'm so thankful God led us there. The finance manager and the other employees also made us feel welcomed. I can see this business rising to a new level. I pray it continues to grow and prosper in Jesus's name! Thank you Hoover Southtown Motors for being a business of respect, professionalism, and integrity. God Bless!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112811044753344884553", "name": "Eric McGuyer", "time": 1627322782874, "rating": 5.0, "text": "Had a great experience at Southtown! Came to look a vehicle for our son. We were on a specific budget and they were very accommodating. They didn;t have a vehicle on they lot that fit what we were looking for, so they went out and found it for us. They delivered a no pressure expience that won them some repeat customers.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106292033002501851660", "name": "Kim McLeod", "time": 1619799667984, "rating": 5.0, "text": "VERY SATISFIED!!! Before coming here I visited several dealerships and by far this is the best car buying experience I have ever had. Thanks Dylan! I look forward to my vehicle being delivered which they were happy to do even though I live 2 hours away! Truly awesome service and anyone you have the opportunity of crossing paths with are genuinely nice! Thanks for awesome service! They offer it all for a nice one stop shop pressure free.", "pics": null, "resp": {"time": 1619818076901, "text": "Thank you Kim for the 5 STAR opinion of our Dealership team here in Hoover.!!! We always try to go the extra mile (or hours:)  to make sure everyone is satisfied. You are our next best customer.\nHoover SouthTown really does appreciate you taking time out of your day to give your honest opinion:)\nI will make sure Dylan does know how happy you are with his service before, but most of all, after the vehicle purchase. Thank you Kim."}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107682329589676966281", "name": "Walter Davie", "time": 1622073257660, "rating": 5.0, "text": "What a find! And, I am not just talking about the great vehicle (Toyota FJ Cruiser) but the entire dealership. As soon as you walk onto the lot you get a great feeling about a reputable dealership. I met Craig right off and he was friendly, professional, and went out of his way to assist in a great car buying experience. Hoover Southtown Motors is a great place to do business with honest, customer focused staff. I will return and highly recommend to others. Thanks Craig for helping me locate and purchase a great vehicle. Excellent experience from start to finish!", "pics": null, "resp": {"time": 1622146148036, "text": "WOW!! Thank you Mr. Davis for your great 5 STAR specific review! I will let Craig know today on how happy you are  with his service on the Toyota FJ Cruiser. Our whole TEAM appreciates you."}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114529224800696445938", "name": "Lawanda Brown", "time": 1626321659247, "rating": 5.0, "text": "My husband and I have been looking to buy a Hyundai Equus for a few years. We found the dealership by the name Hoover Southtown Motor.. We had a great salesman Mr. Craig Robert. Thank You so much for finding my husband Gary dream Car ...I will tell anyone they are the best dealership to buy a car from.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnShIygvfpmesUV85Blc1SVfERUSJDawL0sSBn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113391199832370698518", "name": "Jerred Norris", "time": 1613507410551, "rating": 5.0, "text": "Had a great experience with Dylan Freeman. I was working two full time jobs and didn’t have a lot of time to be really interactive and involved. I told him the truck I wanted, what I’d like to see in regards to financing, and what I had as a down payment, and he nailed it. I couldn’t make it to the dealership at the open time, and he stayed an hour pass closing to get me going. It’s always awesome to have someone work with you in situations like that, and he did.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPoTC1JY1MAyiL2xOKfY_4wq0kTnFMBAzwudJAH=w150-h150-k-no-p"]}], "resp": {"time": 1613688977055, "text": "Hey Jerred. ..Thank you so much for the  5 STAR  detailed review on how we could help with the truck purchase   !"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100015191081247976228", "name": "nicole turner", "time": 1623380196657, "rating": 5.0, "text": "I bought a car from David Cooper 21 years ago and it’s been a continued pleasure over the years to know him. I recently bought another car and worked with Will Rowell along side of David. For the second time, I got a fabulous car at a fabulous price! David and Will are both conscientious, accommodating and the absolute opposite of pushy. If you’re in the market for a great car, these two are the ones you should call", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106667303303659109978", "name": "Matthew Mizzell", "time": 1614143302209, "rating": 5.0, "text": "BIG FAN OF SOUTHTOWN! Found a car for my wife online that I knew was a good deal based on my research. I had no prior dealings with Hoover Southtown but called ahead and spoke with Dylan who told me he would have it ready for me. When I arrived the car was out front full display mode. I got to know Dylan and learn the Southtown story and I’m glad I did. Southtown is a great local family run dealership that has been in our community for approximately 30 years. They are knowledgeable, helpful and honest. The car turned out to be everything I hoped it was and Dylan was able to give me a really fair price on the trade in also. I walked away with a great new car for my wife at a better net price than I thought was possible when I walked in. I also got to learn about their service discount for customers and took full advantage of it for another vehicle I have that needed body work. Another place had quoted me nearly $1,500 for that body work to replace things that were easily repaired by Southtown instead. Turns out no replacement needed. They fixed it up so quick they didn’t even charge me. I highly recommend this place, as well as Dylan. I’ll be back and finally feel like I have a go to car place now. Truly one of the best kept secrets in the community in terms of a quality car dealership.", "pics": null, "resp": {"time": 1615319193007, "text": "Thank you Matthew for such a super detailed review on your auto purchase at HOOVER Southtown Motors. I will let Dylan know how happy you were with his personal follow all the way through detail.\nWe appreciate you.  Don't keep us a local community secret :)"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117169094077610194228", "name": "zech 823", "time": 1617486200047, "rating": 5.0, "text": "Best Customer Service by far. Staff is very friendly and eager to help. Dylan our salesman was very knowledgeable and honest with us about the vehicles and was able to help us find a car for my daughter. The whole process was so easy. Oh and the bonuses that come along with purchasing is amazing.", "pics": null, "resp": {"time": 1618346746383, "text": "Thank you! We appreciate you taking time out of your day to thank Dylan & for representing our auto business so well ! We train every employee to treat everyone as family during this important purchase. THANK YOU !"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115954096957415070915", "name": "Jalen Hunter", "time": 1608411231461, "rating": 5.0, "text": "Gotta love Southtown Motors!!!! I believe this is my 3rd car purchased from them—great experience each and every time. This is a dealership with family values and honest intentions. Craig is a kind heart and goes over and beyond for his customers; Jason is a jovial spirit, honest, and means well for all who come and take a seat at his desk, and Jeff is the man of it all—takes in great inventory, executes excellent customer service. Awesome team! Awesome company! Go by and give them a visit!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104278363469437875329", "name": "Lauren M. Harris", "time": 1610380919933, "rating": 5.0, "text": "Great experience! I knew what car I was looking for but could not find anything I wanted locally or within a 250+ mile radius.  I told Jason and Will all the specifications that I was looking for and they made every effort to get a vehicle matching what I wanted and to get me the best interest rate.  Will was great to work with and kept us updated every step of the way until the vehicle was delivered, cleaned and ready to be picked up. Would highly recommend buying from Hoover Southtown Motors.  Could not have asked for an easier car buying experience!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100608351556138003546", "name": "Hunter Munholland", "time": 1614707451427, "rating": 5.0, "text": "Will definitely buy from again the next time I need a vehicle. Great service with experience. When I couldn’t get approved at other places I went, not only did they get me approved, but at a much lower interest rate.", "pics": null, "resp": {"time": 1615319632068, "text": "Thank you Hunter for the 5 STAR service appreciation, and I will let our financing department know how you appreciated their local help.."}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112494653092891189469", "name": "Rachel D", "time": 1617389867635, "rating": 5.0, "text": "Great customer service! After searching for the perfect car for weeks we came here and Dylan helped us get the car I wanted. Thanks again!", "pics": null, "resp": {"time": 1618346884204, "text": "Thank you Rachel.! I will make sure our team knows how you appreciated Dylan, ALL of or staff , & customer services. Thank you!"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105220677160494598714", "name": "Kristi Hashtag", "time": 1614473471386, "rating": 5.0, "text": "This place was absolutely amazing! They went above and beyond to help us in every way so that we could put our daughter in the perfect car for her sweet 16th birthday! My husband and I both plan on purchasing new vehicles this year and will definitely be returning to Southtown to do so! More than HIGHLY recommended!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101860919785145447902", "name": "David Fuino", "time": 1610241964088, "rating": 5.0, "text": "I have been looking for this truck for almost a year and a half. When I requested via the website if the vehicle was still available, Dylan called me within five minutes. We went down to take a look at everything, and every person at that company we came in contact with had a bright smile and was extremely friendly. The purchase process was super easy, and everyone was very informative of any question that we asked. I will absolutely recommend my friends and family to come here for their next vehicles.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118152832580153086824", "name": "Laura Davis", "time": 1613083844943, "rating": 5.0, "text": "Craig and J were awesome! I knew what I wanted in my next vehicle, they pulled up a list, and within a week’s time MY DREAM CAR was here! I can’t believe how nice this thing is. They went above and beyond to help me get exactly what I was looking for and made sure I was completely happy with it. Would absolutely recommend again and again!", "pics": null, "resp": {"time": 1613689121187, "text": "Thank you Laura Davis for taking time out of your busy day to throw the 5 Stars up. We Would absolutely love for you to recommend again and again!"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115504989764539621239", "name": "Keshia Syyt", "time": 1613771231405, "rating": 5.0, "text": "What can I say? I was headed to Krystals but got a car instead!!!! Dylan is so nice and super helpful. He is indeed a man of his word!! I am so so happy I chose Southtown Motors. The finance Manager Jason rocks!! He was quick and accurate and answered all of my questions. I will absolutely buy from Southtown Motors again!!!! Love Love Love my new car!!!!", "pics": null, "resp": {"time": 1613772678931, "text": "Thank you so much Keshia for writing the 5 STAR rating in your new car! Next time Krystal's are on us! We will let Dylan know you were very happy with all his help. Jason in Financing as well !\nWe appreciate customers letting us know how well we do for them.\nOr, any other ways we can improve in the entire auto purchase!"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114380076151727524352", "name": "Jordan Earl", "time": 1611098652038, "rating": 5.0, "text": "Hoover Southtown is the best! I didn’t even know what I wanted when I came in and Craig helped me pick out the perfect vehicle. When I came back to buy the car I was in and out in less than an hour! These guys are awesome and really know what they are doing. Thank you Southtown and Craig for helping take all the stress out of the car-buying process. I will definitely be a customer for life!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112624446462602145533", "name": "Preston Jones", "time": 1618959993072, "rating": 1.0, "text": "When I first showed up on a Sunday i was very excited about calling and getting some information on a truck. However when i arrived my salesmen had a horrible attitude and in a way told me straight up that i wouldn’t be able to afford a $40,000 truck that they had on the lot, and that they would look for something more in my price range. Was very un-pleased with the customer service. Will not be coming back!", "pics": null, "resp": {"time": 1622068540171, "text": "Preston, We appreciate the opportunity. We are a family owned business that does our best .. come see me anytime. , but we are not open Sunday’s.. :)   Thank you;)"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116530928146575667863", "name": "Jim Doggett", "time": 1623879478463, "rating": 5.0, "text": "What a breeze! No hassle, just fair and honest. Saved me thousands. Thanks Craig!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105778425518510355499", "name": "Sarai Garcia", "time": 1612483595466, "rating": 5.0, "text": "My family and I were treated with so much love and respect from them, and literally got the car I wanted within the week of meeting them! They offer so much more then just selling cars, and I will be going back for any thing I need! They’re great!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116561717894342165489", "name": "Deaushay Watts", "time": 1610662640583, "rating": 5.0, "text": "Southtown Motors was excellent and provided first class customer service.\n\nDylan and the team gave me a fair trade in value for my car and went over and above to help find the SUV I wanted.\n\nI highly recommend Southtown Motors.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111972864710517974734", "name": "Valerie Johnson", "time": 1601657379107, "rating": 5.0, "text": "Hey everyone!!! I want to tell you that I had THE BEST experience at Hoover Southtown Motors! Craig and Jason are the best! They were able to get me the best ride and the best rate! I walked in not expecting to drive away in my Dream truck that day! They made it happen for me and can make it happen for you! They were courteous and made sure that I was taken care of every step of the way! Your next ride should come from here! Thanks Craig and Jason for the great service!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105645330310349402457", "name": "Ryan Conwell", "time": 1606849043686, "rating": 5.0, "text": "This place is awesome. I worked with Dylan, and he was very upfront and transparent about every step during the process. I made a mistake a few years ago and was upside down in a car, and these guys helped me get a better car and an amazing deal! Can’t  recommend enough!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107371164365487580763", "name": "Thomas Gallo", "time": 1620336598864, "rating": 5.0, "text": "Only place I’ll buy a car from now on. Best customer service I’ve ever experienced! Be sure to ask for Dylan!", "pics": null, "resp": {"time": 1622067965904, "text": "Thomas Gallo.. we appreciate your compliments. We appreciate you"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116233463702776046959", "name": "Thomas Whitten", "time": 1608522070880, "rating": 5.0, "text": "My daughter had the pleasure of buying her first car from the sweetest, most honest, most respectful gentleman, Mr. Craig Roberts, at Hoover Southtown Motors! We also met Mr. Jason and he was such a nice man! The quick and easy process was so nice and we couldn’t have asked for better from start to finish! Thank you Hoover Southtown Motors, Mr. Craig, & Mr. Jason for being a blessing!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109166399048805805585", "name": "Asa Williams", "time": 1608418552786, "rating": 5.0, "text": "I worked with a salesman named Dylan Freeman and he was extremely helpful and focused on helping me make the best decision for myself. I had a lot of questions and he was more than willing to answer everything I threw at him. I would recommend him to anybody I know looking for a used car.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108935667802406683926", "name": "Aaliyah Bell", "time": 1599659590594, "rating": 5.0, "text": "I just got a car from Southtown Motors located in Hoover,Al. I had a great experience. I’m only 23 and was able to get my own car, and it was my first time. Dylan was a great help throughout the entire process. Would definitely recommend them to anybody else. Please do not get them confused with other dealerships. It’s the Southtown Motors on Montgomery Highway in Hoover, Al. They have very affordable prices for great cars!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110273171938696746147", "name": "Michael Willliams", "time": 1615611420114, "rating": 5.0, "text": "I recently purchased a BMW X5 diesel from Southtown motors Hoover. I'm very happy with my purchase, and extremely pleased with this vehicle. My Salesman Will Rowell did a Great job selling me My Suv. It was a wonderful experience because he did pressure me, and he made sure I got exactly what I wanted. I want to say Thank you Will, and I will buy from you again!!", "pics": null, "resp": {"time": 1619818701671, "text": "Thank you Michael , We can not thank you enough for your business. We love when customers take time out of the day to thank our team here at Hoover SouthTown.. Will Rowell will know what a Great job he did getting you your SUV, & the  wonderful experience you had here. Thank you"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100370469747466009720", "name": "Erica Shunnarah", "time": 1611937580163, "rating": 5.0, "text": "I just bought a new Lexus from Dylan at Hoover Southtown Motors. He was so helpful and willing to answer any questions we had. We are so happy with our new car and would highly recommended anyone to call Dylan.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117671122770922940274", "name": "Jeff Smith", "time": 1609251070829, "rating": 5.0, "text": "Five Stars!  I bought an OUTSTANDING truck from Southtown Hoover, Dylan was friendly, knowledgeable, helpful above and beyond.  I got a great deal!  Highly recommend Southtown Hoover.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115469317688533820026", "name": "Kenneth Smith", "time": 1609373212474, "rating": 5.0, "text": "Dylan was helpful and searched for what my wife and I needed. He was knowledgeable about most everything we asked and the questions he couldn't answer he took time to find the answers. I trust this business, and that says a lot about a used car business. I've been using them for over a decade.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108092659121798744666", "name": "Cary Lott", "time": 1606790142147, "rating": 5.0, "text": "These guys do a great job. The “used car Salesmen” mantra doesn’t apply here. Some of the most professional and genuine guys in the business. Great place to go and relationships matter to Southtown.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113682857770280913074", "name": "Maitena Perez", "time": 1606328170627, "rating": 5.0, "text": "Great experience! They were very helpful and also having a great attitude with dealing with customers. Made the process of buying so easy and know I’m in love with my new car! Would definitely go back!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117143500468611786862", "name": "Elizabeth Williams", "time": 1604679417790, "rating": 5.0, "text": "Jeff and Craig were so easy to deal with.  They were kind and responsive. They had exactly what I was looking for at Hoover Southtown and made the switch from a Camry to an SUV very easy!!  When it came to finance, Jason was very knowledgeable and helpful. It was a great experience from every aspect!!!  Thanks guys!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109677148460431327150", "name": "Randall Vann", "time": 1606327796480, "rating": 5.0, "text": "First let me say if you’re in the market for a vehicle you shouldn’t visit any other dealer until you visit Hoover Southtown motors.\nThese guys are truly some of the best people that I have dealt with buying cars my entire car buying life. They went above and beyond to help us with our vehicle choice. They have a great owner that is honest and works for your business, they have a great salesman named Dylan Freeman that will go out of his way to help you pick out what you need. They do not try to pressure you in anyway.\nThey have a great finance person Jason that will work out the best financing options for you.\nWe are very pleased with our recent visit and dealings with this dealership and I truly believe you will be too. We will certainly be back when we need another.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113349760635301972472", "name": "Dakota Chamness", "time": 1609722809559, "rating": 5.0, "text": "I went in looking for a vehicle a few months ago. I talked to Dylan and he assured me that he would find the perfect truck (price and style) for me. My credit was not great and I came in almost at closing time on New Years Eve, but Dylan and the crew were determined to help me out and get me in my new truck. 10/10 would recommend these guys and I can not wait to do business with y’all again.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104355521807433956650", "name": "Chris Ketrow", "time": 1600699233861, "rating": 5.0, "text": "5 STARS PLUS!! I just recently purchased one of my dream cars from them. We had a few speed bumps on my end with my bank financing but they were extremely patient. The best service I have ever received from a dealership. Ask for Craig he's a great guy. If I need another car I will definitely be going back.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106283515509413306933", "name": "frances fowler", "time": 1611944157556, "rating": 5.0, "text": "I have bought not one but two cars at South Town Motors Hoover. Their service is absolutely amazing every time I have shown up someone has walked out and met me within three minutes of my arrival. They’re so friendly and can actually look up any car for you, even if they do not have it in stock. The person who has helped me the most is Dylan, he just so happen to know and locate both cars I have been searching for each time within 20 minutes and have them in the lot of southtown. Definitely go check them out for a pre owned vehicle and be sure to ask for Dylan!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101110865027119030791", "name": "Kyle Heine", "time": 1614178601511, "rating": 5.0, "text": "I worked with Dylan Freeman and was able to get the exact Jeep I've been wanting at an excellent price. The staff is willing to work with you and are highly recommended!", "pics": null, "resp": {"time": 1616971679674, "text": "Thank you Kyle! We always try our best to get excellent price on any vehicle. Our Southtown Hoover family appreciates you. I’ll let Dylan know about your compliment on the Jeep purchase , and our service!"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118091250144345637651", "name": "thenerdess", "time": 1603235387619, "rating": 5.0, "text": "Awesome place and awesome selection!! Dylan and Jason helped me to get the car I wanted and made sure everything was affordable for me. If you need some new wheels, definitely check them out!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117641461758558837837", "name": "Angela Quick", "time": 1599620022092, "rating": 5.0, "text": "Great staff, great service, and a great vehicle!   The gentlemen we dealt with went out of the way to help us get an SUV we had found online.  When we arrived, our salesperson, Craig, told us the vehicle we wanted had just came in and offered to take us offsite where it was being detailed.   Even though it was the end of his day, Craig was kind and patient and answered all of our questions.   We test drove it at the shop and knew it was exactly what we wanted.  When we came back the next day to sign paperwork the finance manager had everything ready and had found us a very low interest rate.  They were very professional and made it super easy to do business.  Everyone there was friendly and attentive and it made our car buying experience excellent. Its been a few months since our purchase and we have not had any problems with our SUV.  We will definitely buy from them again!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110230002038362439113", "name": "Angela Hollis", "time": 1611798625234, "rating": 2.0, "text": "Didn't care much for the inventory, looked like junk. Cars were all piled in on top of each other. Couldn't get anything out to test drive without having to move 3 or more cars.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115611261274205310794", "name": "Ted Bridges Jr", "time": 1559833439179, "rating": 5.0, "text": "I drove 220 miles to buy from Hoover Southtown Motors. I was NOT disappointed! I got exactly the kind of truck I wanted for thousands of dollars less than I was seeing elsewhere. What's more, the owner Jeff and Jason (my salesman) were men of integrity...very refreshing in this day and age. I give them my highest recommendation.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNED2SU-iU29n1E8KzgXMypPP5IvzsA6_Jzg-dr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110464217312386977138", "name": "Titus Crutcher", "time": 1601568701603, "rating": 5.0, "text": "Craig and the guys were awesome to work with! I would recommend them to anyone. The entire process was smooth and no issues at all. If your looking for a good quality vehicle and excellent customer service, this is the place to go. 5-stars all across the board!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102599645906697620643", "name": "Ashley Bowen", "time": 1613005245152, "rating": 5.0, "text": "Extremely helpful and easy car purchasing process! Craig is a wonderful help and so easy to work with! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105166810430597991574", "name": "Kelly Porter", "time": 1601498671042, "rating": 5.0, "text": "We had another great experience with Craig at Southtown. He has helped us once again get into a great quality car, at a very fair price. We really appreciate the great service, as always. We will be back again in the future for sure!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109201925766885933566", "name": "Ryan Stephens", "time": 1611754662406, "rating": 5.0, "text": "Southtown Motors Hoover has knowledgeable and friendly staff that made my car buying experience easy and efficient.  If you are in the market for an excellent quality preowned vehicle I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118153821137300278674", "name": "Sara Gardner", "time": 1597978260985, "rating": 5.0, "text": "I recently purchased a car from David Cooper. My family has bought cars from David before and we have had a great experience. When I was in the market for a car, I was lucky that David helped find me exactly what I needed in my price range. It was a smooth process and he was very helpful. Would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103745375285863603688", "name": "Dan Woosley", "time": 1615175342680, "rating": 5.0, "text": "For having driven past Hoover Southtown Motors (HSTM) literally hundreds and hundreds of times over the years, we were finally drawn onto their site by a van advertised on Facebook Marketplace.  We have been exhaustively searching online and at local dealer lots for a late-model mini-van, low-mileage at a competitive price.\n\nIn doing so, we honed in on the year, make and model, as well as the accessories we wanted.  And our lengthy search also gave us a good feel for the price that the market was asking for, for a well-maintained Sienna.\n\nSo when Dylan Freeman met us on the lot to answer any questions, we were ready to dig into the details in short order.  He was much more than helpful and we immediately felt at ease as he shared his insights into this particular vehicle and how the pre-owned car market worked.  He was never pushy and gave us the space to ask honest questions we had accumulated in our research.\n\nWe opted for a fair price on our trade-in SUV and after a brief ride in the Toyota, we were coached through the loan process with Jason Grier's help.  HSTM staff were professional and respectful, friendly and helpful, and offered a quality used car for a very fair price.\n\nMany thanks to Hoover Southtown Motors for a great find and a smooth transition into our new van.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110595269973510349489", "name": "C D", "time": 1602934318511, "rating": 5.0, "text": "I had a really nice experience here.  I came in late one afternoon to see a vehicle and noticed as I was walking up to the door that someone else was looking at it with some paperwork in hand.  Turns out I was about an hour too late.  However, David Cooper worked with me, found out what I was looking for, what kind of budget I had, etc.  About 3 days later, he called me back to say that he thought he'd found a car that would work.  When it did come in a few days past that, it was a great looking car, a better model than the one that I'd missed out on, and they still made it fit into my budget that I'd provided.  I've now been driving that car for about just over 2 weeks and am quite pleased with the purchase and condition of the car.  I'd definitely go back to Southtown Motors if I need another vehicle.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115088962850213891139", "name": "geremy gully", "time": 1591906484495, "rating": 5.0, "text": "This is a nice, family owned car dealership. They are very easy to work with. My experience has been honest, fair, and accommodating. I believe they work with many on financing, though I paid cash. Dylan was a great help and resource during my car shopping process. He is very upfront, personable, and aware of what buyers need.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111627829849593668202", "name": "Shannon Petty", "time": 1605138158319, "rating": 5.0, "text": "We showed up to buy one car and actually left with two! Thanks to Craig for making our experience an easy and pleasant one. Now all three of our children drive cars from Hoover Southtown Motors. We will be back!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114856619128105014478", "name": "Eric McGee", "time": 1606348251857, "rating": 5.0, "text": "These guys were truly professional and pleasant to deal with. we test drove the car and bought it the same day just a couple of hours later. they efficiently handled all the paperwork.  would recommend them to our friends.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106016389117106346018", "name": "Emma Cook", "time": 1604776758635, "rating": 5.0, "text": "Amazing experience!! Helped me find exactly what I was looking for for an amazing price. Customer service was OUTSTANDING!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113576505456996872597", "name": "Rusty Luccasen", "time": 1593120003374, "rating": 5.0, "text": "Definitely will use them again. Dylan was a pleasure to work with. They didn’t have what we were looking for so he got our information and called as soon as they received it. Very professional and no pressure you get at some places. It was the best buying experience I’ve had. I’d recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107141287874025835188", "name": "Wendy Davis", "time": 1608320214669, "rating": 5.0, "text": "Great prices! Nice selection!  Dylan made it so easy. Will buy there again!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107704909006916774105", "name": "Eboni Little", "time": 1594217930674, "rating": 5.0, "text": "Dylan and the team at Southtown Motors Hoover are incredible! I emailed Dylan a very detailed wish list and he quickly found the vehicle that I matched my requirements.\n\nSouthtown went the extra mile to make sure I didn't have to wait long for the vehicle to arrive. The transaction was quick and effortless.\n\nI am thrilled my (almost) new vehicle and would recommend Southtown Motors to anyone in need of a vehicle.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104316647066715072955", "name": "Katie Arrington", "time": 1611443325086, "rating": 5.0, "text": "This place is the best!!! So so incredibly helpful and got me a great deal! Ask for craig!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114353017163415037259", "name": "Maggie Lynch", "time": 1604334916362, "rating": 5.0, "text": "Wonderful experience! Dylan helped us find exactly what we were looking for. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117790472718667450381", "name": "Amy Singleton", "time": 1597611717454, "rating": 5.0, "text": "I immediately called David Cooper at Southtown Motors when I needed a new car. I am a happy repeat customer. After listening to my needs, David went above and beyond my expectations to find me the exact automobile that I needed. It was a joy to work with David, he is an outstanding salesman!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109698499197354645062", "name": "josh kritner", "time": 1597620018623, "rating": 5.0, "text": "I’ve purchased two vehicles from Southtown. David and the entire team are amazing! From helping me track down my 4Runner to making sure I have the best APR possible. Car number 3 will be in the near future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100968363546644285472", "name": "Kathryn Lee", "time": 1583806642884, "rating": 5.0, "text": "If I could give this place a hundred star rating I absolutely would. These are some of the nicest, most down to Earth people I have ever met, everyone there and especially Dave Cooper. He and his team went ABOVE AND BEYOND to help me buy my first car all by myself and genuinely took their time to work with me, help me get the right vehicle for the right price, and with the right payments, I mean everything! Incredible. Thank y’all for being so wonderful! I would (and will) definitely recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118428310904356404882", "name": "Ben Turner", "time": 1608506714377, "rating": 5.0, "text": "Staff is very helpful and they have a pretty good selection of vehicles but parking is definitely at a premium because there is NONE, LOL. Didn't end up purchasing from there but they were helpful just the same.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111378562639949625946", "name": "madison halvorson", "time": 1608391283103, "rating": 5.0, "text": "Craig is the best, went to Royal Automotive first and was given the run around but Craig was honest, to the point, and super helpful!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102337205517118278698", "name": "Marissa Hooven", "time": 1597604966191, "rating": 5.0, "text": "I will never buy a car from anyone else again. David Cooper gave us the best experience imaginable and made sure we left with a vehicle that was no less than perfect. I highly, highly recommend. There is never any pressure to purchase something like other car lots and they work to make sure you get exactly what you are looking for. Being a first time car buyer, they worked incredibly hard to get me the financing I needed to buy the car my little family dreamed of. Thank you again, David!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100840791096804950284", "name": "Anthony Cofield", "time": 1604344252475, "rating": 5.0, "text": "My wife and I searched for a while before finding our new Jeep at Southtown. It was an amazing dealership to shop at and David Cooper was a joy to do business with. We will be back for future car needs!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106662378289371611562", "name": "Bailey Ingle", "time": 1587825521185, "rating": 5.0, "text": "Dylan and Jason at Hoover Southtown Motors are the best! They made the whole experience so quick and easy and they made sure that all of my needs and preferences were met. I could not be more happy with the car they helped me pick out! I will definitely be using them again in the future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111795941846772986687", "name": "farrah lovelady", "time": 1610558280498, "rating": 5.0, "text": "Dylan helped me find my dream car fast and affordable love this place !!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110147891290046624327", "name": "Tonya Garner", "time": 1601221298768, "rating": 5.0, "text": "I just bought a car from Hoover Southtown Motors and the experience was wonderful!!! The salesman David Cooper was soooo awesome, very polite, and welcoming to my daughter and I from the very beginning and all the way through the process!!! I also have to mention that I received financing through Eco Credit Union, (Clay Branch) and Courtney McDowell was so patient and very empathetic, making the entire process astounding!! So if you all are looking to buy a vehicle, give HOOVER SOUTHTOWN MOTORS a try. I promise you won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110209968929498033189", "name": "RTR TDE", "time": 1611336741484, "rating": 5.0, "text": "I've purchased at least 10 vehicles from these guys over the years and have referred family and friends who have purchased as well. Great inventory, reliable vehicles, and fantastic service!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115570418821559572150", "name": "Satoru Matsushima (Sushi)", "time": 1594926240657, "rating": 5.0, "text": "Dylan was very straightforward with a deal I was putting together. At no point did he pressure me to do anything or play any games. If you're looking to shop for a vehicle in their inventory do not hesitate, they are willing to work with you and negotiate.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114713985061664750602", "name": "Lamarcus Miller", "time": 1588358183788, "rating": 5.0, "text": "These guys were amazing! They have good reviews for a reason. This will be my place to go to from now on. Dylan is the man! Yes very informative, and these guys actually care about their customers. My new favorite place!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116451442124940649447", "name": "Melissa Averyt", "time": 1589556568350, "rating": 5.0, "text": "We just purchased our 5th car from David Cooper. He is that good!  Seriously, these are great people who are trustworthy, honest, hard working and just all around nice. They will work with your budget and get you the best deal they can. We send all our friends and family to David, Jason and Southtown Motors in Hoover.\n\nYou will not regret giving them a try.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106297878342648416109", "name": "Christopher Boldin", "time": 1593712552224, "rating": 5.0, "text": "Dylan and the rest of the team are awesome. They helped me get into a real nice vehicle. They are a family owned business and it shows customer service was terrific and they made me feel very welcomed. They have a customer for life .", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106545963859280132132", "name": "Jason Elliott", "time": 1595285718891, "rating": 5.0, "text": "Found out about Hoover Southtown through finding the car we liked on Autotrader. Looked at their website and saw lots of high star reviews and decided to check them out. We were easily able to make a deal on the SUV my wife wanted and its in fantastic shape. Looking forward to doing business in the future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109886718064814362060", "name": "Jonathan Reese", "time": 1592833506551, "rating": 5.0, "text": "Friendly staff and helpful. Helped me find the right car for me without any rush despite my ignorance. Definitely would absolutely suggest going to them for you car needs", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110273714268084498430", "name": "Sara Sedwick", "time": 1573429986101, "rating": 5.0, "text": "Found my (and my sister's) van online, she went to see it and did a test drive. She bought it on the spot!  It is exactly what we need, and we LOVE it.  Everyone has been so helpful and knowledgeable.  Truly the easiest auto purchase ever.   We recommend Hoover Southtown to everyone who is looking for a vehicle.   Thank you so much for everything.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106213299008049641231", "name": "r. P.", "time": 1598361673498, "rating": 1.0, "text": "I wish I could give zero stars. Terrible service.  I've purchased more than one car and they have all had HUGE issues. DO NOT PURCHASE A VEHICLE FROM THESE GUYS! Shady claim to be ' christians ' however all behavior to the contrary. Terrible experience. Quoting scripture when it fits their narrative.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104194765494240197299", "name": "Tim Hammond", "time": 1590866379084, "rating": 5.0, "text": "Great people, very personable and easy to deal with. My purchase was easy and felt like I got a good deal from them. I highly recommend giving them a look if you’re in the market for a vehicle", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114455594238975025331", "name": "Shelena Cofield", "time": 1603925809955, "rating": 5.0, "text": "Normally my least favorite activity is buying a vehicle, but David Cooper made it a JOY for my husband and I! Great experience with great people all the way around.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118202002265021071317", "name": "Michelle Connolly", "time": 1601310500221, "rating": 5.0, "text": "Craig was fantastic! Knowledgeable, beyond helpful, and expedited the process for a seamless experience! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105593959938877573848", "name": "Landon Davenport", "time": 1576171522144, "rating": 5.0, "text": "Birmingham resident for 10+ years, never fails to see a Hoover Southtown vehicle on the road. I decided to upgrade from a car to a 4x4 truck. They have a great inventory, and the salesman Dylan walked me through each step. Wonderful experience. When the time comes for a second vehicle I know where and who I’ll be going to see. Thanks Southtown Motors!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105835001474598670124", "name": "Chelle Elle", "time": 1587828757455, "rating": 5.0, "text": "This was the single best car buying experience with a dealership. Dylan and ALL of the other representatives were amazing, kind, and efficient. I'll definitely be looking for my son's car at Hoover Southtown Motors. Thanks for everything you guys do.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117590475603214722803", "name": "Matthew Hollingsworth", "time": 1601310787791, "rating": 5.0, "text": "Craig did a fantastic job and worked with us all the way from Atlanta to give us a great deal.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102690578978267474231", "name": "Jon Symoniak", "time": 1588087867311, "rating": 5.0, "text": "I had the pleasure of working with this fine dealership to purchase a 2011 Camaro SS.  I'm out of state almost 500 miles away and Dylan made the process very easy and was very honest about the vehicle and condition.  It was a very easy, and quick experience.  I'm happy to say I'd recommend this dealer and its staff to anyone.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106041078114664248206", "name": "Josh Williams", "time": 1602287854181, "rating": 5.0, "text": "Everyone was super nice service was great awesome selection of vehicles at fair prices . Dillon was great no pressure tactics just great service !!!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102865627838489006197", "name": "Brad Parish", "time": 1599951535875, "rating": 5.0, "text": "Went there recently with little experience buying a car, and Craig was extremely helpful and hooked me up with a fantastic car & deal!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114446738477065792840", "name": "george Hall", "time": 1624636817468, "rating": 5.0, "text": "Excellent service!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100224885377321793845", "name": "Shantae Mayo-Looney", "time": 1579914689071, "rating": 5.0, "text": "Dylan and his co workers are amazing. They made getting a new car so easy and smooth. Dylan made sure I was comfortable and happy with my car. They also make sure you stay in your budget. I highly recommend Southtown.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100788630813102405946", "name": "Joy Watson", "time": 1577717933794, "rating": 5.0, "text": "Craig and Jason were amazing! They made sure the entire process was extremely easy and stress free! They truly made sure everything was taken care of. The entire staff is kind and very helpful. I would definitely recommend this dealership to every one.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117789915610997462875", "name": "Quincy Cooper", "time": 1621539277356, "rating": 5.0, "text": "Selections of great 🚗", "pics": null, "resp": {"time": 1621545209432, "text": "Thank you Quincy! This means a lot to our whole team and Thank you for the opportunity !"}, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113677584992439888862", "name": "Emmy Grier", "time": 1569610792067, "rating": 5.0, "text": "Best car buying experience! Won’t buy a car anywhere else. Everyone there is wonderful, they spent so much time trying to get me the best deal. They truly, truly care. That kind of customer service is hard to find these days, do yourself a favor and buy from Southtown Motors Hoover! You won’t regret it.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117786029423055901092", "name": "Lauren Burnett", "time": 1591036119353, "rating": 5.0, "text": "Dylan was great! He knew exactly what I was looking for! Easy and fast process, hardly any waiting! Craig was great too with the paperwork!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103470095381990161509", "name": "Stacy Cobb", "time": 1548782273534, "rating": 5.0, "text": "I believe it says a lot about a company when you do business with them over and over. Southtown Motors has been with us through the years.  We have purchased 7 cars from them.  They have worked with us through the hard times when we were hurting financially and needed a vehicle to just make it through life.  They have also been there for us when we were blessed and wanted a nicer vehicle.  I’ve never walked away feeling taken advantage of but always felt and know that they were watching out for us and our needs. Their prices are always the best.  Their people are always there for us even helping us with a car we didn’t purchase from them.  Through our first purchase knowing nothing about Southtown to just yesterday when purchased another car from them there is no finer dealer in Birmingham.\n\nYour looking for someone you can trust and know that they are looking out for you when it comes to used cars. Southtown Motors Hoover is exactly who and what you are looking for.  You can trust them and after your first purchase I know you will be coming back to them again and again.\n\nThanks guys for another awesome car, a great experience made incredibly easy with the great work from your team.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112902406828466386500", "name": "Hunter Mays", "time": 1574790854530, "rating": 5.0, "text": "I am a first-time buyer and I had a great experience with Dylan. He was not the typical pushy car salesman. He genuinely just wanted to get me in the car I wanted. After a couple of days of having the car, my headlights were acting strange. I contacted the lot and they got me in to fix the issue the very next day! I highly recommend this car lot.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103477437603042990854", "name": "Brittney Wetzel", "time": 1592572283828, "rating": 5.0, "text": "I purchased my dream car from Dylan this week! He and the finance guy were great to work with. I highly recommend Southtown Motors!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111079198605997877117", "name": "king lewis", "time": 1582046265571, "rating": 5.0, "text": "3 weeks ago\nIncredible experience. Dylan worked hard to get me in my dream truck. They were not pushy and gave me all the details up front. I will recommend this dealership to friends and family.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112688329613028792677", "name": "SJ D", "time": 1596229394711, "rating": 5.0, "text": "Dylan was very understanding & patient with helping me. He made sure I everything was done before arriving at the dealership. Thanks Hoover Southtown Motors 💜😊😁", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100532255555320748395", "name": "Kason Johnson", "time": 1592528128689, "rating": 5.0, "text": "Dylan is the best, he always comes thru for me and my family!! The whole crew is so nice and they welcome you with open arms!!! I love them!!!! Very helpful too!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109287471340290177596", "name": "raven Johnson", "time": 1599250882982, "rating": 5.0, "text": "Bought a car couple of weeks ago...car has some issues but Craig made sure everything thing was fixed which left me satisfied...I would recommend Hoover Southtown to anyone...!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114862474269670102297", "name": "Matthew Giles", "time": 1596082377470, "rating": 5.0, "text": "Thank you Dylan Freeman and Mr. Jeff for helping us get exactly what we wanted! I’m sure we will be back in the future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103257254065290189693", "name": "Tom Schexnaildre", "time": 1596146737392, "rating": 5.0, "text": "Dylan was great to work with. Very easy experience and definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106807866756104713168", "name": "Steven Dotson", "time": 1572312053897, "rating": 5.0, "text": "The easiest way to buy a car is right here! Very friendly, honest, and understanding staff. NO hassle or trying to rush a sale. I just recently bought my second car from Dylan Freeman, and when I need another one, I'll be there. I couldn't be happier", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107418104918493101081", "name": "Kenny Respess", "time": 1595889054976, "rating": 5.0, "text": "I will definitely come back with more business  , Dylan is straight forward and easy to work with thanks", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108371870890355997443", "name": "Yvonne Taylor", "time": 1591123028623, "rating": 5.0, "text": "Dylan was awesome!!! From the beginning to the end!! Excellent customer service and plus he has a great smile!!! I will definitely be buying another car from him!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104143195722386708172", "name": "Jerrica Parchman", "time": 1576515063357, "rating": 5.0, "text": "My husband and I REALLY RECOMMEND HOOVER SOUTHTOWN MOTORS. We live instate (AL). We drove to Atlanta and also shopped around in Birmingham. Everyone that we went too... seemed as if they were typical car salesman. They weren’t very friendly.\n\nAs soon as we were approached by Dillon and he allowed us to test drive the Ford Explorer we were searching for... I told my husband that we were going to buy the car from him. He was so sweet. His presence was very graceful.\n\nWe purchased the car and we couldn’t get the third row up because the previous owners installed leather and probably didn’t install the seats correctly. We noticed this after we purchased the vehicle. My mom was sure that it was nothing they could do because we had already signed.\n\nTHIS WAS NOT THE CASE. Dillon told us to come right back and he would take care of it for us. Also when we applied for the tag we left the packet at home. He stopped what he was doing at work and emailed the paperwork to the attendant we were working with.\nThey are absolutely AMAZING!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101842253551405717698", "name": "A.K. Looney", "time": 1582510100528, "rating": 5.0, "text": "Great small dealership with great people. They definitely make the process of getting a new car smooth. Would highly recommend this dealership!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110963350701040205903", "name": "Kristen Schneider", "time": 1571179473804, "rating": 5.0, "text": "Southtown is awesome! My family has always come to Southtown first whenever looking for a new vehicle and they’ve always been incredibly helpful. Dylan has helped me so much recently as I’ve been looking to buy a new car for myself and is continually kind, patient, supportive and responsive! Will definitely continue to come to Hoover Southtown and highly recommend to anyone on the market for a car!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110612800896182809957", "name": "Cayson Files", "time": 1591898469360, "rating": 5.0, "text": "Dylan was great and helped make the process go as smooth as possible.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111173247659194461322", "name": "Faith Igbinoghene", "time": 1607649434603, "rating": 5.0, "text": "Great experience, super nice people!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113236845498568116599", "name": "Michael Grant", "time": 1600740101926, "rating": 5.0, "text": "Great folks to work with and found the car I was looking for.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105513484215486905441", "name": "TheStikerPro", "time": 1590632026238, "rating": 5.0, "text": "Very helpful and understanding great customer service walk in not knowing what to expect and pleasantly surprised it was better than I thought would come back again highly recommend it the owner son was very helpful thanks again wonderful experience", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104375109429596988607", "name": "Brandi Johnson", "time": 1579736335406, "rating": 5.0, "text": "Incredible experience. Craig and Jason made my husbands dream truck become reality. They were not pushy and gave me all the details up front. I will definitely recommend this dealership.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106486740069587749738", "name": "Jonathan Brown", "time": 1599252007003, "rating": 5.0, "text": "Craig found me the exact 4Runner I was looking for and beat the prices of everyone else in town.   Thanks Southtown!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100356675663201459901", "name": "Christopher Richardson", "time": 1611191611373, "rating": 5.0, "text": "Awesome group of guys !! Very helpful !", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114935539702541911411", "name": "atl cane84", "time": 1581396419738, "rating": 5.0, "text": "Even thou I didnt purchase a car a great salesman by the name of Dylan Freeman did a great job. He was communicating and made sure I got the best deal possible if I was to buy. Dylan was a professional", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114875021418148975826", "name": "Alex Watlington", "time": 1562201933220, "rating": 5.0, "text": "The best car buying experience ever!  David Cooper is a phenomenal salesman and a genuine, Godly man.  Jason Grier is an expert in the purchasing and finance process and could not be a nicer guy.  These are two guys that you can trust.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110484928762591656262", "name": "Ed Anderson", "time": 1568067518712, "rating": 5.0, "text": "This was by far the best car buying experience I've ever had! Every member of the staff was helpful, informative, friendly but not pushy at all! I got a great car oh, and it was a great value. If you are looking 4 a good pre-owned vehicle look no farther then Hoover Southtown Motors. I plan to buy all my cars from them in the future.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116792081942053586304", "name": "Shemekia Cooper", "time": 1596147037277, "rating": 5.0, "text": "Dylan helped us find the right car for our son that he absolutely loves.  We will definitely do business with him in the near future.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110428646061924796491", "name": "iL LEUMAS", "time": 1566693747582, "rating": 5.0, "text": "Every experience my family and I have had here has been top-notch. This team truly CARES about their customers. Always helpful, never pushy.\nThey want to help you find a quality car at a quality price.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101220696091122555101", "name": "Austin Reeves", "time": 1578074810918, "rating": 5.0, "text": "Craig at Southtown and the owner went above and beyond for our unfortunate circumstance we were in with our trade in car.  They really helped us get into a better situation and car for our growing family. We couldn’t have picked a better dealership to work with. Thank you guys so much!! Highly recommend. Ask for Craig!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112285236218738493699", "name": "James Perry", "time": 1590534834792, "rating": 5.0, "text": "Excellent! Excellent!! These guys can make anything happen! Dylan, Jason, Craig I shall purchase my next few vehicles here! Thank you all for your dedication to help others!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111059587677086303447", "name": "Shannon Wright", "time": 1559787129522, "rating": 5.0, "text": "I was referred to Jeff and now I know why! Car buying normally stresses me out. But Jeff, Brandon, and the team made it all stress-free. They are honest, trustworthy, and treated me like family. They went above and beyond to take care of me and now I have a wonderful, safe vehicle to transport my precious children in.Thank you Jeff and Brandon!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101216284672097209328", "name": "Stephanie Pfitzer", "time": 1568672491012, "rating": 5.0, "text": "Seriously buy a car from these people, or two!! Dillion and Jason and Brandon went out of their way to help me find the perfect car for my mom, and when mine died a week later, they found the perfect car for me. They never pressured me, but instead worked with my budget. Friendliest group of car salesmen ever!!  They went above and beyond in every aspect of the deal. They even drove to Chattanooga to get my car that had died on the side of the road so I wouldn’t be endangered driving it back. Who does that?? Southtown does!! They are men of great integrity. We are customers for life!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112192635747463578888", "name": "Trisha McKendree", "time": 1568062851826, "rating": 5.0, "text": "My mom purchased her car from them and then I puchased mine...   They are very friendly and courteous.  The best part was we didn't spend the entire day at the car lot, they were very easy to do business with.  We highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107526363758892993950", "name": "Dora Daccardi", "time": 1588893389019, "rating": 5.0, "text": "Super friendly and helpful staff! they made the process super smooth and fast!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117338096614256377912", "name": "Kim Frazier", "time": 1551413695598, "rating": 5.0, "text": "Dylan Freeman was my sales guy. He was awesome!!! He was able to get me financed for a 2016 White Mercedes Benz C-Class. He kept me posted with the progress of my application until the end. I traveled from Atlanta to go and pick up the car. Once I arrived and spoke with Brandon the entire process took less than 60 minutes.  I would defiantly recommend Hoover Southtown to anyone looking for a good quality used car. Thank you again Dylan, I Love My New Car!!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109584470489137251562", "name": "Bryce Carnes", "time": 1591983621347, "rating": 5.0, "text": "Not only has a great inventory and pricing, but also has great people looking to build a future relationship.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101023265788149350688", "name": "dre ward", "time": 1577747304241, "rating": 5.0, "text": "Great service! Dylan was nice and a pleasure to do business with. Would recommend to others!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109396811836253010460", "name": "Karlisha Redd", "time": 1623090344040, "rating": 5.0, "text": "Dylan was such a great help and displayed excellent customer service while helping me get into my dream car! Thank you again Dylan for all that you did and also for being patient with me!!!\n\nUpdate!\n\nI went back again today & Dylan was such a great help all over again!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113597925877843765899", "name": "Amanda Dockery", "time": 1582825839280, "rating": 1.0, "text": "I was optimistic in the beginning but unfortunately my experience ended up being the worst of any car dealership I have dealt with. Trade ins and financing went smoothly but once it came to receiving my new vehicle, I experienced the worst customer service and treatment. They agreed to fix several issues with the vehicle before I would take possession. This included fixing or replacing non working, moisture filled headlights and taillights, turn and safety sensors and a harsh noise and shake coming from the vehicle when driven. They kept my new vehicle for several weeks and it still had to be returned for failure to do all of the work and right after taking possession of the vehicle, everything they “fixed” stopped working, lights filled with moisture again and the noise returned. I paid over $30,000 for a vehicle I can not safely drive 6 months later. Buyer beware most definitely.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109849639287867961218", "name": "Betsy Colvin", "time": 1596392637574, "rating": 5.0, "text": "They made buying a car easy!!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111210966673604430340", "name": "Jordan Reynolds", "time": 1572988973629, "rating": 5.0, "text": "It’s always great doing business with these guys. Pleasurable experience from looking at cars to driving it home.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105176425648257518552", "name": "Cire Soprano", "time": 1548068575154, "rating": 5.0, "text": "Extremely knowledgeable and courteous.. TOP NOTCH CUSTOMER SERVICE!\nTHE ABSOLUTE BEST IN THE BUSINESS!\nGreat prices and selection...Dave is That Guy!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112939608316052718111", "name": "CJ Ausmus", "time": 1566595786997, "rating": 5.0, "text": "Great experience buying from Dylan. They were responsive and very on point. I'd recommend to anyone to do business with Hoover Southtown!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117764248920595883674", "name": "W Price", "time": 1555420563908, "rating": 5.0, "text": "Great customer service; David Cooper is one of a kind.  We made our first purchase with them this weekend and plan to come back.  Not many used dealerships offer repair & maintenance assistance/referrals after your purchase, but they do.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100842259453379447371", "name": "Timothy Young", "time": 1552525217709, "rating": 5.0, "text": "Even though we couldn’t make a deal happen these guy were still amazing! Offered me a great amount on my trade and they have some amazing vehicles to choose from. In time I hope to return and I will purchase a vehicle from them.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104102340593785529498", "name": "Jerry Maness", "time": 1527614123948, "rating": 5.0, "text": "Gratitude. My best car buying experience ever. Wonderful car, exceptional assistance and very thorough. Thank you Jim and Brandon for putting me in a car that I wanted and needed. I would not think twice of recommending Southtown Motors to anybody or for my next car buy. 5 out of 5 stars for sure!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117604510211799387262", "name": "Sarah Holdbrooks", "time": 1541604765990, "rating": 5.0, "text": "I can't say enough great things about this place! I'm a young girl and all other dealerships did not take me seriously. Hoover Southtown took great care of me and helped me find the car perfect for me and my price range. They not only have inventory on the lot, but they will locate anything that you are interested in. Thank you Hoover Southtown for a great first car buying experience!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100342458533911350432", "name": "Rebecca Ray", "time": 1517708356335, "rating": 5.0, "text": "Hoover Southtown Motors has the BEST customer service out of any car dealership I have ever been to. They are not pushy - they help you in the best way that they can and are open and honest about everything. They helped me find my favorite car for my exact price and are honestly just some of the best, down-to-earth guys around. I would recommend coming here to anyone and everyone! Dylan and Jason  are so kind and patient with everyone and I could not be more grateful for their help!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100759730180946885172", "name": "Urist McCauley", "time": 1568826243855, "rating": 5.0, "text": "Honest! That's it in a Nutshell. I just bought a car yesterday. Never once tried to get over, or pull the wool over my eyes. Even cut the price a small bit just to get me rolling again. I never asked for that... They did it because they honestly put themselves in my shoes. THIS is what car-buying USED to be. I'm glad someone brought back the old school way of doing things. God Bless these guys!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103824325941167152101", "name": "John Lodkey", "time": 1593723126763, "rating": 5.0, "text": "Great  service, will  buy there again!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117176954556631930638", "name": "John Richardson", "time": 1568065440128, "rating": 5.0, "text": "Dylan Freeman is the man, helped my wife and I find the right car at the right price and even followed up days later to be sure we were satisfied. Would highly recommend using him or anyone at Hoover Southtown.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115479595118788240335", "name": "Larry Stephens", "time": 1572575736256, "rating": 5.0, "text": "Purchased car for granddaughters 16th bd. Process went smooth, great deal and she couldn't be happier with the car!! Dylan knows his cars and was willing to do whatever it took to make the sale.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113079644994766321974", "name": "Bobby Houlditch", "time": 1551815954409, "rating": 5.0, "text": "Super nice people.  Very pleased! No pressure and seem genuine. We are looking forward to years of great service!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105474768877667557150", "name": "Natasha Walker", "time": 1588796832048, "rating": 2.0, "text": "I have been looking for a car for 6 months. One day I, just googled the type of car I wanted and the year and car guru showed me different options. I saw the car I wanted and price was great! Therefore, I inquired about the car and encountered David Cooper. Nice person. I went down to view the car and test drive as well all went perfect. However, they should really watch what they say and how they say it. The day I went back to purchase, it was stated by David C. they found an extra key, ( that made me wonder suppose it may have went another way but, sometimes used cars come with two keys and sometimes not its gamble.) I have worked at a dealership before, and I know how sales representatives do (it is optional they can give you both sets, but they really do not have to). I over heard him say since I paid cash he is going to let me have the other key, but I didn’t say a word about it because it is what it is. When I got to the final stage and had to do paper work I forgot the young man name, but he used a very horrible analogy when he got to the repossession page. The car I purchased was decent thank god had a few issues before I left. The tire sensor would not go off come to find out there was a nail in the tire it was in there before I left Birmingham and the blend door had gotten stuck on the passenger side but they agreed to fix it. My advice to others do your background check and research and when buying a used car pay attention to small and big detail. Overall, everything else went smooth. My name will not be in your system as N. Richardson it will be listed as N. Walker.\n\nI purchase a used vehicle from this place in February and it’s only been two months for me, but now I have to replace brakes, rotors, 2 tie rod ends, and I had to purchase a spare tire. I know the vehicle is used and all, but at least check the cars out completely before selling them. I just thank GOD those tie rods didn’t come apart on me while driving. I didn’t get to go a good test drive so I couldn’t really get the feel of the car. Overall motor wise the car is good. Guys just please check more into the vehicles used or not y’all selling cars and not thinking completely about safety. God was truely with me.\n\n(05/06/2020)-*Just an update they did not even try to reach out to me after posting that review they don't care, just wanted to reach their quota and get a commission.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112283765735105093872", "name": "Salvador Magana", "time": 1582043204053, "rating": 5.0, "text": "This place is great 10/10 would recommend, great service, awesome people", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108897442524596853145", "name": "Austin Bolton", "time": 1471729933976, "rating": 5.0, "text": "Brandon was great and very knowledgeable about the Avalanche I purchased. Walked me through and showed me all the features. He did everything he could to get it to the price I needed for my budget. It was already a great deal and he still worked with me. Jeff, the manager, came and also worked with me to get a great deal. Would recommend this dealership and its staff to anyone. Thanks Southtown for a great first time purchase experience.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104547633087097685091", "name": "Tyler Freeman", "time": 1576593406965, "rating": 5.0, "text": "Awesome dealership, great people, easy buying process!!!! Straight up honest guys!!!! If you need a car/truck/suv Southtown motors is the place to be !!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117093762144034458770", "name": "Chandalar Innovative Learning Academy", "time": 1590181412870, "rating": 5.0, "text": "Dylan was awesome ! Gave me great service !", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116519709891901174509", "name": "Cody Widner", "time": 1571149466031, "rating": 5.0, "text": "We was very pleased with the whole experience. Dylan went above and beyond to make it work for us. I would absolutely recommend Hoover Southtown motors.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113260437510725597414", "name": "Rob Schneider", "time": 1542300190119, "rating": 5.0, "text": "Recently took my mother in law in to purchase her 4th vehicle from them and the experience was top notch as always. Jeff & Dylan treated her like family! Offered a variety of makes and models to choose from, provided a terrific price on the new Highlander and generous trade in for her old vehicle. Zero pressure, outstanding knowledge, patience, all with a servants attitude. It’s why we continue to buy from them!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107851434916889557431", "name": "Lloyd McCourt", "time": 1537036469383, "rating": 5.0, "text": "Had a fantastic experience with these guys. We were looking for my 16 year olds first car. He saved his pennies and had a limited budget so we weren't able to work out a deal. But they actually went and retrieved a car acquired on trade and worked very hard to find a way for it to meet my sons budget. I just truly appreciate when people understand how to do business and how simple it is to get a customer to come back. Great bunch of guys.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111005881863597233626", "name": "Don Snell", "time": 1528749208961, "rating": 5.0, "text": "Great place to buy a vehicle or a truck. Always a pleasurable experience working with the staff. What i found most amazing is the selection of rare cars. Great place to buy with trust.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109173127393395337790", "name": "Whitney Hubbard", "time": 1517701562594, "rating": 5.0, "text": "Excellent experience at Southtown Motors in Hoover! Great staff and more than happy to help us with what we wanted! Will definitely be back and always buy cars from Southtown! Dylan was an excellent salesman and very easy to work with!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115519043172919409824", "name": "Jeremy Thomas", "time": 1569464297455, "rating": 5.0, "text": "Loved my experience there. Very nice people Pleasant atmosphere felt very comfortable with talkin with salesman in the deal that we got", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112321452903410928578", "name": "macy blackburn", "time": 1517591422184, "rating": 5.0, "text": "Southtown Motors is a great dealership. The salesmen are extremely helpful and strive to find exactly what you are looking for. Jeff and Dylan Freeman truly care about their customers and they made buying a car a great experience!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101870751719080220681", "name": "Crowder Peas", "time": 1444864729328, "rating": 5.0, "text": "My husband and I just bought a 2013 Ford Escape from Southtown. The entire experience could not have been better! Brandon was extremely helpful and definitely went the extra mile to help us. We are so happy with our vehicle and the entire purchasing experience. We will recommend Southtown to all our friends and family and will certainly be back in the future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108815118350255098371", "name": "Amy Self", "time": 1551912283158, "rating": 5.0, "text": "Just bought my second car from David Cooper. David is honest and explains everything. David made sure I got the best intrest rate and a car that fits my budget. THANK YOU!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115666968837393698994", "name": "Deboris Davis", "time": 1450535944001, "rating": 5.0, "text": "I would most definitely recommend this dealership, especially to a first time car buyer such as myself. The process was smooth and I was able to leave with my dream car the same day! Brad is amazing! He was kind, understanding, and showed great professionalism. It was definitely worth the 3 hour drive!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105811046142372394320", "name": "Konnor Pavey", "time": 1593114715777, "rating": 5.0, "text": "The team at Hoover Southtown is unbeatable in my opinion, I needed a truck for my business ASAP and these guys made it happen AND got it at a steal! If you are looking for a truck or car or anything these are they people that will get it done!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101783037687246274222", "name": "amy lewis", "time": 1573075475877, "rating": 5.0, "text": "Dylan is a wonderful salesman that works hard to get you the best price!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101051186950926616899", "name": "Brian Stockard", "time": 1363323438156, "rating": 5.0, "text": "I could not be more pleased with my most recent purchase from Southtown Motors.  Jeff and his team are both professional and extremely knowledgeable about every vehicle on their lot.  In every area, they went above and beyond what I've experienced in the past with some of the bigger car dealers.  They handled the financing and explained all of my options clearly and concisely to make sure I got the best deal possible.\n\nI also love the no hassle approach that I experienced.  I truly felt like they had my best interest at heart the entire time and were upfront about the costs and what I could expect throughout the buying process.  No surprises!\n\nI would recommend Southtown Motors to anyone interested in purchasing their next vehicle.  They stand behind their work and will do whatever it takes to make sure you are satisfied.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109693620105779165160", "name": "Zack Sucher", "time": 1568403588664, "rating": 5.0, "text": "Great people. They made buying a car fun.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110668705459628160993", "name": "David Eisner-Kleyle", "time": 1462470298626, "rating": 5.0, "text": "Great experience working with Brandon at Southtown Motors!\n\nI bought a vehicle from out of state and Brandon made the purchasing experience informative and efficient.   The vehicle was exactly as described when I arrived. Southtown had both a great selection and great customer service. Whether you live 3 miles away or 300, I would highly recommend Southtown Motors.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112699415604588726245", "name": "Xander BMO Games", "time": 1502284557325, "rating": 5.0, "text": "Excellent dealership!  Drove from Pensacola to buy a car. Will and Brandon made the transaction quick and painless.  They gave me exactly what I wanted for my car.  Would definitely drive 4 hours to this dealership again to buy a car.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114742463632768065897", "name": "brandon garner", "time": 1502805867701, "rating": 5.0, "text": "Always an awesome experience when dealing with this dealership. Brandon and Dylan did an outstanding job getting my fiancé and I the vehicle we wanted at a great price. They treat you more than just a customer. Definitely would buy another vehicle from then in the future.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110604344662249845878", "name": "Thomas Rolen", "time": 1570318017352, "rating": 5.0, "text": "Great place to purchase a used vehicle. Staff is knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116329200421163616560", "name": "eric roberts", "time": 1548570137117, "rating": 5.0, "text": "The employees here are extremely pleasant to be around. They have a very nice selection of previously driven vehicles. Their vehicles are A1!!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114166774702164754018", "name": "Aleesha Wester", "time": 1461205686318, "rating": 5.0, "text": "Wonderful car buying experience. I had some problems with what I owed on my car but Brad really worked to not only help me but really get me what I wanted. Really great vehicle and people! Highly recommend them for your next vehicle.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114819692198175312918", "name": "Mitch Joynt", "time": 1412967143066, "rating": 5.0, "text": "Had a GREAT experience at Hoover Southtown. Jeff and his crew took great care of us and kept us up to date on all the happenings of buying the car we wanted. Jeff took the time to check for outstanding recalls on the car...have never had that before!\n\nI would highly recommend Hoover Southtown to all my friends and family, without hesitation.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103411998391377838396", "name": "Jan Ingle", "time": 1523494103637, "rating": 5.0, "text": "The nicest, knowledgeable, most honest people one could want to work with. Just purchased our 3rd car from them. If they don’t have a car in their lot to meet your needs, they will find one.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111278268274240632015", "name": "Thomas Edington", "time": 1485015830235, "rating": 5.0, "text": "These guys are great to deal with....worked very hard to get me in the right car, very upfront about everything. I will definitely be going back to them for both my car buying and servicing needs. Recommend to anyone looking to buy a great car.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117097590346646117872", "name": "Cameron al Shaqar", "time": 1528893773490, "rating": 2.0, "text": "This dealership is not very good\nThey kept my car 2 weeks (on 2 separate occasions. The first time they couldn't figure out what was wrong with it). They didn't seem very worried I was without a car or very concerned about fixing my car in a sensible time frame. Before I purchased my car, they promised me the moon..\n.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113528874727766044442", "name": "Callie Williams", "time": 1438335954218, "rating": 5.0, "text": "These guys were an absolute pleasure to do business with. They made shopping for a car much more pleasurable than anywhere else we went. Brad was open and honest and demonstrated nothing but professionalism. I would highly recommend them for your next car purchase!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114247510360906145978", "name": "Vickie McLaughlin", "time": 1544069879746, "rating": 5.0, "text": "I was actually just looking around for a a car since I was selling my truck.  Thanks to Jason I traded my truck for my new baby, an Acura TL.  Jason was amazing during the whole process and went above and beyond in helping me even when there were a couple of hurdles.  I strongly recommend seeing Jason at Southtown Motors for your next vehicle.   Thank you Jason... you’re Awesome!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118147874959078780601", "name": "Hugh McMurry", "time": 1450457311298, "rating": 5.0, "text": "Excellent buying experience on a 2008 Chevy Tahoe.  Brandon, Brad and Jeff were all great to work with; low pressure; responsive to questions and they truly put the customer first.  Best value for the dollar that I found after looking for many months.  I will be a return customer.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118264947672003681055", "name": "Nise 2You", "time": 1422911363845, "rating": 5.0, "text": "I would definitely recommend Hoover Southtown motors. working with Brad has been a joy. He stood by his word and did all he could to get us in the vehicle of our choice. He was personable and knowledgeable about all the cars on the lot. I will definitely comeback again for my new car needs.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108069231878981403050", "name": "Katelyn Aldridge", "time": 1478124137163, "rating": 5.0, "text": "Southtown Motors had a great selection and wonderful customer service. Dylan was friendly and informative making my boyfriend's first time buying a car that much easier. We will definitely be buying another car here in the future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110966978781631061750", "name": "Johnathan Brekle", "time": 1556814986918, "rating": 5.0, "text": "Great atmosphere and selection! The people were friendly and I would highly recommend it.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101789355733771080394", "name": "Stacy Larrimore", "time": 1569604898625, "rating": 5.0, "text": "Great experience purchasing a vehicle.  I would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116456250390256210680", "name": "Kara Edgil", "time": 1517595329619, "rating": 5.0, "text": "Great customer service, Dylan helped me find the right car for a great price. I will absolutely be coming back to buy my next car with Dylan and Southtown Motors. It was a much better experience than my previous car purchases at large dealerships. I hate going to a large dealership and having to go back and forth with my salesman, then his finance manger and then general manager to agree on a price, just to start signing paperwork and get hit with ridiculous “dealerships fees.” The price we agreed on was the price that I paid, 10/10 would recommend again", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102055891096270240384", "name": "Tracy Gooden", "time": 1452378916928, "rating": 5.0, "text": "Southtown Motors Hoover gave me the best car buying experience that I've ever had.... Great people!... If you are deliberating about where to look for your next vehicle, you won’t regret doing business with this team... Excellent!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102351535187192064864", "name": "Rhonda Dunn", "time": 1529119264329, "rating": 5.0, "text": "Had another wonderful experience purchasing another vehicle at Southtown Motors and working with DAVID COOPER to find a vehicle to meet my needs and bank acct!!!  David listened to what I wanted , made recommendations, and was able to get me a 2016 Toyota RAV limited with low mileage. Very easy salesman and friend to work with during the whole process. He is very easy to get in touch with and answers calls/text quickly!  Thx!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101697727777889188690", "name": "Jenny Thomas", "time": 1548020413318, "rating": 5.0, "text": "David Cooper was great! Best deal you'll find anywhere with wonderful service even after the sale!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115193410212083270148", "name": "Cameron Hall", "time": 1567535577107, "rating": 5.0, "text": "I was advised by a friend that I didn’t need an extended warranty on the vehicle I bought from Hoover Southtown Motors and ended but having mechanical issues with the engine. Everyone at the dealership has been trying help me getting it back operable.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101689970745386050950", "name": "rachel stanfield", "time": 1560224814194, "rating": 5.0, "text": "I purchased my 13 Lexus GX F-Sport from Southtown and it was super nice!! I drove down from Gadsden. Dylan Freeman was my salesman and is just a great guy! Mr. Rowell got me a great interest rate and they even let me order my all-weather mats from the dealership at wholesale price! My GX has been an awesome SUV and one of my favorites by far! I will always check here first! Thanks guys!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111496926495177391137", "name": "Frank Alexander", "time": 1456108384875, "rating": 5.0, "text": "Frank\nBrandon is a great guy that will go out of his way to please his customer. I really appreciate him for making my car buying experience the best ever. I will definitely go back to purchase another vehicle thnx to the Southtown team....👍🏿👍🏿👍🏿👍🏿", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "103066317814085350934", "name": "Rachel Stockard", "time": 1364848290292, "rating": 5.0, "text": "Thank you Jeff Freeman and the Southtown team for a great experience in the purchase of our GMC Acadia.  Honesty, integrity and perfect customer service is what you receive as a customer of Southtown Motors Hoover.  They were so accommodating and made buying a car a pleasure giving us the best deal possible. Thank you Jeff, Michael and Brandon for all your hard work, individualized and excellent customer service!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117064500162909981448", "name": "John Davis", "time": 1357623599250, "rating": 2.0, "text": "Bought a truck there two months ago with a 3 month/3k mile warranty.  Within a few days, I realized the AC was messed up, so they replaced the AC Compressor.  A few days later, the AC was doing the same thing.  Took it back and they got it fixed, but they messed up something else in the AC system (lack of proper lubrication IMO).  They refused to fix it.  I told them the CD player was broken within a week and they said they usually don't warranty stereos, but they would look at it.  By \"looking at it,\" they just ripped my CD out and ruined the CD without fixing anything.  Then I noticed when I was towing a trailer, something was seriously wrong.  I originally told them it was a transmission issue or engine misfire.  Long story short, they \"can't find the problem\" and 6 months later I'm still stuck with a broken truck.  They always acted like they were on my side, but this dealership is nothing but a group of crooks.  I dealt with everyone trying to get it straightened out.  They told me they would find another truck for me to trade out of.  They found one and it was nothing like what I wanted, so I passed and they told me I could look for one on my own and they would check into it.  I found about 10 and never got a reply from them.  They put around 3k miles on it.  And one day I went to pick it up and it had a broken side view mirror.  They said \"Wow.  Didn't even notice that.\" and it took them nearly two months to fix it.  Save yourself the headache and do NOT do business with this dealership.  When we were sitting in the managers office one day, he told us about 6 vehicles that were seriously messed up, but they were still trying to sell them.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114348168235882651063", "name": "Gabe Colley", "time": 1518643858480, "rating": 5.0, "text": "Excellent customer service, Dylan handled everything very progressional. I walked out of there with the car of my choice at an affordable price! Definitely recommend if you are in the market for a used car!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108583327702907077207", "name": "Stephanie Newman", "time": 1461807400127, "rating": 5.0, "text": "This was second purchase from Southtown and Brad Roberson made it another wonderful experience! Thank you Brad, you went above and beyond to find the perfect car for me. You are a gem, thanks!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112287774489130621478", "name": "Carol Robinson", "time": 1411849223968, "rating": 5.0, "text": "Just got home from showing my mom a car at Southtown Motors in Hoover. Can't wait for her to buy it Monday - she will be so happy! This will be the roughly the TENTH car my family has bought from Southtown Hoover and we just love them! Owner Jeff Freeman is one of the greatest guys I know, and I just love the entire staff. They make the buying process comfortable, and exciting. You definitely don't leave there feeling like you could have gotten a better deal somewhere else. Also very pleased with the continuing service they offer, whether it be maintenance or a a good car detail. I can't say enough good things about the business and have sent many, many friends there who are also happy with their new cars. Check it out - you won't be sorry!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115667802077021074633", "name": "Joseph Ham", "time": 1533301940399, "rating": 5.0, "text": "Nice friendly people good experience nice vehicles for sale pretty much everything you would want on the lot to choose from definitely recommend it", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111705270798604678803", "name": "Cody Hawthorne", "time": 1517426914729, "rating": 5.0, "text": "Working with Will and the team was a great experience. I would recommend my family and friends to this dealer.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "108033918916129259918", "name": "Sarah Mulvaney", "time": 1463002803753, "rating": 5.0, "text": "Brad is the best!!!! got such a good deal on my Mercedes and great price trading in my car too. Recommend them 100%", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "100278312401257615082", "name": "Sonja Curtis", "time": 1530726168386, "rating": 1.0, "text": "Bought a car at the end of April and a month later we noticed the valves were tapping and brakes squealing. Took the car to express oil change and there was no oil in a car that we owned for 2 months. Got the oil changed and that appeared to minimize the noise from the valves. Today as my son was about to drive off I noticed that same noise. Apparently they sold us a car without having it checked out first. Never will I ever recommend or do business with these people ever again!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113261352524769485947", "name": "Brandon Matthews", "time": 1441051056640, "rating": 5.0, "text": "My wife and I purchased a car from Southtown and had a great experience. After some price comparison we noticed that the car was priced a little higher than others in the area. Southtown immediatley looked at the price comparisons and admitted that it was, and adjusted it to a very competitive price.\n\nThey were very apologetic and made it up to use by not only adjusting the price but adding in a few additional desires that my wife had with the car.\n\nThe first vehicle I purchased had 109,000 miles on it and I sold it at 247,000 and it was still running. Overall, this is my second purchase from Southtown and they have each been great each time. Seem to be people of honesty and integrity.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110446000916716896613", "name": "Ernest Cory", "time": 1535063484724, "rating": 5.0, "text": "Most honest dealers I have ever known. Bought 4 cars from Jeff.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "114849627070877399547", "name": "Brad Duffy", "time": 1446775459070, "rating": 5.0, "text": "Great staff. Very honest people. I have bought 2 vehicles from them and look forward to make next purchase.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116868343866807127265", "name": "Nick", "time": 1472354305732, "rating": 5.0, "text": "far and away the best dealers in the Alabama market. Nobody takes better care of the cars, and they take even better care of their customers. 10/10", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117370467857341450872", "name": "Ryan Weaver", "time": 1533647313789, "rating": 1.0, "text": "Purchased a 2007 GMC Serra from them 3 months ago. Last night the engine went out. Paid 13k for a truck that lasted 3 months. And before you say I have the wrong location no I don’t. Truck was purchased from you in Hoover next to Krystal’s.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115204109923429868428", "name": "Arthur Smith", "time": 1570826626852, "rating": 5.0, "text": "come on out to southtown my boy Ethan will take care of u!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "112446898556841387584", "name": "Jeremy Sellers", "time": 1363408312128, "rating": 5.0, "text": "My wife & I bought a Nissan Maxima, 2003 model, from the team at Hoover Southtown Motors.\n\nWe needed a car for our son just beginning to drive on his own. Since our son was a new driver, we were very particular about a safe, dependable car but we didn't want a lot of miles or to have to spend an arm & a leg. After looking at many dealerships & getting the \"sales pitch\", we came to Hoover Southtown. I wished I had come there first. Everyone there was friendly & made us feel at home as we took our time looking at vehicles on their lot. If we had a question they were there, but if we just wanted to look around they didn't bug us. Awesome guys! We took the car for a test drive & the car drove smooth like a dream! We still wanted to think about it overnight & the salesman was totally cool with it. It was great not to be pressured like you normally are at other dealerships. We returned the next morning to buy the car & had just a great experience.\n\nSince April 2011, our son has put a lot of miles on the car going back & forth to school, basketball practices/games, workouts & now is about to start college.\n\nSo my advice is if you need a vehicle that won't cost you a fortune, low miles & reliable, make sure you visit Hoover Southtown Motors. I wish I had gone there first instead of wasting my time going anywhere else. Thanks.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116201977504734566700", "name": "Gopi Krishna", "time": 1481650700469, "rating": 5.0, "text": "***Wonderful place***wonderful people*** and Excellent customer service, especially Brandon is a nice guy helped me in buying a nice worthy car. I recommend this place to everyone who wanted to buy a nice and clean car for reasonable price.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "118252919084779005759", "name": "Shell Macon", "time": 1470975423701, "rating": 5.0, "text": "Brad was awesome! He was heaven sent! I would advice everyone to purchase a car from here.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102796355603970432522", "name": "Shane Snyder", "time": 1460260384134, "rating": 5.0, "text": "Our experience with Brad was great! I would highly recommend Southtown to anyone considering buying  a car.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116236279489298127525", "name": "LC Perkins", "time": 1372174292685, "rating": 3.0, "text": "We do not doubt the integrity of the dealer or anyone there.  They seemed very likeable and down home.  We purchased a rare car at a premium price and due to title issues. we were not able to drive the car for a couple of weeks.  When we did, we had no idea that we would have to spend nearly $3000 more just to get the car drivable.  There was a fuel leak that prior owner probably tried to resolve and removed several design parts.  That may have masked the problem for a time.  It was obvious when we drove local and had to have dealer repair.\n\nI recommend taking a close look at any car to be purchased and have it checked out thoroughly.  Again we liked everyone we met there... we just got stung badly on this vehicle.  The final cost of labor with discounted parts was >$3000 plus weeks of not having a driveable car....above purchase price.\n\nUpdate:  Owner called and expressed he was sorry the car was missing some parts and required service for fuel leak remediation. Owner was very empathetic.\n\nCaveat emptor...", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111337062609153381666", "name": "Michael Sawyer", "time": 1502758269343, "rating": 5.0, "text": "Did not work a trade but great people. Very nice.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "107439028042925999066", "name": "B Y (gocubsgo)", "time": 1363970312358, "rating": 5.0, "text": "I have bought several vehicles from Jeff and the folks at Southtown Hoover. They have always treated me great, given me a really fair deal, and even gone and searched for the exact car that I wanted a couple of times.\n\nI will keep buying cars from Southtown Hoover. If you are in the market for a vehicle, this should be the ONLY place that you do business.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "115776527635033157832", "name": "George Mckinney", "time": 1504125259648, "rating": 5.0, "text": "I have bought several cars from the folks at Southtown motors , recommend them to all my friends and family , will be purchasing my next one there for certain !!!.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113212140393037593871", "name": "David Alexander", "time": 1555776162005, "rating": 5.0, "text": "Fantastic place! Can't recommend them enough!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104391677014078363705", "name": "Jennifer Hawkins", "time": 1352764405476, "rating": 2.0, "text": "Nothing but a bunch of liars. I bought a car from them. The very next day the engine blew. Had it fixed, then transmission issues. Had it fixed, then suspension issue. The amount of money I have paid to fix this piece of junk I could of bought a brand new one. 2 of my friends have bought cars here and have had problems with them.. Don't waste your time here. This place is crap!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110561327680961988265", "name": "Allatesha Cain", "time": 1525549262000, "rating": 5.0, "text": "I purchased 2 cars from this company. My family is pleased. Thanks a million!!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109683502154025946534", "name": "M H", "time": 1455223282041, "rating": 5.0, "text": "Had a great buying experience with Brandon Soumeillan.  He was knowledgeable and helpful.  Allowed ample test drive and negotiation between my husband and I. Hoover Southtown is somewhere we can recommend.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110487688144901738676", "name": "Zavier De'Sine", "time": 1528781995397, "rating": 5.0, "text": "Great place, got a great car, good service (ask for Dillon ) and a really great price.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "106757899204409898900", "name": "Geoffrey Eggleton", "time": 1455039938283, "rating": 5.0, "text": "Never left a review for these guys so I figured I should go ahead and make on lol. Bought a truck from them a few years ago (2012) I think it was. It was a great truck, very clean. Had a few problems nothing serious, but it was a used truck and I expected it to not be perfect. Will use these guys again sometime in the future. I can say I am completely satisfied", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102336814015678417489", "name": "Fire Walker", "time": 1476778176261, "rating": 5.0, "text": "Great Experience, Brad Roberson treated me like a friend, I bought a great car and the transaction was effortless, I highly recommend! Low stress and knowlegable, Brad made this a very nice experience and I got a a great car for a fair price.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "105807574810311927590", "name": "Caroline ragsdale", "time": 1463444564232, "rating": 5.0, "text": "Best Car business around , ask for Brad ! You will not be disappointed when buying from Southtown motors in Hoover !!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113200542756087623921", "name": "Rick Breeden", "time": 1455337639647, "rating": 5.0, "text": "Wow, this was the first time I've ever had fun buying. My name is Rick Breeden. My wife my service dog and I spent about 5 hours at Southtown today with Brandon. This young man is amazing. As is his team. Brandon worked continuously today until he got what he wanted for a deal from the finances for us. We have very good credit and money down but I guess we owe a little to much. But Brandon got it done and i drove home my beautiful 2005 Chevorlet Suburban. Brandon, you are the man!!! Now Brandon is hunting for a Cadilliac for the wife. I'm telling you, if you want a great deal, nice hard working folks that actually care about you, the customer, this is the place. Thanks Southtown team for an outstanding and fun experience.\nSincerely,\nRick, Lisa and River Breeden", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "117483264904318476060", "name": "Cohen Brown", "time": 1471013969009, "rating": 5.0, "text": "Best vehicles and customer service in town.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "102761761717571889512", "name": "Dylan Does Things", "time": 1478921916775, "rating": 5.0, "text": "Wonderful place to do business and wonderful people!!!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "110049123073642690111", "name": "Buddy Burttram", "time": 1475809837879, "rating": 5.0, "text": "Great buying experience,  no pressure,  very knowledgeable salesman,  We will do business again in the future!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "111423373273881772170", "name": "Larry Updike", "time": 1541610659037, "rating": 5.0, "text": "Did not have what I was looking for at that time but was nice meeting and talking to Jason", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101937049752850193095", "name": "Jonathan Jackson", "time": 1539484345039, "rating": 5.0, "text": "thought this was southtown Hyundai sorry", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "113558658085566383281", "name": "Chad Polito", "time": 1465482826743, "rating": 5.0, "text": "Southtown motors will sell you a used/New car. They take pride in the cars and #1 you as a customer!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "109605307960918983741", "name": "B Moore", "time": 1542146177065, "rating": 1.0, "text": "very rude employees ....and the GM Jason is no better ......no customer service skills.....guess they only serve the rich and wealthy not common folk.", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "104430375843767753084", "name": "April Mccary", "time": 1599773172340, "rating": 5.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "116474463563232898900", "name": "Deon Silvers", "time": 1357681393249, "rating": 2.0, "text": "Awful!", "pics": null, "resp": null, "gmap_id": "0x888918a3809e4193:0xbf0129d3d8be45bc"}
{"user_id": "101927240732103784315", "name": "Rich Rodenberg", "time": 1621263396827, "rating": 5.0, "text": "Darwin applied a ceramic protection formula to my 2021 Dodge Ram Rebel. It looks better than it did when I bought it in December and beads water better than any wax I've used in the past. The formula offers a multi-year guarantee and protects the paint from oxidation, UV rays, and other things that can damage the paint finish. My truck looks like a million bucks. Thanks.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111078296108114325676", "name": "Tony McNeal", "time": 1619616971648, "rating": 5.0, "text": "The best detail shop in the area by far! They took a vehicle that's been sitting for over 2yrs and in pretty bad shape and made it look like it was new off the showroom floor.\nEvery inch of the vehicle was spotless from the air vents to door jambs. Their attention to detail and professionalism puts them above the rest.\nWithout a doubt we will be back as well as recommend to anyone looking to have their vehicle professionally detailed to visit Darwin Harris Automotive & Auto Detailing.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "106707155831466245820", "name": "Hal Brunaugh", "time": 1592430306071, "rating": 5.0, "text": "Darwin Harris recently detailed our two \"vintage\" cars and here are pictures of our 2010 Honda Pilot which has 168,000 miles and our 2007 Infinity FX35.  The inside of both cars looks even better than the outside and Darwin goes over every spot on the car which he couldn't improve with wax or elbow grease.  Price was great, service and professionalism even better.  Highly recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRrAfSY5AYQvzTpCbLOP_2wxsNN36sq6yTqmej=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLFYYpHF87XRZxmubq84a0O1UqJpWoJlLxg-1l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJR3954ZrzAnZ4kKW6QTBNnXb_N3UgAHXhpqWz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102716891423525917586", "name": "Melissa Brown", "time": 1618945144429, "rating": 5.0, "text": "I took my car to Darwin after seeing my friend’s car which was detailed by him. It was the best car detail ever!  My car looks fabulous and clean. Darwin was great to work with, professional, kind. Another friend saw my car and booked with him immediately. I will be back in the future. Thank you Darwin!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "115899441634778850103", "name": "Charles Wesley", "time": 1623971226225, "rating": 5.0, "text": "If you care about your car or truck Darwin’s detailing is the only place to take it. I am a 4 year + customer. My 2002 Ford 150 XLT looks like new because of the care at Darwin’s shop. Friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "103643838268724470177", "name": "judyee wilkins", "time": 1617119243123, "rating": 5.0, "text": "Darwin did FANTASTIC WORK on detailing my 8 year old car!  I  was considering selling it, but after Darwin did his magic  on the inside and outside of my  2013 Honda CRV it looked like a brand new car!  In fact he said if I ever wanted to sell  it, he would do this for me  because my  car is in great condition!  Go see Darwin Harris if you want to be WOWED!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "115213860338477214722", "name": "Alicia McKenzie", "time": 1614272662202, "rating": 5.0, "text": "I recently bought a used car from a dealership and there was a stain on the backseat. That dealership’s detailing department could not get the stain out. Not only was Darwin Harris successful in getting the stain out, he also buffed, polished, and waxed the outside of the car. It looks AMAZING!! Like a new car. I highly recommend Darwin Harris for all your automotive needs!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111508636175195333171", "name": "Maurice McElderry", "time": 1619649379367, "rating": 5.0, "text": "Did an excellent job on my 2014 Tahoe. Liked the texts reminding me of my appointment and when the car was ready. Great job, great service.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "100100598187172903684", "name": "Gordy Wright", "time": 1621812420828, "rating": 5.0, "text": "They always do a great job on my GMC Sierra 2500…recently had them do a clay bar on it and it came out amazing.  Also had them to the same to my sons ‘79 Z28 and it came out nothing short of awesome.  Stop looking for detailers in Fairhope and take your car or truck here, you won’t be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "110544518052820979236", "name": "Amy Patton", "time": 1611359954731, "rating": 5.0, "text": "Darwin and his crew restored my 2007 Jeep Laredo to almost new condition after not being driven for a year. Truly amazing work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "100034466859014273314", "name": "Merril Miller", "time": 1616798079584, "rating": 5.0, "text": "My car has never been in such great shape...like new!  Darwin and his team are so professional and pay attention to detail. It was worth every penny to have them work on my car.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111326096152069898467", "name": "Brooks Royster", "time": 1608595979015, "rating": 5.0, "text": "This is a quality operation at which I entrusted a valued car. The care they gave it was top notch and personal. Well done!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "109419360933835214916", "name": "Jean Merritt", "time": 1619649349050, "rating": 5.0, "text": "Excellent job! Will use them again. Thanks Darwin !", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "110846271833608772345", "name": "Morgan Slay", "time": 1503061897897, "rating": 5.0, "text": "Outstanding Job!  Darwin was professional and very helpful.  Their work exceeded my expectations.  The detail job helped me to sell my vehicle for a much higher price.   You won't be disappointed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7Rk1nLdku3xCHcDO1s6F_9CNCcUzqyWViOT15=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOX4IW0ObSQQFY7KI4sNhKyyl9StB8s-YDRd13R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmbTGgQc7R6EbqXD_xfS54AIvDovaElJTwRAoM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105979873431966700133", "name": "Carlos Thompson", "time": 1592665228094, "rating": 5.0, "text": "We used Darwin Harris Automotive to sell our Lexus ES 350. He did everything from preparing the vehicle for sale to finding us a buyer. We were astounded the vehicle sold so quickly.\n\nWe have also used Darwin's detailing service. I am not exaggerating when I say the car looked better than it looked when we bought it new. We now plan on having our vehicles detailed by him quarterly. Try his detailing service believe me you'll be pleased.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "114632101847497006402", "name": "Jodi Hardin", "time": 1605636991544, "rating": 5.0, "text": "The team did a fantastic job getting into every crevice, working out old stains, and cleaning  carpet. No detail escaped them. We are happily driving what feels and looks like a new car!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "112116454518878263134", "name": "Brenda Harris", "time": 1598555317595, "rating": 5.0, "text": "I took my Silverado 2500 to get detailed today, and the work that they done was Amazing. The staff was very professional and kind. Words cannot express how pleased I am .I would highly recommend you to have service done there. May God continue to bless you Darwin and Thank You 🙏 Again.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102512295380529080425", "name": "Connor Floyd", "time": 1616797445289, "rating": 5.0, "text": "Jeep looks better than when i bought it!  5 stars!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105836649619219837033", "name": "Kristy Lee", "time": 1592459943665, "rating": 5.0, "text": "I chose Darwin Harris Automotive after searching for auto detailing services in the Fairhope, Alabama and surrounding area through reading the great reviews on this site. I must say that Darwin far exceeded my expectations! He not only did a great job on buffing and waxing my 2006 Chevy Trailblazer but he made it took almost brand new. He was personable and honest from the first phone call, to the great work he did on my vehicle and all the way to taking my payment when he’d finished. I can not say enough good things about my experience. I will be telling all of my family and friends about the great service I received from Darwin Harris Automotive. if you are like me and looking at reviews! I completely recommend giving him a shot! You’ll probably be glad you did!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "113294042452647789345", "name": "joel rowlenson", "time": 1608389844449, "rating": 5.0, "text": "I took my 2003 Toyota Highlander to Darwin’s shop the other day. I had not completely maintained this SUV through the summer so to say it wasn’t clean was a understatement!!\nWOW!!! I picked up my Highlander and it was as clean and shiny as the day I bought it!!\nI took my Lexus RX350 Friday morning to Darwin and again WHAT A GREAT JOB. While my Lexus was not a dirty as the Highlander both vehicles are looking as good as the day I bought them!!\nYou need you car truck suv detailed take it to Darwin in Fairhope. You will be pleased with his workmanship and quality of work!!\nJoe Rowlenson", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "101617255511557883297", "name": "Angie Cooley", "time": 1534533041645, "rating": 5.0, "text": "OMG......AMAZING!!!!!!!!!! Y'all I bought a brand new car and 2 weeks after I purchased it, my son left his black slime in the back seat and it melted on my seat!!! I was so upset!!! Oh, and we went on vacation and my dogs hair was also on the seats. Please see photos of the amazing job done by Darwin Harris to make my seats look new again. Thank you Darwin! HIGHLY RECOMMEND!!!!!!!!!!!!!!!!!!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOyRqTehq8HWjqOjUEI9bKYb3ZoWrjJ8dvRkIu2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXG58Wqiy6Njl_lk2dzy7ewe6TJU20tAHJEjH8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnLCuMDI-eXiSP4atGj2xYhGymqbMajnX59XAM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxKpV7LHrfiLF3iVOKptkFSTH_26g_8y9-Gp5l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOi8jWbJphC3jv4VvOhd0_JLZBRC4lPg39u3Aoy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "106426051628492527243", "name": "Angela Garrison", "time": 1599919132802, "rating": 5.0, "text": "This is the place to go if you want a thoroughly clean, sparkling vehicle!!!  We were amazed and very pleased with the results....they transformed our vehicle!  Thanks so much Darwin Harris Automotive!!!\n\nDavid and Angela Garrison", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "104845316487976267239", "name": "Tami Williams", "time": 1594478984182, "rating": 3.0, "text": "I had my vehicle detailed recently for resale. Interior and exterior detailing was acceptable. Unfortunately, the engine was not touched and tire black polish was used on my tires which caused me to clean my tires, wheels and the exterior of my vehicle when I returned home. For the price ($175)\nI expected a little more attention to details.", "pics": null, "resp": {"time": 1594484221906, "text": "Mrs. Williams I apologize if you weren't happy with your clean up. I explain to customers that we can clean on one vehicle all day and still miss a spot or two... not making excuses, but it happens. I do not clean engines...I don't advertise that I clean engines. With all the electrical and computer components on these vehicles today, if water gets in one of those components it can cause major issues, the liability isn't worth the 10 minutes it takes to clean engines. Again... my apologies."}, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "107399699809331872603", "name": "Joey Monachino", "time": 1601591305061, "rating": 5.0, "text": "Darwin Harris did an outstanding job on my vehicle. He went above and beyond my expectations and turned a total disaster into making it look like a brand new vehicle! Highly highly recommend Darwin Harris!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "115750039238591749274", "name": "Berry McKelvain", "time": 1590407068585, "rating": 5.0, "text": "We were VERY impressed with what Darwin was able to do with our 2013 car that we are passing down to our daughter. He made it look brand new inside and out and she felt like she was getting a brand new car! We highly recommend this business. Thank you Darwin!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "116513761443950014274", "name": "Terri Allen", "time": 1594577235330, "rating": 5.0, "text": "I was thrilled with my first experience with Darwin Harris’ Detail on my car this last week. Everything was performed in a timely and professional manner. I can’t recommend this business enough... you won’t be sorry you chose Darwin!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "103841456988155758843", "name": "Heather Koger", "time": 1591328994705, "rating": 5.0, "text": "AMAZING!!!!!!!!!! I was referred to Darwin by a friend of mine that I called in a panic. I ran through some wet White paint that ended up on the entire side of Black car. Time was of the essence and I was frantic. Darwin was so professional and set my mind at ease. I left my car the entire day, feeling uneasy and sick  a little still thinking I was going to need a new paint job. Darwin sent me pictures mid day that looked good. Pictures really do not do justice. I pulled up at the end of the day and seen my car and I was AMAZED!!!!! He got all of the paint off my car and it was so shiny. I cannot express how great of a job he did. If you need you car detailed DO NOT GO ANYWHERE ELSE!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "107014660127687402361", "name": "Merritt Sankey", "time": 1602543695584, "rating": 5.0, "text": "Darwin Harris and his team at Darwin Harris Automotive and Detailing did an outstanding job detailing my car today! I highly recommend their detailing services!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "108726729218417349859", "name": "Carlos Thompson", "time": 1561245191476, "rating": 5.0, "text": "We have known Darwin for several years. Over the years he has detailed our Lexus ES 350 to showroom quality which was no small order. We were very pleased with his professionalism and detailing services. When it came time to sell the car we didn’t hesitate to use him. Darwin sold our car much quickly than we ever could have. See him for your next car purchase and all of your automotive detail needs. Believe me, Darwin Harris Automotive Sales and Auto Detailing is the best!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102188152713475644755", "name": "Martha May", "time": 1599938961461, "rating": 5.0, "text": "Excellent job on Lexus SUV. Very professional owner and staff. Thanks for such a great job!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "106729633709826892787", "name": "Edward Stratton", "time": 1581734134863, "rating": 5.0, "text": "Mr Darwin is an absolute professional at what he does. I brought my car in for him to clean up and he went way above and beyond what I expected of him.\n\nI went for his best package, he calls it \"luxury.\" And by all means it's not cheap at all, but I feel it was totally worth it.\n\nMr Darwin takes his time and you can tell he has an obsession for what he does. He was able to pull out stains I've had for years!!!!!\n\nTip the man, he doesn't disappoint!!!!!!!\n\nThank you Mr Darwin!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "113329398641881986220", "name": "Steven Friedenberg", "time": 1601502907697, "rating": 5.0, "text": "Did an excellent job at a reasonable price  I highly recommend and will use again.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "114871593969468955219", "name": "Mobile Party Solutions", "time": 1583930374194, "rating": 5.0, "text": "Darwin and his guys did an unbelievable job on my car that I had just bought and needed a serious detail job. You definitely get what you pay for here. He is all about attention to detail! If you want the job done right the first time don’t go any where else!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102002218579846683257", "name": "Ruth Finamore", "time": 1561058924149, "rating": 5.0, "text": "Took my car for detail clean , wax, tires, the whole nine yards. When I went to pick it up I didn’t think it was the same car!!  Same day service. Super nice people. And the car was better than new.  Super clean upholstery and every square inch sparkled. Price was right, too. Far better and quicker than the dealership.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "106002734167700404777", "name": "Robert Gibson", "time": 1570832626306, "rating": 5.0, "text": "Had a great experience at Darwin Harris. Got the luxury package which includes a hand wax, carpet shampoo, leather clean and conditioner, and all the expected detail services. My SUV was spotless they even buffed out some light scratches for free. Also had a little dog hair (very little) and they just handled it. Gave a good price on headlight restoration.  So I brought it back the next day. A couple days later brought my wife's car in for the full works. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "115812970416181741379", "name": "Jacqueline Brown", "time": 1573168303738, "rating": 5.0, "text": "They did a awesome job! Cleaned up old stains, waxed, washed, shampooed, and much more. My car looks amazing! Better then new", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "110666938795386542835", "name": "James Sayre", "time": 1568556744983, "rating": 5.0, "text": "Dog made a mess all over the back seat floor. They didn’t just do a once over to get what they got, they went over it over and over until it was done right. The owner strives to have each car cleaned like it was his own! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "108865812487274452515", "name": "Molly Kirchoff", "time": 1576201224379, "rating": 5.0, "text": "I had my car cleaned today and they did such an amazing job!! My car has not looked like this since I drove it off the lot! Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111023615548467787256", "name": "Danielle Stanley", "time": 1565235172554, "rating": 5.0, "text": "I had my inside detailed with my seats and carpets shampooed. I was beyond excited when I picked up my car today. They did a  phenomenal job!!! Mr Darwin was super friendly, professional.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105175995422559143604", "name": "Steven Prince III", "time": 1593721679057, "rating": 5.0, "text": "Great customer service and very professional!! Keep up the great work!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "115497256814383142484", "name": "Vickie Hauser", "time": 1587140168168, "rating": 5.0, "text": "I’ve had my car detailed here, and they do a fantastic job! Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "107751932678313945440", "name": "Steve Butler", "time": 1538914340289, "rating": 5.0, "text": "In my opinion, anyone on the eastern shore who is looking for a clean, sound, late model vehicle should first check with Darwin.  I cannot say enough about my recent, positive experience working with him.  Darwin made it painless to trade in my truck for a sedan.  He also secured excellent financing.  He is a person of honesty and character, and we are fortunate that he does business in our community.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "106611655696600318088", "name": "James Ekelund", "time": 1536940833466, "rating": 5.0, "text": "When it came time for my teenage daughter to go to college in a larger city some distance away, I wanted to make sure she had safe, dependable and economical transportation. I often passed the Darwin Harris automotive lot. Having done business with Darwin in prior years at a major Eastern Shore dealer, I had grown to know and TRUST Darwin's sincere approach to auto sales and service. BINGO! Darwin is succeeding on his own with the same level of credible and friendly service right in south Fairhope. I found the perfect college vehicle. My daughter drove it through college, married a young man who also thought it was a wise purchase. In fact, he even drove it himself after purchasing his wife a new vehicle in Birmingham. Kudos to Darwin Harris! Do yourself a favor and check out Darwin's fine selection of gently used vehicles, save $$$$$", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "109903032751918512611", "name": "Tyler W", "time": 1589553464395, "rating": 1.0, "text": "Talked to my wife like she was stupid. Told her a price then when she arrived tried to double the price.", "pics": null, "resp": {"time": 1589562923504, "text": "Every customer that calls requesting pricing over the phone  are given a price based on the type of cleanup they're wanting and the size of their vehicle. They're immediately told that pricing could changed depending on the condition of the vehicle... plus your wife declined to have the vehicle cleaned. I'm sorry if there was any confusion."}, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "103146996587337492177", "name": "Denise Googe", "time": 1583870016375, "rating": 5.0, "text": "Awesome.....My car looks shiney and clean. I 100% recommend Darwin Harris!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111928747460633638666", "name": "Mary Lanaux Katzman", "time": 1459017772282, "rating": 5.0, "text": "Very pleased with the service and quality of work! I got the Spruce Up package and added Leather Cleaning and Conditioning. It was the perfect spring cleaning for my car. I have a toddler so my seats were covered with milk splatter and crumbs. They are now so fresh and soft.  Definitely recommend this business. Darwin is a very nice man.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "101065536463431163664", "name": "Dan and Dawn Hoover", "time": 1566525752078, "rating": 5.0, "text": "Our car came back looking and smelling like new! Great service! Would definitely use again!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "107962513478501628791", "name": "Cathy Calametti", "time": 1531571392347, "rating": 5.0, "text": "Darwin and his team did an excellent job detailing my 2013 Lexus in 2017, so I decided to have my son's 2005 Tahoe detailed this year for his Birthday. Words cannot describe how bad the interior was.  Somehow they pulled it off and had everything looking and smelling so much better!  Darwin is a true professional, not only in the work that he does, but also in the way he treated me as a customer.  He will definitely have my business in the future!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "112619854038331604941", "name": "Jeri Harrison", "time": 1566661293892, "rating": 5.0, "text": "I was shocked at how beautiful my 11y/o Lexus SUV looked after Darwin’s detailing. That car has been through a lot of carpooling and chicken nuggets ~ he made it look new again!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105552729959363072942", "name": "Joseph Bolton", "time": 1483736239981, "rating": 5.0, "text": "Excellent service! I was very satisfied with the quality of the detailing service, the best I have seen.  My car is cleaner now than when I drove it off of the car lot new. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "117827572633339326871", "name": "Sabrina Chandler", "time": 1475705043626, "rating": 5.0, "text": "I was in the market for a mid-sized SUV. I had looked all over the Gulf Coast, but no where did I find a good deal with very friendly service as I did with Darwin. I was treated like family from the very beginning. Almost 2 years later and I am still very happy with my Equinox. When the time comes for another vehicle, I will definitely go to Darwin.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "101436111480910750044", "name": "Pattie Lipps", "time": 1483492499674, "rating": 5.0, "text": "We brought my Mother's Kia that had not been taken care of the exterior and interior needed a lot to tender loving care.  When we went to pick up the car today it looked like a brand new car inside and out,  Mr. Harris and his crew did an excellent job and we highly recommend there services.  They were very courteous and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "113872528217653582322", "name": "Susan Hall", "time": 1475422692111, "rating": 5.0, "text": "We have known Darwin Harris and his family for many years.  He is an honest business man and strives for quality service.. We recently purchased a car from him and will purchase our next one from him as well.  I would highly recommend you visit Darwin Harris Automotive to purchase your next vehicle", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "100357782347595808793", "name": "Roderick broughton", "time": 1569347852088, "rating": 5.0, "text": "Excellent customer service! Car had an over spray on it and they were able to get my Black SUV looking brand new", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "118445262185214986254", "name": "John", "time": 1518046732914, "rating": 5.0, "text": "Consigned my vehicle at Darwin Harris Automotive and sold it super quick!  Very painless process.  He also does great detailing work!  Thanks, Darwin!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105627146748446935522", "name": "Jim Seiler", "time": 1483459788706, "rating": 5.0, "text": "Darwin and his crew did a great job detailing my wife's 2010 Ford Fusion.   It looked like a brand new car.   My wife said that the car looked and smelled even better than the day we bought it.\nThank you!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "114601094453482880941", "name": "Stephen Irons", "time": 1523402855395, "rating": 5.0, "text": "Just picked up my 2008 Silverado from Darwin Harris Auto Detailing.  The BEST detail work on a vehicle that I have ever seen!!!!   Great staff and customer service.  You will not go wrong at Darwin Harris Auto Detailing!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102637217249560096791", "name": "Mary Alice Nelson", "time": 1521490054071, "rating": 5.0, "text": "What a great experience! Mr. Harris was kind and professional, and my car has never been cleaner. I will definitely return!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102024736751998506554", "name": "Heather Davis", "time": 1517081725811, "rating": 5.0, "text": "Excellent work! Very Professional! Would recommend to anyone who is needing a car detailed! Keep up the great work.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "115014126636450179024", "name": "Trent", "time": 1559404718989, "rating": 5.0, "text": "You won’t find a place that will clean your car up for as cheap as Darwin Harris. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "108755361996596131672", "name": "Minnie Skinner", "time": 1472677685232, "rating": 5.0, "text": "We are always so please with the friendly, prompt service that Darwin Harris provides us.  Our cars are shined ....the price is right...and the experience always leaves us smiling!  If we needed to sell or buy a car...he is our guy!  Thanks, Darwin, for your excellent service!\nMinnie and Ed Skinner", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "116114654497655925034", "name": "Catherine Calametti", "time": 1509162045290, "rating": 5.0, "text": "This is the place to go!  They were quick, professional, dependable, and they made my 5 year old car look brand new!  I would definitely recommend Darwin and his crew!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102309908183186392300", "name": "Paige Young", "time": 1560368337403, "rating": 5.0, "text": "Amazing job and great price for such a thorough job! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111169139351877772376", "name": "Paul Klutes", "time": 1528824787120, "rating": 5.0, "text": "Darwin did a fantastic job on our '09 Grand Cherokee....it really needed a deep clean and came out looking like new!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111417685183729631813", "name": "Kelly White", "time": 1486687401374, "rating": 5.0, "text": "I took my 03 Tiburon to Darwin for a full exterior and interior clean. The car looks fantastic. They did a fantastic job.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "117256323432895109561", "name": "Joy Tanner", "time": 1512582073715, "rating": 5.0, "text": "There are not enough words to describe how incredible this place is. I took in an old Honda Accord that had been used for transporting dogs and was COVERED in dog hair. It hadn’t been properly cleaned in YEARS and it was HORRIFIC to say the least. I brought it to them (in shame) lol and they transformed it into a car that looks like it came off the showroom lot. They worked for 9 hours on it (it REALLY was that bad. I couldn’t say enough great things about Darwin and his employees. They are literally miracle workers and are super kind and take their jobs very seriously.  Don’t walk, RUN to Darwin Automotive in Fairhope. They have customers for life with my husband and I. The eastern shore is extremely blessed to have this fantastic business.\n❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "108747910071687170187", "name": "Patrick Collins", "time": 1460738048266, "rating": 5.0, "text": "Darwin Harris Automotive is a good place to buy and car. Mr. Harris is fair and honest in our experience. He does not act like the cliche' car salesman, which is very good.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "111390061835348791607", "name": "Kayla Wright", "time": 1466658980260, "rating": 5.0, "text": "My husband purchase a 2011 ford f150 am we have loved it since buying it. Thanks Mr Harris.  Randall an Tracy Miles.  Hoping to make a purchase soon for our daughter", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "112310642243134647870", "name": "R Cunningham", "time": 1520099228951, "rating": 5.0, "text": "The BEST ever!   Car with 180k miles looks and smells new.  Worth every penny.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105705457944684585261", "name": "George Fuller", "time": 1459883046161, "rating": 5.0, "text": "Beautiful work. Impeccable service. And friendly guys on top of that. I really don't know you can do better.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "112291436073043059157", "name": "Susan Fossett", "time": 1474393909421, "rating": 5.0, "text": "I never have had a car detailed before, and this was a great first experience. The car looks better than new, and it was done quickly and at a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "100361736470232834318", "name": "Julie B", "time": 1506172981449, "rating": 5.0, "text": "Excellent service my Honda Pilot looks new and it is amazing what these guys do!! Highly recommend they are professionals.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "100995073485855235292", "name": "Bonnie Orswell", "time": 1535026348909, "rating": 5.0, "text": "Very happy with my Toyota, quailty car at a fair price! If have to buy another car in the future, I will check with Darwin", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "118438811213162226395", "name": "Kiki Sealy", "time": 1509629840492, "rating": 5.0, "text": "Darwin's crew did a fantastic job on our truck!  Will definitely use them again!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "110941502555675000415", "name": "M. McNeal", "time": 1443301377684, "rating": 5.0, "text": "Wonderful customer service.  Fair pricing and received a great deal!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "118342647175137503332", "name": "Charles McGaster Mcgaster", "time": 1526933737674, "rating": 5.0, "text": "Here at Darwin Harris auto sales and detailing you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "104261402552086719831", "name": "Athonis Dobbins", "time": 1515221873732, "rating": 5.0, "text": "Great automotive detailing 📍👍🏽🚘🚖🚕", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "102365090177918038956", "name": "Amber Detamore", "time": 1504445422535, "rating": 5.0, "text": "They did an outstanding job on my Tahoe!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "101000128337688148541", "name": "dianne herzog", "time": 1485219004351, "rating": 5.0, "text": "Excellent!! Made my dirty car like new again!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "114317278052446331905", "name": "joey west", "time": 1464300263192, "rating": 5.0, "text": "Best detail service my Infiniti has ever received!", "pics": null, "resp": {"time": 1464301671410, "text": "Thanks for the great review Mr.West!  We look forward to serving you and Mrs.West again very soon, especially now that you guys are adding a new passenger to that fine Infiniti real soon!  Good luck...."}, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "106949316991416413148", "name": "Chris Pappas", "time": 1460820478601, "rating": 5.0, "text": "Very satisfied with my detail!! Can't beat the fast service.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "109318777397905049615", "name": "Bryan Heyward", "time": 1460678453316, "rating": 3.0, "text": "Excellent service and awesome staff.", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "108201553788060631812", "name": "Cecelia Asberry", "time": 1561244231633, "rating": 5.0, "text": "Awesome service!!", "pics": null, "resp": null, "gmap_id": "0x889a3f86897bedf3:0xc59ea2a72dffa5c7"}
{"user_id": "105923460426637459247", "name": "Ana Hammond", "time": 1572057145405, "rating": 5.0, "text": "(Translated by Google) The service is excellent and car prices are very cheap, there is financing by bank and at home.\n\n(Original)\nLa atención es excelente y los precios de los carros son muy económicos, hay financiamiento por banco y en casa.", "pics": null, "resp": null, "gmap_id": "0x8889052ab8c38d93:0x67b388913a893a0f"}
{"user_id": "114721342025339462171", "name": "Brittney Star", "time": 1624919347556, "rating": 5.0, "text": "Literally the best car service ever!! Customer service is the best in town, they fixed my car in a timely manner and were very sweet to me! I would definitely recommend this place.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "105582932296708634273", "name": "Theo Zinner", "time": 1620502331464, "rating": 5.0, "text": "Many other shops turned me down as they did not want to work on my 91 mr2. Eagle imports was able to do it. They went above and beyond by finding all the bolts I was missing. They even gave me a free floor mat for my other car. If you have an older car I would highly recommend eagle imports.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "114109583165041797060", "name": "Alessandro Sanna", "time": 1612314042534, "rating": 1.0, "text": "The old grandpa at the desk need to learn to talk to a costumer. Nobody will ever come back and pay you thousands of dollars to get treated like that. Lost my business, my brother business and any person I can make aware of this place. Not going back", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "102107277082667812883", "name": "Ambriah Chambers", "time": 1600023891916, "rating": 5.0, "text": "This place is amazing always on time with everything they are so very nice and treat your car with the absolute most care! They fixed my air conditioning within two days and I had my car back immediately that morning such a great place everyone who works there your doing a great job!😇", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "111876756943389700380", "name": "Megan Johnson", "time": 1588873228818, "rating": 5.0, "text": "Very honest and kind people! Priced my BMW maintenance for 125$ less than PepBoys. Car was fixed in a timely manner. Won’t be taking my vehicle anywhere other than Eagle Imports from here out!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "105702402226150122580", "name": "Edwin Guy", "time": 1589553250380, "rating": 5.0, "text": "This is a long overdue review from Guy in the red 180sx. Eagle Imports is very conveniently located on Opelika road right by Byrons Smokehouse and let me just say the work these guys do is spot on! They take on mostly Euro cars but will and have worked on Japanese cars and other import cars. I’ve had a chance to speak and watch the owner Of eagle imports work and he himself is the man with the plan, if another shop can’t get it done this man can! These guys do amazing work and the price is right!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "105720328237822440417", "name": "Roy Washburn", "time": 1567186577976, "rating": 5.0, "text": "Made an appointment for 8am and upon arrival was greeted by name, had all my details up and ready.  Confirmed my details and immediately took my car back.  They also were careful to point out some other kptional items but did not pressure me to purchase.  Even one item they did for parts only since they were already working in that area of the car and part was VERY reasonably priced.  Would definitely continue servicing my vehicle here.  Thanks to Larry and the whole team!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "117312927315537485514", "name": "Ryan Martin", "time": 1626489116478, "rating": 5.0, "text": "New review:\nI was back at the shop again, this time for a good bit of work (control arms and steering rack replacement) on my C230. They got it in and out quicker than I expected, and the work was millimeter perfect. I picked it up this afternoon, and spent two hours this evening joyriding around town because the car just felt that good.\n\nThey're truly a proper shop that will get your back on the road for pennies on the dollar as compared to a Mercedes dealer. Hard to ask for more.\n\nOld review:\nThanks to Larry and the guys for getting my SLK 230 back up and running, and some $300 cheaper than their local competition! My old beast has 277,000 miles on it, so maybe with their help it will get to 300,000 and beyond.\n\nThey were transparent and thorough with every update, so I would definitely recommend them to anyone else for their import repair needs.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "107301229284750541964", "name": "maggie hall", "time": 1602787495964, "rating": 1.0, "text": "Terrible customer service and i mean TERRIBLE they were rude as hell.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "112026031712619537773", "name": "Garrett Hoke", "time": 1555680605564, "rating": 5.0, "text": "Fastest I’ve ever seen someone identify and fix several specific issues under my bmw’s hood. These guys know what they’re doing.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "107994934685141030143", "name": "JT Whitlow", "time": 1556746390581, "rating": 1.0, "text": "Wasn’t very pleased. They charge you for things you can get free and will hold your car hostage until you pay a fee that they do not disclose to you. Be careful, I should’ve listened to the previous reviews. Oh yeah, I guarantee there will be more than one thing wrong with your car. I’ll go to Birmingham before I go back there.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "112306365831219394546", "name": "Chris Gilbert", "time": 1511882651313, "rating": 5.0, "text": "The technicians are very friendly and very knowledgeable. They clearly communicated the problems with my car after other shops in town couldn't diagnose, much less fix the problem. The prices were fair and it was fixed in a timely manner. I'll definitely be returning for all of my service needs!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "101201944633075556881", "name": "Tiffany Hodges", "time": 1569897967687, "rating": 5.0, "text": "I have VW and this is the only place I will take it. Larry and his staff are honest and pricing is reasonable.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "102630108395394254358", "name": "beyoung joe", "time": 1549497807750, "rating": 5.0, "text": "This is Joe, who fixed car here. This is a good shop to fix your import cars, Larry and other guys are great and solve all my problems. They fix cars fast and reliable, if you have problems with your cars, just go this shop. It's good choice.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "109317109500050705846", "name": "shabnam habibi", "time": 1508730042967, "rating": 1.0, "text": "This is the worst place to go. I had engine check on in my car. Its valve cover gasket needed to be replaced.  Although I told them what the problem was, they kept the car for 3 weeks and asked for $250. The moment I turned the car on in their yard the engine check sign reappeared and this time it was flashing, which means there is a worse problem with the car. I HAD to get the keys back to them. This time, they kept the car for one more week and ask for extra $150. The guy in charge told me that there is also a problem with the coils. They didn't even bother turning on the car to see if any problems show up. If the coils had the problem from the beginning, they should have been able to diagnose it. In total, I paid $400. Two weeks later, the engine check came back again. I went there and he said you need to pay another $100 for diagnosis!! They just want to rip money off of you! Never go there!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "105072530198819035319", "name": "James Puckett", "time": 1477489816199, "rating": 5.0, "text": "I have been here a couple times for repairs on a 1999 Mercedes C230. It is little pricey but that is expected from a small specialty import shop. Customer service was great and quality repairs were made. Would come again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "108626191668186493778", "name": "UKNOW !!", "time": 1513348201110, "rating": 5.0, "text": "Great people with Great service!!! I was pleasantly surprised will the positive attitudes and it shows in their work! Thank you guys for a great experience!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "115705277603958951866", "name": "Jeffrey Yukawa", "time": 1479078320346, "rating": 5.0, "text": "I have had a lot work done there. Fair prices and quality work. I highly recommend going there if you need work done to your car! I drive a lowered civic si and no one around town could aline it. Eagle Import had it done and driving straight in no time. Great place!", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "102804962827621547009", "name": "Kimberly Aston", "time": 1590400365767, "rating": 5.0, "text": "Very awesome customer service", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "111800943912893851213", "name": "Andi Dover", "time": 1577486862527, "rating": 5.0, "text": "Very helpful n sweet", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "109196307257239294605", "name": "Doug Reid", "time": 1514507200676, "rating": 2.0, "text": "Definitely a lack of communication w car owners, At first I was excited to find some place that was doable for import cars. I was quoted 3.5 hrs for a job plus parts. I told them going in it was an old car w a lot of miles, and  it wasn't worth much, so I didnt want to spend the cars value on the minor repair needed. So after 2 weeks its still not completed, they are blaming defective new parts, told them to put the original part (oem)back in since they were having so much difficulty and I need the car.\nThe car was driving wonderful but water pump was leaking, hope I can drive it now for a while, but I am concerned.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "105094437529890609865", "name": "tam stew", "time": 1556914915106, "rating": 1.0, "text": "Totally  tried to rip off my parents  on their Audi repairs.  Stated 3500 because compressor went out. My parents took the car to Audi dealership for repairs who stated it was only the fan that went out..cost 550.00.  They even charged for low fluid but the car fluid was filled a week prior. My parents are elderly...buyer beware", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "100647754745570814585", "name": "Moofuly", "time": 1530115892765, "rating": 5.0, "text": "If it’s not you care about what you drive & it’s not American . You’re going to want to take it here , fantastic service & they even waxed my car! 👍", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "116018064865098885310", "name": "Michael Cohen", "time": 1412107659362, "rating": 1.0, "text": "AVOID THIS PLACE AT ALL COSTS!!! Took my car for an oil change and brake check. Wanted to charge me over $100 for an oil change, so I had them nix it and just check the brakes. Came back and told me they would do the brakes and the oil for $450, which is absurdly overcharging. Told them no thanks. Owner had already told them to start the oil change and he'd charge me just for the oil and filter and the brake check. Whatever. Except they only put 5 qts of oil in the car which requires 5.5L, and used 5W30 instead of VW approved 5W40 like I specifically requested before turning over the keys initially. So not only did they try to overcharge me, they didn't even properly complete the work they did. The owner was sketchy throughout the whole deal. I had to repeatedly ask for quotes, which he never gave me solid estimates on, and I never felt like I could trust the work they did.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "100273053808911565792", "name": "Kevin Copeland", "time": 1409868895652, "rating": 5.0, "text": "I have a 1974 VW thing I took it therefor a problem with the ignition which they fixed and was asked about an oil leak. I said I would love to have it fixed and it got fixed for three day and then it was leaking again. Well I took back and after we got the parts Issue squared away the car was fixed. I was shown the work that was done and it was all   very well done and I was and am very pleased.\n\nI will take my vehicle again and I would say to you that if you have a air cooled VW take it there and you will be treated very very well.\nHope this helps", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "101650766525582821457", "name": "zmthornton", "time": 1414087754990, "rating": 4.0, "text": "These mechanics are very knowledgable and capable of tackling difficult/unique issues.\n\nPatience and financial flexibility can play in with the overall experience because they are a small local shop. They aren't going to budge on price, but if you can be patient with them, they are good at being accommodating when issues arise. For instance, my 31 year old Land Cruiser FJ60 was brought to them to do an extensive AC overhaul. Their estimates seemed a bit on the high side, but again, they are very knowledgable and reasonable mechanics who want to \"get it right the first time.\" They also never charged me for my truck occupying their space for over a week while waiting for parts to arrive, which was nice.\n\nThe \"Ya get what ya pay for\" adage plays in here, as they will help tackle tough issues and see them through til the end. Being a smaller shop that specializes in imports, there are going to be shops around that would do the same work for less money. However, chances are that you might not find the same level of knowledgable and thorough mechanic work.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "104943494891184223359", "name": "TheChosen One", "time": 1571710617069, "rating": 1.0, "text": "Not Really A Company For The Area", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "111176734351436948631", "name": "Jay Mittal", "time": 1530736880492, "rating": 5.0, "text": "Honest place for Merc repairs", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "108367550757376066220", "name": "Xay P", "time": 1519268615047, "rating": 1.0, "text": "Every time they fix something on my car, I have to bring it back for something else, they try to get more money from you by barely fixing the problem so you can return it.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "109881547592620864180", "name": "Austin Campbell", "time": 1503611837622, "rating": 1.0, "text": "Worst phone communication by a small business by far.", "pics": null, "resp": null, "gmap_id": "0x888cf2e0c85d13b3:0x4f1f235ee3e07b59"}
{"user_id": "118316662123247124757", "name": "Rhonda Madaris", "time": 1622241866798, "rating": 5.0, "text": "Went to Driving Factor had an awesome experience with the staff! They went over and beyond to get me into the vehicle I have now! Becky is awesome ! My daughter has a vehicle from here also! I would recommend them to anyone ! 💯", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "108355722813747757499", "name": "Dan Floyd", "time": 1615556564714, "rating": 5.0, "text": "Wonderful people!! Have shopped with them for several cars! Fixing to pay off a car we got from them. They have great warranty on the cars and they sell really good used cars. Love these people like family!", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "105783420476477359747", "name": "Amber Hart", "time": 1617835429998, "rating": 1.0, "text": "Let me tell you a story.  A story of buying a minivan.  Our car at the time had transmission issues and due to poor credit we came to The Driving Factor because of their decent ratings on Google. We bought a 2008 Chrysler Town and Country.  I rarely drove it as my car was being constantly fixed,  and only used it as a backup.  I owned this van for 3 months and didn't even put enough miles on it to get an oil change.  Then one night,  I wake up to the police pounding on my door at 2am. Why were they pounding,  you ask? Because the minivan in my driveway had burst into flames.  The reason? Shoddy electrical shorted out and caused a fire near the gas tank.\n\nI lost valuable camera equipment and a vehicle I had a 375 a month payment on.  To top it off this happened around the time my cars transmission went completely.\n\nWe went to TDF. They informed us there was no warranty for the electrical system.  They would,  however,  \"kindly\" give us a loaner car to drive until the insurance finished their claim on the van.\n\nThe loaner was an old Impala that absolutely reeked of cigarette smoke and was constantly overheating and breaking down.  When my husband complained,  the older lady told him we should be thankful to have a loaner vehicle at all because that's not something they do.  They also wanted us to continue making the $375 a month payments on a minivan that was burnt to a crisp.\n\nThere were no apologies.  When the insurance claim was finished they said we still owed $2000 (they were making us pay all the interest on top of what the van cost) and in order to get another vehicle,  we would have to pay that $2000 on top of a down payment.  They literally sold us a POS and then wouldn't work with us at all.  Great business practice!\n\nWe took our business to High Country Toyota and got a minivan that lasted 3 years ( and a shorter loan of 18 months vs the 3.5 years Driving Factor had us roped into). I went back to High Country when that van needed to be replaced and bought myself a brand new Corolla.\n\nLong story short,  don't go here,  ever.  Not only did I get sold a Lemon but I had to replace $5000 of camera equipment that was burned up inside the van, and this dealership did not care one bit.", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "107036023556776111092", "name": "Mr. Ross", "time": 1610227713102, "rating": 5.0, "text": "The absolute best people to deal with. They stand behind what they sell and I've been comfortable with them since day one", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "110652520376887287825", "name": "Melissa Kellar", "time": 1613877867903, "rating": 5.0, "text": "Amazing employees always super friendly and always willing to help. I have bought several vehicles from them and wouldn’t buy from anywhere else!!!", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "110422710025742137966", "name": "Debra Ann Elliott", "time": 1619027344996, "rating": 1.0, "text": "Their website states they help people rebuild their credit, but that is not true. They use a finance company who will turn you down if your credit is not perfect.", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "103282403693179923625", "name": "Zachary Brooks", "time": 1617047703519, "rating": 1.0, "text": "Worst place ever to buy a car, the car my mom got is a pos and total lemon, also being over charged for it, bypass this place if your looking for a vehicle period.", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "107334277758604006387", "name": "Joyce Holmes", "time": 1598081564934, "rating": 5.0, "text": "The people are absolutely great there. They will help you with any problem you might have and their cars are guaranteed", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "101806419994051681272", "name": "Johronia Mitchell", "time": 1578377509889, "rating": 5.0, "text": "WONDERFUL service and fantastic employees...got a great car from them", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "112325154276386304943", "name": "jessie smiles", "time": 1558377309466, "rating": 5.0, "text": "Awesome awesome ppl here. They will help you and get you into a good vehicle even when credit ain't the best from family ruining your credit ya still have hope with them.", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "116989641253835787717", "name": "Mike Buck", "time": 1592623315102, "rating": 4.0, "text": "Good cars...fair prices", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "116048505906542731825", "name": "jjreynso123", "time": 1424462702848, "rating": 5.0, "text": "They will do everything in their power to put you in a vehicle that is affordable for you! They don't judge you based on your credit score! Definitely NOT your ordinary Buy Here Pay Here!", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "116646277347360540686", "name": "lynette stegeman", "time": 1594859158309, "rating": 5.0, "text": "Best car dealer !", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "114318974198844547098", "name": "Tanya Stewart", "time": 1507207284439, "rating": 5.0, "text": "Great people to deal with....been buying cars from them for over 6 years....just traded my car in for a 2013.....love it", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "115893395318860676898", "name": "Allison Neal", "time": 1462180720911, "rating": 4.0, "text": "They'll work to get you the car you want. But they do overprice them. And if the car has a problem it takes them forever to get it in the shop. Also they harrass the ever loving crap out of you the very day your bill is due.. Starting early in the morning. Otherwise, decent company. Decent cars. But, my check engine light is still on even after taking it to get \"fixed\" 2 days after I got it.", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "116996724376524448978", "name": "Angelia Harris", "time": 1519046607156, "rating": 5.0, "text": "Clean employees very nice an sweet helpful an pits their customers needs first.  I won't go anywhere else to get a car", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "117755422589475188618", "name": "Cedrick Grace", "time": 1560184456088, "rating": 1.0, "text": "They tell u to keep car for so long where it loses value so when u try to trade it in the overwhelm u with prices", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "109603211958112198687", "name": "William Dake", "time": 1578431050101, "rating": 1.0, "text": "Because they over charged me for a vehicle", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "107224143558346322669", "name": "Kristilyn Sloan", "time": 1533481094433, "rating": 5.0, "text": "They are awesome and will work with you.", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "113535937973893679339", "name": "Patsy Anne Lavelle Berry", "time": 1591011454077, "rating": 5.0, "text": "Cool cars", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "113172201504427324757", "name": "Anthony Ledbetter", "time": 1549680686263, "rating": 1.0, "text": "To high and unwilling to negotiate", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "111568191410480651479", "name": "Robert Martin", "time": 1542855613962, "rating": 1.0, "text": "They false advertise, they are not a buy here pay here dealership like they say they are,  they require outside financing!", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "113504456627249464920", "name": "Robin Holt", "time": 1598058899409, "rating": 4.0, "text": "Very friendly people", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "110326113981921339851", "name": "Eddie Dodgen", "time": 1558616602790, "rating": 4.0, "text": "Great dealer ship", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "117521670602408421832", "name": "Angela Byrd", "time": 1584655670933, "rating": 4.0, "text": "Nice staff", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "112751544228001100565", "name": "Brooke Morris", "time": 1519803219424, "rating": 1.0, "text": "Don't buy a car from here!", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "108396513862448848132", "name": "Gary Morrison II", "time": 1560945464987, "rating": 4.0, "text": "😀😀😀", "pics": null, "resp": null, "gmap_id": "0x8889f917f3a2026b:0x6d970a9fce4b1299"}
{"user_id": "102277449624529581700", "name": "brittney smith", "time": 1625149441308, "rating": 5.0, "text": "Great place to shop for cars! The staff is very friendly and they definitely will work with you. I recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "105559052648438238437", "name": "Mark Abeyta", "time": 1611971399178, "rating": 5.0, "text": "Very courteous and professional nice people to deal with.didnt buy a car from them.something came up.nice selection of cars reasonable priced too owner was willing to work with me.would recommend buying a car from them.", "pics": null, "resp": null, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "102201109029160222971", "name": "Eric “Repoman” Kirkland", "time": 1619454388769, "rating": 1.0, "text": "This company is a scam that will forge your co- buyers signature! They Will tell you the amount of $ to be financially secured by credit acceptance is approved, get you to sign a contract and send you on home with the car your wanting to purchase! They don't tell or send credit acceptance any information until you leave, then they add thousands of dollars to your contract without your awareness of it being done! I know in fact they do this because I have replied 6 of the Carr's they forged customers names on!", "pics": null, "resp": null, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "104464822874490960685", "name": "Stephanie Jackson", "time": 1622336707403, "rating": 4.0, "text": "Very nice courteous experienced staff", "pics": null, "resp": {"time": 1625147777678, "text": "Thank you"}, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "116191031864552198735", "name": "Brent Smith", "time": 1609256928096, "rating": 5.0, "text": "Cool site need to holla back at me though about how much down lol need a ride asap", "pics": null, "resp": null, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "112702573766109593278", "name": "Laurie Walker", "time": 1616557128525, "rating": 5.0, "text": "Great cars anf great people.", "pics": null, "resp": {"time": 1625147752033, "text": "Thank you!"}, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "117857885583281744004", "name": "MONTHER IBRAHIM", "time": 1612327378222, "rating": 5.0, "text": "The are very friendly and helpful!", "pics": null, "resp": {"time": 1625147861698, "text": "Thank you"}, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "111807497547570599141", "name": "lacey truett", "time": 1603230917514, "rating": 5.0, "text": "Best customer service, great dependable vehicles", "pics": null, "resp": null, "gmap_id": "0x888bb15732cb09e5:0x6d12fe01691b5153"}
{"user_id": "118341671509295117919", "name": "Michael King", "time": 1565305645617, "rating": 1.0, "text": "Drove all the way from Andalusia to try an do business with these people. Get to the lot an his son came out to us. For a $5000.00 car,  needed a new battery,  paint peeling off, the driver seat and passenger seat was all ripped up. We asked what would it take cash to buy the car. Called his dad out to help answer that question.  He was very rude, smart mouth,  we just turned an walked away got in truck drive off. Go 2 blocks down the road and had AMAZING help. Drove off in a newer, nicer car. I will NEVER send anyone to this place. Very very RUDE people.", "pics": null, "resp": {"time": 1569526563729, "text": "I apologize for the bad experience. My brother can come off grouchy.  Should you return to the lot please ask for me personally and I will do everything possible to earn your trust back. Warmest Regards Janet Langford"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "105680594861311951203", "name": "Terri Allen", "time": 1500470908583, "rating": 5.0, "text": "Wonderful and friendly staff. I had a great experience when looking at the vehicles. They were clean and ran beautifully. Everyone there made my experience enjoyable and I will be turning for all my future purchases.", "pics": null, "resp": {"time": 1500483236585, "text": "Thank you for the 5 star review!"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "114576284209719689977", "name": "kathyanna davis", "time": 1559569934473, "rating": 5.0, "text": "These people are awesome most buy here pay here places will sell you junk and dont care but they sold me an older car that runs really good.They take the time to listen and really want to help. I would recommend Langfords to anyone.", "pics": null, "resp": {"time": 1556902245392, "text": "Thank you for the 5 star review."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "116723765694953686649", "name": "Tracey Goble", "time": 1535548386913, "rating": 5.0, "text": "Great people great deals and dedicated to make sure the customer is satisfied and leaves in the vehicle they want I love them I'll buy my next one from them as well", "pics": null, "resp": {"time": 1537424500255, "text": "Thank you for the review. We appreciate your business..."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "103978699125206066715", "name": "Janet Langford", "time": 1559078226166, "rating": 5.0, "text": "I own it, well half of it, so of course I'll give it a 5 star. Lol", "pics": null, "resp": {"time": 1574364402106, "text": "Janet Langford has stepped down from Langfords. Benny Langford continues the Langford tradition of providing used cars to the wiregrass area."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "113223168230098688954", "name": "Ben Larkin", "time": 1524071760848, "rating": 5.0, "text": "When I went to purchase a vehicle they made sure everything was taken care of and fixed before they sold it very friendly I would  highly recommend", "pics": null, "resp": {"time": 1524073380297, "text": "Thank you Ben for the 5 star review. Welcome to our family of customers!"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "102363784430308609358", "name": "jon carnley", "time": 1515472276775, "rating": 5.0, "text": "Were to start I first went to car mart in enterprise they told me I could get a car then after I was told to come in and do paper work but then when I got there and was told they could not help me so I went to langfords and talk to Janet I think that her name well let say in she told me no problem I could get the truck I picked out and I am happy about that and she was really nice and I will definitely tell people to go see them and got my payments were I needed them to be\nI want to say THANK YOU", "pics": null, "resp": {"time": 1515531412941, "text": "Happy to welcome u to our family of customers... Thank you for the review.."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "117392338650703924205", "name": "JR Cambron", "time": 1500404417771, "rating": 5.0, "text": "I have dealt with Langford Quality Cars for about 23 years now. I have fond them to be very understanding when I was sick and had to have surgery, I let them know I could not afford to keep the truck I had they came and picked it up then when I got out of the hospital and was able to return to work they sold me another truck with no down payment.\nJanet has always been understanding if people would call and let her know they were getting behind because of losing a job or some kind of illness. I have always known her to work with people if they gave here the respect of letting her know what was happening.\nThe people I hear talking bad about them are the ones who don't call and move. Or hide their cars then they get mad and badmouth her and the business.I have also noticed most of those people have a history of trying to keep from paying for what they buy from anyone and according to them it is always the business or the people that work there that cause the problem. But really it is just the customers going from place to place trying to beat businesses out of their merchandise without paying for it.\n\nTHANK YOU LANGFORD I HAVE ENJOYED OUR LONG ASSOCIATION. AND LOOK FORWARD TO MANY MORE YEARS.", "pics": null, "resp": {"time": 1500483316572, "text": "Thank you for the review!  Your loyal patronage over the years is appreciated so much!"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "111173284866184469733", "name": "Dia Donson", "time": 1538767098330, "rating": 4.0, "text": "My hubby has a car from them. Staff was friendly and understanding.", "pics": null, "resp": {"time": 1544542451138, "text": "Thank you for the review.  We are happy to have ya'll in our family of customers!!"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "100906742699690147309", "name": "macan kumpul", "time": 1491489092682, "rating": 5.0, "text": "very friendly staff and they sell good cars with reasonable price", "pics": null, "resp": {"time": 1500483872628, "text": "thank you for the review!"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "103813045116969281029", "name": "Sherman Barrett", "time": 1508189540237, "rating": 5.0, "text": "It was a very good experienceand great people too.", "pics": null, "resp": {"time": 1515531318411, "text": "Thank u for the review.  We appreciate the business."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "102281761807757985026", "name": "SandraMay Smith", "time": 1546983543323, "rating": 2.0, "text": "Not very nice peoole! So disrespectful", "pics": null, "resp": {"time": 1520847531972, "text": "I'm sorry you had a bad experience. Please visit again and ask for me Janet Langford.  I will be happy to try and resolve any issues u have."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "114234938567841154689", "name": "Norinco Warren", "time": 1523882363606, "rating": 5.0, "text": "Langford auto sales helped our family so much. Very understanding people, that sometimes things happen and everyone needs a second Thanks Langford", "pics": null, "resp": {"time": 1524073465388, "text": "Thank you Norinco for the 5 star review.  Welcome to our family of customers!"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "105107629971608750792", "name": "Larry Custer", "time": 1537299636175, "rating": 4.0, "text": "Very nice and helpful good inventory", "pics": null, "resp": {"time": 1537424446943, "text": "Thank you so much for the review."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "105835041411390488048", "name": "Paula Rounds", "time": 1516285713612, "rating": 5.0, "text": "The people there are so nice.", "pics": null, "resp": {"time": 1518890373340, "text": "Thank you so much for the review."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "107478486828439237207", "name": "Jasmine Williams", "time": 1562339233290, "rating": 5.0, "text": "I just live near the place.", "pics": null, "resp": {"time": 1569526586186, "text": "thank you for the review"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "118277015922944106681", "name": "Dale Wallace", "time": 1543053646647, "rating": 5.0, "text": "very good", "pics": null, "resp": {"time": 1544542345172, "text": "Thank you for the review."}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "108859209391472759305", "name": "RENT A CENTER OPP AL", "time": 1497668101731, "rating": 1.0, "text": "Sucks     bad people   save money", "pics": null, "resp": {"time": 1500483598410, "text": "Thank you for the review!  I am uncertain when we did business with the rent a center but am very sorry you had a bad experience!  There have been many growing pains these past years. We try daily to improve our service.  I hope we have somehow corrected what issues you had in the past. J Langford"}, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "102253835301910371288", "name": "Taurence Marshall", "time": 1615850606473, "rating": 4.0, "text": "(Translated by Google) Iou\n\n(Original)\nIou", "pics": null, "resp": null, "gmap_id": "0x88926eff8e960599:0x3e722c21e177dc4d"}
{"user_id": "102263974270602387875", "name": "Ramiro Fernandez", "time": 1625084277433, "rating": 5.0, "text": "Amazing service, picked up my junk car in one day. Everything went fine!! Very courteous and professional!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "115236427707837609107", "name": "Bianca S", "time": 1622812168729, "rating": 5.0, "text": "The whole process was great! At first they gave me an offer that I didn’t want to accept so I let them know what I was trying to get so Ms Lashay went back and tried again and she was successful ! Even the driver Mr Earl was really nice !", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "113843453728636792052", "name": "Claire Wallace", "time": 1611961090126, "rating": 5.0, "text": "I was impressed with how quick and easy it was to sell my old car to this company. I first put in a few lines of info online about my car and then had the option to phone them to complete the rest. They were friendly and in less than ten minutes I had an offer. The next morning, they came to get the car.", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "104655631910526164451", "name": "Jennifer Curry", "time": 1594309659805, "rating": 5.0, "text": "Our contact with Robert over the phone was wonderful..  Very professional and polite... Answered all of our questions... All arrangements were completed quickly... Vehicles were picked up as expected... Payment was on the spot as promised...", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "101889562649525513578", "name": "Megan Holder", "time": 1594736413751, "rating": 5.0, "text": "Calls were quick and easy. Service guy called and showed on time. Pick up was quick and easy. Would definitely give another call for future vehicle pick ups", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "107271871458644365418", "name": "Hel Adore", "time": 1598556036768, "rating": 5.0, "text": "Sold my junk car through them, easy process and kind, helpful employees.", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "110624483531490298241", "name": "Mark Winchester", "time": 1607462438766, "rating": 5.0, "text": "Very helpful and fast.", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "107085933543905548964", "name": "Andrew Anderson", "time": 1597331177368, "rating": 4.0, "text": "Would recommend using these guys.", "pics": null, "resp": null, "gmap_id": "0x888cf3e239399441:0x67c4ac0677e588b"}
{"user_id": "102661048281571940370", "name": "Lawrence Garcia", "time": 1398988733665, "rating": 5.0, "text": "I made a mistake.  Hometown Motors is not affiliated with Wolfe Motors, German Motor works or enterprise euro works   They are not included  in any Ft Rucker Off Limits restrictions.  The owner contacted me and stated they have established a long standing and reputable business with Ft Rucker  He claims to have an excellent reputation in the Enterprise and Dothan areas.  I am very sorry for including Hometown motors in my  reviews.  I wish them success in the future.", "pics": null, "resp": null, "gmap_id": "0x88926ef3dd4ff71b:0x5fecbdd95b4a5608"}
