{"user_id": "107801876224512911920", "name": "Jake Z", "time": 1497205864125, "rating": 5.0, "text": "Great and affordable awning. Fast installation. Looks great and holds up great in bad weather. Also had southern awning enclose my pole barn. Looks great.", "pics": null, "resp": null, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "107226543170799241400", "name": "Penny Ezell", "time": 1615289390458, "rating": 5.0, "text": "Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "109269460666717723026", "name": "Crystal Hendrix Zabala", "time": 1496938415397, "rating": 5.0, "text": "Had a patio cover installed by southern awning my grandmother loved it so much she got one too!!!", "pics": null, "resp": null, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "108968414664663312243", "name": "Ben Davis", "time": 1516661203222, "rating": 1.0, "text": "NOT GOOD", "pics": null, "resp": {"time": 1527616629287, "text": "Hi Ben can you please call us at 334-297-4647 we are wanting to get some clarification with your post/rating with us. We want all our customers to be satisfied."}, "gmap_id": "0x888ccf1f758be753:0x2e6f705c5f6c4883"}
{"user_id": "108351957672070451415", "name": "Remain Nameless", "time": 1625696759826, "rating": 5.0, "text": "Ward.... you were a little hard on the Beaver. The worst place in Oxford is on the south side of Hwy 78 East. The BEST place is A&B and they are located on the north side of 78 just east of Hutch Touch. I'm in retail sales in the trailer industry myself and A & B Trailers is my go to source for information, parts, and trailers. If  I have a question about ANYTHING in regards to dragging a wagon... A&B Trailers.. Knowledge level? I'll put it this way; theres not anything they can't  cover on your trailer.  I promise, they will never lead you wrong. These guys are not pencil pushers that have sit behind a desk all of their lives. They are blue collar, hard working, hands on, highly experienced fabricators and they know their stuff. If you want to spend half of your retirement on junk just to have it fall apart in a few months, then go across the street and shop with Ward. Now if you want an extremely well built, solid piece of equipment at a reasonable price  from an excellent company that stands behind their product AND appreciates their customers?... Welcome home family!! You are in the right place. A&B Trailers. You won't find better people anywhere and let me just add this in there.... these cats are Perfectionists. I know. I have worked side by side with them in a fab shop and I am a perfectionist also, but these jokers....well they take it to a whole nother other level. I will take an oath to say, \"They do things at A&B with a whole bunch of heart and a truck load of pride. It's done once, done right, and that's the product they will provide you every single time. I highly recommend A&B Trailers for all of your parts, accessories,  tires, wheels, batteries, or even if you are looking to upgrade with a brand new piece of pride attached to your vehicle.. Come on down to A&B. I'm sure glad I stopped here. Received a solid product and made two friends for life. Where else can you get service like that? A&B Trailers. Ask for Andy or Barney. NO need in referencing my review. They'll know who sent ya when you call them by their names 🤣", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "104375517629357760498", "name": "Helen White", "time": 1610829596860, "rating": 2.0, "text": "I orginally posted a 5 star for this company. But after the delivery of building I purchased, very disappointing experience.  The delivery driver charged an additional $100 for the height and still wasn't at the height for the charge. We had to redo all blocks because it wasn't level or supported correctly. Was basically told not responseable for third party, I didn't purchase it from third party purchased from this business.", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "106890390879591004809", "name": "Fred Luhn", "time": 1601319542310, "rating": 5.0, "text": "Always a great experience here. Guys there are always helpful and pleasant to work with.", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "107259342179334744693", "name": "Yansi Taboada", "time": 1627338239356, "rating": 5.0, "text": "Truly amazing", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "100765945374256710859", "name": "Ian Hutchins", "time": 1598540567529, "rating": 5.0, "text": "Always been a good experience and the staff has always been nice!", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "114101882504774297237", "name": "Jack Witteveen", "time": 1597183177282, "rating": 5.0, "text": "to those of you who have posted a negative comment, tell the whole story so that we all can understand!! thank you", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "117344392039055704868", "name": "Wesley Elkins", "time": 1563376276116, "rating": 1.0, "text": "Rude staff and we're no help I wouldn't stop here if I were you", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "113574574772820989533", "name": "MIKE Armstrong", "time": 1367849753885, "rating": 5.0, "text": "Gentleman & scholar, fun to play with & loved his music", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "115759016768107305889", "name": "Christine Maras", "time": 1591040897506, "rating": 5.0, "text": "We have used this company several times. We are extremely pleased with the product, price and professionalism. I highly recommend them", "pics": null, "resp": null, "gmap_id": "0x888bb3e0b1d3495b:0x9b7e690aa252ac99"}
{"user_id": "114148781766325997305", "name": "Mike Graham", "time": 1575131673159, "rating": 2.0, "text": "He did an excellent job on building a hand rail although the amount he charges is robbery without a gun. If you are looking for excellent work at exorbitant prices pick him for your job, but if you want reasonable prices please look elsewhere.", "pics": null, "resp": {"time": 1578783320951, "text": "It's because of all the welding and preperation that goes into a handrail job. Plus the state of art powder coated paint finish. I did not charge you anymore than I do anyone else. Gene Evans"}, "gmap_id": "0x888bb3e0b1d3495b:0x9b7e690aa252ac99"}
{"user_id": "106872187893908579093", "name": "Robert Garner", "time": 1556333126941, "rating": 5.0, "text": "Waiting on mine, can't wait. Got it and love there work, owner came by to see my installation.", "pics": null, "resp": null, "gmap_id": "0x888bb3e0b1d3495b:0x9b7e690aa252ac99"}
{"user_id": "111612651291209908336", "name": "theoverlanddisciple", "time": 1552585053284, "rating": 1.0, "text": "I called to try to get a custom application and they weren't even willing to hear me out for what I needed. They assumed what I wanted,  which wasn't even close or even in the same category. Before I could even correct Eugene about what I needed he talked over me and cut me off saying he wasn't interested in helping me. Not only was it extremely rude, it was some of the worst customer service. I guess I will just take my business elsewhere!", "pics": null, "resp": {"time": 1578783489514, "text": "Evidently I was having a bad day. I will make sure in the future I listen more carefully to a persons needs and do my best to help them....."}, "gmap_id": "0x888bb3e0b1d3495b:0x9b7e690aa252ac99"}
{"user_id": "116493178383093732614", "name": "Krissy Bailey", "time": 1521174645257, "rating": 5.0, "text": "Historical and a productive trade", "pics": null, "resp": null, "gmap_id": "0x888bb3e0b1d3495b:0x9b7e690aa252ac99"}
{"user_id": "114192172397942321547", "name": "Debbie Kinler", "time": 1550008664696, "rating": 5.0, "text": "We've had several projects completed here and have always been very satisfied. Some were as complicated as bimini/solar panel integrations and others just simple restitching. All were completed when promised and work was professional. As we have discovered over the years in different places, that's not always the case. At Canvas Works they listen to you, discuss the options and deliver the product as promised. Very happy to have them!", "pics": null, "resp": null, "gmap_id": "0x889a6aa6d64b67e1:0x2f074d3edc801f3"}
{"user_id": "108001686578325446657", "name": "Eric Reuss", "time": 1500413082486, "rating": 1.0, "text": "I had the Canvas Works make a cushion for my boat, having provided it an exact duplicate of the item I wanted. The cushion was made and delivered to me. Instead of using the normal inside cushion material, Canvas Works put in a slab of cheap foam rubber, which provided no cushioning at all. When I brought back the product to be corrected, the business owner told me she put in to the cushion the foam rubber I had given her, which was a patent lie; I provided no materials to her, only giving her the direction that I wanted a duplicate of the the existing cushion, which I provided her to duplicate. She refused to make the correction, told me to come pick up the cushion, then hung up on me. I went to pick up the cushion, from which the cheap foam rubber had been ripped out.", "pics": null, "resp": null, "gmap_id": "0x889a6aa6d64b67e1:0x2f074d3edc801f3"}
{"user_id": "100145917024509681515", "name": "Lex Rosenbaum", "time": 1524882159834, "rating": 5.0, "text": "King helped us a lot. Very good care of my boat canvas. Came out beautiful", "pics": null, "resp": null, "gmap_id": "0x889a6aa6d64b67e1:0x2f074d3edc801f3"}
{"user_id": "113689131896625485142", "name": "melisa yeend", "time": 1549654339155, "rating": 5.0, "text": "Very fine work and great people working there.", "pics": null, "resp": null, "gmap_id": "0x889a6aa6d64b67e1:0x2f074d3edc801f3"}
{"user_id": "102650428948421916818", "name": "Danny Niblett", "time": 1621979434692, "rating": 4.0, "text": "First visit and the ladie in the front office was super nice as well as the gentleman who works in the back . Looking forward to getting my awning back up.", "pics": null, "resp": null, "gmap_id": "0x88891bf20acc04c3:0x3dd0252025aef20"}
{"user_id": "110926548844045234508", "name": "Sexy Scorpio", "time": 1566242658460, "rating": 4.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88891bf20acc04c3:0x3dd0252025aef20"}
{"user_id": "114560737934669459247", "name": "Jeremy Fisher", "time": 1535647266520, "rating": 5.0, "text": "Helpful", "pics": null, "resp": null, "gmap_id": "0x88891bf20acc04c3:0x3dd0252025aef20"}
