{"user_id": "116228749342281381426", "name": "Janna Bennetts", "time": 1623504220546, "rating": 1.0, "text": "Not even upset about the how long it took to get our things in as this is something every business is struggling with, but the customer service at this place is absolutely horrible. Will not do business with this place again.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112042636972630247750", "name": "Emily Miles", "time": 1611850938780, "rating": 1.0, "text": "Not friendly at all, as I ask questions about a seat it was like I was nothing more than a bother.... I am all for supporting local businesses. However, the attitude did it for me on this one!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112457675680175038431", "name": "Ashley Cole", "time": 1603654357819, "rating": 5.0, "text": "Awesome selection ! Everything from breast feeding/pumping supplies to nursery must haves...not to mention the sweetest variety of clothing and accessories.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110126953266495482781", "name": "Hena Jenkins", "time": 1565961874324, "rating": 5.0, "text": "Wow! This place was phenomenal. Just about everything you can imagine for babies and children. The staff were all very sweet and made wonderful suggestions about products. They know their inventory very well and will give you honest feedback about what worked/didn’t work for them. I personally prefer to shop local because I’m a “feeler” and want to know exactly what I am purchasing beforehand.I definitely recommend coming in here if you are expecting/have little ones or are buying for someone else. It was such a fun experience and I’m looking forward to coming back in the future.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109722214914063733047", "name": "Lacye McCormick", "time": 1594331609132, "rating": 5.0, "text": "Employees were very helpful and nice. Store felt very clean. They had a huge selection of baby/toddler clothing as well as toys, hair bows, baby furniture and gear. Can’t wait to return!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114934709191858678493", "name": "J M", "time": 1580179457140, "rating": 5.0, "text": "I've been here a few times since finding out that I was going to have a grandbaby and the girls working there have always been extremely nice. They have the cutest and most unique baby things in there. I love shopping here and will be back soon! 👶❤️", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118210585404378433170", "name": "Cynthia Crocker", "time": 1555816402912, "rating": 5.0, "text": "My sister and I visited Posh Mommy and Baby Too today for the very first time. Both of us had a great shopping experience. I absolutely love the baby and children’s clothing and found the prices very reasonable considering it is a boutique. They also carry a large assortment of bows of every color imaginable as well as all sorts of accessories. What really impressed me most was the friendliness of the owner and staff. Every one was wonderful.  I visited the boutique with two of my young grandchildren (I don’t know what I was thinking😳) and the ladies were so helpful and even helped keep them busy while I shopped.  This boutique is my new go-to for future children’s purchases. Thank you ladies!", "pics": null, "resp": {"time": 1556469647442, "text": "Cynthia, we're so happy that you enjoyed our selection, prices, and customer service. Myself and my staff are always happy to help you find whatever you need or want while you're in our store. Keeping the little ones busy is just a perk for us! Thanks for stopping by, and we look forward to seeing you again in the future. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103660227336784568196", "name": "Danielle Clem", "time": 1573687481001, "rating": 1.0, "text": "If I could give them 0 stars I would. I would advise never purchasing furniture or anything from them. They are so rude and will not own up to their mistakes. If you do plan on it either never arriving or way after they say it will. You are much better off buying somewhere else.", "pics": null, "resp": {"time": 1573751938915, "text": "Ms Clem, we have done an extensive research under your name, we register every customer that makes a purchase in our store, and you show up as never making a purchase.  Maybe you are confused with another baby store in the area?  Posh Mommy & Baby Too prides ourselves in customer service.  Should a customer have an issue with a product, service or employee in our store I encourage them to share the problem with myself, the owner, to see if we can come up with an equitable solution."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105192725313263011885", "name": "Samantha Jones", "time": 1562891436038, "rating": 2.0, "text": "I went in here once. I am currently pregnant with my first and was hoping to find adorable boutique style clothing. I found just that, but I felt like I couldn’t look around without being watched. There were two sales associates there eyeballing me and giving me dirty looks the whole time. I didn’t feel like I could safely shop with that going on. Cute clothes but not worth the rude sales associates....", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108919029945652237185", "name": "Faye Ahzburjn", "time": 1516515504358, "rating": 4.0, "text": "They have beautiful baby and children's clothing, shoes, cloth diapers, jewelry including amber necklaces. Cribs and bedding. Hair bows galore! I love going in to shop for my granddaughter occasionally but it's expensive! That's the only reason I don't give it 5 stars. Cute and Posh!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111367116946202726396", "name": "Kelly W", "time": 1405517934421, "rating": 5.0, "text": "I love shopping at Posh Mommy & Baby Too!  I have been shopping there for seven years and have NEVER had a bad experience!!  The owners are the best!  They know us by name and are always super friendly.  I've gotten everything from the door hanger for my hospital room, hair bows, swimwear, clothing, shoes, toys and monogramming from this store. Love PM&BT!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101853123468688264343", "name": "Amber Winn", "time": 1562178900806, "rating": 3.0, "text": "Cute shop, but the lack of boy clothes is sad. There were multiple racks of girl clothes and maybe 2 racks of boy clothes. Check out All About Baby in Huntsville instead, many more boy clothing options.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116433279533117772119", "name": "Madison Turner", "time": 1567086837402, "rating": 5.0, "text": "Their customer service is great! They where so helpful and they even helped me out when they where about to close down for the day. For a first time mom that was running late and a little scrambled , they helped me alot and maid my day.", "pics": null, "resp": {"time": 1573755133446, "text": "Ms Yarbrough, thank you for the outstanding review.  It was a pleasure to work with you.  We love interacting with first time moms and all customers in our store.  We look forward to seeing you again!"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108989035875664237481", "name": "Ellen Helton", "time": 1535042666414, "rating": 5.0, "text": "Great local shop for all your baby needs. The staff is friendly and very knowledgeable. It is nice to be able to actually touch and see the products before you buy them!", "pics": null, "resp": {"time": 1545580599480, "text": "Our team loves being able to help, Ellen! Glad you enjoyed coming in to figure out the best items. If you need anything, we're always here for you. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108468779797641828631", "name": "Samantha Giruzzi", "time": 1560186036448, "rating": 5.0, "text": "I placed a large furniture order on Saturday.  Over the weekend, I began regretting the color we ordered. Worried all weekend I wouldn't be able to change it, I went in Monday morning and it was no issue at all to change the color for my order. The owner was more than happy to change my order and get us the new color we wanted. Customer service was excellent and I couldn't be happier. Thank you, Posh Mommy!", "pics": null, "resp": {"time": 1560357227758, "text": "We're always more than happy to make sure you get exactly what furniture you want, Samantha -- swapping colors was no problem whatsoever! If you ever need anything else, we're here for you.\n\nBest,\nLisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117940604744910410301", "name": "Sandi S", "time": 1507126265350, "rating": 5.0, "text": "I love, love this store. They always have what I'm looking for and much more. From baby furniture to shoes, this shop has it all. The employees are always helpful whether I'm shopping in the store or on the phone with them. I highly recommend this shop when shopping for all your baby needs.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112398127623827956018", "name": "Gail Schwartz", "time": 1363188736717, "rating": 5.0, "text": "This is a very professionally run store.  A new mother can find anything in this store she needs and if, for some reason, they don't have what you need they will do their utmost to find it.   No one hovered over me (as if I were a shoplifter) but someone was available to help when I was ready.  I will refer my friends to this store and continue to visit it.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "102637869977983977907", "name": "Christy Payne", "time": 1401301648884, "rating": 5.0, "text": "I absolutely love this store.  They have so many unique items and keep their fb page updated of new products and sales going on.  They have reasonably priced monogramming and even helped connect me with someone to help me with a very specific need I had.  Wonderful, wonderful store!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108291940059726398981", "name": "kelsiroberts", "time": 1407276037457, "rating": 5.0, "text": "I have no clue why there are so many rude comments. They were so helpful when we went to purchase our furniture. They placed our furniture order and it came in in 19 days! Their prices are comparable to other stores plus they really work with you to help you afford everything you need! My husband and I will definitely continue to shop here!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114397876041946544831", "name": "Larry Vannoy", "time": 1517623637060, "rating": 5.0, "text": "Ms Riley, I am sorry you feel your brother and sister-in-law were treated unfairly.  We showed you the contract your sister-in-law signed stating that it could take up to 16 weeks to take delivery of the special ordered furniture.  One week into the order they started contacting us asking us about the status of the furniture delivery and   on every occasion we reminded them that special ordered furniture can take up to sixteen weeks but we hoped it would arrive much sooner.  We kept them abreast of status and put a caveat during each daily call to us that we were forwarding them what we had been told from the manufacturer and shipping company.  WE GOT IT TO YOU IN A MONTH, and during the Christmas shipping backlogs and snow storm at the manufacturer!     We are sorry that you thought your brother and sister-in-law were mistreated.  We believe we went far beyond what is considered great customer service in making such a quick delivery.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1523590267386, "rating": 5.0, "text": "If you need anything for baby ,this is your place ! Very friendly , helpful and kind staff  !  You can get anything  pertaining  to baby or mommy  here ! Cribs,rockers,  clothes car seats to bows and necklace.  Love this place !!", "pics": null, "resp": {"time": 1545668611183, "text": "I hope it's not too late to thank you for this, Jacqueline -- we love helping out however we can. If you need anything else, feel free to stop by or give us a call. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103052536987395393773", "name": "Tammie Stroud", "time": 1551665742008, "rating": 4.0, "text": "Great help. Unusual items. Beautiful gift bag.", "pics": null, "resp": {"time": 1551991855460, "text": "Happy you stopped in, Tammie! Hoping you'll make it back our way again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104743412480987251819", "name": "Tabitha Riley", "time": 1511295218321, "rating": 1.0, "text": "My brother made full payment on a crib and dresser set on Oct. 21st when my sister-in-law was 9 months pregnant. Posh Mommy however assured them that the furniture could be delivered in a few weeks. My nephew was born Nov. 16th and as of today Nov. 21st, no furniture has arrived.  Over the past few weeks my brother has made several attempts to get a delivery date for the purchased furniture to no avail.  The owners have chosen to be rude, verbally aggressive, and dishonest with all communication after payment was received. The owners have shown my family such poor customer service that I would NEVER refer anyone to shop at Posh Mommy. For first time parents, selecting and buying furniture should be joyous but Posh Mommy turned it into a nightmare.", "pics": null, "resp": {"time": 1573754009932, "text": "Ms Riley, as I shared with your brother, Mr Jackson: as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store. This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc. We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110756343777648088636", "name": "Jenni Lawson", "time": 1439906430573, "rating": 5.0, "text": "I came on here to look for pictures to show my friends and saw the rude comments and couldn't believe it. Every time I come into this store they greet me immediately and check on my throughout my visit. I had a horrible itching problem and they even loaded me up on free samples of different products to try to see which ones were more effective! I bring my first born with me as well and they give her balloons and play around with her to help me get through the store! I've never had a problem here and just felt compelled to leave a comment after reading the other ones.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109484406035634067027", "name": "Lisa Sinyard", "time": 1525043550928, "rating": 5.0, "text": "This is the best baby store! The merchandise is quality and prices are good. The registry is easy for Mommy and gifter!", "pics": null, "resp": {"time": 1545580927853, "text": "We're grateful for your support, Lisa! Glad we could help you find great merchandise at a good price. Let us know if you need anything at all. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101930654400465598245", "name": "Kyle Hoffman", "time": 1513621116931, "rating": 5.0, "text": "I cant thank them enough for all there help and guidance through our cloth diapering and preemie clothing. Our little girl was 34 weeks and Lisa made sure clothes we got would fit. Which can be confusing considering all the sizes p1,p2,p3 ,preemie, newborn and etc. Which to a Dad can be hard to keep straight and overwhelming sometimes. Excellent service all the around. Thanks you so much.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111173504733751708948", "name": "Jessica Sheridan", "time": 1480974211542, "rating": 5.0, "text": "Posh Mommy always has what I'm looking for! They have a wonderful selection of children's clothes, toys, gifts, and baby furniture. They also do personalized and custom monograming. I love this store!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108506364438666074310", "name": "Jennifer Day", "time": 1374759646964, "rating": 1.0, "text": "Terrible customer service!  I've truly never experienced customer service this bad.  Back in March, I ordered a crib converter to convert my child's crib to a toddler bed. I was told it would take a little over a month for it to come in and they would call me as soon as it did.  The money came out of my account the day I placed the order. About 2 and half months later I still had not heard from them, so I called asking about my order.  They had absolutely no record of my order, however, I told them I had proof because I can show my bank statement where the money came out of my account.  They basically said they would call the company and work on getting it to me ASAP and they were supposed to call me back.  I never heard back from them.  This was just the beginning of many false promises and unreturned phone calls.  After I decided I couldn't deal with them anymore I went on the web and found the exact crib converter kit that I needed for less than half the price they sold it to me for.  At this point, I called and said I wanted my money back.  They agreed to return my money, but said they would have to mail it to me.  It has now been almost 5 months since I placed this order and I have yet to receive a crib converter or my money back.  And they are continuing to blow me off and not return my phone calls.  At this point, I'm at a loss for what to do. I know for sure, I will NEVER shop there again though.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110367184114206920961", "name": "J Brosemer", "time": 1394238991478, "rating": 1.0, "text": "HORRIBLE EXPERIENCE. EXTREMELY RUDE AND UNPROFESSIONAL. WILL NEVER RETURN!!! My wife bought an umbrella stroller from there about a week ago. We had some unexpected expenses arise and I went there with the receipt to return it. We had it just over a week and had never even taken it out of the car. It still had all the plastic on it and had never even been unfolded. When I walked in, they were not busy at all. There may have been three or four people in the entire store. I walked up to the counter and waited and waited and waited some more until finally going and asking someone to help me. I told him what I was there for and he immediately said they do not give refunds. He said he couldn't take back a used product and he could not be out that money. He was extremely rude and basically called me a liar. He said the stroller was obviously used because one of the wheels had a scuff on it. My wife had gotten him to roll it out to the car before she purchased it to make sure that it would fit in our vehicle. When I told him that's where the scuff came from he said oh no I took it straight out of the box so that's not possible. The stroller was a display model so there was no box at all. When I told him that I knew he was lying to me, he said well our return policy is posted on the counter there so if your wife is literate she could've read it. I wont go on about everything else that was said but I just want to let people know how they do business. He was EXTREMELY rude and unprofessional and I can see by all the other comments that I am not the only one who has experienced this. I will never shop there again and would advise anyone else not to either. I will be filing a report with the BBB and letting everyone I know how they treat people. A Nurturing Moment is a much better alternative. The woman there is very nice and polite and knowledgeable about the products she sells. To sum it up it was terrible experience.", "pics": null, "resp": {"time": 1573754533461, "text": "Mr Brosemer, as we talked at the time, the stroller your wife purchased at time had been used by her outside the store, we personally witnessed her using it.  Further we told her that it was sold to her at a discount and we were very specific with her that it was not returnable.  In addition, the stroller smelled like cigarette smoke and we would not be able to re-sell it.  I am sorry your expectations were not the same as was your wife's."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104261798673700825950", "name": "Jennifer Davis", "time": 1386700588334, "rating": 1.0, "text": "HORRIBLE HORRBILE HORRIBLE customer service!!!\nBought several items from them.\n1-Bought a glider.  They didn't even order it and it was months later before we finally got it.\n2-bought furniture from them (Young America).  It broke within a few weeks of having it and they would offer NO help in getting replacement parts!!!\n\nPLEASE do not go here!  Shop at A Nurturing Moment or All About Baby!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112173692071904544301", "name": "Regina Smith", "time": 1345345964560, "rating": 2.0, "text": "Horrible customer service. It is funny they are great until you have a problem with their merchandise. Then, they become very confrontational and all of a sudden it is not their problem. Their business in my opinion is very unethical. I WILL NEVER SHOP THERE AGAIN! I will go to Nurturing Moment or All About Baby from now on. I have all ways been treated with respect and dignity a these two places!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104561881740931943968", "name": "Tasha Wiley", "time": 1365172197411, "rating": 5.0, "text": "I've been shopping here for many, many years and completely furnished my daughter's entire nursery from PM&B2.  While my friends were complaining that their baby furniture deliveries (ordered from other local shops) were running weeks behind schedule, mine was in the nursery and ready to go! I have never had anything but an amazing experience dealing with the owner and her staff.  The store is clean, well-organized, and there is always plenty to choose from.  It's specialty, one-of-a-kind stuff and always my first stop for hair bows/headbands and \"Special Occasion\" clothing & items.  Also, the Santa Pictures they do every year with Gallery Seven Photography is by far and away the BEST setup in Huntsville.  I know ladies who drive from Nashville to have their Christmas cards done at the store every year because the set and Santa are both so gorgeous!  Love this store and will continue to shop there!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "113174923182533913249", "name": "E. Biggers", "time": 1506357500996, "rating": 5.0, "text": "Professional staff who are always helpful and knowledgeable. I highly recommend Posh Mommy and Baby, Too to all my family and friends.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103466565595422570282", "name": "Justin Draughon", "time": 1539133322536, "rating": 5.0, "text": "Great place to shop for babies and small children. They have clothes, furniture, and do monograms. The staff and owners are very helpful and accommodating.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111196312545284057049", "name": "Jeffrey Jackson", "time": 1511296694249, "rating": 1.0, "text": "*ATTENTION* Bad Customer Sevice ALERT!!!\nOn October 21, my wife(9 months pregnant) purchased a crib and double dresser from POSH MOMMY, located on Hwy 72 in Madison AL. The owner told my wife the set does not take long to come in, usually a couple of weeks and she will expedite the shipment. Since we purchased the set the customer service has been HORRENDOUS.!! When my wife purchased the set, they advised her a estimated delivery date would be provided on the following week since it was a weekend transaction and the Vendor was closed. Since that date the owner have failed to contact us on the delivery date. We made several attempts to establish a concrete date in which we were told by the owners, ‘that is not the way they do business’. On last Monday,  November 13, the owner reached out to me and said the crib and dresser would arrive on Thursday (Jax Birthday). After my wife was settled in her hospital room after having Jax, I called Posh Mommy to verify what time the truck was coming in order to pick up. The owner, Lisa told me ‘the truck had not arrived and she will call back later that day.’ I did not receive a phone call, in which I called the following day to pick up the set. Lisa’s husband (co owner) claims he did not tell me it will arrive on Thursday but he claimed he hoped it would arrive on Thursday. On Friday, November 17th, he stated the shipment will be in on today. As of today, November 21st, we have not received our furniture. The owner now claims it will be in on tomorrow. Please help me share this experience, I have filed a complaint with the BBB and other parents need to know how POSH MOMMY does business. My wife was 9 months pregnant when she purchased the set believing the owner at her word. I guess that means nothing these days.#cribforJAX", "pics": null, "resp": {"time": 1573752892023, "text": "Mr Jackson, as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store.  This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc.  We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105854019466465040282", "name": "Margaret Sterling", "time": 1468421783292, "rating": 5.0, "text": "They have got a nice bow selection and paci selection. Also like that it is a local establishment so the people working there usually follow up on your orders and products", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104323816005693797302", "name": "Brittany S.", "time": 1385002017731, "rating": 5.0, "text": "After reading all these reviews, I had to leave my experience on here. My husband and I were having a hard time finding a nursery that we could both agree on for our second child. I suggested Posh Mommy and we went in there last thinking we probably couldn't afford it. When I walked in the owner immediately greeted us and asked what we were looking for. When I told her baby furniture, she wanted to show me her collection that was on sale. It was the Dolce Babi Grazi Crib and the pieces with it. It came in vanilla bean which is a vintage white and I loved it! It was a great deal and very well made. She pretty much had it over 1,000 dollars cheaper than the original prices. She let us look with no pressure. She told us she had already ordered it so if we were interested to let her know because she would hold it for us. We decided a few days later that that is what we wanted and when we called and told her, she also gave us 20% off the conversion kit because it was being ordered all at once. So we waited about a week and a half and our crib was there! (bc it was already ordered it didn't take as long as most orders) My husband and a friend went to pick it up and she was having a Veterans Day sale that weekend and our crib price dropped $100. So she felt sorry for us that we missed the sale and GAVE US A FREE CRIB MATTRESS AND TODDLER RAIL!!! I was blown away by her generosity. I had no idea that the crib price dropped so when she offered us all of that it really meant so much! The items she gave us retail way more than that $100 dollars. I am very impressed and plan on giving them more business in the future. THANKS POSH MOMMY ;)", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101585047496389728160", "name": "Keith Morgan", "time": 1471797781113, "rating": 5.0, "text": "It is the place to go for all things baby. The people there know a lot about what you need", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117824481915402156711", "name": "Tammy G", "time": 1393462580993, "rating": 1.0, "text": "Not made to feel welcomed unless purchasing something big. Not a warm atmosphere.", "pics": null, "resp": {"time": 1573754183551, "text": "Tammy, I am sorry to see that your experience at Posh Mommy & Baby Too was not positive. Should you have a negative experience, please take a moment to find me in the store and share your issue. We will do our best to try to satisfy your needs."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109990035374091410357", "name": "Yvette Torbert", "time": 1485882351833, "rating": 4.0, "text": "Always have exactly what I need. A little pricey, BUT ALWAYS quality.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103794172672266371146", "name": "Jocelyn Merkel", "time": 1382635866989, "rating": 1.0, "text": "The employees at Posh Mommy are so incredibly RUDE! I will never again set foot in this place. The owner treated me like I was an inconvenience and a waste of her time. I was speechless-- I've never been treated so poorly by a local business. I don't know how they stay open.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111422747019442857025", "name": "Hallie Wallis", "time": 1467307576363, "rating": 5.0, "text": "Great little baby boutique! So much to choose from!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112973842742459761832", "name": "Yolanda Black", "time": 1522361104390, "rating": 5.0, "text": "Always find quality items at this boutique for children, as well as, items for Mommy too!", "pics": null, "resp": {"time": 1545668644572, "text": "Thrilled to know you enjoy our high quality selection, Yolanda! Hoping to see you again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101762511581299527612", "name": "Nettie Savell", "time": 1486405704488, "rating": 5.0, "text": "Employees were helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118193895143727454146", "name": "Barbara Randa", "time": 1563853547694, "rating": 5.0, "text": "Wonderful storr", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114674921060380465590", "name": "Tammy Cashon", "time": 1550350557473, "rating": 5.0, "text": "Love this shop!", "pics": null, "resp": {"time": 1550759500518, "text": "Tammy, thank you for your great review! Come back to see us soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116228749342281381426", "name": "Janna Bennetts", "time": 1623504220546, "rating": 1.0, "text": "Not even upset about the how long it took to get our things in as this is something every business is struggling with, but the customer service at this place is absolutely horrible. Will not do business with this place again.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112042636972630247750", "name": "Emily Miles", "time": 1611850938780, "rating": 1.0, "text": "Not friendly at all, as I ask questions about a seat it was like I was nothing more than a bother.... I am all for supporting local businesses. However, the attitude did it for me on this one!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112457675680175038431", "name": "Ashley Cole", "time": 1603654357819, "rating": 5.0, "text": "Awesome selection ! Everything from breast feeding/pumping supplies to nursery must haves...not to mention the sweetest variety of clothing and accessories.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110126953266495482781", "name": "Hena Jenkins", "time": 1565961874324, "rating": 5.0, "text": "Wow! This place was phenomenal. Just about everything you can imagine for babies and children. The staff were all very sweet and made wonderful suggestions about products. They know their inventory very well and will give you honest feedback about what worked/didn’t work for them. I personally prefer to shop local because I’m a “feeler” and want to know exactly what I am purchasing beforehand.I definitely recommend coming in here if you are expecting/have little ones or are buying for someone else. It was such a fun experience and I’m looking forward to coming back in the future.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109722214914063733047", "name": "Lacye McCormick", "time": 1594331609132, "rating": 5.0, "text": "Employees were very helpful and nice. Store felt very clean. They had a huge selection of baby/toddler clothing as well as toys, hair bows, baby furniture and gear. Can’t wait to return!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114934709191858678493", "name": "J M", "time": 1580179457140, "rating": 5.0, "text": "I've been here a few times since finding out that I was going to have a grandbaby and the girls working there have always been extremely nice. They have the cutest and most unique baby things in there. I love shopping here and will be back soon! 👶❤️", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118210585404378433170", "name": "Cynthia Crocker", "time": 1555816402912, "rating": 5.0, "text": "My sister and I visited Posh Mommy and Baby Too today for the very first time. Both of us had a great shopping experience. I absolutely love the baby and children’s clothing and found the prices very reasonable considering it is a boutique. They also carry a large assortment of bows of every color imaginable as well as all sorts of accessories. What really impressed me most was the friendliness of the owner and staff. Every one was wonderful.  I visited the boutique with two of my young grandchildren (I don’t know what I was thinking😳) and the ladies were so helpful and even helped keep them busy while I shopped.  This boutique is my new go-to for future children’s purchases. Thank you ladies!", "pics": null, "resp": {"time": 1556469647442, "text": "Cynthia, we're so happy that you enjoyed our selection, prices, and customer service. Myself and my staff are always happy to help you find whatever you need or want while you're in our store. Keeping the little ones busy is just a perk for us! Thanks for stopping by, and we look forward to seeing you again in the future. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103660227336784568196", "name": "Danielle Clem", "time": 1573687481001, "rating": 1.0, "text": "If I could give them 0 stars I would. I would advise never purchasing furniture or anything from them. They are so rude and will not own up to their mistakes. If you do plan on it either never arriving or way after they say it will. You are much better off buying somewhere else.", "pics": null, "resp": {"time": 1573751938915, "text": "Ms Clem, we have done an extensive research under your name, we register every customer that makes a purchase in our store, and you show up as never making a purchase.  Maybe you are confused with another baby store in the area?  Posh Mommy & Baby Too prides ourselves in customer service.  Should a customer have an issue with a product, service or employee in our store I encourage them to share the problem with myself, the owner, to see if we can come up with an equitable solution."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105192725313263011885", "name": "Samantha Jones", "time": 1562891436038, "rating": 2.0, "text": "I went in here once. I am currently pregnant with my first and was hoping to find adorable boutique style clothing. I found just that, but I felt like I couldn’t look around without being watched. There were two sales associates there eyeballing me and giving me dirty looks the whole time. I didn’t feel like I could safely shop with that going on. Cute clothes but not worth the rude sales associates....", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108919029945652237185", "name": "Faye Ahzburjn", "time": 1516515504358, "rating": 4.0, "text": "They have beautiful baby and children's clothing, shoes, cloth diapers, jewelry including amber necklaces. Cribs and bedding. Hair bows galore! I love going in to shop for my granddaughter occasionally but it's expensive! That's the only reason I don't give it 5 stars. Cute and Posh!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111367116946202726396", "name": "Kelly W", "time": 1405517934421, "rating": 5.0, "text": "I love shopping at Posh Mommy & Baby Too!  I have been shopping there for seven years and have NEVER had a bad experience!!  The owners are the best!  They know us by name and are always super friendly.  I've gotten everything from the door hanger for my hospital room, hair bows, swimwear, clothing, shoes, toys and monogramming from this store. Love PM&BT!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101853123468688264343", "name": "Amber Winn", "time": 1562178900806, "rating": 3.0, "text": "Cute shop, but the lack of boy clothes is sad. There were multiple racks of girl clothes and maybe 2 racks of boy clothes. Check out All About Baby in Huntsville instead, many more boy clothing options.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116433279533117772119", "name": "Madison Turner", "time": 1567086837402, "rating": 5.0, "text": "Their customer service is great! They where so helpful and they even helped me out when they where about to close down for the day. For a first time mom that was running late and a little scrambled , they helped me alot and maid my day.", "pics": null, "resp": {"time": 1573755133446, "text": "Ms Yarbrough, thank you for the outstanding review.  It was a pleasure to work with you.  We love interacting with first time moms and all customers in our store.  We look forward to seeing you again!"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108989035875664237481", "name": "Ellen Helton", "time": 1535042666414, "rating": 5.0, "text": "Great local shop for all your baby needs. The staff is friendly and very knowledgeable. It is nice to be able to actually touch and see the products before you buy them!", "pics": null, "resp": {"time": 1545580599480, "text": "Our team loves being able to help, Ellen! Glad you enjoyed coming in to figure out the best items. If you need anything, we're always here for you. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108468779797641828631", "name": "Samantha Giruzzi", "time": 1560186036448, "rating": 5.0, "text": "I placed a large furniture order on Saturday.  Over the weekend, I began regretting the color we ordered. Worried all weekend I wouldn't be able to change it, I went in Monday morning and it was no issue at all to change the color for my order. The owner was more than happy to change my order and get us the new color we wanted. Customer service was excellent and I couldn't be happier. Thank you, Posh Mommy!", "pics": null, "resp": {"time": 1560357227758, "text": "We're always more than happy to make sure you get exactly what furniture you want, Samantha -- swapping colors was no problem whatsoever! If you ever need anything else, we're here for you.\n\nBest,\nLisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117940604744910410301", "name": "Sandi S", "time": 1507126265350, "rating": 5.0, "text": "I love, love this store. They always have what I'm looking for and much more. From baby furniture to shoes, this shop has it all. The employees are always helpful whether I'm shopping in the store or on the phone with them. I highly recommend this shop when shopping for all your baby needs.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112398127623827956018", "name": "Gail Schwartz", "time": 1363188736717, "rating": 5.0, "text": "This is a very professionally run store.  A new mother can find anything in this store she needs and if, for some reason, they don't have what you need they will do their utmost to find it.   No one hovered over me (as if I were a shoplifter) but someone was available to help when I was ready.  I will refer my friends to this store and continue to visit it.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "102637869977983977907", "name": "Christy Payne", "time": 1401301648884, "rating": 5.0, "text": "I absolutely love this store.  They have so many unique items and keep their fb page updated of new products and sales going on.  They have reasonably priced monogramming and even helped connect me with someone to help me with a very specific need I had.  Wonderful, wonderful store!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108291940059726398981", "name": "kelsiroberts", "time": 1407276037457, "rating": 5.0, "text": "I have no clue why there are so many rude comments. They were so helpful when we went to purchase our furniture. They placed our furniture order and it came in in 19 days! Their prices are comparable to other stores plus they really work with you to help you afford everything you need! My husband and I will definitely continue to shop here!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114397876041946544831", "name": "Larry Vannoy", "time": 1517623637060, "rating": 5.0, "text": "Ms Riley, I am sorry you feel your brother and sister-in-law were treated unfairly.  We showed you the contract your sister-in-law signed stating that it could take up to 16 weeks to take delivery of the special ordered furniture.  One week into the order they started contacting us asking us about the status of the furniture delivery and   on every occasion we reminded them that special ordered furniture can take up to sixteen weeks but we hoped it would arrive much sooner.  We kept them abreast of status and put a caveat during each daily call to us that we were forwarding them what we had been told from the manufacturer and shipping company.  WE GOT IT TO YOU IN A MONTH, and during the Christmas shipping backlogs and snow storm at the manufacturer!     We are sorry that you thought your brother and sister-in-law were mistreated.  We believe we went far beyond what is considered great customer service in making such a quick delivery.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1523590267386, "rating": 5.0, "text": "If you need anything for baby ,this is your place ! Very friendly , helpful and kind staff  !  You can get anything  pertaining  to baby or mommy  here ! Cribs,rockers,  clothes car seats to bows and necklace.  Love this place !!", "pics": null, "resp": {"time": 1545668611183, "text": "I hope it's not too late to thank you for this, Jacqueline -- we love helping out however we can. If you need anything else, feel free to stop by or give us a call. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103052536987395393773", "name": "Tammie Stroud", "time": 1551665742008, "rating": 4.0, "text": "Great help. Unusual items. Beautiful gift bag.", "pics": null, "resp": {"time": 1551991855460, "text": "Happy you stopped in, Tammie! Hoping you'll make it back our way again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104743412480987251819", "name": "Tabitha Riley", "time": 1511295218321, "rating": 1.0, "text": "My brother made full payment on a crib and dresser set on Oct. 21st when my sister-in-law was 9 months pregnant. Posh Mommy however assured them that the furniture could be delivered in a few weeks. My nephew was born Nov. 16th and as of today Nov. 21st, no furniture has arrived.  Over the past few weeks my brother has made several attempts to get a delivery date for the purchased furniture to no avail.  The owners have chosen to be rude, verbally aggressive, and dishonest with all communication after payment was received. The owners have shown my family such poor customer service that I would NEVER refer anyone to shop at Posh Mommy. For first time parents, selecting and buying furniture should be joyous but Posh Mommy turned it into a nightmare.", "pics": null, "resp": {"time": 1573754009932, "text": "Ms Riley, as I shared with your brother, Mr Jackson: as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store. This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc. We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110756343777648088636", "name": "Jenni Lawson", "time": 1439906430573, "rating": 5.0, "text": "I came on here to look for pictures to show my friends and saw the rude comments and couldn't believe it. Every time I come into this store they greet me immediately and check on my throughout my visit. I had a horrible itching problem and they even loaded me up on free samples of different products to try to see which ones were more effective! I bring my first born with me as well and they give her balloons and play around with her to help me get through the store! I've never had a problem here and just felt compelled to leave a comment after reading the other ones.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109484406035634067027", "name": "Lisa Sinyard", "time": 1525043550928, "rating": 5.0, "text": "This is the best baby store! The merchandise is quality and prices are good. The registry is easy for Mommy and gifter!", "pics": null, "resp": {"time": 1545580927853, "text": "We're grateful for your support, Lisa! Glad we could help you find great merchandise at a good price. Let us know if you need anything at all. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101930654400465598245", "name": "Kyle Hoffman", "time": 1513621116931, "rating": 5.0, "text": "I cant thank them enough for all there help and guidance through our cloth diapering and preemie clothing. Our little girl was 34 weeks and Lisa made sure clothes we got would fit. Which can be confusing considering all the sizes p1,p2,p3 ,preemie, newborn and etc. Which to a Dad can be hard to keep straight and overwhelming sometimes. Excellent service all the around. Thanks you so much.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111173504733751708948", "name": "Jessica Sheridan", "time": 1480974211542, "rating": 5.0, "text": "Posh Mommy always has what I'm looking for! They have a wonderful selection of children's clothes, toys, gifts, and baby furniture. They also do personalized and custom monograming. I love this store!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108506364438666074310", "name": "Jennifer Day", "time": 1374759646964, "rating": 1.0, "text": "Terrible customer service!  I've truly never experienced customer service this bad.  Back in March, I ordered a crib converter to convert my child's crib to a toddler bed. I was told it would take a little over a month for it to come in and they would call me as soon as it did.  The money came out of my account the day I placed the order. About 2 and half months later I still had not heard from them, so I called asking about my order.  They had absolutely no record of my order, however, I told them I had proof because I can show my bank statement where the money came out of my account.  They basically said they would call the company and work on getting it to me ASAP and they were supposed to call me back.  I never heard back from them.  This was just the beginning of many false promises and unreturned phone calls.  After I decided I couldn't deal with them anymore I went on the web and found the exact crib converter kit that I needed for less than half the price they sold it to me for.  At this point, I called and said I wanted my money back.  They agreed to return my money, but said they would have to mail it to me.  It has now been almost 5 months since I placed this order and I have yet to receive a crib converter or my money back.  And they are continuing to blow me off and not return my phone calls.  At this point, I'm at a loss for what to do. I know for sure, I will NEVER shop there again though.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110367184114206920961", "name": "J Brosemer", "time": 1394238991478, "rating": 1.0, "text": "HORRIBLE EXPERIENCE. EXTREMELY RUDE AND UNPROFESSIONAL. WILL NEVER RETURN!!! My wife bought an umbrella stroller from there about a week ago. We had some unexpected expenses arise and I went there with the receipt to return it. We had it just over a week and had never even taken it out of the car. It still had all the plastic on it and had never even been unfolded. When I walked in, they were not busy at all. There may have been three or four people in the entire store. I walked up to the counter and waited and waited and waited some more until finally going and asking someone to help me. I told him what I was there for and he immediately said they do not give refunds. He said he couldn't take back a used product and he could not be out that money. He was extremely rude and basically called me a liar. He said the stroller was obviously used because one of the wheels had a scuff on it. My wife had gotten him to roll it out to the car before she purchased it to make sure that it would fit in our vehicle. When I told him that's where the scuff came from he said oh no I took it straight out of the box so that's not possible. The stroller was a display model so there was no box at all. When I told him that I knew he was lying to me, he said well our return policy is posted on the counter there so if your wife is literate she could've read it. I wont go on about everything else that was said but I just want to let people know how they do business. He was EXTREMELY rude and unprofessional and I can see by all the other comments that I am not the only one who has experienced this. I will never shop there again and would advise anyone else not to either. I will be filing a report with the BBB and letting everyone I know how they treat people. A Nurturing Moment is a much better alternative. The woman there is very nice and polite and knowledgeable about the products she sells. To sum it up it was terrible experience.", "pics": null, "resp": {"time": 1573754533461, "text": "Mr Brosemer, as we talked at the time, the stroller your wife purchased at time had been used by her outside the store, we personally witnessed her using it.  Further we told her that it was sold to her at a discount and we were very specific with her that it was not returnable.  In addition, the stroller smelled like cigarette smoke and we would not be able to re-sell it.  I am sorry your expectations were not the same as was your wife's."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104261798673700825950", "name": "Jennifer Davis", "time": 1386700588334, "rating": 1.0, "text": "HORRIBLE HORRBILE HORRIBLE customer service!!!\nBought several items from them.\n1-Bought a glider.  They didn't even order it and it was months later before we finally got it.\n2-bought furniture from them (Young America).  It broke within a few weeks of having it and they would offer NO help in getting replacement parts!!!\n\nPLEASE do not go here!  Shop at A Nurturing Moment or All About Baby!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112173692071904544301", "name": "Regina Smith", "time": 1345345964560, "rating": 2.0, "text": "Horrible customer service. It is funny they are great until you have a problem with their merchandise. Then, they become very confrontational and all of a sudden it is not their problem. Their business in my opinion is very unethical. I WILL NEVER SHOP THERE AGAIN! I will go to Nurturing Moment or All About Baby from now on. I have all ways been treated with respect and dignity a these two places!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104561881740931943968", "name": "Tasha Wiley", "time": 1365172197411, "rating": 5.0, "text": "I've been shopping here for many, many years and completely furnished my daughter's entire nursery from PM&B2.  While my friends were complaining that their baby furniture deliveries (ordered from other local shops) were running weeks behind schedule, mine was in the nursery and ready to go! I have never had anything but an amazing experience dealing with the owner and her staff.  The store is clean, well-organized, and there is always plenty to choose from.  It's specialty, one-of-a-kind stuff and always my first stop for hair bows/headbands and \"Special Occasion\" clothing & items.  Also, the Santa Pictures they do every year with Gallery Seven Photography is by far and away the BEST setup in Huntsville.  I know ladies who drive from Nashville to have their Christmas cards done at the store every year because the set and Santa are both so gorgeous!  Love this store and will continue to shop there!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "113174923182533913249", "name": "E. Biggers", "time": 1506357500996, "rating": 5.0, "text": "Professional staff who are always helpful and knowledgeable. I highly recommend Posh Mommy and Baby, Too to all my family and friends.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103466565595422570282", "name": "Justin Draughon", "time": 1539133322536, "rating": 5.0, "text": "Great place to shop for babies and small children. They have clothes, furniture, and do monograms. The staff and owners are very helpful and accommodating.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111196312545284057049", "name": "Jeffrey Jackson", "time": 1511296694249, "rating": 1.0, "text": "*ATTENTION* Bad Customer Sevice ALERT!!!\nOn October 21, my wife(9 months pregnant) purchased a crib and double dresser from POSH MOMMY, located on Hwy 72 in Madison AL. The owner told my wife the set does not take long to come in, usually a couple of weeks and she will expedite the shipment. Since we purchased the set the customer service has been HORRENDOUS.!! When my wife purchased the set, they advised her a estimated delivery date would be provided on the following week since it was a weekend transaction and the Vendor was closed. Since that date the owner have failed to contact us on the delivery date. We made several attempts to establish a concrete date in which we were told by the owners, ‘that is not the way they do business’. On last Monday,  November 13, the owner reached out to me and said the crib and dresser would arrive on Thursday (Jax Birthday). After my wife was settled in her hospital room after having Jax, I called Posh Mommy to verify what time the truck was coming in order to pick up. The owner, Lisa told me ‘the truck had not arrived and she will call back later that day.’ I did not receive a phone call, in which I called the following day to pick up the set. Lisa’s husband (co owner) claims he did not tell me it will arrive on Thursday but he claimed he hoped it would arrive on Thursday. On Friday, November 17th, he stated the shipment will be in on today. As of today, November 21st, we have not received our furniture. The owner now claims it will be in on tomorrow. Please help me share this experience, I have filed a complaint with the BBB and other parents need to know how POSH MOMMY does business. My wife was 9 months pregnant when she purchased the set believing the owner at her word. I guess that means nothing these days.#cribforJAX", "pics": null, "resp": {"time": 1573752892023, "text": "Mr Jackson, as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store.  This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc.  We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105854019466465040282", "name": "Margaret Sterling", "time": 1468421783292, "rating": 5.0, "text": "They have got a nice bow selection and paci selection. Also like that it is a local establishment so the people working there usually follow up on your orders and products", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104323816005693797302", "name": "Brittany S.", "time": 1385002017731, "rating": 5.0, "text": "After reading all these reviews, I had to leave my experience on here. My husband and I were having a hard time finding a nursery that we could both agree on for our second child. I suggested Posh Mommy and we went in there last thinking we probably couldn't afford it. When I walked in the owner immediately greeted us and asked what we were looking for. When I told her baby furniture, she wanted to show me her collection that was on sale. It was the Dolce Babi Grazi Crib and the pieces with it. It came in vanilla bean which is a vintage white and I loved it! It was a great deal and very well made. She pretty much had it over 1,000 dollars cheaper than the original prices. She let us look with no pressure. She told us she had already ordered it so if we were interested to let her know because she would hold it for us. We decided a few days later that that is what we wanted and when we called and told her, she also gave us 20% off the conversion kit because it was being ordered all at once. So we waited about a week and a half and our crib was there! (bc it was already ordered it didn't take as long as most orders) My husband and a friend went to pick it up and she was having a Veterans Day sale that weekend and our crib price dropped $100. So she felt sorry for us that we missed the sale and GAVE US A FREE CRIB MATTRESS AND TODDLER RAIL!!! I was blown away by her generosity. I had no idea that the crib price dropped so when she offered us all of that it really meant so much! The items she gave us retail way more than that $100 dollars. I am very impressed and plan on giving them more business in the future. THANKS POSH MOMMY ;)", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101585047496389728160", "name": "Keith Morgan", "time": 1471797781113, "rating": 5.0, "text": "It is the place to go for all things baby. The people there know a lot about what you need", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117824481915402156711", "name": "Tammy G", "time": 1393462580993, "rating": 1.0, "text": "Not made to feel welcomed unless purchasing something big. Not a warm atmosphere.", "pics": null, "resp": {"time": 1573754183551, "text": "Tammy, I am sorry to see that your experience at Posh Mommy & Baby Too was not positive. Should you have a negative experience, please take a moment to find me in the store and share your issue. We will do our best to try to satisfy your needs."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109990035374091410357", "name": "Yvette Torbert", "time": 1485882351833, "rating": 4.0, "text": "Always have exactly what I need. A little pricey, BUT ALWAYS quality.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103794172672266371146", "name": "Jocelyn Merkel", "time": 1382635866989, "rating": 1.0, "text": "The employees at Posh Mommy are so incredibly RUDE! I will never again set foot in this place. The owner treated me like I was an inconvenience and a waste of her time. I was speechless-- I've never been treated so poorly by a local business. I don't know how they stay open.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111422747019442857025", "name": "Hallie Wallis", "time": 1467307576363, "rating": 5.0, "text": "Great little baby boutique! So much to choose from!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112973842742459761832", "name": "Yolanda Black", "time": 1522361104390, "rating": 5.0, "text": "Always find quality items at this boutique for children, as well as, items for Mommy too!", "pics": null, "resp": {"time": 1545668644572, "text": "Thrilled to know you enjoy our high quality selection, Yolanda! Hoping to see you again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101762511581299527612", "name": "Nettie Savell", "time": 1486405704488, "rating": 5.0, "text": "Employees were helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118193895143727454146", "name": "Barbara Randa", "time": 1563853547694, "rating": 5.0, "text": "Wonderful storr", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114674921060380465590", "name": "Tammy Cashon", "time": 1550350557473, "rating": 5.0, "text": "Love this shop!", "pics": null, "resp": {"time": 1550759500518, "text": "Tammy, thank you for your great review! Come back to see us soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116228749342281381426", "name": "Janna Bennetts", "time": 1623504220546, "rating": 1.0, "text": "Not even upset about the how long it took to get our things in as this is something every business is struggling with, but the customer service at this place is absolutely horrible. Will not do business with this place again.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112042636972630247750", "name": "Emily Miles", "time": 1611850938780, "rating": 1.0, "text": "Not friendly at all, as I ask questions about a seat it was like I was nothing more than a bother.... I am all for supporting local businesses. However, the attitude did it for me on this one!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112457675680175038431", "name": "Ashley Cole", "time": 1603654357819, "rating": 5.0, "text": "Awesome selection ! Everything from breast feeding/pumping supplies to nursery must haves...not to mention the sweetest variety of clothing and accessories.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110126953266495482781", "name": "Hena Jenkins", "time": 1565961874324, "rating": 5.0, "text": "Wow! This place was phenomenal. Just about everything you can imagine for babies and children. The staff were all very sweet and made wonderful suggestions about products. They know their inventory very well and will give you honest feedback about what worked/didn’t work for them. I personally prefer to shop local because I’m a “feeler” and want to know exactly what I am purchasing beforehand.I definitely recommend coming in here if you are expecting/have little ones or are buying for someone else. It was such a fun experience and I’m looking forward to coming back in the future.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109722214914063733047", "name": "Lacye McCormick", "time": 1594331609132, "rating": 5.0, "text": "Employees were very helpful and nice. Store felt very clean. They had a huge selection of baby/toddler clothing as well as toys, hair bows, baby furniture and gear. Can’t wait to return!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114934709191858678493", "name": "J M", "time": 1580179457140, "rating": 5.0, "text": "I've been here a few times since finding out that I was going to have a grandbaby and the girls working there have always been extremely nice. They have the cutest and most unique baby things in there. I love shopping here and will be back soon! 👶❤️", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118210585404378433170", "name": "Cynthia Crocker", "time": 1555816402912, "rating": 5.0, "text": "My sister and I visited Posh Mommy and Baby Too today for the very first time. Both of us had a great shopping experience. I absolutely love the baby and children’s clothing and found the prices very reasonable considering it is a boutique. They also carry a large assortment of bows of every color imaginable as well as all sorts of accessories. What really impressed me most was the friendliness of the owner and staff. Every one was wonderful.  I visited the boutique with two of my young grandchildren (I don’t know what I was thinking😳) and the ladies were so helpful and even helped keep them busy while I shopped.  This boutique is my new go-to for future children’s purchases. Thank you ladies!", "pics": null, "resp": {"time": 1556469647442, "text": "Cynthia, we're so happy that you enjoyed our selection, prices, and customer service. Myself and my staff are always happy to help you find whatever you need or want while you're in our store. Keeping the little ones busy is just a perk for us! Thanks for stopping by, and we look forward to seeing you again in the future. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103660227336784568196", "name": "Danielle Clem", "time": 1573687481001, "rating": 1.0, "text": "If I could give them 0 stars I would. I would advise never purchasing furniture or anything from them. They are so rude and will not own up to their mistakes. If you do plan on it either never arriving or way after they say it will. You are much better off buying somewhere else.", "pics": null, "resp": {"time": 1573751938915, "text": "Ms Clem, we have done an extensive research under your name, we register every customer that makes a purchase in our store, and you show up as never making a purchase.  Maybe you are confused with another baby store in the area?  Posh Mommy & Baby Too prides ourselves in customer service.  Should a customer have an issue with a product, service or employee in our store I encourage them to share the problem with myself, the owner, to see if we can come up with an equitable solution."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105192725313263011885", "name": "Samantha Jones", "time": 1562891436038, "rating": 2.0, "text": "I went in here once. I am currently pregnant with my first and was hoping to find adorable boutique style clothing. I found just that, but I felt like I couldn’t look around without being watched. There were two sales associates there eyeballing me and giving me dirty looks the whole time. I didn’t feel like I could safely shop with that going on. Cute clothes but not worth the rude sales associates....", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108919029945652237185", "name": "Faye Ahzburjn", "time": 1516515504358, "rating": 4.0, "text": "They have beautiful baby and children's clothing, shoes, cloth diapers, jewelry including amber necklaces. Cribs and bedding. Hair bows galore! I love going in to shop for my granddaughter occasionally but it's expensive! That's the only reason I don't give it 5 stars. Cute and Posh!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111367116946202726396", "name": "Kelly W", "time": 1405517934421, "rating": 5.0, "text": "I love shopping at Posh Mommy & Baby Too!  I have been shopping there for seven years and have NEVER had a bad experience!!  The owners are the best!  They know us by name and are always super friendly.  I've gotten everything from the door hanger for my hospital room, hair bows, swimwear, clothing, shoes, toys and monogramming from this store. Love PM&BT!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101853123468688264343", "name": "Amber Winn", "time": 1562178900806, "rating": 3.0, "text": "Cute shop, but the lack of boy clothes is sad. There were multiple racks of girl clothes and maybe 2 racks of boy clothes. Check out All About Baby in Huntsville instead, many more boy clothing options.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116433279533117772119", "name": "Madison Turner", "time": 1567086837402, "rating": 5.0, "text": "Their customer service is great! They where so helpful and they even helped me out when they where about to close down for the day. For a first time mom that was running late and a little scrambled , they helped me alot and maid my day.", "pics": null, "resp": {"time": 1573755133446, "text": "Ms Yarbrough, thank you for the outstanding review.  It was a pleasure to work with you.  We love interacting with first time moms and all customers in our store.  We look forward to seeing you again!"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108989035875664237481", "name": "Ellen Helton", "time": 1535042666414, "rating": 5.0, "text": "Great local shop for all your baby needs. The staff is friendly and very knowledgeable. It is nice to be able to actually touch and see the products before you buy them!", "pics": null, "resp": {"time": 1545580599480, "text": "Our team loves being able to help, Ellen! Glad you enjoyed coming in to figure out the best items. If you need anything, we're always here for you. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108468779797641828631", "name": "Samantha Giruzzi", "time": 1560186036448, "rating": 5.0, "text": "I placed a large furniture order on Saturday.  Over the weekend, I began regretting the color we ordered. Worried all weekend I wouldn't be able to change it, I went in Monday morning and it was no issue at all to change the color for my order. The owner was more than happy to change my order and get us the new color we wanted. Customer service was excellent and I couldn't be happier. Thank you, Posh Mommy!", "pics": null, "resp": {"time": 1560357227758, "text": "We're always more than happy to make sure you get exactly what furniture you want, Samantha -- swapping colors was no problem whatsoever! If you ever need anything else, we're here for you.\n\nBest,\nLisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117940604744910410301", "name": "Sandi S", "time": 1507126265350, "rating": 5.0, "text": "I love, love this store. They always have what I'm looking for and much more. From baby furniture to shoes, this shop has it all. The employees are always helpful whether I'm shopping in the store or on the phone with them. I highly recommend this shop when shopping for all your baby needs.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112398127623827956018", "name": "Gail Schwartz", "time": 1363188736717, "rating": 5.0, "text": "This is a very professionally run store.  A new mother can find anything in this store she needs and if, for some reason, they don't have what you need they will do their utmost to find it.   No one hovered over me (as if I were a shoplifter) but someone was available to help when I was ready.  I will refer my friends to this store and continue to visit it.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "102637869977983977907", "name": "Christy Payne", "time": 1401301648884, "rating": 5.0, "text": "I absolutely love this store.  They have so many unique items and keep their fb page updated of new products and sales going on.  They have reasonably priced monogramming and even helped connect me with someone to help me with a very specific need I had.  Wonderful, wonderful store!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108291940059726398981", "name": "kelsiroberts", "time": 1407276037457, "rating": 5.0, "text": "I have no clue why there are so many rude comments. They were so helpful when we went to purchase our furniture. They placed our furniture order and it came in in 19 days! Their prices are comparable to other stores plus they really work with you to help you afford everything you need! My husband and I will definitely continue to shop here!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114397876041946544831", "name": "Larry Vannoy", "time": 1517623637060, "rating": 5.0, "text": "Ms Riley, I am sorry you feel your brother and sister-in-law were treated unfairly.  We showed you the contract your sister-in-law signed stating that it could take up to 16 weeks to take delivery of the special ordered furniture.  One week into the order they started contacting us asking us about the status of the furniture delivery and   on every occasion we reminded them that special ordered furniture can take up to sixteen weeks but we hoped it would arrive much sooner.  We kept them abreast of status and put a caveat during each daily call to us that we were forwarding them what we had been told from the manufacturer and shipping company.  WE GOT IT TO YOU IN A MONTH, and during the Christmas shipping backlogs and snow storm at the manufacturer!     We are sorry that you thought your brother and sister-in-law were mistreated.  We believe we went far beyond what is considered great customer service in making such a quick delivery.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1523590267386, "rating": 5.0, "text": "If you need anything for baby ,this is your place ! Very friendly , helpful and kind staff  !  You can get anything  pertaining  to baby or mommy  here ! Cribs,rockers,  clothes car seats to bows and necklace.  Love this place !!", "pics": null, "resp": {"time": 1545668611183, "text": "I hope it's not too late to thank you for this, Jacqueline -- we love helping out however we can. If you need anything else, feel free to stop by or give us a call. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103052536987395393773", "name": "Tammie Stroud", "time": 1551665742008, "rating": 4.0, "text": "Great help. Unusual items. Beautiful gift bag.", "pics": null, "resp": {"time": 1551991855460, "text": "Happy you stopped in, Tammie! Hoping you'll make it back our way again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104743412480987251819", "name": "Tabitha Riley", "time": 1511295218321, "rating": 1.0, "text": "My brother made full payment on a crib and dresser set on Oct. 21st when my sister-in-law was 9 months pregnant. Posh Mommy however assured them that the furniture could be delivered in a few weeks. My nephew was born Nov. 16th and as of today Nov. 21st, no furniture has arrived.  Over the past few weeks my brother has made several attempts to get a delivery date for the purchased furniture to no avail.  The owners have chosen to be rude, verbally aggressive, and dishonest with all communication after payment was received. The owners have shown my family such poor customer service that I would NEVER refer anyone to shop at Posh Mommy. For first time parents, selecting and buying furniture should be joyous but Posh Mommy turned it into a nightmare.", "pics": null, "resp": {"time": 1573754009932, "text": "Ms Riley, as I shared with your brother, Mr Jackson: as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store. This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc. We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110756343777648088636", "name": "Jenni Lawson", "time": 1439906430573, "rating": 5.0, "text": "I came on here to look for pictures to show my friends and saw the rude comments and couldn't believe it. Every time I come into this store they greet me immediately and check on my throughout my visit. I had a horrible itching problem and they even loaded me up on free samples of different products to try to see which ones were more effective! I bring my first born with me as well and they give her balloons and play around with her to help me get through the store! I've never had a problem here and just felt compelled to leave a comment after reading the other ones.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109484406035634067027", "name": "Lisa Sinyard", "time": 1525043550928, "rating": 5.0, "text": "This is the best baby store! The merchandise is quality and prices are good. The registry is easy for Mommy and gifter!", "pics": null, "resp": {"time": 1545580927853, "text": "We're grateful for your support, Lisa! Glad we could help you find great merchandise at a good price. Let us know if you need anything at all. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101930654400465598245", "name": "Kyle Hoffman", "time": 1513621116931, "rating": 5.0, "text": "I cant thank them enough for all there help and guidance through our cloth diapering and preemie clothing. Our little girl was 34 weeks and Lisa made sure clothes we got would fit. Which can be confusing considering all the sizes p1,p2,p3 ,preemie, newborn and etc. Which to a Dad can be hard to keep straight and overwhelming sometimes. Excellent service all the around. Thanks you so much.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111173504733751708948", "name": "Jessica Sheridan", "time": 1480974211542, "rating": 5.0, "text": "Posh Mommy always has what I'm looking for! They have a wonderful selection of children's clothes, toys, gifts, and baby furniture. They also do personalized and custom monograming. I love this store!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108506364438666074310", "name": "Jennifer Day", "time": 1374759646964, "rating": 1.0, "text": "Terrible customer service!  I've truly never experienced customer service this bad.  Back in March, I ordered a crib converter to convert my child's crib to a toddler bed. I was told it would take a little over a month for it to come in and they would call me as soon as it did.  The money came out of my account the day I placed the order. About 2 and half months later I still had not heard from them, so I called asking about my order.  They had absolutely no record of my order, however, I told them I had proof because I can show my bank statement where the money came out of my account.  They basically said they would call the company and work on getting it to me ASAP and they were supposed to call me back.  I never heard back from them.  This was just the beginning of many false promises and unreturned phone calls.  After I decided I couldn't deal with them anymore I went on the web and found the exact crib converter kit that I needed for less than half the price they sold it to me for.  At this point, I called and said I wanted my money back.  They agreed to return my money, but said they would have to mail it to me.  It has now been almost 5 months since I placed this order and I have yet to receive a crib converter or my money back.  And they are continuing to blow me off and not return my phone calls.  At this point, I'm at a loss for what to do. I know for sure, I will NEVER shop there again though.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110367184114206920961", "name": "J Brosemer", "time": 1394238991478, "rating": 1.0, "text": "HORRIBLE EXPERIENCE. EXTREMELY RUDE AND UNPROFESSIONAL. WILL NEVER RETURN!!! My wife bought an umbrella stroller from there about a week ago. We had some unexpected expenses arise and I went there with the receipt to return it. We had it just over a week and had never even taken it out of the car. It still had all the plastic on it and had never even been unfolded. When I walked in, they were not busy at all. There may have been three or four people in the entire store. I walked up to the counter and waited and waited and waited some more until finally going and asking someone to help me. I told him what I was there for and he immediately said they do not give refunds. He said he couldn't take back a used product and he could not be out that money. He was extremely rude and basically called me a liar. He said the stroller was obviously used because one of the wheels had a scuff on it. My wife had gotten him to roll it out to the car before she purchased it to make sure that it would fit in our vehicle. When I told him that's where the scuff came from he said oh no I took it straight out of the box so that's not possible. The stroller was a display model so there was no box at all. When I told him that I knew he was lying to me, he said well our return policy is posted on the counter there so if your wife is literate she could've read it. I wont go on about everything else that was said but I just want to let people know how they do business. He was EXTREMELY rude and unprofessional and I can see by all the other comments that I am not the only one who has experienced this. I will never shop there again and would advise anyone else not to either. I will be filing a report with the BBB and letting everyone I know how they treat people. A Nurturing Moment is a much better alternative. The woman there is very nice and polite and knowledgeable about the products she sells. To sum it up it was terrible experience.", "pics": null, "resp": {"time": 1573754533461, "text": "Mr Brosemer, as we talked at the time, the stroller your wife purchased at time had been used by her outside the store, we personally witnessed her using it.  Further we told her that it was sold to her at a discount and we were very specific with her that it was not returnable.  In addition, the stroller smelled like cigarette smoke and we would not be able to re-sell it.  I am sorry your expectations were not the same as was your wife's."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104261798673700825950", "name": "Jennifer Davis", "time": 1386700588334, "rating": 1.0, "text": "HORRIBLE HORRBILE HORRIBLE customer service!!!\nBought several items from them.\n1-Bought a glider.  They didn't even order it and it was months later before we finally got it.\n2-bought furniture from them (Young America).  It broke within a few weeks of having it and they would offer NO help in getting replacement parts!!!\n\nPLEASE do not go here!  Shop at A Nurturing Moment or All About Baby!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112173692071904544301", "name": "Regina Smith", "time": 1345345964560, "rating": 2.0, "text": "Horrible customer service. It is funny they are great until you have a problem with their merchandise. Then, they become very confrontational and all of a sudden it is not their problem. Their business in my opinion is very unethical. I WILL NEVER SHOP THERE AGAIN! I will go to Nurturing Moment or All About Baby from now on. I have all ways been treated with respect and dignity a these two places!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104561881740931943968", "name": "Tasha Wiley", "time": 1365172197411, "rating": 5.0, "text": "I've been shopping here for many, many years and completely furnished my daughter's entire nursery from PM&B2.  While my friends were complaining that their baby furniture deliveries (ordered from other local shops) were running weeks behind schedule, mine was in the nursery and ready to go! I have never had anything but an amazing experience dealing with the owner and her staff.  The store is clean, well-organized, and there is always plenty to choose from.  It's specialty, one-of-a-kind stuff and always my first stop for hair bows/headbands and \"Special Occasion\" clothing & items.  Also, the Santa Pictures they do every year with Gallery Seven Photography is by far and away the BEST setup in Huntsville.  I know ladies who drive from Nashville to have their Christmas cards done at the store every year because the set and Santa are both so gorgeous!  Love this store and will continue to shop there!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "113174923182533913249", "name": "E. Biggers", "time": 1506357500996, "rating": 5.0, "text": "Professional staff who are always helpful and knowledgeable. I highly recommend Posh Mommy and Baby, Too to all my family and friends.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103466565595422570282", "name": "Justin Draughon", "time": 1539133322536, "rating": 5.0, "text": "Great place to shop for babies and small children. They have clothes, furniture, and do monograms. The staff and owners are very helpful and accommodating.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111196312545284057049", "name": "Jeffrey Jackson", "time": 1511296694249, "rating": 1.0, "text": "*ATTENTION* Bad Customer Sevice ALERT!!!\nOn October 21, my wife(9 months pregnant) purchased a crib and double dresser from POSH MOMMY, located on Hwy 72 in Madison AL. The owner told my wife the set does not take long to come in, usually a couple of weeks and she will expedite the shipment. Since we purchased the set the customer service has been HORRENDOUS.!! When my wife purchased the set, they advised her a estimated delivery date would be provided on the following week since it was a weekend transaction and the Vendor was closed. Since that date the owner have failed to contact us on the delivery date. We made several attempts to establish a concrete date in which we were told by the owners, ‘that is not the way they do business’. On last Monday,  November 13, the owner reached out to me and said the crib and dresser would arrive on Thursday (Jax Birthday). After my wife was settled in her hospital room after having Jax, I called Posh Mommy to verify what time the truck was coming in order to pick up. The owner, Lisa told me ‘the truck had not arrived and she will call back later that day.’ I did not receive a phone call, in which I called the following day to pick up the set. Lisa’s husband (co owner) claims he did not tell me it will arrive on Thursday but he claimed he hoped it would arrive on Thursday. On Friday, November 17th, he stated the shipment will be in on today. As of today, November 21st, we have not received our furniture. The owner now claims it will be in on tomorrow. Please help me share this experience, I have filed a complaint with the BBB and other parents need to know how POSH MOMMY does business. My wife was 9 months pregnant when she purchased the set believing the owner at her word. I guess that means nothing these days.#cribforJAX", "pics": null, "resp": {"time": 1573752892023, "text": "Mr Jackson, as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store.  This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc.  We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105854019466465040282", "name": "Margaret Sterling", "time": 1468421783292, "rating": 5.0, "text": "They have got a nice bow selection and paci selection. Also like that it is a local establishment so the people working there usually follow up on your orders and products", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104323816005693797302", "name": "Brittany S.", "time": 1385002017731, "rating": 5.0, "text": "After reading all these reviews, I had to leave my experience on here. My husband and I were having a hard time finding a nursery that we could both agree on for our second child. I suggested Posh Mommy and we went in there last thinking we probably couldn't afford it. When I walked in the owner immediately greeted us and asked what we were looking for. When I told her baby furniture, she wanted to show me her collection that was on sale. It was the Dolce Babi Grazi Crib and the pieces with it. It came in vanilla bean which is a vintage white and I loved it! It was a great deal and very well made. She pretty much had it over 1,000 dollars cheaper than the original prices. She let us look with no pressure. She told us she had already ordered it so if we were interested to let her know because she would hold it for us. We decided a few days later that that is what we wanted and when we called and told her, she also gave us 20% off the conversion kit because it was being ordered all at once. So we waited about a week and a half and our crib was there! (bc it was already ordered it didn't take as long as most orders) My husband and a friend went to pick it up and she was having a Veterans Day sale that weekend and our crib price dropped $100. So she felt sorry for us that we missed the sale and GAVE US A FREE CRIB MATTRESS AND TODDLER RAIL!!! I was blown away by her generosity. I had no idea that the crib price dropped so when she offered us all of that it really meant so much! The items she gave us retail way more than that $100 dollars. I am very impressed and plan on giving them more business in the future. THANKS POSH MOMMY ;)", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101585047496389728160", "name": "Keith Morgan", "time": 1471797781113, "rating": 5.0, "text": "It is the place to go for all things baby. The people there know a lot about what you need", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117824481915402156711", "name": "Tammy G", "time": 1393462580993, "rating": 1.0, "text": "Not made to feel welcomed unless purchasing something big. Not a warm atmosphere.", "pics": null, "resp": {"time": 1573754183551, "text": "Tammy, I am sorry to see that your experience at Posh Mommy & Baby Too was not positive. Should you have a negative experience, please take a moment to find me in the store and share your issue. We will do our best to try to satisfy your needs."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109990035374091410357", "name": "Yvette Torbert", "time": 1485882351833, "rating": 4.0, "text": "Always have exactly what I need. A little pricey, BUT ALWAYS quality.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103794172672266371146", "name": "Jocelyn Merkel", "time": 1382635866989, "rating": 1.0, "text": "The employees at Posh Mommy are so incredibly RUDE! I will never again set foot in this place. The owner treated me like I was an inconvenience and a waste of her time. I was speechless-- I've never been treated so poorly by a local business. I don't know how they stay open.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111422747019442857025", "name": "Hallie Wallis", "time": 1467307576363, "rating": 5.0, "text": "Great little baby boutique! So much to choose from!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112973842742459761832", "name": "Yolanda Black", "time": 1522361104390, "rating": 5.0, "text": "Always find quality items at this boutique for children, as well as, items for Mommy too!", "pics": null, "resp": {"time": 1545668644572, "text": "Thrilled to know you enjoy our high quality selection, Yolanda! Hoping to see you again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101762511581299527612", "name": "Nettie Savell", "time": 1486405704488, "rating": 5.0, "text": "Employees were helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118193895143727454146", "name": "Barbara Randa", "time": 1563853547694, "rating": 5.0, "text": "Wonderful storr", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114674921060380465590", "name": "Tammy Cashon", "time": 1550350557473, "rating": 5.0, "text": "Love this shop!", "pics": null, "resp": {"time": 1550759500518, "text": "Tammy, thank you for your great review! Come back to see us soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116228749342281381426", "name": "Janna Bennetts", "time": 1623504220546, "rating": 1.0, "text": "Not even upset about the how long it took to get our things in as this is something every business is struggling with, but the customer service at this place is absolutely horrible. Will not do business with this place again.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112042636972630247750", "name": "Emily Miles", "time": 1611850938780, "rating": 1.0, "text": "Not friendly at all, as I ask questions about a seat it was like I was nothing more than a bother.... I am all for supporting local businesses. However, the attitude did it for me on this one!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112457675680175038431", "name": "Ashley Cole", "time": 1603654357819, "rating": 5.0, "text": "Awesome selection ! Everything from breast feeding/pumping supplies to nursery must haves...not to mention the sweetest variety of clothing and accessories.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110126953266495482781", "name": "Hena Jenkins", "time": 1565961874324, "rating": 5.0, "text": "Wow! This place was phenomenal. Just about everything you can imagine for babies and children. The staff were all very sweet and made wonderful suggestions about products. They know their inventory very well and will give you honest feedback about what worked/didn’t work for them. I personally prefer to shop local because I’m a “feeler” and want to know exactly what I am purchasing beforehand.I definitely recommend coming in here if you are expecting/have little ones or are buying for someone else. It was such a fun experience and I’m looking forward to coming back in the future.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109722214914063733047", "name": "Lacye McCormick", "time": 1594331609132, "rating": 5.0, "text": "Employees were very helpful and nice. Store felt very clean. They had a huge selection of baby/toddler clothing as well as toys, hair bows, baby furniture and gear. Can’t wait to return!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114934709191858678493", "name": "J M", "time": 1580179457140, "rating": 5.0, "text": "I've been here a few times since finding out that I was going to have a grandbaby and the girls working there have always been extremely nice. They have the cutest and most unique baby things in there. I love shopping here and will be back soon! 👶❤️", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118210585404378433170", "name": "Cynthia Crocker", "time": 1555816402912, "rating": 5.0, "text": "My sister and I visited Posh Mommy and Baby Too today for the very first time. Both of us had a great shopping experience. I absolutely love the baby and children’s clothing and found the prices very reasonable considering it is a boutique. They also carry a large assortment of bows of every color imaginable as well as all sorts of accessories. What really impressed me most was the friendliness of the owner and staff. Every one was wonderful.  I visited the boutique with two of my young grandchildren (I don’t know what I was thinking😳) and the ladies were so helpful and even helped keep them busy while I shopped.  This boutique is my new go-to for future children’s purchases. Thank you ladies!", "pics": null, "resp": {"time": 1556469647442, "text": "Cynthia, we're so happy that you enjoyed our selection, prices, and customer service. Myself and my staff are always happy to help you find whatever you need or want while you're in our store. Keeping the little ones busy is just a perk for us! Thanks for stopping by, and we look forward to seeing you again in the future. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103660227336784568196", "name": "Danielle Clem", "time": 1573687481001, "rating": 1.0, "text": "If I could give them 0 stars I would. I would advise never purchasing furniture or anything from them. They are so rude and will not own up to their mistakes. If you do plan on it either never arriving or way after they say it will. You are much better off buying somewhere else.", "pics": null, "resp": {"time": 1573751938915, "text": "Ms Clem, we have done an extensive research under your name, we register every customer that makes a purchase in our store, and you show up as never making a purchase.  Maybe you are confused with another baby store in the area?  Posh Mommy & Baby Too prides ourselves in customer service.  Should a customer have an issue with a product, service or employee in our store I encourage them to share the problem with myself, the owner, to see if we can come up with an equitable solution."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105192725313263011885", "name": "Samantha Jones", "time": 1562891436038, "rating": 2.0, "text": "I went in here once. I am currently pregnant with my first and was hoping to find adorable boutique style clothing. I found just that, but I felt like I couldn’t look around without being watched. There were two sales associates there eyeballing me and giving me dirty looks the whole time. I didn’t feel like I could safely shop with that going on. Cute clothes but not worth the rude sales associates....", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108919029945652237185", "name": "Faye Ahzburjn", "time": 1516515504358, "rating": 4.0, "text": "They have beautiful baby and children's clothing, shoes, cloth diapers, jewelry including amber necklaces. Cribs and bedding. Hair bows galore! I love going in to shop for my granddaughter occasionally but it's expensive! That's the only reason I don't give it 5 stars. Cute and Posh!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111367116946202726396", "name": "Kelly W", "time": 1405517934421, "rating": 5.0, "text": "I love shopping at Posh Mommy & Baby Too!  I have been shopping there for seven years and have NEVER had a bad experience!!  The owners are the best!  They know us by name and are always super friendly.  I've gotten everything from the door hanger for my hospital room, hair bows, swimwear, clothing, shoes, toys and monogramming from this store. Love PM&BT!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101853123468688264343", "name": "Amber Winn", "time": 1562178900806, "rating": 3.0, "text": "Cute shop, but the lack of boy clothes is sad. There were multiple racks of girl clothes and maybe 2 racks of boy clothes. Check out All About Baby in Huntsville instead, many more boy clothing options.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "116433279533117772119", "name": "Madison Turner", "time": 1567086837402, "rating": 5.0, "text": "Their customer service is great! They where so helpful and they even helped me out when they where about to close down for the day. For a first time mom that was running late and a little scrambled , they helped me alot and maid my day.", "pics": null, "resp": {"time": 1573755133446, "text": "Ms Yarbrough, thank you for the outstanding review.  It was a pleasure to work with you.  We love interacting with first time moms and all customers in our store.  We look forward to seeing you again!"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108989035875664237481", "name": "Ellen Helton", "time": 1535042666414, "rating": 5.0, "text": "Great local shop for all your baby needs. The staff is friendly and very knowledgeable. It is nice to be able to actually touch and see the products before you buy them!", "pics": null, "resp": {"time": 1545580599480, "text": "Our team loves being able to help, Ellen! Glad you enjoyed coming in to figure out the best items. If you need anything, we're always here for you. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108468779797641828631", "name": "Samantha Giruzzi", "time": 1560186036448, "rating": 5.0, "text": "I placed a large furniture order on Saturday.  Over the weekend, I began regretting the color we ordered. Worried all weekend I wouldn't be able to change it, I went in Monday morning and it was no issue at all to change the color for my order. The owner was more than happy to change my order and get us the new color we wanted. Customer service was excellent and I couldn't be happier. Thank you, Posh Mommy!", "pics": null, "resp": {"time": 1560357227758, "text": "We're always more than happy to make sure you get exactly what furniture you want, Samantha -- swapping colors was no problem whatsoever! If you ever need anything else, we're here for you.\n\nBest,\nLisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117940604744910410301", "name": "Sandi S", "time": 1507126265350, "rating": 5.0, "text": "I love, love this store. They always have what I'm looking for and much more. From baby furniture to shoes, this shop has it all. The employees are always helpful whether I'm shopping in the store or on the phone with them. I highly recommend this shop when shopping for all your baby needs.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112398127623827956018", "name": "Gail Schwartz", "time": 1363188736717, "rating": 5.0, "text": "This is a very professionally run store.  A new mother can find anything in this store she needs and if, for some reason, they don't have what you need they will do their utmost to find it.   No one hovered over me (as if I were a shoplifter) but someone was available to help when I was ready.  I will refer my friends to this store and continue to visit it.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "102637869977983977907", "name": "Christy Payne", "time": 1401301648884, "rating": 5.0, "text": "I absolutely love this store.  They have so many unique items and keep their fb page updated of new products and sales going on.  They have reasonably priced monogramming and even helped connect me with someone to help me with a very specific need I had.  Wonderful, wonderful store!!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108291940059726398981", "name": "kelsiroberts", "time": 1407276037457, "rating": 5.0, "text": "I have no clue why there are so many rude comments. They were so helpful when we went to purchase our furniture. They placed our furniture order and it came in in 19 days! Their prices are comparable to other stores plus they really work with you to help you afford everything you need! My husband and I will definitely continue to shop here!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114397876041946544831", "name": "Larry Vannoy", "time": 1517623637060, "rating": 5.0, "text": "Ms Riley, I am sorry you feel your brother and sister-in-law were treated unfairly.  We showed you the contract your sister-in-law signed stating that it could take up to 16 weeks to take delivery of the special ordered furniture.  One week into the order they started contacting us asking us about the status of the furniture delivery and   on every occasion we reminded them that special ordered furniture can take up to sixteen weeks but we hoped it would arrive much sooner.  We kept them abreast of status and put a caveat during each daily call to us that we were forwarding them what we had been told from the manufacturer and shipping company.  WE GOT IT TO YOU IN A MONTH, and during the Christmas shipping backlogs and snow storm at the manufacturer!     We are sorry that you thought your brother and sister-in-law were mistreated.  We believe we went far beyond what is considered great customer service in making such a quick delivery.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1523590267386, "rating": 5.0, "text": "If you need anything for baby ,this is your place ! Very friendly , helpful and kind staff  !  You can get anything  pertaining  to baby or mommy  here ! Cribs,rockers,  clothes car seats to bows and necklace.  Love this place !!", "pics": null, "resp": {"time": 1545668611183, "text": "I hope it's not too late to thank you for this, Jacqueline -- we love helping out however we can. If you need anything else, feel free to stop by or give us a call. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103052536987395393773", "name": "Tammie Stroud", "time": 1551665742008, "rating": 4.0, "text": "Great help. Unusual items. Beautiful gift bag.", "pics": null, "resp": {"time": 1551991855460, "text": "Happy you stopped in, Tammie! Hoping you'll make it back our way again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104743412480987251819", "name": "Tabitha Riley", "time": 1511295218321, "rating": 1.0, "text": "My brother made full payment on a crib and dresser set on Oct. 21st when my sister-in-law was 9 months pregnant. Posh Mommy however assured them that the furniture could be delivered in a few weeks. My nephew was born Nov. 16th and as of today Nov. 21st, no furniture has arrived.  Over the past few weeks my brother has made several attempts to get a delivery date for the purchased furniture to no avail.  The owners have chosen to be rude, verbally aggressive, and dishonest with all communication after payment was received. The owners have shown my family such poor customer service that I would NEVER refer anyone to shop at Posh Mommy. For first time parents, selecting and buying furniture should be joyous but Posh Mommy turned it into a nightmare.", "pics": null, "resp": {"time": 1573754009932, "text": "Ms Riley, as I shared with your brother, Mr Jackson: as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store. This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc. We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110756343777648088636", "name": "Jenni Lawson", "time": 1439906430573, "rating": 5.0, "text": "I came on here to look for pictures to show my friends and saw the rude comments and couldn't believe it. Every time I come into this store they greet me immediately and check on my throughout my visit. I had a horrible itching problem and they even loaded me up on free samples of different products to try to see which ones were more effective! I bring my first born with me as well and they give her balloons and play around with her to help me get through the store! I've never had a problem here and just felt compelled to leave a comment after reading the other ones.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109484406035634067027", "name": "Lisa Sinyard", "time": 1525043550928, "rating": 5.0, "text": "This is the best baby store! The merchandise is quality and prices are good. The registry is easy for Mommy and gifter!", "pics": null, "resp": {"time": 1545580927853, "text": "We're grateful for your support, Lisa! Glad we could help you find great merchandise at a good price. Let us know if you need anything at all. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101930654400465598245", "name": "Kyle Hoffman", "time": 1513621116931, "rating": 5.0, "text": "I cant thank them enough for all there help and guidance through our cloth diapering and preemie clothing. Our little girl was 34 weeks and Lisa made sure clothes we got would fit. Which can be confusing considering all the sizes p1,p2,p3 ,preemie, newborn and etc. Which to a Dad can be hard to keep straight and overwhelming sometimes. Excellent service all the around. Thanks you so much.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111173504733751708948", "name": "Jessica Sheridan", "time": 1480974211542, "rating": 5.0, "text": "Posh Mommy always has what I'm looking for! They have a wonderful selection of children's clothes, toys, gifts, and baby furniture. They also do personalized and custom monograming. I love this store!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "108506364438666074310", "name": "Jennifer Day", "time": 1374759646964, "rating": 1.0, "text": "Terrible customer service!  I've truly never experienced customer service this bad.  Back in March, I ordered a crib converter to convert my child's crib to a toddler bed. I was told it would take a little over a month for it to come in and they would call me as soon as it did.  The money came out of my account the day I placed the order. About 2 and half months later I still had not heard from them, so I called asking about my order.  They had absolutely no record of my order, however, I told them I had proof because I can show my bank statement where the money came out of my account.  They basically said they would call the company and work on getting it to me ASAP and they were supposed to call me back.  I never heard back from them.  This was just the beginning of many false promises and unreturned phone calls.  After I decided I couldn't deal with them anymore I went on the web and found the exact crib converter kit that I needed for less than half the price they sold it to me for.  At this point, I called and said I wanted my money back.  They agreed to return my money, but said they would have to mail it to me.  It has now been almost 5 months since I placed this order and I have yet to receive a crib converter or my money back.  And they are continuing to blow me off and not return my phone calls.  At this point, I'm at a loss for what to do. I know for sure, I will NEVER shop there again though.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "110367184114206920961", "name": "J Brosemer", "time": 1394238991478, "rating": 1.0, "text": "HORRIBLE EXPERIENCE. EXTREMELY RUDE AND UNPROFESSIONAL. WILL NEVER RETURN!!! My wife bought an umbrella stroller from there about a week ago. We had some unexpected expenses arise and I went there with the receipt to return it. We had it just over a week and had never even taken it out of the car. It still had all the plastic on it and had never even been unfolded. When I walked in, they were not busy at all. There may have been three or four people in the entire store. I walked up to the counter and waited and waited and waited some more until finally going and asking someone to help me. I told him what I was there for and he immediately said they do not give refunds. He said he couldn't take back a used product and he could not be out that money. He was extremely rude and basically called me a liar. He said the stroller was obviously used because one of the wheels had a scuff on it. My wife had gotten him to roll it out to the car before she purchased it to make sure that it would fit in our vehicle. When I told him that's where the scuff came from he said oh no I took it straight out of the box so that's not possible. The stroller was a display model so there was no box at all. When I told him that I knew he was lying to me, he said well our return policy is posted on the counter there so if your wife is literate she could've read it. I wont go on about everything else that was said but I just want to let people know how they do business. He was EXTREMELY rude and unprofessional and I can see by all the other comments that I am not the only one who has experienced this. I will never shop there again and would advise anyone else not to either. I will be filing a report with the BBB and letting everyone I know how they treat people. A Nurturing Moment is a much better alternative. The woman there is very nice and polite and knowledgeable about the products she sells. To sum it up it was terrible experience.", "pics": null, "resp": {"time": 1573754533461, "text": "Mr Brosemer, as we talked at the time, the stroller your wife purchased at time had been used by her outside the store, we personally witnessed her using it.  Further we told her that it was sold to her at a discount and we were very specific with her that it was not returnable.  In addition, the stroller smelled like cigarette smoke and we would not be able to re-sell it.  I am sorry your expectations were not the same as was your wife's."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104261798673700825950", "name": "Jennifer Davis", "time": 1386700588334, "rating": 1.0, "text": "HORRIBLE HORRBILE HORRIBLE customer service!!!\nBought several items from them.\n1-Bought a glider.  They didn't even order it and it was months later before we finally got it.\n2-bought furniture from them (Young America).  It broke within a few weeks of having it and they would offer NO help in getting replacement parts!!!\n\nPLEASE do not go here!  Shop at A Nurturing Moment or All About Baby!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112173692071904544301", "name": "Regina Smith", "time": 1345345964560, "rating": 2.0, "text": "Horrible customer service. It is funny they are great until you have a problem with their merchandise. Then, they become very confrontational and all of a sudden it is not their problem. Their business in my opinion is very unethical. I WILL NEVER SHOP THERE AGAIN! I will go to Nurturing Moment or All About Baby from now on. I have all ways been treated with respect and dignity a these two places!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104561881740931943968", "name": "Tasha Wiley", "time": 1365172197411, "rating": 5.0, "text": "I've been shopping here for many, many years and completely furnished my daughter's entire nursery from PM&B2.  While my friends were complaining that their baby furniture deliveries (ordered from other local shops) were running weeks behind schedule, mine was in the nursery and ready to go! I have never had anything but an amazing experience dealing with the owner and her staff.  The store is clean, well-organized, and there is always plenty to choose from.  It's specialty, one-of-a-kind stuff and always my first stop for hair bows/headbands and \"Special Occasion\" clothing & items.  Also, the Santa Pictures they do every year with Gallery Seven Photography is by far and away the BEST setup in Huntsville.  I know ladies who drive from Nashville to have their Christmas cards done at the store every year because the set and Santa are both so gorgeous!  Love this store and will continue to shop there!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "113174923182533913249", "name": "E. Biggers", "time": 1506357500996, "rating": 5.0, "text": "Professional staff who are always helpful and knowledgeable. I highly recommend Posh Mommy and Baby, Too to all my family and friends.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103466565595422570282", "name": "Justin Draughon", "time": 1539133322536, "rating": 5.0, "text": "Great place to shop for babies and small children. They have clothes, furniture, and do monograms. The staff and owners are very helpful and accommodating.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111196312545284057049", "name": "Jeffrey Jackson", "time": 1511296694249, "rating": 1.0, "text": "*ATTENTION* Bad Customer Sevice ALERT!!!\nOn October 21, my wife(9 months pregnant) purchased a crib and double dresser from POSH MOMMY, located on Hwy 72 in Madison AL. The owner told my wife the set does not take long to come in, usually a couple of weeks and she will expedite the shipment. Since we purchased the set the customer service has been HORRENDOUS.!! When my wife purchased the set, they advised her a estimated delivery date would be provided on the following week since it was a weekend transaction and the Vendor was closed. Since that date the owner have failed to contact us on the delivery date. We made several attempts to establish a concrete date in which we were told by the owners, ‘that is not the way they do business’. On last Monday,  November 13, the owner reached out to me and said the crib and dresser would arrive on Thursday (Jax Birthday). After my wife was settled in her hospital room after having Jax, I called Posh Mommy to verify what time the truck was coming in order to pick up. The owner, Lisa told me ‘the truck had not arrived and she will call back later that day.’ I did not receive a phone call, in which I called the following day to pick up the set. Lisa’s husband (co owner) claims he did not tell me it will arrive on Thursday but he claimed he hoped it would arrive on Thursday. On Friday, November 17th, he stated the shipment will be in on today. As of today, November 21st, we have not received our furniture. The owner now claims it will be in on tomorrow. Please help me share this experience, I have filed a complaint with the BBB and other parents need to know how POSH MOMMY does business. My wife was 9 months pregnant when she purchased the set believing the owner at her word. I guess that means nothing these days.#cribforJAX", "pics": null, "resp": {"time": 1573752892023, "text": "Mr Jackson, as we discussed on the multiple occasions, as signed in the contract with the store, it can take multiple weeks, worst case up to 16 weeks for furniture to arrive at our store.  This is driven by many reasons, all attributable to the manufacturer, be it that furniture is in production, frequently overseas, shipment from overseas, tied up in customs, delivery warehouse problems, etc.  We work our very best to make customers happy but unfortunately in this situation, your expectations did not line up with the contract."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "105854019466465040282", "name": "Margaret Sterling", "time": 1468421783292, "rating": 5.0, "text": "They have got a nice bow selection and paci selection. Also like that it is a local establishment so the people working there usually follow up on your orders and products", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "104323816005693797302", "name": "Brittany S.", "time": 1385002017731, "rating": 5.0, "text": "After reading all these reviews, I had to leave my experience on here. My husband and I were having a hard time finding a nursery that we could both agree on for our second child. I suggested Posh Mommy and we went in there last thinking we probably couldn't afford it. When I walked in the owner immediately greeted us and asked what we were looking for. When I told her baby furniture, she wanted to show me her collection that was on sale. It was the Dolce Babi Grazi Crib and the pieces with it. It came in vanilla bean which is a vintage white and I loved it! It was a great deal and very well made. She pretty much had it over 1,000 dollars cheaper than the original prices. She let us look with no pressure. She told us she had already ordered it so if we were interested to let her know because she would hold it for us. We decided a few days later that that is what we wanted and when we called and told her, she also gave us 20% off the conversion kit because it was being ordered all at once. So we waited about a week and a half and our crib was there! (bc it was already ordered it didn't take as long as most orders) My husband and a friend went to pick it up and she was having a Veterans Day sale that weekend and our crib price dropped $100. So she felt sorry for us that we missed the sale and GAVE US A FREE CRIB MATTRESS AND TODDLER RAIL!!! I was blown away by her generosity. I had no idea that the crib price dropped so when she offered us all of that it really meant so much! The items she gave us retail way more than that $100 dollars. I am very impressed and plan on giving them more business in the future. THANKS POSH MOMMY ;)", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101585047496389728160", "name": "Keith Morgan", "time": 1471797781113, "rating": 5.0, "text": "It is the place to go for all things baby. The people there know a lot about what you need", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "117824481915402156711", "name": "Tammy G", "time": 1393462580993, "rating": 1.0, "text": "Not made to feel welcomed unless purchasing something big. Not a warm atmosphere.", "pics": null, "resp": {"time": 1573754183551, "text": "Tammy, I am sorry to see that your experience at Posh Mommy & Baby Too was not positive. Should you have a negative experience, please take a moment to find me in the store and share your issue. We will do our best to try to satisfy your needs."}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "109990035374091410357", "name": "Yvette Torbert", "time": 1485882351833, "rating": 4.0, "text": "Always have exactly what I need. A little pricey, BUT ALWAYS quality.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "103794172672266371146", "name": "Jocelyn Merkel", "time": 1382635866989, "rating": 1.0, "text": "The employees at Posh Mommy are so incredibly RUDE! I will never again set foot in this place. The owner treated me like I was an inconvenience and a waste of her time. I was speechless-- I've never been treated so poorly by a local business. I don't know how they stay open.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "111422747019442857025", "name": "Hallie Wallis", "time": 1467307576363, "rating": 5.0, "text": "Great little baby boutique! So much to choose from!", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112973842742459761832", "name": "Yolanda Black", "time": 1522361104390, "rating": 5.0, "text": "Always find quality items at this boutique for children, as well as, items for Mommy too!", "pics": null, "resp": {"time": 1545668644572, "text": "Thrilled to know you enjoy our high quality selection, Yolanda! Hoping to see you again soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "101762511581299527612", "name": "Nettie Savell", "time": 1486405704488, "rating": 5.0, "text": "Employees were helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "118193895143727454146", "name": "Barbara Randa", "time": 1563853547694, "rating": 5.0, "text": "Wonderful storr", "pics": null, "resp": null, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "114674921060380465590", "name": "Tammy Cashon", "time": 1550350557473, "rating": 5.0, "text": "Love this shop!", "pics": null, "resp": {"time": 1550759500518, "text": "Tammy, thank you for your great review! Come back to see us soon. -Lisa V., Owner"}, "gmap_id": "0x886268e8fdc4fd2f:0x746533eb9aa4d4df"}
{"user_id": "112184325820558477859", "name": "Mickey Berry", "time": 1577216319893, "rating": 4.0, "text": "This was such a cool place when it was in the old location! It’s ok now, but you used to be able to go in there and find anything and everything!  I think it’s more of a craft store now? The people were nice and the gentleman who helped us was very courteous.  I just didn’t find it to be like it used to be.  We’ll give it another chance!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMMFomyjF3_OazLnY3CnrmyR6zP9DNC5klUsNzv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "117646750942061866455", "name": "Katrina Gamble Parker", "time": 1617737282472, "rating": 5.0, "text": "Great place to get unique gifts and old fashioned toys for kids!", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "117193896798799393618", "name": "S Taylor", "time": 1579124435619, "rating": 5.0, "text": "I bring my kids up here with me and we love this store. You can find just about anything your creative mind can conjure up.", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "116477114925027693603", "name": "Susan Woods-Ross", "time": 1491372999793, "rating": 5.0, "text": "Always amazing!!! Mary Ann has the God given ability to remember most everyone who has brought their children in by name and watched our children grow up. She is truly one of a kind. We all love her!", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "114005095100254302462", "name": "Claude Freeman", "time": 1453705408892, "rating": 5.0, "text": "Truly a place for a person that has everything- but not a bird whistle, or a bullet box to put remotes in. Did I mention they have seasonal stuff? Great old toys too! Highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "103036224960321673328", "name": "Kursten Terrell", "time": 1544821991289, "rating": 5.0, "text": "Been coming here sonce I was a child. This is my happy place!!", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "108595587190665788538", "name": "Izz Noland", "time": 1503586828802, "rating": 5.0, "text": "Great place to get all kinds of old knick knacks. They were the only place around still receiving and selling solar eclipse glasses, and opened days and hours they normally would not.", "pics": null, "resp": {"time": 1503590991078, "text": "It was truly our pleasure...thank you SO much!"}, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "109784839893875136625", "name": "Michael Annunziata", "time": 1488746770601, "rating": 4.0, "text": "Lots of cool little things to find here. I always drop by to find stocking stuffers for Christmas", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "118018445084850783847", "name": "LA Huffstutler", "time": 1482516609896, "rating": 5.0, "text": "Great for finding something different and it supported community vendor.", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "110047546324535782133", "name": "Zoe Read", "time": 1503790446011, "rating": 2.0, "text": "Not a good variety store. Lots of unorganized or empty shelves.", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "102483887649799699337", "name": "Kevin Nelson", "time": 1450028668169, "rating": 5.0, "text": "Wonderful store to find hard to find gifts", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "116629628296160112122", "name": "Tania", "time": 1497358559161, "rating": 5.0, "text": "This place is great", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "100435830827532988202", "name": "Jessie Bunton", "time": 1501280545240, "rating": 3.0, "text": "Wide variety of odds and ends, kinda pricey", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "116249363895760368551", "name": "Stuart Jinnette", "time": 1475200608956, "rating": 4.0, "text": "Has a wide varity", "pics": null, "resp": null, "gmap_id": "0x88891a116646a9d3:0x3d305b3713ac648d"}
{"user_id": "101748157151041289735", "name": "Jaime Thomas", "time": 1592013881660, "rating": 1.0, "text": "I would leave zero stars if I could. Will not\nPurchase anything from here again. Made an online purchase. Received email about my order and online receipt. Within 24 hours they charged my bank account 4 times. I attempted to call customer service. Can’t get anyone to help. Absolutely ridiculous.", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "103776028762273939473", "name": "Jennifer MacDonald", "time": 1591369984581, "rating": 3.0, "text": "I've shopped here for a few years now...the prices are great & shipping has always been fast and effortless. But lately my orders have taken weeks to process and even longer to receive...usually receiving one item at a time, weeks apart. I've tried emailing customer service but have yet to receive a response either time. Very disappointed with this company lately", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "105699776266194207707", "name": "Michael Yancey", "time": 1607394267324, "rating": 1.0, "text": "Strange my wife said we will not buy any children’s cloths here.  Awful customer service.", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "113317565274402722204", "name": "Victoria Woodyard", "time": 1546352585510, "rating": 1.0, "text": "I visit this location on yesterday and by it being New Year Eve they closed down at 6pm which is understandable but the key holder was very rude and rush my transaction. I ask her a questions on unlinking my coupons from the app bag and she was not for it and when I finally decided to just use the two coupons and remain calm and respectful to the Cashier then she tried to help after I made my purchase which was too late, I just ignored her because I honestly didn’t want any unnecessary problems. But, thanks to the Cashier that had patience. Store Number 1430, Reg 2 checked out finally at 6:07PM.", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "107855873501301220207", "name": "Amanda Parker", "time": 1576745177428, "rating": 1.0, "text": "Do not shop here. Childrens Place Customer Service is awful and not willing to help you. I contacted three different reps about an order an they all stated that basically the issue wasnt their problem and I would need to find other options to get it solved. Im soo disgusted with them and def suggest you take your business elsewhere. Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "100959932050433934475", "name": "Desiree Eberhart", "time": 1550633043596, "rating": 1.0, "text": "When I last shopped there the workers were in my way folding clothes. They seen me trying to look at the clothes but they were too busy running their mouth. I rather shop online in peace.", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "100136659802915548262", "name": "hua168 gao", "time": 1543299441840, "rating": 1.0, "text": "DO NOT buy from this store,very bad customer service!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891770a20bc223:0xa16fd6b6755d6919"}
{"user_id": "107637048866151220279", "name": "RealTruth4u1 /John Wesley Seagle", "time": 1624530409395, "rating": 5.0, "text": "Great place!", "pics": null, "resp": null, "gmap_id": "0x88892bdcc0262aaf:0xb112966fb9eaa035"}
{"user_id": "112775217701004645679", "name": "Amy Watkins", "time": 1526783380569, "rating": 5.0, "text": "So sad they are closing!", "pics": null, "resp": null, "gmap_id": "0x888922136dc796b3:0xf48d727bc07a39eb"}
{"user_id": "107504446061331681691", "name": "Megan Talentino", "time": 1479128373781, "rating": 5.0, "text": "Has everything you need", "pics": null, "resp": null, "gmap_id": "0x888922136dc796b3:0xf48d727bc07a39eb"}
{"user_id": "110766299631285923149", "name": "randy hall", "time": 1601513588035, "rating": 2.0, "text": "Staff was far from impressive. They do not acknowledge you are even there. They do not ask to help you. If you ask a question expect a one word answer", "pics": null, "resp": null, "gmap_id": "0x888ced24dbcfd10d:0xdeebaabbf7da7f55"}
{"user_id": "106810870574279944945", "name": "Michelle", "time": 1596397470897, "rating": 2.0, "text": "No store greeting which was fine but nor was I asked if I needed any help due to the heavy conversation between the employees. At checkout I even had to assure I was good for the promotions advertised using my member points, the staff were unaware of the store promotions going on. In my opinion, lazy and unhelpful staff.", "pics": null, "resp": null, "gmap_id": "0x888ced24dbcfd10d:0xdeebaabbf7da7f55"}
{"user_id": "118141769203008409314", "name": "Ciara Long", "time": 1510596376825, "rating": 5.0, "text": "I love this store! They always have the best sales, not to mention everything was so well organized.", "pics": null, "resp": null, "gmap_id": "0x888ced24dbcfd10d:0xdeebaabbf7da7f55"}
{"user_id": "104584428025943949252", "name": "Jc Mcgill", "time": 1498173568409, "rating": 5.0, "text": "Great deals and plenty of them!!! Great, friendly, helpful staff!!", "pics": null, "resp": null, "gmap_id": "0x888ced24dbcfd10d:0xdeebaabbf7da7f55"}
{"user_id": "112554417008301593699", "name": "Asem Ghanim", "time": 1459857960982, "rating": 5.0, "text": "The place kinda looks old, but its merchandise and service are great", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "107052803261281962027", "name": "Casey Benefield (Think A Little)", "time": 1418511484375, "rating": 1.0, "text": "Nasty store.  Layaway is handled in electronics now, so paying in full customers have to wait and wait, while people are playing around. Meanwhile people are jumping line to get in front of me with their fridge they are getting a rent to own lease on. the staff here needs to get with the program. I only wanted to but that $12 16gb microSDHC card.... I walked away. No more snack bar. no more awesomeness like years past. no wonder they are shutting these stores down.", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "113034360246624002828", "name": "Jonathan Andrews", "time": 1439597406534, "rating": 5.0, "text": "Got things i wasnt even looking for! Ive spent alot of money on items that were almost tailor made for me and myra the pharmacist rocks!", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "117724278739799109297", "name": "H Jones", "time": 1424532461618, "rating": 1.0, "text": "i would give zero stars but it wont let i ordered something for pickup same day 2 weeks ago and it still isnt there when it said it would be...now im about to go back home to florida without my stuff so pissed right now", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "112411661221473332940", "name": "Sarah “Hooper” Hooper", "time": 1461340722590, "rating": 5.0, "text": "Good selections and fair prices on most items.", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "106675001803821501519", "name": "Wesley Sparks", "time": 1468805449914, "rating": 5.0, "text": "They are going out of business everything is on sale with big discounts some good deals some have been marked way up then discounted", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "109650954777247206751", "name": "Jada Johnson", "time": 1465910411380, "rating": 2.0, "text": "Customer service was bad ,and price to high goodbye kmart", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "102015844202859534336", "name": "William Buxton", "time": 1470080931197, "rating": 3.0, "text": "Very low places. Going out business sale.", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "102483887649799699337", "name": "Kevin Nelson", "time": 1475619636754, "rating": 1.0, "text": "glad this location closed!", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "114103159449733967999", "name": "Joel Blackstock (LICSW MSW PIP)", "time": 1452039853380, "rating": 1.0, "text": "Absolute garbage.", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "107415589309332022944", "name": "Beauty Smiles", "time": 1472896044578, "rating": 1.0, "text": "Store is closed", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "116558365426933682408", "name": "Nathan Gleason", "time": 1470072032867, "rating": 3.0, "text": "High prices", "pics": null, "resp": null, "gmap_id": "0x88891eb567a93a75:0xd3172fe23ec96087"}
{"user_id": "106358023633286455397", "name": "Brandy Wickliffe", "time": 1567793870749, "rating": 5.0, "text": "Pricey but the items are awesome and the owner is very sweet", "pics": null, "resp": null, "gmap_id": "0x88890cfd40ed1341:0xba559d07a04afab"}
{"user_id": "117707025009098696502", "name": "Cyndi Cope", "time": 1558807650175, "rating": 5.0, "text": "Great shop for home and kitchen decorations. There are also sections for jewelry, baby, and local sport memorabilia gifts.", "pics": null, "resp": null, "gmap_id": "0x88890cfd40ed1341:0xba559d07a04afab"}
{"user_id": "106346172824585709103", "name": "Tammy Hoobler", "time": 1526156575595, "rating": 4.0, "text": "Go place to shop.great time shopping there.", "pics": null, "resp": null, "gmap_id": "0x888ad501eac7e33b:0x4e9a4d0999e27b2d"}
{"user_id": "106282218690321493986", "name": "Jason Latham", "time": 1484988898252, "rating": 3.0, "text": "Too expensive otherwise everything else was fine", "pics": null, "resp": null, "gmap_id": "0x888ad501eac7e33b:0x4e9a4d0999e27b2d"}
{"user_id": "111932026090820778154", "name": "Google ruined Youtube", "time": 1504202160229, "rating": 1.0, "text": "Too expensive", "pics": null, "resp": null, "gmap_id": "0x888ad501eac7e33b:0x4e9a4d0999e27b2d"}
{"user_id": "104335033120410797811", "name": "Christopher Key", "time": 1483369515514, "rating": 5.0, "text": "KMART PHARMACY AND STORE ARE VERY GOOD.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x3259155e8205a6fb"}
{"user_id": "106282218690321493986", "name": "Jason Latham", "time": 1484989048146, "rating": 2.0, "text": "Too bad they are closing the doors for good soon", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x3259155e8205a6fb"}
{"user_id": "112103475709964386704", "name": "Ashley “AAHST” Trawick", "time": 1613338759125, "rating": 5.0, "text": "My pups are thrilled with a couple of toys that didn't make my heart break when I looked at the price tag!", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "106139813884002413312", "name": "Bama Jayne", "time": 1583717900266, "rating": 5.0, "text": "Great place to shop! Amazing inventory....", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "117763529963122563831", "name": "Danielle Schroeder", "time": 1593448778171, "rating": 5.0, "text": "Delicious food and wonderful staff", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "109984654146805249813", "name": "Robin Peed", "time": 1592077730147, "rating": 3.0, "text": "Didn't hardly have anything.", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "109973952922967960064", "name": "Dianna Lantz", "time": 1577055764382, "rating": 5.0, "text": "I Love It!", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "118428536883982090004", "name": "Victory Reliable Services, LLC", "time": 1553692636710, "rating": 4.0, "text": "Grand Opening Friday March 29", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "101672381109910704644", "name": "Austin D.", "time": 1590386938976, "rating": 5.0, "text": "Obviously a front for laundering money.", "pics": null, "resp": null, "gmap_id": "0x889a0f5eabb811e9:0x22c17160e71f73a1"}
{"user_id": "108612125812257638245", "name": "JRB", "time": 1628028298430, "rating": 1.0, "text": "I just had the displeasure of going into this store today. The level of unprofessionalism is ridiculous. You have one employee walking around with hair wraps that are made for wearing to bed or anywhere else other than while at work. The older AA lady was rude. She literally carried on a conversation with the other employee that was checking people out. Their conversation wasn’t work related nor appropriate. I could have sworn some choice words were used among them that little ears shouldn’t hear. She not only took my phone out of my hand to scan the barcode instead of verbally asking me to position it (big no no as if she dropped it, who would pay because I shouldn’t have to) but had to scan it again because she was too busy talking to the other employee. She never told me which card to insert (I was completing a return) nor the total (glad I knew ahead of time). Then she was very disrespectful by ripping the receipt off the register and extended her arm for me to retrieve it as she continued to speak to the other employee never looking my way. Who acts like that and they’re supposed to be in customer service? On top of all that, the line was extremely long and there was no a/c. I’m accustomed to shopping online and in the store where I’m from, but I’ll pass on this location.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "110058551707618222921", "name": "Alice Blonskij", "time": 1604757550674, "rating": 1.0, "text": "I’ve ordered 3 times and had issues with two of the orders. They said I had to file a claim with USPS for a lost package. They have very poor customer service, and I mean POOR! I’ll never order from them again, it’s disgusting how they treat people. Take your money and make you fight for the package I never received. Never had I received such disgusting service", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "103196309004711384357", "name": "leah turner", "time": 1594231642433, "rating": 1.0, "text": "This has been an awful experience. I buy items to give to kids in third world countires. I bought tons of the clearance clothes. When I received the packages, the packing slip claimed all the clothes were in the package, but were not. I have tried over and over to call customer service, and the automated just hangs up over and over. I cannot get to a representative. I pushed the email button but it will not send me to an email. It just send me to the shopping home page. I want the items that I paid for now!", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "107391704134871226103", "name": "Brittney Catchings", "time": 1571854190588, "rating": 1.0, "text": "This store is slow as hell in everything they do! It’s freakin crazy! Best bet would be to go to the one in Foley! Much nicer and faster ! Customer service is 10 times better too!!", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "115413687528644021737", "name": "L Ross", "time": 1565047692352, "rating": 1.0, "text": "I like their clothes and they have good sales. I have ordered online and had items shipped to my home with no issues. I decided to order my child's school uniforms and have them shipped to the store. That was a HUGE mistake! The estimated delivery was between 8/3-8/5. It is 8/5 and my order status indicates it is still processing at the facility. When the order status hadn't changed by 8/3 I ordered back ups to pick up in store the same day. I waited to pick them up thinking my other order would be there. I was wrong and there were other people whose orders had not arrived. So they were scrambling around the small, messy, packed store trying to find school uniforms. Some of the store associates had attitudes and weren't helpful. I was very disappointed because they did not even have the items I ordered to purchase in the store. I know it's not the store's fault my order wasn't ready, but the store needs to be better organized.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "107422944387111000124", "name": "Erin Clarke", "time": 1564453283017, "rating": 1.0, "text": "I love the clothes, but I refuse to shop in store here. Every interaction I've had in store has been unpleasant. The employees are very rude, the store is too small for the amount of things in it; you can barely walk around, the wait time is ridiculous, and the return/exchange policy is ridiculous. I couldn't find my receipt and needed to exchange some polo shirts for a different color bc my daughter's school changed their policy, they told me they could only exchange for the same exact size and color, why anyone would need the same exact shirt for an exchange is beyond me. I have given many chances to this store thinking maybe I just came at bad times, but each and every time\nIts ALWAYS the same.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "118218177523849828601", "name": "M B", "time": 1581280291395, "rating": 1.0, "text": "This has to be their worst store location. I’m not sure as to why it’s still open in Mobile. They need to completely revamp their employees and store structure. No customer service at all. Ship to store pick up is even horrible here. Now, I just ship directly to my home.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "117596992053445129050", "name": "massey chandretia", "time": 1565373017485, "rating": 2.0, "text": "Ordered my items online and only received 2 of 6 items. Had to argue with customer care to receive credit for my missing items. After receiving credit I reordered the items to pick up in store same day. Got to the store to pick up my order and the manager told me after waiting in line for 45 mins  they no longer had the items available because customers were still shopping in store after I placed my order online.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "105344321695884493492", "name": "Jordyn Pierce", "time": 1514308536227, "rating": 1.0, "text": "I normally love this store, even though it's pricey. But after today we will NEVER be back. I walked in to exchange a pair of boots my daughter got for Christmas yesterday still with the tags on. The moment I walked in, the sales lady, who was an older lady, was already giving me a go to hell look before I even spoke to her. She told me I had to go to another store and treated me like I had stolen the shoes. I wish I had caught her name because that lady should never be working with the public at all. I will be contacting corporate.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "108084347463997930166", "name": "ChadW", "time": 1543431953983, "rating": 1.0, "text": "This place is a joke.. slow, one person checking out 5 customers... while associate hangs clothes up in the store... during holiday season", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "108665280809439303136", "name": "Amanda Young", "time": 1550340920265, "rating": 1.0, "text": "I had to take a pair of pants back because they didn’t take a security thing off. The customer service was horrible, they were beyond rude!!!! It’s a good thing I had the receipt! For it to be their mistake and act like they did was uncalled for!", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "105104114510690440953", "name": "Wendy Bond", "time": 1540331499097, "rating": 3.0, "text": "Long time waiting in line while the customer service reps choose who they want to help and when. The sale prices can be great, but the employees' attitudes are what keep me away.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "110256240010281416901", "name": "Cne mother", "time": 1574457828487, "rating": 5.0, "text": "Love mrs Lon.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "108745294492180428787", "name": "MeMe Tweetie", "time": 1563297629741, "rating": 1.0, "text": "Website keeps freezing and wont allow me to checkout and complete purchase I have logged onto 4 different devices from cellphone tablet to laptop and same thing keeps happening it just suggest that i go into the store to complete purchase if i wantes to shop in store then i wouldnt not be online such an inconvenience!", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "102715129451821096388", "name": "3BlackMartillo2 Gaming", "time": 1564451373361, "rating": 1.0, "text": "Here now and the store clerk locked the door 10 minutes prior to closing. There’s still people in here", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "105527181493704006604", "name": "Shameka Collins", "time": 1511563075264, "rating": 1.0, "text": "Horrible Customer Service. Management Watches Disrespectful Associates Talk Horribly To Their LOYAL Customers. And It Was During Christmas Season. Tried To Talk To Management She Didnt Even Care To Face Me Just Throwed An Im Sorry Over Her Shoulder.", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "105664551928060659729", "name": "Katie D", "time": 1555634498629, "rating": 2.0, "text": "High prices, unorganized store and didnt appreciate the lady at the register on her phone the whole time I was trying to check out. Wont be back", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "114931125760301208147", "name": "CANJILLIA MCCREE", "time": 1519070675405, "rating": 1.0, "text": "Worst place ever they didnt want to take back nor give me a credit my order was over 300$online i went in store to get a credit i recommend no one shop onlone or in store", "pics": null, "resp": null, "gmap_id": "0x889a4da393414ca5:0x5a00f9d1d1812160"}
{"user_id": "104858873591796280717", "name": "Brian W. Kittrell", "time": 1515326749188, "rating": 3.0, "text": "They have a pretty nice selection of merchandise and a very, very nice selection of high end candles. You could almost spend an entire day smelling all the different candles trying to find just the right one. They also have a nice selection of Caldrea cleaning products. I was, however, very disappointed in the staff. For the most part they were rather aloof and uninformed about the several things I asked, which were fairly basic questions.", "pics": null, "resp": null, "gmap_id": "0x88891768017f5a89:0x77c9e2fcd167ffd1"}
{"user_id": "116705782469852837884", "name": "Judy Halstead", "time": 1590093174385, "rating": 5.0, "text": "Great gifts for anyone on your list!!!", "pics": null, "resp": null, "gmap_id": "0x88891768017f5a89:0x77c9e2fcd167ffd1"}
{"user_id": "103915312475822011571", "name": "Cynthia Buchheit", "time": 1540236681041, "rating": 5.0, "text": "Wonderful people. Delightful selection.", "pics": null, "resp": null, "gmap_id": "0x88891768017f5a89:0x77c9e2fcd167ffd1"}
{"user_id": "116322177501483631177", "name": "Cynthia Buchheit", "time": 1540986417850, "rating": 5.0, "text": "Delightful shop, people, and items.", "pics": null, "resp": null, "gmap_id": "0x88891768017f5a89:0x77c9e2fcd167ffd1"}
{"user_id": "102530152278874266180", "name": "O. F.", "time": 1614649931859, "rating": 5.0, "text": "Wow, I was so amazed at the variety of items 3 Storks and a Baby has. Neo-natal and premature baby clothing, Shower Girl and Cute Little Tuxedos for Boys, Modern Maternity, and Christening Gowns. Rain Coats...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6atgYdfCAMZzqSzlwht29VpbpU5G8kAB-tytJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104494856728386852077", "name": "jenn caceres", "time": 1600699367118, "rating": 1.0, "text": "Cute store, I went this weekend with my in laws. Employee was not wearing a mask, I was uncomfortable when the employee attempted to approach my baby to say Hi and give her a doll. The only reason we purchased something was because my mother in law wanted to buy her clothes. I love supporting local stores, but i will not coming back to this store. The clothes were cute but overpriced.", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "107908769455410170338", "name": "Danielle Roberts", "time": 1616827395479, "rating": 1.0, "text": "Cashier wasn't wearing a mask, i didnt feel comfortable in there with my baby who is too young to wear a mask. Will not be back because of this.", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104910138693636414813", "name": "Ginny Roberts", "time": 1576251648582, "rating": 5.0, "text": "Largest selection of adorable children’s clothes that I have seen anywhere in Alabama. While they carry little boys clothes Their selection of dresses and play close for a little girls surpasses anything that I have seen. All this below normal retail prices. I also loved the selection of stuffed animals. Shopping her  is a wonderful experience:", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104964867922875326425", "name": "Lara Seamon", "time": 1575398659494, "rating": 5.0, "text": "3 Storks & A Baby is such a great baby store for all of your little ones needs. Whether it's baby gear, baby toys, baby accessories to children's clothing... You name it Mary and Laura have it. They have the name brand quality items at very afford prices. They even have diaper cakes. Which we all know that is a must for a baby shower and celebration. I loved that they also have an in house seamstress for custom embroidery and clothes. I genuinely appreciate the ability to go to their baby boutique for a one stop shop!", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "106686994138725903315", "name": "Rachel Daubenmire", "time": 1575401375573, "rating": 5.0, "text": "If you are looking for cute and trendy kids and baby clothes you have to go to 3 Storks & A Baby! This childrens boutique has the cutest dresses, kids clothes, baby clothes, boys suits, hair bows, shoes, and so much more at prices you can afford! They even have a seamstress on site that will make custom halloween costumes and princess dresses for your little one! Plus, if you are looking for a baby boutique with a baby registry they offer this too! Stop in and see Mary and Laura today!", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "101791370536104522575", "name": "Leon Burns", "time": 1580326214721, "rating": 5.0, "text": "Great place . Good great selection great people courteous and kind", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104961784349868067870", "name": "Dawn Productions", "time": 1579346132834, "rating": 5.0, "text": "Absolutely love this store. Everyone is always so nice. And it’s always clean and neat!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqaqwHlePJRI-HlpozXVts6iZtEdcTL0koJzRt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPb8y4EOBRCG_9pF7uWX1A0qpBY4tB9edvSofuv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888912c72d14c17b:0xfcad5ff46d6e492f"}
{"user_id": "109526231582273598858", "name": "Shaquita Powe", "time": 1608746064023, "rating": 1.0, "text": "The manager was very nonchalant and nasty. They wouldn't take me e-certificate /giftcard. And locked the doors on me and my family at 7PM and store hours says 9pm. I wouldn't recommend anyone to go in that kind of atmosphere. I did have that problem in Trussville when i left leeds.", "pics": null, "resp": null, "gmap_id": "0x888912c72d14c17b:0xfcad5ff46d6e492f"}
{"user_id": "110171569226953040432", "name": "Jade Underwood", "time": 1543285163662, "rating": 5.0, "text": "When I visited this store is was a very good experience, the staff was attentive & friendly & the store was very orderly, stocked, & clean. It was stellar compared to the other neighboring store. This was by FAR the best staff we interacted with too.", "pics": null, "resp": null, "gmap_id": "0x888912c72d14c17b:0xfcad5ff46d6e492f"}
{"user_id": "100065135126276242855", "name": "Cindy brasher", "time": 1462571376884, "rating": 5.0, "text": "Love this store...", "pics": null, "resp": null, "gmap_id": "0x888912c72d14c17b:0xfcad5ff46d6e492f"}
{"user_id": "104681234738951070867", "name": "Susan Johnson", "time": 1551758410857, "rating": 5.0, "text": "Best consignment shop for infants and children. The clothes are gently worn, always in style, and priced very reasonably.  The ladies who run this shop are always so helpful. You can make an appointment to bring your items to be sold and/or buy what you need before you leave. They carry clothes, toys, books, shoes, strollers, and just about anything a child would need!", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "111976370364205765335", "name": "Kari Swenson-Powell", "time": 1540397160212, "rating": 5.0, "text": "I love this store. Clothes are in great condition, prices are good, there's always some kind of sale going on, and the staff is friendly and helpful. I've bought dance clothing, tap shoes, halloween costumes, beautiful holiday clothing, and plenty of every-day kids' clothes at this shop.", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "118033527822094261094", "name": "Debra T", "time": 1477658364501, "rating": 5.0, "text": "This store in business for long time. Clothes for babies and children, always of good quality. The owner is fantastic. Prices are very reasonable.", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "103030478655282860301", "name": "Holley M", "time": 1481028961349, "rating": 4.0, "text": "Large selection of clothes from infants to older children that are gently used, but still in good condition. The staff is very friendly and helpful. You can find some good deals at KK. The items are marked down with the season changes or when clearing out for new items being consigned. Only con is it is a bit of a cramped space. I wish they had more room so they could probably take in more clothes! They have been in business a long time and I trust them to consign with, which I have, and I will continue to shop there also.", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "108746853645898381912", "name": "J PC", "time": 1482781251738, "rating": 5.0, "text": "One of my favorite shops to shop for my girls. They have reasonable prices and legit boutique clothing...Not the junk you see at other childrens' consignment stores.", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "106155287447825061579", "name": "Nate Machen", "time": 1531327352222, "rating": 5.0, "text": "Been shopping here for many years. The selection of baby and kids clothes is great and the owner is wonderful.", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "109236155733162890310", "name": "Lynda Rothoff", "time": 1496779410991, "rating": 5.0, "text": "I love mt business . Most of all I love the people that shop with me .", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "112510564504541128175", "name": "Alice Thompson Moore", "time": 1491412806372, "rating": 5.0, "text": "Good selection. Wonderful staff.", "pics": null, "resp": null, "gmap_id": "0x88891965205f6edd:0x8c43632d2d0ae66a"}
{"user_id": "115253789701531578299", "name": "whatever gaming", "time": 1503164023702, "rating": 2.0, "text": "Store in Shambles. Big Lady was in corner by office eating a bag of chips and she's already 350 lbs easy. Low representation of the store. No help visible in shopping aisles. Had to wait a few minutes for a cashier to come help us. Fire your GM..", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "101621912185138677929", "name": "gina hallman", "time": 1507987662935, "rating": 5.0, "text": "I Love Dollar general it's where you go great prices and you can find everything you need and want.", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "107717864839580726598", "name": "Shannon Pilkington", "time": 1502928859313, "rating": 5.0, "text": "Love shopping here.. Always have a nice selection of clothes & etc.. Reasonable prices also..", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "100668217769271769297", "name": "Lisa Lowery", "time": 1513547936203, "rating": 5.0, "text": "They have items at good prices", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "105299231374489671597", "name": "Maggie Browning", "time": 1517983735965, "rating": 4.0, "text": "Good prices and nice employees", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "107887856702260660903", "name": "KB Rider", "time": 1480874264196, "rating": 3.0, "text": "Could be a bit more neater. No restroom.", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "111855575627551849545", "name": "Erica Wood", "time": 1510871360544, "rating": 5.0, "text": "Nice cloths and cheap..", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "101864263851490831411", "name": "Lisa Lowery", "time": 1499620497498, "rating": 5.0, "text": "They have a lot of different items to choose from.", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "104449543007151352309", "name": "Ray Johnson", "time": 1520696342139, "rating": 5.0, "text": "Real good", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "104866077420060939816", "name": "Adam Strickling", "time": 1514745622027, "rating": 3.0, "text": "Cheap and good choices", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "117194639241501300761", "name": "Martha Thomas", "time": 1513263665886, "rating": 4.0, "text": "Good Service", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "113262791635290197152", "name": "Stevie Harris", "time": 1513111708479, "rating": 2.0, "text": "Not enough help", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "110424095074425599177", "name": "Sherry Smith", "time": 1507351373124, "rating": 5.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "108066488450317284400", "name": "Ashley Ackles", "time": 1503119180380, "rating": 5.0, "text": "❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "110903989073136572535", "name": "Misty Screws", "time": 1516383573858, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "105744178993976318369", "name": "Jessica Dingler", "time": 1497524644542, "rating": 5.0, "text": "Love it!!!", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "110668759993238109143", "name": "sethrath", "time": 1497072089882, "rating": 3.0, "text": "Kinda junkie", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "100610898432838564199", "name": "Carolyn Ann Spence", "time": 1508096524853, "rating": 5.0, "text": "friendly", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "115719975433025574997", "name": "Shirl Cooper", "time": 1507565330201, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "118033153087543822276", "name": "Reggie Barnsdale", "time": 1484093382330, "rating": 5.0, "text": "Great Bargains", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "105096922157832921458", "name": "Bernadette Johnson", "time": 1518695556649, "rating": 5.0, "text": "Good items at a low price", "pics": null, "resp": null, "gmap_id": "0x888b917faadf9d33:0xcd668ec00d780e2a"}
{"user_id": "107138011796655910075", "name": "Dare Wilson", "time": 1613863127919, "rating": 5.0, "text": "The managers gave me free stuff", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "108199169982075784671", "name": "MO Mules", "time": 1502725227752, "rating": 1.0, "text": "Went to the liquidation sale.  Prices on the shelves and prices marked with discounts they said were applied at register were two different totals. True bait and switch here.\nManager was cocky and extremely rude.  None of the items below rang up correctly, they raised the regular price to give you a 50%discount which was more than the tagged price!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO8M38gaVjYjCBIDVfNLSLK6kKdxjoaVEII28LT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "104047621313672536847", "name": "Tonya Whitehead", "time": 1449704000426, "rating": 5.0, "text": "Meagan is an outstanding pharmacist.  She always goes way beyond the call of duty to make sure that the customers have her undivided attention.  I have MS and she is always very attentive to my questions and gives me the answers in a way that she knows that I can understand.  She is the BEST", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "117454584880348143214", "name": "Michael Byrd", "time": 1497322726279, "rating": 4.0, "text": "Nice to visit a Kmart. Store was not the cleanest, but we found what we needed and the staff was friendly.", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "111479895582255313114", "name": "michelle headrick", "time": 1501744604018, "rating": 5.0, "text": "Great place for discounts", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "114299630593081272248", "name": "Jerry Green", "time": 1499652079554, "rating": 3.0, "text": "It's going out of business", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "104305694410142828057", "name": "James Bevis", "time": 1497195351850, "rating": 5.0, "text": "I hate it is closing", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "108158776846388273198", "name": "CRIMSON -", "time": 1496595629083, "rating": 5.0, "text": "Join SYW program and get rewarded!", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "114845872667234894355", "name": "D Whit", "time": 1506470413574, "rating": 1.0, "text": "Went out of business", "pics": null, "resp": null, "gmap_id": "0x887d4f187c7aebbf:0x1ebc1d9f0f654dc6"}
{"user_id": "114785455190280207695", "name": "Anaeisha Clifton", "time": 1615576622907, "rating": 5.0, "text": "Mikya is an angel!!! Her customer service was phenomenal. She was very patient with us while we tried on a time of shoes. She was very knowledgeable about the specifics of my daughter’s needs for her feet and ankle. Will definitely look for her when we return.", "pics": null, "resp": {"time": 1621375830795, "text": "Thank you Ms. Clifton for such kind words. Mikya is awesome! Feel free to ask for her the next time y’all come in to shop."}, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "114318276660839046821", "name": "Don Sowers", "time": 1528475302244, "rating": 5.0, "text": "This place is amazing. HUGE selection", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-AGxCewgQ6snTw4nuheXAL9TWa9AdQ6qIbUAn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "118059759926802992691", "name": "Nicholas Blackstock", "time": 1583342485056, "rating": 5.0, "text": "Really enjoy shopping at Sikes! Great selection, amazingly accommodating staff, decent prices... no major complaints. Well one, which I'm not sure is about the business itself, but the parking lot could be better lol. Kinda tight, especially when everyone brings out their suv's and pickups :) Other than that, no gripes from me!", "pics": null, "resp": {"time": 1621375914666, "text": "Thank you for the great review! We have moved to our permanent location now and there is a nice parking lot in the back of the building. Hope to see you and your kids again soon!"}, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "108455199762604348218", "name": "Alyssa White", "time": 1578507446505, "rating": 5.0, "text": "This is a great local store with a wide selection of high quality children's shoes. I often can find a good sale on the size of shoe  I need for my daughter. Mikta is an excellent associate and she helps me every time I'm in there. I can buy many of these shoes online but her personal help makes me want to go into the store.", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "110595154582986606218", "name": "Ann B. Gallegly", "time": 1580158060123, "rating": 5.0, "text": "Sikes is king when it comes to customer service! I recently went to get my 2nd son’s first pair of shoes and some time after we left we realized that he needed a different fit because they were too tight and I had not used thicker socks during the fitting. Danyelle helped us out greatly by doing an even exchange AND helping pick out a better fitting pair. Now my boy’s got happy feet and I’m a happy Mama.\n\nThank you to Danyelle and the fantastic staff at Sikes for the excellent service!!", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "104943576592567171533", "name": "Sandra Bagley", "time": 1541945881539, "rating": 5.0, "text": "Great place to work. 18 yrs at Sikes\nNothing better than helping get shoes for these little ones .\nHappy faces!\nBrings so much joy for me.", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "107565054865496685614", "name": "L. Thomas", "time": 1542116180605, "rating": 5.0, "text": "Super friendly, awesome sales Associates. Very upbeat environment(of course when kids are around). Will continue to take my baby girl there for her shoes.", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "105960761725865239154", "name": "Opal Hall", "time": 1553477107036, "rating": 5.0, "text": "I love their selection of shoes that are actually good for children to wear. I wouldn’t go on a Saturday again, they were so packed. I enjoyed their selection. They had everything I was looking for in shoes. Plae, keens, natives etc.", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "117052095429208544567", "name": "Chaeli Lawson", "time": 1479075653233, "rating": 5.0, "text": "The staff make shoe shopping with a toddler so enjoyable. The staff is very knowledgeable and helpful. This is not just your average shoe store. We love Sikes and don't go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "106514103904749814850", "name": "Taris Pressley", "time": 1542756013962, "rating": 5.0, "text": "The customer service is amazing. I love the one in one service.", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "109578812238250853443", "name": "Diana Jones", "time": 1551228423126, "rating": 5.0, "text": "Staff helpful and nice. Wonderful experience 😊", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "110416509562941079371", "name": "Amy Buckner", "time": 1456439229935, "rating": 5.0, "text": "The nicest people work in Sikes! They are so helpful. I love it!", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "117211241658828666649", "name": "bonnie mckee", "time": 1489610805201, "rating": 5.0, "text": "Great selections  & great customer service\nfrom a locally owned business! Both of\nmy grandchildren just love the Manger!", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "105165222407389188585", "name": "Sheldon Robinson", "time": 1499480113809, "rating": 4.0, "text": "Great place for children's clothes so my wife says.", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "103270281875973630747", "name": "Hunter Standridge", "time": 1530231626031, "rating": 4.0, "text": "Great service and knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "116978031000841696949", "name": "Vicki Lovinggood", "time": 1456506391539, "rating": 5.0, "text": "They have a super selection of shoes!!! The staff was excellent 😀", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "101108086133870933272", "name": "Crenshaw Cleaning", "time": 1537812275303, "rating": 5.0, "text": "Great Customer service", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "112709212990601589793", "name": "Mikya Lee", "time": 1558740217995, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "113637273333492176843", "name": "Sheryl Daniels", "time": 1527418878138, "rating": 5.0, "text": "Love buying for the Prince", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "102262605723510473238", "name": "Mrs Johnson", "time": 1498057001454, "rating": 5.0, "text": "Good people!", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "100596890646754886947", "name": "Martez Henderson", "time": 1462636480446, "rating": 5.0, "text": "Perfect", "pics": null, "resp": null, "gmap_id": "0x8889197ad57624d5:0xb2dc74d9a84fd3e2"}
{"user_id": "115192085889500180707", "name": "Christa Whitman", "time": 1613937140654, "rating": 1.0, "text": "I will never shop at this store again. I understand the whole mask thing but if someone tells you they have a medical issue that prevents them from wearing one leave them alone. It's hard enough for us to have to deal with all the Karen's that think we are just doing it for no reason now I cant even shop for my son. I had to put my stuff down and was asked to leave. Its sad that you allow your employees to treat people that way.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "104129624779482776157", "name": "Nicholas Nicholas", "time": 1604171802212, "rating": 5.0, "text": "Very clean and up to date kids wear.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "114232315694137598051", "name": "Ketti Johnson", "time": 1572897508855, "rating": 3.0, "text": "I will order online and have it shipped to me from now on.  I was not pleased with the pick-up process at the store.  Online is the way to go, plus it seems the prices are better.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "100805742061541073450", "name": "Midian DiNardo", "time": 1565830129599, "rating": 1.0, "text": "Did not have a good experience ordering online.   Live store experience is different-heard great things.   My online ordering experience was not pleasant and I do not recommend it.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "105728344346482722348", "name": "xunkidnerz", "time": 1563566410059, "rating": 1.0, "text": "DO NOT ORDER ONLINE!!\nI order a package over two weeks ago and still have not recieved it. I called customer service three times to try to get help. I was told no one could find my package. Then they said I had the wrong tracking number. Then they said I had to contact the shipper for a different tracking number. I explained to the rep that this was the only form of contact the website provides. Literally no one would help me. Then instead of a refund they just wanted to make another shipment (which would take another two weeks to deliver) . Please dont waste your time and money.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "101740179731574024067", "name": "Virginia Buffkin", "time": 1469230980847, "rating": 1.0, "text": "Rude, unprofessional, racist. Was in there today about to make a $150 purchase and the associate snapped at me. I left my selected purchase on the counter and walked out.  Amazing. This was the first time I had been in PPM this year and was walking between Dillard's and another store and saw children's clothes at this place. Never again. Get a hint. Nowadays, it's all about customer loyalty at brick-and-mortar stores and you blew it.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "105817883264758365683", "name": "Jewell Gamble Caldwell", "time": 1533215619369, "rating": 1.0, "text": "I went into the store 10 minutes before store closing, they told me I could not shop. I proceed to tell her I only wanted denim in a size 14. \"We're closed,\" with an attitude.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "116840446591375027501", "name": "L Wilson", "time": 1468894318664, "rating": 2.0, "text": "We love Children's place but I will order online. I do not enjoy going in this store. The staff have no professionalism, they do not greet you and barely tolerate you when you make a purchase. They need to work on their customer service and get new management.", "pics": null, "resp": null, "gmap_id": "0x88626cb6fe754ba9:0x64e80d63e71aeab8"}
{"user_id": "104127837418037043764", "name": "Ginger Staten", "time": 1563062916697, "rating": 5.0, "text": "Event catered by Carmen from Cafe 336. One word... amazing! A pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "103609128347712926993", "name": "Robert Weaver", "time": 1561224691296, "rating": 3.0, "text": "Not what we expected and the cookies/cakes did not seem to be fresh made. We weren't impressed at all but it did seem to be a popular place.", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "108045954813745347968", "name": "Nancy Detiveaux", "time": 1571164963799, "rating": 4.0, "text": "Very nice\nA lot of things to look at", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1579086455251, "rating": 5.0, "text": "Good eats and a unique gift shop. A must visit.", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "113420155767883939197", "name": "Lyndall H.", "time": 1520264029508, "rating": 5.0, "text": "Baker's on Main is located in the Cafe 336 building downtown. There are cute shops behind the restaurant and a huge event space. The shops vary, but home decor is featured in most of them. Many of the items are unique and focus on Lake living. There are beautiful hand made items. Check out the enormous event space. Make sure that the roll up door is not opened during your event. I took a class in there during the winter. The garage type door was rolled up and many of my classmates complained of being cold.", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "102249611835257450717", "name": "Curt Cearley", "time": 1521754598429, "rating": 5.0, "text": "Stopped in for a bite to eat. Good atmosphere, excellent bistro food, right on main Street, so perfect for people watching, and some very friendly staff. Try the Scoop and Soup!", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "108696566040463186303", "name": "Landon Upton", "time": 1595991667704, "rating": 1.0, "text": "Wasn’t very impressed with the food", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "103282598827344575069", "name": "Pixie Lent", "time": 1562505321560, "rating": 5.0, "text": "Very good coffee & snacks.", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "101679007993323825529", "name": "Hazel Gracelin", "time": 1531343448905, "rating": 4.0, "text": "I like to walk downtown sometimes and I always visit Bakers on Main!  But honestly it’s a tad overpriced and that’s not the greatest, but it’s super cool shop and it’s interesting to go there even if you’re just looking around!", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "106231482479434915322", "name": "Mary Phillips", "time": 1554510149071, "rating": 5.0, "text": "Nice event venue!", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "108807544934752843323", "name": "Skylar Nelson", "time": 1512093881270, "rating": 3.0, "text": "Cool setup for consignment store.", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "117008296144250979594", "name": "Nora Swords", "time": 1563654988557, "rating": 5.0, "text": "Great place!!", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "103837353724004024856", "name": "Billy McGathey", "time": 1518227382523, "rating": 4.0, "text": "Very quiet and cozy place", "pics": null, "resp": null, "gmap_id": "0x8889f8d462d4f2c3:0x4bb28e7f168f3512"}
{"user_id": "114036001689288832628", "name": "cherol bryant", "time": 1617596316240, "rating": 5.0, "text": "I love going there because I can find almost anything Im looking for in there at a reasonable price.Its a nice and clean place.I feel comfortable shopping there.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "115374235992814338518", "name": "Ed Holley", "time": 1602707070572, "rating": 5.0, "text": "I go in Rose's a lot, but not as much as I did b4 the Coronavirus.  Everyone I come in contact with are very nice, very helpful, dont mind taking time with me, and I thank them for that", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "106745235746414885894", "name": "Leanna Mctier", "time": 1594282627477, "rating": 2.0, "text": "I worked here it was not the best and it was not the worst but I will say never ever again. The store manager is rude and snappy and nobody cares about the employees. Or trying to make things right in certain situations.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "104169577738864705377", "name": "Cynthia Richards", "time": 1592183821621, "rating": 5.0, "text": "I LOVE THIS STORE U CAN FIND GREAT BARGAINS .ALL THE TIME AND ODD ITEMS ALSO CHEAP PRICES.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "113849125322755395109", "name": "Renee L.", "time": 1570157957449, "rating": 5.0, "text": "This is One of My Stores in Montgomery. The Cashier's are Very Polite. This Store has Amazing Deals.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "103454323763802803056", "name": "Erica Brown", "time": 1462023394819, "rating": 4.0, "text": "Love this store... Their customer service is wonderful. Its always neat & clean and they bargains are a plus!! They just can never get things back in stock once they sell out :(", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "106893661680493938772", "name": "Dee", "time": 1504701836822, "rating": 5.0, "text": "I absolutely love this store!! Great prices for your household needs as well as children's cloths and adults cloths. Has everything you could need in one stop.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "111765961077345536028", "name": "Agent M Phifer", "time": 1471778601445, "rating": 5.0, "text": "It was great. They had in stock the items that were being advertised. I really enjoyed the inspirational art and home interior items.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "104632180250851562507", "name": "Kimberly Burney", "time": 1545017534509, "rating": 5.0, "text": "I love it, big store and great prices.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "113420128850448081541", "name": "Valencia Hartwell", "time": 1419080627396, "rating": 3.0, "text": "Great.. The cash out lines are entirely too long.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "118045533329639775512", "name": "Enjoli M", "time": 1502754907984, "rating": 5.0, "text": "I gave them 5 stars so that it would be seen. The managers have TERRIBLE customer service . I love Roses stores and I didn't pay much for my items  , but I'll never shop at this location again .", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "103688858270751780431", "name": "Tiesha Rogers", "time": 1553046945472, "rating": 1.0, "text": "The time is now 8:50 pm why are ypur doors locked and closed. I'm annoyed because it would have literally taken 3 minutes to retrieve an item for her trip.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "112754681634230025635", "name": "Temika Robinson", "time": 1584576204932, "rating": 5.0, "text": "I love this store", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "102595986450856053312", "name": "Aleiyah Mcglown", "time": 1519519621406, "rating": 1.0, "text": "Long lines! Incompetent workers! Just terrible!", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "109592275515180360493", "name": "Cynthia Washington (Diamond)", "time": 1518396469917, "rating": 5.0, "text": "Great selection & affordable prices!", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "107967108477434004201", "name": "Tiffany Thomas", "time": 1541071872889, "rating": 5.0, "text": "Large variety great prices", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "107397262137449820847", "name": "Kelci Redmon", "time": 1563017400465, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "115172797999668208996", "name": "Rhonda Parker", "time": 1567870349170, "rating": 4.0, "text": "Cheap prices", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "102443385092989142516", "name": "Tamecka Monae'", "time": 1534429117672, "rating": 1.0, "text": "This location needs to improve their customer service.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "108837407282310059403", "name": "Red Roses", "time": 1581819990041, "rating": 4.0, "text": "Nice uniforms", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "105289765444952925255", "name": "Edythe Dansby", "time": 1532223633906, "rating": 3.0, "text": "It's like a Dollar general but bigger", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "106895905352517875358", "name": "Sherry Thomas", "time": 1539213912199, "rating": 5.0, "text": "Love This Place", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "118075863418558660610", "name": "Riketa Johnson", "time": 1536371877373, "rating": 5.0, "text": "They closed their store early only let certain people in because as I was getting back in my car after not being let in the store was clearly still open 15min til closing they had the doors lock but I seen someone else walk up they opened the door and let them in wow I gave them 5 stars so that it will be seen", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "105235703659028694616", "name": "Roneisha Murray", "time": 1562618566805, "rating": 1.0, "text": "This store is horrible...when you try to return something..they want take it back at all...it have the receipt and I have the tag...but they say the tag have to be on it and the item cant be used...that is crazy...something need to be done about this STORE!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "100149259308615634486", "name": "Earmy Napier", "time": 1505346078676, "rating": 1.0, "text": "I purchased and item from this store and it was broken", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "103966431461437646290", "name": "Cheryl Bryant", "time": 1503451364237, "rating": 5.0, "text": "It has everything I want.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "112144307885202303560", "name": "Marilyn Lyons", "time": 1499224588501, "rating": 4.0, "text": "Always can find the merchandise I'm looking for but checking out is always slow.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "103348163349100778749", "name": "Toni Peoples", "time": 1514849969980, "rating": 5.0, "text": "Very inexpensive", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "110607657868704985428", "name": "Maria R Sanchez", "time": 1484164841616, "rating": 1.0, "text": "Rude cashiers ! If your not happy with your job go home !", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "103675037897095438532", "name": "CECIL HICKS", "time": 1481876961805, "rating": 4.0, "text": "Descent place to shop", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "112138003126840036497", "name": "Callie McGhee", "time": 1471480626345, "rating": 5.0, "text": "It is nice and the employees are friendly", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "115809044358281274691", "name": "brittney t", "time": 1468792688565, "rating": 4.0, "text": "Clean store and restrooms with a lot to choose from but some cashiers aren't too friendly sometimes but not all of them.", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "100932464524958572406", "name": "Monica Chamblis", "time": 1467636949768, "rating": 5.0, "text": "Clean and great bargains", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "107714871864286287549", "name": "Mz Cent Brooks", "time": 1483384624106, "rating": 5.0, "text": "Deals prices", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "107049360191503635890", "name": "miguel montse", "time": 1482276789029, "rating": 1.0, "text": "The website isn't working", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "108048468894456035487", "name": "fred williams", "time": 1461357394037, "rating": 1.0, "text": "Rude, Rude, Rude!  Don't bother going to\nRoses in Montgomery AL!   I grew up going to Roses Department Store in Alexander City but  I will never go back in any Roses Department Store ever again!  BAD Management!", "pics": null, "resp": null, "gmap_id": "0x888c2a94d0f22edd:0xc8445e91c2b21b04"}
{"user_id": "116500476055824072478", "name": "Gayla Alex", "time": 1485359131174, "rating": 5.0, "text": "Nice store, very clean & they always have a great clearance. The jewelry section is awesome. We were also able to find my husband the dress pants he needed in a bigger/longer size.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "107213238494903535251", "name": "Kevin Davis", "time": 1459635287983, "rating": 2.0, "text": "Service is hit or miss. I place a lot of online orders to pick up in store and typically have no issues. Recently tried to pick up two, one of which was in the back. I told the cashier I was picking up two online orders after a purchase. She looked it up, and instead of picking up my items from the cage of online orders in the front, calling someone to grab the one in the back, and having me step to the side for two minutes (as would be common sense), she told me I'd have to go pick them up at customer service, which already had a large line, because she didn't want to hold up the people in line. Thanks to her, I lost about 40 minutes of my life standing in K-Mart.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "103103561445795491426", "name": "Jay Hill", "time": 1491235262335, "rating": 1.0, "text": "Say Bye-Bye to Kmart...  Long overdue shutting this one down.  No loss.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "100582489932207341563", "name": "Kay Jay", "time": 1448987333238, "rating": 5.0, "text": "I love this store. I have been coming here for years. Never had an issue with finding anything or the service.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "110734914394124576976", "name": "Pressy M", "time": 1475425934270, "rating": 3.0, "text": "Need more customer service, I had question on items...no help", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "105553918493679660660", "name": "aj jackson", "time": 1396277507569, "rating": 5.0, "text": "Great gt me were needed to go", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "105091000761210239302", "name": "Carl Burton", "time": 1498785058307, "rating": 5.0, "text": "The service was great. Thanks", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "101230954774171360662", "name": "Jim Oneal", "time": 1488756772897, "rating": 5.0, "text": "Going out of business... use to love this place", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "112165409607952455428", "name": "Robert Funk", "time": 1500123261256, "rating": 2.0, "text": "Gone and forgotten Kmart is no more.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "106485134425298575182", "name": "Richard Bowman", "time": 1498401113719, "rating": 3.0, "text": "They closed this store.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "111636032991734263898", "name": "E Poythress", "time": 1498236939011, "rating": 1.0, "text": "Closed down.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "113766418147625020392", "name": "obs squad", "time": 1497831180879, "rating": 1.0, "text": "They are closed down", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "103070367512638939830", "name": "tony Brooks", "time": 1497798586119, "rating": 5.0, "text": "Very awesome place", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "100194683380823316783", "name": "S. Strickland", "time": 1497660626978, "rating": 4.0, "text": "It's closed now, out of buissness.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "114660809245365216909", "name": "Tasha Brown", "time": 1494089048658, "rating": 1.0, "text": "This Kmart is no longer open.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "112652764169206926362", "name": "LORA Gaddy", "time": 1493407023991, "rating": 1.0, "text": "I wish they were still open", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "117011081999187609578", "name": "jamia battle", "time": 1491700610193, "rating": 3.0, "text": "Store closing. Almost empty.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "112271901859371434834", "name": "David Ortez12", "time": 1490232124539, "rating": 3.0, "text": "Nice!!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "117100109419260208290", "name": "Toni White", "time": 1489680090263, "rating": 5.0, "text": "They are actually going out of business", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "109462774013126896322", "name": "Bobby Patterson", "time": 1505353804593, "rating": 2.0, "text": "It's closed", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "103847285150402298826", "name": "calvert ford", "time": 1487691679788, "rating": 5.0, "text": "Will be missed", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "114228110262127802030", "name": "Sharnamekia Colón", "time": 1504210186712, "rating": 2.0, "text": "Thanks of business", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "103263284077301608259", "name": "Benjamin McAllister", "time": 1486226272662, "rating": 3.0, "text": "Going out of business.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "117830618666629944394", "name": "Mrs. jenkins", "time": 1485017501235, "rating": 3.0, "text": "Prices okay close to me", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "113944416313465843814", "name": "Sherrie Harris", "time": 1500047629592, "rating": 1.0, "text": "It's no longer exists.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "100282519968514383065", "name": "Lamar Walton", "time": 1482276436660, "rating": 4.0, "text": "Love my Kmart", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "115935959336983522051", "name": "David Harden", "time": 1493571983281, "rating": 1.0, "text": "It's gone", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "113759996123349442535", "name": "lydicake yumyum", "time": 1492467421638, "rating": 1.0, "text": "Kmart is no longer here.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "105345938623518441224", "name": "Trina Lindsey", "time": 1490111925095, "rating": 2.0, "text": "Store is closing", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "116624934207644268396", "name": "Marlon Barber", "time": 1488857442840, "rating": 1.0, "text": "They are going out of business and the sale prices are still high, cheaper at Walmart even with the sales", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "100743307615307837492", "name": "Winifred Osborne", "time": 1488178866675, "rating": 5.0, "text": "Will greatly miss this store.  To far to another one so now I have to shop at Wal mart", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "107345720944842025963", "name": "tanya morgan", "time": 1470360643863, "rating": 1.0, "text": "This Kmart bites...", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0x593cd9f3ef187b83"}
{"user_id": "117563956409784820123", "name": "Samira Jones", "time": 1609214505569, "rating": 3.0, "text": "Store had couple of friendly staffs.  Had everything that I needed", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "108503128676222492861", "name": "Joyce Cade", "time": 1590353275247, "rating": 3.0, "text": "Nice store. I enjoy shopping here. But, customer service is not good.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "118023840867862133703", "name": "Glenda Lee", "time": 1591997217187, "rating": 5.0, "text": "Love that we have one on the Eastside now!! My mom loves this store !! Oooook I do too!! Lol\nThey have a great selection on home and bathroom items, rugs, towels rags etc!!", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "108203003773942342572", "name": "Gail McLaughlin", "time": 1569431566063, "rating": 1.0, "text": "Three employees at the front by register and no one would check us out. No one acknowledged us.  Never  had that happen before. One was a manager.😞😞😞😞😞 I use to tell people to go there because everyone was so nice. Well I won’t go back and I will pass it along,", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "108559894907168414655", "name": "Demetrea Freeman", "time": 1591355194110, "rating": 1.0, "text": "Went with there with my children to complete our home, so I can finally sit down in peace.... but I say that, because when it came to putting the curtains that we came for... took our time to pick ... the package said 2 window panels., I only recieved one... the I paid in all\n. Over spent $108.and odd cents....\n\nI am going back to see about my curtains..... if not.... thenn....\n\nOther wise , beautiful people, in and out... u dont have complaints cause u listen to the hard difficult customer,  but her lofty hard, but an employee smile, and her world was changed.... from that smile\n..\nRoses employees helped safe my life.. thru curtains.\nOverall 5star shopping and saving... beautiful pieces", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "111548732179105225163", "name": "Katie B", "time": 1583381015399, "rating": 5.0, "text": "Nice and mannerly clerks, Great prices and always clean! Crestwood Roses A+", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "114336921471469297748", "name": "Johnny Harrington", "time": 1497451785744, "rating": 5.0, "text": "I got some amazing deals here! Target brand 16 piece dinner set for $15, a silk tie band pocket square combo, bunch of other stuff... Full cart! $100 or so. My girlfriend and I felt like bandits.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "108150381681216469750", "name": "Melanie Taylor - Coleman", "time": 1516855203860, "rating": 3.0, "text": "Good place to purchase discount items for your home. They were not stocked well my last visit. You get the service expected from a discount store. The store is clean. The parking lot is big. You have a red light to get back out onto Crestwood.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "102334469368648107644", "name": "Katie Gentile", "time": 1523310633342, "rating": 5.0, "text": "Just recently discovered this place,  and I live here!   Lol!   Great deals,  so you'll be seeing a LOT more of me!!!", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "111532495247387487092", "name": "Rusk Reeder", "time": 1499196043059, "rating": 4.0, "text": "A goos, low-cost store run by the same company that runs Dollar Tree. Larger selection.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "103399510360295871952", "name": "Karen Austin", "time": 1521323628033, "rating": 5.0, "text": "They are very friendly and great you with a smile and the prices are alsum.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "109536528660988607059", "name": "Julie Brown Bester", "time": 1535324067387, "rating": 5.0, "text": "Great prices especially on infant items ❤", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "101680951283689966910", "name": "Amelia Hinton", "time": 1506441177527, "rating": 5.0, "text": "It's a nice and clean store. Prices are great..p", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "104514992011407285487", "name": "Alice Booker", "time": 1521259132056, "rating": 5.0, "text": "Love this place. Wish there was one in San Antonio,  TX", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "110347913221091226640", "name": "Heather Johnston", "time": 1512908388843, "rating": 5.0, "text": "Place like ollie's. Nice. Affordable and convenient", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "116174715539129625616", "name": "qutypie Scott", "time": 1504874201397, "rating": 4.0, "text": "Good pruces. However, I wished they opened before 10.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "104373962518557044986", "name": "Tammy Williams", "time": 1491264353077, "rating": 5.0, "text": "great seleCtion.\ngreat Prices", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "107074527433638528198", "name": "shelicia tolberet", "time": 1555775058005, "rating": 1.0, "text": "The district manager and the store manager were very rude! I will never shop here!", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "110066589077742326221", "name": "Ismael Torres", "time": 1504653637622, "rating": 5.0, "text": "Good pricess and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "105353826306959542593", "name": "THE FIRE CHURCH OF THE PROPHETIC MINISTRIES", "time": 1518980661534, "rating": 5.0, "text": "Great shoping", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "111898902351887745540", "name": "alabama sarah", "time": 1514031572617, "rating": 5.0, "text": "Convenient. Fun place to shop.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "107101324541272037183", "name": "Kathryn jackson", "time": 1514423237372, "rating": 5.0, "text": "Very seldom is it that they don't have what I'm looking for", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "110767691679113470006", "name": "Kathryn Strozier Mcdowell", "time": 1521569668943, "rating": 4.0, "text": "👟👞👡👠👢👖🎽👗👓🌂💄and more", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "110778462756456046348", "name": "Christopher Morgan", "time": 1513627747797, "rating": 5.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "111847482248088467321", "name": "Yvette Truss", "time": 1517706601643, "rating": 3.0, "text": "Some of the clothing could better organized.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "103366626905897794753", "name": "Nett Willis (Netta)", "time": 1504018701575, "rating": 3.0, "text": "Ok..", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "113158379997000632351", "name": "Jimmie Thomas", "time": 1502558537029, "rating": 5.0, "text": "Great price", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "109659513871132098778", "name": "Kenneth Echols", "time": 1500868594853, "rating": 4.0, "text": "Like this place", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "110767691679113470006", "name": "Kathryn Strozier Mcdowell", "time": 1521569668943, "rating": 4.0, "text": "👟👞👡👠👢👖🎽👗👓🌂💄and more", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "106621409236880761845", "name": "Tabitha Hill", "time": 1513737976231, "rating": 5.0, "text": "Love prices", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "110778462756456046348", "name": "Christopher Morgan", "time": 1513627747797, "rating": 5.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "103350071468460222126", "name": "Tasha Garner", "time": 1512321868901, "rating": 3.0, "text": "Good finds", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "105680802219608413694", "name": "Tracee Morrison", "time": 1499292611891, "rating": 3.0, "text": "Not very organized.", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "113158379997000632351", "name": "Jimmie Thomas", "time": 1502558537029, "rating": 5.0, "text": "Great price", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "105816447561984231146", "name": "brenda frazier", "time": 1499754834894, "rating": 4.0, "text": "They was nice", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "100392115380902458762", "name": "Tonya Clayton", "time": 1494596072858, "rating": 5.0, "text": "Very reasonable", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "104011595680873232539", "name": "Dorothy Carter", "time": 1480667751979, "rating": 5.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "103366626905897794753", "name": "Nett Willis (Netta)", "time": 1504018701575, "rating": 3.0, "text": "Ok..", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "104011595680873232539", "name": "Dorothy Carter", "time": 1480667751979, "rating": 5.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "116332722841007910609", "name": "Tamecia Bester", "time": 1493681563180, "rating": 4.0, "text": "They got just about everything from clothes to household appliance like microwaves etc", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "100263081919334833041", "name": "Ernest Morrow", "time": 1518921932700, "rating": 5.0, "text": "Good store.....", "pics": null, "resp": null, "gmap_id": "0x88891061e13c4865:0xd285f7e0c18c0aeb"}
{"user_id": "109337468905442347194", "name": "R S", "time": 1622840784823, "rating": 5.0, "text": "Rachel at self check out did an exemplary job! I would gladly go out of my way to shop here, again.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108323308962360994494", "name": "John", "time": 1614128136585, "rating": 5.0, "text": "Clean, plenty of sale items, smart merchandising, and the store is always adjusted to a comfortable temperature. The added bonus of a pharmacy and a Starbucks, and you wonder when the Hair Salon aka Barber Shop will be added. Lots of things and time saving.👍🏻👍🏻", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115815682827665018173", "name": "Krista Mounsey", "time": 1609789905632, "rating": 5.0, "text": "This Target location is easy to get in and out of when you're in a rush. The employees are friendly and knowledgeable. I enjoy my shopping experience every time I visit!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111578309343495724888", "name": "Taylor Jalbert", "time": 1620263697696, "rating": 4.0, "text": "Love Target... hate this parking lot! You get trapped", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107543498956550700286", "name": "Stephanie Harbison", "time": 1618778714395, "rating": 5.0, "text": "Picking up my gift went so swiftly", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100811785394858158519", "name": "Debbie K", "time": 1609876112019, "rating": 5.0, "text": "I love the drive up/pick up services and know mothers and families will love this service. It's convenient, fast, and the employees are friendly!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "118056305947720736375", "name": "Marisa Kent", "time": 1613505215161, "rating": 5.0, "text": "This Target is always clean, well organized, and helpful. The employees are nice and efficient.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102845343062313385851", "name": "Samuel Shelton", "time": 1606837095990, "rating": 4.0, "text": "I placed an order online for pickup and upon arrival was confused where to park, there's no phone number to call once parked in Drive-Up parking space. Additionally, my order wasn't at the counter when I got there in spite of the fact I received an email stating that it was hours before. The coffee mugs I ordered were haphazardly placed in a bag with no cushioning and they clanged together all the way back to the car. I am not upset just disappointed and will likely never use Target's ordering anymore. Wal-Mart is much more user-friendly (not an employee of any business).", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113127915605836659958", "name": "Lynn Drake", "time": 1597775241229, "rating": 2.0, "text": "I'm not usually a Target shopper but was shopping for a family member at this Target, so therefore I don't know the setup.  I did ask many associates to help and the answers I got were \"see where that lady is standing as he was pointing down many rows down.  I said yes.  He said look around there\". There are many empty shelves.  I did get the last water bottle that I was looking for.  By the way, water bottles are in 3 separate areas of this store.  Why?   I finally went to the cash register where the attendant did take the time to look up the exact place to find my merchandise.  Definitely not a store I would shop at unless it was last store in town.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114594774804351927224", "name": "CTaylor", "time": 1600659674355, "rating": 5.0, "text": "Target in Daphne (employees) has done a great job of trying hard to meet the needs of the community throughout everything that's happened this year.....Thank you😊 and keep up the good work", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110218831332934651588", "name": "Karen Davis", "time": 1599878526299, "rating": 5.0, "text": "it was a good experience. done in a timely manner. polite salesperson", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115948263106543910131", "name": "Ashton Taylor", "time": 1583715849598, "rating": 1.0, "text": "Quality products at a fair price.\nHowever,  the price that rang up was higher than the posted sign.\nDiscovered the price difference while checking at out at the self checkouts.\nWent to service desk for refund of the difference.  While talking to the clerk a manager came up and interrupted my transaction to talk about a different subject to the clerk.  Never even greeted me even though were standing right next to each other.  Price Diff was refunded as a coupon so no take refund.  I asked for the tax as well,   by this time the manager had left so the clerk call her back up.  Again no acknowledgement or apology.  When clerk asked about the tax the manager rolled her eyes.  Told clerk to do it like a coupon refund and left.\nFelt like I was bothering the manager.....Well I guess I'll bother another retailer with my money from now on.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108230960579895274198", "name": "Adam", "time": 1603136959069, "rating": 1.0, "text": "I don't normally shop at Target, but I have been looking for a certian item and every store I go to is sold out.\nI started doing some online looking and noticed that the item I was looking for is also sold at Target. I went on the Daphne Target website to see if the item I was looking for was in stock. According to the online Target store, there were 4 left, in store and ready for pickup. So I drove down and went inside and started looking. Not being able to find it, I asked an employee about it and he told me that another guy came by the other day looking for the same thing, but they didn't have any. I'm not sure if that he meant there weren't any left or that Target doesn't even carry the item in store.\nI advised him that the internet said that there is several of this item in store right now according to the website. He said yea but we don't have it.\nThe item I was looking for is a $300 Oculus Quest VR headset. I understand if the website said one available, but showing four I didn't call before I drove down there.\nEither Target needs to update there website, once in awhile or the employee was lieing. Waste of time out of my day for sure.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106707745395939191795", "name": "Lisa Warren (Lisa C. Warren, Artist)", "time": 1599576517583, "rating": 5.0, "text": "Clean and quiet store. Staff is always helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108651957928208608112", "name": "Symentha McDonald", "time": 1602515096052, "rating": 5.0, "text": "I love the Target environment and good deals live there.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116746035669507568476", "name": "Jordan Ray", "time": 1602198703665, "rating": 5.0, "text": "Polite staff! Very well stocked target if I must say so myself.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109167931053919186281", "name": "Dominique Kline", "time": 1577905975819, "rating": 5.0, "text": "Welcoming environment and staff. I always enjoy going in, and I know I'll find something great every time. I'm also grateful for Target's fairly progressive policies and hope they act as a beacon for other businesses. Target keeps me coming back!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117011510438518113412", "name": "Jo Hewett", "time": 1594943095863, "rating": 5.0, "text": "They were well stocked with them specific items I came into the store for.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105483069876778988960", "name": "Ray Reynolds", "time": 1573503267719, "rating": 5.0, "text": "Such a wonderful store.  The Starbucks is GREAT. The electronics staff was very helpful in helping us decide on a television. We enjoy shopping here.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109865603522670107462", "name": "Dr. Ken W", "time": 1589347541332, "rating": 5.0, "text": "Quality selection, Clinically clean store, Excellent merchadising, Great traffic flow/floor plan layout, seamless checkout, always great friendly staff. Daphne has always been my favorite Target stores since its opening, and Ranks #1 in Target locations visited across multiple locations and states, which is consistent with friends and family visiting from all over the U.S.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110434064524303377678", "name": "Nina VDub", "time": 1578891119369, "rating": 5.0, "text": "Really nice Target. The store was updated and immaculately clean. Fairly decent selection of sizes in the clothing. Lately I have found Target's clothing really good.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101068746675833295879", "name": "Tim Allen", "time": 1593399222694, "rating": 4.0, "text": "The food selection is not great but will do in a pinch.Has great variety of merchandise", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102845388131106953643", "name": "Shawn Edward Gardner", "time": 1607275708747, "rating": 5.0, "text": "Target has a great selection of items.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117594243716796229545", "name": "Peyton Thompson", "time": 1613056925633, "rating": 2.0, "text": "too much red target is ye much clothes", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114455867196571572971", "name": "Rebekah C", "time": 1612670664600, "rating": 5.0, "text": "I found what I wanted", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101116035673623985192", "name": "Deanna Labarge", "time": 1601726813761, "rating": 5.0, "text": "The service was fast and friendly!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109667192778396181553", "name": "Michael Stevenson", "time": 1605926121314, "rating": 1.0, "text": "I was Christmas shopping for my grandson and there were signs everywhere 25% off 1 toy if you text a number which I did to receive a bar code which they said was invalid told me To go home and download the app and come back tomorrow real customer service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113265911900148091351", "name": "Lauren Dufilho", "time": 1587765211655, "rating": 5.0, "text": "I was really impressed with the customer service and how fast my order was ready.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107199189996650292398", "name": "Danielle Nicholas", "time": 1541024140884, "rating": 5.0, "text": "The 2 employees that helped me ( I wish I had gotten their names) were extremely helpful, cheerful & were happy to help - the gentleman went to get me a cart ( I should know better than to not get one at Target!) and the young lady helped locate items & even looked up items I was trying to find at other stores & on line! Great job by these to in the Home Decor area.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112134884711546303245", "name": "Michael Blackmon", "time": 1574955939935, "rating": 2.0, "text": "If you like over priced milk, bread, and toilet paper OR if you like buying broken electronics and having to wait 2 days before TARGET will swap them out, then this is the store for you.\n\nHINT: Don't buy a TV the day before game day. If it is broken you will be looking at a broken TV for \"a minimum of 24 hours before you can return it.\"\n\nI gave the second star for cleanliness.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104271282802942091114", "name": "Jh Tl", "time": 1576930961709, "rating": 5.0, "text": "Convenience.\nEasy to shop online and my order was ready within 30 min. Although they say 2 hours.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108403755542587641797", "name": "KINGCROC yt", "time": 1603125391004, "rating": 5.0, "text": "Friendly, clean store with a wide selection of items that are always in stock.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103326280286872970342", "name": "Kyla Kelim", "time": 1577261742624, "rating": 5.0, "text": "Daphne Target staff was exemplary during the week leading up to Christmas. Very smooth experience despite the crowds.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "118383003427742338137", "name": "Court Lane", "time": 1587604564104, "rating": 5.0, "text": "I have NEVER had a bad experience.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110699672722625420488", "name": "Lindsey Chaney", "time": 1524580868919, "rating": 5.0, "text": "Love the Target in Daphne, AL! I have a 75 year old grandmother that I care for and as soon as her and I walk into the doors it is like a breath of fresh air! The staff almost always comes to greet us, help us get her a scooter, and stores her walker away for us until we come back to retrieve it. We are always greeted with a smile! Love this place and so very thankful for the amazing staff that they have!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110317504045217078958", "name": "Yolanda Scott", "time": 1561730426384, "rating": 5.0, "text": "I am Always pleased with the things and markdowns at Target. Never an issue. I absolutely LOVE Target.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "118390688972111226617", "name": "Lionel Simms Jr", "time": 1558978902230, "rating": 5.0, "text": "This was a great location.  Remodeled and the team members at the checkout were very friendly.  If I lived closer to this location, this would be my go to store!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112499358291654986803", "name": "Joseph Adkins", "time": 1477389369563, "rating": 5.0, "text": "I went here to purchase a pair of boys dress shoes. There selection was limited, but this was to be expected. The shoes that were stocked were nice and I ended up purchasing one of these for a great price. I have always been happy with the clothes selection at target. Its never the cheapest, but they're very affordable, and the styles are always relatively trendy.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110419374469454117024", "name": "Brad Murrill", "time": 1537899888614, "rating": 4.0, "text": "The store layout is awesome. The new look is very sleek. Has just about anything you need household wise, it could use a bigger grocery section and a bakery, but other than that it has it all. The staff is always helpful and friendly and the new Starbucks is an awesome addition.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113437576734614425234", "name": "Lisa Davison", "time": 1578700000206, "rating": 2.0, "text": "Store has no inventory amd not very well organized. No employees available for help.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112144235544152765233", "name": "Kevin M", "time": 1575215981557, "rating": 5.0, "text": "Nice store. Staff is friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106201266275688769111", "name": "Robert “RobertO” Koen", "time": 1620608251865, "rating": 5.0, "text": "Friendly Customers", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113467272048707190671", "name": "Mark Sandbothe", "time": 1543764249129, "rating": 5.0, "text": "Shopping at Target, and using online pickup, combines the best of online shopping and local service. I'm glad that I am able to support the local economy and tax base while at the same time enjoying the convenience of online shopping.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111257726737606886668", "name": "Anita Bellue", "time": 1578532714721, "rating": 5.0, "text": "I like the quality of products offered at Target.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105683502559897888543", "name": "Abigail Carlson", "time": 1525654180648, "rating": 4.0, "text": "They recently remodeled the store and looks so much nicer and more modern. It is clean and generally low priced. The checkout lines mostly are quick and staff members are friendly. There is not produce.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113201579604041302758", "name": "Serena kay", "time": 1594636338313, "rating": 5.0, "text": "The store is inviting and fun", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112522799625107784576", "name": "Vickie Hill", "time": 1492702832486, "rating": 4.0, "text": "Target is my favourite store to visit in America. You can get almost anything here. The clothing range is really good and there's something for everyone. My son loves the toy department too.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106619691501719805926", "name": "Christina Cook", "time": 1551282756370, "rating": 5.0, "text": "I love shopping in target for all of my baby’s needs, target has some of the cutest baby items! I also love that I can order and pickup his stuff so fast and easy.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104221925987702607888", "name": "Jessica Cole", "time": 1442600323083, "rating": 2.0, "text": "This target sucks. It's dirty and picked through. The selection of anything here is sparse. Usually only 2 registers open and it would be nice if they could get with the times and make it a super target. I've seen my fair share of targets from living all over the U.S. and this one definitely gets 2 thumbs down.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105653130869185865170", "name": "manuela luna", "time": 1581914667034, "rating": 5.0, "text": "Good customer service from the associate Marcy", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114605335709584344683", "name": "Hope Mitchell", "time": 1543165333819, "rating": 5.0, "text": "It was so much easier than the Walmart site for me to select the items I needed for my elderly mother to pick up and not have to shop the store herself. I live in South Dakota so I could not do the shopping in person, but I atleast could do it  and her pick it up. She said it made it so much easier on her.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117761350818203513759", "name": "evie scopolites", "time": 1511640957635, "rating": 5.0, "text": "Best place to shop. Friendly atmosphere. Great quality prices too!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114845801442571556551", "name": "Comedian Mz. Lique", "time": 1577232301979, "rating": 5.0, "text": "Gret customer service, Ms. Mary is awesome", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107600928906898131225", "name": "Peter Russo", "time": 1473203267075, "rating": 5.0, "text": "Second Target in a row I found just what I was looking for. In this case, bubble wrap. I was impressed with the variety of sizes and quantities of bubble wrap and other packing materials. And it was open on a Sunday evening, when shipping stores were already closed. You go, Target!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101085950477058900919", "name": "Bob Dylan", "time": 1556207586355, "rating": 5.0, "text": "Great store, has a great selection,  a little nicer then most other stores in the area.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112186597924421150546", "name": "Kevin Palumbos", "time": 1550412096940, "rating": 5.0, "text": "I like the way the store is laid out after the recent remodel.  I do wish there was a larger grocery section at this location.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115635755557059186689", "name": "Beulah Glenn", "time": 1549840233575, "rating": 5.0, "text": "Great prices - customer service & excellent selection of merchandise", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106729633709826892787", "name": "Edward Stratton", "time": 1504720802196, "rating": 5.0, "text": "Target hits home. People are always friendly and I've never had any gripes to say about Target . I also like the fact they are big supporters of LGBT. I tend to shop here everytime I get a chance. Thanks Target and please continue to support outreach programs for LGBT.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106729633709826892787", "name": "Edward Stratton", "time": 1504720802196, "rating": 5.0, "text": "Target hits home. People are always friendly and I've never had any gripes to say about Target . I also like the fact they are big supporters of LGBT. I tend to shop here everytime I get a chance. Thanks Target and please continue to support outreach programs for LGBT.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103065450201355954047", "name": "Joan Kellis", "time": 1554051347701, "rating": 5.0, "text": "Fast efficient service! Items always in stock and priced well.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115635755557059186689", "name": "Beulah Glenn", "time": 1549840233575, "rating": 5.0, "text": "Great prices - customer service & excellent selection of merchandise", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107268664979671675104", "name": "Lauren Ancar", "time": 1522864083657, "rating": 2.0, "text": "Small store, no grocery, but more importantly the Starbucks baristas had me wait 27 minutes for a strawberry acai refresher + two waters. 🤦🏼‍♀️ I'd rather drive 3x the distance for a full service Target & better Starbucks.  🤷🏼‍♀️", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101918896787033721324", "name": "terry windham", "time": 1523533265238, "rating": 4.0, "text": "We went and purchased a item that was 41.46 on the shelf.  When we rung it up at checkout it said 49.99. The associate at register tool care of problem. But I just want to say . Check you receipt", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106184115217735824329", "name": "Terrie W.", "time": 1544529326448, "rating": 5.0, "text": "The overall experience with pay on line pick up in store was amazingly simple, thank you.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100839428163117326093", "name": "Kristen Brown", "time": 1547065667800, "rating": 5.0, "text": "Excellent customer service while returning a few items today, which can be so rare these days!!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106313484289483756919", "name": "Ryan Sansone", "time": 1502342935190, "rating": 4.0, "text": "The store is usually clean and I don't have to wait long at a register. They also now have self kiosks to scan your own items which is convenient when you only stop by for a few times.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117482333802509025496", "name": "G L", "time": 1496968919730, "rating": 3.0, "text": "Visited again after about two years.  Was unable to find the quality and variety in boys clothing i would purchase. I was looking for three items in particular. One in personal care, one in toys and some boys clothing. I left empty handed. Purchased all of the above further down the road. What happened?", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100009713911048132985", "name": "Parker Sweet", "time": 1475852759871, "rating": 5.0, "text": "Convenient, clean, and with a helpful and friendly staff. In other words, a Target. Would be even better if it had been built as a Super Target, but carries enough grocery items so that having one or two on your shopping list doesn't force you to go to Walmart.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117226439488826285664", "name": "Glass Fluff", "time": 1492695496238, "rating": 5.0, "text": "Possibly the friendliest Target I've ever been to. Clean enough, stocked alright, but it was the customer service that blew me away. A+.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117014302636210746761", "name": "Cheryl Morey", "time": 1540234811579, "rating": 5.0, "text": "Quality service on answering my questions and helping me find items in the store.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103720746009093328720", "name": "Lori Philipp", "time": 1533992979912, "rating": 5.0, "text": "Employees are very helpful and friendly and nice clothes, isles are spread out where you can go down each isle, and have nice wheel chairs for my mom.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116590703054606781215", "name": "Alison Harper", "time": 1587404349363, "rating": 5.0, "text": "It was so easy!!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108753433473197275234", "name": "JoHannah Miller", "time": 1515513693613, "rating": 5.0, "text": "Literally here every day. Absolutely love this place! Just wish they were a Super Target :/", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101772389145780473210", "name": "Zach A", "time": 1564529791042, "rating": 4.0, "text": "Always clean can never find anybody that is available here except cashiers.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107181999216797349806", "name": "Courtney F", "time": 1467313550215, "rating": 4.0, "text": "I love Target, but this particular store has some problems. It's not very clean; cashiers are slow; shoes are always jumbled and not well stocked. Cashiers rarely say \"hello\" or \"thank you\" or \"have a nice day.\" If there were another Target close by, I would go there instead.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105577053324996511962", "name": "Rob Co", "time": 1463084018768, "rating": 5.0, "text": "Friendly and helpful staff. Well-managed. Clean. Not busy. Good prices", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114338458288078315847", "name": "mike cottrell", "time": 1498361529445, "rating": 5.0, "text": "Just like other target stores it was clean, staff is friendly, and they sell quality items at a reasonable cost. Love the dollar spot.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117872534891709716097", "name": "Nancy Costa-Larson", "time": 1542401926757, "rating": 5.0, "text": "Quality product and customer service is great. Associates look like they really want to be there", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114564295917818349625", "name": "Grace Jennings", "time": 1495892453041, "rating": 4.0, "text": "I always love a good trip to Target. Got all of my items at reasonable prices, and spent time just browsing and seeing all the nice things in store.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108048750531785368656", "name": "Cassandra Jones", "time": 1576783718734, "rating": 5.0, "text": "Excellent service.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109596568896485858465", "name": "Beryl Adkisson", "time": 1507065606597, "rating": 5.0, "text": "The pharmacy  personell were very professional and the store was stocked well for the coming season as well as neat and clean.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113397195712814933257", "name": "Daniel Cales", "time": 1515800510415, "rating": 4.0, "text": "Clean. Great selection and prices. Short lines. Lost star for mens bathroom.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108126427130815183911", "name": "Lene Legrone", "time": 1499981003839, "rating": 5.0, "text": "I like Target in Daphne. They have so much and a big variety. You will not be disappointed in your shopping experience.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100227141178057479020", "name": "Joy Roll", "time": 1511553216735, "rating": 3.0, "text": "Target is a nice place to shop but the prices are crazy hi and I'm not just saying that", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110201543796959015748", "name": "Christopher LeCates", "time": 1437077772478, "rating": 5.0, "text": "I love me some Target! It's a good place to find anything you want or need. And none of that Wal-Mart trash of the lowest common ppl.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115972124346681872663", "name": "Chris Weinberg", "time": 1485108248967, "rating": 5.0, "text": "Employees are always willing to help, could use an extra cashier to speed up check out", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114997187112183682850", "name": "Lindsey Schneider", "time": 1492458043753, "rating": 5.0, "text": "Love this place.  They're clothes and everything decorative are great", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106272573433378461343", "name": "Mark Fox", "time": 1473259142370, "rating": 2.0, "text": "Like the quality of the products. Hate their standards and political views. They should have just kept their opinions to themselves and I would continue to shop their more regularly.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110516280139624383100", "name": "Brad Johnson", "time": 1532729635911, "rating": 5.0, "text": "Want a clean conscience for buying products from somewhere less evil than walmart and amazon? Go to target! Not nearly as many disabled people or dirty people here. I've never seen an alien in target either so I'm not sure if they have a ban on them or if they're just scared because of the logo. If you're freaked out by clowns you'll be glad to know that clowns dont shop here either. It's just understood, if you a clown you dont go in there. Rules people. Also they have sanitation stations everywhere so in the event that there's a vibrio outbreak this is a safe haven.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117009173194074262088", "name": "Flora Walton", "time": 1501316871207, "rating": 5.0, "text": "I just love it always find a good sale going on at a good reason price", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101694593128635878488", "name": "Debra Green", "time": 1539894002356, "rating": 5.0, "text": "So nice after the remodel! Lovely!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101599332685329939474", "name": "Tammy Mcmillan", "time": 1502830409901, "rating": 5.0, "text": "Love Target. Even though this one is smaller than I'm used to I always find more than I need!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115940674547850444995", "name": "James Jessee", "time": 1495128884121, "rating": 5.0, "text": "Great people. Great selection.  Great prices.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1466702238623, "rating": 5.0, "text": "Friendly staff,  clean store, and good clearance section.  No weirdos in the bathroom here :)", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109642844958274063474", "name": "Barbara De Zutter", "time": 1490655975179, "rating": 3.0, "text": "Good size store, staff not always very friendly and store can be a little bit cleaner", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114150196619366918346", "name": "Payton Rogers", "time": 1474027640580, "rating": 3.0, "text": "Typical Target, friendly staff and great products. Always well stocked and smells of popcorn.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113034730970842333611", "name": "curtis powell", "time": 1504481262048, "rating": 5.0, "text": "Love Target. Just need more in grocery to compete with Wal-Mart", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104010588147813289822", "name": "Zach Rutledge", "time": 1441138715096, "rating": 4.0, "text": "Cleaner, quieter and friendlier associates than Walmart.  Good basic store brands,  but the expanded grocery section is still no replacement for a full supermarket.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115301320234371128372", "name": "Rebecca White", "time": 1496902069758, "rating": 5.0, "text": "Love shopping here. Always enough registers opened. And very clean.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110463943490799135716", "name": "Rhonda Edwards", "time": 1498916372628, "rating": 5.0, "text": "Usually have even I am looking for...\nAssociates are always friendly and helpful...", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102198540780183355857", "name": "Thrifty Asian", "time": 1566239813134, "rating": 5.0, "text": "I love target!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105069085202163134227", "name": "Brian Dunbar", "time": 1468440921587, "rating": 4.0, "text": "Good store. Usually hard to find an employee in the electronics section though.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110469882920091437561", "name": "stacey morris", "time": 1577846819434, "rating": 5.0, "text": "I like the variety Target stores have.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104313971365860942329", "name": "Maria C. Cardoso", "time": 1570411938322, "rating": 5.0, "text": "Great place to shop", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107438330472166638869", "name": "Ericka Webb", "time": 1505542462438, "rating": 4.0, "text": "Love the customer service and the store is always clean.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111616192518904094137", "name": "Bo Tucker", "time": 1475761904789, "rating": 5.0, "text": "It's a well run Target, not much else to say.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111381875140223825276", "name": "Nathaniel “Ryan” Bowman", "time": 1505328200197, "rating": 5.0, "text": "Good selection of trendy everything at affordable prices", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115190526267208446728", "name": "Sandra Lott", "time": 1520517357579, "rating": 5.0, "text": "...very hospitable, customer concern very important, excellent products...", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111616192518904094137", "name": "Bo Tucker", "time": 1475761904789, "rating": 5.0, "text": "It's a well run Target, not much else to say.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112900661583643963574", "name": "Angela Praytor", "time": 1606399643518, "rating": 5.0, "text": "Friendly worker", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104797190693311760759", "name": "Candy Sanders", "time": 1544939651056, "rating": 5.0, "text": "Selection, cleanliness, friendliness of staff", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108103889226020463751", "name": "Ramona Szuch", "time": 1545159829733, "rating": 5.0, "text": "The Target employees are kind, and takes time to make sure your needs are met", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111270210830580724362", "name": "M Davis", "time": 1508779457448, "rating": 5.0, "text": "Always great prices & great customer service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "117945357240800850430", "name": "Bill Lynn", "time": 1506515732321, "rating": 5.0, "text": "For when you do not feel like going to Walmart.   Big store,  be prepared to walk.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101251673784539268706", "name": "Heather Rodgers", "time": 1448142954247, "rating": 3.0, "text": "I am an avid Target shopper for everything I can't get at Publix but their customer service year round (Alice) has me switching. You won't see my money anymore because I refuse to be treated with disrespect and be told to leave without my problem resolved.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102081287960428248112", "name": "Ginny Phillips Allen", "time": 1502302573996, "rating": 4.0, "text": "An older branch, not a Super Target. Great location.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116684913036173780143", "name": "Kelly F", "time": 1481462063944, "rating": 3.0, "text": "An okay selection. I usually struggle to find grocery items I am looking for, or I find it and find the price unreasonable. Usually neat and clean. Some friendly staff, although every time I am here the cashiers are slow and they talk extensively with customers when they should be ringing up the next one.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106136716529599084545", "name": "Sally McGill", "time": 1468344131551, "rating": 5.0, "text": "always a delight shopping here and great customer service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104797190693311760759", "name": "Candy Sanders", "time": 1544939651056, "rating": 5.0, "text": "Selection, cleanliness, friendliness of staff", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109532427319451744825", "name": "ana holloway", "time": 1546399730365, "rating": 1.0, "text": "In store pick up was not a smooth process. I had to wait 20 minutes to pick up my item that i could have carried out myself. Due to it being a 50 lb box. The customer service people were hanging out behind the counter joking and laughing...not sure why they couldn’t help carry out the box, since i was waiting for a two person team to be available, and there were three of them...", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103196395420082079960", "name": "Jacob Gay", "time": 1501826018997, "rating": 5.0, "text": "Relatively quiet place to shop. Plenty of things at good prices with lots of stuff on clearance.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108928175127564328046", "name": "Lauren Rather", "time": 1468413703709, "rating": 5.0, "text": "It was very clean quiet and had what I needed", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104467770566017158533", "name": "Carri Robbins", "time": 1480518717411, "rating": 4.0, "text": "Employees are awesome, great prices. Gave 4 stars because it doesn't have a Starbucks", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102323867335649004210", "name": "Elizabeth Moody", "time": 1482121417705, "rating": 4.0, "text": "Target is great for clearance items! Get cartwheel.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104878314429483042850", "name": "Amanda Patterson", "time": 1573568868870, "rating": 5.0, "text": "Always a great experience", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105482504007042676564", "name": "Stacie Smith", "time": 1548130369096, "rating": 5.0, "text": "Daphne, AL Target is amazing and so is their staff!!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103564706012986974213", "name": "Tonya Jackson", "time": 1485360331787, "rating": 4.0, "text": "Great service and very clean. Some of the location of items is confusing, but not a huge deal.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115315504816943649933", "name": "Chirleen Evans", "time": 1542308550324, "rating": 5.0, "text": "Great store, friendly staff!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114521856359966312839", "name": "Amanda Sayre", "time": 1464279572237, "rating": 4.0, "text": "Always has cool and new products.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108995767960359271412", "name": "skiebluedragon", "time": 1487806027660, "rating": 4.0, "text": "A nice clean store, with good selection.\nHas some grocery items but isn't quite as big as a Super Target.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "106642551584418241299", "name": "Barbara Whitney", "time": 1515800035757, "rating": 3.0, "text": "They need to open more registers at the Daphne, Al store. I waited 15 mins in line.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102332812733423874439", "name": "Barry Parks", "time": 1510269905502, "rating": 4.0, "text": "Had exactly the item I was looking for. Walmart didn't.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102219682365639972744", "name": "Wise Living Real Estate", "time": 1539726096634, "rating": 5.0, "text": "It was quick and easy!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109489623297997962267", "name": "Jonah Elliott", "time": 1567346257794, "rating": 5.0, "text": "Yay.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102988794757808587116", "name": "Jenna Hanson", "time": 1534427767353, "rating": 5.0, "text": "Staff is incredibly nice", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110622687313954098128", "name": "Cherry Connolly", "time": 1578102584906, "rating": 5.0, "text": "Always friendly", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103518200715222615118", "name": "Mary Haring Purvis", "time": 1564423970083, "rating": 5.0, "text": "Convenience", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "103817313127363256122", "name": "pavan madadi", "time": 1486530647236, "rating": 5.0, "text": "Nicely organized and neat store", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100806532766669079585", "name": "sherry hoggle", "time": 1544493542251, "rating": 5.0, "text": "Fast courteous service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111347412005630173979", "name": "Amanda Wilkins", "time": 1496450713540, "rating": 5.0, "text": "Clean and tidy, with a helpful staff.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100984541266541026387", "name": "Matthew Turney", "time": 1498068365116, "rating": 5.0, "text": "Clean and well staffed.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102702334398642341193", "name": "Rachel Wilson", "time": 1538679045781, "rating": 5.0, "text": "Always great selection, great service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105265622025107940403", "name": "Jenny Shrider", "time": 1541100740357, "rating": 5.0, "text": "Location", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112177562208591739457", "name": "Colleli Family", "time": 1546215152066, "rating": 5.0, "text": "good fast service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115725699583394171116", "name": "Mandy Pitts", "time": 1391971608368, "rating": 5.0, "text": "To Whom It May Concern:\nI wanted to write and thank the staff  at my local Target Pharmacy in Daphne, Alabama.  Yesterday, 2/8/14, I showed up at the pharmacy a few minutes after 5pm.  They were closing down for the day, which I was unaware of, but the manager, Marie and the pharmacist agreed to fill my Rx.  They could have easily sent me away, but they  were generous with their time and stayed to help a mom who desperately needed some medicine for a sick child.  Unfortunately, several problems arose due to my child being a new patient, with new insurance.  But they never gave up.  And my child received a much need night of rest.  I wish I had thought to get the young mans name that worked so hard to get this filled, because I would surely like to recognize him personally.  I know working in the service industry can be an often thankless job, so I just want to say thank you to both of them for going above and beyond the normal protocol.\nSincerely,\nJulie Pitts", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109136000829144180607", "name": "Katrina Edmond", "time": 1549233620816, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111605843562473545488", "name": "Scott Lee", "time": 1514077623535, "rating": 2.0, "text": "Limited selection.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116108093062964038589", "name": "Cheryl Connor", "time": 1516510897796, "rating": 2.0, "text": "Confusing.  It's a mess till they get the store in order", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109438464568823413960", "name": "albert reynolds", "time": 1485193118923, "rating": 4.0, "text": "Clean store. Typical target nothing out of the ordinary.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102298869491319587385", "name": "Dean Goodrich", "time": 1489264275486, "rating": 4.0, "text": "If this place sold wine my wife would never leave.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116108093062964038589", "name": "Cheryl Connor", "time": 1516510897796, "rating": 2.0, "text": "Confusing.  It's a mess till they get the store in order", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111950091377019472665", "name": "Deb Abbott", "time": 1512842212497, "rating": 1.0, "text": "Have no idea why Target stores give me the creeps!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107765119874069676877", "name": "Loni Jarman", "time": 1497027395756, "rating": 3.0, "text": "Aisles are always blocked with employees restocking. Wish they did this at night or at least at a time when store isn't busy", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112848349973165596998", "name": "Lesia Bishnoi", "time": 1513113159664, "rating": 3.0, "text": "Long lines,elderly and handicapped people waiting a long time", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108569645438287535987", "name": "Chasity Covington", "time": 1491531541781, "rating": 5.0, "text": "Big store lot of selection", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112751482765532534337", "name": "Everglades Wolfman", "time": 1503343740995, "rating": 5.0, "text": "Polite helpful employees", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110302950877034838636", "name": "Bridgett Kelley", "time": 1499989321564, "rating": 5.0, "text": "Love everything about this store", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101824317874727922495", "name": "Alan Brady", "time": 1495578034700, "rating": 5.0, "text": "Fast friendly service", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105625539903124361764", "name": "scott flannigan", "time": 1500841039999, "rating": 4.0, "text": "Bullseye retail location. Has everything is you need.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "118093375870263419107", "name": "James Bailey", "time": 1494245283614, "rating": 5.0, "text": "Standard target", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "101741824331860043416", "name": "Michelle Turnage", "time": 1491876245919, "rating": 5.0, "text": "Airways live shopping here.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108569645438287535987", "name": "Chasity Covington", "time": 1491531541781, "rating": 5.0, "text": "Big store lot of selection", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "102298869491319587385", "name": "Dean Goodrich", "time": 1489264275486, "rating": 4.0, "text": "If this place sold wine my wife would never leave.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112751482765532534337", "name": "Everglades Wolfman", "time": 1503343740995, "rating": 5.0, "text": "Polite helpful employees", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109438464568823413960", "name": "albert reynolds", "time": 1485193118923, "rating": 4.0, "text": "Clean store. Typical target nothing out of the ordinary.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111158768999842514028", "name": "Gregory C. Davis Sr.", "time": 1501882674297, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111173223407971648942", "name": "Sandra Rowland", "time": 1501901231691, "rating": 5.0, "text": "Clean,good variety, nice workers", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115917261798304658257", "name": "Oscar Bonilla", "time": 1501633500429, "rating": 5.0, "text": "Very friendly personnel", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111221441971390183128", "name": "Peter Rambacher", "time": 1481119166205, "rating": 4.0, "text": "Seems like everything here is on sale.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "107765119874069676877", "name": "Loni Jarman", "time": 1497027395756, "rating": 3.0, "text": "Aisles are always blocked with employees restocking. Wish they did this at night or at least at a time when store isn't busy", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116444873586591049468", "name": "Q Watson", "time": 1503919423925, "rating": 4.0, "text": "Sale prices are great!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "109281639250318060969", "name": "Tracey Beaver", "time": 1495758931150, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "105771901063495055842", "name": "Amber Starr", "time": 1509632720822, "rating": 5.0, "text": "Great prices!!!! Great costumer service!!", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "110302950877034838636", "name": "Bridgett Kelley", "time": 1499989321564, "rating": 5.0, "text": "Love everything about this store", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114377826037160743168", "name": "Melody July-Watkins", "time": 1491743749084, "rating": 4.0, "text": "I like Target and it's like all others, except that most of the staff is placed near the front of the store. Difficult to find help sometimes.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108277381472980648922", "name": "Jayson Anderson", "time": 1474828265374, "rating": 5.0, "text": "GREAT shopping.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100651302785902767933", "name": "E H", "time": 1471748373435, "rating": 5.0, "text": "Friendly every day", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "115055753427444391448", "name": "lisa lynn", "time": 1471129980802, "rating": 4.0, "text": "Clean, friendly, make sure to use the Cartwheel App to save money.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "100076692583803125723", "name": "Aaron Yanuzzi", "time": 1469139616916, "rating": 4.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "104929268702643311533", "name": "Donald Bowler", "time": 1484255743404, "rating": 4.0, "text": "Nice people.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "114096623957091116319", "name": "Ryan S", "time": 1482556775215, "rating": 3.0, "text": "Selection is rather small compared to other Targets, but friendly staff makes up for it.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113266944617904744591", "name": "Jonelle Bryant", "time": 1482087978085, "rating": 1.0, "text": "More expensive than it should be", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "111148197223590432035", "name": "Guilaine Firth", "time": 1459623132089, "rating": 5.0, "text": "It is so Awesome", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "108473848340450121173", "name": "Tr Clevenger", "time": 1472909684693, "rating": 3.0, "text": "Associates not to helpful", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "112579167506830462581", "name": "Fran Teeman", "time": 1412516686171, "rating": 2.0, "text": "Staff sucks", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "116207198744718593041", "name": "A Anderson", "time": 1422815293301, "rating": 1.0, "text": "There is no Target at this location. see street view.", "pics": null, "resp": null, "gmap_id": "0x889a417fd10fd647:0x2b449aa842f4c8d6"}
{"user_id": "113557915729490471890", "name": "I.wont. zip.it2021", "time": 1608026796267, "rating": 5.0, "text": "Love this store! Always priced good and constantly rotating clearance items. If your looking for a unique gift or a new piece for your home this is definitely a shop to stop by. Friendly staff, store is clean and pleasant to shop in. Highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "111420140753122290102", "name": "Heaven Bound", "time": 1612419119406, "rating": 5.0, "text": "I enjoy looking around at the unique Italian food items especially that have arrived. One dear lady, Sheila, is very knowledgeable about the products, she helped me plan two meals and shared a couple recipe suggestions too. I respect that she never pushes anyone, only provides as much assistance as a shopper wants. The store is neet and clean.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "104457686715532543174", "name": "Samuel E DiPiazza, SR", "time": 1607464224384, "rating": 4.0, "text": "Lots of nice gifts. Name brands at good prices. Bought most of our Christmas gifts.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "103423938730894487539", "name": "Tanisha Foster", "time": 1599500484032, "rating": 2.0, "text": "Not a location that I will shop again. I felt completely invisible in this store. The store representatives walked around and didn't say a word.  No greeting when I came in, no acknowledgment as I walked around... No nothing. Oh well, there is another location on 72 in Huntsville.   If Customer service is not your thing, look for something else to do...", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "114376567234343180206", "name": "Dee Alexandria", "time": 1603645386469, "rating": 5.0, "text": "Sheleesa, Megan, and Shaina are so warm, caring, and delightful. The items are priced well.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "102609387037721446278", "name": "Judy Fortune", "time": 1599947969564, "rating": 5.0, "text": "Has some very nice home decor items.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "108765678997543373513", "name": "Deborah S Epperson", "time": 1575839885848, "rating": 5.0, "text": "I've always shopped at Tuesday mornings. They closed my store. Was nice to find one. They have something for everyone there.\nFancy items at great prices. A must see if you haven't been there.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "101826178571009477164", "name": "Marilyn Warner", "time": 1607373221792, "rating": 5.0, "text": "Great place to buy lamps", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "118438157361899086142", "name": "Kathy Gifford", "time": 1590958424735, "rating": 5.0, "text": "Always a fun place to shop! ❤", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "114605113102578290364", "name": "Gamma Grandma", "time": 1550649122223, "rating": 5.0, "text": "I love this place, you can spend 5 minutes or an hour and nobody is hurrying you or pushing you to buy anything. Great place to find what you need for your home, a gift, or hobby. Great Customer Service.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "116665337057824443877", "name": "Vianca", "time": 1580392530178, "rating": 5.0, "text": "One of my favorite TMs.  The store is always neat and organized.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "109055769630951147109", "name": "Richard McLaury", "time": 1592344099708, "rating": 4.0, "text": "I have not been there since Christmas  but today I was impressed by everyone wearing masks, shoppers and employees. I found 3 items I needed, aisles marked  for 1 way ,plus 6 ft. Remainders every aisle\nI wish more grocery stores patrons and employees would use masks.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "102814343873353738381", "name": "Vani Way", "time": 1572912295361, "rating": 4.0, "text": "Good stuff. Always out of stock.\nA little pricey", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "100287401591993626670", "name": "kathy fitzgerald", "time": 1538323868392, "rating": 5.0, "text": "Bought some yarn for a project at a local Tuesday Mornings n Huntsville. It called for three skeins. I needed more.  Went to checking around and couldn’t find it. One last check at the store on County Line Road. 😕 Was asked when I was leaving did I find everything? When I told them what my problem was she gave me info on product locater. I have tried everyday with no luck. Today it is telling me they have the yarn I am looking for!!! 🙂 Now to complete my project. Thank you Tuesday Mornings in Madison, Alabama on County Line Road.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "103605883464165775036", "name": "Sue", "time": 1593805526618, "rating": 5.0, "text": "Always helpful staff", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "100761976214908395391", "name": "Vic Robertson", "time": 1473018387701, "rating": 5.0, "text": "Their small food section is my favorite part of the store. I love their German mustards, the gourmet peanuts, the olive oils, and the preserves. There's more that I can't think of at the moment. All of these delicious things are at very low prices.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "114324551232494600637", "name": "shane Gadomski", "time": 1599943386344, "rating": 5.0, "text": "Everyone was very friendly!", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "100730016548943239380", "name": "Amanda D", "time": 1529148602852, "rating": 4.0, "text": "Tuesday Morning is always a hidden treasure to me. I'm always pleasantly surprised by the amount of home decor and varriety of products they sell at a discount!", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "115140292454134123903", "name": "Lee-Anne Hooks", "time": 1582677510654, "rating": 5.0, "text": "Lots of beautiful stuff!", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "112924194406594378551", "name": "Alisha Black", "time": 1494336427424, "rating": 5.0, "text": "Nice stuff. Moderate prices. Good service.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "103781568347132061522", "name": "Kim Tannehill", "time": 1485853273048, "rating": 5.0, "text": "Staff is nice and I love finding fun things for my house or friends that I can't just buy anywhere.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "108719735661307584220", "name": "Kathren York", "time": 1543083188429, "rating": 5.0, "text": "We'll organized and very fun stock!", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "110042094839970022471", "name": "lil code13", "time": 1512827572301, "rating": 5.0, "text": "I just recently went in Tuesday morning and I immediately fell in love with this store it has wonderful gifts and I love everything about it", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "111965857372478725787", "name": "Juanita Washington", "time": 1479156026499, "rating": 5.0, "text": "Everytime I stop in this shop i spend and hour or more shop is clean staff is wonderful. Awesome finds.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "108264734014017338075", "name": "Yousra Fouani", "time": 1509217272264, "rating": 2.0, "text": "They are happy to take your money but are very rude when return time comes around.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "115191016364981229961", "name": "Kathryn Justice", "time": 1569998363388, "rating": 5.0, "text": "$300 pot for less than $100", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "103580848253759281518", "name": "Cindy Yeary", "time": 1515932937062, "rating": 5.0, "text": "friendly folks!  store is neat and clean.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "115872395763798466763", "name": "cynthia homer", "time": 1516504147860, "rating": 5.0, "text": "Nice place for bargains.", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "116884109401019470329", "name": "Andre P Stone", "time": 1576970531847, "rating": 4.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "106885506381440820503", "name": "Mel Pedersen", "time": 1554935310790, "rating": 3.0, "text": "Hit and miss", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "117338579077674951259", "name": "Julie Pleinis", "time": 1494935753606, "rating": 4.0, "text": "Always finding treasures", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "101044350752113202718", "name": "sarah lustig", "time": 1515184969996, "rating": 5.0, "text": "Wonderful shopping at affordable prices", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "105752297747491528258", "name": "Jimmy McMurry", "time": 1514896876569, "rating": 5.0, "text": "Average junk store", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "110176190549816936822", "name": "Debbie Dailey", "time": 1491101515472, "rating": 5.0, "text": "Great bargains", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "115544687261012060087", "name": "Hector Murrieta", "time": 1576437337002, "rating": 4.0, "text": "(Translated by Google) Good shop with household items\n\n(Original)\nBuena tienda con articulos para el hogar", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNa8wBt9joxnoHF06pN8eu9zW-KpI69LvqokmuF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPY5au5WbhbMSFu3VYcmYnhjcNAptppgO9bgeGD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbxEijIt7ZH3SYm27uI8NnjW3g85SGCQdrdw5l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNaM0_RJ1a01sIiPh3ujS74FahWxzoJGKstbV7Q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUmx7k9HHuQxbk_1_fY_I9cfk3tF-efG4aeOrM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOoDwn6PSGD7rAYQhRzvPRoitbR0M_iDXEbyl9n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORseyjfARvlcTnyEV3pYejs8S3xEkffnT-G8eF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeAHD2tG_W5E-K5nKKzq6PPn8LzBO6k43FwL0-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxRc-H2hJZWqNpnB-u5a6uRHGJI5s45t5YJ81b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-lGIskRT1PfXwtMosUNbVvSChhP9zvwPsxRvi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMOvehZ_P3Ka9AU-dV5DUee7Lk0dkBurcqh2S4y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "108185447245797229631", "name": "carmen velez", "time": 1584196751205, "rating": 5.0, "text": "(Translated by Google) Very good prices, service and kindness\n\n(Original)\nMuy buenos precios, servicio y amabilidad", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "103630993676638798092", "name": "Tina Crim", "time": 1518997526994, "rating": 1.0, "text": "(Translated by Google) More like a meets store\n\n(Original)\nMore like a treft store", "pics": null, "resp": null, "gmap_id": "0x8862642a24f3fd5f:0x8c7a864c83f51abb"}
{"user_id": "110202877620428315578", "name": "Quentin McMulllen", "time": 1505198512148, "rating": 5.0, "text": "Even though the one in my town is going out of business, I have always enjoyed going to Kmart. So if you can catch them before they completely close hope, you have a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "117152690846487455246", "name": "Andrew Heller", "time": 1481482308208, "rating": 3.0, "text": "It is an older dated building that has some damages due to its age. The front off the store had some trash around the indoor carts but mostly flyers. Some isles are too close together and a little cluttered. The prices are slightly higher than Walmart but the staff are extremely friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "107745057926747874932", "name": "Devon Adams", "time": 1499607270268, "rating": 2.0, "text": "Other than the Mcfarland mall, it used to be the place to go.  20 + yrs Walmart came back and destroyed them. The K tried to partner with Sears, but neither are doing to well.  Saying good bye Kmart", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "105908917596806409559", "name": "ginger on a journey", "time": 1500424845306, "rating": 5.0, "text": "They have great deals including clothing and movies, as well as food and back to school supplies. I just found out this location is closing soon :(", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "106470819761102620512", "name": "Holly Tritt", "time": 1484330062324, "rating": 5.0, "text": "Nicest and biggest Kmart I've been to. Staff was very nice", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "103276109737115274230", "name": "PATRICIA BARR", "time": 1505507479689, "rating": 3.0, "text": "Kmart is closing so there was only scattered inventory left. This was not unexpected but I was disappointed in the prices.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "104423268978930948998", "name": "Julia D", "time": 1489608421457, "rating": 3.0, "text": "Kmart has ok prices, but customer service is not good.  Cashiers not really friendly.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "116991023155130235307", "name": "Lanora Bayer", "time": 1481986652575, "rating": 1.0, "text": "Poor customer service.  Need desperately to train cashiers how to be quick and efficient when checking out customers.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "115294100338396528060", "name": "Christen Cichoski", "time": 1478641078617, "rating": 4.0, "text": "It was near and organized. The staff was very friendly", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "103003102243370641582", "name": "Alex Park", "time": 1489677175317, "rating": 3.0, "text": "Good prices on items available.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "107866715675056139487", "name": "C Porter", "time": 1506016741760, "rating": 4.0, "text": "Locations going out of business in October 2017 will miss the location give us a better location than going to Walmart all the time.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "113775466653544681096", "name": "John Maxwell", "time": 1495545301656, "rating": 5.0, "text": "Awesome store great staff", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "104324890180771139430", "name": "Linda Tidmore", "time": 1494204536228, "rating": 4.0, "text": "Good stock selection.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "106224559849449649969", "name": "Barry Hughes", "time": 1504556503109, "rating": 5.0, "text": "Glad it's closing. Bad service.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "118437003172026467709", "name": "Jack Duncan", "time": 1488453000466, "rating": 5.0, "text": "It may be the last Kmart in the world. Hang in there fellas!", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "117373021050403467444", "name": "Norrisa Eatmon", "time": 1507168598485, "rating": 2.0, "text": "Store is officially closed.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "111751767366132022440", "name": "Shirley Gordon", "time": 1506464555183, "rating": 3.0, "text": "Going out of business in 6 days", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "107902519599959082092", "name": "Victoria Maddix", "time": 1505165903341, "rating": 3.0, "text": "Prices not that much discounted yet", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "116979087104424789452", "name": "J Frost", "time": 1503492942299, "rating": 1.0, "text": "If it's not closed now, will be soon", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "105002495648989170116", "name": "Melinda Jacobs", "time": 1501758230115, "rating": 1.0, "text": "Always nasty and can never find what you need", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "116604335124031222156", "name": "ANN Gulsby", "time": 1501423364359, "rating": 1.0, "text": "Messy", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "103618359131053675469", "name": "Allison Russo", "time": 1500600058482, "rating": 3.0, "text": "Dirty, nothing was organized, going out of business.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "109956590333851989651", "name": "Fox101", "time": 1537920869601, "rating": 5.0, "text": "I miss Kmart it was the only place that I can afford to buy furniture from.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "100751482453804818719", "name": "Melissa Howell", "time": 1499660304097, "rating": 3.0, "text": "Not a lot of help.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "110124554774889769146", "name": "Cynthia Hubbard", "time": 1497196374896, "rating": 5.0, "text": "Great Services", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "117472264846449790586", "name": "Ella Hood", "time": 1493386184867, "rating": 2.0, "text": "Long lines with 1 cashier", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "104198276641527284174", "name": "Mickey Sweatt", "time": 1504276377205, "rating": 1.0, "text": "Going outta buissness", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "101866512056334497825", "name": "Chelle11", "time": 1504176349983, "rating": 1.0, "text": "Real dusty in the store", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "109787547575895002464", "name": "Carolyn Mccollins", "time": 1502155060517, "rating": 4.0, "text": "Love this place", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "101844217387856399697", "name": "Sunshine Playz", "time": 1502043380007, "rating": 5.0, "text": "Great but it is closing", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "108584579415603057650", "name": "Shane Caton", "time": 1501492186455, "rating": 3.0, "text": "Typical K mart it's closing", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "102669063135783137774", "name": "Denise Britten", "time": 1500813227613, "rating": 3.0, "text": "This store is closing in October, so it very crowded and busy", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "101438341723896626780", "name": "Damien Reacts", "time": 1435026687728, "rating": 5.0, "text": "Great store to work and shop at", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "107929376382629063035", "name": "Katrina Goss", "time": 1479737571340, "rating": 5.0, "text": "Loved shopping here", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "113019135322033589664", "name": "veneisha mills", "time": 1476473859324, "rating": 5.0, "text": "The rewards points really help.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "112780486081963626045", "name": "Josh Salters", "time": 1475430962287, "rating": 4.0, "text": "Store is old but the workers really try to do everything they can to help you", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "112635867833588667848", "name": "Bad News Brown", "time": 1484094643277, "rating": 3.0, "text": "Very clean store.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
{"user_id": "104470294657136426885", "name": "Nancy Lawrence", "time": 1498040613965, "rating": 5.0, "text": "Great prices.", "pics": null, "resp": null, "gmap_id": "0x8886020c5d37b8df:0xb28d60a6a3a0839f"}
