{"user_id": "107711991461897190389", "name": "Adrian Breedlove", "time": 1623864025972, "rating": 5.0, "text": "The crew at Middle Tennessee Hot Air Adventures is top notch. I booked a flight for my wife's birthday, but it had to be rescheduled due to weather. TN Balloon doesn't control the weather, and like Logan said this morning while we were soaring over Williamson County, \"I'd rather be on the ground wishing I was in the air than in the air wishing I was on the ground.\" The entire crew works hard to ensure your ballooning adventure is a great memory for a lifetime, so we were happy to reschedule. This morning we arrived at the meeting point and were whisked away to a launch site. When the balloon was ready, we took off just in time to see the sunrise over the horizon. Floating over Williamson County was an amazing experience that our pilot Logan made seem effortless. He explained the theory & science of balloon flight, the controls, and what to expect with an easy professionalism. The entire flight was something that we'll remember forever, and experiencing what seemed like a precision touchdown was awesome.\nIf you've always wanted to float above the earth while hearing everything below you and around you, then I highly recommend TN Balloon. They stay booked up, but it's 100% worth the wait. We'll definitely fly with them again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsYSF91vKWDfwr4OoJtk3bSqheOYqSkR1ZVWut=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTVv25_ABynAY2ur3QVSk6naBgD8ohJsyPCPuC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh0Zg_QpGVLWgKFaDyR4_vzXcLXVE4V7pamnej=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfRqG6PNRrIA-_7SUWmap0R_C0SfFG6LPh-_-H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzpIEtmpCLIXlJsgi_DguK46hfN1meO0fdX1eQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeWeEcAnhhkfzGpi_LbSKF0baJ0AQ9CjAXj_1u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN17F6oeha5tZsaTBF8xXS4nRS_t2A4CPM7dbvh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOW7QjT2oKw_8ob3uf2Vv5NDhaxRqro4I2NMGuu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOmzRg7jPf8TjtMxZtCVwrQ69ux2gjsdosPqpX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "108149841516168486328", "name": "Lisa Berry", "time": 1621891098566, "rating": 5.0, "text": "The flight was amazing.  The crew verified the night before (sunrise) flight was good to go.  They were prompt at the pick up site.  Gave a good safety brief and had the balloon ready to go in no time.  Due to no fault of the crew flight had to end early.  They handled everything quickly and safely.  The pics were great.  You can tell they love what they do.\nDefinitely will do again for the sunset flight.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMVJC-Vwui_NCux1ryFLecWnCpoTyQam7_TmLG6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_fQIh83YJKj9GZNtLDSM3AnDmXw7Gb9P66m26=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNfPaRUxI-4O5tt3AnU0-phkGzbzDdpCIRXqpXr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117447784370922376641", "name": "Brenda Vicente", "time": 1623119386636, "rating": 5.0, "text": "This has been on my \"bucket list\" for years and this was a wonderful Mother's Day gift. Logan and Tina were professional and very friendly. So knowledgeable, you were never concerned or worried. Smooth start and smooth landing! I highly recommend Middle TN Hot Air Adventures and Logan.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkvP80NOoUMutGQHoOVhIfJl0OBiPSMQ6fGrjw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2DnwwP4QwjqkS0AwdIar1FB7wZJwDaTBg0_PD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMI7qf66PXfuF543Hd8A7fa4AoP21HAMyJiAAGJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxi_EVmKgH8JZjdtqrDhFRmwwbInKk6fqDW38b=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "106647878554566505350", "name": "Leslie Pardue", "time": 1624032590121, "rating": 5.0, "text": "We had such a great experience!  Don't wait, just book your flight! You will not regret it!  The crew was so friendly and professional.  This is definitely the best way to appreciate our beautiful area. We will be repeat customers.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPcTMQcj8xxVYWRXSXO7uAeNN8uHRP2khHFxXM0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "108891062486129372414", "name": "Shawn Nelson", "time": 1617586663190, "rating": 5.0, "text": "Logan, Bennett, and Tina provided a first rate experience for my wife's birthday surprise. Their knowledge, thoroughness, and charisma far exceeded our expectations. Their proficiency was readily apparent in the expedience of the ballon preparation as well as the crew coordination through all phases of the flight. Thank you guys for a very memorable experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwzRThHnaHFVoWPSgA_ccgVxOR4V2eWR_ArgQK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPeupshyYYHoVHwv_1XoWyJHKQwbWA-ACxmJgh4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNrrmRgQiQ8BOXFu-rvE-IUE612abuK3-DxbNDn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "102810581020801450489", "name": "Melody Clayton", "time": 1621697309900, "rating": 5.0, "text": "Trip of a lifetime!  The Logans are professionals, informative and made me feel very comfortable.  I have always wanted to take a hot air balloon ride.  It was amazing seeing the world in such a smooth and peaceful way!  Totally recommend this company for seeing beautiful Middle Tennessee from the air at 17 mph for over 5 miles as the bird would fly!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "105182938430889722659", "name": "Bruce Thompson", "time": 1619100197514, "rating": 5.0, "text": "We flew last Friday morning April 16, 2021 and it was simply incredible. Logan and his pilot and crew were on time, extremely experienced, and very warm and accommodating. We were originally scheduled to fly the day before but had to cancel because of weather. Logan worked us in for the next day and my out of state guests really appreciated that. Several in my group said that they were afraid of heights, but this flight was just different and did not seem to bother them. The views from above were breathtaking as the sun was coming up. Without a doubt, I will certainly use them again with other guests. Great job guys!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "110740013831716158822", "name": "Jill Austin", "time": 1619476302487, "rating": 5.0, "text": "Logan and Tina were so awesome to work with on our \"bucket list\" hot air balloon ride this morning!  We had to shift the days to get excellent weather and they were so accommodating!  It was so smooth and as exciting as I thought it would be!! Can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "112681174471874370952", "name": "Tonya Grissom", "time": 1617486075327, "rating": 5.0, "text": "Our hot air adventure was AMAZING! I am scared of heights, and our pilot Bennett gave me some tips that got me over it quickly. It was such a smooth and peaceful experience! Riding in a joy air balloon was on my bucket list...so glad I choose Middle Tennessee Hot Air Adventures to check that off my list!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "101291280043997758397", "name": "Bob Long", "time": 1621186890418, "rating": 5.0, "text": "One of the best experiences we have ever had! Logan and Tina were the Best! We want to go back and take our friends.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "103480436415732198982", "name": "Jay Power", "time": 1591577255558, "rating": 5.0, "text": "Had an amazing time. Logan and Tina are awesome and made us feel like friends. Logan is a local native and familiar with every little area. Highly recommend!! Morning flight was beautiful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMu1GVmX188IHdAml6yHw1OWU0lhDYC0N37hKZF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "115397203870005548857", "name": "Tina Duffey", "time": 1571406178678, "rating": 5.0, "text": "Beautiful experience! I highly recommend Logan and MTHAA for a ride filled with breathtaking views, some history on notable landmarks, and excellent communication including clear directions and expectations.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPpjw8_z7h77jGZknb6JYC52sPSpDrcNPoD2gSS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLI6doSentxFUsmXEny-876lPEdkLmeEtMQ6yz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4Sy5Mt87o7N7KbIwTluDW1t3Tlo5JUsxQJnvs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "104311156887385829462", "name": "karen ledford", "time": 1521948656649, "rating": 3.0, "text": "Attended one of the festivals they put on at the Westhaven Town Center in Franklin. Pretty cool, but I still don't understand why they don't lift off. That would be cooler.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNUq8H2U7nLH9-daAXbD_qgsg8Re_-HvUPxXN9k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX2ek_qxeIjfu4aGjaBdZ4dtweBcf55C8Mi5dW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMvdUvw5z28Iki382KCCVjH1_6hDpK3i4rZXICw=w150-h150-k-no-p"]}], "resp": {"time": 1521990189074, "text": "Karen, I am confused by this review as we do not \"Put on\" any of the balloon events.  We are simply hired by the event to provide the balloons, they tell us what they want us to do.  We do not lift off because they do not want us to and they pay us to stay there and do a balloon glow, not fly away from the field.  I understand your frustration but I would appreciate it if you remove this review as it is something that is not in our control or we have any decisions making power over.  If you have a complaint about a balloon event I would talk to the people organizing the event."}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "103603772746550010828", "name": "Tanya Chabot", "time": 1571407626097, "rating": 5.0, "text": "So, let me tell you just how amazing this husband wife duo was. I flew in from Boston and was surprised with this gift, 30 minutes before I was lifting off the ground. With a flawless set up, clear expectations of what to expect and perfect timing. We gently lifted off the ground to watch the sun rise. We floated over the “square” saw the beauty of Tennessee’s landscape with the mountains peaking up into the sky. Logan was thorough in sharing with us what he was doing, where we were and how we were going to land. An hour later we gently touching down, to learn a little history of hot air balloons and share a toast before being shuttled off back to our vehicles. It was an experience of a life time. If you haven’t done this, you have to with this team! Thanks Logan and Tina for the best experience I could hope for you.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "113525439556357041220", "name": "Tim Jaskoski", "time": 1567267027897, "rating": 5.0, "text": "Wonderful experience with Logan this morning!  There is nothing like floating above the trees, hearing birds chirping in the morning light and observing the world below. Professional but fun crew. I can’t wait to do this again!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "116578341093644836117", "name": "VFX Blender", "time": 1536341454381, "rating": 5.0, "text": "I went balloon riding today in Franklin and I must say it was most enjoyable. I had contacted the staff earlier about weather related, days before flight and they responded to my concerns. Their team were very professional and I felt very safe riding in the balloon. I also got some great pictures.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "110915694455690678260", "name": "J Gray", "time": 1499524460613, "rating": 5.0, "text": "I'll start with the fact that this was my first experience with a balloon ride. Logan (the pilot) and his lovely wife were clear, attentive and friendly the entire time! For anyone who may be concerned going in that they don't know what to expect or how to behave- when you take off, you absolutely will. They make it totally clear in concise terms. You'll really feel confident going into the ride.\n\nThe experience is one that is surprising! Take off and landing are gentle yet exciting- far more so than a plane! The views are spectacular and Logan remains in constant communication with the ground crew. In addition to all of that you'll learn about the history of ballooning! I won't spoil it all, but don't hesitate to take this leap with this company! They are amazing people and will provide an amazing experience! Support local business!", "pics": null, "resp": {"time": 1532638414490, "text": "Thank you for the review, we are truly honored to share our passion with passengers on every flight."}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "116056171764579705927", "name": "Tracy Poth", "time": 1530807145405, "rating": 5.0, "text": "1st time in a balloon. Logan, Tina and the rest of the crew were phenomenal! Very professional and personable at the same time. I will go again in the fall. Plan to make it apart of my budget to go at least twice a year during different seasons. A great way to unwind and enjoy peace and tranquility. Worth every penny.", "pics": null, "resp": {"time": 1532638491821, "text": "Tracy, thanks for the review.  Each season provides a unique variation for ballooning over Middle Tennessee.  We are happy you had fun on your adventure and look forward to more!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "111536336082218873812", "name": "Evan R. Murphy", "time": 1466053353758, "rating": 5.0, "text": "The whole experience was fun and fascinating, a real treat. Getting up before sunrise with family and friends (you can go in the evening if you prefer). Watching them set up the balloon (surprisingly awesome to watch!) Climbing into a basket with 9 other people. Going up in the sky and taking in Nashville from great heights. Learning about ballooning from a very knowledgeable pilot like Logan. The jokes and fun and interesting stories with Logan and Tina both. We all had a wonderful time, and I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "102081948684529953480", "name": "Landon Reef", "time": 1463772023018, "rating": 5.0, "text": "Amazing team effort by a group of really great people. Our weather wasn't ideal for our original flight and they were able to reschedule for the next morning. It was an amazing ride I will never forget. I would recommend these guys be your first stop if you are thinking about taking a ride in the skies!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "101486352818060445661", "name": "Steph Waldrop", "time": 1469812041173, "rating": 5.0, "text": "Middle TN Hot Air Adventures provided a tethered ride for guests at our corporate picnic/barbecue. They were extremely professional throughout the entire process - from booking the event through to the last ride. Logan and his team are highly skilled and bring a depth of experience that is second to none. And, our guests LOVED the balloon ride -- it was the hit of the party for sure!! We can't wait to have them join us for another event!!", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117824375591109854955", "name": "Jeff Hart", "time": 1500477103750, "rating": 5.0, "text": "Logan and Tina run a tight ship!   Excellent experience from start to finish.  Our first ever hot air balloon ride, and these guys made us want to do it again!", "pics": null, "resp": {"time": 1532638558917, "text": "Jeff, thank your for your review.  We strive to make each adventure fun and memorable for the passengers.  What make our job so much fun is the passengers that we get to share it with!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "115085932891367060371", "name": "John Coode", "time": 1499261071465, "rating": 5.0, "text": "Great trip with fabulous views. Logan was very professional and was accompanied by a very competent crew and his wife Tina who was a great host for the trip. A wonderful experience!", "pics": null, "resp": {"time": 1498482124225, "text": "John, it was so much fun taking you and your family flying and celebrating a few birthdays! Hope to see you guys again, maybe next time you can log some flight time!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117534217950707202703", "name": "Aimee Clever", "time": 1465775198953, "rating": 5.0, "text": "Fantastic! So surreal to see the sunrise and the beautiful country side from this vantage point. The weather was beautiful, and we felt completely safe with our pilot Logan. There is such a feeling of peace and quiet as you float along at the same speed as the wind, this is a trip not to miss! Thank you! :)", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "111026273515077331276", "name": "Mela Masser", "time": 1442320083977, "rating": 5.0, "text": "We had the best time with Logan and his crew!! Can't recommend these guys enough! We were on our honeymoon and wanted to something fun to mark the occasion. So glad we flew with them as they really took care of us. It was an experience we'll remember forever :-)", "pics": null, "resp": {"time": 1456424254668, "text": "Mela,\nFirst I want to apologize for taking so long to reply to this review.  We really appreciate your kind words, and it makes us so happy to know we were able to add some fun and excitement to your trip.  Thank you again,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "100346504749929069277", "name": "H. Ray Wilson", "time": 1444640355030, "rating": 5.0, "text": "Can't positively comment enough to describe how great THE HOT AIR BALLOON RIDE was.   Logan and crew were very professional, informative and friendly.  The view was naturally spectacular and didn't expect anything less from Middle TENNESSEE.  Hoping to carry my 13 year old Grand Son and other family members in the not to distant future.\nH. Ray Wilson, Eads, TN", "pics": null, "resp": {"time": 1456423518740, "text": "H. Ray, we are happy you were able to fly with us.  It was a pleasure to take y'all flying.  Thank you for the kind words, we are always working to make your experience better.\n\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "107743794690208673628", "name": "Tom Todd", "time": 1414675958771, "rating": 5.0, "text": "What a wonderful experience! On Oct. 25th my husband and I had a flight with Logan and Tina.  The view was spectacular and everything was explained fully. Peaceful is the word I would use to describe how it felt. I have talked to friends about it and 4 of them are looking forward to going in the future. Thank you for such a fantastic time.\n\nCarol Todd", "pics": null, "resp": {"time": 1436845589877, "text": "Carol, we are so excited to know that we met your expectations for a wonderful ride.  Thank you so much for recommending us to your friends and make sure they mention you when they fly!! We always say the passengers make our job so much fun!"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "107598472877036025421", "name": "French Snapp", "time": 1443005064861, "rating": 5.0, "text": "The balloon ride was a anniversary gift for my Wife and I must say it was fantastic from start to finish.. We loved every min and highly recommend it.", "pics": null, "resp": {"time": 1456424109245, "text": "French,\nWe wanted to take some time to say thank you for your kind review.  We know you do not have to take extra time out of your day to do so but we want you to know that it means a lot to us.  We are happy we could help make your Anniversary one to remember and are pleased to hear you enjoyed it.\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "118164341787195143386", "name": "Wilma Leming", "time": 1444741999894, "rating": 5.0, "text": "It's hard to describe. It was a very uplifting experience for me. I hope to do it again next fall.", "pics": null, "resp": {"time": 1456423864673, "text": "Wilma,\nThank you so much for your review.  We were so excited to have you fly with us and we are glad that Wayne was able to join in on the fun!\nThanks again,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "117627743500346434766", "name": "Lori Vines", "time": 1444493390988, "rating": 5.0, "text": "Hands down the way to go if you are looking for a hot air balloon ride. They truly care for the customers safety and to make sure you have the best experience you possibly can.", "pics": null, "resp": {"time": 1456423981944, "text": "Lori,\nWe really appreciate your kind words.  I am glad you were able to see how much we care about your experience.  It is why we fly hot air balloons. We hope your experience is something you will cherish for a lifetime!\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "105195013429070456203", "name": "Kimberly Edgeworth", "time": 1447707717204, "rating": 5.0, "text": "Had a fabulous experience!  Very impressed and pleased with our hot air balloon ride!", "pics": null, "resp": {"time": 1456423618409, "text": "Kimberly,\nThank you for the kind words.  It means a lot to us to know that our passengers are happy with their experience.  We are always striving to set ourselves apart and provide you with the most unique trip.\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "116924457386778995694", "name": "Jackie Miller", "time": 1439819083382, "rating": 5.0, "text": "Hot Air Ballooning should be on everyone's bucket list! If you've thought about it, don't wait - DO IT NOW!  You will be so glad you did!\n\nLogan and the folks at Middle TN Hot Air Adventures have the experience and the equipment to make it an experience of a lifetime!", "pics": null, "resp": {"time": 1456424366259, "text": "Jackie,\nI am happy to know how much you enjoyed your experience with us.  We truly strive to make each flight unique and the best experience for each individual.  Thank you for choosing us, and thank you for recommending us to others.\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "112343900810187398769", "name": "Jennie P Ingram", "time": 1496667712880, "rating": 5.0, "text": "My husband and I took a ride with Middle Tennessee Hot Air Adventures to celebrate our 10th anniversary, and it was a wonderful experience. Our original date had to be rescheduled due to storms, but Logan was great about tracking the weather and keeping us informed. It is obvious the second you meet them that Logan, Tina and the crew truly care about giving people a memorable flight. We took off from Arrington Vinyards, and floated over Arrington, Peytonsville, and Franklin for an hour. Set up and packing up were both fast, and fascinating to watch happen. We enjoyed the Balloonist's Toast of champagne, and the fun of meeting new people on our adventure. If you've always been curious about ballooning, take a trip with the good folks at Mid TN Hot Air Adventures. You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "110958770210895406230", "name": "Claudia Pinto", "time": 1453947935478, "rating": 1.0, "text": "He rescheduled multiple times over several months. When I asked for my money back, he refused and would only give a partial repayment.", "pics": null, "resp": {"time": 1456423415267, "text": "Claudia,\nI am a bit surprised by your review.  After checking our records it seems you purchased a discounted Holiday Gift Certificate for $360 on 12/18/2010, that is 6 years ago.  Our gift certificates are non-refundable as are most gift certificates in the United States.  The next transaction I have with you is 12/10/2012 where I refunded $300, which you agreed to, and canceled the gift voucher.  I am not sure why you waited another 3+ years to write this review.  I find it fair to refund most of original cost for this Gift Certificate which is non-refundable to start with.  I am sorry you were not able to fly and yes we rely on good weather to safely fly.  Please read through all of our information available on the website and if you have any further questions please call us before making any purchases.\n\nThank you,\nLogan"}, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
{"user_id": "104487700593845080424", "name": "Jabberwocky4k", "time": 1543249470929, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x886478d130e265ad:0x57381b7ed64d6395"}
