{"user_id": "107661341989444833891", "name": "Melanie Jarman", "time": 1567827852156, "rating": 5.0, "text": "I was very happy with the results of my experience with Ms. Cooper. I would definitely hire her services again.", "pics": null, "resp": null, "gmap_id": "0x889a4ddfe5cdbc75:0x811fefeb294dab66"}
{"user_id": "108845587429531511151", "name": "Angela Lankford (Angela)", "time": 1599576569667, "rating": 5.0, "text": "Very nice folks!", "pics": null, "resp": {"time": 1598658275571, "text": "Ms. Lankford we called back several times and could not reach you."}, "gmap_id": "0x889a4ddfe5cdbc75:0x811fefeb294dab66"}
{"user_id": "114306811547405760457", "name": "Connie Conner", "time": 1569958236759, "rating": 5.0, "text": "Very glad I chose Cooper Law Firm for my bankruptcy.  The process went smoothly and quickly.", "pics": null, "resp": null, "gmap_id": "0x889a4ddfe5cdbc75:0x811fefeb294dab66"}
{"user_id": "114037759036480937125", "name": "Wayne Beasley", "time": 1629489508975, "rating": 5.0, "text": "Great service and very friendly! Highly recommend!! Made the process very easy and simple.", "pics": null, "resp": {"time": 1629490521958, "text": "Thank you!!!"}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "102486773922186781802", "name": "Joe H", "time": 1621278566396, "rating": 5.0, "text": "Mr. Ryan is not only an excellent bankruptcy attorney, but, unlike many, he is prompt and available to respond to you directly. Whether through text, email, messaging through his sites portal, or even through calls, he's always available for correspondence.\n\nWhen we filed for joint bankruptcy, he made it easy to do so, and it was all done rather quickly. Very simple process with him. 10/10 will recommend him every time!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "101259691554028512810", "name": "Mormon Redd", "time": 1628185315568, "rating": 5.0, "text": "Mr. Ryan was very professional and provided some great legal advice for a unique situation that definitely required in depth knowledge and expertise about real estate and foreclosure law.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "104291926320340842651", "name": "Roy Browning", "time": 1627841703412, "rating": 5.0, "text": "Upon contact with Ryan Legal Services I was tended to promptly. I had questions about Real Estate in Alabama and was given resources and answers. Thanks for the help Mr. Ryan.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "110968897662796695866", "name": "Labrisha flott", "time": 1613076450044, "rating": 5.0, "text": "RLS has been a great team to work with during the most challenging time of my life. Professional, honest, and always responsive.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "114435765355372763852", "name": "Luana Madden", "time": 1579831880950, "rating": 5.0, "text": "Mr. Ryan is extremely quick about responding to emails and phone calls. I have not once had an issue. He’s so helpful and educates me about everything that I question. He got my monthly payments to the lowest possible. Even after 2 years into my bankruptcy, he ALWAYS responds promptly and thoroughly. I would recommend him to anyone.", "pics": null, "resp": {"time": 1581485648177, "text": "Thanks L.M. !"}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "118065138894007977284", "name": "Xiomara Lemans", "time": 1581009889093, "rating": 5.0, "text": "Mr. Ryan is A ok. He returns calls and emails in a timely manner. With all your credentials and documents in place, the process is, from my experience, smooth. Plus he is affordable. May I add, he is quite patient and this helped me because of the stresses I was under.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "100659679774234839275", "name": "Tammie Lawrence", "time": 1542793864157, "rating": 5.0, "text": "Mr. Ryan is wonderful to work with.  He stays in contact and has worked late nights and weekends with us. We are still using him and no complaints.  Thanks for helping us through a rough time.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "105018095097897626514", "name": "Wendy Paulsen", "time": 1490748070268, "rating": 5.0, "text": "Wonderful experience with Mr. Ryan. He was very helpful, thorough, kept constant communication. Only regret was not going to Ryan Legal Services almost 2 months ago when we made the decision to go this route. Best bankruptcy law firm in Mobile, hands down. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "103903963387048588794", "name": "David Engen", "time": 1575907276597, "rating": 1.0, "text": "Not responsive on Chapter 7 questions about IRS issues. Was also billed $310 in addition to $1,000 fee for filing. Still no resolution!", "pics": null, "resp": {"time": 1629326827862, "text": "To prospective clients:  negative comments are always a chance to improve services.\n\nA flat legal fee is most common for a ch 7 bankruptcy case and has a limited set of itemized services.  There is in every case a written Attorney Services Fee Agreement.  Our Attorney Fee Agreement does  not cover legal questions months, or as in the above comment, years, after the case is concluded.   Secondly,  most federal and state taxes cannot be discharged.\n\nWe maintain a high level of 5 star reviews because we do not take every case, and because we strictly follow our employment agreements.  Time is a finite resource, and is a lawyer’s only tradeable  asset.\n\nFormer clients cannot take precedent over existing clients who have paid, and contracted for representation in a pending, filed case.  We will endeavor to answer questions from former clients,  but we cannot provide free legal services if a new legal issue arises, or if further consultation is desired. This again is spelled out in the Attorney Services Fee Agreement in every case we take on.\n\nWe sometimes cannot respond to people we no longer represent because of time obligations to existing clients, and we cannot solve all legal issues."}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "116998678761722078753", "name": "Michael Doyle", "time": 1589913527481, "rating": 5.0, "text": "Great lawyer. Trustworthy and dependable.", "pics": null, "resp": {"time": 1628186131104, "text": "Michael Doyle is one of my favorite human beings and lawyers.  If you are in Cleveland, call him first!!"}, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "106976154448675379066", "name": "Joshua Forbes", "time": 1443408018616, "rating": 5.0, "text": "I recently called Mr Ryan because I was being sued and wasn't sure how to handle it. He came to my house and sat down with me and explained everything in detail of how we could get this resolved. I was extremely pleased with how smooth the process went and how he keep me informed on what was going on. I would highly recommend him for any legal matter you may have.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "115139568357553685613", "name": "Lori Jones", "time": 1468429986945, "rating": 5.0, "text": "Mr Ryan was very helpful, resourceful and accommodating. I have just begun this process but I am very happy with his performance.\nI work in Robertsdale and he made arrangements to be in his incomplete (still being renovated)  office for my convenience. Thus far he has gone above and beyond my expectations, especially how he made me feel comfortable in a situation I certainly felt ashamed to be in. I never once felt judged by him, only supported and assisted by him.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "116132386186366349599", "name": "Tammie Spencer", "time": 1520858656750, "rating": 5.0, "text": "Mr Ryan was very helpful, resourceful and accommodating.  I have just begun this process but I am very happy with his performance.", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "110309101523471312276", "name": "chris bradley", "time": 1580937204880, "rating": 5.0, "text": "Went out the way to get everything I asked for done. Thanks again for your help!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "106734887637764611979", "name": "John Williams", "time": 1498838816299, "rating": 1.0, "text": "Mr. Ryan was our attorney in Ohio but unbeknownst to us he had plans to move to Alabama. Our case was not argued as we had discussed and are now in limbo in our case and are paying additional funds as overpayment and may never see that money again. We didn't know that he had moved to Alabama until 2-3 years into the case. We only found out when we called the trustees office. The judge then made him turn his cases over to another lawyer that has no invested interest in our case. We are over $1,000 over paid and very frustrated.\n\nWe know that he left just weeks after our filing so it was a planned move and we should have been told as we would have found another attorney that was going to fight for us.\n\nThanks for nothing!", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "110771931565532388039", "name": "Tabatha Willis", "time": 1602860665195, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x889a6b7b59781c9f:0x5724a2bbf08e400"}
{"user_id": "113445184469091361070", "name": "Jennifer Mumphrey", "time": 1620060612404, "rating": 1.0, "text": "Would not recommend! I have tried to get in touch with them multiple times in regards to our case from Sept 2020. Found out from my lender that they didn't send the reaffirmation agreement in time so that is now void. We trusted them to handle our case and expected things to be done on time. Ignoring/avoiding past clients is shady!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "103445857720302276107", "name": "Tracy Timmons", "time": 1595037860454, "rating": 1.0, "text": "The receptionist was very rude and not professional at all. The staff did not express understanding, respect, honesty and compassion especially during the COVID-19 pandemic. Too many clients and not enough lawyers to sit down and really explain the whole process. Oh by the way I found Celina she is at Brock & Stout.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105649429088207610128", "name": "Jerri Riggins", "time": 1563795561847, "rating": 5.0, "text": "The Attorney of each year! FAIR, honest and respectful service. The friendly staff that makes you feel at home and at ease. Professional and courteous is this Number One Attorney LLC............", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "111347776978457139940", "name": "Chenay Robbins", "time": 1565307255738, "rating": 5.0, "text": "His staff is amazing and very friendly & helpful! Made my time with them a breeze and I’m forever grateful for them for helping me get my credit back on the right track", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "117927923719440745570", "name": "K B", "time": 1576793848423, "rating": 5.0, "text": "Thanks Stephen Klimjack and team. They are a friendly team. They made my experience easy and insightful. I'm grateful.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "117758512536094088343", "name": "Chris M", "time": 1564163515549, "rating": 5.0, "text": "We were treated with respect and the staff was great. Mr Klimjack was very sincere and everything was explained in depth. Very nice office.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "107413032514265659010", "name": "Bm Williams", "time": 1543868954789, "rating": 1.0, "text": "Klimjack and his staff are CROOKS! They will tell you one thing and do another. Calling the office for help is like pulling teeth. I wish I didn't have to give this one star because it deserves a negative. I will NEVER recommend them to anyone not even my worst enemy! Klimjack is all about money. The front desk lady is so clueless about everything. She'll take your name down and of course no call will be returned. My case was dismiss all because him and his uneducated staff didn't tell me. Even went to court and nothing was said about a dismissal. Klimjack plays this role like he's such a great guy but in all reality he's the devil himself. And let's not start on Alex. He's the most illiterate person I have ever met in my life. You'll have to just pop at the office just to even get answers and they'll make you wait hours before even going back to speak with anyone. I thought this would be a smooth ride because of all the lies he sold to me. However this has been a complete nightmare. The state board or whomever should shut his practice down!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "117646211648316636664", "name": "Ann H", "time": 1570135675007, "rating": 5.0, "text": "This office helped me at a time when I couldn’t ask my own family for help. Thank you for your help. This is a real nice group of people.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "114141293931152016726", "name": "Jasma Dortch", "time": 1462302352413, "rating": 1.0, "text": "Avoid this firm. They hassle you into signing paperwork with the intent to help. It's all a lie. They tell you what sounds good and what's pleasing to the ear. They gave me an estimate for roughly 600.00 per month to pay off my debt in 3 years plus I'll have a bankruptcy claim on my credit for up to ten years. I added up my bills and I will be able to make the same payments on my own for 3 years to pay off my debt with no bankruptcy claim on my credit report. I gave them 75.00 of 335.00 to file my claim initially but once I figured out the previous information I called and told them I changed my mind. So nothing was ever filed. I went to obtain my 75.00 with my receipt which clearly stated that it was for filing, and they refused to issue my funds. They claimed it was for work done but no work took place. I will be talking with my family's attorney. It's only 75.00 but it's the principal that matters. They are in violation of misrepresentation of funds, a civil wrong and they need to experience consequences for their wrongful actions.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "108500492780287591611", "name": "Hanna Cole", "time": 1562881255635, "rating": 5.0, "text": "I would like to thank Mr Klimjack and his staff. My Grandfather is 68 years old and is blind and hard of hearing. His ride didn’t show up to take him to court today so he tried to take the bus by himself. He got off on the wrong street and got confused. He called Mr Klimjack’s office, the manager went and found him and took him to court and helped him get through security and took him to the right courtroom. And then after his case was over, Mr Klimjack himself took him out of the courtroom and called his manager to come back and she took him home. If his office hadn’t cared enough to go help my Grandpa, there’s no telling what could have happened. Mr Klimjack is great, as is his staff! He’s a good man and goes above of what’s expected.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "112155284282860786388", "name": "M Henry", "time": 1567634246096, "rating": 5.0, "text": "We have been very pleased with Mr Klimjack. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "109377657178770495560", "name": "T Carlisle", "time": 1570462141142, "rating": 5.0, "text": "The whole process was easy! Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "118020530700900438183", "name": "Betty T", "time": 1570075279622, "rating": 5.0, "text": "Mr Klimjack kept my check from being garnished. I would not have had enough money to pay my bills. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "103492005740831824246", "name": "Barry R", "time": 1564113755595, "rating": 5.0, "text": "Great job. Thanks for making it easy", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "100705545319724362583", "name": "T W", "time": 1497893093518, "rating": 5.0, "text": "They helped me a lot and they made me feel like family and not just another person. I would highly recommend going and meeting them!! Mr Klimjack is very nice!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104126144884594554228", "name": "Barbara Johnson", "time": 1565028160892, "rating": 1.0, "text": "You never see Klimjack, only a bunch of flunkies. BE CAREFUL!!! He doesn't know the first thing about YOUR case! BUYER BEWARE!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "106481685922204940407", "name": "Joseph Foxx", "time": 1549912776629, "rating": 5.0, "text": "I made it through the 5 years with no problems . They treated me very professional and helped me", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "101139366584791083721", "name": "Cheri H", "time": 1404491865388, "rating": 1.0, "text": "My experience was horrible!  I could not get a response without having to call back more than once.  Sometimes, I even faxed, e-mailed and even sent a signature required letter.\n\nWhen I signed the contract, I was told my property taxes for the year would be paid in the bankruptcy.  Now over 6 months after discharge of the bankruptcy, I find I owe almost $1000 in property taxes.  The property tax office indicated interest was being charged.  If the attorney had informed me of this, I could have been paying before, to avoid so much interest.\n\nI realize Klimjack advertises a lot on TV.  That is why I hired them, because I saw them on TV.  I never saw Mr. Klimjack personally until the court date have I filed the bankruptcy.\n\nI expected when I hired an attorney, that they would do as stated and make sure the debts we discussed were paid as indicated in my contract with them.  I was not told nor did I expect to still owe after I paid the bankruptcy over 5 years of $470 per month.\n\nI recommend you look for another attorney and avoid the Klimjack firm.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105190529592364212981", "name": "P M", "time": 1531505622755, "rating": 5.0, "text": "Wonderful experience. Provided necessary information and expertise skills to help us get our life’s back in order.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105032451766530594585", "name": "PJ Lambert", "time": 1546457658974, "rating": 5.0, "text": "He and his staff are nice and professional and will surely help you.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104788845012566658776", "name": "Somebody You may know", "time": 1411174466690, "rating": 1.0, "text": "This law firm and the people in it are by far the worst I have every encounter! They never ever return phone calls and if by chance you are lucky and they do you better answer or you are at a lost and have to try again. They are the most inadequate group of suppose to be educated people I have ever come across. They treat you like third class citizens and as if you don't matter. I don't expect to be besties and to get phone calls and up dates every day but I do expect that if I have a concern or issue a call back in a timely fashion is appreciated especially since you are paying for a service.\nPlease Please save your money look for someone else because they are not worth the time and worry in a already difficult situation.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "111810807733004680198", "name": "Ken Downing", "time": 1539464024940, "rating": 5.0, "text": "Precious young lady helped us so much. Down to earth people.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "112681979786517374822", "name": "Linda Thompson", "time": 1496169137795, "rating": 5.0, "text": "The bankruptcy helped me alot. Mr Klimjack was really nice and the staff made sure every need was taken care of. I would use him again if I ever needed to.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "109526262693718194512", "name": "Wendy Moore", "time": 1480602726274, "rating": 1.0, "text": "This is by far the worst experience I have ever had working with an attorneys office.  The assistant and office staff are very unprofessional.  The assistant thinks that she knows all there is to know and is rude!  I urge anyone looking for an attorney to do your homework and steer clear of this office.  The attorney and his staff should be there for you and ready to answer your questions in a professional manner.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "106187079194295202039", "name": "Rochelle Rodgers", "time": 1495568968578, "rating": 5.0, "text": "Mr Klimjack and his staff treat you like family. They always ask about personal things that most places don't take the time to listen to and they  helped me & my spouse learn how to manage our money and stay within our budget. He's not just a Attorney, he's family. Rochelle & Johnny", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "113278260558827588186", "name": "ley Carney", "time": 1572061599021, "rating": 5.0, "text": "Mr. Klimjack has helped me out of a jam more than once. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "112131630672136050559", "name": "B L", "time": 1529448433068, "rating": 5.0, "text": "I can’t say enough good things about this office. My wife is paralyzed and we live 30 minutes from town. They drove to my house to save us money that we didn’t have. Did they have to do that? NO!! His office was packed and our case wouldn’t have made a difference but he definetly made a difference. Go see him!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "101185580726452801425", "name": "Ricky St. Julien", "time": 1562782204406, "rating": 5.0, "text": "I had a good experience and would use Mr klimjack again!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105870689347378842185", "name": "B A", "time": 1510588022406, "rating": 5.0, "text": "I'm grateful for the aid that bankruptcy provided for me and my family. I have always been able to get the help I needed from Mr klimjack.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "106030248867922895864", "name": "Amber McDonald", "time": 1487368794989, "rating": 5.0, "text": "I came in with many issues. He definitely helped with my financial needs. All of my issues were handled in a timely manner. Thank you for all of your help.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "109049917275362494448", "name": "Laura P", "time": 1570020869802, "rating": 5.0, "text": "Thank you for helping us!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "117077521774600878475", "name": "Terry Tomlin", "time": 1549315251432, "rating": 5.0, "text": "Great atmosphere and very helpful.  Thanks for the help.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "111060975228160408354", "name": "c c", "time": 1496348774805, "rating": 5.0, "text": "We were treated very nice and Mr Klimjack has always been very professional. Its been a long road but we made it thanks to him.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "102282490001749960301", "name": "Y P", "time": 1537822066667, "rating": 5.0, "text": "Glade I had the experience to go through this process.it was great!!!!Thanks for everything", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "100930258156552265305", "name": "Carl Reese", "time": 1496765699497, "rating": 5.0, "text": "Fast and Easy process.  Everyone was very helpful, friendly which made us comfortable during a critical time.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "107381126737306422698", "name": "Marylyn Bernabo", "time": 1527617657483, "rating": 1.0, "text": "Was going to file bankruptcy and gave them $100.00 but we left and thought about it. It was just more than we could afford. I tried about an hour later to call him and say we changed our minds ,we just couldn't afford it. He would not return our money. I figured they must need it more than we do.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104551262002199903631", "name": "Leoance Will jr.", "time": 1497297749310, "rating": 5.0, "text": "My experience with Celena at Stephen L. KLIMJACK was very hands on they walk me through everything with strong but ruff love family atmosphere.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "115684537611157623840", "name": "Margie Williams", "time": 1507582903650, "rating": 5.0, "text": "We had a great experience with Mr KLimjack. We would use him again", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "112216354190806578448", "name": "Admin Capital Enterprise", "time": 1449237007906, "rating": 1.0, "text": "My husband & I hired Mr. Klimjack to give us financial advice. His office acted unethically in advising a 13 over 7, knowing we would have to file for a 7 only a year later. This resulting in an additional 3K in his pocket since 13 is more profitable to the attorney. Trying to dismiss the case he refused to return any calls until threatened with an attorney. He tried to bully us into believing we couldn't dismiss. The trustee's office is where we sent our plea for help and only 1 month later the case was dismissed without injunction. ( A strong statement from the judge to his poor ethics) We contacted a malpractice attorney who informed us that this is standard practice for his office & that we should file a complaint with the state bar. I think the truth of this case speaks for itself.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "116287629599313802968", "name": "Durojaiye olusanya Olatunde", "time": 1579576251404, "rating": 5.0, "text": "With quality  service..", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "109347733811714154996", "name": "Ron Tillman", "time": 1502131598368, "rating": 5.0, "text": "It was great they're  very good. It was quick and easy!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104424002027980106610", "name": "Judge Dog", "time": 1527184662498, "rating": 4.0, "text": "They are awesome I definitely will recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105503708533391363107", "name": "Sean Johnson", "time": 1568143890966, "rating": 5.0, "text": "Excellent & very knowledgeable attorneys", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105443562193390866310", "name": "Donnie Mills", "time": 1520970627489, "rating": 5.0, "text": "My case paid out a year early thanks to Mr Klimjack. I'm thankful for the help and support", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "114992099797663063996", "name": "A Mitchell", "time": 1570136355408, "rating": 5.0, "text": "Super easy process!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "102088055947328262140", "name": "M Carter", "time": 1564077296917, "rating": 5.0, "text": "I went to Mr Klimjack at a pretty desperate time where my family was about to lose everything. Mr Klimjack had everything worked out in 2 appointments. We've just made our last payment! If I ever need an Attorney in the future, Mr Klimjack will be hearing from me.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104759776694452605958", "name": "Barbara Thomas", "time": 1573156887299, "rating": 5.0, "text": "Always hard working on your side", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "113718103016611893702", "name": "James Soleyn", "time": 1576896944826, "rating": 5.0, "text": "Best attorneys ever", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105712231278073832855", "name": "sharmane keith", "time": 1569186592526, "rating": 5.0, "text": "Very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "111241703766387101370", "name": "Betty Humphries", "time": 1487377570211, "rating": 5.0, "text": "They were very efficent and the staff was very friendly", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "115110743061192455337", "name": "Durand Lewis", "time": 1597690658129, "rating": 1.0, "text": "Changing my review now after being a great Clint with them they just can’t return a simple call when you ask for the lawyer that helped u they keep putting me off I send so many emails try resolve a problem i going then give them a week or I am\nReporting them to the Bar.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "115356699908878876285", "name": "Joyce Robinson", "time": 1582333007352, "rating": 5.0, "text": "Great Attorneys", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "105167907511100540396", "name": "P R", "time": 1502832088965, "rating": 5.0, "text": "I'm so glad that I chose the firm to represent me.  Each time I called this office for help, they were thrre\nfor me.  Thanks for everything!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "110891171876288477723", "name": "Ralph Ratcliff", "time": 1556656226466, "rating": 5.0, "text": "He takes care of his client's.", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "115502613150956707891", "name": "Alan Scull", "time": 1552421578550, "rating": 3.0, "text": "Nice people but advise", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104712438291178280495", "name": "Luke Hildreth", "time": 1578656050198, "rating": 2.0, "text": "Too freaking high", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "116008787110948235030", "name": "Brenda Nolan", "time": 1563625366902, "rating": 5.0, "text": "Great lawyers", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "115148903543134958443", "name": "Trey Stallworth", "time": 1572992396320, "rating": 5.0, "text": "Thank you guys for the help", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "103773915587120182676", "name": "davin johnson", "time": 1542666041810, "rating": 5.0, "text": "Did everything they was supposed to...thank Mr klimjack", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "107141752167952365720", "name": "toni mcmillan", "time": 1538571212449, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "104712295825877028944", "name": "Sheri B", "time": 1564176274395, "rating": 5.0, "text": "Thank you for everything!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "113016754878997861106", "name": "Ann playlist F", "time": 1523461185648, "rating": 5.0, "text": "He help me a lot with my Bankrupt case .I will recommend to family and friends", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "118344861067937780673", "name": "Cody Wilson", "time": 1480825691724, "rating": 1.0, "text": "I have filled a chapter 13 with this office I have been trying to cancel my case now for 3 months but when I call they say the attorney is on the other line, out of the office or in court. These are the most unprofessional people I have ever delt with.  They lured me in to singing the paper work for my chapter 13 and said we would get it cheap for me. Which they didn't!", "pics": null, "resp": null, "gmap_id": "0x889a4e3c5b7fe299:0xbee8058e84196f7f"}
{"user_id": "110724308591018896696", "name": "Robert Walters Jr", "time": 1620752601809, "rating": 5.0, "text": "I was so relieved to find Reid Tolar.  A friend recommended his services.  It was handled faster than I had thought.  I recommend Tolar & Tolar for any problems that may arise.", "pics": null, "resp": null, "gmap_id": "0x888e9bfb1d1ee427:0x507063b46a9d52e4"}
{"user_id": "118255519578092368560", "name": "Yvonne Meacham", "time": 1620685755565, "rating": 5.0, "text": "This law office is exceptional! Family owned and family oriented! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888e9bfb1d1ee427:0x507063b46a9d52e4"}
{"user_id": "102781338778260541597", "name": "Monica Means", "time": 1599869769154, "rating": 5.0, "text": "I have been a client of Tolar and Tolar for the past 4 years and they were very helpful, professional and responsive to all my needs and any questions that I had . They always responded in a very timely manner. They were always nice and friendly every phone call and or visit. I would definitely recommend this firm to anyone !", "pics": null, "resp": null, "gmap_id": "0x888e9bfb1d1ee427:0x507063b46a9d52e4"}
{"user_id": "102993679606280673084", "name": "Danny Doyle", "time": 1599853137017, "rating": 5.0, "text": "Tolar & Tolar has been the very best \"partner\" during our families struggle in the process of bankruptcy. From our initial meeting, they relieved our stress of the perception of bankruptcy to a better understanding that allowed us to move past and moved forward with life. That it was ok and we were not alone. They made the entire process VERY SIMPLE and straight forward and handled the burden. They have always taken my calls/emails and answered any questions/requests over the last 4 years, even through the process of selling/purchasing of homes. I would highly recommend this group to anyone that may feel burdened by debt (of any circumstance) to make that first call and meet with them. You'll be glad you did!", "pics": null, "resp": {"time": 1599855058059, "text": "Thank you Danny! We appreciate you trusting us and are thankful that we could help. We try to make the process simple and treat every client as if they were family!"}, "gmap_id": "0x888e9bfb1d1ee427:0x507063b46a9d52e4"}
{"user_id": "104124944625400244842", "name": "Thumper Thompson", "time": 1496516453676, "rating": 5.0, "text": "Really helpful!! Will make you feel like you have a friend on your side!!", "pics": null, "resp": null, "gmap_id": "0x888e9bfb1d1ee427:0x507063b46a9d52e4"}
{"user_id": "113553960004043215192", "name": "George Sides", "time": 1615221621288, "rating": 5.0, "text": "I had an excellent experience with C Taylor Crockett PC.  Due to some poor choices on my part a few years ago, I had to file for bankruptcy and enlisted the services of C Taylor Crockett PC to assist me in this.\n\nTaylor, Kim and the whole staff were very professional and handled my case better than I’d ever imagined.  In fact, they went the extra mile and researched a lien that had erroneously been placed against me by the State of Alabama and had that removed.\n\nMy bankruptcy has been discharged a few years now and I’ve turned my life around.  I’m retired and enjoying a relatively stress free life thanks in large part to my experience with C Taylor Crockett PC.  I highly recommend them.\n\nSincerely,\n\nGeorge Sides", "pics": null, "resp": {"time": 1615232376975, "text": "Hi George, Thank you so much for taking the time to share your experience at C. Taylor Crockett. P.C.  We take pride in knowing our customers are happy with their experience."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "107148160305697812971", "name": "Jonathan Whitworth", "time": 1615247760256, "rating": 5.0, "text": "I dont know what I would have done without Taylor and his staff,they were so calming to me through such a trying time in my life.\nThey made the process so easy to understand and answered any questions I had.\nKim was so nice and was easy to talk to, and  she never made me feel like I was getting on her nerves even though I called her so often.\nIn short I would say they genuinely care for you and what your going through.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103977140842091863058", "name": "Harley Martin", "time": 1615245446764, "rating": 5.0, "text": "Taylor Crockett and his staff are super polite , they follow up and follow through , they are very professional and are worthy of your business.\nKim is very helpful and quick to answer calls, emails etc.  I don’t often leave reviews for services unless my socks are blown off.   Since I am now bare foot consider them for your legal matters.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "114814341701955262461", "name": "Mark McConnell", "time": 1615226932750, "rating": 5.0, "text": "The office of C. Taylor Crockett P.C. and staff were very diligent in the handling of my case and courteous in their interactions with me. I recommend the legal services of C. Taylor Crockett P.C. completely.", "pics": null, "resp": {"time": 1615232234696, "text": "Hi Mark, thank you so much for taking the time to provide feedback. We are so delighted that you rate our service as 5 star as we strive to provide just that for all our customers."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "109048871792660755841", "name": "Jerrica Thomas", "time": 1614871809769, "rating": 1.0, "text": "VERY UNPROFESSIONAL, paid him for a service and two months later i was still being garnished. When i called him he spoke to me with no respect! I highly DO NOT RECOMMEND TAYLOR CROCKETT.", "pics": null, "resp": {"time": 1615231990168, "text": "We appreciate your feedback. I have been practicing for 27 years and this is the first time a client has stated they were treated with disrespect from anyone at my office. I can assure you we took immediate steps to resolve your issue upon the filing of your case and continue to monitor your file.  Please do not hesitate to call me personally at any time to address this or any other issues."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "107930000183574321741", "name": "Linda Brasher", "time": 1615222236138, "rating": 5.0, "text": "From the day I made the first phone call all the way through the completion of my business the service was superb. Everyone was not only professional but were also kind.", "pics": null, "resp": {"time": 1615232265279, "text": "We're happy to see that you had a 5-Star experience at C. Taylor Crockett. P.C. Thanks for sharing Linda."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "101612722668586993917", "name": "Deirdre Daniels", "time": 1577810828509, "rating": 5.0, "text": "Professional, patient and compassionate service. I would definitely recommend Attorney Crockett to anyone. Rest assured that you'll feel relieved before you leave his centrally located office.", "pics": null, "resp": {"time": 1615232429249, "text": "Thank you so much for taking the time to leave an excellent rating. We really appreciate your business. Please let us know what we can do for you in the future."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1588017276579, "rating": 5.0, "text": "Diligent, dependable, and direct. Mr. Crockett got me to a place where I had peace of mind and a chance to rebuild my future.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "100523205980761907387", "name": "Mimi Latoine", "time": 1572537688773, "rating": 5.0, "text": "Attorney Crockett and his staff, particularly Kim are top notch professionals.They are very passionate about the work they do and in helping people find the right fit to meet their individual needs. A highly ethical group and I would strongly recommend you give them a call!", "pics": null, "resp": {"time": 1615232468711, "text": "The team here at C. Taylor Crockett. P.C. is thrilled to receive such great rating, thank you."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "109907278468966289984", "name": "Mr. Griffin", "time": 1561557976734, "rating": 5.0, "text": "My experience with Mr. Crockett was 2nd to none. The personal touch he provided me was what I was looking for in a professional environment. He kept me informed on my case even after I had filed with details of actions the court was trying to make on my behalf and fought with my best interest at heart. So he is highly recommended in my book!", "pics": null, "resp": {"time": 1561578213543, "text": "Thanks Mr. Griffin.  We appreciate you entrusting us to assist you, and now your daughter as well."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "112089707884091351127", "name": "Romar Smith", "time": 1587163524974, "rating": 5.0, "text": "Mr. Crockett and his staff have always been nothing but professional, knowledgeable, thoughtful, courteous, and extremely helpful!\n\nI’ve known Taylor for close to two decades and there is not another person I would trust to handle my interest!", "pics": null, "resp": {"time": 1615232528535, "text": "We are incredibly grateful that you took the time out to leave us a 5-Star review."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103882929916838986244", "name": "carletta collier", "time": 1586544434544, "rating": 5.0, "text": "I HIGHLY RECOMMEND THEIR SERVICES, THE COMPASSIONATE ONES.", "pics": null, "resp": {"time": 1615232399780, "text": "Thanks so much for sharing your experience with us."}, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "113397870894714079501", "name": "Ann Roth", "time": 1565007835609, "rating": 5.0, "text": "I highly recommend Taylor and his staff, they are very professional and walked me through everything. I didn't know what I was going to do with my mom's finances but once Taylor got involved I knew I was right where I needed to be. When I was overwhelmed he was so reassuring, \"you got this\". I even talked my brother and his wife into going and they couldn't be happier about it.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "112740559787137600242", "name": "Brett Beiter", "time": 1556801761212, "rating": 1.0, "text": "Met with Taylor in March 2018 to discuss my case.  He tasked me with collecting all of my financial information of which I submitted within a week.  They never followed up.  After five weeks I inquired again and was notified they had been dealing with an illness.  No communication the duration of 2018.   I received a letter in January 2019 following up so I called again.  No return call!!! In April 2019 I retained a different attorney.  If zero stars was an optional rating this firm would have received that notorious ranking.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "117228725734298021830", "name": "TC Oliver", "time": 1566622995509, "rating": 5.0, "text": "Friendly, professional and extremely knowledgable. I highly recommend C Taylor Crockett PC.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "110198317219258716810", "name": "Gwen Sanders", "time": 1561581448113, "rating": 5.0, "text": "I highly recommend Mr. Crockett. He so Professional  and very courteous.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "103077961104598857484", "name": "Traci Melton", "time": 1564766618809, "rating": 5.0, "text": "I highly recommend him and his staff are really awesome.....", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "109202398711055858698", "name": "Kandy Garner", "time": 1564683404867, "rating": 5.0, "text": "I definitely highly  recommend Mr. Taylor Crockett best attorney I know", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "101156437609462412768", "name": "Matthew Heath", "time": 1490897197770, "rating": 5.0, "text": "Not all Bankruptcy Attorneys are created equal.  I wouldn't use anyone other than Taylor Crockett.  That is for sure!", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "111890203144724879118", "name": "Imogene Batemon", "time": 1481046718470, "rating": 5.0, "text": "One the best Law Firms I have ever had pleasure of assisting me and my family.", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "113593517434527797849", "name": "Claude Fountain", "time": 1494557435082, "rating": 5.0, "text": "Taylor Crockett will take the time to listen to you as an individual, and give you the best legal representation for your specific needs.  I highly recommend him and his staff", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "104858873591796280717", "name": "Brian W. Kittrell", "time": 1493392359002, "rating": 5.0, "text": "Great lawyer and great office staff!", "pics": null, "resp": null, "gmap_id": "0x88891b914ecb595d:0xfa9b00d889bc72a4"}
{"user_id": "113035978513132895413", "name": "April Clifton", "time": 1596650504841, "rating": 5.0, "text": "My uncontested divorce was handled quickly and professionally at a very good price.", "pics": null, "resp": {"time": 1596672595113, "text": "Thank you so much for the kind review!"}, "gmap_id": "0x888603e2e688f51b:0x23f95f8b85e3b191"}
{"user_id": "104976770939565926193", "name": "Valencia Rhodes", "time": 1624055748593, "rating": 5.0, "text": "Mr. Reese is such nice and kind person. He worked extremely hard to put all my fears, concerns and worries to rest. He asked all my questions.", "pics": null, "resp": {"time": 1624131227364, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "104051250298705051705", "name": "Dirk Diggler", "time": 1620827104917, "rating": 5.0, "text": "Bond & Botes are professionals in every aspect of any bankruptcy law. Suzanne Shinn is a fantastic attorney but she’s also compassionate towards her clients. Im sure in all her years of service she’s seen it all. She has a way of letting you know it’s gonna be ok and when you get through this you will be able to get on your correct financial path. Thank you again!", "pics": null, "resp": {"time": 1620918928948, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "116791620864255280589", "name": "John Gates", "time": 1616613064482, "rating": 5.0, "text": "So far the attorney has been great.  I still have yet to pay but I’m sure once I do they will be great.", "pics": null, "resp": {"time": 1616614552558, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "102802493251296784920", "name": "Selena Anderson", "time": 1616004898603, "rating": 5.0, "text": "Highly recommend to anyone. All I did was ask questions,sent a a few emails. Fast response time..", "pics": null, "resp": {"time": 1616008918648, "text": "Thank you, Selena!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "110576125091693798949", "name": "Deborah Cooper", "time": 1619556310051, "rating": 5.0, "text": "Very knowledgeable and friendly people. Helped me so much", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "112892887889746458668", "name": "Cory Wynn", "time": 1621621055338, "rating": 5.0, "text": "Great people to work with I'm glad I called them", "pics": null, "resp": {"time": 1621702870890, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "110548809306945884859", "name": "Susan Bennett", "time": 1604350145019, "rating": 5.0, "text": "Very fortunate to have found this law firm. This is my second time working with them, and I am so pleased. They take very stressful and heart wrenching situations and fix them. I am so relieved knowing they are my representation.\nCourteous , patient, kind, and professional.", "pics": null, "resp": {"time": 1604354607031, "text": "Thank you so much, Ms. Bennett!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "107278538984283934424", "name": "Starbuck Anderson", "time": 1612975542662, "rating": 5.0, "text": "Bond and Botes's representatives were polite and very patient while I asked my many questions, even when l asked some multiple times. Top notch in my opinion.", "pics": null, "resp": {"time": 1612976688667, "text": "Thank you very much and please let us know if you have any additional questions! :-)"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101959200647269337264", "name": "Henry Richard", "time": 1594828638747, "rating": 5.0, "text": "The staff was very professional, efficient, patient, and accommodating. They were in constant communication with me throughout the process. They are a great value for the excellent level of service provided.", "pics": null, "resp": {"time": 1594832589315, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "111756432464486740347", "name": "Sharon Parker", "time": 1584723863558, "rating": 5.0, "text": "I feel at ease knowing that my situation is in good hands.  Everyone I've talked with is very nice and takes the time to listen to what you have to say.  I like that I can sign or fill out forms online. I can even communicate  with the office through text  message.", "pics": null, "resp": {"time": 1589922871308, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "110517719180996767144", "name": "Lin D. Hall", "time": 1591991887352, "rating": 5.0, "text": "They Are Fantastic! This Law Group Is Outstanding And I Would Recommend Them To Anyone. Mr. Wineachter was my Legal Advisor and Ashley & Becky was my Office Team advisors. What An Awesome Group They Were To Work With Too!\n“Thank You & May God Bless Each Of You Mighty”", "pics": null, "resp": {"time": 1592240736239, "text": "Thank you very much!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101514369581317749132", "name": "Joy Starr", "time": 1596125604327, "rating": 5.0, "text": "Mr. Reese was so nice and made me at ease, I was very nervous going in, all of the office staff I dealt with were nice, friendly and handled all of my concerns.", "pics": null, "resp": {"time": 1596121559396, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "109812076863892407105", "name": "Keosha Nix", "time": 1582846981228, "rating": 5.0, "text": "My experience  was by far one of the best customer service  experiences  I've  had in a while! Monica made me feel like she and I had known each other for years!!! I didn't  feel like a number I felt like I mattered. Going in, I was unsure and super nervous, let's say by the end my appointment I have a new found confidence because of Monica and all other members  of the staff!! Thanks so much, I'm so happy with my decision!", "pics": null, "resp": {"time": 1583005361384, "text": "Thank you for such a nice review, Keosha!  Please rest assured that neither you or any of the other folks who come to see us will ever be treated like \"numbers\". We try to treat people who come to see us like family and I am so glad that you felt our care and concern.  Brad Botes"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "109333075883436073426", "name": "Hime Enchanted", "time": 1586271097861, "rating": 5.0, "text": "Absolutely wonderful experience! It couldn’t have been any easier. All my questions were answered in a timely manner. I was helped every step of the way.", "pics": null, "resp": {"time": 1589922837636, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "106247257632281962938", "name": "Jan P", "time": 1575425355082, "rating": 4.0, "text": "I give the office staff four stars. This was my first initial meeting and everyone I encountered was so welcoming and professional. The lawyer I met with was very knowledgeable,helpful and reassuring. I have every confidence that Bond,Notes,Reese& Shinn was a great choice to help me thru this time if adversity.", "pics": null, "resp": {"time": 1575431820263, "text": "Thank you! We really appreciate your review and kind words."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "103927075317771041156", "name": "R A Jones", "time": 1600368316225, "rating": 5.0, "text": "The  staff and attorneys at Bond and Botes were very professional and compassionate with me during this most difficult time of my life", "pics": null, "resp": {"time": 1603820285691, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "103379957493001591036", "name": "car404me", "time": 1592585504504, "rating": 5.0, "text": "The staff is very polite and helpful. Made my bankruptcy very easy.", "pics": null, "resp": {"time": 1592589461445, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "113451422962315574664", "name": "Phil Massa", "time": 1574219088705, "rating": 5.0, "text": "The service by all staff members has been so helpful and prompt going out of their way to provide counsel in a calming fashion during a tense period of life. I am truly grateful for their service!", "pics": null, "resp": {"time": 1574264038297, "text": "Thank you for taking the time to leave a review, Phil.  We remind ourselves regularly that we wouldn't be here without good people like you and it is an honor to serve you."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "105560426817470481914", "name": "Tammie Quinn", "time": 1591920410430, "rating": 5.0, "text": "It Felt very good to have such a honest and  reliable group of people behind me.", "pics": null, "resp": {"time": 1591986634029, "text": "Thank you very much!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "105268849542654456607", "name": "Karen Mealing", "time": 1595442912858, "rating": 5.0, "text": "All the above, very professional! come highly recommended.", "pics": null, "resp": {"time": 1595447753772, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "111241172458077829110", "name": "Sandra C Harris", "time": 1583277650145, "rating": 5.0, "text": "I was really amazed at the professional atmospher from the phone call to the signing in to the consultation. Mrs. Monica was so kind professional and understanding of my needs.She took her time and explained all my questions i ask. Grest experience great emplyees and awesome results. I recommend this company to anyone in need of their services.", "pics": null, "resp": {"time": 1583282912034, "text": "Thank you Sandra!  We really appreciate your kind review!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "118008512636760055235", "name": "DArius Roberson", "time": 1589048269493, "rating": 5.0, "text": "Professional and knowledgeable. I would definitely recommend", "pics": null, "resp": {"time": 1589922773056, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "116865102437055478059", "name": "Jenny Weems", "time": 1565103845255, "rating": 5.0, "text": "Awesome lawyers! Second time using them. Always makes me feel at ease no matter what kind of situation I've been in. Thanks guys!!!", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "103783684674858364599", "name": "Tynese McKinley", "time": 1598759366496, "rating": 5.0, "text": "Ms. Reese response soon as possible and she has gave me the help that I needed.", "pics": null, "resp": {"time": 1598884891816, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101018310399700195831", "name": "205 Yoshi", "time": 1582701393327, "rating": 5.0, "text": "Great atmosphere.. Excellent at what they do", "pics": null, "resp": {"time": 1582730354565, "text": "Thank you very much!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101750608735308018029", "name": "Vanessa Knox", "time": 1585166228768, "rating": 5.0, "text": "I was overwhelmed in debt and was stressed out to the point that it was affecting my health. I got a mailer with the bonds and Botes, I called made an appointment, as as I talk with them I felt relieved that professional were handling my debt problems.", "pics": null, "resp": {"time": 1589922857519, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "114687642801080909904", "name": "Kirk Petty", "time": 1566414234550, "rating": 5.0, "text": "The moment I spoke to the attorney it was evident he had a genuine interest in my best interests!", "pics": null, "resp": {"time": 1566419543438, "text": "Thank you, Kirk! And yes, meeting our client's best interests is always our goal!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "106980825581470958134", "name": "Brenda Taylor", "time": 1562702307762, "rating": 5.0, "text": "It was great. I was a nervous wreck and Mr. Reese made it so that. I was relaxed and not so worried when. I left. I am so glad I chose this law firm.", "pics": null, "resp": {"time": 1562704169770, "text": "Thank you for your review, Brenda!  We really appreciate your kind words!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "108280900985667317264", "name": "Chad Pinnow", "time": 1492602430977, "rating": 5.0, "text": "I was referred to Bond & Botes by one of my wife's friends.  I was very hesitant to follow thru with the process of bankruptcy as I was raised to satisfy my obligations. After 15 years of trying, I realized I couldn't do this on my own.  Brad put my mind at ease in the first few minutes of our consultation.  As painful as this process can be, Bond & Botes did everything in there power to keep me calm and on the straight and narrow path to financial freedom.  Their guidance and assistance in our case was the best that it could have been.  Pam also did an exceptional job keeping me up to date as our case progressed.  My wife and I are extremely excited to get this \"fresh\" start and would recommend Bond & Botes to anyone.  They provided outstanding customer service and professionalism, along with the ability to calm me down when my stress level was at it's peak.  I would definitely use them again for any legal issues I may come across in the future.", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "102688153098026369351", "name": "Shabree Perry", "time": 1589305564055, "rating": 5.0, "text": "The staff is really nice and super helpful", "pics": null, "resp": {"time": 1589922752123, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101024751102340953240", "name": "Karen Means", "time": 1562770852720, "rating": 5.0, "text": "They have been very professional and easy to talk to Really seems interested in hrlping me.", "pics": null, "resp": {"time": 1562775079179, "text": "Thank you very much Karen! Please know that we really are interested in helping you and everyone who comes to us seeking help. We appreciate your kind review."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "110033923512872706931", "name": "William K Jones", "time": 1551976335719, "rating": 5.0, "text": "What a relief. To have this process explained so clearly. Both attorneys, Grafton Weinacker and Robert Reese were very easy to talk to and Ashley was also very helpful. I only wish I had contacted them sooner. It would havs saved us from a lot of sleepless nights .", "pics": null, "resp": {"time": 1552063518033, "text": "Thank you for your kind words Mr. Jones.  We do our best to provide the best legal services possible for our clients and it is good to hear nice words like yours."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "116323047353671251856", "name": "Alicia Coleman", "time": 1571246145891, "rating": 5.0, "text": "Prompt action. Caring law firm.", "pics": null, "resp": {"time": 1571253890414, "text": "Thank you, Alicia!  It means a lot when someone takes the time to leave a kind review. We are grateful!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "104943373537252466641", "name": "Erika Hill", "time": 1564493594854, "rating": 5.0, "text": "If you need a great firm please use Bond, Botes, reese & Shinn I had a great experience with this firm.", "pics": null, "resp": {"time": 1564497121569, "text": "Thank you, Erika!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "105816753562339774197", "name": "Kathy Blackmon", "time": 1586542336986, "rating": 5.0, "text": "Very professional and everyone is nice.", "pics": null, "resp": {"time": 1589922829926, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "118222270890386920952", "name": "Andrea Caison", "time": 1549898964619, "rating": 5.0, "text": "On Monday, January 11, 2019, I called the office of Bond, Botes Reese & Shinn PC approximately at 8:22 a.m. and was pleasantly greeted by Ashley Wesley!  She provided prompt, professional, and EXCELLENT customer service and made my day!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "110914903018948010338", "name": "Theodore Campbell", "time": 1575322867523, "rating": 4.0, "text": "Excellent, very simple, easy to understand, very kind, Thank you.", "pics": null, "resp": {"time": 1575327090802, "text": "Thank you Mr. Campbell. We really appreciate the nice review."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "111207201799776219432", "name": "Melissa Worthey", "time": 1552402761617, "rating": 5.0, "text": "Everybody was so professional and very nice.  I'd recommend them any day !!!", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "112517474051805375833", "name": "Jennifer Snell", "time": 1539193464376, "rating": 5.0, "text": "They have been so great working with me and my budget and getting things done for me quickly.", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "112223549228535761583", "name": "Angela Hayes", "time": 1565994721112, "rating": 5.0, "text": "Mr. Weinacker was very thorough and pleasant.", "pics": null, "resp": {"time": 1565997868061, "text": "Thank you, Angela!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "107894830771635888389", "name": "Donald Love", "time": 1588933822402, "rating": 5.0, "text": "Had a great experience with the lawyers", "pics": null, "resp": {"time": 1589922783202, "text": "Thank you!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "109035417137176994835", "name": "Rashial Scott", "time": 1520630203258, "rating": 5.0, "text": "Mr. Reese was so informative and was so patient with my little one as well. If you need a good bankruptcy lawyer, this is the place to come.", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "103039520530500151692", "name": "Jay h", "time": 1544138115506, "rating": 5.0, "text": "These guys are awsome!!!! They walked me thorough the whole processs and put my mind at ease. Thanks guys!!!", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "115651119057329128735", "name": "Nicole Wallace", "time": 1516384730990, "rating": 1.0, "text": "BOTES was such a jerk and so rude! All he wanted was money! Talked down to client and was not helpful at all.", "pics": null, "resp": {"time": 1516631433205, "text": "We are sorry that you were not satisfied with your experience. We strive to assist all our clients in the best manner possible to meet their needs."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "107275055251502717879", "name": "Sharon Calhoun", "time": 1522191017444, "rating": 5.0, "text": "They are super kind and courteous! Made the whole Bankruptcy process less stressful for me!", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101608008923595748468", "name": "Shirley Cunningham", "time": 1572988901184, "rating": 5.0, "text": "Great group of people.", "pics": null, "resp": {"time": 1572992833310, "text": "Thank you Ms. Cunningham!  We really appreciate your nice review."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "112951668829757292090", "name": "John Turner", "time": 1544194119608, "rating": 5.0, "text": "Our experience with the partners and staff has been exceptional", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "113146831811115078525", "name": "VELMA G COSBY", "time": 1563564245980, "rating": 5.0, "text": "Gave me a piece of mind..", "pics": null, "resp": {"time": 1563566549662, "text": "Thank you, Velma."}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "101289789540673118088", "name": "Olen Fitts", "time": 1495779743206, "rating": 5.0, "text": "My financial matters were handled professionally and I would recommend Bond Botes Reese Shinn to all my associates", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "111434419462163057257", "name": "Candace Roberson", "time": 1541424205189, "rating": 5.0, "text": "Very helpful. Wonderful staff.", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "102454228716506624395", "name": "Stacey Bearden", "time": 1503448015379, "rating": 5.0, "text": "Robert Reese is s lifesaver! We went to Bond Botes Reese and Shinn expecting the worst but came out feeling completely relieved, he walked us through the process step by step and I've felt so at easy", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "115285069482543259402", "name": "Kristin Gore", "time": 1546462174583, "rating": 5.0, "text": "Great experience all the way around", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "104839489201374971737", "name": "Amber Russell", "time": 1564592995804, "rating": 5.0, "text": "They are awesome", "pics": null, "resp": {"time": 1564634141044, "text": "Thank you, Amber!"}, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "113191472133884069783", "name": "SF Alvarado", "time": 1525382382664, "rating": 4.0, "text": "Very helpful in legal advice, eased my mind, the best firm to work with real people with money problems or medical problems.", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "109831091724955095888", "name": "Jodi Benton", "time": 1552432468879, "rating": 5.0, "text": "Great law firm and suburb staff,", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "117266252315692048778", "name": "Dustin Defnall", "time": 1541258089679, "rating": 5.0, "text": "Simply exceptional!", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "108693952423956375898", "name": "NAs NAs", "time": 1497546088177, "rating": 1.0, "text": "very rude, very impatient and greedy...wanted $2k just to contact another lawyer to have them settle an account i have", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
{"user_id": "117994093040083684403", "name": "Vinetta Yow", "time": 1487357633968, "rating": 5.0, "text": "Very concerned & caring.", "pics": null, "resp": null, "gmap_id": "0x8889191157a06b65:0xa48659bb5eb4fc21"}
