{"user_id": "115273340331619764672", "name": "Donna Bozeman", "time": 1627412595035, "rating": 5.0, "text": "I absolutely enjoyed the experience. The teacher was fun however very informative. I wish they would separate the Beginners. I have never bartended before and I left there with tons of knowledge. Thank you TRACEY", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112468086145683340247", "name": "Jamie Oliver", "time": 1625581462967, "rating": 5.0, "text": "ABC Bartending School is a student friendly school and very affordable. The process to registering was easy and I have no complaints. The instructor is very knowledgeable and work with students to ensure that understand the concept. Instructor was very helpful, made sure she answered all my questions and made sure I understood. I recommend this company for your Bartending license.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114502328934623410177", "name": "Evan Gove", "time": 1627399553327, "rating": 3.0, "text": "The class was fun and energetic. Our instructor, Tracey is very knowledgeable and entertaining. The location was not the best. Poor lighting (only one light works as of 07/27/2021), building is worn down and not well kept, bathrooms never had toilet paper or paper towels, etc. Overall the classes were initially a little crowded, but I would still say the class was a good foundational bartending class.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104050307676146819842", "name": "Jamie Bonner", "time": 1627513350622, "rating": 5.0, "text": "Alabama Bartending school was helpful and professional. The staff work well with you especially when you weren’t able to make a class due to sudden events.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111581902092752079324", "name": "Raheen Shields", "time": 1624565816612, "rating": 5.0, "text": "This learning experience was awesome. The instructor was very knowledgeable and informative. She also made sure I was secure in all areas. The hands on experience was the best! I’d recommend anyone to Alabama Bartending School. Thanks for the learning experience.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107361616903225614334", "name": "Dalexis Hayes", "time": 1624641459501, "rating": 5.0, "text": "My experience with Traci was excellent! The booklet has everything you need to know in it! I had so much fun learning, and everything is hands on. Don’t be afraid to ask questions!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105754761845716321734", "name": "Cecilia Curry", "time": 1624381787269, "rating": 5.0, "text": "Great training! Tracy, our instructor, provided us both practical and real-life bartending knowledge that will benefit us as future licensed bartenders. She made it easy to grasp and understand. I would recommend this class!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106302489512905289864", "name": "Whitney Nix", "time": 1624898856744, "rating": 5.0, "text": "The teacher is fun smart she knows her stuff and will help you with anything and everything you need help with! She always contacts me back very fast and is just an all around amazing teacher!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104046441067294581738", "name": "Lila Bowman", "time": 1626546221464, "rating": 1.0, "text": "This class is a complete joke! Don’t waste your money. You can get this online for $12 throw Groupon", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102505766846437735296", "name": "Anyiah Northard", "time": 1625847804956, "rating": 5.0, "text": "My class was very informative and fun. She made sure we had the basics down and will make sure you pass your test!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102086403909568583659", "name": "Kayla McKnight", "time": 1610385863263, "rating": 5.0, "text": "Ms. Ellis was extremely passionate about teaching us! Always going above and beyond to make sure we got the lesson that was taught on that day! She makes it so fun and easy to remember things! I took the weekend class because I work Monday- Friday. I didn’t mind waking up early on a Saturday because I knew once I arrived, I would be greeted with a warm smile and positive energy! Ms. Ellis is such a great person and instructor and you definitely get your money’s worth taking this course! Sign up you won’t regret it!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104371026377847576353", "name": "Kasmyn Wilder", "time": 1622831696069, "rating": 5.0, "text": "I learned a lot. Enjoyed hands on activities. You will enjoy your experience I enjoyed mine.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111735978534744139554", "name": "Heather Hunter", "time": 1625864905307, "rating": 5.0, "text": "This class was so much fun and I learned alot! They teach you all of the ins and outs of bartending and preps you for the exam!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117653215411718444301", "name": "Garett Rodgers", "time": 1617027296902, "rating": 2.0, "text": "This \"school\" requires you to leave a 5 star review in order to receive the\"certificate\" that you've already paid for.. also don't be fooled by the job placement ad on their site it is complete fraudulent advertising, as what they actually do for you is take a screenshot of positions open on Google and email it to you. Tracey the instructor is also a scam artist. She will teach nothing, you copy things down from an answer key then take the test at home sending her a picture when completed", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107525536669536164168", "name": "Nyah Garrett", "time": 1611594285622, "rating": 5.0, "text": "The teacher was great. Everything was simple and straight to the point. If we had any questions she answered all of them. She made class fun. She give you all the tools you need to pass the test. I would recommend anyone to go through abc bartenders school.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105036674620949506770", "name": "Kathleen Alexander", "time": 1620671462589, "rating": 5.0, "text": "Loved every minute. Awesome teacher that made it fun. Thanks Tracy", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112804611215640778555", "name": "Summer S", "time": 1620679130474, "rating": 5.0, "text": "Very enjoyable experience in the class, she's helpful with tips to help you remember and understanding! I would recommend it to friends thinking of joining the field", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108228861992481196626", "name": "Pinke Jones", "time": 1621619144461, "rating": 5.0, "text": "This class was EVERYTHING ‼️‼️‼️Tracy is the dopest instructor and didn’t  mind informing the class of all the tips and tricks of the trade. I am throughly satisfied with everything I obtained while attending class😁😁😁. I now have a skill that I can use and profit from. THANK YOU ABC BARTENDING SCHOOL‼️‼️‼️", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110068658273253084383", "name": "Abigail Chappell", "time": 1618594285196, "rating": 5.0, "text": "Teacher was great, class was also amazing! Very helpful and fun! 10/10 recommended. 😌", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112829584188969523901", "name": "CHRISHAWNA MARIE WOODS", "time": 1619727875456, "rating": 5.0, "text": "Thank You So Much I Had So Much Fun The Instructor Tracey Was The Best And Very Helpful I Loved The Class And Had Fun With Her", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116122796081855738726", "name": "Sheneavian Marshall", "time": 1619746616115, "rating": 5.0, "text": "This class is everything I learned a lot and the teacher was excellent. You’ll definitely enjoy!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106809887992276847025", "name": "Taylor Gee", "time": 1617316102071, "rating": 5.0, "text": "Tracey is an AMAZING teacher! I would take this class all over again if needed, I had an awesome time (:", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103480178877893558929", "name": "Jalesa Latham", "time": 1611600350322, "rating": 5.0, "text": "This was a very upbeat class. The instructor was head on with the important information. She made sure everyone had the correct materials. She also engaged well with the class. I would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109715892970396401910", "name": "Mel Hicks", "time": 1615482682036, "rating": 5.0, "text": "This program is a must. It definitely gives you the knowledge needed to get start in this profession. I have never done bartending  before and was nervous I wouldn’t catch on but the instructor made everything easy to learn with fun slogans and ways to remember. I would recommend this class to anyone. The hands on training made me feel ready for the bartending world.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106632019371787954509", "name": "Athaliah Norris", "time": 1618014874008, "rating": 5.0, "text": "I truly enjoyed taking bartending classes with the Bartending School of Birmingham!  It was very exciting and informative. Starting off I knew nothing of bartending, now I feel like a pro, ready to get out into the real world of bar tendering. The instructor was very nice and professional captivating and positive. I would recommend anyone who is interested in bartending to  attend this school! It has always been my dream to be a bartender and now my dreams have come true!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114770985911343491675", "name": "Tiara Bell", "time": 1618848757078, "rating": 5.0, "text": "Alabama Bartending School is an amazing journey to obtain your bartending license. I had the honor of being a student of Traycie’s and I can not even began to express how welcoming and wonderful she is! I will definitely be back if I ever need a refresher course or just to stop by and see Traycie to show her all my new tricks put to work. <3", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104501282738542128656", "name": "Brittney Moody", "time": 1610385383379, "rating": 5.0, "text": "Let me tell y’all about the Bartending School\nIn Birmingham,AL. The instructor from the first day of class was very inviting! She made you feel good about yourself and the knowledge wether you knew nothing about Bartending or have been doing it for years. We got to make drinks well not with real liquor but you get my drift. It had a real life bar setting and was set up just as if you were in a major chain of restaurants Bartending. She let you make as many drinks in front of the class until you were comfortable. I volunteered to be first. LOL  I absolutely Loved the class and the instructor. I would definitely take this course again for any refreshing needed!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116797419556114225328", "name": "walter kirksey", "time": 1625242029439, "rating": 5.0, "text": "Had a great time in the class and learned a lot!!! Traci was awesome!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112624830351775400341", "name": "Brandon Woodard", "time": 1613666178759, "rating": 5.0, "text": "I enjoyed my week long class at the end of November. It was taught by very experienced bartenders and I learned a lot more than I expected to. I didn’t just learn drinks, I learned how to be a good bartender. I would recommend for people to take this class.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102501052330640893925", "name": "Tristan Leach", "time": 1598890065675, "rating": 5.0, "text": "I signed up the the class in Birmingham, AL.  Tracey Ellis was a wonderful teacher.  I took this class for a potential part time job and did not know anything about alcohol.  I will continue to recommend this school.  I can't wait to start bartending as a hobby.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108524838798519133553", "name": "Tirrell Davis", "time": 1611940928167, "rating": 5.0, "text": "The experience of the class was good worth the time and money. Also Ms Tracey is an awesome instructor!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113866391282737015522", "name": "Tracy McCall", "time": 1592318869164, "rating": 5.0, "text": "Tracey Ellis is by far a phenomenal instructor. She is very patient and able to articulate her student's strengths and weaknesses when facilitating and practicing the proper way to measure liquids. Her personality was the perfect fit to keep the class interesting which enabled me to relax and address more complex questions that I had pertaining to the course. Being a newbie in this field, she was very motivating and resourceful in ways which made me feel more comfortable as I pursue this journey. Thank you Ms. Ellis for challenging my knowledge in becoming a bartender.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112684657706358951223", "name": "Jahneia Sims", "time": 1599239509906, "rating": 4.0, "text": "I really enjoyed  myself .My teacher Tracy made the class very interesting.  She was always making jokes. I wish we had on the job training and  made a drink with real alcohol on our last day. Over all it was a great class.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110255431974269463924", "name": "Carolline Martin", "time": 1608581254086, "rating": 4.0, "text": "The material that was required of us to know was current and emphasized in the industry of bartending in its current economic state. My instructor was very enthusiastic about her job and that contributed tremendously to the learning environment.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103231451902663089301", "name": "Susan Floyd", "time": 1611764231984, "rating": 5.0, "text": "Great experience! I loved the teacher and enjoyed the classes.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116596183201004586954", "name": "Erica Paul", "time": 1608576884508, "rating": 5.0, "text": "Really great experience! I would highly recommend it to anyone interested in entering the bartending world.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101703470037453744815", "name": "kenya brown", "time": 1607380594093, "rating": 5.0, "text": "The course was very informative ! I loved the hands on and how detailed the instructor Tracy is on teaching all the fundamentals of bartending . I’d highly recommend all to take course !", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107115522395723074122", "name": "mi mi", "time": 1612199640785, "rating": 5.0, "text": "Easy Class, instructor was great. Definitely would recommend.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116184112175632178992", "name": "knmccrary", "time": 1601053601035, "rating": 5.0, "text": "Our instructor Tracey Ellis was awesome. I learned so much from her. She was very engaging. I would recommend this course to any & everyone! I will be back for refresher courses.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117656862706755170752", "name": "Carla Johnson", "time": 1576855337300, "rating": 5.0, "text": "Tracey is a fun, amazing, positive teacher. You get out what you put in. Don’t be afraid to ask her to stay behind and practice or ask questions. I recommend you also research on your own time as well! Learn the history behind the drinks and flavors.  She was very patient and willing to teach you which I think is rare. I’m actually going to start applying to places by first visiting a few spots this week to get an idea of the atmosphere! Don’t be afraid! Do I think I am ready: honestly yes! Because I studied and practiced.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117032363206841193621", "name": "Sharon Dennis", "time": 1588862427138, "rating": 5.0, "text": "I really enjoyed the class. Tracey was so much fun and informative. As many drinks as it is to learn that can be a little intimidating but Tracey made sure the class wasn't boring so for me it made learning the drinks pretty easy. I learn better hands on and I loved that if I wanted to practice extra drinks she had no problem letting me do it. I would definitely recommend this bartending school!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113286263816330731971", "name": "Catherine Rich", "time": 1583770884775, "rating": 5.0, "text": "I would definitely recommend. My teacher was amazing. Very helpful and understanding. She makes the learning process really fun. If you've been interested in learning to mix drinks, sign up!!! It doesn't take long, they have multiple class times/days to make it easier to attend. Go get yourself certified too", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107107244567916187333", "name": "Veronica King - Knight", "time": 1601923395827, "rating": 5.0, "text": "I truly enjoyed this class the instructor made it fun and exciting which made it easy to learn. I'll definitely be referring this class to others.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107138179555405755702", "name": "Timmie Kirksey", "time": 1601307437449, "rating": 5.0, "text": "REALLY INSIGHTFUL....INSTRUCTOR IS REALLY FRIENDLY DEFINITELY KNOWS HER STUFF AND IF U TAKE THE CLASS U WILL 2.......SO WORTH THE MONEY TO BE CERTIFIED. DEFINITELY A STEAL AND A MUST", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104219139904062364107", "name": "Javei Harvey", "time": 1597940036423, "rating": 5.0, "text": "Great Experience!!!! Tracey Ellis was a excellent instructor with a refreshing sense of humor. She truly cares about her students and will make sure you learn everything you need!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117098744261840374346", "name": "mssanders87", "time": 1594166632725, "rating": 5.0, "text": "I had a great time in class! Tracey was amazing, fun, professional and very thorough. I will definitely go back to refresh my memory occasionally and just to say \"Hi\"!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105639692067300751409", "name": "alicia bradford", "time": 1598028588868, "rating": 5.0, "text": "great experience, lots of knowledge & the fact that you’re done in just 4 DAYS is awesome! Ms. Tracey is the funniest & that makes the experience even more fun!\n\nthanks for everything!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103446647779187364956", "name": "Iverson Hopson IV", "time": 1612195627013, "rating": 5.0, "text": "Good, knowledgeable teacher\nGreat class flexibility\nHighly informative", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114441516357529152876", "name": "Karen Marshall", "time": 1596816893381, "rating": 5.0, "text": "I had the best experience at Alabama Bartending School. Tracey was an awesome instructor. She made the process run smoothly, and she made it fun.\nI would highly recommend this school.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106360696203492088458", "name": "Life With Mz Torey", "time": 1602521005040, "rating": 5.0, "text": "I truly enjoyed training and obtaining my license at this bartending school they are very professional and always there to help and assist with whatever you need", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113537930807629921954", "name": "Kayla Hamner", "time": 1602261059799, "rating": 5.0, "text": "Loved everything about this school, would take the course again if I could. Excellent teaching staff, learned a lot.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115513776746741552290", "name": "Amber Giles", "time": 1603307703656, "rating": 5.0, "text": "Tracy was a great teacher. She was very informative and never a dull moment. I learned a lot of the do's and don'ts when it comes to bartending.. Thank you so much!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101571629201197424958", "name": "T'Nesha Jackson", "time": 1597424644666, "rating": 5.0, "text": "I just finished my classes on yesterday. Me.Ellis was very detailed and informative. Great learning atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116906051948165033785", "name": "Nikira Archie", "time": 1596217856165, "rating": 5.0, "text": "Wonderful experience ! Very thorough and informative. Tracey was absolutely great and so nice. Thank you again ABS !!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "118158490462609233123", "name": "Blake Maddox", "time": 1597066049401, "rating": 5.0, "text": "There is not much I can say that everyone else has not already said. The class was amazing and the teacher was a wonderful person and fun to be around. She knows what she talking about.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "118059391563691942029", "name": "Kendrick Dulaney", "time": 1575647346521, "rating": 5.0, "text": "ABC Bartending School was a very great experience. Tracey possessed such a great energy and knowledge of the subject matter. I like how she was able to have new students coming in every class period but she gave each person the attention that the needed. It was very fun and professional! Thanks ABC.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101564544588469295390", "name": "Amanda Jones", "time": 1593783474114, "rating": 5.0, "text": "Traci was absolutely awesome. It was a very relaxed environment with hands on training. Amanda Jones", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115676392934488930488", "name": "Matilynn Williams", "time": 1602517733772, "rating": 5.0, "text": "The class was fun and the instructor made everything easy to learn and remember.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115497469615884696675", "name": "Jeannie Oliver", "time": 1583510364276, "rating": 5.0, "text": "This school helped me get my certification in an amazing time!\n\nThe teacher really made sure we understood everything and had plenty of hand on training during the classes.\n\nI would recommend for future people interested.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103178631033396971512", "name": "Tessia Davis", "time": 1588869255675, "rating": 5.0, "text": "Class was great and the instructor was awesome. I learned a lot of information and got to practice hands on. Everything was amazing.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117791436078107180781", "name": "Andrea Knosp", "time": 1573493934868, "rating": 5.0, "text": "I had a great time in this class. It was informative and a great learning experience. My instructor Tracy was a lot of fun, full of information, always willing to help out and answer questions.\n\nI would definitely recommend this class to anyone looking to get a job in bar tending.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117023068560716516051", "name": "Brittney R", "time": 1580154911757, "rating": 5.0, "text": "Tracey was a really great instructor, she kept the class very entertaining, in addition, her teaching skills were excellent. The hands on portion of the class made me feel as if I am ready to take on bartending. I would highly recommend the class in Birmingham, Al it was very educational and very welcoming.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103408273722662127627", "name": "Keisha King", "time": 1591042132172, "rating": 5.0, "text": "I loved this class very engaging and informative. The teacher definitely knows how to keep you interested", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104992132616463056539", "name": "Kaelyn Scogin", "time": 1602517723794, "rating": 5.0, "text": "Tracey was a fantastic teacher and made the class fun and engaging", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111425703574619582165", "name": "Cidney Grayson", "time": 1591974158013, "rating": 5.0, "text": "My instructor was very knowledgeable and made learning bartending fun . I highly recommend this school to ANYONE looking to start bartending. THANK YOU FOR EVERYTHING .", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117486760660253354214", "name": "cameron stewrat", "time": 1589591382663, "rating": 5.0, "text": "Really great experience. The teacher made the class as fun as possible", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117726473286931358356", "name": "Canei Walker", "time": 1564788462362, "rating": 5.0, "text": "Ms.Tracy is a ball of fun and excitement! She was very engaging with the students and allowed us to do a lot of “hands on” practicing. The class wasn’t over crowded, everyone was to learn comfortably at their own pace. Definitely would recommend class to aspiring bartenders.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108684800096645253237", "name": "Seneka Stokes", "time": 1548431959323, "rating": 5.0, "text": "I would recommend this class to anyone! The information is so helpful and the instructor Ms. Tracey Ellis is amazing! Her energy and personality is one of a kind and oh so fun! She’s very knowledgeable and willing to answer any questions you have! I didn’t know what to expect going into the class, but by the time I left I was so glad I made the decision to take it! I am now a CERTIFIED LICENSED BARTENDER!", "pics": null, "resp": {"time": 1548970446007, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114384047999677355275", "name": "sheila quarles", "time": 1555078254413, "rating": 5.0, "text": "Tracey Ellis my instructor is AMAZING! She has a great personality, she is fun loving and very knowledgeable. I feel Tracey has really prepared us for our next journey in Life!  Great Job Tracey!. I recommend ABC Bartending School of Birmingham, Al to everyone!\n\nAnd let's go have FUN!!!!!!!!!!", "pics": null, "resp": {"time": 1555096519469, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107121862593489074997", "name": "Porsha Rasheed", "time": 1552868225563, "rating": 5.0, "text": "Tracy the instructor is great! She has so much positive energy which makes the class interesting yet fun. Her attitude also allows a relaxed atmosphere. This made it easy to participate in mixing drinks and earning my certificate.", "pics": null, "resp": {"time": 1553270584586, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116839919195349013347", "name": "Radasha Finley", "time": 1543241281333, "rating": 5.0, "text": "I really enjoyed the experience! The instructor Tracey was phenomenal! I live almost two hours away from the site but she made it well worth the drive! I feel knowledgeable and confident in my newly obtained skills! Definitely keep her!", "pics": null, "resp": {"time": 1543335010652, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108483729532773029790", "name": "Neekneek White", "time": 1574099081468, "rating": 5.0, "text": "I loved this class because the teacher Tracy Ellis was wonderful in helping me understand the course. She made it so fun that I found it very easy to learn. I was surprised when I took the test of how much information I obtained in such a short time. Thx Tracy 😘😘", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108851763776616852637", "name": "Leah Tucker", "time": 1580171066582, "rating": 5.0, "text": "Tracey was a wonderful instructor!! Everyone of us thoroughly enjoyed the hands on experience! Highly recommend this course!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113681504257898874079", "name": "Mz. Leidy", "time": 1543196957848, "rating": 5.0, "text": "Tracey was absolutely Amazing!!!! Her personality is what made the course entertaining and fun. I had no clue as to what I was getting myself into, but she taught me a lot in such a short period of time. I would definitely recommend ABS to others.......", "pics": null, "resp": {"time": 1543335014956, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117957082697513776966", "name": "Erica Walker", "time": 1575646129412, "rating": 5.0, "text": "I had a great time in this class! Tracy was very fun and knowledgeable! So excited for my bartender career to start!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112423421343916067227", "name": "Tenidra Harris", "time": 1557500384697, "rating": 5.0, "text": "Tracy is great! I really enjoyed the class and also enjoyed meeting the other students with similar goals and interests. Tracy made the class fun, interesting, and very informative. I recommend ABC Bartending to anyone who's looking to start.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107714866357393061038", "name": "Tiras Carr", "time": 1557866489861, "rating": 5.0, "text": "The instructor was high energy. And the course was fast and efficient. There was no time wasted in imparting the information to us in a digestible manner. It helps that it was a lot of fun too as well as being affordable.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102025080324513814621", "name": "Tamiko Conner", "time": 1547823092487, "rating": 5.0, "text": "When you have your mind set to achieve goals and knowing that there are people in the world that actually cares. I MUST say,  I have enjoyed my instructor and the fellow classmates that attended the bartending session with me. Tracey Ellis is a positive person and thought the class to work as a TEAM. The information provided was very informative and necessary. I am glad I decide to TAKE THE CLASS AND TO  BE A LICENSED AND CERTIFIED BARTENDER.  I will encourage my family and friends to do the same.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO121VB8r1bNgtftmeo31AWUchdx6b2_gQo1X7O=w150-h150-k-no-p"]}], "resp": {"time": 1548970456419, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104059091594143638047", "name": "Joseph Swinea", "time": 1551747679369, "rating": 5.0, "text": "Outstanding experience! Tracey my instructor was very enthusiastic, fun, and very encouraging through each week of learning and the time flew by. Highly recommend ABC Bartending if your thinking of become a certified bartender. Now time to start my journey as a certified bartender!", "pics": null, "resp": {"time": 1553270588130, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117644731917120774298", "name": "Jeremy Moore", "time": 1579883901261, "rating": 5.0, "text": "Great place the instructor was very great and helpful i recommend anyone to go its a good trade and you make your money back soon", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100885250442621252020", "name": "Sincerely, Cordae!", "time": 1576857555686, "rating": 5.0, "text": "Ms. Tracey was so much fun. I really enjoyed class and I have recommended that a few of my friends take the class as well.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102946992929889567228", "name": "Kyrsten Collins", "time": 1537547064763, "rating": 5.0, "text": "It was great. Tracey made it fun and exciting. She was always positive towards her students and empowered them. It was fast paced, but fun. It's a great course if you are unfamiliar with bar equipment and types of drinks.", "pics": null, "resp": {"time": 1541169010284, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110906887620461243447", "name": "Monifa White", "time": 1570802222667, "rating": 5.0, "text": "I really enjoyed this class and I would highly recommend it!! Tracy was very knowledgeable and fun! Tracy personality is larger than life!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112282510125134056143", "name": "Ashley Peden", "time": 1546889229887, "rating": 5.0, "text": "The location is an hour and a half from where I live and the drive was totally worth it. Ms. Tracey always have good vibes going even despite her father passing and made sure we had all the information we needed to pass our test. 10/10 would recommend", "pics": null, "resp": {"time": 1547822355628, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102490940003990195409", "name": "Diara Taylor", "time": 1567178687449, "rating": 5.0, "text": "Ms. Tracy was great to work with and she really wants to see you succeed. Best class hands down!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107081545565344598334", "name": "Denitria Grimmett", "time": 1588952641624, "rating": 5.0, "text": "Gained a lot of information the instructor was fantastic, I really enjoyed the class", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104293098122541846981", "name": "Allison Lowry", "time": 1543249784970, "rating": 5.0, "text": "I absolutely LOVED the class. Ms. Tracey made everything so easy to learn and she made the class so fun! I highly recommend singing up if you're interested in becoming a bartender because you will leave the class with skills and information that will help you in the field!", "pics": null, "resp": {"time": 1543335007216, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111098797267532827808", "name": "Logan Enman", "time": 1579835619286, "rating": 5.0, "text": "I really enjoyed the learning and teacher, we had lots of fun and learned a lot together, will recommend to others", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108119271797602318160", "name": "Mary Caitlin Huddleston", "time": 1530719982455, "rating": 5.0, "text": "Tina is a great instructor and made class fun. She's very informative and gave us helpful notes to remember. Signing up was easy and the location was convenient. I had a great time and would recommend this class to anyone.", "pics": null, "resp": {"time": 1531405956117, "text": "We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112762059868570355138", "name": "jamie rodri", "time": 1565719183775, "rating": 5.0, "text": "Was great experience.  Excellent use of time, learned a lot to use in the field.  Would highly recommend.  James T.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117967899902737068736", "name": "Sam Yasko", "time": 1580266831644, "rating": 5.0, "text": "It was a fun and interesting class. Had a blast!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109207540072354007035", "name": "Lee Nail", "time": 1552329080543, "rating": 5.0, "text": "Excellent program. Great instructor. Feel that I learned a great deal and am prepared to get started in my new career.  Lee Nail", "pics": null, "resp": {"time": 1553270586579, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103924135303286003711", "name": "Emma Marshall", "time": 1559916707807, "rating": 5.0, "text": "Tracey is an awesome teacher. Classes are relaxed and  informative.  So glad I took this course and cant wait to start working behind the bar!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109501024456456257282", "name": "Mason Dale", "time": 1563198521137, "rating": 5.0, "text": "I loved the class! Tracy is awesome!!! She helped me to understand new terms and techniques that we will use in bartending.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100012339575814416007", "name": "Tonya Mitchell", "time": 1524174459682, "rating": 5.0, "text": "I'll be retiring soon and I thought that this would be something Fun to do in my Golden Years.  I learned so many interesting facts about everything.  I'm encouraging all of my other \"Rowdy/Geriatric\" friends to sign up too...54 is the new 50!! L0L", "pics": null, "resp": {"time": 1525100934564, "text": "You're going to be an awesome bartender, Tonya! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116558398664958064144", "name": "Samantha Guyton", "time": 1554481177490, "rating": 5.0, "text": "Absolutely loved this class. Tracey, the teacher is amazing and makes sure you have everything you need. She also keeps the class fun too.", "pics": null, "resp": {"time": 1555096521714, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101018893904127056050", "name": "Brian Lodge", "time": 1581354658679, "rating": 5.0, "text": "I really got a lot out of this class. Tracey is a wonderful instructor and she made the class fun.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115767564724889603387", "name": "Brittnee Malloyd", "time": 1532539250013, "rating": 5.0, "text": "Tina is an AWESOME INSTRUCTOR.  I would definitely recommend my friends to come to this class.  We were very hands on while training and learning from her.", "pics": null, "resp": {"time": 1534523011677, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114613885437329862291", "name": "Kendeldrick Broaden", "time": 1537568999469, "rating": 5.0, "text": "Fun class and great instructor. She’s laid back, gives a clear lesson, and is hilarious! you will laugh your butt off. I recommend everyone sign up for the class.", "pics": null, "resp": {"time": 1541169007217, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113347584327142798908", "name": "Crazy Legs Bear", "time": 1573832984899, "rating": 5.0, "text": "The instructor was very kind, full of knowledge and very helpful I enjoyed it very much it was fun!😁", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106309668478823341271", "name": "Kiya Reynolds", "time": 1532560785078, "rating": 5.0, "text": "Omg this class was fun! The teacher Ms. Tina was very energetic & informative, she’s amazing, I also had great classmates. Overall It was straight to the point and full of laughter! 😊", "pics": null, "resp": {"time": 1534523008651, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100004045606772464200", "name": "Rocky and Beverly McCurdy", "time": 1558107586381, "rating": 5.0, "text": "I enjoyed the class. Tracy is very down to earth and sweet. Class was straight to the point!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117681531650109985004", "name": "Khalid Horus Makalani", "time": 1528843924555, "rating": 5.0, "text": "Tina Robinson was a great and fun teacher. It was good to get refreshed on this. I'm looking forward to getting into the bartending business! This class has me READY! 🍷🍸🍹🍻🥂🥃🍶🍾", "pics": null, "resp": {"time": 1529951823201, "text": "Awesome to hear! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114394815078858607450", "name": "Desiree'", "time": 1533156110837, "rating": 5.0, "text": "absolutely LOVED the class! Ms. Tina made it fun and interesting. Her personality is awesome. I recommend anyone interested in bartending to attend :)", "pics": null, "resp": {"time": 1534523001935, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101553829563980175092", "name": "Valencia Clausell", "time": 1559695220422, "rating": 4.0, "text": "Class was fun, Tracy was energetic and engaging. The class was overbooked and there was not enough seating on the first session. I recommend AL Bartending School to anyone interested in bartending.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114325333796048080566", "name": "Ashly Edwards", "time": 1553093735887, "rating": 5.0, "text": "Class was great!! I LOVE Tracey!! Would recommend to anyone looking to have fun and laugh while learning.", "pics": null, "resp": {"time": 1553270582854, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112083907167510626034", "name": "Tracy Dickerson", "time": 1598278216661, "rating": 5.0, "text": "Friendly, patient and sufficient experiences.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100447165704818400121", "name": "Chris Williams", "time": 1548030883445, "rating": 5.0, "text": "Great class!!! I really enjoyed this class. The instructor Mrs. Tracey Ellis was very knowledgeable of the drinks and process of making them. I've learned so much in class. I'M A NEWBIE, if I can become a CERTIFIED \"THAT'S RIGHT CERTIFIED\" bartender, you can too. Mrs. Tracey is easy to talk too and very helpful. The class was not over crowded, and atmosphere was relaxing. I like that this is a hands on class. We not only study and learn in class, we do practice runs on making drinks too. I definitely recommend this class to anyone interested in bartending. Class was very fun!!!", "pics": null, "resp": {"time": 1548970450729, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100537039846262902407", "name": "Jenita Moultrie", "time": 1545409317339, "rating": 5.0, "text": "I really enjoyed this class.  Tracey the instructor has great energy and very knowledgeable. She kept the class interesting.", "pics": null, "resp": {"time": 1547822359894, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117151641517782789015", "name": "Mocha Stanley", "time": 1570813209804, "rating": 5.0, "text": "Tracey was AWESOME!! Great energy and knowledgeable. Learned alot in 2 weeks. I would recommend this school for anyone looking to start or enhance a career in bartending!!! I am OFFICIALLY certified!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111191234277879804137", "name": "Tim Givan", "time": 1554080350597, "rating": 4.0, "text": "Tracey was a great instructor.  Made class entertaining and interesting at the same time.   Learn a lot from  this class, KUDOs to Tracey.", "pics": null, "resp": {"time": 1555096523853, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110479823080979236264", "name": "Scott Hicks", "time": 1532105141751, "rating": 5.0, "text": "Highly recommend this school. Tina was a great instructor. Made class fun and interesting. Looking forward to using what I've learned in real setting.", "pics": null, "resp": {"time": 1534523016203, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100261244799967500204", "name": "Kaylyn Clausell", "time": 1559743697324, "rating": 5.0, "text": "Tracy was a great teacher, great energy through out entire training process. Thanks, I enjoyed my 2 weeks!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106050483276145123781", "name": "Eric Slaughter", "time": 1541774508579, "rating": 3.0, "text": "I came into this class without any knowledge of bartending. Now I know a few drinks and techniques.\n\nThe pros: Tracey, the instructor, made this class fun. With her outspoken personality and no filter there was never a dull moment. She was knowledgeable and could answer questions nearly right off the back.\n\nThe cons: the class was scheduled from 6-9, but there were times the class was ended only 30 min into it. For the money I paid I would’ve rather the instructor took time to teach us the details. However, class was mostly just reading the textbook word for word. Also, there were different class groups on different sections in the textbook that the instructor had to teach all at once. Never giving her time to really focus with one group of students. I feel the class was rushed and spotty. Really ended up teaching myself. An online class would’ve been better than having to drive an hour in rush hour traffic for a 30 min to an hour class.\n\nOverall: I wanted to obtain a new skill, I’m sure I’ll learn loads more on the job. This class was simply to obtain the mixologist certification.", "pics": null, "resp": {"time": 1542128503534, "text": "Thank you for the feedback. I reached out to others in the same class and stated they stayed for the full duration of class. We will reach out directly to you so you can come back for extra classes to practice. Thanks!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114252215631517415911", "name": "The Healing Spoon", "time": 1541794512396, "rating": 5.0, "text": "This was by far the best ecpexperie I've ever had! Tracey Ellis was my instructor and she was nothing short of amazing! She really knew how to keep our attention.", "pics": null, "resp": {"time": 1542128396726, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103756689688223277178", "name": "Brittany Winborne", "time": 1527867786322, "rating": 5.0, "text": "My experience was awesome. I had a great time and a great teacher\n(Ms.Tina). I would recommend this class if you want to get your bartending certificate.", "pics": null, "resp": {"time": 1527868547300, "text": "Glad you enjoyed it, Brittany! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108878023931933968979", "name": "Amber Hassell", "time": 1538748205048, "rating": 5.0, "text": "Great for the learning the basics of becoming the bartender. The instructor Tracy was funny and taught me a lot. Would highly recommend to anyone wanting to enter into the bartending craft.", "pics": null, "resp": {"time": 1541169004214, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100786874533006455738", "name": "wesley workman", "time": 1565985350206, "rating": 5.0, "text": "I really enjoyed the program and learned a lot. I can't wait to start bartending for real!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110194575320427228072", "name": "JustGo TravelClub", "time": 1557337987417, "rating": 5.0, "text": "Love loved the energy that was in class .. never wanted to leave!!!!! Ms Ellis kept our attention and had me wanting to learn more !!! Ice Ice Baby!!! Highly recommend this class to everyone !! -Kesha", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106989859691929271926", "name": "Tomarcus Dowdell", "time": 1537540428987, "rating": 4.0, "text": "It was a great experience! The class was fun and informative,  the teacher was knowledgeable about the spirits as well. Would differently recommend .", "pics": null, "resp": {"time": 1541169019983, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114716458648276175162", "name": "Ebony Johnson", "time": 1526592939529, "rating": 5.0, "text": "The staff was great! Signing up was stress free and easy!! The program was fun and hands on! It was also convenient, as far as time and location!!! I recommend!", "pics": null, "resp": {"time": 1527024697475, "text": "Glad you enjoyed it, Ebony! Thanks for your feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104128850046045392669", "name": "shamesia richmond", "time": 1528292697013, "rating": 5.0, "text": "Tina the instructor is this best! The curriculum was very informative and I learned a lot. Highly recommend them. Thanks", "pics": null, "resp": {"time": 1528315365426, "text": "Glad you enjoyed it, Shamesia! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104456515730236396706", "name": "Dee Ritt", "time": 1559340218126, "rating": 5.0, "text": "My teacher Tracey was absolutely full of charisma and smiles! Thanks for the positive vibes and great teachings!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100554337820668967477", "name": "Timmorah Auyrionne Yisrael", "time": 1543449278345, "rating": 5.0, "text": "I enjoyed my experience at this school. Obtaining my certification had been a goal for some time. The staff was fun and friendly.", "pics": null, "resp": {"time": 1544464474704, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107863375314748185638", "name": "Tammi McKisson", "time": 1519156990645, "rating": 5.0, "text": "Alabama Bartending School is an awesome place to learn.  The atmosphere is fun.  I've had an opportunity to meet great people.  Looking forward to putting to use all that I learned in class.", "pics": null, "resp": {"time": 1519672451372, "text": "Thanks for the review, Tammi! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114660087918564308586", "name": "Debra Beadles", "time": 1550676935603, "rating": 5.0, "text": "This was a fun class and gave me a lot of information, more than just drink recipes!  we had fun and I gained enough information to easily pass the test!", "pics": null, "resp": {"time": 1553270592443, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101488017923938731213", "name": "ERICA MICHELLE CLAYTON", "time": 1531235432981, "rating": 4.0, "text": "I had a overall wonderful experience, being that I am already a bartender it was beneficial to learn more about bartending and legal terms Ms. Tina is an awesome instructor so takes her time to ensure you understand the material. Going forward through I think the program should be more hands on ex: how could a doctor perform a surgery without proper hands on experience? Yeah sure He can tell you from the textbook but he wouldn’t be able to demonstrate what he learned if someone didn’t physically show him first just saying I know how difficult it can be behind the bar and when you pressured you got to know what you know if not you will mess up a lot of drinks and lose a lot of money because someone has to pay for the mistakes.... I love the class though I will recommend this class to my co-workers..", "pics": null, "resp": {"time": 1531405941472, "text": "Thanks."}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106867172812748643847", "name": "Magan Moore", "time": 1515785776828, "rating": 5.0, "text": "I WENT HERE IN DECEMBER AND THE INSTRUCTOR WAS VERY THOROUGH WITH HOW SHE TAUGHT THR CLASS. SHE TOOK HER TIME TO ANSWER ANY QUESTIONS, TO MAKE SURE WE HAD WHAT WE NEEDED FOR THE TEST, AND SHE MADE SURE WE WENT OVER OUR DRINKS. I LOVED PRACTICING WITH THE DRINKS I JIST WISH THEY HAD REAL ALCOHOL SO THAT WE WOULD BE ABLE TO TASTE THE DRINKS TO MAKE SURE THEY DONE RIGHT!! ITS QUICK AND ITS FUN!!!!", "pics": null, "resp": {"time": 1517951076347, "text": "We're glad you enjoyed it! CHEERS"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107329826393442395484", "name": "cesar ruiz", "time": 1547245349212, "rating": 5.0, "text": "It was an amazing experience , my instructor Tracey was prepared and always with high energy. I learned a lot during my 2 week course.  The schedule was flexible and was perfect for my busy week. I highly recommed this school for anyone who is seeking to begin Bartending.", "pics": null, "resp": {"time": 1547822351144, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100942619037704633632", "name": "Jasmine Carter", "time": 1543532940381, "rating": 5.0, "text": "Ms. Tracy was awesome. Signing up and joining was a breeze The class was fun and full of energy.It was an overall great experience.", "pics": null, "resp": {"time": 1544464470173, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113185211686475364663", "name": "Adrian Norris", "time": 1555094186079, "rating": 5.0, "text": "Tracey was fantastic and I’ve made new friends through my classmates! Definitely worth it!", "pics": null, "resp": {"time": 1555096514560, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111169281539211109255", "name": "Leilani Nicholson", "time": 1528902896772, "rating": 5.0, "text": "the instructor tina is very knowledgeable abd funny, she made learning fun and gave helpful notes to remember. The school was worth every penny. I would definitely recommend learning the trade at this location!!", "pics": null, "resp": {"time": 1529951829126, "text": "Awesome to hear! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107757453926025554868", "name": "Akilah Brown", "time": 1549033649996, "rating": 5.0, "text": "My experience was absolutely amazing!! The instructor Ms Tracy was phenomenal, I love her!!! I learned a ton of information that will help me in my bartending career!! Highly recommend 😊🥂🍸", "pics": null, "resp": {"time": 1550087297928, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114155901713675083923", "name": "Jacqueline Smith", "time": 1540582828915, "rating": 5.0, "text": "Hunni bun, the instructor is awesome 👏 I would always go again and refer lots of students to her. Excellent class wonderful atmosphere", "pics": null, "resp": {"time": 1541168962063, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114427026463655945960", "name": "mugen", "time": 1565621093382, "rating": 5.0, "text": "The class is really fun and teaches you a lot about making drinks", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115360770913430771545", "name": "Brady Grimm", "time": 1547827410132, "rating": 5.0, "text": "Tracey was wonderful! We learned a lot and had a great time! 10/10 would recommend!", "pics": null, "resp": {"time": 1548970454286, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115599724994605355373", "name": "K Sheridan", "time": 1518542315855, "rating": 5.0, "text": "Great school! Instructors were helpful throughout the whole process. Really enjoyed it! I passed with flying colors!", "pics": null, "resp": {"time": 1518565061181, "text": "We're glad you enjoyed it, Karmel! You're going to be an awesome bartender!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112695150510229404233", "name": "Jon Lawler", "time": 1539632529905, "rating": 1.0, "text": "DONT TRUST THIS... The class is illegitimate & if you request a refund when you are dissatisfied, they will refer you to a false email, ignore your future calls, & you’ll be forced to contact your bank to receive a refund.\n\nThe school is physically a real place, but it’s a joke. Your money will absolutely be better spent elsewhere!", "pics": null, "resp": {"time": 1541168993887, "text": "I'm sorry, but We don't see you as a student."}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101797467888064906588", "name": "Quay Griffin", "time": 1528306043526, "rating": 5.0, "text": "The overall class was great, I enjoyed the hands on method of learning and how Ms.Tina made the whole experience of bartending fun. I must say, I highly recommend this class for anyone who is trying to branch off into the bartending industry. This school rocks . ENROLL NOW..", "pics": null, "resp": {"time": 1528315355335, "text": "Thanks for the feedback!, Franquashia! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100896971966951138927", "name": "Mark Victory", "time": 1546633446170, "rating": 5.0, "text": "This class is a very good hands on experience. Learned a lot and enjoyed time spent there.", "pics": null, "resp": {"time": 1547822361982, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102239927896831056517", "name": "Bryan Hardy", "time": 1545410329202, "rating": 5.0, "text": "Tracey was awesome and made the class a blast. I will never forget the order of the speed rack :)", "pics": null, "resp": {"time": 1547822357695, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110237215905854928956", "name": "Jain Train", "time": 1537381217848, "rating": 5.0, "text": "The class was super informative and hands on fun. I really enjoyed it and learned so much so quickly. Ms. Tracey Ellis had very surefire tricks to help you commit the information to memory. I would definitely recommend to anyone interested in bartending!", "pics": null, "resp": {"time": 1541169028999, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114633124985214490479", "name": "Karen McCall", "time": 1515857813194, "rating": 5.0, "text": "I highly recommend this experience. The instructor was very knowledgeable and professional at all times. Great experience", "pics": null, "resp": {"time": 1517951065167, "text": "We're glad you enjoyed it! CHEERS"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103508990306411503608", "name": "A. Thomas", "time": 1509826301542, "rating": 5.0, "text": "Class time was really convenient! The instructor was very patient and professional. I enjoyed the experience overall.", "pics": null, "resp": {"time": 1511903873104, "text": "Glad you enjoyed  it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107560883144015833295", "name": "kadie rudin", "time": 1550847377508, "rating": 5.0, "text": "I loved Tracy, I loved the people I was in class with. We had a good time, while learning!", "pics": null, "resp": {"time": 1553270589896, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101682895492943650047", "name": "Shondra Campbell", "time": 1547831775178, "rating": 5.0, "text": "I enjoyed the class and the instructor while learning bartending skills. The instructor, Tracey aka Hunnibee, was very approachable and witty which made it  comfortable for us to be excited and learn at a fast pace.", "pics": null, "resp": {"time": 1548970452368, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111348289220100611340", "name": "Alessandra “cookielove18” Kennedy", "time": 1530897069095, "rating": 5.0, "text": "The instructor was amazing. She made the class fun while still making sure to teach us the material!", "pics": null, "resp": {"time": 1531405950639, "text": "We're glad you enjoyed it, Alessandra! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117439297026873239977", "name": "Allyson Mitchell", "time": 1541166551350, "rating": 5.0, "text": "Absolutely loved Tracy the instructor, she’s a great teacher with good energy. Highly recomend this class.", "pics": null, "resp": {"time": 1541168958541, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107986995464642017809", "name": "Tracey Ellis", "time": 1537369797246, "rating": 5.0, "text": "Luv luv luv’d it!!!  It was fun , hands on fast paced and definitely convenient location., Ms. Tina was the best she taught me so much and had a wonderful spirit... I would definitely recommend this course if ur wanting to bartend or brush up on skills.", "pics": null, "resp": {"time": 1541169032801, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113833718117280294223", "name": "Sammy Jones", "time": 1462406489721, "rating": 5.0, "text": "If i could rate more than 5 stars, i would. Incredible knowledge to be learned from here. The job placement is real to. Highly recommend this place.", "pics": null, "resp": {"time": 1460993811716, "text": "We're so glad you enjoyed the class! You're going to be an AWESOME bartender! CHEERS! -ABC"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110559769867752856193", "name": "Naomi Izaguirre", "time": 1541448075708, "rating": 5.0, "text": "Awesome instructor!! Fun class!! I Highly recommend this class if you’re thinking about bartending", "pics": null, "resp": {"time": 1542128436813, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117671221710158907663", "name": "Sherry Franklin", "time": 1544458783389, "rating": 4.0, "text": "The class was fun and energetic.   Tracy the instructor was great .  Straight to point but fun.", "pics": null, "resp": {"time": 1544464466997, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115292586267692196411", "name": "Joe Ingram", "time": 1509121239995, "rating": 5.0, "text": "A lot of fun! I learned a lot! The instructor was very helpful. I cannot wait to get started.", "pics": null, "resp": {"time": 1511903878667, "text": "Glad you enjoyed  it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113911310022739059613", "name": "Google mail", "time": 1540388494966, "rating": 5.0, "text": "Alabama Bartending School was great, Tracey was awesome!! I can’t wait to start bartending. I would definitely recommend this school!", "pics": null, "resp": {"time": 1541168968712, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109790201363540275891", "name": "Joyce Moore", "time": 1507560149190, "rating": 5.0, "text": "I really enjoyed the class. I highly recommend Alabama Bartending School. It was a great learning experience, and the Instructor was great!!", "pics": null, "resp": {"time": 1509042677790, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103666922537315369255", "name": "Starr Key", "time": 1530285829092, "rating": 5.0, "text": "It’s a great experience overall and a really fun environment to be in. I would recommend this class to everyone!", "pics": null, "resp": {"time": 1531405969095, "text": "We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105175487996873108588", "name": "Airelle S Peters", "time": 1500989474043, "rating": 1.0, "text": "SCAM\nThis is a scam!!!! Please do not call this place! Soon as they get your credit card info you will lose contact with them and they will disappear. I had to withdraw from the class for family reasons two before my money was supposed to be withdrawn from my account and for those weeks I couldn't get anyone on the phone.They took my money put my account without my permission. They saw that my account didn't have a tuition amount so they still took whatever they could. Then had the nerve to send saying I still owed them money for the class BUT they took  $100 out of my account for it. Once I messaged them back that I didn't authorize that transaction they fell silent again. No one answering the phone or emails. Please others BEWARE!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117163034136464508682", "name": "Michael Todd", "time": 1514636450624, "rating": 1.0, "text": "Likes to steal your money, crooked people, paid for school and never got any classes, owner himself has been in jail for scamming people once before, fake school, and owner is crooked, what more could you want.\nThe reviews you see are actual people that work and have been teachers there, want a real school and actual bar, go to a bar or go to New York they will teach you professionally, This school likes to just steal your credit card info and your money, it's a SCAM and so is the OWNERS", "pics": null, "resp": {"time": 1518565042443, "text": "Sore loser competitor who's other fake reviews keep getting deleted by google so they write new ones. Harassment at it's finest."}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105023985515479802493", "name": "Debbie Treadwell", "time": 1530114461508, "rating": 5.0, "text": "Great class, Tina was a great instructor really learned a lot from her.  Fun atmosphere and overall great class.  Would recommend Alabama Bartending School to anyone. Ready to start bartending!!!!!!!!!", "pics": null, "resp": {"time": 1531405974421, "text": "We're glad you enjoyed it, Debbie! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104931395785581557519", "name": "The GOAT", "time": 1540563359296, "rating": 5.0, "text": "i loved the class. very insightful. would do it. ready to get my certificate - mervin palmer", "pics": null, "resp": {"time": 1541168965298, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107624572525449552077", "name": "Sylvia Gomez", "time": 1521737870875, "rating": 5.0, "text": "Enjoyed the class. I learned a lot about the in and out of bartending and what to expect once I am employed or running my own business! Thank You!!", "pics": null, "resp": {"time": 1523477298883, "text": "Glad you enjoyed it, Sylvia! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113435552516981521662", "name": "Shondria Johnson", "time": 1547238324593, "rating": 5.0, "text": "Great school and great instructor! I'm glad I chose to attend classes here", "pics": null, "resp": {"time": 1547822353474, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "114426333907315943146", "name": "s t", "time": 1519666235156, "rating": 5.0, "text": "I was looking for an informative class regarding bar tending, something I could do on the side. My initial concern was the length of the class in comparison to others companies that offered training. I was assured that this class provided the same information but in half the time, i.e. not a lot of fluff just to charge the student more money.\nAfter completing this class, I have determined that my experience was a really positive one. My instructor was very knowledgeable about her field, she had real life experiences to offer and was very patient. I would recommend this class to anyone looking to complete a course on the in's and out's of bar tending and not having to spend a lot of money to do so. The opportunity for help with job placement is a plus too! I may not get hired into a bartender position right away, but at least I will have the tools in place to work towards that goal. Thank you!!!", "pics": null, "resp": {"time": 1519672435538, "text": "We think you'll be able to start off bartending immediately, especially with your great attitude! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110169684943405940624", "name": "Ambitious Reality", "time": 1524839966107, "rating": 5.0, "text": "I enjoyed every step. I learned alot very fast. Tina is great very patient instructor. She wanna make sure you get the tools you will need to succeed. Im very excited about my new career.", "pics": null, "resp": {"time": 1525100908985, "text": "Glad to hear! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108980637044833781431", "name": "Coleman Jeter", "time": 1516755734751, "rating": 4.0, "text": "If U know nothing about bartending it's good but if U have basic knowledge already its good for a certificate but that's it. the staff is really cool tho and class was fun", "pics": null, "resp": {"time": 1518565090676, "text": "Thanks, Coleman!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106874333353219713786", "name": "Amir Ali", "time": 1516756783846, "rating": 5.0, "text": "The instructor (Shay) was very professional and knowledgeable about bartending and provided the advice I needed to help me not only learn, but understand the expectation of a professional bartender.", "pics": null, "resp": {"time": 1517951058912, "text": "We're glad you enjoyed it! CHEERS"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103117924235187153344", "name": "Tony M", "time": 1505945257435, "rating": 5.0, "text": "I had a great experience.  The instructor  was very knowledgeable  and helpful.  I highly  recommend  Al.bartending  school.", "pics": null, "resp": {"time": 1509042700810, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105819858316595469744", "name": "Whitney Rutledge", "time": 1512145285631, "rating": 5.0, "text": "This Course was very informational.  i enjoyed learning about what Bartending has to offer. The instructor was EXCELLENT! I learned this i didnt even know about!  i would totally recommend taking this course to enlighten yourself about bartending and where it  could possibly take you in your career.  ABC Bartending Rocks!!!!", "pics": null, "resp": {"time": 1512504536199, "text": "So glad you enjoyed it, Whitney! Thanks for the review! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108956362698402013056", "name": "Tiffany Motes", "time": 1555092237157, "rating": 5.0, "text": "Absolutely enjoyed this class & mrs Tracy❤️", "pics": null, "resp": {"time": 1555096516061, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100395006745082949254", "name": "Erica Springs", "time": 1559561478394, "rating": 5.0, "text": "I loved the class.My teacher was the bomb.The class wouldn't be great without her..I give her 100 stars", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111156985407555616069", "name": "Miguel Lee", "time": 1532704456205, "rating": 5.0, "text": "Im so glad I came across this advertisement on facebook. The teacher was great, and i learned a lot of information.", "pics": null, "resp": {"time": 1534523005067, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110732216333112783277", "name": "Tavaris Thomas", "time": 1539215453888, "rating": 5.0, "text": "100 percent reccomend. Tracey's an excellent teacher.", "pics": null, "resp": {"time": 1541168999899, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109827487776230804276", "name": "Brianna Thomas", "time": 1506702901581, "rating": 5.0, "text": "Learn a lot. Really enjoyed this class it’s been very helpful.", "pics": null, "resp": {"time": 1509042696739, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105048273433157599528", "name": "sandra meeks", "time": 1541186090764, "rating": 5.0, "text": "Highly recommend this class , Tracy is an amazing teacher and the class is very great environment.", "pics": null, "resp": {"time": 1542128507703, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115438782736263277120", "name": "Jamika M", "time": 1528468732381, "rating": 5.0, "text": "First I want to say that Mrs. Tina (instructor) is AWESOME!!!! If you are ready to become a Bartender, take this class NOW!!", "pics": null, "resp": {"time": 1528815227474, "text": "Awesome to hear, Jamika! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108545416076616297398", "name": "kanesia woodruff", "time": 1508168323643, "rating": 5.0, "text": "I highly recommend this place! Fun learning environment and nice instructors!", "pics": null, "resp": {"time": 1509042672368, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "118373970524913564800", "name": "Blake Knight", "time": 1565972437763, "rating": 4.0, "text": "Great environment learning was easy and fun!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113399035327004449571", "name": "Renee Renee", "time": 1506706301500, "rating": 5.0, "text": "The class was awesome I learned a lot and can not wait to utilize my knowledge!!!", "pics": null, "resp": {"time": 1509042692558, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113660163714753270509", "name": "Samantha Shockley", "time": 1506955937781, "rating": 4.0, "text": "It was a very knowledgeable class, had lots of fun and the instructor was very helpful. Thanks.", "pics": null, "resp": {"time": 1509042688054, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "112117161436079952597", "name": "Sharon Rountree", "time": 1518023960265, "rating": 5.0, "text": "I learned a lot of information in the class. Great Class!", "pics": null, "resp": {"time": 1518565068657, "text": "Thanks, Sharon!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110552401351414828197", "name": "Brittany Phillips", "time": 1505703501588, "rating": 4.0, "text": "Had fun in class! Shay was a great instructor.", "pics": null, "resp": {"time": 1509042704603, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "104046363756894212729", "name": "Betty Baker", "time": 1558705047254, "rating": 5.0, "text": "The teacher was charismatic, and the class was very informative", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "105843657906801324635", "name": "Mary Smith-Carnahan", "time": 1513352521339, "rating": 4.0, "text": "Very convenient hours for class, teacher was extremely helpful and patient. Finished course last night and hope to be starting a new career soon.", "pics": null, "resp": {"time": 1515777327868, "text": "We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "100136013966588819200", "name": "Teri Clenney", "time": 1514041957451, "rating": 5.0, "text": "Great class I am glad I attended and I  learned so much", "pics": null, "resp": {"time": 1515777312623, "text": "We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "115264282882004015835", "name": "Justin A", "time": 1521220992350, "rating": 4.0, "text": "Definitely enjoyed this class and the teacher! I also learned a few new things i didn’t know.", "pics": null, "resp": {"time": 1521561716769, "text": "Glad to hear, Jay! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113625937946093099571", "name": "jesse barrett", "time": 1533309574311, "rating": 5.0, "text": "Had a great time the teacher was the absolute best", "pics": null, "resp": {"time": 1534522996548, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103712454048871817335", "name": "amber acey", "time": 1553905078432, "rating": 5.0, "text": "Very fun and informative class!", "pics": null, "resp": {"time": 1555096525740, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "108845396373827406422", "name": "MARCUS Dix", "time": 1491014004746, "rating": 5.0, "text": "If i can do it again i would. The  teacher really work with you. I got a job the next day", "pics": null, "resp": {"time": 1479492998840, "text": "Marcus, you ROCK!  So happy about you landing your job! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106407067865062453622", "name": "Taylor Fancher", "time": 1507330304086, "rating": 5.0, "text": "Got my Bartender's License from ABC!!!! Teacher was AWESOME!! Well worth it!!", "pics": null, "resp": {"time": 1509042682935, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113724113942303809257", "name": "JDani96", "time": 1521216019531, "rating": 5.0, "text": "It was great, I loved it\n\n-Jessica Snider", "pics": null, "resp": {"time": 1521561726243, "text": "Thanks, Jessica! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109443003171014248667", "name": "Daisha Rae", "time": 1530482695088, "rating": 5.0, "text": "Great class and even greater teacher!", "pics": null, "resp": {"time": 1531405963973, "text": "We're glad you enjoyed it CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "118362132063175260075", "name": "Sara Lawden", "time": 1462406668448, "rating": 5.0, "text": "Got my Bartender's License from ABC!!!! Loved it! Well worth it!", "pics": null, "resp": {"time": 1462462579834, "text": "Sara, you passed your test with flying colors. WHAT AN ACCOMPLISHMENT! We're so excited to see you start in the bartending field. CHEERS! -ABC"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116759099413040066796", "name": "Michael Todd", "time": 1543704150817, "rating": 1.0, "text": "Absolutely crooked, the owner himself has been charged with illegal doings, they will deny you ever being at there school, I have all receipts and paperwork on this crooked so called bartending school, do yourself a favor and go someplace else and if you want proof,  I have it, just look me up.", "pics": null, "resp": {"time": 1544456730086, "text": "You're not a student, this isn't even a real account. All of your other fake accounts got deleted and this is your newest. Everyone can see you wrote a bunch of random reviews within minutes of each other, and those businesses don't even know who you are."}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "111764973233206553074", "name": "Kristen Brown", "time": 1505014433048, "rating": 5.0, "text": "Great Instructor. Very hands on.", "pics": null, "resp": {"time": 1509042710250, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "117786575822672447633", "name": "kekke young", "time": 1555079104553, "rating": 5.0, "text": "Tracey is an awesome instructor.", "pics": null, "resp": {"time": 1555096517740, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101166473870479372540", "name": "Ethan Whitton", "time": 1515783031971, "rating": 5.0, "text": "I enjoyed the class, teacher was professional!", "pics": null, "resp": {"time": 1517951053928, "text": "We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "106146257614139548544", "name": "amberj smith", "time": 1525887914540, "rating": 4.0, "text": "It was nice I had fun", "pics": null, "resp": {"time": 1526309273670, "text": "Awesome to hear! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110649366144846674882", "name": "shayla millwood", "time": 1559253500950, "rating": 5.0, "text": "Affordable, informative and fun!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "102033087342401786553", "name": "Becca Marie Walker", "time": 1534519830030, "rating": 5.0, "text": "It was fun and convenient.", "pics": null, "resp": {"time": 1534522954813, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "109323375621465430414", "name": "Zac Hutto", "time": 1512834849749, "rating": 5.0, "text": "Great class, fun and informative.", "pics": null, "resp": {"time": 1515777359689, "text": "Thanks Zac! We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "101378705826243992545", "name": "Shelley Joseph", "time": 1356911529860, "rating": 2.0, "text": "Took this course a couple years back. Did not teach me anything of value that you wouldn't learn in a week as a bar back. Also turns out most employers turn away people who have been to this school for \"lack of experience\" and the certification they give you is worth the paper its printed on.Save the money and the time.", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "116779951842133942601", "name": "Tiana Rivas", "time": 1556890743614, "rating": 5.0, "text": "Wonderful instructor!", "pics": null, "resp": {"time": 1556897840143, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "110712232253491907998", "name": "Erikka Wallace", "time": 1512747589528, "rating": 5.0, "text": "Great overall experience!", "pics": null, "resp": {"time": 1515777372489, "text": "Thanks Erikka! We're glad you enjoyed it! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "113790709163354262398", "name": "Ki Mack", "time": 1539352752691, "rating": 5.0, "text": "Very Fun and Informative", "pics": null, "resp": {"time": 1541168996907, "text": "We're glad you enjoyed it! Thanks for the feedback! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "103829081957217202576", "name": "Kebi L", "time": 1601769382013, "rating": 4.0, "text": "Tracy was awesome!!!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107249216511103865840", "name": "Savannah Vasquez", "time": 1523297393792, "rating": 5.0, "text": "Did Saturday classes and it was not hard!", "pics": null, "resp": {"time": 1523477284283, "text": "Glad to hear! CHEERS!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
{"user_id": "107923591290614677582", "name": "Navara Price-Stiles", "time": 1500486333134, "rating": 5.0, "text": "Schedule was great Instructor was awesome!!!!!!!", "pics": null, "resp": {"time": 1509042715111, "text": "Glad you enjoyed it! Cheers!"}, "gmap_id": "0x88890ef142615d5b:0xdf56f92a0b92c8d4"}
