{"user_id": "112220853949849102584", "name": "Melanie Williams", "time": 1609793897328, "rating": 1.0, "text": "I had a positive experience prior so hired Kevin again. I tried to reach him to make things right and could not reach him via phone or text. My flooring was cut incorrectly. I have numerous spots where you can see the slab. Toilets were not correctly re-installed. House was left a total mess. Floors were filthy, grout and sand and debris left in my sinks and tubs. Trim was not replaced where it belonged. Hole was made in my bedroom wall, was repaired, not great. I felt I was taken advantage of regarding charges to remove subfloor. I questioned the high rate and was told it was because it could take days, it took hours yet I wasn’t offered any relief.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_mA4s5pTMLT3UICh3YohBQjafnPw6rqNEOAfO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtqFLNpVE1rJzO9n3rClZYZRQrRX5xAxRdzey9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMoUPFvGAz5jo13F9bWdZcsLtR7UTpBinQKO5CN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOFkVPFXF2iyUjkmPBwLawhvgexqxq4D1BVWr9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6ROpnE3TTIN7vt9pfaDe4CnQxKEEXy0bdsEF7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0erzxaLVnNurrgJ65ksViUkg0axjUz7Pk33JD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNKF8ZhvaWqEWkri2JENMBk3pY2cvtf42AQDv_L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFybDR4MqSoJeUO5EAHMMaiPV9HowBpb9bixRU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlX2229h-Ny72KgQ_IuyX6LpjnSZLWqajzRY2r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMK4UVezvMdV8LvXREu5MSJjhoBdYlZQxSUh8ei=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3vl2NC00nUlE099hTVUSOdGphkdSUJHVcsafa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHlWky5_w6Y6p3eI1PIIm0r6I-oVpEnp4wI_SB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgrHrlA8rMZDkKcrhwFvFE1Q7XYCw2dPlsPQYP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcxiIjDAI9HnrG3UxsV3FFLTTE3U2XbP50M8ws=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "110410250439737212384", "name": "Alex", "time": 1620175013411, "rating": 5.0, "text": "Kevin is prompt and very professional. He arrived on time and notified me in advance when he would be here and what he would be doing. He tore out my old plastic master shower and tiled in a beautiful new one for me. The only negative is my water bill is going to go up because I love my shower now.10/10 highly recommended for tile in shower work.", "pics": null, "resp": null, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "113907057201223468636", "name": "Meredith Zywno", "time": 1579620948292, "rating": 5.0, "text": "Kevin and his team recently replaced some laminate flooring in two rooms of our house with hardwoods. Kevin arrived on time and got the job done well within the expected timeline. He and his team were extremely courteous and professional, and his office manager was very easy to work with. We are very happy with how our floors turned out and will definitely be calling WCR in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNNlBO459dWlDLx8o7ts-VwfDc-jef9cfCBJ1Zc=w150-h150-k-no-p"]}], "resp": {"time": 1604507128890, "text": "Meredith, thank you so much for your positive review!"}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "115815977662471540601", "name": "Dra Coleman", "time": 1586978175028, "rating": 1.0, "text": "The quality of work is very poor.  The quality of work could have been mitigated if problems  we're shared with the owner when discovered.  You  can not suggest or make comments unless you pay for his and son mistakes.  This guy does not listen and have an answer for everything.  I would not recommend this company to anyone else.  I am having to hire someone else to correct his errors with the wood floors installed.", "pics": null, "resp": null, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "102815027768439436293", "name": "Larry Levitt", "time": 1592924447148, "rating": 5.0, "text": "Kevin and his crew work hard to provide quality service in a polite, professional manner. I highly recommend them.", "pics": null, "resp": {"time": 1604507165588, "text": "Larry, thank you for your kind words! It was a pleasure working with you."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "112126647934827977328", "name": "Caryn B", "time": 1561502970253, "rating": 5.0, "text": "Kevin and his crew did an excellent job remodeling our bathtub into a walk in shower. He was kind enough, and patient enough, to work around our crazy hours and scheduling to get the job done. Only one little hiccup with the plumbing but he just called in another plumber and was back on track in no time! Job well done gentlemen!", "pics": null, "resp": {"time": 1568044620435, "text": "Thank you Caryn for your kind words! It makes us happy that you are pleased with our work."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "100725632466140286690", "name": "Ivy Heffelfinger", "time": 1573934924609, "rating": 5.0, "text": "Kevin made the entire process of a tile backsplash seamless. The job was on time, didn’t overspend on material and it was done beautifully. Will definitely keep them in mind for our next project", "pics": null, "resp": {"time": 1579706505862, "text": "Thank you!"}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "108219338770832385708", "name": "Jennifer Greer", "time": 1583337949581, "rating": 5.0, "text": "They redid our master bathroom shower and did such a beautiful job! Kevin was so great to work with and we could not be happier with the outcome!", "pics": null, "resp": {"time": 1604507137515, "text": "Thank you Jennifer!"}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "117719533005660636430", "name": "Buddy Boggs", "time": 1510184510481, "rating": 5.0, "text": "Kevin came to my home in Meridianville as scheduled. He tore out the old tile and sub floor and then put down backer board and new tile. I found Kevin to be very professional, knowledgeable and friendly. All trash was removed and I am well pleased with the work.\nWilliam Boggs", "pics": null, "resp": {"time": 1554995358846, "text": "Buddy we appreciate the opportunity, glad you were pleased with the services provided."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "101481880839484542381", "name": "Melissa Lloyd", "time": 1531252773916, "rating": 5.0, "text": "KEVIN AND HIS CREW DID A FABULOUS JOB REPLACING MY WOOD FLOOR WITH PORCELIN WOOD TILE.", "pics": null, "resp": {"time": 1554995281903, "text": "Melissa it was a pleasure working with you, thank you for entrusting us with your project."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "104540841410596870675", "name": "John Whitman", "time": 1508781787716, "rating": 5.0, "text": "Outstanding work by Kevin and his team: prompt, fast but high quality, informative. Would hire them again.", "pics": null, "resp": {"time": 1554995414433, "text": "John, thank you for the opportunity and we look forward to working with you again."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "113067643194269425298", "name": "Fred T", "time": 1521218012181, "rating": 5.0, "text": "Beutiful work and on schedule.", "pics": null, "resp": {"time": 1554995317427, "text": "Fredrick thank you."}, "gmap_id": "0x88626b4119fb91b5:0x194d563065bf5848"}
{"user_id": "106162136205882408690", "name": "Jerome Roberts", "time": 1628781511386, "rating": 5.0, "text": "Michael and Drew came out to our house-30 minutes early-and found nothing wrong with our drain pipes. They both gave my wife and I peace of mind and didn’t try to rip us off with unnecessary work. I would HIGHLY recommend 911 plumbing and we will always be using them should the need arise. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "108661277654688113107", "name": "Brett Coker", "time": 1623259141219, "rating": 5.0, "text": "Great service and response time.  Kept me informed of when they were coming and were right on time.  Professional service from the office personnel and Drew, our plumber, was very thorough and professional.  Highly recommend this company.  Thanks Drew!!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "103508814361033746139", "name": "Wayne Walker", "time": 1593025375135, "rating": 5.0, "text": "Outstanding young man owns the company & is very conscientious about his work...honesty & integrity is important to Bret.  He came immediately to help me during a bit of a crisis, made the repair quickly & explained the issue thoroughly.  And in my opinion,  for a very good price.  I highly recommend calling 9-1 Plumb for any issues.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "108092568084951689539", "name": "Glen Deal", "time": 1602207071113, "rating": 5.0, "text": "I called 9-1 Plumb on a Tuesday and made an after hours appointment for Thursday (all they had available at the time). I told the \"dispatcher\" Renee (sp?) that I had a water meter ripped out of the ground by Hurricane Sally and that I needed new meter re-installed in ground, hooked and entire new line ran to house. Requested that if anything opened up between Tuesday and Thursday to notify me.\n\nThursday morning Brent contacted me and said he would scope out the job and call me back. Within 15 minutes he called with a description and plan to solve the issue and that his crew (Drew and Nolan) could be onsite within an hour or so and complete the entire job by end of day.\n\nDrew and Nolan arrived as scheduled with all necessary equipment (to include trencher) to complete the job and restore services to my home.\n\nAll of the members of 9-1 Plumb, Brent, Drew, Nolan and Renee were exceptionally professional, friendly, timely and most of all - customer service oriented.\n\nI couldn't have asked for better.\n\nWe very much appreciate their work and most highly recommend them!!!! They will be my first call for any future issues!!!!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "102236839924053641702", "name": "Mitch Pinkston", "time": 1587069317439, "rating": 5.0, "text": "If you are looking for a fair, honest, and professional plumber, call 9-1 Plumb.\n\nBrent, the master plumber, explains every step of the repair process, and he ensures that the job is done in a timely fashion.  Due to poor pipes used by the homebuilder 10 years ago, our house experienced multiple leaks last fall.  Brent responded within a couple of hours of our call and was able to locate and repair the issues.  Eventually, 9-1 Plumb completed a re-pipe of our house.  We received multiple bids, and they completed the re-pipe in a quick and clean manner while also being the most cost-effective option for me.\n\nThis week our original grinder pump stopped working when it met its life expectancy (10 years).  Brent thoroughly checked every part of the grinder pump system to try to find the least costly repair.  Unfortunately, the pump was shot and a replacement was needed.  Brent was able to have a new pump and assembly installed the very next day.\n\nI will call Brent at 9-1 Plumb for all of my plumbing needs.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "113850322904373910748", "name": "Coy Buckley", "time": 1610406379649, "rating": 5.0, "text": "Prompt service and great commmuncation by Lisa and the team. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "113784291193158190780", "name": "Deb T", "time": 1577718587854, "rating": 5.0, "text": "Called and spoke with Brent for a leaking hot water heater. He told me what to do until he could get here. Professional, caring and quality service. Integrity pretty much sums it up. Thank you!", "pics": null, "resp": {"time": 1579727627967, "text": "Thank you for taking the time to give us your review.  We strive for excellence in everything we do.  It is truly our customers that make our jobs worthwhile.  We are here if you need us!\nThe staff at 9-1 Plumb"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "107414923443864291265", "name": "Nicole Michaels", "time": 1609940284257, "rating": 5.0, "text": "Friendly staff and fantastic prices.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "100039495733338832914", "name": "Teresa Kidd", "time": 1556661514798, "rating": 5.0, "text": "Definitely recommend 9-1 Plumb. Very quick service and our call was late afternoon. Professional, courteous and friendly. Had our plumbing problem solved quickly. Will certainly call Doug Mitchell for any future plumbing issues.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "115388995073398673211", "name": "Stan Stabler", "time": 1561926755406, "rating": 5.0, "text": "9-1 Plumb exceeded my expectations. They were very helpful and did a great job. They ripped out an existing shower and installed a new culture marble showers. All the workers were very nice and polite and always left the job site clean. I highly recommend this company.  If I have plumbing needs in the future they will be the one I call.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "103128760584885134308", "name": "Paulette Bullin", "time": 1562859828584, "rating": 5.0, "text": "Replaced my outdoor leaking faucet and it hasn't leaked since :) Brent and Chandler were true professionals, knew exactly what to do and did a great job. They arrived the same day I called and seemed it didn't take very long for them to do the repair. By the way and very important, the price for the work was reasonable. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "109335940499383999255", "name": "Debra Mahanay", "time": 1559175898049, "rating": 5.0, "text": "The whole experience was great.  Kind receptionist and excellent service.  Reasonable price.  Will recommend and definitely call for future needs .", "pics": null, "resp": {"time": 1573512985827, "text": "On the behalf of our staff at 9-1 Plumb we want to thank you for your great review.  We strive for excellence in every aspect of our company.  It is our customers that make this all worth while.  Thank you for your business."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "105570604539758862744", "name": "David Chew", "time": 1560283089872, "rating": 5.0, "text": "We had a clogged toilet drain in our master bath. It has been backing up about once a month for a while. These guys came in and got to work right away. They did not stop until the drain was clear. They went through the toilet first, then the sink, then the shower, and then back through the toilet, and then up through the clean out located on the outside of the house. After all of that they went back to their office and pick up the \"BIG\" machine. Once they got back they ran it once through the toilet drain where it ran into the clog and cut through the major clog and clearing the pipe. We watched at the outside clean out as the nasty clog pushed on through and out to the sewer. Then we saw nothing but clear water after that. No problems since then.", "pics": null, "resp": {"time": 1573513417723, "text": "Thank you for taking the time to give us such a positive review.  We understand our customers concerns and try to take care of them in a professional and timely manner.  We are here if you need us."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "100417612936739737990", "name": "Samantha Pinkston", "time": 1565045080887, "rating": 5.0, "text": "I can't say enough good things about Brent and D.  I called 9-1 Plumb when we had water coming up through our hardwood floor. The dispatcher initially said they wouldn't be able to get to us until the next day, but called when they had an opening later in the day since I had mentioned I wanted same day. We had a different plumber out earlier who told us at best we were going to need a costly repair or at worst would need to redo the plumbing in the entire house.  When the source of the leak wasn't obvious, Brent was thorough in figuring out what was actually leaking and was able to do the repair easily and for a very reasonable price. 9-1-Plumb saved us thousands of dollars. I highly recommend and will use them for all our future plumbing needs.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "108896207220135672303", "name": "Jennifer Davis", "time": 1553874814203, "rating": 5.0, "text": "We just moved in our new home and woke up with plumbing issues with two small children. Lisa and Daniel went above and beyond to accommodate us quickly. They were fast,  efficient and extremely friendly. I would highly recommend this company and if I have further issues they will be my first and only call.\nThanks again,\nJennifer Allbritain", "pics": null, "resp": {"time": 1553879930831, "text": "Thank you for taking the time to give us such a wonderful review.  We strive for excellence in everything we do.  It is truly our customers that make our jobs worth while.  Welcome to the neighborhood and call us if you ever need any plumbing needs."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "106379436873969324348", "name": "Patrick Brindle", "time": 1555694824085, "rating": 5.0, "text": "I'm shocked at the efficiency, friendliness and honesty we received from 9-1 Plumb today. Their operator/dispatch team (Lisa) was on the ball and quickly scheduled us. Our Plumber Brent thoroughly checked our hot water heater, targeted the problem, gave a competitive quote and made sure the problem was fixed. We'll be calling them again for future plumbing needs. Thanks Brent and Lisa!!!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "117758213634724390237", "name": "Carli Ferguson", "time": 1559676336966, "rating": 5.0, "text": "Lovely company and people! Everyone I spoke to was very friendly. Very fast install and at a great price. Definitely recommend this company and I will be using them in the future!", "pics": null, "resp": {"time": 1573513100877, "text": "Thank you for taking the time to give us your review.   It is always wonderful to hear from our customers.  We are here if you need us.  Thank you"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "117911366773019790402", "name": "Knox McMurphy", "time": 1578712339228, "rating": 5.0, "text": "I can’t express how satisfied I was on two occasions  using 9-1 Plumb... Brent was so professional and knowledgeable about every aspect of our plumbing situation ... I definitely will continue to use this company for all my plumbing situations...", "pics": null, "resp": {"time": 1579728184913, "text": "On the behalf of the staff at 9-1 Plumb, we want to thank you for taking the time to give us such a positive review.  We do strive for excellence in everything we do and customers such as yourself make it all worth while.  If there is anything we can do to help just give us a call.\n\nThank you for your business."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "111168567891139960165", "name": "Amanda Newsom", "time": 1539189060383, "rating": 5.0, "text": "Brent and Jake were on time, professional, knowledgeable, explained everything and gave different options to make the best decision for the repairs needed. Not pushy in the least bit nor intimidating. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "110146137678254602982", "name": "Mikaylla Raymond", "time": 1515530749537, "rating": 5.0, "text": "Was having some problems with my garbage disposal, so after hearing great reviews around town, I called these guys! They were able to come that day and were very friendly, even greeted my dogs, pet them, and accepted the 1,000 kisses they try to give to everyone!\nThey got straight to work, found the problem, and quickly fixed it! Professional, quick, and a great staff! Definitely will call them with any issues I have in the future!", "pics": null, "resp": {"time": 1523543321387, "text": "I am pleased to have earned the positive reviews.  We look forward to providing you with the future services you may need! P.S. We love pets!!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "101772389145780473210", "name": "Zach A", "time": 1549896559159, "rating": 5.0, "text": "The Customer Service is outstanding. First Plumbing Business I called told me to call someone else because they had no one on staff and the last 2 didn't answer. They answered quickly and were very knowledgeable. Doug helped fix our problem the same day we had the issue. I look forward to calling them again when I have a problem.", "pics": null, "resp": {"time": 1548711444356, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "102245589501623650781", "name": "Skip", "time": 1545744134475, "rating": 5.0, "text": "Brent, Jake and Vic showed up on time, kept us posted on arrival time. Brent was extremely professional, explaining what was causing the various issues in both baths of the home we brought the week before.\n\nBecause of scheduling conflict, the 9-1 Plumb flip flopped with the company installing shower doors in both baths.\n\nVery reasonable professionals, will recommend to family, friends and strangers!", "pics": null, "resp": {"time": 1548711182839, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "113571059079924049971", "name": "Graham Calvert", "time": 1487247690788, "rating": 5.0, "text": "9-1 Plumb are great!   Doug and Shane came out within an hour of my call and gave me a bid that beat the other two top Mobile plumbers significantly.  After agreeing to the work they were at my house the next morning with heavy duty equipment and replaced the entire sewer and fresh water lines.  The job went smoothly, and they kept me posted through out the process.  They were very thorough in making sure everything looked perfect and cleaning up.  Very professional guys doing honest work, couldn't be happier!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "105099215030922809499", "name": "Mark Wotli", "time": 1520007871524, "rating": 5.0, "text": "Great plumber, showed up on time and very professional.  Answered all my questions and was knowledgeable and did a great job.  I would highly recommend Doug.  And they even cleaned up and took out the leftover boxes and trash created by changing out the faucets....Nice!", "pics": null, "resp": {"time": 1523543128432, "text": "Thank you very much for your review.  We strive to provide quality service with an exceeded level of professionalism.  We are here for any plumbing need that may arise.  It was a pleasure to provide you with the service that you needed."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "114991408214937687185", "name": "Damian Rehorn", "time": 1545800741084, "rating": 5.0, "text": "Quick service with Brent. He came out that day and fixed the issue. 2 days later when a similar issue surfaced, Brent was out again and had me squared away quickly. Never want to have to call a plumber again but if I do, I know who I will call!", "pics": null, "resp": {"time": 1548711107224, "text": "Thank you Mr. Rehorn for the review.  We strive for excellence in all that we do.  Please let us know if there is anything else we can do fore you."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "108188830194471170241", "name": "Elizabeth Steele", "time": 1456786229760, "rating": 5.0, "text": "Doug replaced the natural gas regulator on our hot water heater which had been humming loudly. While not on the original request, they also flushed both hot water heater tanks.  These guys are efficient and friendly -- now that we found them, we wouldn't use anyone else for our plumbing work including repairs or re-model projects.", "pics": null, "resp": {"time": 1470850935306, "text": "Wow that was very kind of  you and we appreciate  your  input. And know worrying  we will be here whenever you  need  us rain sleet or snow. Remember  10% off your next visit . Thanks so much  for  your  business."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "114498675824279423963", "name": "Emma Ard", "time": 1538617949292, "rating": 5.0, "text": "Great experience with this company! The customer service is unmatched. Brent and Jeff fixed a broken pipe at our meter box then later that day we had another issue and Brent and Jeff were at my house within an hour to fix it.  Even though it took an additional two hours out of their day they kept emphasizing it was not an issue and they wanted to make sure they had the problem fixed before they left. I cannot express how much their good attitude and customer service meant to me! Will definitely be calling them in the future with any plumbing needs!", "pics": null, "resp": {"time": 1548711501983, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "106386227363082212786", "name": "Taylor Bell", "time": 1534430232159, "rating": 5.0, "text": "Very fast and professional! Fixed the problem in under 10 minutes- in and out in no time. This is my second time using them and they are my go-to plumbers. (Please drive the 9-1-Plumb  ambulance out next time. i need to see that beaut up close and personal)", "pics": null, "resp": {"time": 1534463229823, "text": "Thank you so much for your appreciation  we will be there 24/7 365 a year to give the same efficient tidy service and not a problem  show up with the lights on  thanks Taylor"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "111455491414664165205", "name": "Patty Easley", "time": 1503417493000, "rating": 5.0, "text": "Doug, with 9 1 plumbing was fabulous!  He fixed a hot water problem that several other plumbers attempted to fix and couldn't.  Fair and honest and very reasonable pricing! I highly recommend him!", "pics": null, "resp": {"time": 1523544020606, "text": "Thank you for the recommendation.  I'm glad that my experience was useful in being able to provide you with the services that you needed!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "105491867257922177618", "name": "samantha davis", "time": 1550258831966, "rating": 5.0, "text": "We had to have our whole house replumbed and a new water  heater installed a few months ago. I can't say enough nice things about 9-1 plumb. They were friendly, fast, competent and anything we had questions about they took the time to explain to us. I would definitely recommend them to anyone who needs a plumber.", "pics": null, "resp": {"time": 1550264864906, "text": "On the behalf of 9-1 Plumb, we want to thank you for taking the time to give us such a positive review.  It is our customers that make our business the success it has become.  We will always strive for perfection in every aspect of our business and the great feedback makes it all worth while.  Thank you again and please call us if you ever need our service in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "113661082025229213069", "name": "Vicki Boyd", "time": 1533328284937, "rating": 5.0, "text": "Doug and Jake arrived within about an hour and repaired my emergency leak in no time!  Quick. Efficient. Competent. Reasonable. Thank you 9-1 Plumbing!", "pics": null, "resp": {"time": 1533334906039, "text": "Thank you Ms.  Boyd for choosing us to help you with your project and your kind words. It was a pleasure  to  have worked for you and we will be there when and if you ever need us again 24/7 365 days a year"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "111170074189195153388", "name": "David Chew", "time": 1537979093822, "rating": 5.0, "text": "We had a great experience with 9 - 1 Plumb plumbing! We had a clogged drain in our house and all three bathrooms were backed up. These guys came the same day I called them for help. They promptly showed up and  started to snake the problem areas and didn't stop until all drains were working well.", "pics": null, "resp": {"time": 1537983898530, "text": "On behalf of all our staff at 9-1Plumb we would like to thank you for taking the time to post your review.  We strive for excellence & are please to know we were able to meet your plumbing needs.  We hope we can be of service to you in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "116426592407138833958", "name": "Leigh Davis", "time": 1538405434974, "rating": 5.0, "text": "Thank you so much to Brent and Jeff for fixing my plumbing problem. I  called at 08:15 this morning and Brent and Jeff were at my home by 08:50 and were done with the job by 09:30.They were extremely professional and quite proficient in their field of work. The issue with the plumbing was diagnosed in 5 minutes. In this day in age time is precious. I'd just got through working double shifts this weekend at the hospital and the last thing I wanted to do today is deal with a plumbing problem or having to wait around all day for a serviceman to arrive. Thanks to 9-1 Plumb in a little  over an hour from when I first called the problem has been fixed and I can relax.", "pics": null, "resp": {"time": 1548711590983, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "117598515663503610687", "name": "Mark Thompson", "time": 1513274856011, "rating": 5.0, "text": "Doug and his crew responded quickly. The quote was competitive and included three options for my water line in. I was having trees removed and stumps ground out, and they coordinated the work with my tree service. Highly recommended.", "pics": null, "resp": {"time": 1513279240713, "text": "Mark we appreciate your review and will continue to bring you excellent work at a fair price."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "105001178072773380813", "name": "Janet Hoffman", "time": 1480524654405, "rating": 5.0, "text": "They are professional, prompt and experienced.  This was the first time they helped us and I won't call anyone else.  The installed a Kohler bidet/toilet with no problem.  I was fearful initially that this would be a unique install for them.   It was installed without a problem and works beautifully.   Thank you so much.", "pics": null, "resp": {"time": 1480552041180, "text": "Thank you very much for your business. We will continue to bring you the best work with quality products. Your words are very kind and it was a pleasure doing business with you."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "103133243075139321061", "name": "Georgia Brown", "time": 1538344189397, "rating": 5.0, "text": "I would highly recommend this company!! I had what I thought was a leaking water heater in my rental house. Water was getting under the laminate flooring. I called Doug after hours. He answered promptly and answered all my questions and said he could come the next day. My renter and I had shut off and drained the water heater. He was there at the time he promised with his co worker Jeff.  They discovered I actually had a slab leak! He gave me a quote that was much less than I expected and said they could start the next day. Brent and Jake came the next morning on time and ready to work. They worked all day with only a short break. They were courteous and professional and also very neat and respectful and careful not to disturb my renter's personal belongings. The job was a 2 day job and they came first thing the next morning to complete their work and worked this day until they finished without taking a break. They showed and explained to me everything they had done. You could hardly tell there had been any work done at all, everything was so clean!! Sorry to write a book, but having these guys do this job made a very stressful situation much less so!! I can't praise them enough and they will definitely get my business in the future!!  Georgia B.  Fairhope, Al", "pics": null, "resp": {"time": 1538408014392, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "102953975611893703258", "name": "Dayna G", "time": 1560965635284, "rating": 1.0, "text": "Had an issue with tankless water heater, shower going cold at irregular times....they came out, flushed the system (which i also did the following day) took 6 minutes...was charged 200. Pretty ridiculous...tech said it was so black and dirty....not true and did not fix our issues.....had them come back...was told to just shut off and turn back on breakers....oh wow...seriously....made no attempt to even open unit or go to next procedure to fix....HE Had no clue.!!! Why waste my time and money....just tell your customers from beginning that 9 1 plumb  has no experience with tankless water heater....instead of robbing customers for an easy buck....i was supposed to here back from him shortly....its been 2 weeks.....unprofessional....inexperienced and a rip off....", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "101569313852678930237", "name": "Noemi Mendez", "time": 1496860320948, "rating": 5.0, "text": "Doug knows what he's doing!!  He makes plumbing look easy.  He's friendly and cares about a successful long term relationship with his customers.  Call him, you won't regret it! He'll get the job done!!", "pics": null, "resp": {"time": 1496938914997, "text": "Wow i appreciate your words! We will be there whenever you need us. Next time you do  i am going to give you 10% off your service call! Thank you so much"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "113884557169944489838", "name": "Jason Harrelson", "time": 1498762788455, "rating": 5.0, "text": "Went above and beyond putting a garbage disposal in for me.  They even helped my wife carry some heavy stuff to the car while I was writing their check out. Great company and great gentlemen!  They made a customer for life.", "pics": null, "resp": {"time": 1548711601833, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "104451974642287018555", "name": "Roland Kidd", "time": 1556822437383, "rating": 5.0, "text": "Quick response, a great job and a reasonable price!  Oh, and a veteran’s discount!  Couldn’t ask for more!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "114118399411540471367", "name": "Sandra Millar", "time": 1510336278733, "rating": 5.0, "text": "Thru this last week, I admit it was a never ending one) seemingly. Doug and his crew have been very good, considerate people, answered all of my questions no matter how strange and confusing. Let me know when they would arrive the following day and close to when they would be finishing up.\nI would recommend them to anyone!\nDoug is an amazing person.\nSincerely,\nSandra H. Millar\n\nAfter finishing all the work, a few issues popped up, but after notifying Doug, he sat a quick time with us to come and take care of the issues, again we're pleased with his work\nSandra", "pics": null, "resp": {"time": 1523543635163, "text": "Thank you so much for the review Mrs. Millar!  We are glad that we were able to provide the services that you needed.  If any other problems arrive just give us a call! It was a pleasure to satisfy your plumbing needs!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "117897364869441221036", "name": "Kem Hopkins", "time": 1550499888113, "rating": 5.0, "text": "Sunday 02/17/19 called thinking we had a link in the ceiling of quest bath due to what looked like water damage on walls. Brent came bye checked our water meter noted that it wasn't spinning and then checked the walls.\n\nThe marks were caused by poor ventilation and paint.. We purchased the house June 2017.\n\n9 - 1, You have gain our trust..\n\nKem & Diane", "pics": null, "resp": {"time": 1550589146697, "text": "Thank you for your review.  We appreciate all the feedback from our customers. We are here if you need us again."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "108225703357534175379", "name": "Andrew (Drew) Lee", "time": 1483653735954, "rating": 5.0, "text": "They provide great service and great prices! Very prompt and very professional! We're pretty new to the area, so it's good to know that we found a great local plumbing service! 9-1 is who we'll use from now on!", "pics": null, "resp": {"time": 1523544680973, "text": "Thank you for taking the time to write a positive review! If you have any future plumbing needs, we are a phone call away!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "101536907449043334081", "name": "Morrow Bullington", "time": 1475188730302, "rating": 5.0, "text": "Excellent service! I have used 91 Plumb Plumbing multiple times, for everything from a clogged drain to a shower remodel. They are professional, punctual and affordable. I would never call anyone else!", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "117991521377407490183", "name": "David Jewett", "time": 1501961558190, "rating": 5.0, "text": "We own Julwins and our hot water line broke on a Saturday.  Doug was there within 10 minutes. He fixed the  problem and got us up and running in no time. Personable and professional, we will use 9 1 plumbing for our future plumbing issues.", "pics": null, "resp": {"time": 1523544441671, "text": "Thank you for your review Mr. Jewett! We are glad we could perform our services at your business! We look forward to providing you with any future plumbing needs!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "108183839024683451203", "name": "Donna Dorriety", "time": 1495137519197, "rating": 5.0, "text": "Wow!! Doug did a fantastic job! He is prompt, courteous and efficient!  His pricing is very fair also!  He installed a new disposal and repaired my toilets and shower heads.  Give him a call!!", "pics": null, "resp": {"time": 1495164372452, "text": "Thank you for calling us and giving us your business. We will continue to be there if you need us rain or shine"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "109532979198994212386", "name": "Barry Bush", "time": 1495246163712, "rating": 5.0, "text": "Doug was friendly and professional. He knew exactly what needed to be done and showed me what was going on!\nDid not create a mess and was a expert multi- tasker! Highly recommend!!", "pics": null, "resp": {"time": 1495164278697, "text": "Thank you so much for your kind words. It was a pleasure for me to have been able to help you with your project."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "115713192305086308935", "name": "David Schwartz", "time": 1500413918943, "rating": 5.0, "text": "i called on short notice with a backed up bathroom drain and was told they would try to work me in around 2 pm. At exactly 2 pm my door bell rang and two very professional men introduced themselves and had my problem resolved in only 45 minutes. I would highly recommend Doug and this company.", "pics": null, "resp": {"time": 1523544513529, "text": "Thank you very much for your recommendation!! If you need us again, we will be there!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "105010009090537145850", "name": "Pamela Akins", "time": 1539788111686, "rating": 5.0, "text": "Great experience. Fast and professional.  Fair rates.", "pics": null, "resp": {"time": 1539791057491, "text": "Good morning & thank you for taking the time to give us a great review.  We appreciate your business & strive for perfection in every area of our Business.  Please let us know if we can be of any service to you in the future.  Have a blessed day."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "107445837335313101952", "name": "Donna Austin", "time": 1492614322851, "rating": 5.0, "text": "We hade a very good experience with Doug who repaired our toilet. He was knowledgeable, courteous and on time. The price was very fair, and Doug worked with our schedule. Thanks, 9-1 Plumbing! Tim and Donna Austin", "pics": null, "resp": {"time": 1523544602058, "text": "We are glad we could provide you with a pleasant experience!! Thank you for your review!  We are a phone call away for any future plumbing needs."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "116111411989414201099", "name": "Marissa Thetford", "time": 1492716935891, "rating": 5.0, "text": "We've used Doug and his team twice and have had a great experience both times.\n\nThe first time he repaired a leak in the laundry room behind our washer which caused flooding into our kitchen. He responded quickly, after hours (at night on a weekend), and dina great job.\n\nToday we called on him again to install a garbage disposal in our kitchen and check a leak behind our master bathroom toilet. The disposal was easy, but the bathroom was a bit trickier since he didn't know what he would find behind the wall. He walked me through the steps he was taking and provided a price range based on what he might find once he got started which was helpful. (That way we knew what the high end might be if damage was extensive or the repair was more complex than anticipated.) Thankfully, it wasn't as bad as it could have been and itwas easily fixed in one visit.\n\nThe 9-1 team is on time, professional, and affordable. Doug and his team were also very clean while working on the repairs which was much appreciated. I'd strongly reccomend the 9-1 team to anyone in the area looking for a reliable plumbing team.", "pics": null, "resp": {"time": 1523544321557, "text": "Thank you very much for your recommendation! We strive to offer quality professional plumbing work. We are pleased that were able to provide these services to you and will be there if needed again!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "104611330741291188081", "name": "Alec Breaud", "time": 1495036127311, "rating": 5.0, "text": "Very fast and good service replacing a toilet.  Thanks for the great work!", "pics": null, "resp": {"time": 1523544159999, "text": "You are very welcome!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "115306233105826529160", "name": "Harry D", "time": 1463929087068, "rating": 5.0, "text": "Excellent service and price! Completely professional!", "pics": null, "resp": {"time": 1470850641413, "text": "Thank you very much Harry  for the kind words and the review. For being such a great  customer  we would like to offer you 10 percent  off  of your next service  call thanks  for your  business"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "107138228045840469845", "name": "dbm2255", "time": 1502383305028, "rating": 5.0, "text": "Easey-Peasey!  Doug replaced 50gal gas HW heater at very reasonable price!  Price included installation of a high quality Rheem heater, all installation, bring everything up to current code requirements, and haul off and disposal of old!!  Done in three hours!\nHighly recommend 9-1 Plumbing!!", "pics": null, "resp": {"time": 1523544124349, "text": "Thank you for your praises!! We are pleased to be able to provide you with a great experience and the services you need!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "113217696438434003822", "name": "Mike DeCuir", "time": 1462396954090, "rating": 5.0, "text": "Great Job, fair price.\nWould call them again.\n\nMike D.", "pics": null, "resp": {"time": 1470850783865, "text": "Mike it's great to see that you are happy with our work and when you have to call again rest assured that will will give you the same great service but this time with 10% off the total price of  the  job thanks"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "117298017540025558729", "name": "Tracy Gilley", "time": 1599605286240, "rating": 5.0, "text": "Courteous, honest, and quick.", "pics": null, "resp": null, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "109432498576339620740", "name": "Angela Mayer", "time": 1503942230695, "rating": 5.0, "text": "Fantastic service and quick to get the job done!! Will definetly use again when needed!", "pics": null, "resp": {"time": 1523543679075, "text": "Thank you for your kind review!! We are here when you need us!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "112951405065035799688", "name": "susan nicholas", "time": 1478798362677, "rating": 5.0, "text": "THIS PLUMBING ASSOCIATION GOES THE EXTRA PVC PIPE FOR THE CUSTOMER! WE THANK AND RECOMMEND THEM!", "pics": null, "resp": {"time": 1478798790826, "text": "Thanks so much for the kind words we will continue to be here for you through out"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "111813925914123113317", "name": "Eric Ludwick", "time": 1515800709555, "rating": 5.0, "text": "Stayed until the job was done!  It was tougher than expected.  Thanks", "pics": null, "resp": {"time": 1523543174300, "text": "You are very welcome! It was a pleasure to provide you with your plumbing needs!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "107744136437211481991", "name": "Vanessa Chambers", "time": 1503942166017, "rating": 5.0, "text": "Awesome service and timing!! Thanks guys!!", "pics": null, "resp": {"time": 1523543701535, "text": "You are very welcome!!!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "107409421294318959516", "name": "Angela Morgan", "time": 1487652182313, "rating": 5.0, "text": "5 out of 5. Conscientious, timely, excellent work!", "pics": null, "resp": {"time": 1548711614051, "text": "On the behalf of everyone at 9-1Plumb, we want to thank you for taking the time to put in your review. We strive for excellence and to keep all our clients happy. We look forward to servicing your plumbing needs in the future."}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "115550246483223363863", "name": "Robin Hollon", "time": 1503060657657, "rating": 5.0, "text": "Great experience.", "pics": null, "resp": {"time": 1523544064402, "text": "Thank you for your review!! If you need us again, we will be there!"}, "gmap_id": "0x889a419feded54f5:0x4a5273a6014e1476"}
{"user_id": "115601923595427177070", "name": "Denise Hicks Young", "time": 1551342024455, "rating": 5.0, "text": "Friendly work inviroment. They participate in the work release program also. They also have insurance and 401 k plans available. For those who aren't familiar with this company they make bathtubs.", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "111029684615760833593", "name": "Sean Lee", "time": 1556143172522, "rating": 5.0, "text": "I work here its great", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "116265683245673254984", "name": "Eric's Angel (EricsAngel)", "time": 1559160051054, "rating": 5.0, "text": "Great place to work.", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "107548073873156962772", "name": "Linda Cornelius", "time": 1556669485103, "rating": 5.0, "text": "Great product..Bathtubs10", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "117531344642115972090", "name": "Darran Hampton", "time": 1554067464764, "rating": 5.0, "text": "Does not sell to public,but a great place to work", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "104965748826586225930", "name": "Travis Chambers", "time": 1526671672262, "rating": 3.0, "text": "I went for a job interview. They do not sell to the public.", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "102795648326210098841", "name": "Shawna LaShae Spires", "time": 1473664184204, "rating": 4.0, "text": "Makes quality tubs & showers. One of few employment opportunities in Double Springs Alabama", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "107804631598073812094", "name": "Amber porter", "time": 1575227964718, "rating": 5.0, "text": "Good work", "pics": null, "resp": null, "gmap_id": "0x88880d0602fdd19d:0x1776e8fde0a0e155"}
{"user_id": "108816298731730930538", "name": "Bill Hester", "time": 1609507893437, "rating": 2.0, "text": "Very unprofessional staff lacking basic knowledge about their products. Somewhat condescending to my wife and myself when we questioned what we were being told. Pricing is very high on their stuff (didn’t realize this until we met with a couple of other companies in town.", "pics": null, "resp": {"time": 1609515714572, "text": "Since COVID, we have been appointment only and I don’t have a record of your visit in our database.  I am extremely sorry you had a less than excellent experience with us. We strive for perfection when it comes to customer service and product knowledge so I’d love the opportunity to speak with you personally about your experience. You can ask for the showroom manager during normal business hours; M-F from 9:00 to 4:30. Thank you.\n\nUpdate:  Mr. Hester, I was hoping you would have called by now to discuss your negative experience you had with us so I could extend my apologies personally and see if we could rectify the situation. We are still open Monday - Friday from 9:00 to 4:30. Please call at your convenience. Thank you."}, "gmap_id": "0x88626b5150cc9bab:0x1852ac85f3f9d264"}
{"user_id": "104043006258473326530", "name": "Joe Fullington", "time": 1567253953658, "rating": 5.0, "text": "Great individual service.   Personalized attention and knowledgeable staff.", "pics": null, "resp": {"time": 1567261213329, "text": "Thank you for your kind words!"}, "gmap_id": "0x88626b5150cc9bab:0x1852ac85f3f9d264"}
{"user_id": "107795379448636455143", "name": "Josh Templet", "time": 1529527319931, "rating": 5.0, "text": "Top notch staff and selection. They only place to shop if you're in the market for high quality kitchen and bath fixtures.", "pics": null, "resp": {"time": 1544875043209, "text": "Thank you so much!!"}, "gmap_id": "0x88626b5150cc9bab:0x1852ac85f3f9d264"}
{"user_id": "102916749185922118953", "name": "Tyler Englestad", "time": 1552007259987, "rating": 5.0, "text": "Awesome showroom, friendly and knowledgeable staff. Great place!", "pics": null, "resp": {"time": 1561932590378, "text": "Thank you so much Tyler!!"}, "gmap_id": "0x88626b5150cc9bab:0x1852ac85f3f9d264"}
{"user_id": "116002674310051232586", "name": "Jessica Salinas", "time": 1544735531319, "rating": 5.0, "text": "Great service! Absolutely wonderful to work with.", "pics": null, "resp": {"time": 1544875028583, "text": "Thank you so much!!!"}, "gmap_id": "0x88626b5150cc9bab:0x1852ac85f3f9d264"}
{"user_id": "107317983663779951558", "name": "robert darnell", "time": 1616066512350, "rating": 5.0, "text": "Great place to find quality fixtures for your home reno or build. Scott is very knowledgeable and doesn’t sell you on anything you don’t want. Will shop here again!", "pics": null, "resp": {"time": 1616070430109, "text": "Thank you so much, Robert!  We appreciate your business!"}, "gmap_id": "0x889a6aa1ba61b2e7:0x15abce5abd636ade"}
{"user_id": "116551341788773126675", "name": "Peeka T.", "time": 1624448240903, "rating": 5.0, "text": "This store looked great! My sis and I had a great time walking around looking at all the treasures that Home Goods has to offer. Its literally a treasure hunt. To the untrained eye, some items may look like they are priced averagely, but to those of us that understand quality, this is where we go first before heading out to over priced department stores. One could browse this store for hours. The employees do a great job keeping this Home Goods location organized. There are plenty of good finds for all ages.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNCmUUvAcwUFcp74yEZ7rhWSm0XGZ9DmvcCtiKc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO5vWQVM4AsFpDp8Hzsdt0oQCMFqwkgIY8UGvwn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMqyJWDqt5fi9VPfV1E9XnxQ-BLkgmxmEwsDaRI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPTeIRTxB_F0Zm5RsejrT9yopre9sh-d3XQjh_T=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "113910808179907448628", "name": "Brittany Greer", "time": 1622955196037, "rating": 5.0, "text": "Such cute things, organized, and very clean. It's impressive they're able to keep so much so well organized when similar stores can't seem to keep a single shelf straight. Always a positive experience.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "109745190621531819619", "name": "Elisha-Hope Weaver", "time": 1614341619870, "rating": 3.0, "text": "The locations observes Covid safety measures.\n\nLocation currently has a good select of inventory. Staff seems to replenish inventory as it becomes available. *Friendly suggestion* if you see something you like, BUY IT THEN! (Most inventory doesn't last long and is RARELY duplicated)\n\nLocation is neat and orderly, however navigation in the aisles can become congested if directional floor signage not observed.\n\nStaff is friendly, helpful and professional.\n\nOverall, it was a pleasant shopping experience.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "117353542687827564222", "name": "Laura Grayson", "time": 1568140382542, "rating": 5.0, "text": "Just came to see the new store that was added. They have some great finds. Wasn’t really looking for anything today but I’m being tempted to buy. It’s pulling me in. 😬😬😬", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGsxg8k5u3AgujaVpz5Imr9Yt_h1pli8UFxa3W=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOBV-J8QdO-WiQy0TkbBAdqNpuVZkAz0PPLc3Fr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNSk2tqjOklac2q9oJyy2_tVVuE9lLt9vsGlH3l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIzc-o9bNBYnAovnNB1URRO9uYGlYrBZYGyNHH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMHMbe2qWR3cu93VSNZPIsFWiT97ybtjwMwJ-JO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPynWXUAA_G0G2DOicV-9iLu6vXI8OsHljn5jHi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMR_AKXQhGaZUZrIyVsloodEQh42T0-IOTNb0n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdPy4AvMllERFO1cIofMudIe0qfeicSXt8zwNe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNG2mW0xFkIP15wbPYpO8S4BqFGYKcNsNSXWU85=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORKNDJ83KzA0VOFq0VP_YCixjVsKqR_mXwPolZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRfQhg8eFN7VnbnE1szXXCWkSs22OV97Y8oIsv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2HO0zV4tHEBz1qprIihgWlAPOfw43k3vh280Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNuzvO6wZnaCMDSxnRI0B-mLnJzTnkr1TL2-pnz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "109729268944815914634", "name": "K S", "time": 1618619719840, "rating": 5.0, "text": "I love this store, it's full of really great products, for a super great prices.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "111894187656827410527", "name": "Linda Glover", "time": 1616247145130, "rating": 4.0, "text": "I adore HomeGoods this is a good one, well-organized and tidy", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "115972697703407323859", "name": "Callie Rhodes Outlaw", "time": 1575994978117, "rating": 5.0, "text": "Good selection and prices.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPK5ddnDFDnWx8c2xm98G8BQ2ajTBSZV18BhInl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "107267632370222360409", "name": "Brandon Pritts", "time": 1608150741989, "rating": 5.0, "text": "Always great deals! Clean and organized!", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "106426091377623047585", "name": "Phyllis Spates", "time": 1591745175752, "rating": 1.0, "text": "Prices higher than I expected.So I walked 2 doors down to Ross who had many of the same items for half the price.Good things come to those who wait.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "106464022985687355047", "name": "Virle Owens", "time": 1577977062262, "rating": 5.0, "text": "This place is awesome. I could literally redecorated my whole house from this store. The help is wonderful also.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "106673566673628085438", "name": "Rhonda Baccus", "time": 1605302273631, "rating": 4.0, "text": "Great stuff just a little high", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "100239984940246237410", "name": "Chanel Rubio", "time": 1585171245895, "rating": 5.0, "text": "Very clean and organized.  I love their clearance isles too.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "116035274509253574176", "name": "Lashanda Banks", "time": 1606260798222, "rating": 5.0, "text": "Well stocked and great service", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "107836572842407925353", "name": "LaShawn Wright", "time": 1577122339491, "rating": 5.0, "text": "HomeGoods is great for giving the perfect gift or even shopping for yourself, they have all types of beautiful items ,You definitely won't go wrong 😁", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "112154179519992619574", "name": "RTS", "time": 1584448283542, "rating": 4.0, "text": "You definitely can find beautiful home decor here. Isles are tight.", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "103454276778372562714", "name": "Debbie White", "time": 1591988167472, "rating": 5.0, "text": "My favorite place to shop for anything for my home or patio!", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "116332129684450467497", "name": "Tom Shelton", "time": 1592073079762, "rating": 5.0, "text": "Very nice store", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "108328456837040185424", "name": "Sharon McShan Harris", "time": 1579213715668, "rating": 2.0, "text": "Really good", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "112746452518769724529", "name": "Joanne Romanek", "time": 1580343509239, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "112066556119618415700", "name": "Sherry Ann Weller", "time": 1629500932698, "rating": 4.0, "text": "Lots of pretty stuff", "pics": null, "resp": null, "gmap_id": "0x8888a9d6a147cc8b:0xd2e2ab420121766f"}
{"user_id": "115521850178509058387", "name": "Tj Hamlet", "time": 1393257266029, "rating": 5.0, "text": "hands down one of the best place to work .i enjoy working there the staff is nice and friendly and the business is wonderful. great management!!!!!!", "pics": null, "resp": {"time": 1454637492366, "text": "Thanks for your review. We are working hard to server our employees and customers."}, "gmap_id": "0x88892e34b85feaf1:0x888db65ef2c61b1c"}
{"user_id": "117510804903883491067", "name": "Nicolae Borta", "time": 1544631003742, "rating": 5.0, "text": "Nice people,  empty in 25 min.", "pics": null, "resp": null, "gmap_id": "0x88892e34b85feaf1:0x888db65ef2c61b1c"}
{"user_id": "110290691939208396692", "name": "Joshua Leamer", "time": 1607432794590, "rating": 5.0, "text": "Went right in and walked to my section(Plumbing). When I got there an employee was straighting up the shelves, and had no customers in his area. He was wearing proper PPE, and he was knowledgeable about his section. The line was short, 1 person in front of me, and 2 self check out lanes open", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "103359442376434767709", "name": "Debbie Dunaway", "time": 1627758458892, "rating": 5.0, "text": "Great selection.", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "101432243575159921744", "name": "Reed Shiver", "time": 1580421297705, "rating": 5.0, "text": "Best place to go for everything plumbing, keeps our business running. Chris and Louis good guys, always welcoming and get us what we need.", "pics": null, "resp": {"time": 1580756244855, "text": "Reed, thank you for the great review of our team here at the Auburn location. We love hearing that Chris, Louis, and the rest of the team provide you with welcoming service and all the products you need. We look forward to the opportunity to work with you again soon."}, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "114282995232530411371", "name": "Ryan Kirkland", "time": 1551975700418, "rating": 5.0, "text": "I can’t say enough great things about the customer service here! Chris Vaught and Lewis were so helpful in getting me the quality of appliances and fixtures I wanted and helped me stay in budget. We ordered all our appliances from them. Have already recommended them to a friend working on a remodel.", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "113184122059279883811", "name": "Jay Neese", "time": 1558459231151, "rating": 5.0, "text": "Great customer service. Had an unusual part I was looking for and Luis was super helpful in finding what I needed. Will be back for sure in the future", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "100003680000238010413", "name": "Thomas Heflin", "time": 1572041385897, "rating": 5.0, "text": "Overall superior customer service compared to there competition.  A company of solutions. Great job!", "pics": null, "resp": {"time": 1572285411422, "text": "Thomas, thank you for the 5-star review of us here in Auburn.  We are thrilled to hear that our staff provided you with superior customer service and we hope to see you again soon."}, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "117836956416829903826", "name": "Shane Allen", "time": 1553698550088, "rating": 5.0, "text": "I have to say that the level of customer service I receive from ferguson is great! Chris and Luis  Merly are always very helpful and always help me with all of my plumbing needs.", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "108870224347488679957", "name": "Randy Shaw", "time": 1547741406741, "rating": 5.0, "text": "Chris was very helpful in my search for plumbing parts.  Thanks,", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "112081051267195525906", "name": "Henry Brandhorst", "time": 1531171757979, "rating": 5.0, "text": "Friendly service. Full range of required parts.", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "100157352809016900628", "name": "Matt Anderson (Drunken Senpai)", "time": 1547740695786, "rating": 5.0, "text": "Very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "103690107486875693646", "name": "John Bandy", "time": 1469828736303, "rating": 5.0, "text": "Not sure if it is a good", "pics": null, "resp": null, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "110447628338124630588", "name": "Mannus Foster", "time": 1578972289137, "rating": 5.0, "text": "Good people", "pics": null, "resp": {"time": 1579013261836, "text": "Thank you, Mannus, for the 5-star review of our Auburn location. We take pride in our associates providing all our customers with friendly, helpful, and knowledgeable service. We look forward to seeing you again."}, "gmap_id": "0x888cf2aea1931443:0xd8caea99433757df"}
{"user_id": "113395448725191976267", "name": "Colin Tomblin", "time": 1627145910401, "rating": 4.0, "text": "Awesome furniture and lighting. It’s a little pricey but great quality. The only downside to this location is that it is quite small with not much to see on display. There weren’t many employees available to offer assistance or answer questions. I highly recommend visiting the multi level Nashville location if you want a better experience.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO98NR2vD0Vd8308p7UDtBN_5y9nFHLylNJeHXN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh_B7gs7SzrFjJb55MttNW3-2TxUkZ1mYL5lne=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCl9yWzKLk0U-RQkuMvoLP3F5KBJc1q0CJ8WQJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3AyvrAAFMjBHu4rMFza0if70L3T7jPILNAYAQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxQK159SRAu-rUIYX-rIT_QxMm0d5BNescSmMp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPOhJrCibtn9PmlWEl3gAyHS2TVv4dgC2vhE5i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPHqbLTa8-4oTHYD9sdlIgTZY9HLvDtGst_6I_d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLoethET3gl3NoV9SUJ6U5IP0pxKEVNNvHiWdI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFLDq2R8Rmz-6VReFkISLCiiO57pXx0L0lhSkC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6IQh25lCNVXYssDd1EPXBXreaA8_KQLFwnNEj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMsgTNUK6lxXWAmBnnoC9s6YWirvz_ejUeGWoPG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2r1rS6EUnw4Ikoo_dTZ14znRZv8L2jzYl-UAP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMqOeEYWkXfy0kOPHe0TaPgtNWRaj2S7me5UyWx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbjFuhGIqTEiEpENdsrC4-J98I9r4QN63z967r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOsDqaXMzxUYiTfj6VtQrswSI3K-oEE-YTl6XIa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "107224526507693509263", "name": "SantanaTyree", "time": 1601951897863, "rating": 1.0, "text": "SAVE YOURSELF THE TIME AND DO NOT GO HERE. See below:\n\nThe customer service was absolutely awful. If you are looking for a warm, inviting environment, RH at the Summit isn’t the place whatsoever. You will be completely disappointed if you receive the treatment we did. You will especially be disappointed and appalled if you had just left Bassett Furniture in Hoover where they took the time to do the following: cultivate a relationship, show you around their showroom, listen to what your needs are, and sit down to customize furniture based on your specifications. For lack of words, the feeling that my husband and I received at RH: “We are RH, our products speak for themselves, so we are not going to do our job at all. We are not going to try to educate them on our selections/options. I am not leaving my computer to assess their needs. If they want something, they’ll ask me then buy it.” The ONLY information we were given was about looking online and a RH book when we got ready to leave because I couldn’t take it any longer. Not once did the lady offer to look at fabrics with us, to go over color selections, discuss what their process was, etc. (We were wanting custom furniture for a spec home and this was stated.) When I asked a question, the response was very much short and NON-informative, I was told to look online which defeats the entire purpose of going in store. The lack of willingness to assist us has left a LASTING impression. Because of that, we are HAPPY to spend MORE elsewhere because of superb customer service. There are numerous competitors; a product can easily be mimicked, customer service can’t.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "112757506915179676220", "name": "Vicki Dukes", "time": 1604806968634, "rating": 5.0, "text": "I had been looking for a table and chairs for my kitchen. Found what I wanted online. I wasn’t ready to order, though, without seeing it. My husband and I made the 1.5 hour trip to Bham. I had talked to Loren on the phone before I came. When we got there, Loren helped us. She was very professional and knew what she was talking about. It was a very good experience.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "110620217594569393760", "name": "Brian Panos", "time": 1616100515985, "rating": 5.0, "text": "Nice stuff but pricey!", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "110141350351656074558", "name": "Jennifer Jones", "time": 1604379428320, "rating": 5.0, "text": "Thank God for Rebekah!! I visited RH for the first time on 10/26 during my quick little birthday getaway. This was actually my first time EVER visiting an RH store. Rebekah greeted me enthusiastically. She was so nice and personable as she engaged with me and answered any and all questions that I had. I really enjoyed chatting with her. She was very cheerful, bubbly, and helpful. I really didn't sense the same vibe from the other few associates I saw standing around in the store. The guy who greeted me at the door was also warm ams and inviting. Thank you soooo much Rebekah for being so friendly and kind!!! Little did she know, I had just lost one of my closest friends to Covid-19 who was buried just that Saturday before. So, I was out and about trying to enjoy my birthday in spite of. This was my first visit to the Summit, and Rebekah was one the best experiences I had that day. She really need to spend time over at Saks and Seasons 52 training some of the sales associates and waiters on good customer service and how to demonstrate it. God bless you Rebekah!!", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "100267936957911690744", "name": "ivo horak", "time": 1595633621321, "rating": 1.0, "text": "Bought a cloud with terrible cushions that don’t hold their fill just after a single use.   There is no way a cushion should have to be disconnected and fluffed every single time.    Now they told me that it would cost $1400 to replace them to cushions  that will hold their shape.   Extremely disappointed with a multi million dollar company that can’t remedy a simple problem.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "116063269017392885493", "name": "Wallace Brown", "time": 1601246195756, "rating": 5.0, "text": "Excellent service and great quality.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "110192657877984228995", "name": "Quitta Williams", "time": 1583608359545, "rating": 5.0, "text": "Really big zoo. Beautiful animals. We enjoyed it.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "114699804228184711522", "name": "Sam Wilson", "time": 1564789947313, "rating": 5.0, "text": "Our experience at this store has been maybe the best experience we have ever had. Rebecca Howsam is incredible. She is not only a pleasure to work with, she is friendly and helpful and always puts customer first.  She has went out of her way to make sure we are happy and love our furniture - both inside furniture and outside.  Thank you Rebecca.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "102456939053545396644", "name": "Susan Hanley", "time": 1523730312942, "rating": 1.0, "text": "If you could assign less than one star I certainly would. I just spent over 20 minutes in Restoration Hardware at the Summit waiting for someone to wait on me (or even speak to me) and obviously they do not need my business because they did not even acknowledge me although they looked over at me several times. There were three sales associates and at the very beginning they were each with someone but then one became available when her customer left and she immediately disappeared to the back of the store. Again keep in mind they all saw me and said nothing and when the sales rep  finally came back out from wherever she went, another person  walked into the store and she asked if she could help them. Wow! I wanted to purchase a king bedroom suite I saw in their catalog which would have been well over a $10k purchase but I guess they do not need my business. I’m taking it somewhere that someone will actually acknowledge you  walked into their store.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "107596952620806414896", "name": "Peyton Preece", "time": 1510094173373, "rating": 1.0, "text": "We have spent over $15,000 in furniture from RH, live 2.5 hours away and pay over $350 for shipping each time we order or buy something. They were unwilling to replace a defective rug (they deemed it defective) and discount another rug we were willing to buy. Do yourself a favor and go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "105442850663540391426", "name": "Juanita Motley", "time": 1597887031355, "rating": 5.0, "text": "Love the decor", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "118405631177379047664", "name": "Brian Robertson", "time": 1574510598611, "rating": 4.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "105988375084610272911", "name": "Eric Wilson", "time": 1570589851853, "rating": 5.0, "text": "Cloud couch", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "117198605546347316733", "name": "g hegenbarth", "time": 1541275838346, "rating": 4.0, "text": "Must haves and stuff", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "113629235163347046570", "name": "FAZLUR REHMAN", "time": 1570084013877, "rating": 2.0, "text": "so so", "pics": null, "resp": null, "gmap_id": "0x88891770a20fc855:0x9e71ef0f5478c3e5"}
{"user_id": "109074285333789291903", "name": "Lynne Thrower", "time": 1573701113501, "rating": 5.0, "text": "SGC has done several installations for me and the service was very professional, the quality of both the product and the work was excellent and the prices were reasonable. I have recommended SGC to several people who were also pleased.", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "108914812165025087788", "name": "Janet Grant", "time": 1573596412465, "rating": 5.0, "text": "Standard Glass has installed several heavy glass shower doors for me and their service and professionalism is 5 star plus.", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "111929482190000538915", "name": "Dr. L. Dansby", "time": 1534171912189, "rating": 1.0, "text": "Horrible customer service. Does not take debit, just cash or check. I had him to give me an estimate on two window squares that were broken out of the window pane. The quote was $135. My neighbor let him in and I was put of town and called to tell him to go ahead and do the work. I did tell him I would mail come over the weekend and drop off, but I couldn't make it due to a flat tire and traffic. I did come to Montgomery early Monday morning to give the check personally because he stated he would do the work monday. I called him to let him know I was in town and ask was he still going to do the work and he was VERY RUDE and stated I didn't leave it in the drop box and he couldn't drop what he was doing and he already scheduled his day. I explained to him traffic was bad and that I chose to come early Monday, bc he was closed the weekend. He stated that traffic was bad in Montgomery and had an attitude.  I told him not like Birmingham and I tried to proceed, but due to his RUDE customer service I wanted to do business elsewhere. I called Lee co and got a cheaper quote for $95, they accepted debit and will be on the way......HE DOESN'T HAVE THE MONOPOLY, COULD HAVE BEEN MORE COURTEOUS  AND UNDERSTANDING EXSPECIALLY WHEN PEOPLE ARE TRYING TO SPEND THEIR MONEY.", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "105538990660393038971", "name": "Robert McGhee", "time": 1558099143986, "rating": 4.0, "text": "A good place to purchase replacement glass for broken windows.  The customer service was good and a short wait time.", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "109601200058426556711", "name": "Christina T", "time": 1490450511504, "rating": 5.0, "text": "Very quick and professional. Bring cash or your check book though because they don't take debit or credit cards.", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "111191518226168983418", "name": "Lester Williams", "time": 1594135130507, "rating": 5.0, "text": "Very Good glass Co", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "104849543815083297772", "name": "david schofield", "time": 1558703294296, "rating": 1.0, "text": "Horrible customer service.", "pics": null, "resp": null, "gmap_id": "0x888e810b5ba64d31:0x227aabe6831a6f1b"}
{"user_id": "107457191681754866952", "name": "Krissi Harpel", "time": 1615079865019, "rating": 1.0, "text": "All the reviews were great so I was excited to get started with this company.  Their representative came to the house and brought a contractor, I was told it would take about a week to generate an estimate of materials.  During that week I sent some colors I liked and a couple of questions and I was not getting any response from the designer .  Once the week was up I sent an email to the designer and told her I needed someone who was going to be responsive to emails .  She immediately responded saying that she could not get my cabinets to meet our timeline and I would have to find someone else ...which if she had paid attention I had asked for an estimate on painting and replacing .  I then left a message for someone from management. to call me and got no response.  Very very disappointing", "pics": null, "resp": {"time": 1615218145501, "text": "I spoke with Krissi and explained a few items to her concerning her project and attempted to assist her with her project even though Coastal is not performing the project.  Hopefully this will help.  We do not paint cabinets and recommend under normal conditions that this not be done.  Typically, a paint job will have to repeated in the near term due to underlying issues with cabinets themselves."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "114603038191907151231", "name": "Hilton Perry", "time": 1573564502962, "rating": 5.0, "text": "For many months my wife and I  have wanted to remodel our bath but finding some one that was knowledgeable and and responsive was impossible and had almost given up. A friend told us to call  Coastal Kitchen & Bath and with in just a few days we were set up to meet and go over what we wanted and measure. The next week we were picking out the flooring, cabinets and fixtures we wanted. Today we have the bath that we had visioned for moths. Very responsive and courteous.", "pics": null, "resp": {"time": 1573573023136, "text": "Thanks for the review.  It can be amazing what a kitchen remodel can do for the appearance of your home and your piece of mind."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "108897730871088696735", "name": "Chelsie Sotero", "time": 1574281502709, "rating": 5.0, "text": "I have had the pleasure of working with Jill here and she is a delight! This company should be proud to have her as an employee. She is very knowledgeable, helpful and very friendly. I will tell everyone I know to make sure to stop in!!!", "pics": null, "resp": {"time": 1574288926555, "text": "you're going to love your new mud room"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "104699544827960283655", "name": "me to you", "time": 1574134170180, "rating": 5.0, "text": "The lady, Jill, was very helpful.  If you go there you have to order what you see on display.  Ordering means a 3 or 4 week delay.  They have a variety of everything related to the bathroom.  My apologies because I did not take photos.\n\nMy contractor wants it yesterday. Seems the stuff is never there fast enough for them. They want to go to Lowe's, pick it up, and install it the same day.", "pics": null, "resp": {"time": 1574200935354, "text": "Thanks for the opportunity.  We do not keep cabinets in stock since there are so many options, sizes and colors.  Unfortunately, contractors can experience delays and then want everything yesterday, like you said."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "110753572483752767778", "name": "Shawn Taylor", "time": 1621512617423, "rating": 5.0, "text": "Great food", "pics": null, "resp": {"time": 1621515947484, "text": "Thanks for the great review on food...we'll take the 5 star review but don't serve food.  :)"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "100457384833095958705", "name": "Mike Tate", "time": 1573486255221, "rating": 5.0, "text": "Everything turned out GREAT!  The few minor issues were promptly taken care of and the project was completed on time! Love it!", "pics": null, "resp": {"time": 1573490094987, "text": "Sometimes a kitchen remodel becomes an art and not a science but we stick with the job until you're happy."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "108822151236828360941", "name": "Julie Bertolla", "time": 1573693040936, "rating": 5.0, "text": "I had a fantastic experience with my recent remodel. Jill is very knowledgeable and went above and beyond to make sure I was happy.", "pics": null, "resp": {"time": 1573745174151, "text": "Great to hear.  I hope you enjoy your new cabinets and kitchen remodel"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "115691192153731140332", "name": "Michael Leserra", "time": 1612144898853, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1612189232773, "text": "Thanks for the review.  Hopefully we can assist with your kitchen remodeling project."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "110614324176303234809", "name": "April Morris", "time": 1573243616765, "rating": 5.0, "text": "Awesome job on our kitchen counters! Defiantly recommend for quality work!", "pics": null, "resp": {"time": 1573247783868, "text": "you can't go wrong with granite counter tops, easy close cabinet doors and drawers and a tile back splash"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "103643447602756643677", "name": "justin hamilton", "time": 1573241937157, "rating": 5.0, "text": "Top notch service and quality.  They're certified designer was a great help", "pics": null, "resp": {"time": 1573246504933, "text": "Impact windows are a great replacement to protect against storms"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "109286991881960179651", "name": "Alla Nikitina", "time": 1619699391885, "rating": 1.0, "text": "Out of business", "pics": null, "resp": {"time": 1619704017274, "text": "Actually, we are not out of business.  We have a new location that we are working on opening up after the Hurricane Sally destruction to our old building but we have been working from remote locations since Sally.  Our website, Facebook page, Pinterest, Google My Business page, etc. all reflect we are open for business and have been open for business.  Our phone number is active as well so feel free to contact us if you have a project you are interested in us quoting for you.  251-943-5358."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "108864938595675145850", "name": "ted croft", "time": 1567218518238, "rating": 1.0, "text": "They dont stand behind their products! Bought a marble vanity top and they installed two sinks (undermount) and the silicone bled through to the surface of the top and stained it where the silicone was applied for the sinks. The top is ruined! After sending pics Mike told me to call the manufacturer of the silicone to get it fixed or remedied. What terrible customer service. Good thing he sold the company!", "pics": null, "resp": {"time": 1567608529770, "text": "Ted is correct, the business has been sold to the owner of Folkers Window Company.  The marble vanity top Ted purchased was a old remnant from the warehouse and was \"sold as is\" for a very cheap price.  Unfortunately with remnants and very low prices, these things happen.  This was communicated to the customer at the time of the sale.  The best way to avoid issues with products and expired warranties is to purchase new products instead of remnants."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "103433390816042629995", "name": "Anisha Penton", "time": 1573243082367, "rating": 5.0, "text": "Amazing company to work with! Very friendly, knowledgeable and helpful staff.", "pics": null, "resp": {"time": 1573247620965, "text": "Great choice with Silestone quartz counter tops"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "117979887436607881612", "name": "Gayle Patterson", "time": 1573670732299, "rating": 5.0, "text": "Jill Kinard is very knowledgeable and helpful.", "pics": null, "resp": {"time": 1573674860598, "text": "Thanks much.  Hopefully we can assist with your remodeling project"}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "107308814377170470836", "name": "Cheryl McCoy", "time": 1567735492714, "rating": 4.0, "text": "Good products, pricey", "pics": null, "resp": {"time": 1567789053581, "text": "Thanks for the business and the review.  No, we are not the cheapest because as you said \"good products\".  We do not sell junk and we use professional installers and not sub contractors.  In addition, we use stainless steel fasteners, high grade caulks, etc. all which lead to a higher price and a higher quality installation.  Thus, we will typically not be the cheapest...but we're the best."}, "gmap_id": "0x889a0e4801155555:0x2531dccd32773198"}
{"user_id": "114344683272494604735", "name": "Cathy Hodo", "time": 1621176766049, "rating": 1.0, "text": "I bought my hot tub about two years ago and it has really been horrible. We can’t get anyone to come service our hot tub in Hoover, Alabama. I had no idea they they would deliver the hot tub and then not have any service for when we had problems. And man have we had problems. No other companies will service it because we didn’t buy it from them. Take my advice and if you live anywhere near Hoover, Alabama buy your hot tub from another company!!!", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "109275537076281961199", "name": "Jim Tate", "time": 1623300656925, "rating": 1.0, "text": "If you want a poor experience, call this outlet in Chattanooga for your hot tub experience.    My wife and I were lied to about everything.    The delivery date was a huge lie and the customer service from the sales rep  (initials JH) was extremely poor and unethical.     No follow up phone calls or emails until my responses via email were extreme and rude because of their lack of care and concern for our purchase.     I don't recommend these guys or the sales guy (JH) to anyone.   He needs to find a new career.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "104601492673690281172", "name": "Keith Cooper", "time": 1615331844250, "rating": 3.0, "text": "Too pricey better off going online.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "103527712196069902797", "name": "Phillip McCracken", "time": 1583340789744, "rating": 5.0, "text": "I was a little disappointed at first because the satellite office here in Huntsville doesn't have a complete showroom. But after speaking with Jason, he convinced me it was worth the drive to Chattanooga to see the full showroom and it was. I saved over $5000.00 on my new Catalina Luxury hot tub.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "112248507877021520367", "name": "Stan Quigley", "time": 1509227276560, "rating": 4.0, "text": "My wife and I found a beautiful hot tub at this place. We both had thought about getting one for years after our last one had too many cracks and repairs to it.  We enjoy going out to our back patio and using the tub almost every night and it has been a blessing for our aches and pains.  I think you will find what you're looking for when you check out their showroom.  Friendly and helpful staff too. We are looking for an infrared sauna and not sure they carry those though.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "103555489480557445702", "name": "Angela Heard", "time": 1547480043329, "rating": 1.0, "text": "The ABSOLUTELY WORSE CUSTOMER SERVICE and HOT TUB.Ordered from Chattanooga TN . Would never ever ever ever ever ever recommend or buy from again. Had a brand new hot tub delivered end of August 2018. By December 2018 the pump went out. Hadn't used the hotub I kid you not no more than 5 times total. Called two weeks ago talk to a tech and claim he was going to order the new pump. Called this morning to check on it and someone else claimed they didn't have any record on it. We knew it wasnt good because it came with the main pipe not put together and the lights not hooked up.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "107908963873372525563", "name": "rachelle ballenger", "time": 1585236557761, "rating": 5.0, "text": "My name is Rachelle.This company is amazing.  They helped us redo our master bathroom. The consultants  were very knowledgeable and most pleasant to work with. The show room floor had lots to choice from. Once I picked my fixtures out, they were very prompt on getting it ordered and delivered. I will diffidently use them again.", "pics": null, "resp": {"time": 1588361727282, "text": "Rachelle, thank you so much for the kind words. We are happy to help. Thank you for your business!"}, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "100990036893853674081", "name": "Chiffaun Cardona", "time": 1592860649424, "rating": 1.0, "text": "Rude .....barn or farm sinks takes 18 weeks to come in bc they say it’s from Italy I think they should find other vendors or maybe she just told me that", "pics": null, "resp": {"time": 1592862017855, "text": "Chiffaun, We are so sorry to hear about your poor experience at our store. We will relay message to the Manger. Would you mind sending some contact information to nick.price@southernpipe.com so we can have him reach out?"}, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "109466252458118393684", "name": "M W", "time": 1585185192468, "rating": 5.0, "text": "Very knowledgeable, super friendly staff, & nice selection! I will be back:)", "pics": null, "resp": {"time": 1588361741169, "text": "Thank you so much for your kind words, and thank you for your business!"}, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "104186857667142205186", "name": "Abu Anas", "time": 1603752774654, "rating": 4.0, "text": "Great customer service", "pics": null, "resp": {"time": 1603804865451, "text": "Thank you so much, Abu! We appreciate your business!"}, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "108124566852861804713", "name": "Gay Hicks", "time": 1585185107780, "rating": 5.0, "text": "Great experience!! Highly recommend!", "pics": null, "resp": {"time": 1588361756995, "text": "Thank you Gay, we appreciate the review and thank you for your business!"}, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "103866852895116876040", "name": "Darlene Wolfe", "time": 1528919779917, "rating": 4.0, "text": "Great selection,  Teresa was very helpful.,", "pics": null, "resp": {"time": 1530023531651, "text": "Teresa is a great asset to our team.....thank you for your kind words"}, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "108345506734457923746", "name": "David Thomas", "time": 1522347312395, "rating": 1.0, "text": "Walked in the store was not acknowledged by the staff walked around for 5 minutes never acknowledged even when I walk out did not acknowledge my departure would never ever recommend this place to anyone in mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6ca367e0f:0x90ec650c8541744c"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1624394784776, "rating": 4.0, "text": "Really like the store. Lots of options to choose from. Nicole was very responsive on the cabinet design and got the order submitted when completed in a timely manner. I would recommend.", "pics": null, "resp": {"time": 1624634423147, "text": "Hi Jennifer,\nThank you for the review. We're happy to hear you were pleased with your visit to the showroom. We value your feedback and look forward to your next visit. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115417472708461661662", "name": "Keith Quackenbush", "time": 1513117216757, "rating": 5.0, "text": "I walked in the showroom and was blown away by the selection.  After I walked in I was sooooo impressed by the service.\n\nWhat I will say is that this place is not 'cheap'... if you want 'cheap' 99 cent tile or carpet... go somewhere that sells cheap stuff.\n\nBUT! If you want builders grade, or really cool stuff at great low prices.... then they are well worth a visit! Ober 50,000 sample in a gorgous well lit showroom.\n\nBEST flooring, plumbing and cabinet showroom I have ever seen.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMAsWSQnpvqEinG4_-7BHSc9cf5dOYUiBbYhpvD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmQZUSVAiQmcYljVS6jqUbdDHg9JcSPXPNR8ik=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN67Z3MablSXoD3I4kLQPqT1l98dd4m8C-mgaFJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmqyXDZdlBASCRICrGo0YPK9RatM3okVnmGt3q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6-ttGcLCF0vBO0eO5WV4ZgvwrPX6Mx6n65tU2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPusxLNsi46rtmKB6uA0WP4pD65fL2-pi2FPjvO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMl89PSXSMdzD_Ud4LVchgmWK3gwM-AmuOf-CRr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7BLhQj-iNhkFnlIO0gNROJstBQ5JrR1gNK8Ha=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIeHtVFofEiKPeUr-ILATQkrZTgaw_BWIEMYas=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106499389525534900811", "name": "Seghers Pickard", "time": 1612396533032, "rating": 5.0, "text": "Overabundance of choices! Jeff was a great help, plus he has a really good eye for color. I was able to pick out carpet, luxury vinyl plank, kitchen cabinets, tile backsplash and grout, and countertops. So many choices of such beautiful products. Can't say enough about this one-stop-shopping hidden gem in Pelham!", "pics": null, "resp": {"time": 1612539594693, "text": "Hi Seghers,\nThanks so much for the feedback, We really appreciate you taking the time to leave a review! We pride ourselves on having the best quality materials with plenty of choices and are thrilled to hear you enjoyed working alongside Jeff. Come back anytime!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "118411282663125310378", "name": "Henry Strevy", "time": 1614081970485, "rating": 5.0, "text": "They have the best and they are very nice and polite", "pics": null, "resp": {"time": 1614353852498, "text": "Hi Henry,\nThanks for the review. We're happy to hear your visit to the showroom was a success and our team was able to be of service. We value your feedback and always look forward to new projects. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "108654884351566354484", "name": "Ben", "time": 1590168050094, "rating": 5.0, "text": "ProSource has been so easy to work with. They give great advice and don't rush like the more well known franchises and big box stores. I will use them again when I do my next renovation.", "pics": null, "resp": {"time": 1590758905997, "text": "Hi Ben,\nThanks for the review. We're elated to hear you enjoy working with our showroom and that the process was easy going. We appreciate your feedback and always look forward to new projects. Come back and see us anytime, take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "113203519863552748548", "name": "Jeff Pierce", "time": 1573190690391, "rating": 5.0, "text": "So happy we found this place! Prices and quality were outstanding but the help we received from Christoper, one of the family members that own it, was invaluable. Although they do a lot of business with pro contractors, Christopher took the time to help us (DIYers) select cabinets, a soaker tub and fixtures. We highly recommend ProSource! Jeff", "pics": null, "resp": {"time": 1573225419868, "text": "Hi Jeff,\nThanks for taking the time to leave a review. We're so pleased to hear you enjoyed utilizing our showroom and working alongside Christopher. We appreciate your awesome review and look forward to your next project!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102189620606858087351", "name": "George Sadowski", "time": 1527180524179, "rating": 5.0, "text": "If you have not shopped at pro source then you need to. The selection by far is the best in the Birmingham area the store room is beautiful as well as the selections of products. I must say the staff is excellent. I highly recommend that you stop in even if you are not building or remodeling and once you do, you will go home with ideas so that you will want to remodel.", "pics": null, "resp": {"time": 1527255292961, "text": "Hi George, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience and hope to see you again soon. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "104377946049587942150", "name": "Barbara Klein", "time": 1524774646911, "rating": 5.0, "text": "I had the opportunity of consulting, with Chris at Pro Source.  He was very patient, friendly and a good listener, of what products I was interested in. I had a kitchen flood that affected three rooms, with flooring needing tile/ carpeting, as well as, . backsplash tile. He had a wealth of knowledge, of all their materials and shared advice on my possible interests.  I was given many samples to take home to see\nthe colors, with my lighting and existing colors I was trying to coordinate together. I would highly recommend Pro Source materials  and Chris making my remodeling a good experience.", "pics": null, "resp": {"time": 1525881173963, "text": "Hi Barbara, thank you for taking the time to leave your feedback. We are pleased to hear that you had a great experience and will pass along your kind words to Chris."}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102114088470396655242", "name": "Mitch Jones", "time": 1527179963301, "rating": 5.0, "text": "We needed to remodel a rental property and had gotten several quotes from different people before going to ProSource.  ProSource had the BEST prices AND they were the most eager to help us find what we needed within our budget.  Christopher and his staff are FANTASTIC!! Great showroom too, highly recommend them!", "pics": null, "resp": {"time": 1527255264402, "text": "Hi Mitch, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience and will pass along your kind words to Christopher. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "111284215726827876082", "name": "Brenda Lynn", "time": 1533404830865, "rating": 5.0, "text": "ProSource is a fabulous place to work. The Pancners are great people to work for and with. The other employees are great, too. It is a happy place to work and shop.", "pics": null, "resp": {"time": 1533837926223, "text": "Hi Brenda, thank you for taking the time to provide your feedback!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115384948953016513077", "name": "Tim Johnston", "time": 1506462599700, "rating": 5.0, "text": "Hands down the best,cleanest, well lit showroom in the Greater Birmingham area... Great selection of flooring, cabinets countertops and K&B!  The service is excellent and the staff is friendly and knowledgeable and really cares about getting you the look you want!", "pics": null, "resp": {"time": 1507219260743, "text": "Hi Tim, thank you so much for the positive review! We are glad that we can offer such a large selection to our customers. Come back on the next project!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115918866966240008698", "name": "Joy Cannon", "time": 1534078930079, "rating": 5.0, "text": "Jessica and Christopher were so friendly, helpful and patient.  They made the daunting task of choosing from so many products easier and fun!", "pics": null, "resp": {"time": 1534527562677, "text": "Hi Joy, thank you for taking the time to provide your feedback! We are pleased to hear that you had a positive experience and will pass along your kind words to Jessica and Christopher! Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "104832565774838115634", "name": "Sue Smith", "time": 1510867749351, "rating": 5.0, "text": "Pro Source in Pelham has an outstanding selection & the staff is top notch.  Special hat tip to Cody Barrett, my account manager.  He has had the patience of a saint & couldn't be more helpful!  Can't say enough good things about this Pro Source.", "pics": null, "resp": {"time": 1511815607049, "text": "Hi Sue, thank you so much for the positive. Review we are so happy that we could help you with your project needs. See you on the next one!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "103807881521583055200", "name": "Amanda Larson", "time": 1513902296158, "rating": 5.0, "text": "This place is wonderful.  Everyone who works here is so helpful.  ProSource is perfect for all your flooring needs.", "pics": null, "resp": {"time": 1513005364215, "text": "Hi Amanda, thank you so much for the 5-star rating. We really appreciate it. See you again soon!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "110433268411200516916", "name": "Matt Lewandowski", "time": 1506469633402, "rating": 5.0, "text": "Employees were knowledgeable and helped us through our project, specifically Mr.Chris Pancner. We have a home in Fairhope and had our product shipped to their other location in Pensacola. I was able to pick up the material, which was wrapped perfectly. The warehouse guys were friendly and made sure I had everything I needed as well. Will be sending all I can to you guys, thank you so much!", "pics": null, "resp": {"time": 1507219295786, "text": "Hi Matt, thank you so much for the positive review. We will make sure to pass on the compliments to the rest of the showroom - they will be thrilled! See you again soon."}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "118064429393032855273", "name": "Kate Victory", "time": 1512669624877, "rating": 5.0, "text": "Beautiful showroom with tons of selections! Instead of searching all over town, I was able to get the majority of my material here!", "pics": null, "resp": {"time": 1513005391361, "text": "Hi Kate, thank you so much for the positive review. We appreciate the feedback and look forward to working on our next project together!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "117244924662295034674", "name": "george pancner", "time": 1501701572077, "rating": 5.0, "text": "Beautiful showroom, knowledgeable staff, 40,000 selections and lowest prices in town.", "pics": null, "resp": {"time": 1501862536788, "text": "Hi George, thank you so much for positive review. We are happy that we can offer a wide range of products at low wholesale prices. Hope to see you soon!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106348363915782145772", "name": "Taylor Reed", "time": 1527192632370, "rating": 5.0, "text": "They have a beautiful showroom with lots of options and a helpful staff to answer all of your questions.", "pics": null, "resp": {"time": 1527255320066, "text": "Hi Taylor, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106738619137973725477", "name": "Jessica Richardson", "time": 1506462484468, "rating": 5.0, "text": "Awesome selection, tons of choices, and super helpful staff!", "pics": null, "resp": {"time": 1507219232918, "text": "Hi Jessica, so good to hear that we could help with your project. Thanks for the positive review and hope to see you again!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "108999064041447831656", "name": "Phillip Workman", "time": 1611086771041, "rating": 5.0, "text": "Need to be able to give them 10 stars.  Jamie offered me several options that saved me several hundred dollars.  He was willing to take his time with me and answer all my questions.  Both on the phone and when I came to the shop. Great customer service and advice.", "pics": null, "resp": {"time": 1611621595077, "text": "Thank you Phillip! We really appreciate the feedback. Please visit us again soon!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "110876636400029237729", "name": "Jason Vaughn", "time": 1612221602758, "rating": 5.0, "text": "I go here for all my plumbing needs! Awesome service with great people. Would highly recommend for any plumbing necessities!", "pics": null, "resp": {"time": 1612811895318, "text": "Thank you Jason! We really appreciate the feedback. Please visit us again soon!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "102879569039586071935", "name": "John Jackson", "time": 1607039793591, "rating": 5.0, "text": "AWSOME!! Thanks for all your help.", "pics": null, "resp": {"time": 1607374741273, "text": "Thank you John! We really appreciate the feedback. Please visit us again soon!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "101053872333524977109", "name": "Sara Taylor", "time": 1568995537047, "rating": 5.0, "text": "We had a wonderful experience with our bathroom renovations with V & W in Pelham! Michelle was outstanding throughout the whole process, sharing her knowledge about fixtures, researching to find the perfect tub, and helping us find alternate items as issues came up in the middle of our project. She was always there to help, even staying late to help us scramble when we needed to find an alternate plumbing fixture.  Deliveries were on time & professional.  We are absolutely thrilled with the result and couldn't be more grateful for Michelle's help and the outstanding service of V & W!", "pics": null, "resp": {"time": 1571062152864, "text": "Thank you Sara we appreciate the review! Come see us anytime!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "107179611469889431112", "name": "Shereka Lewis", "time": 1581950505380, "rating": 5.0, "text": "There was a mix up on when the faucet would be delivered. Michelle called and made sure we got our product in time to get everything completed. We had a great experience and truly appreciate them going above and beyond.", "pics": null, "resp": {"time": 1581955234681, "text": "Shereka it is our pleasure! We hope you love your new faucet!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "114463535051212843015", "name": "John Jackson", "time": 1592648627020, "rating": 5.0, "text": "AWSOME AWSOME AWSOME!!! Thanks for your help guys.", "pics": null, "resp": {"time": 1592958748700, "text": "John it is our pleasure! Please come back soon!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "101339597302817870015", "name": "Amanda Stiff", "time": 1566940649918, "rating": 5.0, "text": "I visited V&W Supply the other day for some items that I needed for repairs. And the guys and ladies there are so nice and helpful.  Went out of their way to help me understand everything... Very friendly place to visit!", "pics": null, "resp": {"time": 1567638123962, "text": "Hi Amanda thanks so much! We really appreciate it!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "103974678744001929922", "name": "Stephanie Philpott", "time": 1568930049939, "rating": 5.0, "text": "I have gotten a couple of items from the Peham store and have been extremely happy with the the service and support they provided.  Prices were great too!  Your go to girl is Michelle Burns!", "pics": null, "resp": {"time": 1571062182844, "text": "Hey Stephanie thank you for the review! Michelle will be grateful for the shout out!"}, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "110420388269618240793", "name": "Brett Koger", "time": 1472852161478, "rating": 5.0, "text": "Had a great experience.  Staff worked with me to replace a part on our bath.  The didn't have the part in stock but had a kit that had it.  They sold me the part out of the kit.  They showed me how to replace the part.  Great Service", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "107271989894363416790", "name": "Emily Vanlandingham", "time": 1558112534529, "rating": 1.0, "text": "Terrible experience with receiving broken toilets that V&W refused to replace.  The porcelain was cracked in the box on 2 toilets when our plumber opened them to install.  V&W required us to purchase 2 new toilets.  Will never buy from here again.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "107398881261701613284", "name": "Matt Zylstra", "time": 1469205258238, "rating": 5.0, "text": "Needed a toilet tank lid. They could have sold me a tank with a lid, but they gave me a lid for free. They definitely care more about customer service than making an individual sale.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "114673297028311059983", "name": "Daniel Wiggins", "time": 1441121223012, "rating": 5.0, "text": "Great store with excellent customer service.  Helpful with great info for us non plumbing types.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "111351232343891088715", "name": "Joseph Miller", "time": 1405129393722, "rating": 5.0, "text": "This is a great store with excellent customer service. I needed the new Kohler Bellera faucet (K-560 with Docknetik and Sweep spray) and kohler chose not to change model numbers so they could unload remaining inventory. This particular faucet is not available online or lowe's/home depot. The store manager understood exactly what I wanted, ordered exactly what I wanted, walked me through the installation, and was incredibly knowledgable/helpful. He also took the time to help me troubleshoot a shutoff valve problem on another sink. Kohler makes a great product, the faucet is awesome, and this is the place to purchase. Great staff, local business, will definitely use again.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "109570167509075126074", "name": "Kris Todd", "time": 1522354547336, "rating": 5.0, "text": "Great service, low prices. Ask for Clint!!", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "106845556397824140314", "name": "Melissa Naccari", "time": 1504044385497, "rating": 2.0, "text": "Was told the faucet I ordered would be there that afternoon or the next morning. Called the next morning and still didn't have my complete order. Come 2 p.m. I decided to stop by the store for a refund due to the fact my plumber would be coming over soon to install it and we still haven't heard anything. They charge a 25% restocking fee for a item that I still haven't received. Don't Promise something you can not fulfill.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "112308120622187524304", "name": "Kim Dillenbeck", "time": 1516753815388, "rating": 5.0, "text": "Always knowledgeable on the artist and the common plumbing problems.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1540570948445, "rating": 5.0, "text": "Always like the service and the whole sale price.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "113553241222095042912", "name": "Rodney McMinn", "time": 1514423698458, "rating": 5.0, "text": "Very helpful with my problem.", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "106785866955226407982", "name": "Gary Chapin", "time": 1513779562652, "rating": 5.0, "text": "Great Service", "pics": null, "resp": null, "gmap_id": "0x8889241b2d4de2f3:0xb2c3ef660868247e"}
{"user_id": "101513151186798138867", "name": "Deirdre Taylor", "time": 1622688512722, "rating": 3.0, "text": "I only go to home Depot if Lowe's doesn't have what I need, and that's rare. I always have a problem picking up orders. You can't just call in to have it brought to you by curbside because they claim to be too busy to get your information. When you go in, if the order is not in that little closet behind them, they'll just tell you it's not there rather than to go to the back and get it. I order a lot and never have a problem with Lowe's. It took an act of congress to finally get my complete order from Home Depot. One young lady, Kia went out of her way to help me and it wasn't even her department. Thanks to her I have everything. I only shop here when I absolutely have no choice.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104964551689477447064", "name": "Anithea M", "time": 1612635352740, "rating": 5.0, "text": "Got in and got out! Found what I wanted on the app!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPEJJ19L9HY6S3BHuCEDa7leYXYOhx0EhmbABvc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111996270626342312335", "name": "Liz R", "time": 1622766599420, "rating": 5.0, "text": "Everything seems to be easy to locate. If you are using The Home Depot app most of their inventory counts are accurate or up-to-date for products on shelf", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114499768142150027895", "name": "Silvery Nova", "time": 1615510726435, "rating": 1.0, "text": "The first problem is the delivery service company that Home Depot uses for direct deliveries,Central Transport. My 1st initial delivery date changed three time before it was actually attempted to be delivered on March 3rd. On March 3rd the shipment came on a long bed truck with a pallet dolly. My shipment is a pallet of 33 boxes of porcelain tile., plus 7 additional boxes they put on the same pallet. The right side of the pallet was coming apart due to the immense weight of the tile . The driver could not move the pallet down the truck. He was not going to be able to pull it up the small slope on my driveway. What on earth were they even thinking?They needed a fork lift. I called Home Depot and they got the Transport company on the line while I was on hold. I ended up being told the transport company needed to take care of this and they would contact me in 24 to 48 hours. Which they never did. I had to call them. On 3/5 Friday I called central transport and they told me the shipment would be delivered on Monday between 11 and 12. They never showed. I checked the shipment tracking and found that they changed it to Tuesday 3/9! I got no call, text, or phone call.So Tuesday 3/9 I message them to find out eta. They said the drivers hadn't left yet and to keep checking they will update me. That never happened. So I wait and wait and I get a call from Home Depot letting me know the tile has arrived at THE STORE. I was never told anything about this.They will be delivering the tile on Monday 3/15....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101221607261505326604", "name": "Benny Woods", "time": 1523533187461, "rating": 5.0, "text": "Really nice store they have just about anything you're looking for tools paint Lumber home appliances shingles sheetrock power tools tool boxes cement ceiling fans lawn mowers", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9qFYleXfGd8KsqAHKPFKBrpyGVTFE3PKy7jts=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcIGMGhvMzavg-KCdLgIa_5JylqQpyzmiuugjw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOFgEh8h0T-OdPoH9Dlk1k4dEAGlgWxHqtAtQI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMRjZ7grMLRGCv0Is4S8Rii6CmSagRRvz5m7Cy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110877374690689930464", "name": "Carolyn Ann Pitts", "time": 1618192368761, "rating": 5.0, "text": "GREAT SALE PRICE ON OUR DISHWASHER WE GOT WELL THEY ORDERED IT AND WE WILL GET IT ON APRIL 23. SALES ASSOCIATE WAS VERY SWEET AND VERY HELPFUL. THANKS FOR SUCH A GREAT SALE", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113417706957439140552", "name": "Cynthia James", "time": 1617413205829, "rating": 5.0, "text": "Online order pickup inside store was super easy. Total transaction was about 3 min. I even had someone ask me if I needed something. Unfortunately that night I was only browsing  but Thanks to the lady working in the appliances department for actually engaging.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111659223413567054206", "name": "Tiffany Reed", "time": 1620603244557, "rating": 4.0, "text": "Love home depot.. They had alot of stuff at decent prices and the employees were really friendly and helpful. They now have self checkout so checkout was a breeze too. It wasnt crowded and displays made things very easy to find on my own.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113432997716455065250", "name": "Sandra Cauley", "time": 1621983538747, "rating": 1.0, "text": "I went in the garden center and told girl at registry, that  I wanted 2 medium bags of Miracle-Gro potting soil, and help getting it n putting it in car.  No help came, then she told me go in back pick it up.  Finally realized she charged me for garden soil, I ask her to give me potting soil and charge me for the difference.  She said she couldn't, I had go customer service.  I told her I wasn't able, that why I parked out in front garden center and ask for help.  I told her I would eat the loss and never come there again.\n\nI don't like be hard get long with, but it was her mistake, why should I have go customer service, when I have trouble walking that distance.  I will use Lowes from now on.\n\nI'm a 100% Service Connected Disable Veteran.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113865377088864607035", "name": "K'Cee Ortiz", "time": 1616266636351, "rating": 4.0, "text": "Came just to check out the garden center/plants selection. Very minimal, but prices are decent. If looking for a larger selection of flowering, herbs, or trees go to Lowe's. Home Depot's tropical plant section is good however.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116088088101848650793", "name": "Kathryn Brakefield", "time": 1623539227378, "rating": 5.0, "text": "Clean ..well stocked..great customer service. Prefer Home Depot Mobile AL.  worth the drive from MS.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111949167487821334289", "name": "Michelle Williamson", "time": 1618344948983, "rating": 5.0, "text": "Great service as always! Purchased a small metal gate for my flower bed to keep the dog out but didn't realize the poles that stake into the ground were missing. They found them straight away when I went back and made it stree free", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100307314560605388116", "name": "Zash", "time": 1622489800680, "rating": 2.0, "text": "Needed some rope but it was locked up behind glass. Could not find an employee to help. Asked the Paint Dept person to call us some assistance. Waited 10 more minutes but no one came. Hunted down someone again but they didnt know the combination to the lock that was gaurding the rope. Was in the store 30mins just for 10ft of rope!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116484690062615838964", "name": "melissa renee", "time": 1619300009804, "rating": 3.0, "text": "The lady who sold us a washer and dryer was very nice no problems at all. I have a problem with the fact that they were supposed to be delivered at my house on April 21st. It got delayed so they moved the delivery date to Today ( April 24th ) but I never got any notification so I called and they told me that they don’t deliver to my area on saturdays, only Wednesdays and they don’t deliver when the weather is rainy. It’s been SUNNY all day. No bad weather AT ALL. Now the delivery date has been moved to May 12th. I will be giving birth in May so that’s really annoying 🙄 I ordered my washer and dryer on MARCH 3RD!!!  I hope the warehouse manager makes this right.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104240201754965289589", "name": "Jessie", "time": 1608187758221, "rating": 3.0, "text": "Went to buy an appliance that I saw online. Called the this particular store literally on my way over there. Young lady told me that indeed they had the sale item which I was inquiring about. I get to the store and spoke with someone worker in appliances I ask him again to verify of what I wanted. He walks back and confirms my injury. Rung me up just to realize he mentioned through conversation of the appliance he thought I was asking of. Which I corrected him and pointed out and literally touched again the same appliances that I wanted. Apparently some way some how after all this confusion. They magically had sold out. So my thinking leads me to believe the person I spoke to on the phone didn't bother to check or maybe something with system either way wasted my time and here's the kicker the way the guy tried to put it was like I could go to another home depot after I already paid. Luckily my bank released this debit transaction. Poor poor salesmanship and somewhere along the line communication is lacking. I hope I can revisit this location in the future without this issue.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117727525725400636738", "name": "Brent Jennings", "time": 1614037891713, "rating": 5.0, "text": "Great place to get your gardening supplies early picked up some tomato plants today I was surprised they already had them available", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115961453894344222231", "name": "Stanley Pettway", "time": 1611766885361, "rating": 5.0, "text": "“There’s something bout this Home Depot that keeps me coming back for more... it’s just NEAT for a home supply store. Peace.”", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110345849221491784161", "name": "byron wilmoth", "time": 1598928417542, "rating": 5.0, "text": "Used the online order and drive up to pick up option.  Ordering was very easy and so was payment.  Pick up was very clear and easy.  The whole process was clear and easy.  The young lady who brought out the order was superb!  So friendly and a breath of fresh air!  I actually feel bad because I lost the receipt and cannot remember her name so I could go back and submit a survey to help her employer see her worth.  If I get back there and she is there, I will make it a point to find out her name and then submit a survey for her.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109676816278255837627", "name": "Andrew Clark", "time": 1615316713646, "rating": 5.0, "text": "Nice customer service support. I love the garden center this time of year.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111994225692975806241", "name": "Mollie Newsome", "time": 1614431962599, "rating": 2.0, "text": "Aside from the staff of the paint store Home Depot could be better. The price is could be better and products should be easier to find.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112557907033870184990", "name": "Shianne Mitchem", "time": 1616525098218, "rating": 5.0, "text": "Love the garden center. If I could I would buy it all and bring it home.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102186728581377564199", "name": "William Mincey", "time": 1614990819561, "rating": 4.0, "text": "I'm a Lowes shopper myself but they had what I needed w knowledgeable staff that where eager to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105227513662855236040", "name": "Lisa Watkins", "time": 1606356715106, "rating": 5.0, "text": "We went at a perfect time when the store wasn't crowded. The team members were very pleasant and helped us select and load 2\"x6\"x8' deck boards. We shop at this store frequently.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110924236981351568400", "name": "Robert Jackson", "time": 1614645278739, "rating": 4.0, "text": "Always decently helpful staff and prices aren't to high unless your looking at lumber but that's not really their fault at the moment.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112076761294574915517", "name": "Titus Young", "time": 1622421005992, "rating": 1.0, "text": "Costumer service was horrible. I waited 30 minutes literally just to get a screw", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110612619121097252708", "name": "Katherine Riley", "time": 1612560858290, "rating": 1.0, "text": "The woman working in the kitchen dept. at the store on Schillinger Rd. was no help. I called to ask about my cabinet order, and she couldn't find it, couldn't find me in the system, and insisted I must be wrong. Later I found out my order had been there. She sounded very stressed out and somewhat rude. Oh well, it's Christmas time, and maybe she has a psycho family like I do, who have ruined another Christmas. It's ok honey, breathe, and hope they get what they deserve next year.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111509877702176760147", "name": "Joseph Fletcher", "time": 1597471794369, "rating": 5.0, "text": "HD is awesome. I bought a lawnmower with the app after shopping the store a prior visit. Curbside pick up was so easy. Their app is so much better than Lowe's. So many up to date items to make your house better vs Lowe's. Even the in store checkouts are very digital and up to date. Was a die hard Lowe's guy but visit here, it'll make you switch.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109401105095606555056", "name": "Kaitlin Hairston", "time": 1614361697517, "rating": 5.0, "text": "Always a good experience there. Good customer servicealready has items looking for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102644633938724459704", "name": "Thomas Long", "time": 1607914071145, "rating": 5.0, "text": "I shop this store often mainly because of a very helpful Associate Layden. He is very accommodating, friendly and helpful. This store should model every Associate after him! Thanks for your help!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106463529330046753090", "name": "Felix Gonzales", "time": 1623544075566, "rating": 3.0, "text": "Clean and nice ppl", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117618862829477315462", "name": "The Hulkster", "time": 1605802729623, "rating": 2.0, "text": "For the most part they have what you need just keep in mind do not rely on finding help ..to find what you need you literally have to look through several aisles to find anyone that works there. I also had to deal with one employee who had a very smart aleck attitude I almost told her just walk away it was that bad. Sometimes the clearance item priced stuff is phenomenal sometimes it's not a deal at all. The return warranty is a huge problem they want to make you pay a checkout fee for a broken item even if it comes back as broken and needs to be replaced they still want you to pay $35 diagnostics fee this is totally wrong on every level. I actually purchased a pressure washer could not get it to work they sent it off come back and said there was nothing wrong with it I said let's go to the garden center let's hook it up to hose and let's find out ..so finally they agreed after I insisted guess what it didn't work they still wanted $35. The extended warranty is 100% a joke it's just a way to steal money.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112594286035553588652", "name": "Cassandra Moultrie", "time": 1611326190945, "rating": 4.0, "text": "I went in to pay a bill. I was in and out. Cashier friendly and professional great attitude for dealing with the public.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104371656142578105016", "name": "John Curry", "time": 1617280599374, "rating": 5.0, "text": "So much better than lowe's for me", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103953237477058203326", "name": "SShaw6174", "time": 1615834206842, "rating": 2.0, "text": "People here want to draw a check not work. I much prefer Lowes in tilmans corner than this home Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107926670848471184896", "name": "Lel Dale", "time": 1596330984107, "rating": 5.0, "text": "I returned to this store hoping to find a freezer, & I did! Just the one I was shopping for. Ms Kendra went above & beyond to make sure it was delivered @ pickup. Thank U Ms Kendra & the other young lady who assisted U. U both r Store Gems! I hope The Home Depot thinks so to..stay safe while U serve. U r appreciated!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117281273727611378939", "name": "STEPHEN DAVIS", "time": 1618047057577, "rating": 4.0, "text": "Received very friendly  service in appliances from zjulie", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110827696071847299630", "name": "Chris Lang", "time": 1611255969820, "rating": 5.0, "text": "Store is clean and well stocked.  The staff is friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1596914302458, "rating": 4.0, "text": "I use this store a lot for my home improvement.  I love the garden section.  I bought beautiful Hibiscus plants for $6 and they bloom so beautiful they are the envy of the neighborhood.  The paint department staff is so friendly, knowledgeable, and helpful, I try to get all my paint there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1596914302458, "rating": 4.0, "text": "I use this store a lot for my home improvement.  I love the garden section.  I bought beautiful Hibiscus plants for $6 and they bloom so beautiful they are the envy of the neighborhood.  The paint department staff is so friendly, knowledgeable, and helpful, I try to get all my paint there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111795258364355802064", "name": "Retros 4Life 79Boxing", "time": 1616490208934, "rating": 2.0, "text": "I had the worst Home Depot experience I've ever had in  30yrs of shopping at home depot. I came into the establishment and requested an automatic wheel chair due to injuries and the employee took forever to get the chair to me just to stop talk on his phone and seen me standing in pain but chose to help other customers instead of getting the chair to me 1st.  I changed my mind and ordered the products online to get delivered to my residence but Home Depot decided to ship my items to a store over 10 miles away from my home causing a real inconvenience.  I see why i started  shopping at their competitor majority of the time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110827696071847299630", "name": "Chris Lang", "time": 1611255969820, "rating": 5.0, "text": "Store is clean and well stocked.  The staff is friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107351363159104575026", "name": "JOKER Morris", "time": 1619239217138, "rating": 4.0, "text": "Had to buy a new stove. Wife blew up the old one.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102924211152045663679", "name": "Rimmy Bullock", "time": 1600702763210, "rating": 4.0, "text": "The staff is helpful, the selection is normal great, my only problem is all of the broken pots that you have to go though to find a good one. If something is broken, it should be removed form the shelves. I visited 2 days in a row to check to see if they put out new stock for something I wanted, but both times it was the same broken planters and pots.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116611600076308804343", "name": "Greta Hamilton", "time": 1587822445334, "rating": 5.0, "text": "Home Depot you Rock!!!  Excellent customer service, efficient, friendly and helpful employees. I had a bad encounter last night at Lowe's. I wanted a simple Storm door and could not find anyone in the store to assist me with the purchase. Could not even get the manager to the department to assist.  So I came to Home Depot this morning, was treated professionally and efficiently.  The employee came to me and asked if I needed help, I didn't have to go looking for him.  Thank you so much.  I will certainly be back.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114860446333793707617", "name": "Diane Tipton", "time": 1618168804546, "rating": 5.0, "text": "Bought a washer and dryer . Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113064211600259048958", "name": "Antoinette Harmon", "time": 1614111055363, "rating": 5.0, "text": "Got some plants they had some Awesome choices..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105884525324402918161", "name": "Randy Blocker", "time": 1612841948397, "rating": 5.0, "text": "Very well laid out with good stock on hand!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108898997234304606957", "name": "april ehlers", "time": 1609591883159, "rating": 2.0, "text": "The service was Horrible at this location.  I have always loved shopping Home Depot and I understand being short staffed but the employees here were just awful!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102579838281592558281", "name": "Lee Nichols", "time": 1618940324248, "rating": 5.0, "text": "Always good service and products.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110194388613042963994", "name": "B Tech Builds", "time": 1600552392531, "rating": 5.0, "text": "Great customer service looking to buy a shed. Staff was prompt knowledgeable and very helpful during the process highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117189553308850442003", "name": "SABINA SABINA", "time": 1616835432183, "rating": 5.0, "text": "I love their curbside pickup", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115456278350109820792", "name": "Rodney Moody", "time": 1609293739310, "rating": 4.0, "text": "Clean and made great efforts to be Covid safe.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115386481373515200688", "name": "Lauren Young", "time": 1596064139441, "rating": 5.0, "text": "I ordered some washing machine hoses online, got a text they were ready for curbside pickup In about 30 min, texted that I was there & the sweetest, friendliest young lady named Christy brought it out to me in about 5 min!  Great, efficient service which is extremely rare in these trying times. Very refreshing, highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114157172180809207070", "name": "Sam Kennedy", "time": 1606330707137, "rating": 5.0, "text": "The store pickup women was very nice to me and complemented me on my hair.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106621008810962547918", "name": "Chip Perry", "time": 1617832857072, "rating": 4.0, "text": "I was disappointed @ Montlimar location, but the Schillinger Home Depot had the stuff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106617504231334806529", "name": "Jessy Monic", "time": 1609452418595, "rating": 1.0, "text": "This place sucks. Verry bad service and no help at all. Got hung up on when I TRYED to call and when I went there they were very rude.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100065732828233375248", "name": "Radar Rider", "time": 1592956483096, "rating": 4.0, "text": "This Home Depot has gotten much better-ish ever since they got rid of the last manager they had!  This location had gone to the dogs for the longest time but here in recent years it has improved a whole lot.  It still has a ways to go.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116134951286012151131", "name": "Steve Coyle", "time": 1598482683737, "rating": 5.0, "text": "Enjoyable if possible, just wish they actually had the things I have looked for. Example the not common rough in toilets.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100546824989251464246", "name": "Shelley Griffin", "time": 1621111893478, "rating": 4.0, "text": "Clean store but they have a lack of help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111265612337732970314", "name": "Keith Doucet", "time": 1599165875530, "rating": 4.0, "text": "Everything was good with the store, however the department CSR's were useless.  I had to wait 20 minutes to get a board cut.  Everyone of the CSR's told me that they would be right back and never returned.\nIf the use of cellular devices were stopped maybe Services would be better", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117860242357012411926", "name": "jjnjayo pineapple", "time": 1590523923399, "rating": 5.0, "text": "Store nice and clean. Needed to buy lawn mower. Found a employee so very nice he went got us a cart loaded the mower took us up to register came outside and loaded the mower into our car.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103595037780557042809", "name": "SimbaJKU", "time": 1617384449641, "rating": 5.0, "text": "Home Depot's staff was very helpful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNfi7gxbsAitYBeCSdYjtMjNcG2Qd__OgAMKBX3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113013160645688772622", "name": "Jerry Persons", "time": 1613440508915, "rating": 5.0, "text": "Awesome Carhartt clothing and Milwaukee  clothing .....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108701034558117160854", "name": "James Stafford", "time": 1622409281284, "rating": 5.0, "text": "Always helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114327080915237958501", "name": "NotAFish", "time": 1614968704552, "rating": 5.0, "text": "They got tools! Did you know?", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102168329092414812708", "name": "louis jackson", "time": 1595021033784, "rating": 5.0, "text": "MS. Kristy and MS. Tee Tee is awesome the best customer service I ever seen in a hardware store if the don't know what your talking about they will find the right people to help you I'm a contractor and when I walk into this home depot and I see them I fill at home awesome just awesome", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115354375494675470886", "name": "Joel Minto", "time": 1614210348281, "rating": 5.0, "text": "Best in store and curbside pickup.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105490118152553275568", "name": "Joe Behr", "time": 1597422030124, "rating": 5.0, "text": "Needed help and the associate I first encountered quickly had specialist provide the information I needed. He even got the items!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111643441117496498538", "name": "Cindy Gardner", "time": 1597528885984, "rating": 5.0, "text": "Akways clean and neat when I go. Friendly and courteous staff. They always go put of their way to answer any of your questions. Competive pricing. 👍❤👍❤👍❤", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107071635484914978441", "name": "Ken Welch", "time": 1613527669748, "rating": 3.0, "text": "Did not find the light bulbs I needed, no associate around so I gave up.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103918012464024930224", "name": "Larry Foots", "time": 1608227208130, "rating": 5.0, "text": "Associates in Hardware were very helpful and also at the register", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106112085429468681128", "name": "Rosemarie. Frei Parker", "time": 1594921244569, "rating": 5.0, "text": "Excellent service found what I wanted ask for advice. I am thankful for the good advice everybody wore masks sanitize stations were available by the entrance Thank You Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104431425225249246689", "name": "JC Gottlieb", "time": 1587582892793, "rating": 5.0, "text": "A tall slender young man that works for maybe ,Home Depot inventory distribution (he did not wear HD uniform) but he helped my husband load 18 bags (60lbs each) without hesitation or question. I wish I would have caught his name. Thank you so much for your time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111864449617436778643", "name": "Tony Seybert", "time": 1593725326402, "rating": 2.0, "text": "Don't order anything on line , waited over 2 months for appliance to be delivered. I was put off twice on delivery. Then was told 11:30 to 3:30 ,  received at 6:00. I called sorry airfreight when 1st delivery was canceled, they said I can cancel my order. I told them not after waiting so long .home Depot won't get my business after all that. THEY took my money soon as I ordered , not prior to delivery. Same with carpet , made two payments prior to having it installed .", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113908218853598947922", "name": "Donnie Moody", "time": 1603481261358, "rating": 1.0, "text": "I shop this store at least 3times a day today I go in there and see a faucet for 14.88 and bring it to the counter and they say it is 31.00 still I go back there take a picture and show them it says 14.88 and they tell me it’s not on sale yet so my thing is change it in the computer before it is set out this is false advertisement so basically I didn’t get the faucet cause they wouldn’t sell it to me for what is advertising on the sign", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113335470443819553870", "name": "Dywane Butler", "time": 1616904343320, "rating": 5.0, "text": "Has a lot of electrical supplies to keep my business going", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109106462902134413040", "name": "Terry Finney", "time": 1619555156180, "rating": 5.0, "text": "Great costumer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110479653611652853125", "name": "John Diaz", "time": 1621912384722, "rating": 5.0, "text": "Grabbed some gloves and a light.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102737879936977616150", "name": "Terry Rhea", "time": 1600631312069, "rating": 1.0, "text": "Nobody  around to help three or four was huddle up talking then if you walk over there they walk off. I like the one over here on\nOff cottage hill", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113423784249485348146", "name": "David Rodgers", "time": 1593179941271, "rating": 2.0, "text": "Went to three different stores. They were out of stock at all three. Ended up at Lowe's...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103477708376233613854", "name": "C Sells", "time": 1582217374838, "rating": 5.0, "text": "Too good...great selection and value backed by a great return policy.\nSometimes items look different when they're home, but, easy returns makes a house a home!\nIf only we could leave with what's on the list!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102374112252966416030", "name": "PamelaAnn Taylor", "time": 1606451775035, "rating": 4.0, "text": "Always as usual helpful when you need them", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105826764256867057801", "name": "Kinsley Welch", "time": 1590088050189, "rating": 4.0, "text": "Always super clean and good products. Thankfully, I am someone who knows what they need, because they really don't have enough people to help customers who really need it. But, overall, I like it.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1550941408521, "rating": 1.0, "text": "Very friendly employees. I don't like having to show my ID. EVERYTIME when I pay using a gift card. Just remember before  buying a gift card  for  love  ones.To much a hassle We will not be given our time  or money to them any more. Lowe's here we come,", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOn_MjhMYOXT0ZjVptNIO3XWwqrn7B-EFhp5KpJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102747989441964599317", "name": "Theresa G", "time": 1617718392556, "rating": 4.0, "text": "Excellent customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111402836039010547905", "name": "Linda Y", "time": 1616843471248, "rating": 4.0, "text": "Mmmmm", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109780329442563034978", "name": "Barbara Tilley", "time": 1591734593962, "rating": 5.0, "text": "Great store for almost all home needs.  Very helpful sales people also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102992686994987587204", "name": "Virgil Ladner", "time": 1592605006973, "rating": 1.0, "text": "I ask three people were a item was in the garden center an they looked at me an said I don't know. They worked in the garden section. I will not go back nor would I recommend people go there!!!! Lowe's is the place to go!!!!! Just my opinion..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103245741622740626221", "name": "Janna Brown", "time": 1574202027588, "rating": 5.0, "text": "Went in the Schillinger store lost as all get out,  and this precious gentleman that already had his vest off fixing to go home stopped me to offer his help. Mike manager of Millworks and Lumber you were so sweet and so kind to stay and make sure I got what I needed, even if it wasn't your dept. Thank you so kindly for making a difference!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104124984774329340690", "name": "Amin Shabanpour", "time": 1612242868287, "rating": 5.0, "text": "Best place for home shopping", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116354866446786710157", "name": "susan vinson", "time": 1590953797519, "rating": 4.0, "text": "Like everyone else the stock is down, but all the employees were wearing masks and were courteous.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109270296971069209461", "name": "Christopher Burnette", "time": 1616986451550, "rating": 5.0, "text": "Great place to go", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109771806148985985893", "name": "Stephen Richardson", "time": 1620295398283, "rating": 2.0, "text": "Have to look for help when you need it", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107565643189478262943", "name": "Asad Khan", "time": 1593655530732, "rating": 5.0, "text": "Everything I was looking for, they had in stock... Sales Associate was very helpful...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103196309004711384357", "name": "leah turner", "time": 1583897490207, "rating": 5.0, "text": "Darla in kitchen designs is the best kitchen and cabinet specialist that my company has ever dealt with. I hope they appreciate her.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116040791578042911230", "name": "Doressa Cobb", "time": 1575554418286, "rating": 5.0, "text": "The lady in the kitchen area was the most helpful I've ever seen in any store! Every store needs employees like her!!!! We were looking for knobs for cabinets and she was enthusiastic to help and have great info!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109372626033386545378", "name": "Teresa Morris", "time": 1598916732429, "rating": 5.0, "text": "My new shopping hardware store!!! No more shopping at Lowes for me.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108993363167133101343", "name": "Guy Miller", "time": 1610504183961, "rating": 5.0, "text": "Caught 300 count  Christmas lights on sale for $1.99. What a bargain", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112793287501862981803", "name": "Rita Richardson", "time": 1621396220756, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107472912101270201813", "name": "Agnes Jones", "time": 1578493524252, "rating": 5.0, "text": "Had the best check out cashier in the garden section. She made the trip a pleasure. Knowledgeable,  pleasant and efficient.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108455570912774566110", "name": "Alfred Murphy", "time": 1600023084851, "rating": 5.0, "text": "Gentleman in flooring was great in explaining options for my broken ceramic tile.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117801262450584330062", "name": "James Duke", "time": 1575734554019, "rating": 5.0, "text": "I took my daughter to do one of the free kids' Saturday projects. The space was well organized, and the associates very friendly. We will definitely try another.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113262204891381948054", "name": "Tom Blythe", "time": 1602118843569, "rating": 5.0, "text": "Excellent 2 ladies at customer service!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116246583955022535300", "name": "Mary Cherry", "time": 1599069197372, "rating": 5.0, "text": "Good place. Friendly people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107160046004323485651", "name": "zach “ZacTurf-n-Sports” coffman", "time": 1619360462138, "rating": 5.0, "text": "Good leadership", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100482056128454942502", "name": "wes Coy", "time": 1617490979405, "rating": 5.0, "text": "Somebody said DeWalt", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110887497829573828168", "name": "pops296", "time": 1591042216478, "rating": 5.0, "text": "Great assistance and products. Very helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100947592268508277791", "name": "Hussain Alyousif", "time": 1590778047960, "rating": 1.0, "text": "Waited more than 15 min for help, and no one showed up. I asked 2 employees and they redirected me somewhere else. I ended up going to Walmart.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110680805187940007538", "name": "Mark Fikes", "time": 1620084636657, "rating": 5.0, "text": "Had everything wife needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100335350050962386824", "name": "Evon Parker", "time": 1616353655600, "rating": 5.0, "text": "Always got what you went to get", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113235848553027168355", "name": "Magdalena Peter", "time": 1615738165392, "rating": 3.0, "text": "They need a bigger variety on flowers", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105313906455636915776", "name": "Jasmine", "time": 1600401823862, "rating": 1.0, "text": "They are very neglectful with their in-home setups. You have to wait weeks before they can make the actual appointment then they do not work with you when they themselves have to reschedule due to the technician having to cancel. Mind you that this technician lives nearly 3 hrs away.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107296948444531258748", "name": "Don the time Lord", "time": 1596740397553, "rating": 4.0, "text": "It's good but they need to water the plants more because some of them look like they're wilting", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103654833316857499698", "name": "Mary Lou Sims", "time": 1583796302211, "rating": 5.0, "text": "I LOVE  HOME DEPOT ..BOUGHT HANGING BASKET  THERE SO PRETTY.GREAT VARIETY...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103681730939090798553", "name": "Ronald “BIGDADDY” Scott", "time": 1580097658196, "rating": 1.0, "text": "Home depot is a place nearly impossible to get help. Do your research on your own for any projects. If you depend on the staff, you will most likely be misled. That's after you stand around waiting for help to come that never does. You have to hunt them down. Short of help almost 100% of the times I have shopped there. When I go there it's because they have what I need when nobody else nearby does. But I dont ask for information because they just dont know. Instead I carry my phone and Google in store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101670471549315133738", "name": "commonsense forreal", "time": 1604764492840, "rating": 1.0, "text": "Do not buy anything from this home depot, their customer service,  is horrible,  they lie, when assuring they will return your call. If you pay for a job to be done there is no follow up to see if their horrible subcontractors have completed the job, and no one at the home depot is reasonable when its not completed. They get your money up front and you get the run around, October 15th I ordered doors and paid to have them installed, not only was the installation price more than advertised, its Nov 7th and I have the doors sitting in my living room floor, not installed,  but they took my money, so I warn you dont do business with home depot, I wont again.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116496315807220319912", "name": "Justin Kline", "time": 1583613019901, "rating": 5.0, "text": "Walked in, asked someone a question, they told be the exact aisle, hit self checkout and was out in about 5 mins.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105333932048428469220", "name": "Christie Hamilton", "time": 1593872459273, "rating": 2.0, "text": "I went in for 2things a blind and a cordless drill. I waited in the blind department for 45 minutes, they called 6 times for an associate, but no one ever came to help me or another couple. Then I went over to the drills, the man started to help me, another couple walked up claimed they were first, so he turned around said just look over there and walked off. I left in frustration.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111879236121876895579", "name": "Terri Langan", "time": 1599004867439, "rating": 5.0, "text": "Couldn’t live without HOME DEPOT! One of us is there every other day of the week!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102202494217631608643", "name": "Marcia Bean", "time": 1598899617694, "rating": 5.0, "text": "Picked up cinder blocks Just what I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110535086056325761505", "name": "BeachNutty Brad", "time": 1584211150997, "rating": 3.0, "text": "I have always came to Home Depot for the service they provide.  I will be driving past Home Depot to drive to Lowe's from now on.  Home Depot has got rid of the registers and I had to scan all of my cart while the young lady stood over me to make sure I wasn't stealing anything.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105256378627230408426", "name": "Benny Manzanilla", "time": 1606268601365, "rating": 3.0, "text": "Not enough help the one that do have a very inexperienced", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110905842917720201327", "name": "Timothy Roy Whitley", "time": 1617737214073, "rating": 5.0, "text": "Got some spring plants", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116802486122278737370", "name": "Glenn Jones", "time": 1572128026868, "rating": 5.0, "text": "It helps if you find whatever you're looking for on their website first. The website will list where the items are in the store. Then it's easy to get in and get out.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106350035214090702422", "name": "Juanita Wallace", "time": 1592679998305, "rating": 5.0, "text": "I had excellent service enjoy shopping there", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104439982470146582938", "name": "Randall Cowart", "time": 1597549490421, "rating": 5.0, "text": "Home Drpot is great and the people work their are great.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112868761892738040259", "name": "kaoskat13", "time": 1581277558776, "rating": 1.0, "text": "Went into the store to purchase plexiglass. They did not have the size we needed. We found a girl and asked if it could be cut there. She said no. Which was fine. We asked if there was anywhere she was aware of that we could take it to be cut. She then informs us that oh no! There is nowhere that is allowed to cut them it is much too dangerous and risky. We went down the street to Lowe's. There we found this amazing hero who was willing to risk the impossible and cut our precious plexiglass while looking completely bored and half alseep.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117669765747809049382", "name": "Brandon Jackson", "time": 1583105029950, "rating": 5.0, "text": "I prefer this location to the one across from the festival center, but both are great.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100903083161674057350", "name": "Roberto Gonzalez", "time": 1604021222169, "rating": 2.0, "text": "There is not anyone to assist you.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115153288896045035979", "name": "Danny's Place", "time": 1577958443186, "rating": 5.0, "text": "Love Home Depot, just going in there makes me want to build something, and the staff is very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114412420420786425296", "name": "Meloney Ashworth", "time": 1578532150739, "rating": 5.0, "text": "This is also a very clean, well kept store and the employees are friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101825549814721229373", "name": "Antonio Miller", "time": 1605370698648, "rating": 3.0, "text": "Ok if I can find help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110472418809137016247", "name": "Margo Bickham", "time": 1579734951963, "rating": 5.0, "text": "Rxcellent home decor place! Prices were great too", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112944501230177249342", "name": "Alex Brotze", "time": 1609242028512, "rating": 5.0, "text": "Friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118170524364501248435", "name": "Dawg 69 (Dawg)", "time": 1599561965299, "rating": 4.0, "text": "Just like every other store right now with the pandemic low on inventory", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113109074032161929495", "name": "Duane Clark", "time": 1592069601470, "rating": 3.0, "text": "I like home depot but this location does not have a very good garden center.  Very poor selection of flowers.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105971734849142686941", "name": "RMK III", "time": 1579617359427, "rating": 1.0, "text": "went for a specific item. spoke to an employee there who said they'd get someone from that department.\nthey went down one aisle and stopped to talk to another employee for about eight minutes or so before I asked her if she had gotten someone to help me.\nshe said she was going to do that now and left.\ntwenty minutes later I left because I got tired of waiting.\non the way out I saw her again at the customer service desk just jabber-jawing with one of the managers.\nas I passed by them I said, \"I'm going to Lowe's. maybe I can get some help there.\" at which point the woman who said she'd get help tried apologizing and said she'd forgotten.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115547925685606397372", "name": "Chuck Cross", "time": 1578689762951, "rating": 5.0, "text": "Super nice clerks..\nGood selection of goods", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108835989467940756066", "name": "Robyn Curry", "time": 1577994952755, "rating": 5.0, "text": "**EDIT**\nSince the freezer mishap below the management staff (namely Dave) has gone above and beyond to make things right by me. I feel like The Home Depot has redeemed themselves and they have earned my business once again.\n\nI ordered an upright freezer to be delivered to my home. I missed three days of work for no-show deliveries and countless hours on the phone trying to get a freezer delivered and all I got in return was excuses and finger pointing. I had three managers from the West Mobile location involved in this situation (Dave, Cameron, and Jonathan) as well as the customer service help line. They were all aware of the fiasco that had occurred with this delivery yet when I asked what could be done no solution was offered. After a month of no freezer from the Home Depot I cancelled the order and bought one from Lowe’s. I had it the very next day. The Home Depot was always my go-to home improvement store but in light of the lack of customer service in this particular situation I think I’ll reconsider that.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110902223554959623010", "name": "Osborne Roberts", "time": 1608733297909, "rating": 4.0, "text": "Not as good as Lowes", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105252361242923707111", "name": "Matthew Hayes", "time": 1597324233539, "rating": 2.0, "text": "Seen several employees standing around chatting until I needed help finding something then there was nobody to be found", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113956031498285402458", "name": "Eric “A” Pettway", "time": 1594693828877, "rating": 1.0, "text": "Not enforcing social distancing and not enforcing the mandatory mask wearing!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106302319587767151087", "name": "Rebecca Gainer", "time": 1576246392411, "rating": 1.0, "text": "DO NOT PURCHASE FROM THESE PEOPLE!!! THRY DO NOT DELIVER THE APPLIANCE YOU BOUGHT FROM THEM, NOT ONLY DO THEY not come on delivery date scheduled, they dont even let u no they aren't coming, THEY DO NOT RESCHEDULE ANOTHER LATER DELIVERY DATE..HAVE BEEN O  HOLD 1 HOUR WAITING ON SOMEONE TO ANSWER MY CALL..*** AM GOING TO THE HOME DEPOT FOR MY MONEY I PAID THEM FOR WASHING MACHINE I PURCHASED, THEN I'LL GO LOWES, WHERE I SHOULD HAVE GONE IN 1ST PLACE...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108034574595445164107", "name": "William Tackett", "time": 1604890613800, "rating": 5.0, "text": "I took that photo!!! Want to buy that refrigerator.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113035088980259270503", "name": "Peggy A", "time": 1602016473983, "rating": 4.0, "text": "They were busy closing off many aisles to stock and start putting up their holiday decorations 🤦‍♀️ However there were lots of staff to assist and I got what what I needed and was on my way out the door", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100293719502051322470", "name": "Myra Pierotich", "time": 1595365023909, "rating": 3.0, "text": "People never want to wait they don't want to help you lousy I don't like their plumber", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106819463579724545994", "name": "Kenny Tran", "time": 1581567787168, "rating": 5.0, "text": "Customer Service is always the best! Check their sales", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113549760866928539881", "name": "Dylan Daughety", "time": 1542318253937, "rating": 3.0, "text": "Home Depot has everything you could want from pipe tape to air conditioning filters. Generally convenient for any projects you may be working on because of the helpful staff willing to teach anyone a few things on how these projects work. You can also buy gardening supplies, laundry machines, and much more in this one store. Truly the star of capitalism.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106302319587767151087", "name": "Rebecca Gainer", "time": 1576246392411, "rating": 1.0, "text": "DO NOT PURCHASE FROM THESE PEOPLE!!! THRY DO NOT DELIVER THE APPLIANCE YOU BOUGHT FROM THEM, NOT ONLY DO THEY not come on delivery date scheduled, they dont even let u no they aren't coming, THEY DO NOT RESCHEDULE ANOTHER LATER DELIVERY DATE..HAVE BEEN O  HOLD 1 HOUR WAITING ON SOMEONE TO ANSWER MY CALL..*** AM GOING TO THE HOME DEPOT FOR MY MONEY I PAID THEM FOR WASHING MACHINE I PURCHASED, THEN I'LL GO LOWES, WHERE I SHOULD HAVE GONE IN 1ST PLACE...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113956031498285402458", "name": "Eric “A” Pettway", "time": 1594693828877, "rating": 1.0, "text": "Not enforcing social distancing and not enforcing the mandatory mask wearing!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101654060967829356649", "name": "Bearofkratos", "time": 1579045590504, "rating": 4.0, "text": "Better then it use to be ,they seem to have nee knowledgable staff in the departments I have needed things in. As far as asking someone about things they dont know...they do still act like it is or isnt something they have without finding out. Hope this is fixed soon", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106819100192874622856", "name": "Ultreya Park", "time": 1550715134969, "rating": 4.0, "text": "Love to drive by the garden center just to see the flowers and plants and brighten my day. Nice that it is so accessible and laid out well. Helpful people. Convenient to group with other errands or on an outing to eat out. Located between Kohl's/Cracker Barrell/movie theater, and Wal-Mart/Burke's Outlet/Rue21. NEED to clean more! Hire people who like to clean.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100293719502051322470", "name": "Myra Pierotich", "time": 1595365023909, "rating": 3.0, "text": "People never want to wait they don't want to help you lousy I don't like their plumber", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106865234073238981165", "name": "Isabelle Delannoy", "time": 1590271832798, "rating": 5.0, "text": "Good prices and people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110902223554959623010", "name": "Osborne Roberts", "time": 1608733297909, "rating": 4.0, "text": "Not as good as Lowes", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108827484100317662019", "name": "Bo Betzler", "time": 1606596174047, "rating": 2.0, "text": "Not much interaction or help from the employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111435636794123727691", "name": "JEFFRY Howard", "time": 1594399261406, "rating": 5.0, "text": "Always a great experience for contractors.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118407322366229731303", "name": "K Bradley", "time": 1604912127029, "rating": 4.0, "text": "Gr8 shopping experience  !!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112055864570295101136", "name": "Veronica Saucier", "time": 1581540199725, "rating": 4.0, "text": "Good just had to exchange some items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108827484100317662019", "name": "Bo Betzler", "time": 1606596174047, "rating": 2.0, "text": "Not much interaction or help from the employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103699326359330609546", "name": "John Waldron", "time": 1578508321960, "rating": 5.0, "text": "Always a great visit when you need something.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107608434828489518959", "name": "Jennifer Emley", "time": 1594860733296, "rating": 1.0, "text": "Horrible! We went in to get filters for the refrigerator and we had to get someone to page for help and still no one came.  There was someone else waiting before we got back there and no one had come to help him either.  We left and went to Lowe's, so did the other guy that was wanting to purchase a refrigerator, freezer  and a washer and dryer.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113640002932594804979", "name": "Kenneth Woodward", "time": 1574014255325, "rating": 1.0, "text": "No one in the store can help you find anything even when you know what you need. Went to customer service and they pages someone 3 times and couldn’t get a return call. Finally called another employee which did not want to come and asked the other employee to call the first person they paged. I hate when I’m a bother to a company. Left and went to Lowe’s.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100259382616853418311", "name": "Reginaldo Garcia", "time": 1553002359581, "rating": 5.0, "text": "Frequent shoppers at Home Depot.  Gale is my \"Go To\" staff person for assistance. He is  characteristically welcoming, friendly, knowledgeable, efficient, and helpful. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104942844188293985048", "name": "J Johnson Law", "time": 1604817671196, "rating": 4.0, "text": "Good shopping experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100840300821011101286", "name": "Mama Hall's Kitchen", "time": 1596392633178, "rating": 4.0, "text": "Very helpful employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102140288297413302535", "name": "Mz Monique", "time": 1563324163205, "rating": 1.0, "text": "What I don't  appreciate is when a customer ask for assistance after waiting 20 to 25 minutes later and still no one comes.I think that's unacceptable they will not have to worry about me spending my money there ever!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110093615715967242121", "name": "bridget", "time": 1611450648100, "rating": 4.0, "text": "Lots of home improvement items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108249047282101500379", "name": "Shaun Steffensen", "time": 1519340673124, "rating": 1.0, "text": "If you order appliances from somewhere, do yourself a favor and not order from Home Depot. First, the people who are selling the appliances do not know much about them. I was told that for installation of my microwave, I needed an outlet in the wall that it was being installed on. Great. I'm good. WRONG!!! The outlet had to be above the microwave.... Something that would have been nice to know, but they could not communicate that properly.\nThen, the delivery/installation people had no idea what they were doing. They were more of a delivery company, not an installation professional. They could not install my gas range. They damaged my microwave. So, really, they weren't even a good delivery company. Home Depot just subs out delivery to the cheapest company....and you can see the quality when your damaged items arrive!\nAnd I pray for you if you have ANY problems with your delivery or installation!!!\nCount on a couple of things: 1) You will spend hours on the phone getting to talk to the right person. Once you think that you have the right person, they will tell you they have to check on something and they will have to call you back. OR, the right person is \"on lunch\" and they will call you back. After giving them ample time for \"lunch\" (3 hours) when you call them back, you will be told that they were \"off today\" but they will return your call in the morning.\nBasically, it's a game of ping-pong and it takes days to get simple questions answered because, obviously, no one who works there wants to actually do anything.\nI can't believe I dropped over $7K in there and they can't even answer a simple question!!!!\nBuyer beware!!! Shop at Lowe's!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116306875088218071030", "name": "jesse wilkins", "time": 1600145764861, "rating": 2.0, "text": "Terrible layout and not a very good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105950966549735259266", "name": "Annett Bosarge", "time": 1560905879732, "rating": 2.0, "text": "Need more help on the floor...if you need something get ready to fine it your self..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111620370464856936162", "name": "Tommy Gardner", "time": 1590449263610, "rating": 2.0, "text": "Don't carry the vent hood parts in store and the ones you do are on the opposite sides of the store.all the employees could tell you was they probably online 😂", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103157777360308114523", "name": "John Ghegan", "time": 1500265857945, "rating": 3.0, "text": "The employees are always friendly and  knowledgeable. I have a credit card with them and today might be my last visit . I went to buy some 2x4x16s and some 4a4s.  The prices on those items were 4 dollars above average. I went to Lowe's and saved 78 dollars on the same exact same lumber.\nThere should not be such a price gap...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117487217502503390968", "name": "Paul Bacon (Bacon's Pub)", "time": 1578519794250, "rating": 4.0, "text": "Store is clean, friendly employees, coffee is always fresh.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114172462849939682010", "name": "Dan Depuy", "time": 1504293389774, "rating": 3.0, "text": "Bought 8 bags of river rock. I loaded it on the cart and loaded it in my truck. Was disappointed that no one helped. Yet I saw people standing. This is not my normal experience with Home Depot. Usually everyone is eager to help. Hopefully this is a one time event.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101060113010857986385", "name": "Melissa F Gibson", "time": 1555613232244, "rating": 5.0, "text": "MOST excellent customer service on contractors side the 2 morning ladies make me smile even when I don't have anything to smile about", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116969073931554268197", "name": "Michael McCarthy", "time": 1600031820300, "rating": 5.0, "text": "Remodeling project, needed several items found everything.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104809727798572497929", "name": "daniel Burdette", "time": 1608316310664, "rating": 5.0, "text": "Friendly and helping", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100485981822101815118", "name": "Ken Todd", "time": 1594109355356, "rating": 4.0, "text": "No delays at checkout.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112468064019371032056", "name": "Matthew Sando", "time": 1595356410479, "rating": 4.0, "text": "Great customer service..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109064380289511496126", "name": "David savoy", "time": 1553107670362, "rating": 5.0, "text": "I'd rather go to Home Depot over \"big blue\" because customer service is better and the store layout makes it easy to find what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109649978467882785856", "name": "Sam Tate", "time": 1553020791367, "rating": 5.0, "text": "This is one of my favorite places to shop fast friendly service and they don't have a problem with helping you.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107091869637018185297", "name": "Rickie Peters", "time": 1600714734063, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105519853751389110616", "name": "Walter Stearman", "time": 1546099688890, "rating": 4.0, "text": "I would much rather use the Home Depot than Lowe's any day the people that work at Lowe's are rude the people that work at Home Depot or Awesome every one of them that I've ever talked to has been very courteous and very friendly and like always you get better deals at Home Depot then you would at Lowe's I called in to get a quote on some roofing material it took me 3 hours to get a quote that I did not even get don't go to Lowe's", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113690954212440982225", "name": "Debbie Fikes", "time": 1609790396569, "rating": 5.0, "text": "Had everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104503932638541959944", "name": "Matt DeBlaey", "time": 1533205235889, "rating": 4.0, "text": "I needed some assistance finding something. I've had to search for help before but today it seemed like they were everywhere. Great customer service. Home Depot Alston seems to have what I need over the other stores lately. Even though I am closer to another, I just drive here because they have what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101315351200690673747", "name": "Tom Thornton", "time": 1528228298030, "rating": 5.0, "text": "Nicest Home Depot I have been too. Mike the store manager was great and very helpful. Didn’t push me off to someone else and helped me load my new grill as well! Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103676840226204440483", "name": "Jane Roberts", "time": 1603124347014, "rating": 5.0, "text": "Fast, efficient service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101662871063598781943", "name": "Angel Kerney", "time": 1553480248319, "rating": 5.0, "text": "Great service....lady in the paint dept. was patient with us & also learned a little while we waited just before closing😜", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108111676498132264084", "name": "susie pierce", "time": 1544927163076, "rating": 5.0, "text": "Had a very pleasant experience. They were  prompt with my order.\nI will continue to shop at Home Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115863217564989131875", "name": "J Jackson", "time": 1529781137064, "rating": 3.0, "text": "Went looking for a trimmer. Surprised to find refurbished trimmers at a fraction of the cost of a new one! And I could purchase a replacement warranty from the store also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106815759251078947569", "name": "Michael Peaden", "time": 1534287905011, "rating": 5.0, "text": "I'm here everyday , sometimes twice. Just wish they would hire some knowledgeable ppl. It's definitely a do it yourself place .", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108346923478261534226", "name": "David Pham", "time": 1615587774812, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103666264481733099065", "name": "Laura Kinsey", "time": 1513367264069, "rating": 5.0, "text": "I have been so amazed at the quality of service at this Home Depot store. There are plenty of helpful and knowledgeable staff ready to help you. I drive out of my way to shop at this store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116249679342655818500", "name": "Robert Harrison", "time": 1590507985761, "rating": 5.0, "text": "Great place to shop.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107552663340007368137", "name": "Debbie Phil", "time": 1583426262878, "rating": 4.0, "text": "Good selection of tools and home items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101539777611793326877", "name": "OBrien Holcombe", "time": 1520525312049, "rating": 5.0, "text": "I prefer this big box store. I work in multiple states in different counties and cities and h.d. is where ever I go. So I stay consistent with quality.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111192683215328183471", "name": "Jon Mullen", "time": 1513539794028, "rating": 4.0, "text": "Lovey was VERY helpful and a pleasure to deal with. The only reason it wasn't 5 stars was the unavailability of the appliance we wanted when we wanted it. Overall it was a very enjoyable experience.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1580338537540, "rating": 5.0, "text": "Very helpful staff and good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102203631523731829562", "name": "Kimberly Bates", "time": 1535897686923, "rating": 5.0, "text": "I appreciate that home depot has Saturday morning kids workshops.  My little guy loved it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0gU05yWc39rqXOBrVmAgaWkXOtaW-zta1Rolk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102120332704426358467", "name": "Tracy Kelton", "time": 1555975223167, "rating": 4.0, "text": "A little difficult to locate help in the store,  but overall very clean with helpful staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107207837763775911766", "name": "rebecca strickland", "time": 1584259708985, "rating": 3.0, "text": "If you ask where something is they literally have to look on the app to see.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100196848760287918014", "name": "Frank Karwoski", "time": 1595791973099, "rating": 4.0, "text": "Same consistent service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101871889054132280278", "name": "Rick Taylor", "time": 1617146238426, "rating": 4.0, "text": "No service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101079947091563059672", "name": "Timothy Cherry", "time": 1617491247130, "rating": 5.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115260004251416110175", "name": "Sharon Naman", "time": 1520214432454, "rating": 5.0, "text": "Always enjoy going to Home Depot. Everyone was kind and very helpful. Thanks for all of your help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116809699803642081953", "name": "Melissa Nicely", "time": 1617568292353, "rating": 5.0, "text": "Needed a ladder", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113455325428195403159", "name": "James J", "time": 1547353784149, "rating": 3.0, "text": "Good luck finding someone to answer a question. Better prices though.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107207837763775911766", "name": "rebecca strickland", "time": 1584259708985, "rating": 3.0, "text": "If you ask where something is they literally have to look on the app to see.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101079947091563059672", "name": "Timothy Cherry", "time": 1617491247130, "rating": 5.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108132685035891926959", "name": "Lee Will", "time": 1600172715672, "rating": 5.0, "text": "👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110216665266841559589", "name": "Ms Q", "time": 1557258866065, "rating": 1.0, "text": "I've tried to order ceiling tiles from this location since April 5th. It is now May 7th and they are still not in. First batch was broken. That's ok but 3 weeks later still nothing.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116809699803642081953", "name": "Melissa Nicely", "time": 1617568292353, "rating": 5.0, "text": "Needed a ladder", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1580338537540, "rating": 5.0, "text": "Very helpful staff and good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102873848574055058950", "name": "BRIAN JOHNSON", "time": 1533935555673, "rating": 1.0, "text": "The black girl in the garden department has this “I hate my job... I hate my life.... and I hate you...” look on her face. In her voice and in her posture. I felt bad about asking her how much the pine straw was...... as if I was not allowed to speak in her presence or as if I bothered her while she was out in space because it was slow. I just wanted to get my pine straw and leave before she started open fire on me for asking her to do something so bizarre as giving me a quote.\nIt’s people like her that worry me....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100698451629668427992", "name": "Kitty Cat", "time": 1537376429001, "rating": 5.0, "text": "The employee's are helpful!👍\nThey have a lot of awesome halloween decorations!!! They have really anything you need for remodeling, air conditioners, decorations and ect.\n😸😸", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102675416392399376892", "name": "Nelson Dorgan", "time": 1546205721193, "rating": 5.0, "text": "Pleasant. At least 10 people ask if i needed help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111064563693576657675", "name": "Cary Campbell", "time": 1593448495731, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116251679599506463513", "name": "Robbin Hilbert", "time": 1551640546895, "rating": 4.0, "text": "Nice and helpful employees, have a lot of veggie, flowers, and herb  plants. A lot of home improvement supply's.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118046956968089073055", "name": "Roger Clark", "time": 1579209266002, "rating": 1.0, "text": "You need to fire everyone in your Appliance Department, nobody knows what they're doing", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114972890779130776757", "name": "Tony Harrison", "time": 1488085209212, "rating": 4.0, "text": "I love shopping at The Home Depot. I find that it's much cheaper than Lowe's. Very friendly employees but they are in need of hiring more employees bad.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117252104033640038881", "name": "Tolley Smith", "time": 1570660136997, "rating": 5.0, "text": "Always perfect go in get what I need and leave", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103836949348301591948", "name": "Almightycorn", "time": 1582941881293, "rating": 4.0, "text": "Always my top choice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114712778326107866835", "name": "Doris Martin", "time": 1549552943298, "rating": 4.0, "text": "Friendly staff, items easy to find, good prices", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111064563693576657675", "name": "Cary Campbell", "time": 1593448495731, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103151469593971789226", "name": "Paul Manning", "time": 1577740628869, "rating": 5.0, "text": "Came home with everything , i went after kayla in flooring, helped me  ,very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100779295001455203355", "name": "deanna lanier", "time": 1582504822927, "rating": 1.0, "text": "The people that work here just walk around,  aimlessly!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114786495704776052318", "name": "Courtney Wolfe", "time": 1523188586168, "rating": 5.0, "text": "Came here on Thursday evening to purchase a dryer. Bien help us & if I could give that man 5 stars of his own I would. He was nice, helpful & knowledgeable (I ask questions) We also found a disherwasher in the mark down area after he had rung up the dyer but Bien didn't mind he got us hooked up with that as well. Every time  I've been there Home Depot employees are friendly & patient. Please keep it up guy!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100698451629668427992", "name": "Kitty Cat", "time": 1537376429001, "rating": 5.0, "text": "The employee's are helpful!👍\nThey have a lot of awesome halloween decorations!!! They have really anything you need for remodeling, air conditioners, decorations and ect.\n😸😸", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100882311540374764492", "name": "Prince G.", "time": 1555533773327, "rating": 1.0, "text": "Sucked no one knows nothing from nothing dont you work there for a reason or just for a paycheck", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100399574085670850453", "name": "Mark L Tate", "time": 1553370758535, "rating": 5.0, "text": "Always find what I need and then some.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105820758827869839747", "name": "Rich", "time": 1530563568949, "rating": 4.0, "text": "People were helpful in finding light fixture, receptacle and wall hangers.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112860769336469642587", "name": "Roy Davis", "time": 1530668711903, "rating": 5.0, "text": "Customer service was excellent.  That helped me find things I had no idea of their location.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105478552768494572814", "name": "Dennestons world", "time": 1549062010110, "rating": 5.0, "text": "Great store for the DIY projects and how to manuals as well.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114308510732916219398", "name": "georgia hacker", "time": 1518642099569, "rating": 2.0, "text": "I am handicapped.  Bought 5 bags of mulch . cashier called someone to load it for me. Finally after I realized no one was coming had to struggle & load it by myself.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109028418160116453852", "name": "Julius Dixon", "time": 1513454008429, "rating": 5.0, "text": "Wonderful experience people friendly helpful all your work is a really good people love to smile and greet you keep up the good work", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101987044554609727582", "name": "Dr L", "time": 1532743095070, "rating": 5.0, "text": "Great helpful service tell them what you want to do and the give you ways to do it good prices and selections", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105368106133542353135", "name": "Howard Strum", "time": 1594216220578, "rating": 1.0, "text": "Never has what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111141955990335730291", "name": "Tommie Williams", "time": 1597981026588, "rating": 4.0, "text": "Good location", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115111173974195082665", "name": "Robbie May", "time": 1526675683654, "rating": 5.0, "text": "Shopping for a large window AC. Service  Desk personnel were extremely helpful in helping us get the correct unit and loaded it Into our Truck. 22000 but LG for $619.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118428536883982090004", "name": "Victory Reliable Services, LLC", "time": 1523038269144, "rating": 4.0, "text": "Excellent Pro Desk service, the best in the region in a good 60 + mls radius beat any other HD in this department, the dynamic duo Marcia and Elizabeth will go the extra mile to find materials for any project, for hurricane preparedness questions and needs ask for Melinda. The store is well organized and seems like they don't move stuff around a whole lot like at any other HD. The rest of the staff in the other departments (plumbing, electrical, etc.) are outstanding too, they're very helpful, with good knowledge, courteous and eager to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102808662761612941757", "name": "Steven", "time": 1535315470552, "rating": 4.0, "text": "Can always find stuff to buy. Just not always what I'm going for.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111986029497490221900", "name": "Eguene Walker", "time": 1583123775136, "rating": 2.0, "text": "There's never anyone there to answer your questions", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107678998529995131834", "name": "Rebecca Jett", "time": 1553812209551, "rating": 4.0, "text": "Helpful staff and well stocked with what you need, when you need it!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106961822857426341956", "name": "William Sutherland", "time": 1593810290585, "rating": 5.0, "text": "They have everything I need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102875121437485715461", "name": "Trish Morley", "time": 1543793360299, "rating": 5.0, "text": "Great place for our home. Always in there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107351436513139773109", "name": "DARK 2.0", "time": 1528948172825, "rating": 5.0, "text": "Bought my stove from there lovely experience good customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100543828475427551472", "name": "Joe T", "time": 1552009877849, "rating": 5.0, "text": "Found just what I needed.  Good price.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106581561356093837246", "name": "Holli Basch", "time": 1608589016098, "rating": 4.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116096364600953090374", "name": "Len Wells", "time": 1495726577652, "rating": 1.0, "text": "No one answers the phone.\nMost employees know very little about what is in the store where it is at or if there is any in stock.\nThe internet tells you they have a product but it is not there when you go to get it and no one will answer the phone so you can find out if others before you drive up there.\nNo real sales or discounts in the store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106802828426796673277", "name": "Megan Crane", "time": 1426167213242, "rating": 5.0, "text": "Bridget the Customer Service supervisor is amazing. She spent over an hour trying to get a online order sorted out for me. She never acted annoyed or upset. Always a smile on her face. She is wonderful!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110271316640344862500", "name": "Jessie Sanders", "time": 1512410686379, "rating": 5.0, "text": "L wonderful experience went back to the paint department they tell me where everything I needed to go get what I'll it was on help me find the paint I needed and it was the right kind", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100550476030937518508", "name": "Lacey Paquin", "time": 1514066099176, "rating": 1.0, "text": "I ordered $1,600 worth of appliances on black Friday to furnish my investment property. I scheduled them to be delivered on Friday, 12/22, and I was told the delivery time frame would be from 2pm-6pm. I planned accordingly and the my appliances were never delivered! No CALL or anything. It took me 4 different phone calls to reach an actual person. The delivery people could not be reached. I waited at the property until 10pm. I went to the store the next day and spoke with the manager, and apparently I was the 3rd customer complaining of no delivery and no notification. The store could not reach the delivery service because they were closed, and would not re-open again until that Tuesday after Christmas. I was told they \"might\" start calling customers then to attempt to re-schedule deliveries. I found this to be completely unprofessional and unacceptable. I cancelled my order and was refunded my money. I am showing my rental Wednesday and it will be empty. Home Depot has hurt my business.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114623470391982426972", "name": "Jamie Pierkowski Ishmael", "time": 1551351614910, "rating": 5.0, "text": "Everyone is so nice and helpful there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109348560891921236241", "name": "Manda McGuff", "time": 1482338530957, "rating": 5.0, "text": "Unfortunately I had been shopping with lowes. It had been on more than occasions than not a terrible experience. I decided to try Home Depot in my recent purchase of a bathtub. Within the first 5 minutes of being inside the store I was greeted by 4 associates. All of which were very welcoming and friendly none of which I have ever experienced at lowes. They pointed me in the direction I needed to go. Upon my arrival of the bath tub isles another associate was there eager and ready to assist me. He opened the merchandise and checked for defects and everything to my satisfaction. None of which I have ever experienced at lowes. Even on the way to check out associates asked if there was anything more they could do to help. Overall my experience at Home Depot was outstanding. I work in customer service and a lot of places lack in that department. Job well done!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102411274432499355628", "name": "P Thomas (PCFROG)", "time": 1584147284227, "rating": 4.0, "text": "Paint department has Friday nights off.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117866553938772280874", "name": "Hummingbird Verses", "time": 1593812204951, "rating": 1.0, "text": "Was never there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114159913113927283524", "name": "Aaron Cowden", "time": 1511023353751, "rating": 1.0, "text": "The ladies at the registers are great but there is no stadf for assistance, and theyre not too knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101621782740978021423", "name": "Al Sauls", "time": 1503526818910, "rating": 5.0, "text": "While at Home Depot a male associate named Leyland and a female associate named Tonja were very helpful to me and my wife in selecting a dish washer and ceiling fan for our home and rental house. They made sure that we got the best price and the discounts that were available to us.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108463844422818951198", "name": "Emilio Valdez", "time": 1503169869533, "rating": 5.0, "text": "Great help. Lowe's lost over $600 on flooring because the manager didn't have time to come help my wife so she came to home depot were we got a better selection and cheaper.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104163262876088875250", "name": "Carolina Alday", "time": 1519947847514, "rating": 5.0, "text": "The employees were very knowledgeable and helped me with everything I needed to get.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111201889428627324697", "name": "Erika", "time": 1503277339795, "rating": 5.0, "text": "Store manager Michael was incredibly helpful in finding exactly what I needed for my vent cover project!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109921743136263194457", "name": "MH M", "time": 1482099982071, "rating": 5.0, "text": "Landon did a great job of helping me find what I needed to finish my project.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105401966393512449430", "name": "joseph morris", "time": 1533039140418, "rating": 4.0, "text": "Better than the one on Montlemar Dr. Better stocked.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101009946016441361608", "name": "Terry And pipe pipe.", "time": 1605624497017, "rating": 2.0, "text": "Not happy", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104343322407975601358", "name": "Sean Steelreath", "time": 1522457503216, "rating": 5.0, "text": "Professional staff, Extremely clean shitters what more can u ask for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107080001725918330267", "name": "Samantha Barton", "time": 1561739546064, "rating": 4.0, "text": "Stopped shopping there when they discontinued the military discount. Cancelled my credit card too", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106132977503775641982", "name": "Frank Davis", "time": 1546614097007, "rating": 5.0, "text": "Home debot, like Lowes, gives military discounts up to $50.00 towards their more pricey items which is a help.  10% across the board but its a start.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111141955990335730291", "name": "Tommie Williams", "time": 1597981026588, "rating": 4.0, "text": "Good location", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106132977503775641982", "name": "Frank Davis", "time": 1546614097007, "rating": 5.0, "text": "Home debot, like Lowes, gives military discounts up to $50.00 towards their more pricey items which is a help.  10% across the board but its a start.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110128508212684208422", "name": "Mike Anderson", "time": 1535539930383, "rating": 5.0, "text": "They have everything you need,for any Project you you have to tackle. Tools and more, Great Prices Too.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118428096489468065193", "name": "Clausell Huff", "time": 1593794561331, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108721048350671908512", "name": "Richard Long", "time": 1596139727767, "rating": 4.0, "text": "Bought what I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102734014262906328928", "name": "Wesley Packer", "time": 1595389227430, "rating": 3.0, "text": "They a little pricey", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117866553938772280874", "name": "Hummingbird Verses", "time": 1593812204951, "rating": 1.0, "text": "Was never there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101009946016441361608", "name": "Terry And pipe pipe.", "time": 1605624497017, "rating": 2.0, "text": "Not happy", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104712438291178280495", "name": "Luke Hildreth", "time": 1546892330264, "rating": 4.0, "text": "Great but need more register open", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101582180480024203533", "name": "Shawn Hinderman", "time": 1592523214489, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104639630769269065496", "name": "Herminio Flecha", "time": 1546227014771, "rating": 3.0, "text": "Unless you know what you are looking for, dont ask the store clerks. You can rarely find any store associate to help. Associates are not familiar with the store's products.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108721048350671908512", "name": "Richard Long", "time": 1596139727767, "rating": 4.0, "text": "Bought what I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105323128250421231146", "name": "James Prowell", "time": 1606960761032, "rating": 1.0, "text": "No help!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101541602566671242619", "name": "Justin Hobbs", "time": 1427279967050, "rating": 4.0, "text": "Friendly staff. I visit this location daily, they are always helpful. They usually have what I need also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107298757813376665622", "name": "Knowledge Gulley", "time": 1583278024519, "rating": 5.0, "text": "Friendly and Very Helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102734014262906328928", "name": "Wesley Packer", "time": 1595389227430, "rating": 3.0, "text": "They a little pricey", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111653794026138916581", "name": "jan kennedy", "time": 1392747126223, "rating": 1.0, "text": "Don't go for special order blinds. The associate  could't even tell me the name of the display model so I could order it. She said it might be outdated.. She also said she would research and get back to me but I got the impression she never would.. what a waste of time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102068549540202716710", "name": "Chris Adams", "time": 1582330743229, "rating": 4.0, "text": "David help was awesome", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1518384873646, "rating": 5.0, "text": "Employees were helpful. Had several walk up and ask if we needed assistance", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103039852126736852093", "name": "T Denton", "time": 1532176110924, "rating": 4.0, "text": "Good appliances. Slow service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102700113626857969621", "name": "Rick Robinson", "time": 1550615632442, "rating": 4.0, "text": "Good selection of home improvement items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112672335846397238901", "name": "Jay Becks", "time": 1533845781965, "rating": 5.0, "text": "Great lumber amd huge selection of products", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100307342772303780445", "name": "MILO BROWN", "time": 1365712029861, "rating": 2.0, "text": "I spent 35 minutes in the power tool department. I went to customer service to ask for assistance and the lady said she would help. I asked her a question and she simply turned to  another employee  and asked him. He responded that the item i was looking for was\"by the ladder\" and just walked away. The item was not by the ladder. This is the worse customer assistance I have ever seen. Twice in two weeks. I will never spend another penny at this crap hole. Lowes will continue to get my currency. HD SUX!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105210760005763006698", "name": "Mike Jones", "time": 1581647471216, "rating": 5.0, "text": "Great for home improvement", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101582180480024203533", "name": "Shawn Hinderman", "time": 1592523214489, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116190989415552930293", "name": "Mathew Kasper", "time": 1556637176548, "rating": 3.0, "text": "Very clean store. My cart was taken by someone while shopping. Not a great tool selection. Lots of items were out of stock. Customer service needs improvement.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108698198049461626156", "name": "Bruce Jones", "time": 1533337067315, "rating": 1.0, "text": "Awful place to shop. I went in there today to buy anchor bolts. Everything was in disarray. Very unorganized. I had to go fight airport blvd traffic and go to Lowe's", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116303520436914352827", "name": "James Stallworth", "time": 1548865184040, "rating": 5.0, "text": "Great store and helpful employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111593104390973544180", "name": "Ana Thema", "time": 1543282063682, "rating": 3.0, "text": "I found what I needed with the help of 4 different enployees", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111218838315913634196", "name": "Brian Cobb", "time": 1549582592134, "rating": 5.0, "text": "I got lost and couldn't find something immediately and had to ask a store clerk for help. So all in all nothing was missing from this visit compared to every other Home Depot visit I've had throughout my life.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100047080999638277350", "name": "Robert Thomas", "time": 1590321425089, "rating": 5.0, "text": "Good selections", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113222393143509711869", "name": "Faye Sheffield", "time": 1578090941722, "rating": 3.0, "text": "Customer service not great!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109887666982652873039", "name": "LC, CE, & DG Mitchell", "time": 1526951552920, "rating": 5.0, "text": "Was looking for an item that looked like it was sold out and one of the associate saw that it has just came in on a big shipment. He found the item and brought it to me.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117182453788562777316", "name": "Amy Toler", "time": 1553799058631, "rating": 1.0, "text": "Associates were rude and had no knowledge of the products they are supposed to be selling. I will not shop at Home Depot again.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116947039998168789506", "name": "Matthew Rhodes", "time": 1464883431720, "rating": 3.0, "text": "They always seem to have less than Lowe's. Their tools seem to be a better value though.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112574890016378356322", "name": "Samaria Moore", "time": 1537118883404, "rating": 4.0, "text": "Friendly people who were available to help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104941670521887577832", "name": "ashley howell", "time": 1543788734360, "rating": 1.0, "text": "Salesperson in tools was very rude to my husband. Will not be returning to this store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109466651452253254805", "name": "Charles Holland", "time": 1524264361756, "rating": 5.0, "text": "I've always liked Home Depot. Can't complain about this location so far!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105265525173498214949", "name": "Philip English", "time": 1545803350838, "rating": 2.0, "text": "Who can help me find what I'm looking for and know about the product?????", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110443859125230193711", "name": "Mark Moose", "time": 1553091456594, "rating": 5.0, "text": "People were nice and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113641364958886547898", "name": "Louie Guertin", "time": 1530528229735, "rating": 5.0, "text": "Friendly curious staff. Helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104190293445325183239", "name": "GHOST AMERICAN BEDOO", "time": 1583776282154, "rating": 5.0, "text": "Zero N95 masks available.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110850431431222582388", "name": "Marie Lange", "time": 1548541339429, "rating": 5.0, "text": "But I bought a pitchfork and some lime time to turn my mulch pile", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109255002131882591689", "name": "JoAnn Rolin", "time": 1595443739502, "rating": 5.0, "text": "Found what I was looking for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105857503108963277455", "name": "Mildred Braun", "time": 1578546555404, "rating": 5.0, "text": "Has everything ineed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116903518238209213835", "name": "Robert Howell", "time": 1544579283345, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116873093007762223478", "name": "Arild Warholm", "time": 1549498672714, "rating": 4.0, "text": "Found what I was looking for.👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112206044726385431454", "name": "Jeffery", "time": 1607224111355, "rating": 4.0, "text": "Same", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108848425929892270304", "name": "Dena Amison-Middleton", "time": 1573334706701, "rating": 4.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115874532383571328778", "name": "Harold Thomas", "time": 1544061476078, "rating": 4.0, "text": "Love the place.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110890729795807530632", "name": "Anthony Welborn", "time": 1577916556837, "rating": 4.0, "text": "Many things on sale", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115482212534389928686", "name": "william smith", "time": 1539640619833, "rating": 2.0, "text": "I had to ask several people where I could find a PRESSURE WASHER,they all sent me to an aisle that has smokers,grills,and PRESSURE COOKERS!!!!°°°", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115170416762104050335", "name": "Charles Brooks", "time": 1539446425427, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117632984121279447948", "name": "Jason Hodges", "time": 1576187092747, "rating": 5.0, "text": "Always awesome!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108274439345624128512", "name": "Joe Williams", "time": 1549334964923, "rating": 1.0, "text": "Not good try to get some help in the blind department on one came to help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1545737474556, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100242437977343106929", "name": "Bob Phillips", "time": 1555280840082, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117062338824095554856", "name": "United Public Radio", "time": 1545748041066, "rating": 3.0, "text": "Could have been better", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100930665885371488074", "name": "Tim Brazell", "time": 1533501819943, "rating": 5.0, "text": "Very good service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100547465487374394620", "name": "TJ Averett", "time": 1578868225056, "rating": 3.0, "text": "No vegetable seeds", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112337751910822875937", "name": "Cantare Alabanzas al nombre del Señor", "time": 1529430292980, "rating": 4.0, "text": "Good customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106837932504973756211", "name": "tim shewmake", "time": 1542483289202, "rating": 4.0, "text": "No one to help you", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112581671648541211232", "name": "Take Flight", "time": 1532576552443, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104716775472412256539", "name": "Michael Thomas", "time": 1553023313416, "rating": 5.0, "text": "Great product", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103866852895116876040", "name": "Darlene Wolfe", "time": 1546546649259, "rating": 5.0, "text": "Helpful staff, always.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117321159902698272338", "name": "Osborne Roberts", "time": 1545624385134, "rating": 5.0, "text": "Great tools, compatible prices,", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110268379310929563933", "name": "Amber Hight", "time": 1539475838417, "rating": 5.0, "text": "Nice vist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1545576579366, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113390643922318265845", "name": "Gary Walker", "time": 1532348350154, "rating": 3.0, "text": "Good layout", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110053686816649363124", "name": "Liz Ming", "time": 1549227649207, "rating": 1.0, "text": "Can't find help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104782360706800629617", "name": "Lula Porter", "time": 1524518489431, "rating": 3.0, "text": "Seemed s little shorthanded today. It took the man with the forklift a half hour to get my fridge to the door.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108060180123467399396", "name": "deep south Diesel cowboy", "time": 1535264948837, "rating": 4.0, "text": "I go here for most of my construction needs", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114228943109386201276", "name": "Kevin May", "time": 1556334861974, "rating": 4.0, "text": "Like it cool stuff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105594355121661133492", "name": "Grand Bay City Girl", "time": 1546222679287, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106100745204828030801", "name": "Terry Manzy", "time": 1547472030369, "rating": 5.0, "text": "Have everything that you need from garden to home projects", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106087890297713426628", "name": "Nathan Hunt", "time": 1549731639961, "rating": 4.0, "text": "Need more plumbing parts", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117397604931476613301", "name": "joshua Atkins", "time": 1537667395087, "rating": 4.0, "text": "People were nice, and helpful....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107362106692827508163", "name": "CHARLES MILLER", "time": 1528506774718, "rating": 5.0, "text": "Refigerator install went great", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112899706162875837839", "name": "Tony Lamm", "time": 1531145168331, "rating": 5.0, "text": "Lots of helpful people.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578672405889, "rating": 5.0, "text": "Its Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113269812323775880863", "name": "emily william", "time": 1556590852620, "rating": 5.0, "text": "Very helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106853288376372087970", "name": "Lisa Normand Davis", "time": 1507572069597, "rating": 5.0, "text": "great service in the paint department", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104269007091832175479", "name": "angela galey", "time": 1550333638649, "rating": 5.0, "text": "Great service and pricing", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113106490236201095403", "name": "William Howard", "time": 1540684734640, "rating": 5.0, "text": "Top notch staff.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103079965585645537801", "name": "sam weaver", "time": 1545945402665, "rating": 4.0, "text": "Great company except lumber is way to expensive.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102797642289151965412", "name": "Brian Nichols", "time": 1561073879360, "rating": 1.0, "text": "The last couple of times I have been in the store only the self checkout was opened. I walk down to the lumber to checkout. Home Depot doesn’t give me a pay check to check myself out. You need to open a line by the self checkout so people have the option instead of walking to the far end of the store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1532399086164, "rating": 4.0, "text": "It's a Home Depot what else is there to say.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111787553837186657344", "name": "Teresa Drinkard Fountain", "time": 1546309758056, "rating": 5.0, "text": "Great Store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100453880335418413398", "name": "Marcus Richburg", "time": 1579461754003, "rating": 4.0, "text": "Yep", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109748683603278994757", "name": "Dallas Hill", "time": 1536836658283, "rating": 5.0, "text": "Very kind and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115502613150956707891", "name": "Alan Scull", "time": 1532191978409, "rating": 5.0, "text": "What ever you need for lawn care", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110049684847264274895", "name": "Debra Colbert", "time": 1523295295403, "rating": 5.0, "text": "Helpful customer service lady", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109016241603667420070", "name": "Brian Meehan", "time": 1548421914496, "rating": 5.0, "text": "Knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107650588747151602258", "name": "JJ fnaf fan", "time": 1541534088351, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117542981899968452725", "name": "Joyce Cody", "time": 1540585751655, "rating": 5.0, "text": "We t right to the items I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118210152394321726686", "name": "Wendy Tulo", "time": 1549950490869, "rating": 5.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101318036086236581776", "name": "E. Sully", "time": 1535825274178, "rating": 4.0, "text": "Just your generic retail home goods store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103335531352260760995", "name": "Ricky Carroll", "time": 1546930284191, "rating": 3.0, "text": "Get what you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114477386696750613101", "name": "Brandi Tanner", "time": 1549918356327, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105294570695074613785", "name": "Chris White", "time": 1533910525773, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1532399086164, "rating": 4.0, "text": "It's a Home Depot what else is there to say.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104716775472412256539", "name": "Michael Thomas", "time": 1553023313416, "rating": 5.0, "text": "Great product", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116873093007762223478", "name": "Arild Warholm", "time": 1549498672714, "rating": 4.0, "text": "Found what I was looking for.👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109748683603278994757", "name": "Dallas Hill", "time": 1536836658283, "rating": 5.0, "text": "Very kind and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112933951290228808603", "name": "Danny West", "time": 1514352386758, "rating": 5.0, "text": "They have any and everything you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113427939733542005542", "name": "Daniel Fisher", "time": 1499533853348, "rating": 4.0, "text": "Very helpful staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118382350873268670028", "name": "Ringo Yokley Herron", "time": 1498518425460, "rating": 5.0, "text": "Very helpful and nice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103598246280809129346", "name": "Vanessa Duncan", "time": 1523823144676, "rating": 5.0, "text": "Great  services!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111787553837186657344", "name": "Teresa Drinkard Fountain", "time": 1546309758056, "rating": 5.0, "text": "Great Store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112160926469257350294", "name": "Warren Horton", "time": 1546099894719, "rating": 5.0, "text": "Love the place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117445325195087096515", "name": "David Carmichael", "time": 1550955400946, "rating": 5.0, "text": "Had what I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111636796631495585000", "name": "Christopher Dyess", "time": 1534298428218, "rating": 3.0, "text": "People seemed racist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100141225573243559931", "name": "L Ray Lindsey", "time": 1532439633048, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111619120493344955303", "name": "Vic Shaw", "time": 1532400332952, "rating": 1.0, "text": "Not well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112160926469257350294", "name": "Warren Horton", "time": 1546099894719, "rating": 5.0, "text": "Love the place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101564131232142485875", "name": "Mary Richards", "time": 1535228240191, "rating": 5.0, "text": "Just like shopping there!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109643419634187383259", "name": "My Life As Chloe", "time": 1546577342991, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116748242871006362723", "name": "Robert Midkiff", "time": 1529796251278, "rating": 1.0, "text": "Rude", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106513086567276043097", "name": "Penny Stanley", "time": 1544492855316, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111219870614421211194", "name": "James Jernigan", "time": 1525224892714, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107821293953100160371", "name": "Sarah Byrd", "time": 1521798082034, "rating": 5.0, "text": "Works are helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113411391146293806536", "name": "Joshua Jones", "time": 1552806791715, "rating": 5.0, "text": "Excellent people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112953364779408892927", "name": "Jonathan New", "time": 1533402122757, "rating": 2.0, "text": "Understaffed long waits", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112179491491546437655", "name": "Ronnie Weitzel", "time": 1532838523411, "rating": 5.0, "text": "My favorite place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109388152793463937790", "name": "Property Care & Maintenance", "time": 1533008299049, "rating": 4.0, "text": "They need more people on the sales floor. People that know where stuff is located.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104945454251529264389", "name": "faze tfue", "time": 1535472642975, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105994050331829418711", "name": "Sam Walters", "time": 1523561219072, "rating": 5.0, "text": "Great place to shop.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115255871671499388824", "name": "Jesse Brown", "time": 1552224288344, "rating": 4.0, "text": "Love this store!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110044359295103851372", "name": "kurt jahnke", "time": 1548359261010, "rating": 5.0, "text": "Has stuff that Lowe's does not, expanded selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108661298482255468236", "name": "Jadera Dees", "time": 1524002799533, "rating": 5.0, "text": "Great expression", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111636796631495585000", "name": "Christopher Dyess", "time": 1534298428218, "rating": 3.0, "text": "People seemed racist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112953364779408892927", "name": "Jonathan New", "time": 1533402122757, "rating": 2.0, "text": "Understaffed long waits", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1468368059281, "rating": 5.0, "text": "Good deals on appliances", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118384910440020869366", "name": "Christopher Poppe", "time": 1462933063408, "rating": 5.0, "text": "I always shop there first.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1545576579366, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578672405889, "rating": 5.0, "text": "Its Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103335531352260760995", "name": "Ricky Carroll", "time": 1546930284191, "rating": 3.0, "text": "Get what you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111619120493344955303", "name": "Vic Shaw", "time": 1532400332952, "rating": 1.0, "text": "Not well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115745958481609162017", "name": "Metrulla Barnes", "time": 1504209905384, "rating": 5.0, "text": "the help was great", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112816232795255375614", "name": "gary sullins", "time": 1500237706255, "rating": 5.0, "text": "Outstanding store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102440875410451859175", "name": "Payton Kynaston", "time": 1507503354656, "rating": 5.0, "text": "Supercalafragliskexpaldse", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108945194261768282669", "name": "Matt Lake", "time": 1500750576372, "rating": 5.0, "text": "The service was excellent. In and out.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109381823413606686871", "name": "rajesh kumar", "time": 1508887825416, "rating": 4.0, "text": "Staff is ready to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116234031405072124643", "name": "Billie DeView", "time": 1498273229770, "rating": 1.0, "text": "Horrible", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108927482445964255884", "name": "Allen Oshea", "time": 1476315659677, "rating": 1.0, "text": "Employees no help.  They could care less if the store sells anything.  I know why it's empty when I go there.    How does it stay in business?", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100255249060710133965", "name": "Richard Hedd", "time": 1499020597671, "rating": 5.0, "text": "Friendly staff.clean.well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106954212289885996471", "name": "Glenda Baker", "time": 1497115826354, "rating": 4.0, "text": "The sales associates were very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107964153372610662737", "name": "Mark J.", "time": 1464872941664, "rating": 4.0, "text": "Not as large as the one off Airport but still nice.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118384910440020869366", "name": "Christopher Poppe", "time": 1462933063408, "rating": 5.0, "text": "I always shop there first.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113884600727340099984", "name": "Jackie MacFarland", "time": 1460168934867, "rating": 5.0, "text": "Plants, tools, hardware and wood.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104533618842092768416", "name": "Jody Poirier", "time": 1459822003251, "rating": 5.0, "text": "Awesome!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104745061944419122913", "name": "Rafael M", "time": 1463043054287, "rating": 1.0, "text": "Is so hot inside,  the weather is cooler outside than inside", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1468368059281, "rating": 5.0, "text": "Good deals on appliances", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111381875140223825276", "name": "Nathaniel “Ryan” Bowman", "time": 1456681512008, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110901525459269813605", "name": "[Oofer Inks Studios]", "time": 1428498328613, "rating": 5.0, "text": "they have cub cadet lawnmowers", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109769136615044453869", "name": "Mey Wallace", "time": 1428253432777, "rating": 5.0, "text": "Customer service here is awesome!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108266776301678367967", "name": "Stephen Jones", "time": 1623983724847, "rating": 5.0, "text": "Pickup from service desk was quick and convenient. Kim was very helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116669912350548994227", "name": "Juan Guzman", "time": 1576283274788, "rating": 1.0, "text": "(Translated by Google) There was no paint gun worth 59.00 dollars, there was only the excibition\n\n(Original)\nNo había una pistola de pintar que vale 59.00 dollar,solo estaba el de excibicion", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117056651426739289546", "name": "Armando Martinez", "time": 1579194549074, "rating": 5.0, "text": "(Translated by Google) Very good\n\n(Original)\nMuy bueno", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109450057972225739486", "name": "Ricardo Peralta", "time": 1535122057594, "rating": 4.0, "text": "(Translated by Google) It has everything\n\n(Original)\nTiene de todo", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110908456014146666611", "name": "Gilda Fernández", "time": 1553912972469, "rating": 5.0, "text": "(Translated by Google) Excellent, I like it very much.\n\n(Original)\nExcelente, me gusta mucho.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111070221025675338365", "name": "Yahaira Michel Jimenez Piña", "time": 1519426681648, "rating": 5.0, "text": "(Translated by Google) Under construction 😉😉😉\n\n(Original)\nEn construcción  😉😉😉", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
