{"user_id": "104919038598558035052", "name": "Courtney Grimes", "time": 1628990462879, "rating": 5.0, "text": "For my daughters sweet 16 we spent a few days in Gulf Shores. The only thing she really wanted to make sure she got to do was go in this store. We spent maybe 2.5 hours searchig for our treasures and we just had an amazing experience.  When we walked in the store you could feel the energy. The owner was so kind. He recommended a few items to us . Selenite and black tourmaline. I really appreciated that he took his time to talk to us and educate us. I hope to visit again before the shop goes to online.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116154995279004995480", "name": "Kinsley Keeton", "time": 1627231081087, "rating": 5.0, "text": "I went here while I was staying in the area on vacation and was looking for a tigers eye bracelet. I easily found just what I was looking for and even bought another crystal. It had almost every crystal I was interested in I will definitely be visiting again next time I'm in town!", "pics": null, "resp": {"time": 1627235105203, "text": "Thank you for the review and your support! Be sure to subscribe to our email for the new location announcement. Our last day in our current location will be Aug 29th. 🙏💜 we will also have a new online website launch in October. Thank you again and we hope you enjoy the rest of your time here in Coastal Alabama."}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "110733453251905385992", "name": "Stormy Rainbows", "time": 1620442898043, "rating": 5.0, "text": "Amazing customer service- My twin two year old toddlers were acting 🤪🤪..The amazing gentlemen came over and let them pick some small black tourmaline for them to keep to help calm them! Then we had forgot our debit card and the nice woman at the desk wasn’t bothered at all in my son still acting a mess. Prices were FANTASTIC! They even have a small mining sluice. Will definitely be making this one of my go to crystal shops! Thank y’all so much for your patience and guidance.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "113554856234577824078", "name": "Kennedy Grace", "time": 1617818744528, "rating": 5.0, "text": "I loved it so much I was only in orange beach for a week and went to coastal zen 3 TIMES. I'm addicted. The staff was really friendly. and the prices are the best I've ever seen. And with them being online now too! they are the only place I'll ever get my spiritual needs.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109644323027919237260", "name": "Mariam Smith", "time": 1625258382531, "rating": 5.0, "text": "My sister and I did a sand bucket panning, it was very amusing and we got a nice selection of rocks and shark teeth! Everything was really cute too, I ended up with some cool mushroom stickers myself ☺️", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO8bGYgt8pNn8NH4Fgq8M_UWorgVDYYNRr4oBIB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCQ1Z4lKZg_wjbG3qTfxWZTHHUCatpKlOD3LsS=w150-h150-k-no-p"]}], "resp": {"time": 1625336407833, "text": "Yeah! Thank you for the review, we appreciate you! So glad you two enjoyed the mining ⛏ have a wonderful weekend!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115598439405820901004", "name": "Allison Chapman", "time": 1614098858325, "rating": 5.0, "text": "I will visit here every time we go to Gulf Shores or Orange beach!! I will have to shop in their online store until then! It was such a peaceful store. The owner was very courteous and helped us but he didn't hover over us like many shops will. We spent almost an hour shopping and everything was well worth its price! So glad we found this gem on our day trip I will be enjoying my goodies for a long time!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "101273241703564572255", "name": "Shawn Mitchell", "time": 1617840710373, "rating": 5.0, "text": "This was by far our favorite shop at The Wharf. We got lucky and were there when the owners were in the store. We were looking at the petrified wood and they ended up showing us so many more interesting pieces! They have this store because they love the stones and other items. Everything was reasonably priced and beautiful!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "118431549054480056261", "name": "Sierota Beth Brackett", "time": 1545067453993, "rating": 5.0, "text": "My experience at A Coastal Zen was fabulous! The owners are warm and welcoming. I felt very much at home as I browsed through their collection of healing crystals, ritual candles & incense, inspirational/motivational art, spiritual & meditation tools, and all sorts of unique trinkets and decorations. The store is filled with interesting products from across the world. There is something here for everyone! The owners even showed me a few of their prized personal possessions which were kept in the back room, making me feel like V.I.P.  The store itself was well kept...which I can only imagine to be a constant struggle considering how many shelves and items must be dusted frequently to maintain the clean environment. Everything sparkles! If you have the chance, ask the owner about the musical vibrations produced by the bronze gong hanging behind the register -- it makes beautiful sounds which fill the space entirely, engulfing it's visitors in a sense of peace and tranquility. This store is just the kind of retail attraction our community needs in this area - Definitely recommend visiting A Coastal Zen as soon as possible!!! Bring more money than you think you will need because you will be surprised how many items will strike your fancy! The owners are well educated in product knowledge and price the pieces very, very reasonably. It's a treasure trove of goodies!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6tYhpY_pMuZpJO8S_typrW-ZMwGWMcZoT_6-M=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2hVRgi4jSugsZNl_wWH5F6VEsuvuoII7AFCkY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkK_x-caP5-0GhCKa7vuRO-zR9iOdUfJlqGvqc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRgnVpymKcLYk0TqJBglyJycKLrevPqLIrm3Nl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNeh4dCZxY8xpGux4bZ6NeguJyDhyH5mMXjdOZ_=w150-h150-k-no-p"]}], "resp": {"time": 1573675648474, "text": "Thank you so very much for such a glowing review. We love our customers and so look forward to you visiting us again."}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "108285055030902494329", "name": "Ken", "time": 1625697423221, "rating": 5.0, "text": "absolutely amazing the store keepers where very helpful and i got exactly what i needed 5 stares", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "111887870042968438633", "name": "Pansexual doom", "time": 1625105409897, "rating": 5.0, "text": "I went to the warf on a vacation and stumbled apon this place, it is so cute and welcoming, the prices are super reasonable and the family that owns the place is so kind and helpful, if you are LGBTQ+ or wiccan/pagan/spiritual this place is a safe space and offers you things to show your pride or help your spiritual journey!!! I can't stress how much serotonin A Coastal Zen gives me!!!", "pics": null, "resp": {"time": 1625118393227, "text": "Awe… you made my night 💕🌈♥️ we appreciate the love and You!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "105941527717159744501", "name": "Free Me", "time": 1584473806085, "rating": 5.0, "text": "My birthday just got better!\n\nThe kids and I came in for a little Crystal mining ⛏ and had a blast learning about different stones and their meanings. I definitely recommend Coastal Zen ! They have great prices and welcoming customer service 🤩🤩🤩🤩🤩 don’t let no hater tell you different 👏🏽👏🏽👏🏽 That’s on period 🙃", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwNmIDwzcb5MeoXNTmesdNXbn-gZntZ4Umt-Oz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115188196653563439665", "name": "Antoinette Hardy", "time": 1608208837981, "rating": 3.0, "text": "I bought my custom made ring from here and I'm totally happy with it. Katherine helped me and she was very patient with me, as I am a very picky. She is very knowledgeable about diamond and will find you a diamond at a reasonable price.", "pics": null, "resp": {"time": 1608219544580, "text": "Hi Antoinette\n\nThank you for a review but I think you may have us mistaken with another company. We do not sell diamond rings nor do we have anyone who works for us named Katherine.\n\nWe are a rock/crystal shop\nIn a orange Beach ❤️\n\nHope you have a great Holiday Season!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "110767971739173120893", "name": "Michelle Murr", "time": 1601868902031, "rating": 5.0, "text": "If you are looking for something and you're not sure what, this is THE PLACE FOR YOU!  Went with a friend in search of specific stones and spent a ridiculous amount of time in the store.  Amazing people and amazing products.  I left with bracelets for myself and friends, rocks for same, prayer candles and a great gift for a friend who is a healer.  A beautiful blessing awaits you, don't miss a chance to check this place out!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107724408712202242719", "name": "Alexandra Co", "time": 1615577340375, "rating": 5.0, "text": "Love this store! Nice ambiance, great selection and the staff is always so helpful, patient and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "101911035290047174789", "name": "Melodye Harleen", "time": 1606730909803, "rating": 4.0, "text": "This place is a non-negotiable part of every trip up north for my brother and I. I generally love bookstores, especially intimate and down to earth bookstores with interesting selections. Loved this place even before I knew all the history it held.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "103423060263731217105", "name": "kxlciii", "time": 1627412527544, "rating": 5.0, "text": "best crystal shop <3", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116719870754323782638", "name": "Don Cheek", "time": 1599139084316, "rating": 5.0, "text": "Glad that we took the time to visit this store. Me and the wife found stones for us both. It was mind blowing how much information Stan gave us and in the decision that we made in our purchases. Will definitely return.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "102986450079815730631", "name": "Suerianne Davis", "time": 1590440305578, "rating": 5.0, "text": "The selection and quality in this store are amazing! The personal attention and the knowledge that Stan and his staff provide makes choosing the stones and jewelry and clusters really gratifying.  Moreover, Stan was willing to work with me to sell and mail an order when I could not travel to Alabama.  I look forward to returning when traveling is safe.  Such a wonderful experience to be at A Coastal Zen!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115759241595641884334", "name": "Lisa Hannah", "time": 1591895445895, "rating": 5.0, "text": "I love this place!! I found it 3yrs ago on our annual trip to Gulf Shores from Missouri my trip is not complete without shopping here for my yearly supplies. They are so friendly and helpful!! Also they have descriptions and uses with each stone its so amazing!! Thank You!! Will see you again in March!!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "117978009444163928080", "name": "Peyton Cole", "time": 1584324349393, "rating": 5.0, "text": "Hey I told y’all I was coming back today but I didn’t keep my word I went on home but I really appreciate all the knowledge Stan blessed me and my family with. I also appreciate the sweet deal he gave me! Hopefully me and my family luck and energy will begin to turn around and be positive", "pics": null, "resp": {"time": 1584367872216, "text": "Thank you, Peyton!  So glad you enjoyed your visit with Stan and hope you come back to see us soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "117418893460506038166", "name": "Kathy Humphres", "time": 1579051086951, "rating": 5.0, "text": "Awesome place with so many cool things and very reasonable prices. I love to go there the owners are so friendly and helpful I could spend hours just checking everything out. If you’re ever in the area you should check them out.", "pics": null, "resp": {"time": 1579218957302, "text": "Thank you, Kathy!  So glad you enjoyed your visit and hope you come back soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "106989566317636622074", "name": "Debbie Busby", "time": 1562794546606, "rating": 5.0, "text": "Very neat little shop! Beautiful crystals, stones salt lamps. Bracelets, earrings etc...\nI was able to find all of my  souvenirs to take back home with me. While I was there they have this mining  thing for children to kinda of mine for their own shells or crystals‼️ Super Cute. Great Customer Service❤️", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100531477350519372235", "name": "Glenda Zollicoffer-Harrel", "time": 1564343270460, "rating": 5.0, "text": "I had such a wonderful experience there yesterday. The owner was so nice. I bought so many pieces, but not everything I wanted, she told they had an online store for using later. gave. She also have me some useful information on traveling back this way next time. I will definitely be shopping online with her.", "pics": null, "resp": {"time": 1579219130908, "text": "Thank you, Glenda!  We so appreciate you taking the time to write us such a glowing review!  Come back soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109410246963741394529", "name": "Tina Cozart", "time": 1603655063085, "rating": 5.0, "text": "Beautiful store, friendly staff and great prices! 💯🥰✨", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "105879156417845088894", "name": "Susanna Forbes", "time": 1582992340490, "rating": 5.0, "text": "Coastal Zen is wonderful, the staff is always very helpful, everything is crazy affordable and they have everything you need. Stan is very helpful and really knows what he's taking about. I always spend way more than I would want to there, but it's totally worth it ❤️", "pics": null, "resp": {"time": 1583410190075, "text": "Thank you, Susanna!  We have the best customers and love that you enjoy shopping with us as much as we appreciate you!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115817234154721227843", "name": "Brandy McGee", "time": 1569379582555, "rating": 5.0, "text": "I’m a huge crystal hound and I was so excited to find this shop on my vacation here. The girl working was super sweet and very knowledgeable. I overheard her helping some ladies to pick out stones and she really knew her stuff. I found a lot a crystals that I didn’t have in my collection. Most expensive one was $3. I love this place!!!", "pics": null, "resp": {"time": 1573675707870, "text": "Thank you, Brandy!  We are so glad you found us and hope you make a repeat visit to our area soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "118410199404825866695", "name": "PαԵԵí Aղժҽɾsօղ", "time": 1583534648758, "rating": 5.0, "text": "Just from the reviews and photos of the shop I want to go visit! I'm a local and will certainly drop some dough on some crystals, tapestries, tarot?, and more😊 I CAN'T WAIT!! Thank you for opening a metaphysical shop in our area! ❤️", "pics": null, "resp": {"time": 1584029592689, "text": "Hi Patti 🙏 I finally figured out how to access these reviews and respond 😇 thank you so very much for the love and support❣️ let us know if we may assist you with any of your spiritual tool needs or if you just want a little pick me 😘 also send a text to the shop phone 251-752-3489 and let us know who you are and we will text you back a discount code to use in the shop or online 😍 Many blessings and much gratitude always 🙏💙😇 MK"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107585261266153304423", "name": "Princess MeMe", "time": 1535217287922, "rating": 5.0, "text": "We had a very welcoming experience. Staff/Owners were very friendly and helpful, not pushy, they were happy to help and answer questions. They made us feel like friends instead of customers. They had a great selection, I had a hard time choosing so I got a few items, We definitely recommend this awesome place. Thank you so much for all you've done for us. Be Blessed!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "108688241742096002504", "name": "Denise Davies", "time": 1584008057130, "rating": 5.0, "text": "Found this place during my yearly October orange beach visit with my husband. I wanted to find a real metaphysical shop, and this is a hidden little gem at the wharf. Whimsical, clean, and the staff was incredibly sweet. 10/10 will visit and give my business every time I visit.", "pics": null, "resp": {"time": 1584029392534, "text": "Hi Denise ❤️ thank you for your kind words and wonderful feedback! We truly appreciate all of our customers and we love hearing feedback! In a world full of rocks you are one of our favorite Gems 💎 😘✌️😍 many blessings to you and your loved ones always! MK"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "102583738884171537878", "name": "Sarah Wyckoff", "time": 1537889341847, "rating": 5.0, "text": "This shop is wonderful, and there is nothing quite like it in our area! The selection is great, and the prices are very reasonable. The staff were so friendly and helpful. I will definitely make this a regular stop!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "104018556506574443253", "name": "Brandy Knodel", "time": 1577908146001, "rating": 5.0, "text": "My absolute favorite store ever. Love you all and thank you for walking with me down my crystal journey.", "pics": null, "resp": {"time": 1578078515213, "text": "Thank you, Brandy. We do enjoy our customers and love making their experience a fun one when they visit us. We hope you visit us often!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116561567481842370655", "name": "Cara Prentice", "time": 1534638274181, "rating": 5.0, "text": "Loved this place! It was so nice to find a store that is so peaceful and inviting in a busy tourist area. Great selection of crystals, stones, jewlery & more. Owners are great and very knowledgeable. Make sure to ask them to show you what they know!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "111067639276278611653", "name": "Lauralea Lasher", "time": 1533939949251, "rating": 5.0, "text": "A wide variety of crystals and stones. Extremely reasonable pricing. Great selection on natural quartz crystals. As well as knowledgeable and friendly staff. I had to come back twice in a week for more!", "pics": null, "resp": {"time": 1533959835385, "text": "Thank you! We are so excited to be open and sharing our love of Crystals and things Love! We truly appreciate you taking the time to leave us a review! May you always be showered with Blessings!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107458850428980040331", "name": "Rachel Lavergne", "time": 1534546676072, "rating": 5.0, "text": "Absolutely love this place, I found a beautiful Mermaid light for a reasonable price and they were even nice enough to offer me a discount since I was from out of state. They have so much to offer, glad I stopped by!!!!\n\n-Rachel", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "113309432870010260344", "name": "Lindsay Hoebing", "time": 1534460765463, "rating": 5.0, "text": "What a wonderful establishment! There’s such a wide array of items available. The owner is very knowledgeable about everything in the store as well. I wish there were more stores like this!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100276064635021776205", "name": "patricia forrest", "time": 1535233043231, "rating": 5.0, "text": "So grateful this shop is here now! Beautiful store with a great selection and incredible customer service. There's something for everyone here and the owners are extremely knowledgeable and so, so kind!! 💙🙏💚", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "104523760068173848331", "name": "dolly wallace", "time": 1537997882878, "rating": 5.0, "text": "Outstanding customer service and were very knowledgeable about their inventory. Liked them so much I will buy from their online store until my next visit to Orange Beach.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100544967325688369505", "name": "Jeremy Thomas", "time": 1534002650470, "rating": 5.0, "text": "Really cool stones, very nice!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "112452067092588535891", "name": "Ben Mikeworth", "time": 1623434820764, "rating": 5.0, "text": "Just a class act all the way around.  From check in to boat rides and especially the parasailing. Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMywjX2ESc4jQnU0J4_qakBO8krgNZKb0EvWYlq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQa9_1-4mFGURGbwqMQDca78_59h5XyMLUhgwE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "118334688489341790021", "name": "R1OT MooNLiGhT", "time": 1626058069212, "rating": 5.0, "text": "A great experience with even better service!  Thanks to the Captain and crew! Love the picture package too!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMkvcq-0vzHbtccCIfkqnOE-L5or4VgULYyqst9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113680391698937759900", "name": "Eric Patterson", "time": 1621181313327, "rating": 5.0, "text": "The kids have wanted to parasail for a long time, and this trip we did it. Ike's was awesome. They worked us in very quickly and took great care of us. My wife is very nervous around water, and they made her feel comfortable and safe. Jason and Parker were absolute professionals on the boat. They knew exactly what they were doing and were very alert, attentive, and FUN! The music they played was GREAT. I've been listening to Eminence Front by The Who ever since that trip!\n\nIf you're looking for a unique and fun experience this is the place.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117555793293686319163", "name": "Donna Cook", "time": 1617821519361, "rating": 5.0, "text": "These guys and gals are top notch.  Easter weekend and the water was ice cold, but we would do it again.  Check in girl was nice and personable.  Lots of smiles.  Guy getting us on the banana boat, same.  Two guys on the boat were lots of fun. Jason and Charles, I think, but not sure. Thanks to all for making this a great experience", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115035756958284019451", "name": "Susan Gonzales", "time": 1623702730230, "rating": 5.0, "text": "Very professional.  From Lady at office( I had lots of questions), to waiting for banana boat( man nice), ride to boat.  Captain Jason and first mate very professional.  Great time. Take off smooth and landing. Beautiful I would use Ikes again. Will return.  Great time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105585507491636142436", "name": "Brett Leatherman", "time": 1625006300754, "rating": 1.0, "text": "Booked with Ike’s for a 12:30p flight for a family of 6. We arrived and were told they had boat issues and if we wanted to sail, would need to travel to their Gulf Shores location for an evening flight (6p). We booked there, after spending our morning waiting to go on a noon flight, and received a call at 2:30p asking us to switch to a 5p flight at the Gulf Shores location. Called back to confirm, and was told the captain was canceling the remaining afternoon flights.\n\nWe wasted an entire day of our vacation trying to parasail with this company. We were able to call around and grab a flight with another company - who fit us into a 6p slot (severe clear weather). Will not use this company again - despite the original recommendation - and cannot recommend them to any family or group looking to enjoy your beach vacation.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100079567439276013111", "name": "Joy Bauer", "time": 1623804694000, "rating": 5.0, "text": "Wow! What an EXCELLENT experience Ike's has it ALL!  From the moment we inquired to the end of our parasailing adventure their customer service was top notch!!  We met some AMAZING people from the lady who greeted us at the stand to the jet ski driver Sawyer and Cam.  Our boat crew Jason and Jacob were super friendly, entertaining and helpful!  They made you feel comfortable the moment you stepped onto their boat!  I would highly recommend Ike's for your parasailing adventure!  You even get to ride the banana boat to get out to the boat!!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112613479893655019404", "name": "heidi heusinkveld", "time": 1616977229175, "rating": 5.0, "text": "I cannot express enough, how amazing Ike’s is!! Jason and Sawyer made our dreams come true! The weather did not cooperate the week that we were in Alabama, but they sure worked extremely hard, for our experience. Hands down, the best! Very knowledgeable and lots of fun! Highly recommend this company, five stars!!  Thank you from the bottom of my heart, for all of your effort in getting us in the air!\nHeidi Shanks and boys", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113068897801911959828", "name": "coloradolife 18", "time": 1622494207309, "rating": 5.0, "text": "Very first activity we did while on vacation.  Had to so much fun I brought my little cousin to fly just 2 days later. Thanks Jason and Parker", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111624210339903788034", "name": "Lisa Rohr", "time": 1601411651877, "rating": 5.0, "text": "We had an amazing time parasailing with Ike's Parasail.  We had a couple glitches that was no fault of theirs and they made it work so that we wouldn't miss out on the fun.  There were so many jelly fish in the water where we were supposed to get the banana boat they called in advance and said we could still go if we wouldn't mind coming to the marina in Orange Beach to catch the boat.  No problem!  Everyone at the check in point was very friendly and very helpful.  The water was rough that day but it was just a couple days before Hurricane Sally.  Our captain did his best to make it as smooth as possible for us.  Our crewman was amazing.  He handled the rough water very well and managed to get us our life jackets, our harnesses, help us get ready to fly and also took a ton of pictures!  He deserved a large tip for sure!  We were shocked at all he was doing!  We had 8 of us from 9 years old to 67 and we all loved it.  They were very knowledgeable and we felt comfortable with them the entire time.  We all want to do it again someday!  Hopefully the weather and the water will cooperate next time and we will get the banana boat ride too.  Ike's did everything they could possibly do so that we could enjoy our adventure!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPxCb3fWNMIIF4hpBqhG14bKk1kpBNpU2JFykkT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPS6rGqKZOyrnjdSzWTolBvvjCIjdiiT5PO_qTs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOcf3VWsQXWOCpiAP280S7IXGH477lH97rh5nt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoZKn8Dkh1vByVAjY-kaCWUkwbGJa4-lZ9-egH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOb6Nggs1uDMPOiGY92cIFKAzh3_9odFQqUcUi-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111275201028277313551", "name": "Emily Bauer", "time": 1623802567920, "rating": 5.0, "text": "We had so much fun parasailing! The crew was all very nice, helpful and funny.  I would highly recommend everyone going parasailing with Ike’s.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112288561029813569404", "name": "Kimberly Dowdy", "time": 1622571228067, "rating": 5.0, "text": "My daughter and I had a fantastic time parasailing. She is scared of heights, but they made the experience phenomenal. They talked us through every step. Jason and Parker were absolutely the best. My youngest daughter and husband loved the boat ride. After, we returned to the boat my daughter said she would definitely parasail again as long as it was with them. Anyone thinking about parasailing, I would recommend them above anyone else, hands down. Great job, guys. We loved it!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108039189095717229578", "name": "Keeler Family", "time": 1623365435532, "rating": 5.0, "text": "Ike's Parasail was fabulous...from the friendly girls at the kiosk to the guy getting us fitted for lifejackets....everyone was friendly, helpful and explained how things would work. The crew on the boat were especially great at taking care of things, explaining and making it fun!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112245816677631539391", "name": "Karen Sweeney", "time": 1617400938059, "rating": 5.0, "text": "Highly recommend this place! Today my two young kids, myself, and my mother went parasailing with this company. The two men who worked on our boat were so fun, and made us all feel at ease. We had a wonderful time, and would recommend this place to everyone of all ages!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117165957576851976135", "name": "Jill Schilling", "time": 1624554654380, "rating": 1.0, "text": "We just left the banana boat ride. We paid for 30 minutes of ride time, but only received 12 minutes. We paid almost 90 bucks for a 12 minute ride? What the HELL. The boat that took my family out rushed them back and went out to pick up parasailing. WOULD NOT RECOMMEND!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101345838248006483130", "name": "Mistie Merritt", "time": 1623901183497, "rating": 5.0, "text": "Most Amazing Part of Our Trip was Parasailing🪂with Captain Jason and Crew 🙌🙌 They were so fun and personable. Oh and don't forget Captain Weiner, that ride to the boat was Epic 😉😆 This is our new Vacay Spot, We will be back. ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116064370610976713274", "name": "Amy Guiter", "time": 1619471477132, "rating": 5.0, "text": "First mate Charles and  Captain Jason were FANTASTIC and our kids will always remember the experience!  We felt very safe with them!!", "pics": null, "resp": {"time": 1619533864878, "text": "I am glad ya'll had a great time.Come back and see us again. Thanks Ike"}, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104449179020374141391", "name": "cuddy link", "time": 1622734483623, "rating": 5.0, "text": "Jason the captain was great and his deck hand Jacob was key to all the fun great time highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116694581118368868510", "name": "Carol Lawson", "time": 1599453917104, "rating": 5.0, "text": "We had a great time!, Everyone on the team today was kind, knowledgeable, fun to interact with and very professional! We had as much fun getting to the boat as we did flying! Mike and Justin were great on the boat, I didn’t feel nervous at all!  Can’t wait to come back next season and do it again!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPFU4AcRMzM-qJNwQ8oKM9P4ZioaH4908IpPOkO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP1LLwHo7hQacjylGFfcRVJq_XnVquzmniXGU08=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111187115990737809179", "name": "Mark Black", "time": 1599247258103, "rating": 5.0, "text": "Picking Ike's Parasail off Google was a win. Took my 74 yr old dad for his birthday and he loved it. The entire crew from check in to the water was fantastic and on their A game. They were friendly, safe, and knew exactly what they were doing for a smooth experience from start to finish. Would highly recommend and will go with this company again next time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117452201108850334305", "name": "Rodney Teague", "time": 1596765281748, "rating": 5.0, "text": "Loved it! Family of seven from nine to seventy-four years old-- all had a spectacular time. Everyone from the booth attendant to beach side to captain & deckhand took great care of us and were great at their jobs. We felt safe and free to just enjoy the ride. Top notch!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115893413822450800900", "name": "Marvin Carlton", "time": 1595284727064, "rating": 5.0, "text": "Great group of people... the weather wasn't cooperating well but they got us scheduled and it was great!!! The crew at the gulf state park boat was very nice and you can tell they know what they are doing cause they do it well... l will definitely take the family flying above the gulf again when I come back!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111093343809286085844", "name": "Jeannie Smalygo", "time": 1593300019788, "rating": 5.0, "text": "Online reservation was fast and easy. Everyone was awesome, from the check-in crew on the beach that got us fitted for life jackets, to the crew on the boat. We had a blast! Note: you can’t take phones or cameras on the boat, so if you want photos - spring for the ones they take (the price was reasonable and you get the SD card). Go and have fun!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113268338371239321856", "name": "Kristen Neary", "time": 1596658170555, "rating": 5.0, "text": "Everyone communicated what would be happening next very well. We always knew what we were doing. The banana-boat ride out to the boat was an added bonus! Charles was an amazing photographer and was very professional. He kept our daughter calm when she was scared. Mike did a great job driving the boat and made the \"flight\" fun and peaceful. I definitely recommend this place and I hope everyone experiences Charles and Mike on their trip. The guy who put us on and off the banana boat was great too, but I didnt catch his name.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100572416401252904854", "name": "Debbie Trojahn", "time": 1597430464658, "rating": 5.0, "text": "We rode the banana boat in Gulf Shores. So fun!! The staff was very helpful and friendly. Charlie gave us directions and fitted us with vests. Josh pulled us with the jet ski, and gave us a mildly wild ride. We laughed and laughed. Thanks for a good time!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108017534121858901873", "name": "Brandy Enlow", "time": 1596552164944, "rating": 5.0, "text": "Mike and Sawyer were amazing. Our little family had such a great time. I’ve never been parasailing before and they made sure we knew what to expect and were so nice and friendly. I highly recommend Ike’s! If we ever come back this will be exactly who we book with.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103476858386112320358", "name": "John Burnette", "time": 1594963226017, "rating": 5.0, "text": "Absolutely perfect!  All of the crew working Ike's at Gulf State Park Pavillion site were great.  I took my 11 year old and he had a blast.  We bought the picture package and pictures turned out very good.  Great people, great service, great value, and a great time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104891323418910225491", "name": "Beth Sparks", "time": 1595083122833, "rating": 4.0, "text": "We entrusted our two 14 year old girls in the hands of Ike’s Parasail and were not let down! We only spoke with the young lady in the booth at the Gulf pavilion and the man who helped them with life jackets and onto the banana boat, but they were both very nice and did a great job explaining the process and just being friendly and interactive. My only complaint (and reason I didn’t give 5 stars) was that the pictures that I purchased in advance for $40 were not of good quality. Yes they took about 40 pictures, but only a couple of them were print/share worthy. The rest are either real blurry or have the rope in front of one of the girl’s faces. Otherwise, the trip was an incredible experience that these girls will never forget.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115812730219789397743", "name": "Jamie Lane", "time": 1595959188990, "rating": 5.0, "text": "This was our first time to parasail, my 9 year old and me. The experience was amazing! The guys, Jason and Josh, were wonderful! They explained everything to us clearly! I read review after review after review and decided to go with Ike’s. We will go with them again! We had a great time and plan to make this our beach tradition!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102032660312531378598", "name": "Mitzi Norris", "time": 1618673650232, "rating": 2.0, "text": "The actual sailing was alright. But... The boat driver \"Flew\" over very rough waves, too fast, \"Blaring rock music so loud we couldn't hear ourselves talk, while he \"sang\"! Won't use them again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100248874727256271606", "name": "Topitina Topitina", "time": 1594785804021, "rating": 5.0, "text": "This team is really good, they do not risk their customers! It was a very fun adventure, since you start by going on a banana boat to the little but comfy ship and from there off you go into parasailing! My daughter and her friend really liked the whole experience. My only suggestion would be to allow customers to take their own pictures. Anyway, Thank you guys!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101638656045510729699", "name": "Pearl Green", "time": 1592423465662, "rating": 5.0, "text": "Jason and Sawyer were our boat guides.  Best experience ever! Smooth transition on and off the boat.  Took my 11 yr old granddaughter for her first parasail experience. She loved it! on future trips I will definitely use Ike's again. very fun and professional.  we even got same day reservations! z you will get wet, so be prepared! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105232924255886792613", "name": "Lailah Utnage", "time": 1595649804256, "rating": 5.0, "text": "I took my daughter for her birthday and it was everything she had hoped for. The crew on board the boat was fun and entertaining, and not to mention safe. This is a professional operation that I will be using again. Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108026423971829202722", "name": "Kathleen Edwards", "time": 1597271816464, "rating": 5.0, "text": "Stayed at the Resort 4 days, Parasailing was on my bucket list. All I can say is Katelyn Wood was so amazing and friendly she made the signing up great then Charlie, Sawyer and Jason made us all so comfortable and laughing. A Great time was had by all, Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101769737931341262791", "name": "Cheri Hogrefe", "time": 1590945476388, "rating": 5.0, "text": "It's not cheap for a family of five, but it was SO much fun. We filled out all the forms online to expedite the process, and I highly suggest doing that. The banana boat ride out to the big boat was hilariously adventurous. And the parasailing was awesome. Gorgeous views, and felt completely safe. Captain Jason and first hate Sawyer were very professional, but made sure we had a great time!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116143728085165778929", "name": "Amy Wilson", "time": 1596489340347, "rating": 5.0, "text": "My 12 year old daughter and I went parasailing for the first time with Ike’s. It was a wonderful experience from start to finish! The staff at the beach as well as the captain and crew on the boat were awesome! My daughter and I both had a blast!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107093398156673812639", "name": "Lisa White", "time": 1592684654635, "rating": 5.0, "text": "Safe, tranquil, beautiful, very smooth take off and landing back on the boat. Not scary at all!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMHBI2EyLJfjaHJcglB2W36HW5yOVlsC77NPM9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpE3PzRNhmWAn10Mbnklz_ZcAhZoBOJu1AuQC_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107749332393888510601", "name": "Jennifer Rose", "time": 1594524963505, "rating": 5.0, "text": "Jason(Captain) & Swayer(First Mate) were amazing! They explained everything very well. I was very nervous about going up! They were kind and very patient while I convinced myself again to just do it! I highly recommend this group and looking forward to our next trip!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112631520903087189084", "name": "Caitlyn Matherne", "time": 1596486845842, "rating": 5.0, "text": "We had the most amazing time. My nephew had been asking to parasail since he was little and we finally said yes for him to go. The crew on board were so kind and efficent. The ride was smooth and something we will always remember. Would definitely go again, especially with Ike's!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102497639235200821433", "name": "Brenda Box", "time": 1592490885631, "rating": 5.0, "text": "Jason and Sawyer were our guides. They were very professional and made our first time experience great. They were very knowledgeable which is what I needed since I am afraid of heights. I highly recommend this it is definitely one I enjoyed and will do it again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115305120826021550501", "name": "J K", "time": 1597281925294, "rating": 5.0, "text": "Went parasailing with Jason and Taco. Taco worked very hard and took some great pictures and Jason made sure everyone enjoyed themselves. Would absolutely recommend this experience and appreciate Taco and Jason making sure we were safe.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103204846140524677660", "name": "Jess J", "time": 1596560545383, "rating": 5.0, "text": "I don’t have enough good things to say about this group. The staff is phenomenal. I can’t remember everyone’s names, but thank you.\nCharles, Sawyer, Chase, and the pretty lady at the kiosk killed it. Highly, HIGHLY recommend.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103090884463485040102", "name": "Ashley Tharp", "time": 1592452680892, "rating": 5.0, "text": "These guys are super friendly, knowledgeable and fun! We flew at the Flori-Bama spot, and highly recommend them. They made my husband and daughters' first flights easy and memorable. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107781513781815784943", "name": "Allison Warren", "time": 1594658365283, "rating": 5.0, "text": "Jason and Sawyer were amazing!  Best parasailing we have done. The playlist on the boat was fantastic!  Very professional and we felt very safe. The banana boat ride to the boat was fun too. We also rented paddle boards from Ike’s and that was fun too. Best service!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101676874983919245980", "name": "Adam Routon", "time": 1593694288912, "rating": 5.0, "text": "My daughter and I had a great time parasailing with these guys. Jason and Josh did an awesome job with us out there! I highly recommend these guys if your in Gulf Shores.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101991732846455334955", "name": "Tina Mansker", "time": 1599852214070, "rating": 5.0, "text": "These guys are amazing, we will definitely go again and will only use Ike’s in Gulf Shores. Captain Jason, Sawyer and Charles you guys are amazing thank you sooooo much!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107324075987974502874", "name": "Patricia Strand", "time": 1595081518745, "rating": 5.0, "text": "Had a blast!  The two J's (I can't remember their names, just that they started with the letter j.) were funny and efficient with getting everyone off and Parasailing.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110156811049658285979", "name": "Bark Bark", "time": 1593544751442, "rating": 3.0, "text": "I believe his name was Nick, one of the employees on the beach who fitted my wife and I our flotation vests was very friendly and seemed like he really wanted us to have a good time. The crew on the boat ensured our safety and was patient when I kept slipping down from the harness seat and reeled me in two times to try to fix the issue. The 3rd time was a charm. What I did not like about my overall experience is there was no safety brief or instructions on what to do before getting on boat. Also, I felt it creepy having to record a video of myself reading a waiver form promising not to sue and send it in. The actual flight was a pleasant experience. I also thought it was a little pricey and nervy to ask to pay gratuity up front.After paying taxes and gratuity, it was expensive. was it worth it? Yes, but at the price I paid, I would not do it again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "109570846664406890002", "name": "Shawn Schmitt", "time": 1592602512255, "rating": 5.0, "text": "This was our first time parasailing and we loved every minute!! Jason and Sawyer were absolutely terrific!! We have a special needs daughter and they were fantastic with helping her in and out of the boat as well as interacting with her on her level. They made us and our daughter feel comfortable and confident in their abilities. We had a fabulous time and will definitely ask for this crew again next time we are in town. We would highly recommend Ike's Parasailing.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108616221073660191211", "name": "Devin Pierce", "time": 1597616859210, "rating": 5.0, "text": "Jason and Charles are great! They made the entire experience fun, Friendly, and memorable! Had an awesome time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105375721212787858122", "name": "kimberly soper", "time": 1594232587675, "rating": 5.0, "text": "We had an an awesome experience. The staff were amazing! I highly recommend them and would do it again.😄", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107106280694817929435", "name": "Britney Brunette", "time": 1596488359357, "rating": 2.0, "text": "Little upset that it is now a \"requirement\" for an observer to be on the boat due to under 16. (Ages 13 and 15, 16 in 2 months) the kicker is having to pay the observer fee when it's mandatory. However, the boat crew was very nice, even the lady at the kiosk was nice. The rule is dumb.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116051210578128818714", "name": "Camae Smith", "time": 1596679255971, "rating": 5.0, "text": "Lyndsey, Jason, and Sawyer were all incredible representations of your company. We had a blast, and will definitely recommend to friends and family!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113139942268546363021", "name": "Chris Melton", "time": 1592621585164, "rating": 5.0, "text": "It was a great experience I highly recommend doing this. Sawyer and the boat driver (sorry I can't remember the name), were great and made everyone on the boat feel comfortable.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115374143736102184044", "name": "Doug Ernst", "time": 1596192414691, "rating": 5.0, "text": "We booked Ike’s parasailing online for our trip to Gulf Shores. My boys (6 & 8) had never been, but they wanted to try it.\nThe booking experience was simple and easy. On the day of our flight/sailing, we were able to park at Ike’s (great, as parking at the beach can be tough), then walked over and were treated and taken to check-in. It was friendly and efficient!\nIn no time, we were life jackets, and being escorted out for a (fun! My boys loved it!) banana boat ride to the pick-up area to boat the Chute Yeah.\nAs we got on the boat, I couldn’t help but think it was the Outer Banks guys or the Rob Spicoli was our captain... but immediately I saw the way they handled the boat & gear and KNEW that these guys were true pros. Not only were Jason (Capt) and Josh (first mate, shark fighter/rescue diver/photographer) extremely Proficent, but they made it a complete BLAST!\nGreat tunes, fun atmosphere, PERFECT (safe, from take off to the dip, and landing) experience!\nBook at Ike’s...ask for Jason & Josh... you won’t be sorry.\n\nOh, and the ride itself... well, my 6 y/o told me it was “the best week of his life” because of it, and my 8 y/o simply said “Dad it was epic”...\n\nAnd you know what...they both were right. Come see for yourselves!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100867944459465400873", "name": "Katie Davis", "time": 1592169702147, "rating": 5.0, "text": "Great experience! Beach crew were friendly and efficient. Boat crew (Jason and Jacob) were awesome. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "118236299864760211956", "name": "Sarah Jane Richards", "time": 1563922579178, "rating": 5.0, "text": "The staff made this the best parasailing trip! The men were kind and helpful. You may need their assistance getting on the banana boat! I'm glad I found my one piece for this activity! 😎 We plan on doing this again during our next visit.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfbiV9MnPJCeT6fq86vwl3RjVLHTgHuKOGtQx4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110121690249245439181", "name": "Bruce Shipwash", "time": 1592421328542, "rating": 5.0, "text": "Great time, Great service. Went para sailing for the first time with my 12 year old son. We had a blast and would definitely do again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106658722596838009141", "name": "Dawson", "time": 1596758609608, "rating": 5.0, "text": "Ike's Parasailing is the best! Jason and Sawyer knew what they were doing and explained everything since it was our first time. Give Ike's Parasailing a try you won't be disappointed! I will go with Ike's again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113197449152152375286", "name": "Pam Van", "time": 1596051356607, "rating": 5.0, "text": "Other than me and my husband falling off the bannana boat🤣😂🤣😂 it was a great time. Our kids loved it!!!  RIP my ball cap!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113953689603143165695", "name": "A C", "time": 1594818289752, "rating": 5.0, "text": "Took my 12 year old son out yesterday. The pretty blonde haired guy driving the boat was wonderful and so was the guy helping on the boat. The people we rode with were complete weirdos to put it nicely but we had a good time anyways. I have been parasailing many times in many different places and can tell the guys operating this boat know what they are doing so if this is your first time parasailing you are in good hands.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "107961848279338047579", "name": "Jennifer Crumby", "time": 1592186806720, "rating": 5.0, "text": "My daughter , and I did this today. We had such a great experience! Great group of people.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "114386236418888039550", "name": "mindy davenport", "time": 1594237030116, "rating": 5.0, "text": "We went out this morning with Captain Mike and Josh. They were both amazing!\nHighly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "111882113478526662272", "name": "Jennifer Searcy", "time": 1596464434853, "rating": 5.0, "text": "what a blast.  music on the boat was great.  everything we expected", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110950394431088888214", "name": "Amy McCall", "time": 1594919297931, "rating": 1.0, "text": "Absolutely terrible! 1:00Pm scheduled time and they tell us “sorry we can’t find you anywhere”. We have a paid receipt, charged over $600 and are told by the girl on the phone, “sorry, we can book you again but will have to charge us another $600”.  We are currently waiting to see if the manager actually calls us back.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102659449226715424178", "name": "Dustin Klinedinst", "time": 1589161311858, "rating": 5.0, "text": "Road the Banana Boat float. Was a blast. Great guest service. Easy booking. Well worth it.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106074214723852385975", "name": "Jason Archer", "time": 1597176343350, "rating": 1.0, "text": "This is probably the worst business I’ve ever encountered. Ashley is super incompetent and should barley be able to be out in society.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102224258252334903203", "name": "Victoria Russell", "time": 1595109873655, "rating": 5.0, "text": "So fun! Everyone was very nice and helpful!!! Boat crew had the best vibes! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113168284171787233297", "name": "treetop7232", "time": 1590508422665, "rating": 5.0, "text": "We were first timers and they made it smooth! It was a great experience, wish we had done it sooner and will add it to the future trips.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116001283764394403842", "name": "Smils", "time": 1599528551816, "rating": 5.0, "text": "We had a great time! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "109138288733879746891", "name": "Cheryl H", "time": 1593958161229, "rating": 5.0, "text": "These guys and gals did a great job. We had a blast!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101944790716029360841", "name": "Ashley Smith", "time": 1592591774515, "rating": 5.0, "text": "Fantastic customer service and experience. We will definitely return on a future trip.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112432046853882313922", "name": "marc alexander", "time": 1593812436805, "rating": 5.0, "text": "Great time, my kids LOVED it! Professional and courteous people.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112241099385591840121", "name": "Allen Scholl", "time": 1598040417569, "rating": 5.0, "text": "It was definitely an experience worth trying at least one time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "109251174601236724901", "name": "Warren Harper", "time": 1592468539587, "rating": 3.0, "text": "My wife and son (13) loved the parasailing, but not fond of the \"adventure\" to get to the boat. Had to ride a banana-boat pulled by a jet-ski to the parasailing boat. Our jet-ski driver was over-eager to say the least. He took off before my wife was on the banana-boat which forced her to get on it in higher water which was extrememly more difficult. Once on, he took off before she had a secure hold which slung her into the middle of the \"water carriage\" and onto the legs of other passengers. Thus, 5 for the parasailing; 1 for the banana-boat.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102465602373915874427", "name": "Lance Smith", "time": 1564921028890, "rating": 5.0, "text": "My wife and I loved our trip up in the sky. Beautiful sites all around. The captain was a great guy to talk to (forgot his name, originally from Maine, worked in the Virgin Islands at one point.)", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105365681693080263931", "name": "Michelle Bennett", "time": 1560782816508, "rating": 5.0, "text": "Parasailing with Ike's was the best vacation activity!!  The staff was best in class at service and making you feel comfortable.  I was the adventurous mom who took her 2 boys flying.  It will be one of my favorite memories from our trip.  The boat staff was AMAZING and very professional.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110821965051048549114", "name": "janet spare", "time": 1561821720394, "rating": 5.0, "text": "Ike’s parasailing is the best in gulf shores. The staff are helpful and friendly and are an example on how to deliver great customer service. We had people of various ages 12-50 participating and they all had a great time and felt safe doing so. Great day!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103135950865856860224", "name": "Kerry Story", "time": 1592658091106, "rating": 5.0, "text": "This was a great crew and a hell of a experience would recommend to everyone .", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112693605406061859330", "name": "Amber McKathan", "time": 1596928278029, "rating": 5.0, "text": "Great experience and the captain/crew were great!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103192913367894143594", "name": "Jeff Mathews", "time": 1563545299186, "rating": 5.0, "text": "Everyone was friendly and knew what they were doing. The pictures did not turn out as well as we had hoped, but we got a few good ones. Thanks for the fun adventure!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104041625155973876743", "name": "SARAH RICHARDS", "time": 1563405045765, "rating": 5.0, "text": "Awesome trip! The two men that helped us were patient and understanding. We had a blast. Hardest part is getting on the banana boat. 😎", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "103427951324057219766", "name": "Todd Thurston", "time": 1565721030435, "rating": 5.0, "text": "Took my daughter for her first trip up. SHE LOVED IT. We had captain jotty and he was wonderful.  We were a few minutes late to get started but our flight times were not shortened to \"catch up.\" The staff were all professional and polite. Capt. Jotty was awesome. Good pictures. They are a few dollars more than their competitors but would easily recommend to a friend. Book early as they fill up the day pretty quickly.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117733576284056620838", "name": "Richard Wiginton", "time": 1563910705643, "rating": 5.0, "text": "This place was amazing! They are in the process of renovating their office, but they were extremely helpful on the phone in getting us to the right location.  Once there, we only waited about 10 minutes until we were seated on the banana boat and headed out to the boat. The crew was amazing and very personable. They obviously know what they're doing, but still take the time to talk with the participants. I had a fear my motion sickness would kick in once in the air, but I felt nothing.  However, I might suggest taking motion sickness medicine anyway due to waves you experience when sitting idle in between rides. Overall, we loved this experience and would use Ike's again in a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110257829677286289920", "name": "Clare Anderson", "time": 1564022055195, "rating": 5.0, "text": "The staff was so friendly and were very good at their job! I never once felt unsafe or nervous. I will definitely go back if we are in the area again and wanting to parasail!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106432624414931280707", "name": "Jeffrey Keel", "time": 1594242959851, "rating": 5.0, "text": "Thanks Jason and Sawyer. Great trip.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110607161027293131714", "name": "Marc Weindel", "time": 1563812295855, "rating": 5.0, "text": "The staff was amazing! Mike (the boat driver) was fun and accommodating! I would highly suggest this place for an enjoyable and fun experience for the whole family!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116808953903976977163", "name": "jared thacker", "time": 1561553573347, "rating": 5.0, "text": "The team was courteous and helpful. It made a great experience all around. I would do it again next time.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "108109980520497428882", "name": "Kayla Hauser", "time": 1565926597454, "rating": 5.0, "text": "Super easy to book the trip and the whole experience was well done.  Very friendly and knowledgeable staff.  Such a smooth activity, an amazing experience.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115267238608189928063", "name": "Jade Wilson", "time": 1593173372861, "rating": 5.0, "text": "Great crew, boat captain excellent, banana boat captain was great.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105692500393328825040", "name": "Ryan fister", "time": 1564977615445, "rating": 5.0, "text": "It was me and my 8 year old daughters first time parasailing and I’m so glad we found Ike’s. Everyone was so nice and safety was obviously everyone’s number one concern. Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102460884055257639906", "name": "Levi Underwood", "time": 1561769563180, "rating": 5.0, "text": "They really treated me well. I showed up a little late compared to when I was asked to arrive but they kept my spot for me. I even got a little sick on the boat and was nourished well. Plus I was even by myself and they accommodated me well in that scenario.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100234380431765613428", "name": "Steve Rogers", "time": 1562117348065, "rating": 5.0, "text": "All around great experience. Staff was friendly and knowledgeable. The parasailing was really fun. Can’t wait to do it again.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116800483391050360045", "name": "Julie Hasty", "time": 1562449883370, "rating": 5.0, "text": "Great experience and very helpful/friendly staff!!! Warning: if you go out from Gulf Shores you will board a banana boat to get to parasail boat! It’s hard to get on and hang on to but it sure is fun!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "104750761825576428167", "name": "Jennifer Klenke", "time": 1562379926127, "rating": 5.0, "text": "Love Ike's. We did banana boating, parasailing and rented lounges from them. Friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113703997588711212206", "name": "Courtney Bernado", "time": 1560294809612, "rating": 5.0, "text": "First time parasailing for myself and my husband. Great experience. Staff was very professional. The guys on the boat were thorough and professional. I would recommend you taking some motional sickness pills if you tend to get nauseous on a boat! Overall we LOVED it and would go again! Highly recommend Ike's in Gulf Shores.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110536361943520648012", "name": "Chad Butler", "time": 1533779250868, "rating": 5.0, "text": "Super day with Ike’s Parasailing!  We went with our 11 yo son and daughter. They took great care of us from the shore to sailing! Great attention to detail—safe, beautiful ride.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "115883216304872508396", "name": "Melina Keithly", "time": 1560464571055, "rating": 5.0, "text": "Very professional crew! It was a gentle and smooth ride. Instructions were clear and safety was obviously a priority.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "117369579549438678671", "name": "Aimee", "time": 1529958355890, "rating": 5.0, "text": "This was our first time parasailing!  It was awesome!! The staff at Ike’s were knowledgeable and very accommodating.  They made sure everyone had a blast!   We made a reservation online and we went right at our scheduled time.  I highly recommend Ike’s!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116438575126355228591", "name": "Brian Honaker", "time": 1533586863362, "rating": 5.0, "text": "Very friendly, professional and knowledgeable of what they are doing. This was my first time and they made sure I had a great experience.... so much fun.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101104037439829589132", "name": "Ronald Gramling", "time": 1534284351231, "rating": 5.0, "text": "Outstanding staff from signup to boat to shore!  What an experience for some first-timers from TX. Went with my daughter and her friend and they were nervous as nervous could be. The demeanor of our boat crew made us all comfortable. Nice.  Helpful.\nGenuine. Honestly I dont think the 15% tip was enough and wish there was a close out process after the experience so I could have increased it. When they ask if you want the picture package, just do it, totally worth it. So many great photos for us to share!  Good people.  Great experience.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "110083815035414690132", "name": "andrew newby", "time": 1590357289839, "rating": 5.0, "text": "Great operation and a great time!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "113617680312776947828", "name": "Teresa Kidder", "time": 1599580820796, "rating": 5.0, "text": "Absolutely Amazing.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "106256254356720434457", "name": "Stevie Sims", "time": 1561848784008, "rating": 5.0, "text": "The owner was extremely helpful, courteous and understanding! I would definitely recommend them to anyone in the area!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "114580842230203515641", "name": "Scott Lambert", "time": 1523196737416, "rating": 5.0, "text": "Best and Safest Parasailing on the island.\nThe crew is extremely Pleasant and knowledgeable.\nEveryone we talked to said this was by far their best experience parasailing.\nWe cant wait to go again next year.\nGet the photo package, you will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "102368606240960942114", "name": "Maegen Nicole", "time": 1565141644662, "rating": 5.0, "text": "Such an amazing experience. Get the pictures it's worth it.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "116730304879611512537", "name": "Beth Cason", "time": 1533829168903, "rating": 5.0, "text": "This was my first time parasailing and it was an awesome experience.  Everyone with Ikes services was wonderful.  I would definitely use them again.  VERY friendly and helpful!!!!  Thanks for a wonderful experience!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "112315854680256032888", "name": "Seth DeVries", "time": 1559225148547, "rating": 5.0, "text": "The whole crew is great. The only thing I would suggest is take some motion sickness pills before you go.", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "105628245276558954979", "name": "Susie Kryzsko", "time": 1597155413946, "rating": 5.0, "text": "Awesome experience!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "100853742136232120639", "name": "Therron Henderson", "time": 1531449222621, "rating": 5.0, "text": "ABSOLUTELY WONDERFUL AMD SOO MUCH FUN!!! DEFINITELY WILL VE RETURNING AGAIN SOON!!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "101605316290849187644", "name": "Bryan Hagen", "time": 1532533931818, "rating": 5.0, "text": "We can't wait to go again next year!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
{"user_id": "114077504837964089235", "name": "sherry stephens", "time": 1560014820039, "rating": 5.0, "text": "Wonderful experience the Crew were awesome!!", "pics": null, "resp": null, "gmap_id": "0x889a1b4e82cbffff:0xef4e8de4ae91f85f"}
