{"user_id": "105804476630149485966", "name": "Rachel Watson", "time": 1623515111855, "rating": 4.0, "text": "Was my 1st time going here. I had my eyebrows waxed and a gel manicure. Very friendly people! The young lady that pampered me was very nice, made me comfortable and did an awesome job. Im not so sure ill go back to the saloons this was a much more friendly experience and Breanna did a great job!!! 😁 oh! And much more cost efficient!! Lol 💅", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPKqzgQdRWJj1pwz3ZlAYqCypz59X4bldBFB1w=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "107936443454501860553", "name": "Tabitha Nicholson", "time": 1615544056082, "rating": 5.0, "text": "Did a great job coloring my hair!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPfOWTkf62DCHkOH6PNi9eO-vS4L2s2OZfnul7c=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "107890833450870843187", "name": "Jody Gibbs", "time": 1607686265642, "rating": 5.0, "text": "When i arrived the door was locked. But while I was standing there reading the signs the door opened and someone came out, gave me hand disinfectant, & took my temperature. Handed me a clipboard of papers to fill out. Then told me to come back at 1:00 as it was almost noon.\nI arrived back a few minutes before 1:00 but stayed in the truck. At 3 minutes till one, Shea came out and took me inside.\nFrom that moment it was a very delightful experience. Shea was very friendly, and careful. Asking me how I wanted my hair done, and calling her supervisor to check at every step. If you ask me she wouldn't have had to, she knew what she was doing. But that was proceedure.\nI will keep going back to New Beginnings as long as Shea is there. And when she graduates, will follow to her to her new place of employment.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "101434827620019992397", "name": "Tammy Stephens Snider", "time": 1619142616693, "rating": 5.0, "text": "Meg Hallmark is awesome!  She gave me a perm and I love it so much!  Thank you Meg!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "112358002285596657417", "name": "Beverly “flossie” Hunt", "time": 1619800433400, "rating": 1.0, "text": "Went for a simple caramel highlights wich was supposed to take maybe 2 hours latest ...and the girl that done my hair was asking for help and nobody would help her so i ended up there nearly 5 hours and a week or 2 later my hair is turning a orange color on my highlights ..nobody will answer my phone call or even offered to make things right ...will not return my calls or answer the business line so im unsatisfied", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100630390806977138576", "name": "Dave Sligh", "time": 1614199967096, "rating": 5.0, "text": "Absolutely fantastic. Great experience and very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "106941977019639629431", "name": "Janice Montero", "time": 1616702959300, "rating": 5.0, "text": "I rely like the environment there. All are friendly and they know what they are doing..", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "115308378428696566280", "name": "I'm literally Unknown", "time": 1595991622959, "rating": 5.0, "text": "The students are all friendly and do a great job.  The supervisors are very conscientious and kind.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "101974544040197614149", "name": "Norma Stanford", "time": 1487176904290, "rating": 5.0, "text": "My stylist yesterday was Kelsey Davis. I would highly recommend her to anyone. She was polite, kind, professional, and very attentive to my wishes, needs, and comfort. I previously had my hair colored elsewhere. It didn't turn out anything like I wanted. Kelsey had a major challenge in fixing the color than wasn't right and giving me what I had originally wanted. She took her time and exceeded my expectations. I have no problem with recommending her to anyone. She did an outstanding job and I'm extremely pleased with her work. Thank you, Kelsey.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103694298105350650695", "name": "Macy Williams", "time": 1488912936166, "rating": 5.0, "text": "I went in there today to have a pedicure done by Jennifer Williams and I had an amazing experience. They turned out so good and it was very relaxing. On top of that, it was an even better price. I would recommend anyone to go there and ask for Jennifer!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "111003605627662679451", "name": "Karla Roberts", "time": 1530023980995, "rating": 5.0, "text": "Peyton McDaniel does an amazing job! She cut and colored my hair and I love it! She is always so friendly and knows what she is doing. She has also done my nails and cut my son's hair. Every time she never disappoints!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108575710224048338052", "name": "Jeff Walker", "time": 1533594059516, "rating": 4.0, "text": "Had a great experience. Student Cosmetic Ian and instructors,we're very skilled and more interested in doing a great job than just pushing another customer out the door. Marissa B. did my haircut and I've no complaints at all", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103744974855222744822", "name": "Living Our Forever", "time": 1488563213482, "rating": 5.0, "text": "This place is great! Heather Stanfield and Raquel Lara did an amazing job on my perm and were so patient when they had to stay late to finish it. They were both great and I highly recommend using either one when going in for any hair needs! You guys are great!!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103188055979229011207", "name": "James Jeffery", "time": 1496368051672, "rating": 5.0, "text": "Always a great experience for me. The students, the instructors, & the atmosphere are great! If you want high quality service at half price, give this place a try! I don't regret going, I don't think you will either!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "112625295630170876897", "name": "Adrianna Buttram", "time": 1501619155817, "rating": 5.0, "text": "Absolutely love this place!! Not only do I always leave feeling beautiful, but the staff is so friendly and knowledgeable!! I am a repeat customer of Avery Burke and she always does amazing! My chi environmental smoothing treatment turned out amazing!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "116594805093985473328", "name": "Brittany Davis", "time": 1490242816288, "rating": 5.0, "text": "I went in two weeks ago to get my hair done and it did not turn out the way I wanted to so I came back tonight and truly had a wonderful experience. I made a new friend and my hair was fixed and looks absolutely amazing. Thank you Madeline Baker!!! You're fantastic at what you do!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "111651963170755577349", "name": "Jennifer Smith", "time": 1551538229494, "rating": 5.0, "text": "I love this place its inexpensive and every time i go im always pleased with them. The women have great attitudes and smiles and i definitely trust them.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100225688673105912050", "name": "Melissa Diaz", "time": 1489001116687, "rating": 5.0, "text": "It was Great! I got white tips on for the very first time, by Estefany P. I actually loved them, I liked how dedicated she was to doing her job. I would recommend her, I sure will come back, before she graduates. Thank You! Have a Nice Day Everyone At the New Beginnings 👏🏼☺️", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108840225945483081769", "name": "Cswords369", "time": 1492099440110, "rating": 5.0, "text": "I went today and had a pedicure by Jennifer Williams. My nails look awesome and the pedicure was more then I expected. The price is hard to beat as well. I recommend Jennifer for anyone needing their toes ready for summer time.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "118270088918458392871", "name": "Dawn Brothers", "time": 1529033471993, "rating": 5.0, "text": "Peyton McDaniel did a root touch up yesterday on an all over color she did for me a couple months ago. It turned out just gorgeous! I have had SO many compliments on it already! I also had her give me a mani & pedi because she said there was an awesome special right now, and it turned out beautiful! Thanks so much!!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "118253728699595845233", "name": "Emily Karr", "time": 1509306291801, "rating": 5.0, "text": "Crystal V. was my student and she did an amazing job on my hair color! Great pricing as well! Will definitely be a repeat customer.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "109096401179432549564", "name": "Charity Swann", "time": 1490235036714, "rating": 5.0, "text": "I went in today to get my nails done for the first time ever. I was getting acrylics and I was pretty nervous, but I really enjoyed Jennifer Williams doing my nails and I definitely recommend asking for her. She talked to me the entire time and was really great. My nails look amazing.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103471464052338019377", "name": "Nick Johnson", "time": 1561406411135, "rating": 5.0, "text": "Great place great service and that girl kenzie is my favorite only person I let cut my hair.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "102420787543886796920", "name": "Keshia Whisenant", "time": 1490988633964, "rating": 5.0, "text": "I went in to get a pedicure today, and I am very pleased with my service I received. Jennifer Williams did my toes and she did a fabulous job!! :) I recommend her if you go in.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "101300818303164774788", "name": "Maribeth Freeman", "time": 1491337366843, "rating": 5.0, "text": "Anna Young was very professional, a delightful personality, and my feet look like someone with years of experience did my pedi! You can tell she loves what she does, and I think she has a very bright future in the beauty field. Thank you, Anna for a wonderful, relaxing experience and new, beautiful toes!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "110126386565520479383", "name": "Dakota Couch", "time": 1492797993668, "rating": 5.0, "text": "Elizabeth Carter did a amazing job on my stiletto nails. I will definitely keep seeing her. She's very sweet and great with customer service.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "104502149525355797010", "name": "Jaleasa Hampton", "time": 1493924859086, "rating": 5.0, "text": "It was a good hair appointment experience. I was included in the styling and any time I asked a question I was given an answer. Kristin Chandler & Faith were very good at relaxing and styling my hair.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "102630640989129910849", "name": "Joanna Davis", "time": 1487637579074, "rating": 5.0, "text": "Loved my service. I highly recommend Kelsey D and Kylie W for foiling!! Very friendly and outgoing girls! Enjoyed my time in the chair!:)", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "109187634573910188493", "name": "Amanda Holcomb", "time": 1493039879688, "rating": 5.0, "text": "Elizabeth Holcomb did my total hair transformation, first time high lights on my daughter and she also did formal hair and nails for my oldest daughter. Excellent job from a talented young lady!! Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108375724866924521465", "name": "Dakota Harp", "time": 1529080460835, "rating": 5.0, "text": "Elizabeth Carter was very friendly and a nice person. She was very thorough with everything. Very pleased", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "113034682845722617001", "name": "Danielle Smith", "time": 1532002392094, "rating": 5.0, "text": "Had a pretty difficult color put in my hair and even though it took 6 hours, the student/hair stylist did a wonderful job. It didn't seem like 6 hours because she was friendly and carried on constant conversation. Heather Stanfield did awesome.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "116062845966220016093", "name": "Pam Chandler", "time": 1487095884962, "rating": 5.0, "text": "Very friendly with interesting topics to talk about. I liked that she was showing interest in her client! She did an excellent job with my gel nails!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100251265248326621061", "name": "Janna Ashmore", "time": 1488490282443, "rating": 5.0, "text": "If your looking for a great experience without spending a fortune. I would definately suggest that you give these girls a try!! Ask for Natalie she is there in the evenings. 530pm-9pm.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "113509465873345930258", "name": "WENDY SAYE", "time": 1491522760988, "rating": 5.0, "text": "I got my hair colored with foils and almost 6 inches cut off. I have to say Heather Latta did an awesome job. All staff and students were friendly and nice. 👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100235307789845832367", "name": "Johni Robson", "time": 1526678007089, "rating": 4.0, "text": "Elizabeth Carter did a cut, color and highlights on my hair and did an awesome job!! I highly recommend her!!!! Thank you so much for a job well done!!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "106639208762597082142", "name": "Mari DeJesus", "time": 1489027465131, "rating": 5.0, "text": "Big thanks to Madeline Baker.\nI got my Eyebrows waxed and a Facial.\nI would definitely recommend her!!\nShe's really nice and patient and she definitely gave me the results I was looking for !", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "113554146101130129556", "name": "Joanna Ellis", "time": 1490898604623, "rating": 5.0, "text": "I went in today for a pedicure by Jennifer Williams. It was a great experience, very relaxing and my nails look great! I would highly recommend visiting NBCC and ask for Jennifer!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "102055862279916099335", "name": "Halina Yates", "time": 1529080463105, "rating": 5.0, "text": "Elizabeth Carter did an excellent job and was very sweet and professional while doing my manicure. I would definitely come again.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "102284641759917683986", "name": "Carmen Bahena", "time": 1496239599778, "rating": 5.0, "text": "Yesterday, Tabitha at New Beginning College of Cosmetology did my hair, nails, and waxed my eyebrows. We spent several hours together due to the amount of service she provided. She did an excellent job on everything. I had a mani and pedi. Both looked fabulous when she was done. She cleaned up my brows very gently and neatly. The results of my hair is my favorite. She gave me colorful peekaboo highlights  in the back that can be hidden if needed and covered the gray in the front. I am very picky about my hair being trimmed, but she had no problem doing as I asked her to. I highly recommend Tabitha when you need beauty services.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "115074382041977940961", "name": "kendra hendrix", "time": 1488305191714, "rating": 5.0, "text": "My students name is Cindy Albury. I had a wonderful experience. I really enjoyed talking to her n getting to know her. She is really sweet. I will be coming back.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "109236453710510617017", "name": "LoneWolf", "time": 1486685966756, "rating": 5.0, "text": "Had a great time. Great cut and trim. Any new customers, pick Brittany Evatt. She Truly does a great job", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "113467825685102559891", "name": "Annette Hills", "time": 1532907521950, "rating": 5.0, "text": "Elizabeth Carter She did a awesome on my hair and will be back again till she graduates....", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "116456022342905278829", "name": "Jonathan Smith", "time": 1486598255608, "rating": 5.0, "text": "Tabitha Bissonette was awesome!  She was very professional and did a beautiful hairstyle for us. We would highly recommend her services.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103388656430769584172", "name": "Gayla Hayes", "time": 1487980584901, "rating": 5.0, "text": "Very sweet, jolly personality.  A+ quality work and caring about her work and outcome.  Helped by Dreamer.  Both made a good experience for me, Barbara Dorsett.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108519721429888817978", "name": "Whit Neely", "time": 1526660201529, "rating": 5.0, "text": "Liz did an awesome job on my hair and I will go to her every time now.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "115160869412468634749", "name": "Kay Couch", "time": 1533302958233, "rating": 5.0, "text": "My first time at New Beginnings.Amber Sergeant gave me a perm,and did a great job.Very professional and friendly.I will definitely go back.Everyone I came in contact with was extremely nice.I have already recommended them to several peope.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100471790542412937271", "name": "Hayley Barbee", "time": 1486500395640, "rating": 5.0, "text": "I am a graduate of New Beginning College of Cosmetology.I recommend that anyone looking to further their future to inquire at NBCC. I obtained so much information throughout my time there, and felt confident when it was time to take my state boards. 7 years later, I'm back to take the student instructors course!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100626464683454071622", "name": "Jessica Roman", "time": 1535769423041, "rating": 1.0, "text": "I went today to get my eyebrows done around 7 p.m. This was my first time coming to Nbcc to do my eyebrows. Because where I normally go it was closed. I needed them done today for a special occasion tomorrow. I don't even know the lady that did them she didn't tell me her name. She was doing a good job at the beginning I checked on my phone when I thought she was done  and then she said they were uneven so she was going to was just a very little more. But instead she waxed a lot without even asking me if it was okay for her to keep going.when she was done she told me to look at them and when I was I literally had just a small line of eyebrows she waxed almost all of my eyebrows and she still left them uneven. When I saw them I just wanted to cry I didn't want to be rude with her so I just went to pay. My sister was so mad when she saw me she said that I shouldn't even had paid but I still did. The lady that did them didn't even looked like she was sorry that made it worse. Now I have almost no eyebrows. I had very pretty eyebrows before. I told her in the beginning I only wanted the extra hairs waxed and not thin. She did the exact opposite. I was already unsecure about myself after my pregnancy months ago. Now I'm so much worse. I was suppose to go out tomorrow for a special occasion now I can't even go because I don't want anyone to see me. I have just been crying I just can't explain how much this has affected me. Now only solution is to get them microbladed, but that can cost more than $200. That may be my only option. I don't know what to do I can not get my natural eyebrows back.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "102167024973336549581", "name": "Matthew Nash", "time": 1528990470157, "rating": 5.0, "text": "Elizabeth Carter was amazing! I’ll definitely be coming back to get my mani pedi’s from her!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103408761876371090916", "name": "Faith Jordan", "time": 1486500146339, "rating": 5.0, "text": "I love being a student at NBCC, I also love all the clients that come in for a service. If you like good service and very polite stylist, this is the place for you.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108617769712437741407", "name": "Jennifer Samples", "time": 1532445871468, "rating": 5.0, "text": "Destiny Samples is the hair goddess. Go by and let her change your life.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "112736443083669981873", "name": "Chasity Lusher", "time": 1489804690748, "rating": 5.0, "text": "Lacee did a fantastic job on my gel nails tonight. She is a very talented student and I highly recommend her for any of your cosmetic needs.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "101984475512141745333", "name": "Bev Nunez", "time": 1520454837660, "rating": 1.0, "text": "Had my nails done here and i will never do it again i had to go to another place a pay more money to have my nails fixed and they made fun of the job that was done i just wanted to cry it was just horrible the girl doing them was nice but I felt like she had no clue what she was doing and i have seen other students do nails and she didnt even do half of what they normally do. Lesson learned", "pics": null, "resp": {"time": 1520632767131, "text": "Thank you so much for your review. I apologize for the experience you had. I was just notified you came in today. Thank you so much for allowing us to serve you again! I hope we were able to serve you well. We try hard to teach great customer service to our students while they are training throughout the program. If we can do anything to better your service with us please don't hesitate to contact us at 256-878-6430."}, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "101395170674706675328", "name": "Caitlyn Green", "time": 1487990478068, "rating": 5.0, "text": "Had an amazing experience at New Beginnings!! Brittany Evatt cut and colored my hair, as well as gave me a manicure and a pedicure!!! I would definitely recommend to others!!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "112550859145897006603", "name": "matthew minton", "time": 1528990196579, "rating": 5.0, "text": "Payton was absolutely amazing! Will forever get my nails done by her from now on!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "111023987877924296782", "name": "Madison Stone", "time": 1506018455019, "rating": 5.0, "text": "Awesome experience! Loved my stylist Ali Stone! She's literally amazing!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "114209139335769218993", "name": "Aimee Lands", "time": 1531971145712, "rating": 5.0, "text": "They are really nice and really good and cheap  I highly recommend this place!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "115180745068352206570", "name": "Jessica Todd", "time": 1526676376623, "rating": 5.0, "text": "Elizabeth Carter did a fantastic job on my lip and eyebrow wax!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "104792644181794670886", "name": "Calob Mcgullion", "time": 1492797906613, "rating": 5.0, "text": "Kristin Chander was wonderful! She did a great job with my manicure and pedicure! I will be back!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "106613094629224754282", "name": "Amanda Salter", "time": 1488644998204, "rating": 5.0, "text": "Great students! Grest experience! Tabitha Bissonnette did an amazing job on my  hair cut and eyebrows! She's talented and professional!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "109568701815927491252", "name": "Letzani Bermudez", "time": 1486498978849, "rating": 5.0, "text": "Love this school and all my teachers.\nLots off love and blessing to all", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "111765398198772002292", "name": "Denise Satterly", "time": 1486673868828, "rating": 5.0, "text": "Kristin Chandler is very professional, my hair looks good and feels good. Done a great job", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "102735783135856422045", "name": "Nina Nicholson", "time": 1491193417276, "rating": 5.0, "text": "I have been there three times now and I have had wonderful experience each and every time. Ciara Sweeting and Cindy Albury are my two stylist and they are absolutely fantastic. They made sure I had everything I need, were extremely kind and funny and did an amazing job on my hair. They offer high quality service for half the price of a regular salon. I highly recommend these two great girls!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "115604298559774921593", "name": "Gabe Jung", "time": 1531945291785, "rating": 5.0, "text": "Great service, nice people! Maddox fell in love with Lyncey.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "118193266813687961881", "name": "Tonya Holcomb", "time": 1489099647714, "rating": 5.0, "text": "Estefany P Was amazing. She paid close attention to detail and did a great job.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "107094449003665293139", "name": "Jerica Cloud", "time": 1506703847241, "rating": 5.0, "text": "Elizabeth Carter done a really good job on my nails she is awesome", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "110455271066422809643", "name": "Lauren Reeves (LaurenR10)", "time": 1489870450013, "rating": 5.0, "text": "Cindy Albury did my nails for prom & I absolutely love them! She did an amazing job!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "103403987486673199847", "name": "Avery Burke", "time": 1486499696361, "rating": 5.0, "text": "I start cosmetology school here two weeks ago and I love it! I have a ton of fun and have learned so much in the short time that I have been attending NBCC. I absolutely cannot wait to see what else I learn from here and build my cosmetology business!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100836520460425029665", "name": "Lindsey Kitchens", "time": 1488511819616, "rating": 5.0, "text": "I had Madeline Baker do a perm on me! It was awesome and I highly recommend her to everyone", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "109340336379561015027", "name": "JOSH DODD", "time": 1487196647668, "rating": 5.0, "text": "Hannah Gazaway did a great job on my haircut today.Definitely will be back.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "116729859551898317856", "name": "Kathy Stratton", "time": 1490810837337, "rating": 5.0, "text": "Jennifer Williams done my nails. They turned out great.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "100916614019999466674", "name": "haley looney", "time": 1487189056402, "rating": 5.0, "text": "Hannah Gazaway did a fantastic job on the brown and blonde bayalage that I wanted and the results look just like the picture that I showed her. I am definitely going to use her for my future hair needs.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "116589252885226390359", "name": "Jennifer Patterson", "time": 1537557573117, "rating": 5.0, "text": "Britney P. Does a really good job", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "107597671434680545945", "name": "LuAnn Williams", "time": 1490295289629, "rating": 5.0, "text": "My granddaughter and I just got a pedicure from Jennifer Williams at New Beginnings and I would highly recommend her!  Not only was it a great experience but you cannot beat the rates.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "104035065589051469494", "name": "Joy Mayben", "time": 1531547840955, "rating": 4.0, "text": "I love the way Elizabeth Carter did my hair. I couldn't be happier.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108398944595451871845", "name": "Kimberly West", "time": 1486755066016, "rating": 5.0, "text": "I have Jennifer Williams every Friday do my hair, she pampers me. I always have such a wonderful experience when I go to NBCC. Jennifer always works so hard to make sure I'm satisfied...which I always am, she knows exactly what I want.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108626638227119478664", "name": "Carol Smith", "time": 1487266729091, "rating": 5.0, "text": "Heather Stanfield did a fabulous job on my haircut", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "114125264172060735958", "name": "Haley Self", "time": 1486502003258, "rating": 2.0, "text": "They won't color my hair the color I want and I pay then way to much to color the color they think I should have its my hair and if I'm going to pay almost $50 for hair dye I want the color I chose.", "pics": null, "resp": {"time": 1486671029343, "text": "Haley Davis, Thank you for bringing this to our attention.  I am so sorry you had a negative experience with New Beginning College of Cosmetology. We strive hard to make sure we teach our students by example great customer service. We try to the best of our ability to educate them on how important the integrity of the hair is and sometimes that can be more than a one step process color service. I would love for you to contact me personally (Kelly Ball (256)878-6430) and see how i can help resolve the matter."}, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "111448460863842844703", "name": "Mark Bissonnette", "time": 1491597737810, "rating": 5.0, "text": "Kylie did a wonderful job.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "101003805371449015345", "name": "Ken Grabe Jr", "time": 1533930110056, "rating": 5.0, "text": "Friendly faces\nFast service", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "116204745251077231697", "name": "Raquel Lara Rojo", "time": 1486498949337, "rating": 5.0, "text": "Great hair styles! 😍", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "112009067219187285962", "name": "Jessica Dykes", "time": 1487879146192, "rating": 5.0, "text": "I think that Heather did an excellent job on my hair because i had never had highlights in my hair and she took her time and was very attentive to what i wanted so i rate new beginnings with five states", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "115624443215088498036", "name": "kaylie davis", "time": 1545193304557, "rating": 1.0, "text": "They tool almost 3 hours to do my nails and it looked terrible", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "112932005922396387854", "name": "ReBecca Cochran", "time": 1524679356584, "rating": 4.0, "text": "Professional attitude.", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "107696656360325286901", "name": "Stella Moore", "time": 1486499119675, "rating": 5.0, "text": "Great students, great services, great prices!!!!", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "108158073769157101376", "name": "Laura Daniel", "time": 1530384073691, "rating": 5.0, "text": "LOVE LOVE LOVE", "pics": null, "resp": null, "gmap_id": "0x888a03361245650b:0x84a24a7fa5eb592f"}
{"user_id": "107906338584538891007", "name": "Keilee Camargo", "time": 1623884630243, "rating": 1.0, "text": "My mom went in today wanting to go blonde or at least lighter than what she was. She went in with orangish hair came out with black and some botched blonde highlights. Had an appointment for tomorrow but definitely not going after that 😬", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "114812181731159200570", "name": "Belinda Montgomery", "time": 1618596562313, "rating": 5.0, "text": "Kala has been my stylist the last 2 times I have had my hair done..She gave me a great cut and style the 2 days ago she colored and highlighted my hair and she did a Bang Up Job..Go Kala", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "103499340797027905344", "name": "Stephanie", "time": 1620321685529, "rating": 5.0, "text": "Love it ! Gone there for years - prices are great, people are friendly. Services are done by students who are supervised by instructors.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "107310911629435708452", "name": "Anna Linn-Brown", "time": 1601552475284, "rating": 1.0, "text": "I requested Carmel highlights and asked that they be blended in with the rest of my hair. I was told I had to paid extra for that which was fine. I waited 40 minutes for them to even start on my hair once I was in the chair. After they were put in I was left and then they checked and I told the girl that she had processed it too long and that it was too light. She walked away. The Instructor said that it had 8 more minutes and highlights usually required toner, but that would be extra. I stated that I did not want my hair that light. No one would listen so I just had the girl was and dry it to get out of there. I’d stated multiple times already what I wanted and was continually ignored and told I could come back to have it toned to make it what I wanted. After they’d botched it in the first place why would I go back. It was completely the instructors fault. She gave this poor girl bad instructions and then they made it seem like my hair was just fine and it was my problem I didn’t like the giant over bleached chunks in my hair!\nI used to like going there. I will never be back again.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "116253907472969270217", "name": "ERICA GULLEY", "time": 1604713225274, "rating": 1.0, "text": "I do NOT recommend!! This place does not treat their students fairly. They will dismiss a student based on hear say from another student and not give them a chance to tell their side of the story. Very unprofessional especially when said student is excelling and bringing clientele in. My family and I have cancelled all future appointments and will not be returning or referring anyone else.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "112371695513865605646", "name": "Karen Mueller", "time": 1628861934115, "rating": 5.0, "text": "Nice pedicure and manicure", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "116797262116144943528", "name": "Jannifer Matthews", "time": 1593214672060, "rating": 5.0, "text": "My experience with this salon was favorable and they used COVID-19  procedures in disinfecting and sterilizing their areas. I recieved a wash, trim and style.  I had my eyebrows waxed by a student.  She was excellent.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "104329291550309973790", "name": "Michelle Hastings", "time": 1557900134434, "rating": 4.0, "text": "My haircut turned out great!! They listened to what I wanted and the student asked for advice from the instructor when needed. I was very satisfied with my haircut. Although I took my daughter for a haircut also. They did ask if I wanted my daughter's hair cut by the same student as me or by another student in a chair next to me. I said another student as long as she would be by me. I should have chosen by the same student so I could have actually been more involved with my daughter's haircut because what I asked for was not done. Didn't even look like any of her hair was cut. The student actually tried to blow out her hair straight when she has natural very curly hair. I guess she has a little more learning to go in that area. Pricing is great. Was took to the chairs in less than five minutes. Saturday's at ten a.m. was a great time to have an appointment! Students and instructor could be a little more friendlier though. I have went here several time's even as a child and never had a bad experience. Great place. I just know to do separate time's for me and daughter next time.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "118129119755293307076", "name": "Kay Morton", "time": 1471072546945, "rating": 5.0, "text": "Kelsi Martin is awesome ! I would recommend her to anyone . She listened to what I was asking for, and took her time. My cut came out a bit shorter than I had originally wanted, but  love it. I received many compliments before even leaving by other stylist. You can bet I will be going back. The staff was friendly, had me back within 5 minutes of my appointment, and the place was super clean and modern. The price was more than fair, but the customer service was priceless.", "pics": null, "resp": {"time": 1495691038192, "text": "Thanks for the kind review and 5 star rating, Kay!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "103618561469448531571", "name": "F S", "time": 1502718739664, "rating": 1.0, "text": "Salon professional academy review.\n\nI purchased the $46 groupon voucher.\nI brought pictures which clearly showed the color and cut I wanted. My hair is 50/50 salt & pepper. I asked for an undercut pixie with the top to be lightened and toned silver. I said my original dark color (the pepper) was dark brown. Even though they toned it after bleaching, it was very brassy. I went back several times so they could tone and correct my color.  When I went back, they charged me more money. It is still brassy. I wish they had warned me that it would be difficult to get my hair to look like the picture I brought. I spent well over $100  including tip (I didn't think the student should suffer because the instructors weren't honest enough to warn me).\nThe student cut my hair somewhat similar to what I asked for, but the instructor corrected her and the cut now looks like a fade instead of an undercut. Nobody listened to me. I was clear about what I wanted. I do not easily speak up in the moment, but I am saying something now. Beware this beauty school. They are much more interested in getting their experience and training than whether the customer is treated fairly. And they had the nerve to charge me more for them to correct their mistake. When the correction did not work after 4 visits, they wanted me to come back again and charge me even MORE money. I said no, and that I may get a crew cut.\nI think the student should go to a better school.", "pics": null, "resp": {"time": 1503946693910, "text": "Fran, we understand your frustrations and we really appreciate you bringing this to our attention. We would like to look into the specifics that have contributed to your frustrations. Please contact management at (256) 602-4833, in regards to this experience. We look forward to hearing from you."}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "111992231081521183306", "name": "Desree H.", "time": 1491411597399, "rating": 5.0, "text": "Madison did my hair. I wish I knew her last name to give her the full credit she deserves. When I say she did a phenomenal job I absolutely mean it. It's like she read my mind. I wasn't well at describing what color I wanted done to my hair but she did a amazing job at taking the image right out of my hair. She's great. She knows what she's doing and you can tell she has a passion. I've recommended her to all my friends. The price was wonderful. Thank you very much! I've already scheduled my next session.", "pics": null, "resp": {"time": 1495690998399, "text": "Desree, that is so kind of you to share your experience with us! Thank you. We look forward to seeing you at your next appointment!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "103155928321129087415", "name": "Amelias Whimsey", "time": 1429800694380, "rating": 5.0, "text": "Couldn't get in with my regular stylist, and I was ready to go with a short bob for spring.  I gathered my courage and took the plunge.  My student hair dresser was very sweet (Katelyn) and whenever she had a question, there was an instructor standing by to help.  The haircut was a little shorter than I had originally wanted, but it turned out great.  For $6 + tip, this was a bargain!  I will definitely go back.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "117084782928073230579", "name": "Travel with Wendy", "time": 1573742475972, "rating": 5.0, "text": "Absolutely loved my haircut and the company too. Great place to visit and help the students too. What a deal $5 on Wednesday and Thursday for cuts, 😳 what??! For reals - excellent opportunity & nice students 👌👍#lovemydo", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7ZdODy-3PqxsTLzWnjvOrsHR8GCt4GArHAmt-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "102032899408243459620", "name": "Linda Ragland", "time": 1617219647289, "rating": 5.0, "text": "Sabrina is great!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "115325130450358833622", "name": "eva reed", "time": 1503715159629, "rating": 5.0, "text": "Brandy was great!  She is a true professional that is not afraid to try something different. I was a little skeptical when this young white girl (I'm black) came to me and said she would be my stylist for the day, and she did an excellent job. Brandy is not afraid to step out of her comfort zone; she is patient, professional and a pleasure to work with.", "pics": null, "resp": {"time": 1503946519925, "text": "That is so great to hear! We are glad that Brandy was able to give you the service you were looking for. Be sure to come back and see us in the future. Thanks for the review, Eva!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "108855082224055871416", "name": "Contessa Hudson", "time": 1541796389460, "rating": 1.0, "text": "I got the manicure and pedicure off Groupon. The staff was nice. The young lady did not have a clue. After filing one nail she was going to start painting my nails. I asked her to stop, I'll go somewhere else and get my nails done. My pedicure was sloppily done and they didn't dry my toenails. She sprayed them with quick dry and that's all. When checking out they asked if I would come back for my manicure? No! I will never come back. After wasting 2 hours I'm leaving to get my nails done by real professionals.", "pics": null, "resp": {"time": 1543348129959, "text": "Hi Contessa,\nWe appreciate your honest feedback. TSPA Huntsville is learning and teaching facility, so our students are still in training. However, we always strive 100% client satisfaction and we hate to hear that you didn't have a positive service experience with us. Please feel free to contact us at 256-602-4833 to resolve any remaining concerns."}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "100445605835676046625", "name": "Gloria H", "time": 1477949215679, "rating": 5.0, "text": "I went here for color and trim on my natural and partially grayed tresses.  I had the absolute best experience.  The young lady who provided my service was professional and personable and the color I got made my curls come to life.  I recommend this salon to all of my hotel guests because it is affordable and who doesn't love Redken products?", "pics": null, "resp": {"time": 1495691063374, "text": "Gloria, thanks for sharing this with us! We appreciate you!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "115529769152075913442", "name": "Eden Salyers", "time": 1532815732256, "rating": 1.0, "text": "for starters i would like to say that my student stylist was very nice. HOWEVER, she did not listen to my request and instead of coming out with caramel/soft brown highlights like i asked for (and even showed pictures of) i came out with bright blonde, unblended “highlights” on just the top layer of my hair, it looks so unnatural and cheap. i understand the stylists are students still and the costs are cheaper but i believe i could’ve went to the store and bought a dye kit and gave myself better highlights😒", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "107834696763715050827", "name": "Mike n Micki", "time": 1531168367584, "rating": 1.0, "text": "I have gone here 3 times to get my hair done. The first 2 times they did a good job on it . The last time they did it, they missed up on the haircolor I wanted. I was going for purple strikes in my hair n the color purple I wanted they didn't have at the school n the color came out where you couldn't hardly tell there was any in my hair . I went back the next day to tell them about it n they wanted to charge me to re-do it.  So I wouldn't recommend going here.", "pics": null, "resp": {"time": 1532103138024, "text": "Hi Mike n Micki,\n\nWe appreciate your feedback. We aim for 100% client satisfaction (although we understand that’s not always possible). If you’d like to reach out us directly to discuss the situation, please do. You can reach us at (256) 602-4833. Thank you for taking the time to leave us feedback and we hope you’ll give us a try again."}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "102989557933677703250", "name": "Tech Girl", "time": 1513893005792, "rating": 1.0, "text": "I got an appointment at2:15 pm for shampoo blowdry and thermal, I showed up on time. The student took 45 min to just wash my hair. She seemed to be very new and has no experience but I expected that. She then assigned me to another student who blow dried my hair and took me to the front desk. I said I came here for curling my hair with a thermal not to just blow dry it, she said I am running late for my next appointment and sorry because you had a phone call while I was towel drying your hair, we run out of time!! My call was an important 5 min call from my insurance company and while I was taking it she was drying my hair!! When I spoke to the manager she said that I had to go with what my student said and if you don't pay I will call the police!!!! That was the worst customer service I have ever had in my life and I will never go back there ever again!!!!", "pics": null, "resp": {"time": 1514357817292, "text": "We absolutely understand your frustrations and we appreciate you bringing your experience to our attention. We would like to discuss your visit personally and see what we can do to right this wrong. Please contact management in regards to this experience: (256) 602-4833. We hope you'll give us the chance to give you the 5-star experience you deserve."}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "105263581087404038008", "name": "Jean Whitt", "time": 1471043970356, "rating": 5.0, "text": "Thank you Jessica. Sneed!  Love the color, products you introduced me to, styling methods, and attention to details that highlighted my appearance and spirits!  You're an amazing young lady and stylist!  I'm going to enjoy watching you continue to excel!", "pics": null, "resp": {"time": 1495691015256, "text": "Thanks, Jean!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "101471803284092572154", "name": "Jeannie Petaway", "time": 1523744927980, "rating": 5.0, "text": "Extremely pleased with the professionalism and skills of the students.  A very good experience.  Thank you Taylor.👍", "pics": null, "resp": {"time": 1524588483050, "text": "Hi Jeannie! We are so happy to hear that you enjoyed your time with our students! We hope to see you again soon!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "101781293793846439689", "name": "Lemonade Johnson", "time": 1461843270270, "rating": 1.0, "text": "DO NOT GO TO THIS AWFUL SCHOOL!!!! I attended TSPA for several months. My classmates were amazing but the so called \"instructors\" are so dumb they couldn't pour water out of a boot if instructions were on the heel. They are childish, manipulative, only care about money and do NOT care about their students. They bad mouth the students to clients, other students, and each other shamelessly. I've seen kindergarteners behave better! I don't even believe they all actually have their license. The school got a state board rating of 75 when I was there. GROSS!!!!! 75! Stephanie is the owner and is overweight and rude to everyone she meets. Erica is the lead educator and is fake and will lie to your face with no hesitation. The building is falling apart and dangerous. They will also lock you out and make you sit in the cold on several occasions. They use old products on clients and rarely clean the bowls! I'm grossed out just thinking about it. Save your money and seek a cosmetology career elsewhere! Trust me!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "111546635266488938397", "name": "Kesha F. Snow", "time": 1570903995908, "rating": 1.0, "text": "This policies suck. So a toddler secured in a stroller cannot go beyond the front area...in the past I never had that problem here. They just lost my patronage.", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "107361113122004127056", "name": "courtney hanratta", "time": 1446128249451, "rating": 5.0, "text": "I love it I go to school here.. The atmosphere here the students and teachers are really nice and everyone gets a great experience but everyone gets there own special experience...", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "100200728056018872397", "name": "McKenzie Fox", "time": 1427919133042, "rating": 1.0, "text": "They have no common scense on the phone and they do not have ANY customer service. If you view their website, they lie about the prices that are on there. I called yesterday and asked the price and they quoted me something a lot higher then the website said (they also said it can cost more depending who they schedule you with!!!!!!!). I called today and they quoted me $30 more then the day before! Students are students. They need people to practice on and they do not deserve salon prices!! EXPECIALLY for a student that has been taking a class for who knows how long in a 1-2 year period! They do not need your business and I never went because of all the lies. IF you like a place that lies to you and you don't mind paying more because they just decide to up charge you... GO AT YOUR OWN RISK!!! I WOULD AVOID, I DO SUGGEST NO ONE GO!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "114097827088750551583", "name": "Amanda Stratton", "time": 1465153108663, "rating": 5.0, "text": "After 2 weeks of trying to get my sister an appt at Virginia College Salon and dealing with their unprofessionalism I finally called The Salon Professional Academy. Not only did they actually answer the phone, but were very professional and got us an appt for the next day. My sister went in with exactly what she wanted and it looks fabulous. The student didn't act like she knew it all and when she needed help she asked her instructor. Mrs. Hughes was amazing at walking her through the steps and checking behind her. Thank you Salon Professional Academy now my sister can go on vacation out of the country with hair she is happy with! Not only were they great at their work, but customer service is amazing! I am 5 months pregnant with a picc line and when my 7 year old needed to use the restroom the students allowed me to sit in their break room so I could be close by him waiting. At one point he was getting antsy and bored when another student got him up and was teaching him new dance moves. I highly recommend going to this salon and for those looking for a cosmetology school to definitely attend this one. Terrific atmosphere!!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "100660841163185041266", "name": "Kayla Erskine", "time": 1429131246765, "rating": 5.0, "text": "Got a pedicure by Anastasia Hatchett! It was great and very professional! Will be returning! Thanks!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "118196297954892187306", "name": "Mr/Mrs Robinson", "time": 1462472969004, "rating": 1.0, "text": "This is the worst place to attend school at and/or get your hair done. The educators are awful. They claim to be master cosmetologist's but are so dumb and uneducated. The only teacher who is honest, smart and knows more then them all is mrs.Brenda. mrs.Erica is lead educator and knows absolutely nothing and is a liar and fake as hell. I attended this school for several months and was treated like a child and was talked to like I was stupid. They claim to be professional but are far from it. They pick and choose favorites and talk about students and clients. Mrs.Stephanie is the owner  and is rude to students and clients. She is jealous if your skinny and pretty and will manipulate students to gossip and tell on each other and if you do so rewards you and if you don't she will do everything in her power to get rid of you. If you are late or miss a day for any reason even with a illness or excuse you will have in school suspension and/or suspension and you will be asked to do gross things when you have in house suspension like plunge a clogged toilet with piles of crap and blood in it. Mrs.Jenn the financial aid women is so fake and is dumb and will yell at you like she is your mother and will wait to give you your financial aid checks units she is ready. I've seen dozens of perms redone, color ruined, and hair chopped off withough permission. People's hair fried chemically and cut off because no one knows what they are doing. Like I said mrs.Brenda is the only one who knows what she is doing and is willing to help everyone when they need it and will help you stay in school. Also if you are expelled or quit the school will charge you anything unpaid tuition and will charge you for the rest of the school year you did not finish and will not give you your hours until all is paid. This is a rip off childish school. DO NOT ATTEND AS A STUDENT OR CLIENT YOU WILL REGRET IT FOREVER!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "100876780895628331896", "name": "Asha Farquharson", "time": 1466831471717, "rating": 1.0, "text": "I decided to buy a Groupon which was for 3 mani-pedis($45). I called the day before and asked how it worked the lady explained it beautifully, I asked if I could book and appointment she said yes, she had me for the next day at 1 which was perfect. I showed up the lady never booked me! It was  supposed to be a surprise spa day for my grandmas 89th birthday. It took a alot of begging a pleading, and bengay rubbed on to get her to go and after all that the lady LIED and did not do her job! I'd personally like to thank you'll for  making an old ladys birthday suck and making me waste my time and money I don't even want to go back and use the groupon, what awful and unprofessional customer service! Please don't waste your time or money!", "pics": null, "resp": {"time": 1519163109287, "text": "Thank you very much for the candid review of your recent visit with us. Your feedback is extremely valuable to us, as we strive to improve with each and every customer. We appreciate your comments about what aspects of your visit made it unpleasant and we want to be sure that we are addressing your concerns. If you feel that we need to provide further resolution to these issues, we hope that you will reach out to us directly by contacting Stephanie at 256-602-4833. We hope to welcome you back to our salon soon!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "117900726497980972500", "name": "Madison Pet Care", "time": 1490008371178, "rating": 2.0, "text": "Amateur experience. Girl didnt scrub my head while washing hair- color treatment I was there 3 hrs for could barely be seen- layers were cut way too bluntly- even my husband noticed the blunt, non-blended cuts.. wont be back. I even mentioned these things to hairstylist and manager but it wasnt fixed.", "pics": null, "resp": {"time": 1495690926124, "text": "We really appreciate the feedback on your experience. We would like to look into the specifics that have contributed to your frustrations. Please call our guest services, at (256) 602-4833, in regards to this experience. We look forward to hearing from you!"}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "116983761577223368994", "name": "complicatedxyz", "time": 1544988957600, "rating": 5.0, "text": "Amazing students with lots of potential!", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "115679865244843628059", "name": "Samdhn", "time": 1515727483772, "rating": 1.0, "text": "Very bad service. The front desk person, Rachel, was unfriendly and unwelcoming. Obviously, they don't teach customer service here. Rachel should get fired!", "pics": null, "resp": {"time": 1516741577450, "text": "We absolutely understand your frustrations and we appreciate you bringing your experience to our attention. We would like to discuss your visit personally and see what we can do to right this wrong. Please contact management in regards to this experience: (256) 602-4833. We hope you'll give us the chance to give you the 5-star experience you deserve."}, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "107149484036781665790", "name": "Bobbie Higginbotham", "time": 1430589953046, "rating": 5.0, "text": "Good job! Alyssa", "pics": null, "resp": null, "gmap_id": "0x88626cb80ede668d:0x353c8b24aa2ecc61"}
{"user_id": "114712778326107866835", "name": "Doris Martin", "time": 1626791239011, "rating": 4.0, "text": "Friendly staff, They did a great job on my hair. I will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "117608213507406867977", "name": "cecelia reed", "time": 1612811083690, "rating": 5.0, "text": "Amazing! Kaleigh gave me a trim today and did a perfect job. You would never know these are student. Professional and polite. Will be back weekly :)", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "103026127127106799956", "name": "Marquitta Williams", "time": 1619705742713, "rating": 5.0, "text": "Love Getting My Hair Done At Charles Academy .Very Profession", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "109282883482917132171", "name": "Melissa Sistrunk", "time": 1612265371258, "rating": 5.0, "text": "I went there yesterday and a student Haley did my hair she did a wonderful job took her time friendly and Sam the cashier was friendly as well and very helpful in every situation it seem thanks guys great job", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "117600489922326240304", "name": "Elicia Jaxon", "time": 1623277674948, "rating": 5.0, "text": "ALWAY A PLEASANT EXPERIENCE", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPnlhZtwH8O4J6MiDV3umsjQs7kaQkpCXEK0H-J=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "107942771948463857864", "name": "Becky Pyron", "time": 1575233577846, "rating": 5.0, "text": "I love their prices and I’ve never gotten a bad cut. If you don’t want them to cut too much off the length you do have to let them know not to pull the hair up and cut from the length underneath. The hair closest to the nap of your neck is shorter than what you see in a mirror - at least mine is.", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "102421574071834578648", "name": "Christy Lynn", "time": 1553901956947, "rating": 5.0, "text": "Kyle Pipkin is awesome!! He did an amazing job on my hair and I didn’t get your basic cut he cut about 6 inches off and layered it.. he took his time and super friendly!! I’ve gotten so many compliments and I highly recommend everybody go see Kyle!! Thanks hun!!", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "107039351930553029507", "name": "Charybdis ¿?", "time": 1519464164959, "rating": 5.0, "text": "My friend goes here and it's superb compared to Remington.. it's a dream school, at least you learn to actually cut hair and the basics were you don't at any other school.", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "107363512564402813106", "name": "Stephen Morgan", "time": 1367040739101, "rating": 5.0, "text": "Amazing hair school!! I loved it and learned alot! :)", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "116998609649380678198", "name": "Tina Windham", "time": 1480094155579, "rating": 5.0, "text": "Miss jordan gave me a fabulous haircut", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "102536373758500991267", "name": "Linda Campbell", "time": 1552663474115, "rating": 5.0, "text": "It's cheaper than most shops that does 💇", "pics": null, "resp": null, "gmap_id": "0x889a4dbe72809341:0xdd4e4ed43070f6a1"}
{"user_id": "100538372013296537178", "name": "Chichi Jumbo", "time": 1620720802462, "rating": 5.0, "text": "I spoke to a recruiter, Ms. Cindi, and she was very knowledgeable and very professional! I am pleased with my experience!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105814282487493392664", "name": "Jessica Smith", "time": 1621453029498, "rating": 1.0, "text": "I do not recommend if you’re looking for professionalism and communication. While the front desk attendant was apologetic, I still will not recommend nor return.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "100444810413229978839", "name": "JD McGuire", "time": 1612383800871, "rating": 5.0, "text": "They always do good here , the instructors are right there to help and are very prompt ... I've never left unsatisfied", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113211314461321448217", "name": "Rachel Salters", "time": 1581951753632, "rating": 5.0, "text": "While I’m not a student there yet I am hoping to be in the fall. Everyone I walk through the doors it just feels like home and the staff and student are so nice. I got my hair cut there one time and while it did take a little longer I was so happy with my results. What people need to understand is that they are student and they are trying their best, and as for comments made on Ms. Susan I think she is a lovely person, very sweet and very helpful. There was always a teacher walking around checking and I just can’t wait to be a part of the Paul Mitchell family.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117876733124028924898", "name": "samantha jones", "time": 1598685433873, "rating": 1.0, "text": "I communicated to the student EXACTLY what i wanted. I wanted an overall color change and had multiple pictures as examples. She gave me a halo highlight that barely even made a difference in my color and charged me full price. They do not listen to the client and often times listen to the head instructor even though it wasnt what i had even asked for. Very disappointed", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114398454353791038194", "name": "Elizabeth Stclare", "time": 1599335700533, "rating": 5.0, "text": "Chelsea is amazing and certainly reflects the professionalism of the Paul Mitchell experience. So glad that I have had the opportunity to return especially in these restrictive pandemic times.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108444523293906862154", "name": "Dena", "time": 1559362212869, "rating": 5.0, "text": "I always enjoy every experience I have had at Paul Mitchell! They are very professional and seem to stay on top of students. I wish I had time to go there more often. My last visit was great. I was trying something new with my hair color and wished I would of had time to go back during the grace period to have them go up higher with my color. Other than that everything was great. Do not go in when you are in a hurry. It is a school and they are learning so have to have patience. Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105821179550072432969", "name": "Lindsay Bogle Waits", "time": 1566242768556, "rating": 1.0, "text": "I have been a faithful customer for 6 years, and I have been satisfied with my hair cut and highlight services. Unfortunately the past few times I have had highlights done, the learning leaders have not led the students well. Recently the student was unfamiliar with highlighting and caused the lightener to “bleed” causing an intense and distinctly different contrast to show up on the root and parted portion of hair. They tried to fix the problem by toning this portion. By toning the hair I no longer had highlights in this portion leaving the hair a reddish dark color on the root in contrast to the blond. They offered to provide additional highlights on another visit but I would still have to pay for the lightener. I was told $13. The next time I came within 7 days to have the lightener done to fix the toned area without highlights. It became apparent the learning leaders only add a small amount of lightener to each extra bowl needed to lighten so they can up charge $13 per bowl. I have noticed this in the past. This time I was charged for 3 bowls. The instructor said these extra bowls were not necessary, however the instructor allowed the student to use this amount. In addition to the bleeding mistake that occurred the previous time without proper supervision, I was disappointed by the poor customer service given by the instructors and poor business strategy taken by charging the customer for a mistake that was done under the lack of care by the learning leader. I have recommended this school in the past, but I will no longer do so. I am disappointed in the lack of desire to serve the customer well and the lack of instruction done by the instructors.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108759375707267287811", "name": "Ashley Linden", "time": 1556374310771, "rating": 5.0, "text": "I am so pleased with my first experience of Paul Mitchell. My stylist was Shelby, and she did a great job of listening to what I asked for. I was very pleased with how her instructor payed attention to her work and helped where needed and did an excellent job. I wish I had gotten her name.\n\nI brought pictures and was very specific about wanting layers and they talked out ideas and were willing to give advice and do whatever I wanted. I never felt rushed (even though my hair was super long and it took an hour and a half) or like I was inconveniencing anyone even when I asked them to go back and put some more layers in.\nOther salons had argued with me about layers in the past and seemed afraid to cut my long hair and I have left disappointed, but not here! Thank you all for a fun and relaxed environment with great prices too!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "107307022358111419352", "name": "S s", "time": 1518128450002, "rating": 4.0, "text": "Went for a haircut recently and had a very good experience. Robert (instructor) did my haircut and he is an excellent teacher. I was here couple of times in past too and never had any bad experience with students. Instructors are always taking care of each client. Thank you Paul Mitchel instructors for all the effort you guys put in to teaching the art to the students. It’s very important to know what you want to get done and explain it to your stylist. Cost is unbeatable. It’s gonna be a while for them to work on you, they are learning on you so help them. Show pictures so they can get a better understanding of what you want.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "104707794931909493545", "name": "Amy Floyd", "time": 1566652703441, "rating": 3.0, "text": "This was my first time, and it was an okay experience. It took a long time for a wash & cut (75 minutes), but that is to be expected as it is a teaching school. I ended up fixing my own hair once I got home because there were lots of uneven places. If you are broke & can't afford to go somewhere else, this is a good choice. You just may have to repair your hair a bit on your own afterwards.", "pics": null, "resp": {"time": 1566922091727, "text": "Hey there Amy! We appreciate your honest feedback and you're absolutely right-we are a school! Our students are all at different levels of skill based on several factors including, but not limited to, length of time they have been in the program and the specific areas in which they excel. You may not have known this, but we have a 100% guarantee and you can always let us address any issues you might have had with your service. Students work on guests because they need the hands-on experience which is part of their curriculum. Students aren't ready for the salon until they have completed their program, hours, and have taken both their written and state board exams. They are then ready to transition to an actual salon. We also have students who are in a program here we call Phase 2. These students must pass an interview and hands-on assessment in makeup, cutting, color and texture. These \"master level\" students are available upon request and you'll be getting a more advanced, driven student that is much further along in their program. However, these services do cost a bit more. All that being said, we have to remember that we are a school, first and foremost. We love being able to offer extremely low (much lower than an actual salon) prices for our guests because our students need the hands-on experience. We can all remember the first time we tried to accomplish something...sometimes it was great, but sometimes we also had a lot to learn from the experience. But with practice and patience, we got so much better than when we started and that's exactly how it is for our students. We hate that you weren't happy with your hair, but we do appreciate the time you gave our student in letting them perfect their craft."}, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "115777177110036560389", "name": "Alyssa ellis", "time": 1576167595111, "rating": 5.0, "text": "As a student, I’d like to personally say, in regards to all of our learning leaders they help us to the best of their ability and in regards to them caring, they care way more than most normal teachers or instructors and ALWAYS try to make sure the guest is happy, although sometimes it can be confusing on what is trying to be communicated - Our learning leaders are the best there are is assisting us in our journey.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108087962060040193445", "name": "jessalyn jones", "time": 1573316499326, "rating": 1.0, "text": "TERRIBLE SCHOOL!!!!!! No one helps the students out. They have to many people on the floor at once it looks crazy. I went in for a cut and it took 2 and a half hours.. because “Susan” wouldn’t help the student. If I could give a zero star I would. AWFUL!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108353301106134136806", "name": "Kaitlyn Marlowe", "time": 1562684596730, "rating": 2.0, "text": "The first time I went my experience exceeded expectations.\n\nI have been twice more it service has been terrible.\n\n(1) I was told 2 hours and approximately $40 for a basic cut and color. SIX hours later I was still there and the bill was $110 because the student colored my hair in a way we had not discussed during the consultation.\n\n(2) I had to bring my child with me to an appointment and was refused service.  Which is fine.  Inconvenient, but fine.  However, the attitude behind the refusal was quite rude.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114838474625145004535", "name": "DaShanee' Miles", "time": 1558046376252, "rating": 5.0, "text": "Absolutely love this place! The people there make you feel like family. Raven did an excellent job flat ironing my natural hair.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108597386791813559492", "name": "Ashley T.", "time": 1508543179846, "rating": 5.0, "text": "Went in with a perm in mind but they were really honest with me and said they couldn't due to the dyes in my hair but instead said they'd teach me how to curl my hair the way in I had in my reference pics if I wanted which was really sweet of them. I instead went for a hair cut which was great for the price and the job my stylist did was wonderful. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105614015425466242142", "name": "Diane Harris", "time": 1509710497808, "rating": 5.0, "text": "I had been using the location in Madison, AL for several years, then moved back to the Montgomery area last year.  Birmingham is the closest location to me, so I tried a local cosmetology school.  They do not measure up to Paul Mitchell.  I decided to make the drive to Birmingham and was certainly not disappointed.\n\nI received the service I  have come to expect from Paul Mitchell schools.  I was asked questions to determine my wants and needs and an instructor was checking in throughout to assure the work was being done to my satisfaction.  I have my next appointment scheduled and am bringing a couple of friends, as well.", "pics": null, "resp": {"time": 1512148847976, "text": "Ms. Harris we are so pleased to hear about your wonderful experience here and can’t wait to see you again for your next service!"}, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "101257100058994392771", "name": "Alyse Gilliam", "time": 1462323732682, "rating": 5.0, "text": "Had a great time here! We went in to get my hair, makeup and manicure done for junior prom. Everyone was super friendly and easy to talk to. Even though I got there a few minutes late we had no wait time at all. Taylor was so sweet and helpful, talked to me about exactly what I wanted done and just made the whole thing stress free. I went with a black manicure, curly side updo and soft makeup with a red lip. Everything turned out perfect and stayed from my morning appointment to after prom! I am definitely going back and would advise anyone who has a special occasion coming up or just wants to treat themselves to check The School out! It is also very very reasonably priced :)", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117104456659928630453", "name": "Kim Nguyen", "time": 1394302261185, "rating": 5.0, "text": "Had a great first-time experience at Paul Mitchell The School Birmingham.   Hannah gave me a cut & style and fixed my poor attempt at a trim from a few days ago (I had completely butchered my bangs). Everyone here is very friendly and welcoming. I love my hair and my bangs now and will definitely be coming back!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112778539623533206690", "name": "Julie Hughes", "time": 1516940677237, "rating": 5.0, "text": "My daughter, Katie, graduated from Paul Mitchell today. Thanks to the staff for their guidance and expertise.  The instructors, staff and owners taught her, not only how to be a hairstylist, but the business aspect of the profession. Now she has the foundation she needs to go out into the world. Without a doubt, she will be successful! Thank you!", "pics": null, "resp": {"time": 1516982639644, "text": "Julie thank you so much for the kind words! It was so wonderful having Katie enrolled at our school. She is such a kind and creative individual and we’re truly going to miss her. We wish her all the best in this next chapter of her life!"}, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105604194289316681829", "name": "Tamara Morton", "time": 1473315199595, "rating": 4.0, "text": "The receptionist and my beauty specialist were very professional. My pedicurist tried her very best to do a good job and she did. I was very pleased with the outcome. What a treat! Regarding your website, I would like to be able to see prices for all the services that you provide. I'd probably end up spending money on more procedures if I could see what options were available. Anyways, I just discovered you, I've had two excellent experiences and I'm very happy to be a new client. I'll certainly spread the word to my friends.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112035044459577097959", "name": "Jennifer R James", "time": 1544130391145, "rating": 5.0, "text": "Great place if you’re willing to help others learn/allow them to practice on you. Love the staff & the students. I always leave happy.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "102670739175007328707", "name": "Monika Camino", "time": 1573316622058, "rating": 1.0, "text": "Students do not seem to know what they are doing. And they seem to not have a lot of help. The student sat and waited for a teacher to come by and help for over 15 minutes while I sat there and watched the black teacher mess around with the black students. So unfair... need better staff!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "116976099037901499967", "name": "Nikita Monroe", "time": 1573316759813, "rating": 1.0, "text": "I will never go back! Teachers are so rude. Small white lady with blonde hair made me feel so unwelcomed and treated the student as if she was dumb for not knowing what to do. Not yet fault this school doesn’t teach the students.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "111075365760350422444", "name": "Nancy Ledbetter", "time": 1539902130995, "rating": 4.0, "text": "Love going there! My sister's and I meet there once a month for girls day. The students are always eager to please and the instructors are very helpful and ready to jump in if necessary.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110575577554318040963", "name": "Anna-Marie Settine", "time": 1467302201174, "rating": 5.0, "text": "I love to come here to get my haircut. They always do a great job, and all of the products make my hair feel and smell amazing. The students and leaders are all very nice, professional, and talented. They listen to exactly what you want and make sure you leave with beautiful hair!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108319471911876572984", "name": "Cathy Forrest", "time": 1395957255834, "rating": 5.0, "text": "Loved my haircut today.  People are so nice. The owner came over and helped, very great teacher.  I highly recommend that you try it out!!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "106222392397795432081", "name": "Holly Parker", "time": 1519191002125, "rating": 1.0, "text": "I have been in the past and had good experiences but sadly I can no longer say that. I went a few weeks ago and they seemed really rushed and not as personal as in the past. The instructor didn’t check my hair when I was completely done. After about a week I noticed that my hair was uneven and a huge chunk was shorter. I called to see if they could fix it and was told it had to be within 7 days and I would have to pay for a new cut. I was unable to go in any sooner because it snowed and then I had to work the weekend at my job.  I would gladly have given them a chance to fix it but they haven’t taken any action towards making it right. I am saddened by the fact that they messed my hair up and won’t fix it for the integrity of their establishment. I left a message for the manager and have not gotten a response back. This happened about a month ago. In my book, that’s a sign of being unprofessional. I will not be going back here.I hope they can fix this and do better in the future!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "102031736186000667974", "name": "shawn swartz", "time": 1467902483396, "rating": 5.0, "text": "I love coming here. They give such individual attention, more than I've ever received in a private salon. My hair is extremely thick and quirky and they spend the time asking questions and learning my hair before ever starting. The instructors remember me and my hair every time I come in. I won't go anywhere else to get my hair done.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "105022316516545949870", "name": "Brenna Terry", "time": 1468013419037, "rating": 5.0, "text": "Professional and fun! I have gone in and asked for a variety of edgy, complicated styles- bob, pixies-  and have yet to be disappointed. Even if the student is still learning the ropes, the stylist who oversees them will make sure that they give you a great 'do. Sometimes you may have to wait a bit for the head stylist to approve, offer advice, etc. but the wait is worth it in the end. Please support PM and help these up-and-coming stylists start their careers!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "115167172826745693283", "name": "Tamara Caffee vlogs", "time": 1559161977861, "rating": 5.0, "text": "I got my hair dyed here amd i cant get over how good it looks i did natural colors and it looks great i recommend this place", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110067753492235791576", "name": "Stephanie Pilgrim Moore", "time": 1407347368868, "rating": 4.0, "text": "Very friendly and professional, the only downside was that it took about an an hour and forty five minutes for a shampoo cut and blow dry (which normally took less than an hour at other salons).  However, I was happy with the service and the results.  Have already booked my next appointment.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108334357632767568381", "name": "brenda Weaver", "time": 1464712772697, "rating": 5.0, "text": "Tori R.  Dyed my hair and it turned out fabulous!   Not only did I get great results,  but expertise customer service!   Everyone was there to help her with the foiling of my hair, which took a long time.  But she did an excellent job and I am so pleased with the results.  I will recommend Paul Mitchell Academy to everyone I know.  Thank you so much Tori!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117193440036274103448", "name": "Megan Richey", "time": 1384886245466, "rating": 5.0, "text": "Salon experience for a great price! Their color is amazing and I always get a great cut. Actually, I have had better cuts by the students here than stylists at most expensive salons. Give it a try.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "117643753203189137006", "name": "Patsy Blakley", "time": 1471864380633, "rating": 5.0, "text": "I lost my hairdresser, he retired so I decided to try the school. I was really impressed and pleased with my experience. I got my hair cut and it was great and I liked the products they used on my hair. It made it soft and took care of the frizz. I will go back.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "100509606983275854498", "name": "Wynter Rudolph", "time": 1466454084592, "rating": 5.0, "text": "I had a wonderful experience at Paul Mitchell.  The hairstylist were very friendly to me and I just love how my hair looks now. Robin Rudolph did an amazing job on my Eyebrow wax.  I love it!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113914686607513187762", "name": "Bonnie Ferguson", "time": 1505152448528, "rating": 1.0, "text": "Adding this to my list of the WORST customer service in Birmingham. I didn't even get to step in the door because they CLOSED the school without letting anyone know! I drove all the way there in the RAIN for nothing! You need to let your customers know if their appointments are canceled! SO SO SO UNPROFESSIONAL. I don't even want to make another appointment if this is how they treat their customers. I wish I could give zero stars.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112072665809189707237", "name": "Astoria Riggans", "time": 1609591842892, "rating": 5.0, "text": "Love it here", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "111823150342230088946", "name": "Azziza S", "time": 1508823338202, "rating": 1.0, "text": "My daughter, my mother and I all got great cuts. I've never had a color but I've decided to do it.\n\nSadly the student who had great talent graduated. The last time I went the student destroyed my hair, gave me scalp burns from a too strong bleach solution, and turned my blonde hair GREY.\n\nThen the instructor absolutely refused to fix it. They were extremely rude and unprofessional. I will not be going back. Use the Aveda salon and school instead.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "109685844409335155672", "name": "C Gilbert", "time": 1518633233375, "rating": 5.0, "text": "Teairh is awesome. Done great with my hair and will go back to see her!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113154574367387051629", "name": "Carole Tull", "time": 1385090616033, "rating": 5.0, "text": "I have been coming to the Paul MItchell School Birmingham for about five years, and I have never had a bad experience.  I love watching the new students become professionals, and I usually follow one student until he or she graduates.  I have made many friends, and I still hear from some of the people who did my cuts and color throughout the years.  Keep up the good work, Paul Mitchell students.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "112401603626507881253", "name": "Allison Kerner", "time": 1466448318361, "rating": 5.0, "text": "I am very pleased with the hair trim I received!\nHaley P. did it!  I will be back in a few months for another trim.  And thanks for allowing my hair to stay long...", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110348508991888168854", "name": "Kat Henderson", "time": 1495776454457, "rating": 3.0, "text": "I've gone three times now. They are very professional and definitely get the job done, I'm just disappointed in the time expectation. It took two hours my first time for hair bleach- I was going to get a cut but passed as I was on lunch and had spent too much time. They're not open Saturdays. 2nd time was cut bleach and toner, which was fine. Third time took almost 4 hours from the time I got there to the time they checked me out just to do root colour + toner. They put two hours on my chart. I'm not sure why the time it took doubled.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113811335308211893182", "name": "Nameless Faceless", "time": 1456279691637, "rating": 5.0, "text": "Loved my highlights! Great prices and knowledgeable staff! Very professional.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114922692982462990640", "name": "Khrystal Fairchilds", "time": 1552094939532, "rating": 4.0, "text": "I got my hair done there & love it.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "103674410149119465412", "name": "Katharine Blackwell", "time": 1556048041177, "rating": 5.0, "text": "I routinely get my hair cut at the Paul Mitchell School in Birmingham. They always do a great job, and I feel like I'm treated like a VIP client!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "110847020637767166529", "name": "Catherine Glenn", "time": 1438118684914, "rating": 5.0, "text": "I have always had an awesome experience here!  The stylists do a great job, and the price is right!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113690816469373003782", "name": "Shannen Wright", "time": 1466715820607, "rating": 5.0, "text": "Been coming here 4-5 years had good experience and have seen many different girls only had one bad hair cut. But over all satisfied.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "104033560432844215694", "name": "Taylor Lee", "time": 1573316361150, "rating": 1.0, "text": "Worst service ever. Teachers are terrible. A student had no help she waited around for 15 minutes trying to get a teacher to help her. They need changes.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "114393586510000084106", "name": "Mary Linda Smith", "time": 1462493710036, "rating": 5.0, "text": "Absolutely wonderful!!!\nGreat experience!!!   I've already made my next appointment!!!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "118350310806644683092", "name": "Kylie Heitman", "time": 1557006646143, "rating": 5.0, "text": "Really great experience!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "113268007299390813181", "name": "K K", "time": 1578052636142, "rating": 5.0, "text": "Proud graduate of 2015!!!", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "108745522831049454766", "name": "Rece Stewart", "time": 1466175802371, "rating": 5.0, "text": "Love my haircut.", "pics": null, "resp": null, "gmap_id": "0x8889220e6dada637:0x717f01db2564dcc5"}
{"user_id": "106660164305676571223", "name": "Valencia E. Beamon", "time": 1534249479562, "rating": 5.0, "text": "From start to finish, the staff has been nothing short of amazing. My career path towards cosmetology started 2016, my instructors were the greatest at what they do, even when it came to motivation and encouragement after graduation. You go there, it feels like home, you’re always welcomed with opened arms and smiles. I can’t remember a bad day at Genesis, they are the ABSOLUTE BEST..!!", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "101934462852885018586", "name": "becky kinder", "time": 1376926660384, "rating": 5.0, "text": "Dawn was so good.   Just finished chemo several weeks ago, she gave me the cutest haircut and color.... made me feel like a million bucks....    What a wonderful time I had!!!!  Great staff... So much energy and enthusiasm.", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "116212823616886800903", "name": "Elizabeth Lemieux", "time": 1534188003307, "rating": 5.0, "text": "My life was spiraling out of control when I enrolled as a student at Genesis Career College (Daphne Campus).   As a 38 year old, soon to be divorcée, I wanted and needed a fresh start for myself.  I needed to be an example for my children.\nI delayed my start time for 6 months, and on August 17, 2010, I nervously walked through the front doors.   I didn’t start out as a standout student, heck, I didn’t even think I had the talent to do hair (I still can’t do a beehive), but I had the passion.\nThe teachers at GCC pushed each student to learn, to not run from a service, that sanitation is just as much a part of this career as cutting hair.\nI excelled at Genesis.  I pushed myself to be better than the day before, my efforts were recognized....and celebrated.\nGenesis Career College changed my life.   I am 4 days away from celebrating the day I started school (August 17, 2010) and the day I clocked out for the last time as a student (August 17, 2011).\nGenesis Career College and the faculty there will give you ALL of the tools you need to be a successful stylist, colorist, or barber....YOU just need to show up and be the success you want to be!!!", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "107304847809417173028", "name": "JordanStephen Margavio", "time": 1549605722202, "rating": 1.0, "text": "Let me tell you the never ending tale that is Genesis College.  So, to start, let me explain to you that you do not need to spend this much money on hair school. You don't.  The competitors will ALL help you pass the board, which is the ONLY thing they can promise to do. BUT that is not what this review is about. I made the decision to go to hair school almost a decade ago. I went to Genesis in Daphne, and they said they could tap into my student loans, and I wouldn't have to put anything down.  Sounded amazing to me!  So, I'd say about halfway through, I withdrew, and honestly I can say not because of anything the school did.  I needed a closer location to work it out with a full time job. SO, I withdrew and went somewhere else out of pocket.  I eventually started paying on my student loans and all was grand.  More time went by, and I decided to take a 9 to 5 job with a larger salary.  Then I decided I probably needed a degree to get to the next level.  Well, because I've still got a bit left on my student loans, the university I want to go to needs a copy of all the Genesis Career College transcripts.  Not that anyone can use an \"A\" in \"hair braiding\", but they still need the transcripts. Ok, fine. SO, I spend the better part of 2 weeks trying to get someone on the phone.  I find out pretty quickly in that 2 weeks that Genesis in Daphne closed, and the Mobile location's phone is ALWAYS busy or taken off the hook. At this point, I'd have to say the latter.  I call other locations.  They transfer me to the Mobile location, it's busy.  I finally get smart and start blasting them with phony requests for them to call me because I'm interested in enrolling.  BINGO!  A phone call happens in less than 5 minutes.  I tell the girl that I need to get a copy of my transcripts, and from the daphne location.  She doesn't know how to do that, but \"someone will call me\".  Ok, that never happened. I call back, and email.  Finally, someone does email me. He says that he will send a certified copy and to send the address.  Great. I go online and keep checking and checking, and they haven't received it.  I call up to the Registrar's office.  They explain that it may have been discarded because I'm not actually going to be using those credits.  SO, I email the guy back again.  Again, nothing gets received or updated at the college.  I email the guy again, and again he reassures me that it has been sent, but he'll send it again. This has been going on since OCTOBER. October. So, I call around today, and get someone in Lebanon, TN.  He tells me that he had to get the director to look me up, he has no idea what can be done, what I can do, oh, and that I owe a 3k balance.  NOPE.  Oh, because on top of owing student loans, you still owe the school once you leave, but I was actually able to pay off the school in 2015, finally. He says that he's showing I owe a balance to the school, so I won't be getting transcripts anyway.  So, tonight I spent 4 hours trolling through the last 5 years of my bank statements to prove I paid them in 2015.  All because they aren't organized enough as an organization to provide SEALED records to another institution a previous student is trying to attend. Think about that.  They cannot, as an organization, bring up your records of attendance, classes taken, grades, and put it in an envelope and lick a stamp.  Chris from Lebanon says that this happens ALL the TIME.  My reply was, \"Then it is a systematic issue your organization needs to fix.\"  Basically, the choice to go to Genesis Career College was a blunder of a decision that I still pay for to this day, almost a decade later, in ways I did not ever consider.  So when you're in that sales office planning your financial aid, and thinking about your options, please, consider your exit.  I did not and I regret that I did not fully understand the consequences of using financial aid to go to school for what ended up being a hobby.", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "105171489641435343467", "name": "chance roberts", "time": 1476116382360, "rating": 1.0, "text": "The level of unprofessionalism at the school is ridiculous. I highly suggest going somewhere else for cosmetology. When I went to transfer they refused to give me my transcripts, so I had to restart at another location.", "pics": null, "resp": null, "gmap_id": "0x889a43d16120a55d:0x5f5203343575ff5"}
{"user_id": "114788092090548606513", "name": "Caylar Wilson", "time": 1616784431094, "rating": 5.0, "text": "Love the energy in this salon! They do amazing work.with ALL hair types. Definitely would trust any of the stylists here with my hair", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "114883549729041362891", "name": "Tasheba Ramesra", "time": 1622301256410, "rating": 5.0, "text": "Love it Daisy was awesome", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPr1KTqDy-VCxahfu3BmseUrFwQHdR6ueL3N3LT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "110230002038362439113", "name": "A. Hollis", "time": 1622053437134, "rating": 5.0, "text": "Nice atmosphere, very professional environment. See Daisy for all your natural hair needs.", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "116396528417176987197", "name": "Dawncember Willis", "time": 1621724125227, "rating": 5.0, "text": "I love my salon.", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "114565589442627840810", "name": "Jessica Thomas", "time": 1607797701883, "rating": 5.0, "text": "Lisa did an excellent job with my color and cut!! I'm in love with my hair!!", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "103908641655452280304", "name": "Teresa Cosby", "time": 1607026432192, "rating": 5.0, "text": "The entire staff is attentive and so friendly. Traci is my beautician for life!!", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "104379955528383582663", "name": "Casey Greene", "time": 1624741994597, "rating": 5.0, "text": "Awesome experience!", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "114468756746714175718", "name": "Jocelyn Jimerson", "time": 1594336423578, "rating": 1.0, "text": "Kasey did the Worst sew-in I Have EVER seen I would not have thought it was even possible to do this BAD She did my hair on a Friday and the Next Wednesday I was able to remove the entire hot mess of a sew- in with my hands as the threads started falling from my head that Sunday😡😡😡 Contacted the Salon and her and other staff we're very unprofessional about it! I.WOULD NOT RECOMMEND THIS PLACE TO ANYONE.", "pics": null, "resp": {"time": 1594404517202, "text": "Ms. Jimerson did indeed come in and get a sew in and her extensions were cut and styled as well.She paid a total of $100, a $35 discount for being a new client. When Ms.Jemison left she was satisfied with her service and even allowed after photos. When she called SLB to discuss the issues that she was experiencing , she was told that Kasey would love to take a look at whatever the problem was.In any instance of dissatisfaction we always invite the guest back in as we did in this case. She agreed to return but when she arrived she informed the stylist that she had changed her mind and wanted a refund instead.\n\nThe stylist let Ms.Jimerson know that she was not authorized to issue refunds, which she is not, and would escalate this matter to the manager or owner to resolve it further.\n\nMs. Jimerson refused any further mediation and left disgruntled. She filed a complaint with the Better Business Bureau which we are now disputing. At this point, due to her  attempts to discredit our Salon and the unprofessional manner in which she has behaved, we no longer wish to do business with Ms.Jemerson and will not be issuing a refund or a salon credit."}, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "103927057491289653139", "name": "Jere Allison", "time": 1541865569687, "rating": 5.0, "text": "This salon is amazing. The staff are very friendly and SKILLED! My hair loves Salon Lisa Brown! I highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "100605986300309093664", "name": "Shirley Cox-Glenn", "time": 1476296442044, "rating": 5.0, "text": "I went  to  Salon Lisa Brown about 2 weeks ago.  The staff was very nice and Jamal did my hair with rods.  I love it .  Two weeks later it is still holding.  I love my hair  and he take you at your appointed time. No waiting. Thanks Jamal I will be going back soon.", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "115209968747709971178", "name": "Vanessa Cornelison", "time": 1538778432286, "rating": 5.0, "text": "I was a little anxious about doing a Keratin treatment for my natural hair since I couldn't find a good reference from anyone. I called salon after salon and just didn't feel comfortable paying $400+  to do the treatment just because of my coarser texture. I called Salon Lisa Brown and found not only a reasonable price but an AWESOME stylist (props to Jamal) to tame my mane. He let me know right off the bat that it was formaldehyde free, how things were going to go down and what to expect for aftercare. I was FLOORED once he finished the treatment. I looked like a totally different person and he laid my hair from root to ends, straighter than I've EVER had it!  I will be going back in two weeks to have it properly washed to keep it maintained. Here's my recommendation if you want to take the leap like I did and it come out a success! ( If you're in a salon for \"atmosphere\" instead of your hair, it's a cool little place ;) but not the Taj Mahal.)", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "115405917257683176689", "name": "Linda Poindexter", "time": 1466821171805, "rating": 5.0, "text": "I absolutely love Salon Lisa Brown services! My hair has grown tremendously and every staff member does a fantastic job! I recommend them to everyone I know, 5 stars!!!", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "118424063709109469349", "name": "Sabrina Ellington", "time": 1533242731541, "rating": 2.0, "text": "Excellent service, not so excellent quality of work. Was mislead into thinking a certain hairstyle could be achieved, and later after starting perming etc, it went to something totally different. It was asked if I was ok with my hair being cut, I agreed because this was the plan I came in with. It went from that to the still couldn’t be achieved because of the density of my hair. Once this was stated, I decided to tell Ms. Lisa, I don’t think we should waste anymore time, and just end it here. It went from that to No, it’s going to be cute. Long story short, I hated my hair, I made this known before I left and Ms. Lisa stated that she thought I would like it better once my curls flatten out, Well... by the time I woke up they were gone. When I expressed how much I didn’t like it, she did say they guarantee their hair do’s and I could come back or scheduled another appt and they would fix it, but obviously, I probably won’t be taking that offer up for obvious reasons, So definitely a waste of money.", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "109715690348554730143", "name": "W Ware", "time": 1463624653284, "rating": 5.0, "text": "Salon lisa brown is amazing! Lisa Brown and her staff are the best in the Birmingham area. She believes in quality service and healthy hair! Make an appointment today! See for yourself! - Keneisha H.", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "109749539249312367968", "name": "Ariel Henderson", "time": 1500739742090, "rating": 5.0, "text": "I love salon lisa brown they give me and my mom excellent service", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "118415896339151516142", "name": "cammie easton", "time": 1340225437034, "rating": 5.0, "text": "this is one of the best salons ive been to! they do ALL  ethnicities and  the employees are more then friendly, the salon is CLEAN, and there is almost to never a wait ! theire prices are very reasonable ! i fully recomend everyone here to come", "pics": null, "resp": null, "gmap_id": "0x8888d8c924293249:0x6976741efe104f0b"}
{"user_id": "108699200270524441698", "name": "courtney russell", "time": 1607028278390, "rating": 5.0, "text": "Leeza was fabulous and really took special care to make sure I was satisfied.  Very detail oriented, color turned out pretty!", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
{"user_id": "115704119977793680808", "name": "Christina Hall", "time": 1614807159310, "rating": 4.0, "text": "I loved my hair afterwards.😊", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
{"user_id": "103846698639327145981", "name": "Janet S", "time": 1604403958718, "rating": 1.0, "text": "***DO NOT GO HERE***\nTHEY WILL RUIN YOU HAIR AND STILL EXPECT PAYMENT!!??\n\nBEEN OVER A YEAR AND MY SCALP IS STILL DAMAGED!\n\nNote 5 reviews and yet 4 show up....", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
{"user_id": "102608266581362475146", "name": "T Abra", "time": 1571697478427, "rating": 5.0, "text": "very reasonable and for a great pedicure my mom in law got her eyebrows done for 6 very well done and her manicure looks great", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
{"user_id": "110847475125745504906", "name": "Ron M", "time": 1443802038801, "rating": 5.0, "text": "Yesterday I had my beard dyed at R.O.C.K. My student cosmetologist was Tatum and she was super pleasant and professional. With a little assistance from an instructor, she did an excellent job. Tatum is going to make an excellent cosmetologist. I would recommend R.O.C.K. to all of my friends. They are eager to serve and eager to please. Treat yourself to their services. I will return.", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
{"user_id": "117621554873075727294", "name": "Chris Q", "time": 1499357998735, "rating": 5.0, "text": "Enjoyed my haircut with 3 of future hairstylist ( Beth, Christie, Courtney) and patient instructor (Samantha). Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
{"user_id": "110512786231355976656", "name": "Nora Hand", "time": 1623794033989, "rating": 1.0, "text": "I sent my grand daughters yesterday for nails and pedicures. I was so disappointed in the service they received.  I am a cosmetologist myself in Alabama and know that the instructor should have never let them out of the salon without checking the students work! The job was globby and patchy with polish outside the nail! One of the nails peeling off the same day! Why did the instructor not do her job? Apparently they were to be graduating soon!", "pics": null, "resp": null, "gmap_id": "0x889a408544e3e4a7:0x31925c0a445eaf69"}
