{"user_id": "111476912035074329599", "name": "Lexi Smith", "time": 1618964615640, "rating": 5.0, "text": "Great salon and staff! My hair looks better than it ever has. Michele is very knowledgeable about all the products and was able to help me get the perfect stuff for my hair. This was the first time I’ve ever had a thorough consultation and I loved how Michele took her time with me, making sure my hair was perfect. I waited a week before posting this to make sure my color lasted. Usually it washes out after a shampoo or two but my color still looks amazing! I will definitely be back!", "pics": null, "resp": {"time": 1619341550645, "text": "Lexi thank you so much! We love that you are happy with your hair and products! We enjoyed your visit as well and look forward to seeing you again soon!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "107303133554291427849", "name": "Lauren King", "time": 1613372617286, "rating": 5.0, "text": "Everything was perfect! I am new to the area and was referred to come here after another local salon messed my hair up! Not only did they fix my mess, they gave me exactly what I wanted! I was able to relax with a glass of wine, and totally enjoyed my time here with all the girls here and other customers! Everyone was so friendly and made me feel very welcomed and comfortable! My hair is in the best condition that it’s ever been. I have never been shown how to take care of my hair like this before to where I actually understand what I’m doing! I can’t wait to come back and want everyone to know to come here! Best Salon ever!", "pics": null, "resp": {"time": 1613457828754, "text": "Lauren thank you so much! We are happy you love your hair now and that you enjoyed your time with us! We look forward to seeing you again soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105445190294889469337", "name": "Amanda Barnes", "time": 1613373390236, "rating": 5.0, "text": "Very clean salon! The staff cleans each chair and station before, during, and after each customer. My stylist took her time to listen to me and what I wanted. For the first time I didn’t feel like I was being rushed through to quick get me out of there so they could move on to the next one. I was even told I was welcome to hang out and finish my wine after they were through! My cut and color are perfect and I didn’t know that my toner wasn’t supposed to be put on wet hair at the shampoo bowl. No wonder my color has always faded! It has been over a week now since I came here and wanted to wait to leave a review to see if what they told me about this was true. My hair looks just like I got it done! It’s soft and shiny and I can see that it’s going to last longer than it ever has. The color looks better and my hair doesn’t look dry and dull like it usually does. I purchased the products they recommended and they really work! I am looking forward to coming back here! Great salon, extremely clean and staff is awesome!", "pics": null, "resp": {"time": 1613457908838, "text": "Ananda,\n\nThank you so much for noticing how hard our team works to provide a safe, clean, and friendly environment. It was a pleasure to meet you, we are happy you love your hair, and look forward to seeing you again soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "113330136092624267410", "name": "Stevie Bowden", "time": 1612851448418, "rating": 5.0, "text": "I Love This Salon! All of the ladies here were so friendly, helpful, and I loved to see how well they all work together! My hair extensions look amazing and I learned so much about my hair! Michele taught me how to take care of my hair, explained everything that she was doing, and why she was doing it, plus I even went home with all the products that I need to maintain my hair! My color is perfect and matches my extensions exactly! You can’t even tell I’m wearing them, it looks like my own hair!  I will never go anywhere else and I highly recommend MB Salon to anyone who is looking for the best!", "pics": null, "resp": {"time": 1612853988123, "text": "Thank you so much Stevie! We are so happy you love your hair and appreciate you! It was a pleasure to meet you and we look forward to seeing you again soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "104692041668145811228", "name": "Cara Brown", "time": 1607787491063, "rating": 5.0, "text": "Michele is amazing! She has helped me finally get the haircut I have wanted for years. I have had a very short pixie cut for 25 years and didn’t think I could ever grow it out. I love the way she listens to what you want and easily explains the steps she is doing to get it that way. The other young ladies that also work with Michele are very nice and helpful as well.", "pics": null, "resp": {"time": 1608269004895, "text": "Cara,\n\nThank you so much, we truly appreciate you! I enjoy every visit with you and look forward to seeing you again soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "101461302906037692098", "name": "LORI MANAK", "time": 1612396785473, "rating": 5.0, "text": "Lisa D is a ROCK Star at color and cut! She’s fast but SO efficient with foils and highlights! I’d follow her ANYWHERE!!! Trust me, she is AMAZING!!!", "pics": null, "resp": {"time": 1612402314182, "text": "Lori Thank you so much! We are very excited to have Lisa as a part of our team! We all truly appreciate you and look forward to seeing yo-you again soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "115152102349430662832", "name": "Amber Carlisle", "time": 1608661544200, "rating": 5.0, "text": "They are the best in EVERYTHING hair!! Always so knowledgeable and more than willing to help in any way!!", "pics": null, "resp": {"time": 1609124568266, "text": "Thank you so much Amber! We are so happy you found us, and that we were able to help you. We are looking forward to seeing you again, and to see the amazing progress with your hair!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "100818151717741913064", "name": "Kunya J", "time": 1599050890124, "rating": 5.0, "text": "I thought I was going to have to go to Atlanta for the beautifully toned balayage hair color I wanted. Michele walked me through each step and explained the outcome along the way. My hair turned out beautifully.", "pics": null, "resp": {"time": 1599117222915, "text": "Thank you so much Kunya! It was a pleasure to meet you. You look amazing and we look forward to seeing you again!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "111557894828916540331", "name": "Bailey Randolph", "time": 1591061830570, "rating": 5.0, "text": "Michelle is an absolute miracle worker! She turned my hair from SMURF BLUE (she did not do this) to a beautiful silver blue. She has made my hair healthy over the past few months and I could not be happier. Today I just had my hair dyed a platinum blonde and I've got to say she really makes my dreams come true! She is professional, honest about her services/products, and will make sure you're comfortable and feel like you're right at home. I cannot say enough about this women's abilities and wonderful personality", "pics": null, "resp": {"time": 1591080250779, "text": "Thank you so much Bailey! It has been an absolute pleasure! I am so happy that we have turned around your experience on hair color! You look amazing and we look forward to seeing you again soon!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "101695836446670301141", "name": "Faith McDonald-Colburn", "time": 1583864791355, "rating": 5.0, "text": "Michele is top notch in the hair care industry. She takes the time to find out what the client wants, expects and delivers in all categories. The atmosphere at MB Salon is professional yet laid back. The experience while getting my hair done is the best. I highly recommend MB Salon to anyone who wants a top notch stylist who cares about her clients as well as making them feel their best when they walk out the door!!!", "pics": null, "resp": {"time": 1583871697023, "text": "Thank you so much Faith! We love that you enjoy your experience here and truly appreciate you! Looking forward to seeing you soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "104809402519781904682", "name": "Sarah Smith", "time": 1591234780525, "rating": 1.0, "text": "Looking for a professional comfortable environment this isn’t it. When I first made my appointment I was excited. I read all the reviews and everything lead me to believe that this would be where I would find my new stylist since I’m new to the area. Boy was I wrong!!!! The lady that did my hair was really nice and listened to what I had to say but the other lady was very pushy when it came to my color. She kept suggesting things that would be more time consuming for me. I’m a very simple person and do not spend a lot of time on my hair. It also seemed this small salon has a lot of drama as one lady kept talking about previous employees and issues she was having with them along with a new salon being built. I was lead to belibthat she had some past issues with that salon. If it had not been for that I feel like I would have been very pleased with my service. My cut and color was nice but I felt uncomfortable with conversations that was going on around me.", "pics": null, "resp": {"time": 1591348145757, "text": "Sarah,\n\nWe are very sorry to hear about your unpleasant experience in the salon you were at. We keep extremely accurate records of all guests that visit our salon for services, or even just walk in to purchase products. We do not have, nor have we ever serviced a Sarah Smith in our business. You definitely have the wrong salon, and your experience is clearly not a type of atmosphere that is at MB Salon, and all of our reviews support this. Please remove your review and we wish you the best in finding the correct salon. Should you ever want to have a real visit to our salon we would love to have you. Thank you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105066769216464980439", "name": "Carol Lloyd", "time": 1583852597705, "rating": 5.0, "text": "Michele is not only the best at everything hair related, she is also a friend. She took me from colored dark brown hair to my natural pearly gray color. She did it in stages so that my hair is healthier and stronger than it has ever been. I am beyond thankful for her.", "pics": null, "resp": {"time": 1583856956011, "text": "Thank you so much Miss Carol!! I value your friendship and enjoy every visit with you! Oh what a journey it has been!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "114820011850401729925", "name": "Tawnya Yates", "time": 1566912759064, "rating": 5.0, "text": "Michele is simply amazing. I went to her with a vague idea of what I wanted, and she transformed my hair into the perfect purple I had pictured in my head. She really took her time and made me feel like I was a VIP. She was incredibly informative and able to answer the 1,267 questions I had. Bonus points for serving me a glass of wine! I'm so glad I found her salon,  and I'll definitely be back to see her!", "pics": null, "resp": {"time": 1566968458393, "text": "Thank you so much for coming!! We never mind questions..... we welcome them! We value you and look forward to seeing you again soon!!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "111837174277955039795", "name": "Sophie McCormack", "time": 1564633199134, "rating": 5.0, "text": "Michele is an absolute miracle worker. I love her and how much time and quality care she put into my hair. I have never in my entire life had a better experience at a salon than this. My hair has never looked this good!!! I can’t stop staring at myself in the mirror because my hair is now so shiny and beautiful. I also received the best hair cut I’ve ever had in my life. My hair looks so much thicker and perfect. Go see Michele ASAP, you’ll never want to get your hair done by anyone else ever again!!!!!", "pics": null, "resp": {"time": 1564698225140, "text": "Thank you so much!! I’m happy you love your hair! Good luck with everything! Don’t forget to visit!!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "115877269808859341403", "name": "Mary Catherine Hutto", "time": 1583899453976, "rating": 5.0, "text": "Michelle is an incredible stylist with so much knowledge . I have been to many high end salons in the Birmingham are and after having parts of my hair fried off,  Michelle has taken her time with me and my color. She also incorporates a lot of treatments and exactly what I need at home to keep my hair more healthy and strong for our next visit . I feel Michelle is more like family to me than a stylist . I won’t let anyone else touch my hair again after finding her !!!", "pics": null, "resp": {"time": 1583967426405, "text": "Thank you so much! I value you and always look forward to your visits!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105647592241432250264", "name": "Christin Turner", "time": 1583637092140, "rating": 5.0, "text": "Michele was ABSOLUTELY AMAZING!! She literally knows everything there is to know about products and color or ANYTHING hair!! Plus my hair is stunning!", "pics": null, "resp": {"time": 1583688449653, "text": "Thank you so much Christin! We truly appreciate you! Looking forward to seeing you again!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "100325052516570706104", "name": "Jim Sweatt", "time": 1583842706763, "rating": 5.0, "text": "Best haircut I’ve ever had.  Consistent.  Convenient to my workplace.  Very clean and professional.", "pics": null, "resp": {"time": 1583849475718, "text": "Thank you Jim!! We appreciate you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "114995194432953274137", "name": "Lauren Watkins", "time": 1549871194249, "rating": 5.0, "text": "Best Salon EVER! I love my hair! The salon is relaxing, serves wine, has an online store to purchase any product you could possibly need offers so many specials and has its own app! The app is so cool!  You can send messages, look at pictures, get coupons, and purchase deals just for the salon! I’m excited about all the new things that are coming! Can’t wait to go back!!! 5 stars just isn’t enough!!!", "pics": null, "resp": {"time": 1549945679994, "text": "I’m so happy you loved your visit, and everything we have to offer! Thank you so much!! See you soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "103561156935012307004", "name": "Khushboo Golyan", "time": 1556810092521, "rating": 5.0, "text": "Michele is a pro at what she does and I've never loved my hair so much as I do now. She meticulously works with each strand of your hair and the result is always stunning. She has always been easy to reach and accommodating to your needs and timings and a lively individual to spend the duration of the hair service with.", "pics": null, "resp": {"time": 1556814234647, "text": "Thank you Khushboo! You are always a pleasure to spend time with! I’m so happy you love your hair, and look forward to seeing you again!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105790245994202827843", "name": "Madeline Goodwill", "time": 1531446382348, "rating": 5.0, "text": "Michele is the most patient and knowledgeable hair professional that I have been to! She genuinely listens to what you want, and her top priority is the health of your hair. Michele is easy going and I had so much fun getting my hair done by her, on top of being thrilled with the outcome of her work. I will never see another hairstylist again!", "pics": null, "resp": {"time": 1531455251593, "text": "Thank you so much! Was great to meet you, so happy you found me! 💕❤️"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "102678158647384676530", "name": "Shannon Williams", "time": 1549869001343, "rating": 5.0, "text": "Amazing! Best experience I’ve ever had! Michele took the time to really get to know me, my hair, and to explain everything she was doing, how to use each product, and exactly how to style my hair! My color has never looked this good, and my cut is perfect! I love the salon and Michele!!", "pics": null, "resp": {"time": 1549945627098, "text": "Thank you so much! I enjoyed our time together! I’m so happy you love your hair!! Looking forward to seeing you again soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "115997293072184222910", "name": "Kelsey McDonough", "time": 1525965290174, "rating": 5.0, "text": "Michele is amazing! She puts so much thought and care into making sure that your hair look great and is as healthy as can be!! She truly knows what she’s doing when it comes to color and cuts! And did I mention she knows how to cut curly hair?! You’d be surprised how many stylists don’t actually know how.", "pics": null, "resp": {"time": 1525966087117, "text": "Thank you so much! It’s always so much fun whenever you come in to get your hair done, love to play around with the reds and pastels with your curls!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "107158430461235336255", "name": "Joy Wimberly", "time": 1577068800987, "rating": 5.0, "text": "Michele is wonderful, within a second of walking into her salon I had a full glass of wine :) very friendly and awesome customer service ❤", "pics": null, "resp": {"time": 1577072791155, "text": "Thank you so much Joy! We appreciate you and are happy you had a great experience with us!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "117704288174383861770", "name": "Trina Busby", "time": 1526145230669, "rating": 5.0, "text": "Michele is exceptional!!  My hair has never looked better!  She offers vast knowledge of style, color, and products.  Her knowledge and skill, combined with the personal service and attention she gives, make Michele the best in the industry! I am thankful for finding her and would never let anyone else touch my hair!", "pics": null, "resp": {"time": 1526154989987, "text": "Thank you so much! I always look forward to your visits, and am very thankful for you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "117842076252563314720", "name": "April L. Butler", "time": 1526959366606, "rating": 5.0, "text": "I highly recommend anyone to Michele.  I relocated to Birmingham a few years ago and after some trial and error with other salons/stylists I found her and haven't been happier.  I bring her color ideas all the time and she nails it! If she can't do it in one appointment, she sets that expectation before you decide.  Great cut and color without breaking the bank and my hair, though it goes through some intense coloring and daily heat styling, has never been healthier thanks to her!", "pics": null, "resp": {"time": 1526959632999, "text": "Thank you so much! I am so glad you found me, and truly enjoy every visit!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "109197086122973467220", "name": "Theresa Ellis", "time": 1525964364060, "rating": 5.0, "text": "She is so good with my curly hair I had to follow her from New York! She knows exactly what to do and her suggestions are far better than what I could ever come up with. I trust her completely and am never disappointed. The new place is perfect!", "pics": null, "resp": {"time": 1525964855468, "text": "Lol sweet home Alabama! Thank you so much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105181508495890046832", "name": "Melissa Szmania", "time": 1525671722432, "rating": 5.0, "text": "Amazing work!!  I've been going to Michele for years and her new place is fresh and unique.  I especially love the private atmosphere.  In addition the variety of services and products that she offers, Michele produces fabulous results using her highly trained coloring techniques!", "pics": null, "resp": {"time": 1525692919213, "text": "Thank you so much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "110977127598767480903", "name": "Rhonnie Graham", "time": 1593014563072, "rating": 5.0, "text": "Outstanding Stylist!! Thnx Michelle 🥰💯", "pics": null, "resp": {"time": 1593021052162, "text": "Thank you Rhonda! We appreciate you and look forward to seeing you soon!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "102164258892736091963", "name": "CIERRA YONGUE", "time": 1547050405736, "rating": 5.0, "text": "Michelle is the best! My hair was so fried it was falling out when i first went to see her. She saved my hair, without having to cut it all off, She also did my hair for my wedding, made sure i looked good for pictures i can go on all day. 5 STARS is just not enough. OH AND i didnt mention that my hair is very nappy curly frizzy and usually shrinks 4 additional inches after being cut but not with Michelle", "pics": null, "resp": {"time": 1547106957234, "text": "Girl! You’re awesome!! Thank you so much!💕❤️ I love you and your family! Had a blast at your wedding! We have def come a LONG way with your hair💕❤️"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "109197086122973467220", "name": "Theresa Ellis", "time": 1525964364060, "rating": 5.0, "text": "She is so good with my curly hair I had to follow her from New York! She knows exactly what to do and her suggestions are far better than what I could ever come up with. I trust her completely and am never disappointed. The new place is perfect!", "pics": null, "resp": {"time": 1525964855468, "text": "Lol sweet home Alabama! Thank you so much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105181508495890046832", "name": "Melissa Szmania", "time": 1525671722432, "rating": 5.0, "text": "Amazing work!!  I've been going to Michele for years and her new place is fresh and unique.  I especially love the private atmosphere.  In addition the variety of services and products that she offers, Michele produces fabulous results using her highly trained coloring techniques!", "pics": null, "resp": {"time": 1525692919213, "text": "Thank you so much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "102548046523889520857", "name": "Candace Milan", "time": 1552632081202, "rating": 5.0, "text": "I love Michele! She can create the perfect shades of blonde while keeping my hair healthy! The salon is awesome! I have never found anyone who takes their time on my hair to make sure it’s done perfect! I have a lot of hair and usually it gets rushed through, I’m not as blonde as I want to be, and the color doesn’t last! My hair looks so good for a long time, my color stays shiny and doesn’t fade! I was taught how to take care of it and there’s all the products I need right here at the salon every time I come!", "pics": null, "resp": {"time": 1552681109974, "text": "Thank you Candace! You look amazing and I look forward to seeing you soon!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "104361582326162532892", "name": "Kelli McCullough", "time": 1528759869558, "rating": 5.0, "text": "I am so happy to have found Michele.  She has done such a fantastic job with my short hair.  Great listener and so talented.  Highly recommend checking her out!", "pics": null, "resp": {"time": 1528762496862, "text": "Thank you so much! Your cut is so much fun! Always a pleasure with you, and I truly appreciate you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "107244172728638341282", "name": "Alissa Cummings", "time": 1551247358318, "rating": 5.0, "text": "Great experience! I’ve never had anyone actually care about me and my hair before! Michele does the best color!!", "pics": null, "resp": {"time": 1551276452277, "text": "Thank you! I enjoyed meeting you! Can’t wait to see you again!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "103362917161979343505", "name": "Conny Pasquini", "time": 1525964871068, "rating": 5.0, "text": "I’ve been going to Michelle for several years! Will not let anyone else cut my hair and her color expertise is unmatched! Love the new establishment!", "pics": null, "resp": {"time": 1525965269710, "text": "Thank you so much! It’s always a pleasure every time you’re in."}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "109700311996069945202", "name": "Theresa Gilbert", "time": 1551426051426, "rating": 5.0, "text": "I’m not a client but with my experience with their online store, I know this salon is the best!! Wish I could come here, but I live on the other side of the country!! 10+Stars!!", "pics": null, "resp": {"time": 1551477081851, "text": "Thank you so much! We are happy everything worked out great with your purchase! If you ever visit our area please stop by and say hello!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "103171117896313614184", "name": "Auburn Girl", "time": 1527171070636, "rating": 5.0, "text": "Michele is fabulous.  She's great at determining best cut for your hair and lifestyle.  She hasn't disappointed me and she's been cutting my hair for 7 years.", "pics": null, "resp": {"time": 1527183978543, "text": "Thank you so much! I truly appreciate you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "101620125402705780312", "name": "Ashlee Swindle", "time": 1529096756708, "rating": 5.0, "text": "I highly recommend Michele Barnett Salon. She is amazing! I’ve been gone for college and she’s always available for me when I come back.", "pics": null, "resp": {"time": 1529130444016, "text": "It’s always a pleasure every time you come in! Thank you so much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "108420381616276733695", "name": "Kelli Walker", "time": 1525966084797, "rating": 5.0, "text": "Michele is great! She is so knowledgeable & skilled - I can always trust her, whether it’s just a trim, or a complete change of color & style. Highly recommend her!", "pics": null, "resp": {"time": 1525966871977, "text": "Thank you so much! It’s definitely been a lot of fun! I love our conversations whenever you’re in!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "114477729257413034673", "name": "KAREN BROWNING", "time": 1525985886532, "rating": 5.0, "text": "I met Michele 1 nite coming outta Red Lobster, I LOVED her hair she LOVED mine  gave me her business card... The rest is history!! She now cuts all our hair in my family. Excellent products & we love our hair!! Michele is like FAMILY  💕", "pics": null, "resp": {"time": 1525987473630, "text": "Red lobster was our destiny! LOL I absolutely love you and your entire family I’m so happy that I was at red lobster that night. Thank you so much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "109022724911331333530", "name": "Leslie Houser", "time": 1526329364878, "rating": 5.0, "text": "Michelle is the best hair dresser I’ve ever been to. I’m 36 and have thick, course, and long hair. I always thought the type of  pigment of my hair would never go past orange when going to a lighter color. Not only did Michelle get my hair to a georgeous medium blonde with no orange. She fixed the huge mess the past hair stylist had done to my hair. There was a line where the previous salon had not blended or taken their time. Michelle took her time and made sure it was done right. I’m so happy that I went to her! I told her she is like the doctors on botched for hair!! I know you will be as pleased as I am if you choose to have your hair done by her. I’ve been to many stylist. She is by far the best!", "pics": null, "resp": {"time": 1526387661718, "text": "Thank you so much! We still have to do a little more work to get your color perfect, but like you said, your hair type takes a little more time. It was fun spending time with you, and little “Mike” lol."}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "112630722057982277879", "name": "Cinthia Zavala", "time": 1525980623145, "rating": 5.0, "text": "The best stylist I've ever had! My hair has never looked better. Michele is super professional and has a lot of experience in this industry. 10/10 recommend!", "pics": null, "resp": {"time": 1525971247741, "text": "Thank you so much! It’s always a pleasure and A lot of fun!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105321018628759304682", "name": "laura risse", "time": 1527120831410, "rating": 5.0, "text": "If you are like me, and are very picky/nervous about going to see a new hairstylist/colorist; do not hesitate to come see Michele! I PROMISE YOU WILL NOT WANT TO GO ANYWHERE ELSE. I was looking for a new hairstylist/colorist once I moved back to Birmingham about 2 years ago, and will NOT let anyone else touch my hair now. I normally get a blonde balayage which holds for many months and doesn’t grow out brassy like others I have had in the past (it actually always blends perfectly!) Not only does Michele take her time while doing your hair, but she also is very knowledgeable about products and matching the perfect color for your needs. She genuinely cares about you as the client, pays attention to tiny details, and will not let you leave if you are not 100% satisfied. I seriously cannot say enough good things about Michele!", "pics": null, "resp": {"time": 1527123900538, "text": "Thank you so much! I am so happy you found me, and I love our visits together! I appreciate how patient you are, so that we can get your color perfect every time! I am truly thankful for you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "100074684413688708803", "name": "CIERRA YONGUE", "time": 1528530582311, "rating": 5.0, "text": "Michele really cares about your hair!. Mine was severely damaged from years of bad \"salon\" trips. Not only did she get me to where i wanted to be but she did it so that my hair is healthier than it has been in many years. 5 stars is simply not enough.", "pics": null, "resp": {"time": 1528532460447, "text": "Thank you so much! We’ve definitely had a journey with your hair! It is an amazing difference from how I met you, to where you are today! I can’t take all the credit though...... you’ve really done your part by taking great care of your hair at home! I appreciate you more than you know!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "104533174752759354957", "name": "Brian Calhoun", "time": 1525967706786, "rating": 5.0, "text": "Michele consistently gives a great cut, is a pleasure to be around, and is always flexible with her schedule to fit me in for my short notice cuts.  Also has a brand new and very convenient location.", "pics": null, "resp": {"time": 1525969061578, "text": "Thank you so much! I’m so happy that we’re always able  to make it work!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "110041973569570789479", "name": "Becky Graham", "time": 1526677386893, "rating": 5.0, "text": "Michele is the best! She has a vast knowledge of color and really listens to you. You can't go wrong with Michele!", "pics": null, "resp": {"time": 1526678934995, "text": "Thank you so much! It’s been fun through the years for sure! I truly appreciate you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "108011717910321985826", "name": "Melanie Grucza", "time": 1527337720582, "rating": 5.0, "text": "Michele has been my stylist for several years. Cut and color always done perfectly.  Very talented, friendly and professional.  Highl recommended.", "pics": null, "resp": {"time": 1527376172559, "text": "Thank you so much! You are a true pleasure to be around! I always enjoy our time together, and look forward to seeing you! I love spending time with your daughter also!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "109481619068540662271", "name": "Royce Ballard", "time": 1583849330334, "rating": 5.0, "text": "Great haircut every time!", "pics": null, "resp": {"time": 1583849532643, "text": "Thank you Royce! Always a pleasure!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "105580010479057676442", "name": "Graham Henderson", "time": 1525964638488, "rating": 5.0, "text": "Great stylist with lots of experience fantastic prices and she puts her customers first. I highly recommend", "pics": null, "resp": {"time": 1525964875144, "text": "Thank you so much! I’m so glad you guys found me I absolutely love you and your wife!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "102870589888427760567", "name": "Barbara Szmania", "time": 1525660775314, "rating": 5.0, "text": "The atmosphere here is not only private but relaxing; Michele is unbelievably talented and professional. I won't go anywhere else....plus I LOVE her new establishment!", "pics": null, "resp": {"time": 1525660989747, "text": "Thank you"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "101721991583927309924", "name": "Paige Lee", "time": 1529105236247, "rating": 5.0, "text": "She has so much knowledge and is an amazing hair stylist! Super friendly and an amazing studio", "pics": null, "resp": {"time": 1529130458935, "text": "Thank you very much ❤️"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "108069924800112041039", "name": "Crash Yongue", "time": 1528530758717, "rating": 5.0, "text": "My wife gets a little crazy with hair color sometimes, thank god Michele is there to tell her when its not ok. She fixed her messed up fried mop. She does a great job on my hair and beard, wouldnt go anywhere else!", "pics": null, "resp": {"time": 1528532574549, "text": "LOL!! You two are awesome! Thank you so much! It’s always so much fun when either one of you come visit...... never feels like I’m working!!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "107026082247081644380", "name": "wendy dobbs", "time": 1525987388788, "rating": 5.0, "text": "I have used Michelle as my stylist for over 15 years! She will not disappoint! You will get quality service. Michelle has the experience and is certified through Redken to teach Redken color classes and participate as a stylist in Redken hair shows/fashion events nationwide.", "pics": null, "resp": {"time": 1525987524475, "text": "You were my first client I ever got when I move to Alabama. It’s been 17 years and we’ve been through a lot together through the ups and the downs we celebrated and cried. You’ve always been dear to my heart and I appreciate you very much!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "107183952762332593337", "name": "twoheadbands", "time": 1525660683622, "rating": 5.0, "text": "Best hair cut in town!🔥", "pics": null, "resp": {"time": 1525660980347, "text": "Thank you!"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "117713772790936855176", "name": "Cori Ehmen", "time": 1535406725774, "rating": 5.0, "text": "ABSOLUTLEY AMAZING!", "pics": null, "resp": {"time": 1535686921318, "text": "❤️❤️"}, "gmap_id": "0x8889170ba9d87ee5:0xa0eb5a2cf330258f"}
{"user_id": "117173060278679126373", "name": "Jacqueline Williams", "time": 1558716367373, "rating": 5.0, "text": "Pleasant salon/Great Service/Friendly and Funny Staff/Cleaness/Down to Earth Beauticians/Hair always on Point!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
{"user_id": "109016734002463291822", "name": "Kimeisha Crum", "time": 1511486874519, "rating": 5.0, "text": "The Salon is very neat and clean! The staff is professional and of course Tassady is my favorite! She's ALWAYS on time and ready to work. She gets her clients in and out of there.", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
{"user_id": "117346429700092056295", "name": "Natasha Henderson", "time": 1524690582680, "rating": 5.0, "text": "My stylist is very sweet, and her work is impeccable!!!! Very pleasant atmosphere. You definitely get what you pay for #thebest", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
{"user_id": "110957395300449300966", "name": "Purpleacful", "time": 1488944859213, "rating": 5.0, "text": "I love Salon Picasso because the staff is friendly and always professional. Great hair results every time!", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
{"user_id": "109917423503977220165", "name": "Shon Johnson", "time": 1553393862852, "rating": 5.0, "text": "Tassady is awesome with a pair of scissors.", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
{"user_id": "103152543683156674391", "name": "Shantell Corbitt", "time": 1518894794989, "rating": 5.0, "text": "My stylist is amazing and the shop is very friendly", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
{"user_id": "106416981343115484152", "name": "Temika Daniels", "time": 1553253360131, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88891bb64cd09b2f:0x7192c2bf11d9b922"}
