{"user_id": "102125118886122305022", "name": "Tammy Allen", "time": 1622044088527, "rating": 5.0, "text": "I buy their Shea creme. I also give as Christmas gifts. It's amazing, and it lasts. A little goes a long way!", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "106890418936933897355", "name": "Jennifer Wolfe", "time": 1534771879706, "rating": 5.0, "text": "I took a Bloom and Stroll class at the Farm. It was such an awesome experience! You can tell they love their animals and are very knowledgeable. I love the bouquet they taught us to create!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMokI08ZXp_GMm44vCLe5H5-MCu9kvQjSXaLCoL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO3ihQDaeGCy6kcH1edTXNCqF5O4OLwf0pFXE9n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtZxBCxd9n0N9C40aWUyUfCDwt2iX53WRYLin3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOfLsPP-wNzhCpz-Lawe7HyG8PgfzGaiASwta8a=w150-h150-k-no-p"]}], "resp": {"time": 1534779230225, "text": "Jennifer, Thank you for spending your afternoon with us at the Bloom Stroll.  We are pleased to hear that you enjoyed the workshop and the bouquet that you created.  We hope to see you again soon!\n\nNatasha - owner"}, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "105846004381808038204", "name": "Connie Stephenson", "time": 1598048531657, "rating": 5.0, "text": "Very very special flowers from 1818 Farms that we are sending to elderly homebound & friends during this virus time . Excellent service & prompt delivery! A special day for a special person . Highly recommend & so easy to order on their website !!!", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "118164700235940183899", "name": "Felicia Oglesby", "time": 1499945475472, "rating": 5.0, "text": "I love this stuff. Super light shea cream with the right amount of fragrance. I have really dry skin and this goes on easy without feeling greasy. This is perfection guys! Thanks for this product.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOKeXWnRXDznjMT8UsCw8itcn7u2Rsx1F71GSRT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNN8KYl8ANbILzCOWkJ4ofJZzdzUBcUNmjwp0xV=w150-h150-k-no-p"]}], "resp": {"time": 1500086077072, "text": "Thank you so much, Felicia! We are happy to hear you like the product."}, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "105680537761939242411", "name": "Jason Martin", "time": 1581931483744, "rating": 5.0, "text": "Very nice! I bought the Melon Soap bar and it is very pleasant to use and smells lovely.", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "100453463537705295951", "name": "Ginger Cobl", "time": 1533859923222, "rating": 5.0, "text": "What a wonderful place! Everything about 1818 Farms just makes you smile. Fabulous bath and body products, a beautiful bucolic setting with the sweetest farm animals. Sheep, pigs,chickens, and the most precious goat, Farrah Fawcett! The owners are delightful. The events that are offered are fantastic, from farm to table dinners to build a bouquet workshops, something for everyone. The expansive flower gardens are just gorgeous. 1818 Farms is such an asset to North Alabama.", "pics": null, "resp": {"time": 1534779519729, "text": "Ginger,\n\nThank you for your kind words about our family farm.  We love sharing our farm and beauty line with those in our community!\n\nNatasha McCrary - owner"}, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "118102091604164017228", "name": "E3", "time": 1521855499298, "rating": 5.0, "text": "Haven't visited yet, but 1818 Farms Green Pastures Shea Creme is light, economical and quickly moisturizes. The pea-size amount for hands and face  is accurate - well worth it. Thank you so much for this great product. Thank you also for selling through Lucky Duck in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "114744647593519732354", "name": "A Kemp", "time": 1572891188893, "rating": 5.0, "text": "Love the Shea cream. Feels like silk.", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "113208600182032389113", "name": "J L", "time": 1573342047836, "rating": 5.0, "text": "Great business! Would love to go see their farm one day. Best hand cream!", "pics": null, "resp": {"time": 1534779350633, "text": "We are pleased to hear that you love your Shea Creme!  Thank you for supporting our family farm.\n\nNatasha McCrary -owner, 1818 Farms"}, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "104029664276382981092", "name": "Gail Stefanski", "time": 1507400210864, "rating": 5.0, "text": "The shea creme is absolutely amazing.  Do you  have a retail store at 1818 Farms?  I would love to come there and buy some more. If not, is there a location in Nashville that sells your products?", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "112527333975132376947", "name": "Tanya Hill", "time": 1557312616947, "rating": 5.0, "text": "I knew nothing of this company until I’d received a gift for Teacher’s Appreciation week purchased from 1818 Farms. I was sold immediately on their product! I’ve since ordered from them several times. I buy their whipped shea butter mostly - it’s creamy without being greasy and a little goes a long way! I’ve also purchased their products for gifts - needless to say, my mom and grandmother are now hooked! While this review/comment is based on my experiences with this company on a whole, my most recent experience, specifically, is what encouraged me to form a review for the public. I recently placed an order for two of their gift boxes and a couple of single items. The order contained Mother’s Day gifts for my mom and grandmother. The order was received, processed and delivered PROMPTLY - like within two business days (I didn’t pay extra for expedited shipping). I received a text alert when the product was delivered - around noon, yday. It was quite warm outside and I still had hours before I’d get home from work. I was a bit worried about the product sitting in the heat/sun. As soon as I got home, I unpacked the box. The way it was packed so carefully and with consideration was a plus, BUT I also noticed that there was a Koolit refrigerant pack placed in the bottom of my carefully packed order...packed in anticipation of a warm day and no one being home to receive the package once it arrived. This may seem like a small thing. This may seem like “common” sense and good business practices, but as someone who does a LOT of online shopping, I can assure you that many businesses don’t put even a fraction of thought and consideration into packing their product for delivery. 1818 Farms has a lifetime customer!", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "104170680673108622991", "name": "Kristin McLaughlin", "time": 1537148806472, "rating": 5.0, "text": "Rich texture and luxurious scents coupled with fantastic moisturizing qualities! “Wedding Cake” and “Fresh Melons” are my favorite shea creme scents.", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "115217958224225936366", "name": "Nicole Rivera", "time": 1514398366157, "rating": 5.0, "text": "The shea creme is so light and fluffy and yet very moisturizing.  I'm excited to shop for more products.", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "102939784217058979984", "name": "John Mark “Mark” Hester", "time": 1565377410808, "rating": 5.0, "text": "Lovely place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN4j5gJ-5EHSkPRHQzTH2OvGN5xZuIghneDxlb3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
{"user_id": "111387119709775111306", "name": "Jackie Bulic", "time": 1571055438039, "rating": 2.0, "text": "Not impressed for the money I spent", "pics": null, "resp": null, "gmap_id": "0x88627d3f82d38f73:0x9815b0297e8927dc"}
