{"user_id": "102488867247332803127", "name": "Andrew", "time": 1553779158583, "rating": 5.0, "text": "Wall-beds are making a comeback. This business will build yours to suit your room and install it! Great prices I recommend this to anyone looking to add floor space or just have a nice nap nook!", "pics": null, "resp": null, "gmap_id": "0x888a6e6055fb591b:0x4be8891e47373921"}
{"user_id": "102952648943211830766", "name": "Troy Dyer", "time": 1603807314402, "rating": 5.0, "text": "Excellent service nice people", "pics": null, "resp": null, "gmap_id": "0x888a6e6055fb591b:0x4be8891e47373921"}
{"user_id": "107438622568234007127", "name": "Kay Moore", "time": 1581794559667, "rating": 5.0, "text": "Great choice of bedding and wall beds!", "pics": null, "resp": null, "gmap_id": "0x888a6e6055fb591b:0x4be8891e47373921"}
{"user_id": "110916033505329323567", "name": "Vani Joy", "time": 1460001164114, "rating": 5.0, "text": "Great prices! Great service!\nPersonal focus on needs of each customer, free delivery.", "pics": null, "resp": null, "gmap_id": "0x888a6e6055fb591b:0x4be8891e47373921"}
{"user_id": "114710080290425409335", "name": "Jane Bishop", "time": 1563552766910, "rating": 5.0, "text": "The owners are professional and very friendly. I felt like I was among friends.", "pics": null, "resp": null, "gmap_id": "0x888a6e6055fb591b:0x4be8891e47373921"}
{"user_id": "102437930188436858147", "name": "Brittaney Clark", "time": 1615223604083, "rating": 5.0, "text": "I absolutely love this place. We just bought our king bed from them. & made sure it was delivered today! The lady there was the best and made me feel comfortable and she made sure I loved what I bought. Thank you so much for the experience.", "pics": null, "resp": {"time": 1615393827965, "text": "Thank you for stopping in and doing business with us. It was our pleasure to get to serve you."}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "106465674788567005834", "name": "Richard Schneider", "time": 1620009345399, "rating": 5.0, "text": "We bought a queen size mattress and box spring. We got excellent customer service. We love the set we got so far.", "pics": null, "resp": {"time": 1622125981443, "text": "Thank you for doing business with us. We are glad your are enjoying purchase."}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "113268206709237004130", "name": "David Conner", "time": 1616708967455, "rating": 5.0, "text": "Great place to shop for a great bed. Mrs Eunice is a great sales lady and gives you time and space to decide on what you like and want. Thanks for your patience and time.", "pics": null, "resp": {"time": 1618410641248, "text": "Thank you so much for doing business with us.  It was our pleasure to serve you. We hope you are enjoying your bed. Rest well."}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "111277916625552976578", "name": "Jeff Reynolds", "time": 1622124630157, "rating": 5.0, "text": "Excellent experience, by far the best deal we have ever gotten on a mattress box spring set. Can't reccomend enough.", "pics": null, "resp": {"time": 1622126023105, "text": "Thank you!!! We hope you enjoy your mattress for many years to come. Thank you for doing business with us."}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "110511975778498518072", "name": "Richard Kunsman", "time": 1609634331815, "rating": 5.0, "text": "Amazing! This has been the best experience I've had buying a mattress. I love the no pressure and family friendly staff. I am recommending to my family and friends!!", "pics": null, "resp": {"time": 1610849861886, "text": "Thank you for those kind words.  It was our pleasure to serve you.\nWe hope you are enjoying your mattress and resting well."}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "109112524697969603411", "name": "Brian Harris", "time": 1583281367071, "rating": 5.0, "text": "I made the right decision in buying a mattress set from BoxDrop. I'd been in the market for sometime for a top quality affordable king sized mattress set and I found it here. The staff is very professional, helpful, and knowledgeable. I'm still enjoying my mattress set several months later. It has to be the most comfortable set I've ever purchased.", "pics": null, "resp": {"time": 1583328240206, "text": "We’re very happy to hear that you are enjoying your king mattress set. Thanks for the great review!"}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "118261013239890674535", "name": "Chris Hartley", "time": 1600108481805, "rating": 5.0, "text": "Great quality (name brands) and amazing prices.", "pics": null, "resp": {"time": 1610849936006, "text": "We hope you are enjoying your mattress and resting well. Thanks for the review."}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "100728993305784682684", "name": "Greg Padgett", "time": 1579392704977, "rating": 5.0, "text": "Purchased a queen Sapphire Sleep Copper Memory foam for my son.  He LOVES it!", "pics": null, "resp": {"time": 1579397162540, "text": "We are glad he is enjoying the mattress.  Thanks for the great review!"}, "gmap_id": "0x88926f6203c14a5b:0xb37f43c104127718"}
{"user_id": "102655511181530082762", "name": "Sarah Cochran", "time": 1618271067728, "rating": 5.0, "text": "Arielle was fantastic!  I was presently surprised at how friendly and personable she was during our visit.  She did not criticize the competition only emphasized the Sleep Number qualities.  This impressed me enough to try out the beds and in the end, buying one. It was clear that she and Royce (the other sales person) had a great rapport as well.\nVery pleasant experience!", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "108220269297510284566", "name": "Tony Denham", "time": 1622942470196, "rating": 5.0, "text": "If you are at the Madison ALABAMA store stop in and see Danielle. Knowledgeable, helpful and friendly. Store is clean and we'll stocked. Happy Hunting.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "111748739272603615567", "name": "Jeff Hillman", "time": 1616711556384, "rating": 1.0, "text": "BUYER BEWARE!  I would give ZERO stars, but that is not an option.  Been waiting 5 weeks for delivery, now they want to reschedule mid-April and the mattress was on the truck in route to my house.  They won't even tell me where my mattress will be stored for the next 3 weeks.\n\nPay up front and you are at their mercy for delivery.  Customer service is beyond horrible.  Nobody can make a decision.  Can't speak to a manager-they won't even provide a name or a number.  But when you do get to speak to someone, they will say \"sleep well.\"  How in the hell can I sleep well if I can't get the mattress?", "pics": null, "resp": {"time": 1617327680648, "text": "We'd like to look into this with you further and see what we can do to help with your concerns. Just give us a call at 1-888-411-2270 (8AM-8PM CST M-F, 8:30AM-5PM CST Saturday)."}, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "100680374644184861235", "name": "Maya McDonald", "time": 1602360192376, "rating": 5.0, "text": "We already had a sleep number bed I purchased 12 years ago. It was such a life changer for me then!!  We recently moved and our pump wasn’t functioning properly so we decided to get a new one. The new ones are even more comfortable. Arielle was extremely helpful. Getting good sleep is personal for her and that makes her great at her job. She’s very knowledgeable about her products and what’s required for a good nights sleep. She was a huge help!  I can’t wait for ours to be delivered!", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "104782502903015745657", "name": "Stan Shoemaker", "time": 1617497879368, "rating": 3.0, "text": "You came so close to a perfect experience, but blew it in the end. Purchase included removal of old bed, but I just found the old base cover and pump in my trash can. I guess we’re not supposed to have room in it for our household trash now", "pics": null, "resp": {"time": 1617922311102, "text": "We'd like to look into this with you further and see what we can do to help with your concerns. Just give us a call at 1-888-411-2270 (8AM-8PM CST M-F, 8:30AM-5PM CST Saturday)."}, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "106863491369623821373", "name": "Craig Whisenant", "time": 1603068354535, "rating": 5.0, "text": "Arielle is an encyclopedia of information about Sleep Number and their products. She is pleasant and so helpful and doesn't pressure you to buy anything.  We are very pleased with our experience and what we purchased from her.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "105109397557154377765", "name": "Donna Boyett", "time": 1590708782153, "rating": 5.0, "text": "The Customer Service was Wonderful!! Our sales representative was knowledgeable and very personable. My husband and I had a Great experience and left Very Confident that we made one of the best decisions Ever!! Now we can't wait until our mattress is delivered!!!", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "106747791200979980653", "name": "Bill Schlosser", "time": 1578843880986, "rating": 5.0, "text": "My wife and I loved the attention and help that Robert gave us in the store. He answered all of our silly questions and made us feel comfortable (so did the bed). We both loved his honesty. The demo was so cool and really helped us to understand the technology behind the bed. We are now proud owners of the i8 king.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "117431754000326664367", "name": "Nancy Small", "time": 1581808556245, "rating": 5.0, "text": "Anthony is excellent salesman and very courteous. I appreciate the experience with him and my big purchase.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "116142758705490239684", "name": "Leila Moorehouse", "time": 1545349039766, "rating": 5.0, "text": "Arielle was awesome. She gave us options & she gave us her suggestions. She is very customer service oriented & super friendly. Arielle puts 110% of her time & focus on her clients. We greatly appreciate her one on one interaction with us.\n\nThanks Arielle!!\nDwayne & Leila Moorehouse", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "111931848470406784811", "name": "Ken Stapler", "time": 1567560484893, "rating": 5.0, "text": "It was a great experience. No pressure, just information and assistance. Anthony was nice, funny and helpful..and very patient.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "118105808932276936180", "name": "Yolanda K", "time": 1540573448955, "rating": 1.0, "text": "Great service. The Serah was very nice but did not inform us that the base was not refundable with the mattress. We bought the p6 and we hated it after the first night. I cried because I didn't want to sleep on it again. I've given it a few more nights and I still hate it. It's nothing like what it felt like in the store. Big mistake! I have no idea what I'm supposed to do with this base. Oh, and some components on the base don't work either. I'm dreading calling customer service because I hear they suck. I can't stand company's that don't stand behind what they sell.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "100830484172051218848", "name": "Bryan Barley", "time": 1550518390000, "rating": 4.0, "text": "Service was great. Royce is a very attentive salesperson, and knows his product very well. Store tends to be crowded so you may have to be patient.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "101353353473079059790", "name": "Royce Craft", "time": 1573135900281, "rating": 5.0, "text": "This store is AWESOME!\nAnd I should know.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "111331823118131260781", "name": "Paul Smith", "time": 1535424094980, "rating": 5.0, "text": "Very helpful sales staff.  Serah Beth really knew the product line and helped me select the best options for me!", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "113913147371744041949", "name": "Amber James", "time": 1523925176670, "rating": 5.0, "text": "Joshua was amazing. He showed us all the different bed, pillow, and bedding options based upon our list of requests. He listened to our concerns, answered our questions, and made the process incredibly simple.", "pics": null, "resp": {"time": 1523976539329, "text": "Thanks for sharing your review of our Madison store. We're thrilled Joshua was so helpful, and provided you with lots of great information on how to get your best night's sleep!"}, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "118222471106571874039", "name": "george bush", "time": 1535465362436, "rating": 5.0, "text": "Great customer service and excellent knowledge transfer of what the sleep number bed and do for your customers", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "105391021710638964917", "name": "mike colbert", "time": 1540839263135, "rating": 5.0, "text": "Royce Craft we above and beyond normal customer satisfaction. This is our Second Sleep by Numbers and we can not thank Royce enough.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "113855544899862836939", "name": "Jackie Byrom", "time": 1540180848803, "rating": 3.0, "text": "Nice bed but don't work with people.  Nice staff there", "pics": null, "resp": {"time": 1540306036138, "text": "We're sorry to hear you weren't satisfied with your experience, Jackie. Your feedback is important to us and will be shared with our leadership teams for review."}, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "113280586529039506953", "name": "Tricia P", "time": 1526323906456, "rating": 5.0, "text": "Extremely comfortable beds and GREAT customer service from Serah.", "pics": null, "resp": {"time": 1526401134245, "text": "We're so happy to have you as a fan of our beds and our Madison store!"}, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "116015232207598190170", "name": "Jeffrey Hilton", "time": 1569115175630, "rating": 5.0, "text": "Love the sleep number beds.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "100260089803376400792", "name": "Cekeita hopper", "time": 1536015622453, "rating": 5.0, "text": "Great store  Very professional employees", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "115783977112372974426", "name": "Levon Green", "time": 1583194889511, "rating": 5.0, "text": "Staff is Knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x8862689909b29c29:0x11d30c8379128959"}
{"user_id": "109035548483819017348", "name": "Meli Harrison", "time": 1502723604902, "rating": 1.0, "text": "Very convincing salesmen, but they might not be selling you the product you think you're getting. I bought a Dreamline brand mattress (it was NOT cheap), and I was told that it would last 25 years. It has only been about 4 years, and the mattress is already hurting my back and hips (they assured me this would NEVER happen). It may just be this was not a good brand, but they sold it to me as a good brand at a quality price, and I will never buy from these people again.", "pics": null, "resp": null, "gmap_id": "0x889a4b543c98c7c5:0x210773d9a8edeb39"}
{"user_id": "102992784504513003617", "name": "Mona Webb", "time": 1435808331568, "rating": 5.0, "text": "I drove in from Virginia this afternoon and walked in, was immediately assisted but with no high pressure sales tactics. Within 10 minutes I had decided on a mattress (memory foam) and a set of pillows to match. My purchases were immediately loaded and delivered! Great experience!", "pics": null, "resp": {"time": 1435809896563, "text": "Thanks Mona! We appreciate your business. Let us know if you need anything, and have a great nights sleep! Jeff and Mike."}, "gmap_id": "0x889a4b543c98c7c5:0x210773d9a8edeb39"}
{"user_id": "107749879914714055658", "name": "JM_India M", "time": 1495629687519, "rating": 4.0, "text": "The salesperson was very knowlegable about the different types of mattresses. The mattresses were very good but beyond my budget at this time.", "pics": null, "resp": {"time": 1495633955909, "text": "Thank you so much for your review! We appreciate our customers :)  !"}, "gmap_id": "0x889a4b543c98c7c5:0x210773d9a8edeb39"}
{"user_id": "102876665822187913928", "name": "James Jandran", "time": 1511177732915, "rating": 4.0, "text": "Have good deals and staff are very helpful", "pics": null, "resp": null, "gmap_id": "0x889a4b543c98c7c5:0x210773d9a8edeb39"}
{"user_id": "113623294765573240152", "name": "Hannah Crawford", "time": 1599845964697, "rating": 5.0, "text": "Great Mom and Papa store! Nice, friendly people and give great deals! Come check out their beds! They have beautiful beds at a great deal.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNmHFLV4Pios2gDyZY3WrAb2umHI09JEvOWZfdi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPezHudbVFXqmrBkhvTD6FSbX1IxAeNugbSzIk8=w150-h150-k-no-p"]}], "resp": {"time": 1599862791499, "text": "Thank you for your feedback! We appreciate you shopping local small owned businesses like ours!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "103849687944160994853", "name": "Dylan Davis", "time": 1617038770766, "rating": 5.0, "text": "Best customer service I’ve ever received while shopping for a bed. Not once was I pressured or felt uncomfortable about making my purchase. All of the mattresses are fairly priced, honestly felt as if I were stealing them compared to shopping at other big name mattress stores. Thanks again Krys and Josh! I’ll be sending everyone I know!", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "106720929183229363826", "name": "Sannie. DaBoss", "time": 1614533143430, "rating": 5.0, "text": "Awesome people, I recommend to everyone. True definition of above and beyond. Very positive customer interaction. If there’s a wheel there is a way (literally). Josh and Chrissy are wonderful people communication and service is great. If you want a mattress these are you people. They are friendly and very human being like and again customer service is immaculant.", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101215291898072146489", "name": "Steve Clark", "time": 1617035876535, "rating": 5.0, "text": "If you want the absolute best mattress, you must really lay on beds to determine which bed you body likes.  When I went to BoxDrop Mobile, Krystinee was very helpful and understanding of my needs.\n\nMy wife and I just had our first child and our bed was really needing to be replaced. My wife loves a harder bed and I like a less firm bed.  We laid on the mattresses and found the perfect fit for both of us.  Best sleep we’ve had in years. 30 nights so far and very satisfied.\n\nCustomer service: 6 out of 5 stars  they made us feel like family.\n\nPrice: Great products for great prices we couldn’t find a better price for a bed.\n\nMattress:  sleep2win copper cooling mattress with adjustable base.  It even makes me stop snoring.....wife approved.\n\nI highly recommend going to visit this store.  A very welcoming mom and pop feel!\n\n**Live local.....shop local!**", "pics": null, "resp": {"time": 1618093119959, "text": "Thanks so much for sharing your experience with us Steve!!! It’s so good hearing how you and your wife slept like babies!!! Congratulations again on the new addition!!! Here’s to hoping you two get a ton of sleep on that new bed!!! 😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112580156187059204718", "name": "sinister_sinner", "time": 1621293001760, "rating": 3.0, "text": "Very nice, helpful staff. Quality products. However, they did tell me I'd get it with in a week. They just didn't mention it'd be a week three weeks later than they originally told me.", "pics": null, "resp": {"time": 1618093201603, "text": "Thanks for the feedback! We apologize for the unforeseen delay in your estimated date of arrival. With the national foam shortage and the lack of returning workers to the factories as well as Covid shipping delays, we do our best to give our best estimate for delivery from our manufacturer. Unfortunately, freight logistics are beyond our control and we try our best to give you the most accurate shipment date. We still appreciate you shopping with our small owned family business and hopefully production times can start getting more accurate with the return of workers and supply chain issues will help to get the manufacturers up to speed! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108354823864159387272", "name": "Eric Weber", "time": 1612886549803, "rating": 5.0, "text": "An easy no pressure trying and buying experience. Perfect amount of options to try, not too many not too few. Very genuine and friendly couple. We are thoroughly enjoying our new mattress", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "106870805306331311310", "name": "Parker Cleveland", "time": 1617042552522, "rating": 5.0, "text": "Great customer service BEST prices in town! Delivery guy is great also... YOU GUYS ROCK!!", "pics": null, "resp": {"time": 1618093348437, "text": "Parker! We appreciate you coming in and shopping with us!!! We hope you get some good sleep now that you guys chose us! We consider you family! Let us know if you ever need anything! We are always here for you! 😃"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107222037158863004664", "name": "Barbra Mccall", "time": 1619040909476, "rating": 5.0, "text": "Me and my fiancé went in today and they really worked with us\nNo matter what your credit is\nLouis and josh really works with you and give good customer service\nWe got a queen size today and paid $50 down today", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105653834713406688282", "name": "Nene Marie", "time": 1616874192231, "rating": 1.0, "text": "If I could give 0 stars I would. I would not recommend this place to anyone waited almost a month for a mattress and they gave me the run around mattress is not comfortable as it is from how it felt in the store waited all this time just for the box spring to tear when laying down!", "pics": null, "resp": {"time": 1616875697888, "text": "After looking at the order, Deniscia came in on March 4th, 2021 and chose a twin mattress set that was not in stock. Ms. Pettaway chose to do an in-house lay-a-way payment option and put half of the total purchase amount down. We typically do not process in house lay-a-way orders until its paid in full, but we went ahead and ordered the set to try and help her out. Deniscia called to check the status of her order on Saturday March 13th , I, Krystine told the customer we had not received the order yet, that due to COVID, manufacturing has slowed down, which prolonged our delivery on inventory. This is actually an issue we've been patiently having to deal with, as a vendor during the pandemic. It typically takes about 2 weeks from when you pay it off in full, and we would get in contact with her once we received the order from the manufacturer. Ms. Pettaway then called back 20 minutes later with a third party on the phone, at which time both parties proceeded to yell at me using profane language. I explained the situation again being as polite as one can be when faced with someone yelling and screaming on the phone.\n\nI, Krystine, spoke with Deniscia again on the 17th, 19th, 22nd, and again on the 26th when the order had been delivered from the manufacturer. I , Krystine offered the Denescia free delivery for the inconvenience of having to wait on the order despite only putting down half. When the customer came in to make the final payment, I said \"Hello, How can we help you?\" She told me she was here to pay the final payment on the order. I then asked if she wanted a refund because after speaking previously Ms. Pettaway said that she wished to cancel the order and get a refund. Upon making the final payment we arranged for our delivery driver to deliver the products to the customer free of charge.\n\nDeniscia called us Saturday March 26th saying the boxspring was broken. After speaking to Ms. Pettaway, her mother called us yelling, calling us names etc. We asked Deniscia to submit photos to us so we could file a claim with the manufacturer so they could warrant the workmanship of the product. Upon reviewing the photos, Josh noticed the boxspring was upside down and called Deniscia Monday March 29th to let her know the issue was an upside down boxspring and that the manufacturer warranty would not cover damages that the customer caused by putting the foundation upside down. Despite knowing that, Josh offered to come over and fix the boxspring for Ms. Pettaway on his free time to rectify the situation. In response, he was told, there was nothing we could do to make the situation any better and that the customer would leave constant bad reviews.\n\nWe kept in constant contact with Deniscia, speaking to her 5 times in the course of 3 weeks. We worked with her by splitting up the payments and even ordering the set despite not having received full payment. We also provided free delivery for the inconvenience of having to wait. A full refund was also offered to Deniscia who refused it, finally we offered to come over and repair the boxspring for Ms. Pettaway on our free time.\n\nOnce the customer and third party became combative with the use of profanity on the phone with us, the phone call was terminated. Our policy when a hostile work environment arises, is to remove ourselves from the situation. We have offered Deniscia Pettaway several different solutions in order to solve the problem and move forward successfully.\n\nWe have exhausted every option in order to appease Ms. Pettaway in an attempt to rectify the situation. There is nothing further we can do to make Deniscia satisfied despite the countless options given to her.\n\nFurthermore, we stand behind our process and our policies and are confident we did everything in our power to have a successful outcome."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "103310101143149651871", "name": "Jessica Wasmer", "time": 1601951409853, "rating": 5.0, "text": "A great place to buy a mattress! I've bought two in 4 months and I'm incredibly happy with both. Ones a King and ones a full. The owner Josh has a very fun and friendly personality that makes the whole experience better. It's a family run business and I will continue to buy from them.", "pics": null, "resp": {"time": 1604164328882, "text": "Awe! We thank you for your kind words Jessica and so happy to hear you're a repeat customer with us!!! We love that you chose us twice for your bedding needs!! We hope you have many Sunday mornings sleeping in late! 😴 😀"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102152408185305124120", "name": "Jonathan Hoppins", "time": 1605053153776, "rating": 5.0, "text": "Great People and quality products is what you will find at the box drop. My visit on today was a great experience and the mattress I purchased was ordered with no problems. I recommend the box drop!", "pics": null, "resp": {"time": 1612364691145, "text": "Thank you again Mr. Hoppins! We are so glad you are happy with your experience! We are here for all of your future sleep needs! Congratulations on your new house! 😃"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "100375151055981356384", "name": "Kertrina Horn", "time": 1600619312479, "rating": 5.0, "text": "Great family friendly environment! Josh and his wife are amazing and very patient also. I didn’t leave until I got want I wanted. They had no problem guiding me to a mattress and box spring that was cost efficient for my budget!", "pics": null, "resp": {"time": 1604680463207, "text": "Thanks so much Kertrina, we appreciate that you chose us to help with your sleep needs!! We wish you luck in school and your bright future!!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111911991028742232420", "name": "Calvin Johnson", "time": 1612315934799, "rating": 5.0, "text": "If you are looking for a good mattress at a real good price please go check out drop box on government blvd these are some of the nice folks you will ever meet they make you feel love I have bought mattress from them twice and believe me you get the best sleep ever", "pics": null, "resp": {"time": 1612364628314, "text": "Mr Calvin, we appreciate you shopping with us not only once, but twice! It was an absolute pleasure working with you. Thank you for choosing us for your sleep needs! 😀"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "110129407031550386867", "name": "Dank Tanks", "time": 1617039440143, "rating": 5.0, "text": "Just moved to mobile for school and needed a bed fast and honestly one pretty cheap. Boxdrop made it ridiculously easy and I walked out the door with my bed the same day.", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102958723681765013916", "name": "J Berry", "time": 1603307405493, "rating": 5.0, "text": "This place is amazing. They have great quality mattresses at affordable prices. The customer service here was impeccable. I would highly recommend this place.", "pics": null, "resp": {"time": 1604680335058, "text": "Thanks so much for sharing your feedback J! We appreciate you shopping small local owned businesses like ours."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111012680316142986947", "name": "Richard Caudell", "time": 1603486349710, "rating": 5.0, "text": "I lost all my furniture in hurricane Sally and had to find a good bed ASAP. I also have a bad back and working with a tight budget. The owners of this store are the most helpful of the half dozen or so that I tried first. Save your time and go here first. I ended up with an amazing bed and deal. I paid less than half of what I did on the mattress I had before and got a new much higher end mattress. Josh was a huge help and a great person to get to know. Thank you Josh and Krystin for an amazing shopping experience and the perfect price.", "pics": null, "resp": {"time": 1604164438600, "text": "Richard! It was such a pleasure working with you! We hope you are getting great rest during this ever changing crazy year!!! So glad you decided to shop local with us!!! We wish you luck in this upcoming year and many restful nights! 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105745412644181887337", "name": "DollFace Lexi", "time": 1603911358144, "rating": 5.0, "text": "The best customer service ever. Made me feel at home and also helped me with great financial options. I definitely recommend this place. They were very helpful with keeping me within my budget. I will be back for more!", "pics": null, "resp": {"time": 1604164530383, "text": "Lexi, it was so awesome helping you find a bed in your budget! You work so hard and are so ambitious we appreciate you choosing us for your bedding needs!!! We hope you get plenty of sleep in your future and relax in between all those jobs!!! 😴😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105798941962812866391", "name": "Tracy Deng", "time": 1610120913568, "rating": 5.0, "text": "The process for buying a mattress is easy at boxydrop mattress, Josh and his wife are very helpful. Call and set up an appointment, meet in the store, pick the model, pay and they have a delivery person, deliver with a flat fee. There are decent selections at their store, from firm to Medium traditional mattress, springbox Or memory form toppers, etc. They also offer payment plan that cost less than a family take out meal per week. Give them a try today.", "pics": null, "resp": {"time": 1612364413325, "text": "Thanks so much Mrs. Tracy! We appreciate you choosing us for your sleep needs! We wish you many mornings of sleeping in! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "109265445229263863439", "name": "Ben Cardon", "time": 1599077644325, "rating": 5.0, "text": "By far my experience with Box Drop of Mobile has been the best. The owner helped me be able to get a king sized bed. It is the most comfortable bed I have ever sleep in. I’m going to recommend anyone looking for a bed to Box Drop of Mobile and tell them to see Josh!!", "pics": null, "resp": {"time": 1599244761832, "text": "Thanks so much Ben!! We appreciate you sharing your experience with us and shopping local at our family business. So happy we could find something affordable and comfortable for you! We wish you many mornings of sleeping in. 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115547332095010110395", "name": "kayla ballard", "time": 1617033666777, "rating": 1.0, "text": "I do not recommend horrible everything", "pics": null, "resp": {"time": 1617070757072, "text": "Hi Kayla,\nWe don’t seem to have your name in our records. Is there any chance you are writing this review on behalf of someone else? Either way, can you let us know which location you visited and a little bit more about your experience. You mentioned “horrible everything”, if you like you can call me (Krystine) at 251-455-0864."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102685753605915268319", "name": "Nina Rawz", "time": 1601411348294, "rating": 5.0, "text": "They are very friendly and informative about their products. These mattresses are full quality! Awesome and new. I’m so happy to be able to sleep sound thanks to BoxDrop Mattress.", "pics": null, "resp": {"time": 1601669623220, "text": "Nina, it was a pleasure working with you this week!! We are so happy that you decided to come in and find a mattress that worked best for you!! Your son was precious. We appreciate you shopping local with us. 😀"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105119724025106440288", "name": "Jevaughn Shaw", "time": 1602528971169, "rating": 5.0, "text": "Krystine & Josh are great at what they do. They made the process very fun and welcoming. They didn’t try to upsell, matter of fact they undersold and tried their best to fit my budget. If you need a good nights rest they are the people to see. They have a plethora of options that will fit any budget and style of bedding you need!!!", "pics": null, "resp": {"time": 1604680408281, "text": "Jevaughn, we appreciate you shopping local with us and sharing your experience with us. We loved helping you find something comfortable in your budget!!! We wish you many lazy Sundays in bed! 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113973331463963727015", "name": "Tullah Mustafa", "time": 1604074161602, "rating": 5.0, "text": "The best mattress store in town low prices, smiling faces and the sales lady was quite charming.  Definitely recommend", "pics": null, "resp": {"time": 1604164666022, "text": "Thank you so much Tullah, we appreciate you sharing your experience with us and so happy to hear Krystine helped you out 😁 we definitely appreciate you!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "117051433971250027705", "name": "Silly Head", "time": 1612307180975, "rating": 5.0, "text": "Absolutely amazing service and assistance.  Highly recommend!!!!", "pics": null, "resp": {"time": 1612364485941, "text": "Thanks so much! It was great meeting with you yesterday! We appreciate you shopping local with us. Happy sleeping! 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112127251689995377903", "name": "Matthew Cardon", "time": 1599083363604, "rating": 5.0, "text": "Employees are top notch. Service is fast and friendly. Would recommend to anyone in need. Will not be disappointed.", "pics": null, "resp": {"time": 1599245173942, "text": "Thanks so much for sharing your experience with us and others! We appreciate you choosing to shop local with us and we appreciate the recommendations!! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115613033643893253553", "name": "Chase Buddendorf", "time": 1592681745738, "rating": 5.0, "text": "I was on the hunt for a bed 6/20/20 checked out a couple places. I have to say I am very pleased with the prices at boxdrop, I bought a queen size bed under $200!! I am very happy with how the process went. Joshua was extremely helpful with any questions I had. Would definitely recommend going here if you are looking for a mattress and you are on a budget!", "pics": null, "resp": {"time": 1604680559597, "text": "Thank you so much for shopping with us Chase!!! We appreciate your feedback"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107820695440687874831", "name": "Alex Martinez", "time": 1598922682825, "rating": 5.0, "text": "Girlfriend and I care to box drop hoping to find something to provide a good nights rest and Josh did not disappoint! Great prices and ran by great people, will definitely send more your way!", "pics": null, "resp": {"time": 1598967887598, "text": "Awesome Alex! We are so happy to hear that! Thanks for choosing to shop local with us and we are so happy you guys found something comfortable! We wish you luck in your new venture as you become parents! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114138782853041319236", "name": "Jeanette Brown", "time": 1616783628940, "rating": 3.0, "text": "Didn't have much in there and my order was ready when it came time to get it.", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113612673596514404634", "name": "jollie b", "time": 1583970183212, "rating": 5.0, "text": "I went to the BOX DROP in Gulfport, Ms on 3/10/2020 and I was really blown away by the managers. Joshua was really informative and very personable. He took his time to explain about the mattresses as well as answered all of the questions that I asked. I was treated so nicely me and my mother definitely purchased a pair of high end quality set of mattresses. If you are in need of good quality and great customer service please stop by the box drop.", "pics": null, "resp": {"time": 1584045795665, "text": "It was an absolute pleasure meeting with you and Ms Mary the other day Jollie!! You are both welcome back anytime!! We are so happy you decided to shop with us!! :D happy sleeping!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108233952920527769657", "name": "Kaffie Krause", "time": 1599327370113, "rating": 5.0, "text": "I bought an awesome mattress for an awesome deal today i LOVE IT . Ask for Josh he's so helpful and its a really nice place and kind people .", "pics": null, "resp": {"time": 1599862652708, "text": "Thanks so much for sharing your experience with us Kaffie!! So happy Josh was able to take care of you and found something you loved!! Thanks so much for supporting our small family owned business!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "116591465042035879389", "name": "Hannah Scott", "time": 1604784812894, "rating": 5.0, "text": "The service is great! And I enjoy the new mattress!", "pics": null, "resp": {"time": 1612364788853, "text": "Hannah, we appreciate you shopping with us and love that you’re enjoying your new bed! Thanks again for shopping local small family owned businesses like us! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102694726123181617224", "name": "Cheryl Turk", "time": 1604073985888, "rating": 5.0, "text": "such a great place for a new mattress , the Lady was extremely helpful and got e exactly what I needed in my price range", "pics": null, "resp": {"time": 1604164598365, "text": "Thanks so much Mrs. Cheryl, we appreciate you stopping by yesterday and getting to know us! Thank you for sharing your feedback!!! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111666819196539377161", "name": "Blaine Mcbee", "time": 1601060970947, "rating": 5.0, "text": "Great mattresses and very affordable. Easy people to work with 👍🏻 100% recommend", "pics": null, "resp": {"time": 1601665741805, "text": "Thanks so much for coming in Blaine! It was great meeting you and being able to find something that worked for your comfort needs!! We hope you are sleeping great on your new bed! 😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "118440553023527149836", "name": "McKenzie Mc", "time": 1601149457124, "rating": 5.0, "text": "I had a wonderful experience. They had really good prices and quality mattresses.", "pics": null, "resp": {"time": 1601669321550, "text": "Thank you so much for coming in McKenzie! Congratulations on yalls new apartment!! We wish you many Sunday's sleeping in on your new bed 😊🛌"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105915442906020498424", "name": "Jasmine Battles", "time": 1598995316094, "rating": 5.0, "text": "I really love my bed it’s so comfortable you guys should really shop and they have some great customer service ❤️", "pics": null, "resp": {"time": 1598997832891, "text": "Thanks so much for sharing your experience 😊 with us!!! We are so excited that you love your bed!!! Cheers to many days sleeping in at your new place!!! 😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112363462570023266475", "name": "Sherry Trahan", "time": 1599327020073, "rating": 5.0, "text": "We had an amazing experience with Josh and this store . Extremely reasonable in price and quality . Couldn't expect any better business .", "pics": null, "resp": {"time": 1599330422716, "text": "Thanks so much for sharing your experience with us! We appreciate you supporting local small family owned businesses like ours! Cheers to happy sleeping Sherry! 😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101076137496296968164", "name": "Robert Pedzinski", "time": 1579745167846, "rating": 5.0, "text": "We were new to the state and went in our first time about a month ago and weren't able to make a purchase but they were very friendly and sweet. Our 2 girls enjoyed the experience as well. We liked them from the start. Went back today and walked out with a bed in less than 15min. Again they were very polite, helpful, informative. Had enjoyable conversations with them will go back for our next purchase.", "pics": null, "resp": {"time": 1579745800375, "text": "Thanks so much Robert! We love our repeat  customers and your girls are precious!!! Thanks for picking us twice for your sleep needs! We appreciate you guys considering us twice!!! Happy sleeping!! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107617451680561255165", "name": "Zenoiya Cottrell", "time": 1604078514684, "rating": 5.0, "text": "They are very friendly and their prices are very affordable and honestly and truly they have became family and I forgot to mention that they also have a payment plan that’s for if you don’t have all the money they will let you put 50 down and as much as you want to put down after that . P.s I love my bed💜", "pics": null, "resp": {"time": 1604164807655, "text": "Zenoiya, it was such a pleasure meeting you and your family. We absolutely love your mom and consider you guys part of our family!! We hope you two new parents get some rest on your new bed and you can drop off that gorgeous baby Winter anytime!!! She is absolutely stunning!!! Keep pushing forward with your singing and don't forget us small people when you make it on The Voice!!!!!!! 😁🥰"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "109644157704134047809", "name": "Nishia Golston", "time": 1599857495766, "rating": 5.0, "text": "The best and reasonable prices in town. Smooth process.", "pics": null, "resp": {"time": 1599863051581, "text": "Thanks so much for coming in today!! Your family is beautiful! We look forward to hearing how you guys overslept on your new mattress!! Congratulations on your new hybrid king!! Thank you for shopping local with us! 😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101183535724154820682", "name": "Kenslea Davis", "time": 1598726532751, "rating": 5.0, "text": "Really nice family! Helped us find the perfect bed at a great price!", "pics": null, "resp": {"time": 1598731605151, "text": "Thanks again for coming in today Kenslea! We appreciate you guys choosing us for your new bed needs! So happy you guys found something comfortable and that worked for your budget!congratulations om your new bundle of joy! We look forward to seeing pictures and we wish you guys luck 💕 🎊🛏👶"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105227665739386536435", "name": "Alex", "time": 1583604240171, "rating": 5.0, "text": "Josh was very professional, informative, & friendly. I’m so excited for my new mattress.. Highly recommend they're service to anyone looking for great service & quality for a great price! Thanks again!", "pics": null, "resp": {"time": 1583610907379, "text": "Thanks so much Alexciyah! We are so happy Josh helped you get a great bed!! Thanks for coming in and shopping local with us. We appreciate you. Happy sleeping!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "106124763654282147868", "name": "Ceciley Rooks", "time": 1579754778085, "rating": 5.0, "text": "BoxDrop is great. They were honest and up front about everything. Great selection to choose from, with many financing options available. I would highly recommend anyone with a brain to shop here. We even got the mattress delivered the same day we bought it! Talk about convenience. Will be back!", "pics": null, "resp": {"time": 1579786012802, "text": "Thanks so much for sharing your experience Ceciley! We appreciate you shopping local! So happy tou guys came in yesterday! :D Happy sleeping!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "109469120579786209312", "name": "Kayleigh Shorter", "time": 1572115893073, "rating": 5.0, "text": "Josh and Kris were absolutely fantastic to work with this morning! They were both very personable and definitely don’t try to pressure you into making a purchase. I found a great mattress for a more than reasonable price. I would definitely recommend them to anyone looking for a quality product at a great price. They make you feel right at home by the time you leave their store!", "pics": null, "resp": {"time": 1573506120105, "text": "Thanks so much Kayleigh for sharing your experience with us and choosing to shop local small family businesses like us! We hope you are sleeping great!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114619101344519691945", "name": "Cyrenus Bohlen", "time": 1579145662724, "rating": 5.0, "text": "My experience here was wonderful! Came in, looking for a cheap mattress on the spot & Josh came through!! Found one that i liked and couldn’t have gotten a better deal on it. And on top of all of that, he’s super cool and down to earth! Would definitely go back and would HIGHLY recommend!!\nThanks, Josh!", "pics": null, "resp": {"time": 1579150012992, "text": "Thanks so much Cyrenus for sharing your experience! We are so glad we could help you find something affordable and glad you came in, we appreciate you shopping local. :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113903577065019751650", "name": "Chris Prada", "time": 1598200169603, "rating": 5.0, "text": "Very humble and nice people . Good business would recommend to anyone else", "pics": null, "resp": {"time": 1598309780203, "text": "Thanks so much again Chris for shopping local with us! We hope you and your wife are sleeping like babies on your new king mattress set! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105641707518234772399", "name": "Chris Seabrooks", "time": 1578169586866, "rating": 5.0, "text": "ABSOLUTELY love this business! I would highly, highly recommend this business! They were so nice, definitely did not push us to buy anything. We talked for hours. Highly recommend this establishment to anyone and everyone! Please come!!", "pics": null, "resp": {"time": 1578175485781, "text": "Thanks so much Chris! We are so glad you guys came in today! We definitely enjoyed y'alls company! Welcome to the coast! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "100552023456009110425", "name": "Chadda Meagher", "time": 1593206419315, "rating": 5.0, "text": "Great service, military friendly, no nonsense. Thank you for your straightforward help and thanks for the great mattresses. Thanks for supporting your military personnel.", "pics": null, "resp": {"time": 1604680656932, "text": "Thanks so much Chadda! We love supporting our military customers, we appreciate your service in keeping our great country safe!!! Thanks again! 🙂🇺🇲"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112021204966143706582", "name": "Lox x", "time": 1592244407738, "rating": 5.0, "text": "Needed beds and they had lots of nice beds. The service was great 🦸‍♀️🦸‍♂️ Family owned and operated, kinda felt like coming home. 😊😌", "pics": null, "resp": {"time": 1604680508162, "text": "Thank you so much for sharing your feedback with us!!! We love that you feel comfortable shopping with us. 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101220391276684450681", "name": "jamie Rouse", "time": 1596053621777, "rating": 1.0, "text": "You have to make an appointment , so I made the appointment for 2 the person wasn’t there then they finally answered the phone an said they would text or call me when they got there an hour later I called them back an they said they were leaving. I drove over an hour and a half to get there . I would never do business with these people", "pics": null, "resp": {"time": 1596058294438, "text": "Thanks for your feedback Jamie,\nYou are correct in that an appointment is required in order to shop with us. When you communicated to us that you were earlier than your scheduled appointment time, we told you we would arrive shortly. Only after you told us you would like to go shop other places, we safely assumed you did not want to shop with us. We travel from over an hour away also, so we understand your commute time. However, we arrived at our site and you were not there to meet with us.  We have appointments set up until 7pm this evening and were with other customers who had set up a time. We also, chose not to do business with you once you used profane language towards one of our team members. We appreciate your feedback and hope you find what you are looking for. 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "104398274177028433127", "name": "Rose Seabrooks", "time": 1578170210957, "rating": 5.0, "text": "I’ll recommend anyone I know to get their mattress here. By far the best customer service experience I’ve had. Josh & Christina were personable and enjoyable to talk to. We’ll be back if we ever need another mattress!", "pics": null, "resp": {"time": 1578175576090, "text": "So glad to hear Rose, it was a pleasure meeting you both today! So glad we could make the experience something extraordinary! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113759392544285886681", "name": "Shevy Campbell", "time": 1581642795418, "rating": 5.0, "text": "WOW!!! I’m was so amazed and shocked by the professionalism, hospitality, and just all around EXCELLENT customer service received from Josh and Christine!! They were such down to earth and sweet people, and oh SO helpful! I JUST moved into my very first apartment, and have been sleeping on an air mattress for a week; So you can imagine the relief I got sleeping on my brand new mattress😭😭😭 😍😍\n\nThank you guys so much! I’ll be sending everyone for a new mattress!\n-Shevy", "pics": null, "resp": {"time": 1581652917509, "text": "Shevy,\nIt was an absolute pleasure meeting you and we are so happy you came in, everything happens for a reason and we firmly believe that!! Congratulations on your new apartment and even more... on this next chapter of your life!!! ;) We wish you luck and nothing but happiness from here out!!! Happy sleeping from our family to yours! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111741394087231941022", "name": "Rhiana Mills", "time": 1579916424714, "rating": 5.0, "text": "Me & my fiancé went to buy a bed. Found this place & the service couldn’t be better.\nThe guy who was helping us was very nice & funny. I recommend this place to anyone in or out of the area. Great place to find what you’re looking for!", "pics": null, "resp": {"time": 1579922592326, "text": "Thanks so much for sharing your feedback  Rhiana! We appreciate you and your fiance shopping our local small owned family business and we are even happier to know that you guys had a great experience with us! Cheers to sleeping great! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107423139154730179712", "name": "brittany simmons", "time": 1579647476475, "rating": 5.0, "text": "Boxdrop is AMAZZINGGGG! Not only was it the easiest process of getting a bed, ever; but Josh, was one of the best salesmen ever. I love when someone is knowledgeable in what they do so that they can give me information on whatever I need! 10/10 recommend!", "pics": null, "resp": {"time": 1579652864092, "text": "Thanks so much for shopping with us Brittany! It was a pleasure working with you and glad Josh could help make your mattress shopping experience easier!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "106656963146887653604", "name": "Emily Glover", "time": 1575322664132, "rating": 5.0, "text": "First time buyer for a mattress and couldn’t ask for a better experience. People are very friendly and answered all our questions. Gave us plenty of time to discuss without feeling pressured. They were extremely helpful in all aspects and I will definitely be recommending BoxDrop to anyone who asks where to get a mattress from.", "pics": null, "resp": {"time": 1575343998349, "text": "Awesome to hear that Emily! Thanks so much for sharing your experience with us! We are so happy you guys had a good experience! Thank you again for shopping local with us!  Cheers to sleeping in!!! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114536635488918345795", "name": "Jodie Dollesin", "time": 1578628406010, "rating": 5.0, "text": "Krystine and Josh definitely went above and beyond to get us our new mattress. Now we have a comfy bed our guest can sleep on. I highly recommend anyone looking for a mattress on the GULF COAST.", "pics": null, "resp": {"time": 1579152191486, "text": "Thanks for your feedback Jodie, we enjoyed working with you!!! We appreciate you shopping  local with us! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102360786424278243465", "name": "Hailey Pruitt", "time": 1566345276447, "rating": 5.0, "text": "Best experience ever! If you are looking for friendly and affordable service this is the place for you! These guys make you feel relaxed and do not pressure you! They worked with me and made my day 100%! I recommend these guys to everyone!", "pics": null, "resp": {"time": 1579172283531, "text": "Thanks Hailey for sharing your feedback! We appreciate your business and glad we could make your mattress experience awesome!!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114700451380031345948", "name": "Annamae Evans", "time": 1566355425605, "rating": 5.0, "text": "Josh was so helpful.  He helped me pick out the perfect mattress for me and was very patient with all my questions.  When I advised I had to find a way to get it home, he offered to help me out.  He also offered to take my old bed to goodwill for me since I had no way to get it there.  I would highly recommend this place and would definitely use them again.", "pics": null, "resp": {"time": 1579172241954, "text": "Annamae, thanks so much for sharing your experience with us, we are so happy to hear that Josh went above and beyond to help you!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102347199120648799948", "name": "Krystine Scott", "time": 1579746894404, "rating": 5.0, "text": "Everything from kids beds and mattress sets to guest room sets. Cooling gel memory foam, high end hybrids, king, California king, queen sizes and everything you can imagine,  best part everything is affordable. High quality for a low price. Payment plans too, and easy fast and simpl .", "pics": null, "resp": {"time": 1579654044151, "text": "Thanks so much for your feedback!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "104227381247815296969", "name": "Blair Naquin", "time": 1574730484827, "rating": 5.0, "text": "GREAT customer service!! Josh was very informative and helpful while also keeping our budget in mind the whole time!! We left feeling great about our purchase and even better about the place we chose to buy it from!!! 10/10", "pics": null, "resp": {"time": 1574734962511, "text": "Thanks so much for shopping local with us Blair, we are so thrilled to hear your feedback and even happier to know you love your new mattress! Thanks for sharing your experience with others!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112689128640180006277", "name": "April Major", "time": 1580596263686, "rating": 5.0, "text": "I can't even say enough good things about Josh! He was so personable and one of the nicest guys you'd ever want to meet. He delivered my matresses and set up the bed frames that were in a box that I'd just purchased. Great matresses at affordable prices. Love you, Josh!(and your sweet family)", "pics": null, "resp": {"time": 1580601836492, "text": "Awe! Thanks so much April!! We really appreciate you ladies shopping local with us and it was definitely a pleasure working with you both today! Cheers to a great night's sleep!!! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112043624377958733164", "name": "Austin Asher", "time": 1575411161822, "rating": 5.0, "text": "Great place to go and get your mattress and box spring. Friendly services and great prices. Definitely recommend this place for all of your mattress shopping.", "pics": null, "resp": {"time": 1575415645752, "text": "Thanks so much Austin, so happy we could help you find the right mattress. :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "110026729989119217559", "name": "Whittney Jones", "time": 1583539771135, "rating": 5.0, "text": "Absolutely 10000% recommend josh and krystine!  Josh helped us with everything and we definitely had a relationship with him. And on top of it got to meet his wonderful wife on FaceTime :) thank y’all so much great service and great mattresses! Also great personalities!", "pics": null, "resp": {"time": 1583560270633, "text": "Thanks so much Whittney!!! Was lovely meeting you on facetime :) so happy Josh helped you guys get an awesome bed! Thanks The for choosing to shop with us! We appreciate you guys coming in! Happy sleeping."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "116995508616317367834", "name": "Lafi Salvador Berree", "time": 1546732952728, "rating": 5.0, "text": "Great place! Great Deals! Fair and honest people. I highly recommend this store, they helped me out tremendously. They have good stock and great quality products. Centrally located, in front of Lowe’s. Honestly felt like family. Love my new mattress set. 😎😎😎", "pics": null, "resp": {"time": 1581896618137, "text": "Lafi,\nIt was an absolute pleasure working with you when you came in! You are truly an exceptional person to have met! So glad you decided to come in and shop with us  we gained a lifelong friend! We hope you are doing well!!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "100102577934140933842", "name": "Gibson's Lawn Service", "time": 1587424605838, "rating": 5.0, "text": "Just bought a matress on 4/20/20. I don't remember the guy name but he had a red beard awesome service and awesome guy. I think he was the owner I pray nothing but success for him and his family💪🏾💪🏾", "pics": null, "resp": {"time": 1587578953653, "text": "Thanks so much for sharing your feedback! It was a pleasure working with you! Thanks again for shopping local with us! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108306150963702922129", "name": "Tori Joseph", "time": 1572728809885, "rating": 5.0, "text": "Fair prices and Josh was very helpful. I took awhile to make a decision and didn't feel rushed at any point which was great. Kids were super cute and made it a pleasurable experience to shop for a mattress!", "pics": null, "resp": {"time": 1573506255762, "text": "We try to make mattress shopping the best experience ever for everybody and we are so pleased to hear that you enjoyed your experience with us. Thank you for choosing to shop local with our small family business."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101328245316406473999", "name": "Julius Nichols", "time": 1583474594561, "rating": 4.0, "text": "You should definitely buy here.  Quality at the best price. I searched for a better deal and it doesn't exist .", "pics": null, "resp": {"time": 1583544027418, "text": "Thanks so much Julius, we appreciate you coming in yesterday and being patient while Josh helped you and your wife find a bed within your price range. (I was unable to meet you due to our new baby being born) We are so happy that you were able to get a brand new mattress that you were happy with. Even though we arent perfect, we try to work with everybody's budget personally to find the best bed in their price range. I'm glad you chose to shop our local small family owned business. We appreciate you sharing your feedback and I look forward to meeting you on your next purchase with us  :D\n-Krystine"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108407446619266541438", "name": "Kevin Lee", "time": 1575360382587, "rating": 5.0, "text": "Great Prices and Good People! Loving our new mattresses! All super comfortable and affordable! 10/10", "pics": null, "resp": {"time": 1575378123484, "text": "Awesome to hear Kevin! Thanks so much for sharing your feedback we are glad you are sleeping great! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "110513506966821103275", "name": "Kenny Dedeaux", "time": 1575142096814, "rating": 5.0, "text": "Just got a mattress here! The prices are great! The atmosphere and customer service is even better! Thanks guys!", "pics": null, "resp": {"time": 1575148343838, "text": "Thanks so much Kenny!! You guys were a pleasure to work with and we are so happy you had a great experience! Thanks again for shopping our local small family business!!! Enjoy great sleep!!!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113970131755461316085", "name": "Timmy Rooks", "time": 1579753157868, "rating": 5.0, "text": "Best experience I have ever had buying a bed. Josh and Krystine were amazing. There was no pressure to purchase anything. BUT... my wife and I ended up with a $1700 pillow top for less than half the cost. If you’re looking for your new mattress, this is the place to go. Don’t sleep on these deals! (Pun intended) I will never go anywhere else.  Thanks again BoxDrop!", "pics": null, "resp": {"time": 1579753801888, "text": "Thanks so much Tim! It was such a pleasure working with you and your wife today! We are so glad we changed up the mattress buying stigma!! So happy going guys decided to shop local with us! And congratulations on you expanding your family! Here's to getting some sleep before the baby gets here! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "104240385491640106996", "name": "Reilly Thomas", "time": 1581134903715, "rating": 5.0, "text": "I needed a new mattress and found these folks on Facebook. Messaged them and they were able to meet me at a convenient time. Very nice and I got a great deal on a new king set.", "pics": null, "resp": {"time": 1581135922083, "text": "Thanks for sharing your experience with us Reilly! We appreciate you choosing to shop local small businesses like ours!!! 😴😴😴"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "104897082317678761942", "name": "Ashton Legier (Az Legier)", "time": 1575340239626, "rating": 5.0, "text": "Super friendly and helpful. Answered all our questions and were super patient with us as we decided. Even worked with us to help us get it home. Would definitely recommend", "pics": null, "resp": {"time": 1575344055972, "text": "Thanks again for choosing to shop with us Ashton! You guys were awesome! So glad we could make mattress shopping a great experience for you!!! Thank you again! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113327378462635490612", "name": "Lindsey May", "time": 1579044928129, "rating": 5.0, "text": "Josh is super cool dude. Easy to work with. Best prices in town! COME HERE & get a CHEAP mattress!!!! :)", "pics": null, "resp": {"time": 1579149810439, "text": "Thanks so much for shopping local Lindsey! We appreciate your feedback! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "103293383065735847606", "name": "August Clary", "time": 1557357587120, "rating": 5.0, "text": "Extremely professional and pleasant to do business with. All the mattresses were in store like, pristine condition and were sold at a much lower price than a retailer. Would 100% recommend going here for all mattress needs.", "pics": null, "resp": {"time": 1579172539218, "text": "Thanks so much for your feedback August! We appreciate you sharing your experience with us! So happy we could find something great for you!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107808970445037610645", "name": "Nicole LeBoeuf", "time": 1556999036861, "rating": 5.0, "text": "Not only were they some of the nicest people I’ve ever met, they were very well educated on each mattress that they supply. Very upfront and honest and will find what fits to your needs. The prices are fractions of what original cost are and payment options are very helpful. Even if you don’t buy anything they are still very nice and will educate you on what type of mattress you’d be looking for in the future. They’re not gimmicky or pressure salesmen. They are a small family helping others, and making a living. Something I’ll gladly support. I’m super excited to get my new bed.", "pics": null, "resp": {"time": 1579172615269, "text": "Nicole, it was a pleasure meeting and working with you! We are so happy to hear your experience with us was a great one! Thanks again for shopping local with us!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "109761558909724746737", "name": "Kyala Proctor", "time": 1574707410999, "rating": 5.0, "text": "Came into the store today and I received great customer service and great prices on mattresses. I would recommend this store to anyone whose looking to buy!", "pics": null, "resp": {"time": 1574734803130, "text": "Thanks for sharing your experience with us Kyala! It was great to meet you and thanks again for choosing to shop our small family business."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105000777840745470433", "name": "Deflanders Family", "time": 1551806192779, "rating": 5.0, "text": "They are very nice, understanding & knowledge about their products. Very reasonable prices for all budgets. If they don't have what you need right then, they will get it in for you. All it take is a phone call & rest comfortable afterwards. Thanks So Much We will be returning customers!!!", "pics": null, "resp": {"time": 1581896275107, "text": "Thanks again for shopping local with us Deflanders family! From our family to yours, we are so happy to hear about your positive experiences with us!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102847899826945579316", "name": "kimberly deeb", "time": 1556391359170, "rating": 5.0, "text": "I got a great bed for a great price! the customer service was great the owners and staff were amazing knowledgeable and friendly! I will DEFINITELY recommend this place to my friends and family and definitely be back when its time for another!", "pics": null, "resp": {"time": 1556422132391, "text": "It was a pleasure working with you Kimberly! We loved meeting you so happy you found something for you and your other half to enjoy! 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114742368150175791349", "name": "Dior ķ", "time": 1591284110618, "rating": 2.0, "text": "I am trying to get in contact with this business does anyone have a working phone number or email so I can contact them to schedule? Phone on file isn’t working. No answer", "pics": null, "resp": {"time": 1591287783811, "text": "Yes, our phone number is 251-455-0864, as listed. Please give us a call- leave a message please if we are on the other line and we will return your call; or you can message us on Google messenger, our schduling app is also available on our Google business page to set up a time to come in; you can even send us a text or leave your number for us to contact you. 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "118414709560682532553", "name": "Julian Williams", "time": 1565804170327, "rating": 5.0, "text": "Josh and Kris are the nicest people. Very helpful. The mattress was exactly what i wanted/needed. They are on time with the appointments. I recommend them and their business to everyone!", "pics": null, "resp": {"time": 1579172350417, "text": "Thanks Julian we appreciate you shopping local with us!! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102836963383985348106", "name": "Kelle Parker", "time": 1581637621581, "rating": 5.0, "text": "My daughter loves her mattress! The owners bar super awesome too. :)", "pics": null, "resp": {"time": 1581652657149, "text": "Thanks so much Kelle!!!! We love that your daughter is sleeping great!!! Thanks for sharing your feedback!! :D happy sleeping!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115975373777198223794", "name": "Ashleyy Moore", "time": 1579647651396, "rating": 5.0, "text": "While I didn’t go help my wife choose the bed, she did nothing but rant and rave about how awesome her visit was. So I 100% support Box Drop. Personal delivery for very cheap as well! Couldn’t thank you guys enough!", "pics": null, "resp": {"time": 1579653003877, "text": "Thanks so much Ashleyy! That's great to hear! We are so happy your wife had such an awesome experience with us! We appreciate you guys supporting our small local family business. :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "118377784881569729343", "name": "wolfe two", "time": 1584813821002, "rating": 5.0, "text": "Real down to earth and easy to converse with. Very open and honest and will work with you.", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107625130542239001590", "name": "jasmyne page", "time": 1575141539319, "rating": 5.0, "text": "Josh and Kris were extremely helpful and made our mattress buying process a breeze! Best customer service ever!", "pics": null, "resp": {"time": 1575148199962, "text": "Thanks so much for sharing your experience with us!!! We are so glad you guys decided to shop local with us! Congratulations on your new Princess pillowtop set!!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112170321995261574709", "name": "Tanya Davenport", "time": 1566500702626, "rating": 5.0, "text": "Josh was great! He was very nice and knowledgeable. He made choosing a mattress set from them so easy. Thank you so much!!!", "pics": null, "resp": {"time": 1579172151836, "text": "Thanks so much Tanya! We appreciate you shopping local with us and sharing your experience. We hope you're sleeping well!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "116929462577222221221", "name": "Lindzey Neely", "time": 1568396360325, "rating": 5.0, "text": "Very nice people! Great prices and extremely hospitable! I would definitely recommend them!", "pics": null, "resp": {"time": 1579171996505, "text": "Thanks so much for your feedback! We appreciate you shopping local with us!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113545609479249707631", "name": "Jessica NUNEZ", "time": 1577830417236, "rating": 5.0, "text": "Josh was amazing and very helpful beds are a great price.. actually made bed shopping fun and entertaining!", "pics": null, "resp": {"time": 1578152179388, "text": "Thanks so much for sharing your experience with us Jessica!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112171726241925188120", "name": "Linda Gravois aka tattfae", "time": 1556599285918, "rating": 1.0, "text": "Yes they are friendly but forget it if they sell you the wrong mattress!!! We told them we needed a mattress that was 5x6 ft. for a camper. We brought it home and less than an hour later we were calling them back telling them that they sold us the wrong mattress!!! Didn't know we had to do their job for them as far as knowing the measurements!!!! Well they are telling us we can't get our money back or exchange it or anything because of ms. state law because of contamination issues. We had it less than an hour and never unwrapped it!! and now we are stuck with a mattress we can't use!!!😠😠😠 Will never shop there again!!!!!!!! Way to keep a customer happy!!!\n\nMy husband told your husband that he needed a mattress FOR A CAMPER and he also told him 5 x 6 ft.  If you're husband knew anything about measurements and the mattress business he should have known that your mattresses wouldn't work! We didn't know there was a difference but then we are not in the MATTRESS BUSINESS! As for the contamination issue those mattresses are hauled over the road and god knows where else before they even get to your store!! We never even unwrapped it so there is no way we contaminated any more than it already probably was. Also you nor your husband made us aware that once we bought it we were stuck with it! I nor my husband remember seeing any signage stating that policy all we saw on the walls was sport memorabilia! As for what I signed on your husband's phone that was nothing but a white screen with a line through it for the signature. Oh and by the way if you're that worried about contamination maybe you ought to keep your kids from jumping and crawling on the mattresses!!!!", "pics": null, "resp": {"time": 1556421316699, "text": "Hey Mrs. Linda, You guys came In today looking for a queen mattress, we sold you a queen mattress. You specifically told Josh you needed a mattress that was 60x80 (which is a standard queen mattress).  Josh asked you multiple times if you were sure it would fit your space, you were very adamant about getting a queen mattress today and reassured him a queen size mattress is what you needed. We did not have any measurements other than those that you gave us, as a we did not measure your space, you did. Our return policy complies with Mississippi state laws, in that we cannot accept returns because of a contamination policy they have in place. Also, we explained this to you on the phone and you asked us to do something unethical and take back your mattress, that had been inside your home. Once you became combative with the use of profanity on the phone with us, the phone call was terminated, because our policy is when a hostile work environment arises we remove ourselves from the situation. We are sorry the measurements you took weren’t accurate and the space doesn’t fit a standard queen size mattress. Thanks for your feedback."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "104465460965314984216", "name": "Tuesday Gooden", "time": 1551319927409, "rating": 5.0, "text": "AFFORDABLE!! Looking for a great mattress set at a reasonable price I recommend you to go here!! Jason was by far the best!! He did everything he could to make sure we was satisfied!!! I assure you we was not disappointed!!", "pics": null, "resp": {"time": 1581896476594, "text": "Thanks so much again Tuesday! We are so happy we could give you a better sleep buying experience!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114380048242124403671", "name": "merryellen philipson", "time": 1559326325472, "rating": 5.0, "text": "I had literally been looking everywhere for a mattress and I think facebook knew it .. I saw their ad pop up during memorial weekend .. I got all the information I needed by simply messaging them .. They were super awesome people really down to earth and easy to talk to .. Josh showed me the differences in mattresses.. It was hit in the warehouse but he was patient with me ... his wife was sweet and very helpful as well .. They made me feel like a part of the family and I got the mattress that I wanted so it was win win !", "pics": null, "resp": {"time": 1579172428892, "text": "Awe thank you so much for your kind words Merryellen!! We appreciate you shopping with us, so glad we could make this experience exceptional for you. :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "106469376794553772633", "name": "Adria Clark", "time": 1561130299385, "rating": 5.0, "text": "My husband and I purchased a great queen size mattress at a wonderful price. We will definitely be doing business again.\n~The Cooks Family~", "pics": null, "resp": {"time": 1563472217726, "text": "Thank You!! We appreciate doing business with you and your Family!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "109160790306381441307", "name": "Jerminee Defillo", "time": 1574285041633, "rating": 5.0, "text": "Got exactly what I was looking for. Comfortability and affordable. Love my new mattress!", "pics": null, "resp": {"time": 1574286796600, "text": "Thanks again for shopping local with us! It was a pleasure helping you find something you love! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "103132521144504267709", "name": "Sully", "time": 1545441468849, "rating": 5.0, "text": "Great place! Brand new mattresses at a reasonable price. If you need something quality and don't want to break the bank, this is the place to go of you don't want to settle.  So happy I found this place!", "pics": null, "resp": {"time": 1581896690965, "text": "Awesome to hear Sully! We appreciate you coming in and shopping local with us. Hope you're sleeping well!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "100563106353333325524", "name": "Kassidy Madden", "time": 1579223873600, "rating": 5.0, "text": "Very nice variety of mattress’s and very good prices,found and paid for my mattress in full within 15 mins will definitely recommend them to other people and will be back in the future to purchase again 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "pics": null, "resp": {"time": 1579287233976, "text": "Awesome! So glad we helped you fast and you had a great experience! Thanks for shopping local with us Kassidy!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105393723905486945486", "name": "Tiffany Smith", "time": 1553049448976, "rating": 5.0, "text": "The sweetest family!! Great customer service. They were so patient and kind. I will be recommending them to everyone.", "pics": null, "resp": {"time": 1581896023268, "text": "Tiffany, we appreciate your kind words. We know there are a lot of choices when it comes to mattresses and we appreciate you choosing us for you sleep needs. :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108775299539916629363", "name": "Alex Smith", "time": 1581188084453, "rating": 5.0, "text": "Love them.....super friendly couple. Would recommend to everyone", "pics": null, "resp": {"time": 1581206084105, "text": "So happy we could help you out Alex!!! It was so nice meeting you today!!! Happy sleeping! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "117167261700423543889", "name": "Victoria Lock", "time": 1572646126978, "rating": 5.0, "text": "Clean, nice towards military, and super easy to find exactly what I wanted within my price range.", "pics": null, "resp": {"time": 1573506185765, "text": "Thanks for shopping local here with us at BoxDrop Gulfport. Thank you for your service and we hope you are sleeping great on your new mattress!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107747471799870922584", "name": "Ashly Brock", "time": 1576624841537, "rating": 5.0, "text": "Very helpful and friendly! Highly recommend 😊", "pics": null, "resp": {"time": 1576848942956, "text": "Thanks so much Laken! It was a pleasure working with you!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102887434412533508127", "name": "Nicci Van Matre", "time": 1564950239053, "rating": 5.0, "text": "This is the real deal! They handled my handicap needs right away and they worked with me to get my dream bed for way less than any other competitor. They will have my business for life.", "pics": null, "resp": {"time": 1564952010741, "text": "Thanks so much again Nicci for trusting us with your sleep needs! We appreciate you shopping local with us and sharing your experience with others!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "103172878551237990722", "name": "Brenden Sullivan", "time": 1539179418220, "rating": 5.0, "text": "Great experience!  If you want a mattress without all the 'fluff', then shop here.  Awesome pricing.  Awesome products.   Awesome people.  Couldn't be happier.", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107226671535884935806", "name": "Danny Chappetta", "time": 1579906161896, "rating": 5.0, "text": "Great place that will work with you if you are low on funds excellent service as well", "pics": null, "resp": {"time": 1579910173765, "text": "Thanks so much Danny! We are so happy to hear your feedback! Happy sleeping! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115239112632215272134", "name": "Maureen Murphy", "time": 1539916241458, "rating": 5.0, "text": "Great product, friendly customer service that has excellent communication. These folks were great in all they did!!! Don’t buy from a big chain store, support our local folks instead", "pics": null, "resp": {"time": 1539920088947, "text": "Thanks so much Maureen! We are so happy we could help you and your family out! 🙂 it was a pleasure doing business with you!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112222683583859374396", "name": "Laura Tyler", "time": 1539146424321, "rating": 5.0, "text": "I will send everyone I know here!! The customer service, the prices, the quality, EVERYTHING was perfect!! So pleased with my purchase! Ms. Scott was so informative and friendly and let me take my time perusing the place. I didn't feel rushed and uncomfortable like other places make you feel. Thank you so much. #customer4life", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108483032282478641007", "name": "Heather Skinner", "time": 1575467166806, "rating": 5.0, "text": "Very nice family with great customer service and awesome deals!!", "pics": null, "resp": {"time": 1575488400975, "text": "Thanks so much Heather! We appreciate you coming in and it was a pleasure working with you! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112612776364523085859", "name": "Guess Who", "time": 1559589177812, "rating": 5.0, "text": "Josh is super easy to deal with and has great prices on mattresses. Go by and check out what he has to offer if you need a good mattress set at affordable prices.", "pics": null, "resp": {"time": 1563472836649, "text": "It was a pleasure doing business! Thank you"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "108320228641199765909", "name": "Justin Marshae", "time": 1551586502610, "rating": 5.0, "text": "After doing a little searching on pricing and narrowing down what we were looking for, my wife and I found BoxDrop. Josh and Kristine have the best customer service!! The knowledge along with the quality mattresses helped my wife and I find the perfect King Sized Memory Foam mattress that was perfect for us and a Queen sized mattress for our guest room. They deliver locally and to surrounding areas which greatly benefited us! I will only get my mattresses from boxdrop from now on. I’m recommending them to everyone I know!", "pics": null, "resp": {"time": 1581896340343, "text": "Justin,\nSo glad you and your wife decided to stop in and see the styles we had to offer. We appreciate you guys choosing us for your bedding needs! Cheers to happy sleeping!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112941964811612461811", "name": "Carissa Stevens", "time": 1545080877140, "rating": 5.0, "text": "We Been looking for a queen mattress for weeks and I never bought something so quickly! Excellent service Good People! I recommend this business to all!", "pics": null, "resp": {"time": 1581896737899, "text": "Carissa,\nThanks for sharing your experience with us. We appreciate you coming in and choosing us for your bedding needs!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "103322994397856313185", "name": "Duappy H", "time": 1542487462096, "rating": 5.0, "text": "Joshua was very informative, friendly and honest and open with us. He helped us pick a mattress that was a great fit for us. If you want an awesome mattress buying experience, go here!", "pics": null, "resp": {"time": 1581897134591, "text": "Thanks so much for sharing your feedback! Was so nice working with you!! Hoping you are sleeping good!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "118224641475092156277", "name": "Sherryl Roberts", "time": 1598984629288, "rating": 5.0, "text": "Excellent Customer Service", "pics": null, "resp": {"time": 1598990739931, "text": "Thanks so much Ms. Sherryl! Thanks for stopping in today!! Try and stay cool in this heat! We appreciate you shopping local with us. 😊"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113712394756852217458", "name": "Natasha Chatom", "time": 1553287066762, "rating": 5.0, "text": "Place was awesome!! Helped out a lot with choseing  a mattress!! They were very helpful and friendly and easy to talk too. Would definitely recommend them for anyone who needs a mattress! If I ever need another mattress I know where I’m going!!!", "pics": null, "resp": {"time": 1579543036854, "text": "Thanks so much for choosing to shop local with us Natasha! We appreciate your business and hope you’re sleeping well. :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "106911913224684682822", "name": "Rosa Delgado", "time": 1543689126170, "rating": 5.0, "text": "Great place to get mattress or matress set. Honest and friendly. Josh is awesome! Definitely recommend buying", "pics": null, "resp": {"time": 1581896968447, "text": "Thanks Rosa,\nYou were a pleasure working with and I'm so glad we could find something you loved! Happy sleeping!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "107372920996559973917", "name": "Ajuanzia Fairley", "time": 1543882590231, "rating": 5.0, "text": "If in need of a new bed this is the place to go! They have all different sizes and styles. They bring wonderful customer service and have the cutest little family ‼️", "pics": null, "resp": {"time": 1581896831563, "text": "Thanks so much Fairley family, we are so happy we could change your mattress shopping experience!! Thanks for shopping local with us AJ!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "100668105084264139646", "name": "Tony Terrell", "time": 1561416666408, "rating": 5.0, "text": "I loved the experience with Kris and Josh, I would recommend my friends and family to buy their mattresses from Box Drop Mattress.", "pics": null, "resp": {"time": 1563471094128, "text": "Thanks for the awesome review, Tony! Thank you for sharing your experience! 😃"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105398581458262646661", "name": "Nikki Nicole", "time": 1553721226993, "rating": 5.0, "text": "Great experience, very straight forward and worked with us the best he could. Would definitely recommend", "pics": null, "resp": {"time": 1579542960066, "text": "Thanks so much for your feedback Nikki! We appreciate you shopping local with us!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105739041953037312669", "name": "Kimbra Callahan", "time": 1553049210026, "rating": 5.0, "text": "Great family Great customer service and reasonable prices. Highly recommend", "pics": null, "resp": {"time": 1581896064922, "text": "Thanks for sharing your feedback with us Kimbra! We appreciate you choosing to shop local with us!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101869584615156640317", "name": "Debra Cook", "time": 1552077845630, "rating": 5.0, "text": "These are two very professional and friendly people. They work with your budget to make sure you are happyhappy . I HIGHLY recommend you check them out. A-1 Service !", "pics": null, "resp": {"time": 1581896228091, "text": "We appreciate your feedback Debra! So glad you were happy with our services!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113335465436362908448", "name": "Kari Cooper", "time": 1553979827166, "rating": 5.0, "text": "They were so helpful and patient, taking time to help me find the mattress that fit my needs the most.  Prices were very reasonable also!", "pics": null, "resp": {"time": 1579172778955, "text": "Thanks Kari for your feedback! We love spending time with our customers to make sure we find something you will enjoy for many years to come!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114261295165228775910", "name": "Yolanda Purnell", "time": 1543782855372, "rating": 5.0, "text": "This place is awesome! First of all I purchased mattresses today when the store is actually closed.  Krystine made me an appointment today even though the atore was closed. Great selection on site. Come check them out, you definitely won't be disappointed!", "pics": null, "resp": {"time": 1581896883133, "text": "Yolanda,\nThanks for shopping local with us and sharing your experience! We appreciate you coming in and trusting us with your sleep needs!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102023038079490282112", "name": "Supervisor Intl", "time": 1551496597620, "rating": 5.0, "text": "They where very helpful and friendly ,even waited past store hours so we could get the mattress we really wanted.", "pics": null, "resp": {"time": 1581896383408, "text": "We appreciate you guys shopping local with us!! Thank you again!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102023038079490282112", "name": "Supervisor Intl", "time": 1551496597620, "rating": 5.0, "text": "They where very helpful and friendly ,even waited past store hours so we could get the mattress we really wanted.", "pics": null, "resp": {"time": 1581896383408, "text": "We appreciate you guys shopping local with us!! Thank you again!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "117722198830993781726", "name": "lori plauche", "time": 1552433069171, "rating": 5.0, "text": "Josh and his wife were very accommodating. Great mattress set for a great price.", "pics": null, "resp": {"time": 1581896174198, "text": "Hey Lori, we thank you so much for shopping with our small family owned business. Happy sleeping!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "117251294069624895567", "name": "JSR", "time": 1543441818433, "rating": 5.0, "text": "This is such a great company to do business with. They are family owned and really do know the mattress products they sell. Look no further, they have a great mattress at a great price!", "pics": null, "resp": {"time": 1581897013266, "text": "Thanks so much JSR! We appreciate you choosing to shop local with us!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "110485278029771449662", "name": "John Doe", "time": 1574216802139, "rating": 5.0, "text": "Great....! Great quality mattresses, great prices and very nice people....!!!!", "pics": null, "resp": {"time": 1574286834229, "text": "Thanks for sharing your experience with us John! So happy you decided to shop our local family owned small business!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112625043559756560976", "name": "Allan Duda", "time": 1539452487549, "rating": 5.0, "text": "If you are looking for high pressure, bait and switch sales people, then these folks aren't for you. Very easy to deal with, no pressure to buy, much better than having to deal with someone who is solely relying on commission. Got me what I wanted for half of what the local stores wanted for the same items.", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101704628664242192065", "name": "Jalynn K", "time": 1553171686953, "rating": 5.0, "text": "Great experience!! Loved the service and was so helpful throughout the whole process.", "pics": null, "resp": {"time": 1581895977545, "text": "Thanks so much again Jalynn for shopping our small local family owned business. :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "109090396997134225820", "name": "RAMONA URBAHNS", "time": 1552506201538, "rating": 5.0, "text": "I would recommend boxdrop gulfport to anybody that wants a great deal on superior mattresses. They know what they are doing. Please contact them on Facebook for great service.", "pics": null, "resp": {"time": 1581896144080, "text": "Thanks so much Ramona, we appreciate you choosing us for your bedding needs!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "100372743775956913857", "name": "Laurie Higgins", "time": 1604778015151, "rating": 5.0, "text": "Very friendly and professional.", "pics": null, "resp": {"time": 1612364729093, "text": "Thank you so much Laurie for sharing your experience! We appreciate you shopping local with us. 🙂"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114236187522391217874", "name": "Mark Boggan", "time": 1579513741892, "rating": 5.0, "text": "This is a regular matress store ran by a FAMILY.  Not corporate America", "pics": null, "resp": {"time": 1579539238629, "text": "Thanks so much Mark for sharing your feedback! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111613441602858008406", "name": "Oye Aborishade", "time": 1553894642608, "rating": 5.0, "text": "Great to do business with. Delivered freely 4 me...", "pics": null, "resp": {"time": 1579542886710, "text": "Thanks so much for sharing your feedback! We appreciate your business Oye!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111613441602858008406", "name": "Oye Aborishade", "time": 1553894642608, "rating": 5.0, "text": "Great to do business with. Delivered freely 4 me...", "pics": null, "resp": {"time": 1579542886710, "text": "Thanks so much for sharing your feedback! We appreciate your business Oye!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101287241781898363795", "name": "iBe Smokeyy", "time": 1552350388879, "rating": 5.0, "text": "Great Customer Service Affordable Deal and all material is brand new", "pics": null, "resp": {"time": 1581896189522, "text": "Thanks for sharing your feedback!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112966643662962463149", "name": "Rachel Thomas", "time": 1533077200865, "rating": 5.0, "text": "Excellent customer service and very friendly. Best prices I found for new mattresses ! Would buy from them again !", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112023016136169771713", "name": "Chris Knox", "time": 1547740863029, "rating": 5.0, "text": "Awesome people and they really helped us with a great mattress when we needed it. I have a sleep number and the mattress they sold us is much better!", "pics": null, "resp": {"time": 1547744688037, "text": "Thank you so much Chris! We appreciate your business!! ☺️"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "114393953176824253061", "name": "Christopher Bridges", "time": 1583271674842, "rating": 5.0, "text": "Nice staffs and affordable prices on comfortable beds", "pics": null, "resp": {"time": 1583275774755, "text": "Thanks so much Chris! We are so happy you decided to shop local with us. Happy sleeping."}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112459652859315662060", "name": "Bee Bo", "time": 1539212538090, "rating": 5.0, "text": "Good mattresses for a good price if you’re on a budget, along with a very friendly staff", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115922975117862094645", "name": "Shannon Becker", "time": 1576275127429, "rating": 5.0, "text": "Very nice....very informative....great deals!!!", "pics": null, "resp": {"time": 1576281046431, "text": "Thanks so much Shannon! It was a pleasure meeting you today. We really enjoyed your company while helping you get the best mattress!! We appreciate you shopping local with us!!!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111293883371432875911", "name": "Bonnie Trotter", "time": 1551562783050, "rating": 5.0, "text": "Great, down to earth people with great quality mattresses!", "pics": null, "resp": {"time": 1581896360972, "text": "Thanks so much for sharing your feedback Bonnie!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115280172044152068451", "name": "charles w", "time": 1579194072271, "rating": 5.0, "text": "Boxdrop great company great service!", "pics": null, "resp": {"time": 1579199854609, "text": "Thanks so much for sharing your experience Charles!! We are so glad to hear that!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "118304209745978425005", "name": "Joe Chudson", "time": 1597171595796, "rating": 1.0, "text": "No public bathroom.", "pics": null, "resp": {"time": 1597193188676, "text": "Hey Joe!\nWe appreciate your review.  But are curious as to how and why you gave us a one star review when our Mobile location is not currently open for business yet?  Your comment that we have no public bathrooms available is actually untrue. Not only do we a bathroom available to customers, but we have TWO available to use when we do open that you are welcome to come in and test out!! 😁 We offer two different types of toilet paper, hand soap, warm water and fresh paper towels to use when you do come visit us! We look forward to your review of our bathroom when we do open!!! Thanks so much Joe.\n\n-Krys"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "115110798563117435222", "name": "Andrew Yfantis", "time": 1560547483759, "rating": 5.0, "text": "Highly recommended very friendly", "pics": null, "resp": {"time": 1563472316932, "text": "Thank You Andrew!! It was a pleasure helping you!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "102252634213181363579", "name": "Bobby Boswell", "time": 1555031002607, "rating": 5.0, "text": "Great people !!!!! Highly recommend", "pics": null, "resp": {"time": 1579172656639, "text": "Thanks so much Bobby!! :)"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "105365752750332237122", "name": "Aaron Fertig", "time": 1539384472898, "rating": 5.0, "text": "Very friendly and good products", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "117334374652258236651", "name": "Nicholas Mancuso", "time": 1543955198866, "rating": 5.0, "text": "Great people, service, and quality!!", "pics": null, "resp": {"time": 1581896775449, "text": "Hey Nicolas,\nIt was awesome working with you! We thank you so much for sharing your experience with us and taking the time to shop local!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "113299840980356961333", "name": "Tytianna Burage", "time": 1576275273615, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1576281087754, "text": "Thanks so much Tytianna, you're awesome also! Thanks for choosing us and shopping local!!! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "111607031656339614487", "name": "Andrew Ayers", "time": 1538016013448, "rating": 5.0, "text": "Box drop Gulfport can't be beat for how they treat customers, or the price. Why go anywhere else?", "pics": null, "resp": null, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "112278315695842151300", "name": "Joshua Greer", "time": 1579641386034, "rating": 5.0, "text": "Love this Place!!!", "pics": null, "resp": {"time": 1579652776566, "text": "Thanks so much for your feedback!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "101150766455425491330", "name": "Frank Payne", "time": 1581896814674, "rating": 5.0, "text": "Really good prices", "pics": null, "resp": {"time": 1581900695528, "text": "Thanks so much for your feedback Frank! It was a pleasure working with you!! Look forward to working with you again! :D"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
{"user_id": "104542817729687823393", "name": "Mike Miller", "time": 1552691924234, "rating": 5.0, "text": "They have my recommendation", "pics": null, "resp": {"time": 1581896092185, "text": "Thanks so much Mike for your feedback! We appreciate your business. From our family to yours!"}, "gmap_id": "0x889c175fd00c2a63:0x8f737bc346918443"}
