{"user_id": "109204063719938735400", "name": "Mike hambrick", "time": 1627049492810, "rating": 5.0, "text": "Stopped by to drop my bike off for a tune up and to correct an issue.  Unfortunately due to traveling I was on a tight timeline and Mike in service worked me in and took care of my issues in 24hrs as committed.  Appreciate it!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "108922047377798675102", "name": "Gerry Ditto", "time": 1628815185356, "rating": 5.0, "text": "Always informative . Lucky to have him here in gville.", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "109559571556441819312", "name": "Ruben Royer", "time": 1617039412144, "rating": 5.0, "text": "Nice quality selection. And of course being in the south very friendly people. 😉👍", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "100934653679461473586", "name": "1flybyman", "time": 1611689643375, "rating": 1.0, "text": "Bought a $300 jacket for my wife for Christmas, they gave me the holiday sale at check out brought it down to $250, I didnt pick up the right size so going back in the week after Christmas to swap it out they informed me the sale was over and charged me full price to swap the coat out for a different size... bahumbug much?", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "103557187161849883019", "name": "The Bearded Man-Drenaline", "time": 1595264370816, "rating": 5.0, "text": "I would drive from out of state to co e shop there, just saying...Good vibes, if your in the area, def. Stop in and say hello and support this little shop, they have a lot to offer", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "101812162796197559746", "name": "Melissa Brown", "time": 1580838333067, "rating": 5.0, "text": "I needed my daughter's bike fixed. The man in the store was so friendly and nice. He fixed what was wrong right on the spot. I was in a s out. He had a great personality. I will be back if I ever have any other bike issues.", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "109025512586483760634", "name": "J", "time": 1543876860386, "rating": 5.0, "text": "So many choices when it comes to buying a new bike. I looked far and wide on the social media sites, visited at least four different bike shops in and around the Birmingham area. I found Chris at Guntersville Outfitters and was expecting something close to what I had experienced at the other retail stores.\n\nI was in for a very pleasant surprise. Some background is in order. I was an avid cyclist many, many years back. I had gotten away from biking as my interests took me to other hobbies. I rode occasionally and then not at all. I still have bikes I bought new back in 2000 and 2002. Then about 5 rides ago I rediscovered why I loved mountain biking so much.\n\nNothing is quite as peaceful and at the same time as exciting as gliding through the woods on your bike and seeing the beauty of nature unroll before you. So reinvigorated and re-energized I began looking for my next bike. Kind of funny how technology had changed what I thought was top end back in the early 2000’s.\n\nEnough about the history. I also have a passion for genuine, sincere customer service. I love the person who knows what to say and when to say it. Who asks about you and your needs. Who listens “between the lines” at what you are really saying or asking about. I found all these qualities in Chris at Guntersville Outfitters.\n\nHe responded to all inquiries quickly and thoroughly. He asked the right questions to understand my needs. He made recommendations based off his experience. I could not make it to his store until the weekend. Boy was I excited. Like a kid in a candy store.\n\nWhen the weekend came I made the drive to see him. He greeted me by name as soon as I walked into his store. What followed was a very insightful demonstration of two bikes. We talked about the pros and cons to each. The benefits to me of one over the other. I never felt pressured. Never felt rushed.\n\nI had a folder with at least a dozen used bikes that would have saved me money. While deciding which one to buy, I was able to watch and listen to Chris engage with other customers also. He was consistent and professional with each one. My mind was made up. I purchased my new bike from Chris.\n\nI followed up with him to let him know about my first ride. He was quick to respond to my text with well wishes and an offer of any further assistance. I am very pleased with the service, the price and the overall value of the transaction. It is not always about the money you could save or the distance you might have to drive. It is about the relationship you build.\n\nThank you to Chris!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "105856748237185098257", "name": "Wings of Paine", "time": 1562441128769, "rating": 4.0, "text": "I just moved to alabama and things got left behind one of those things was a spoke tool. I went in with my mother because she knew where this place was. The guy was talking to me like i was stupid. On the flip side he dosnt know me. I fix bikes in my free time and he was trying to be helpful", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "114905093806890539188", "name": "Abigail", "time": 1547685475148, "rating": 5.0, "text": "The place is amazing! And the staff/owners are fantastic!!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "105733473625442976280", "name": "William Flemming", "time": 1553036922582, "rating": 5.0, "text": "Great folks, great gear!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "106862163797894957170", "name": "Kellie Gilbert", "time": 1496083353276, "rating": 4.0, "text": "Awesome place for the outdoorsy type like myself!!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "107850086868186712893", "name": "Rachel Morris", "time": 1448744167245, "rating": 5.0, "text": "Great spot for excellent quality outdoor apparel. Very friendly staff!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "108358950856423266941", "name": "Lee Mosley", "time": 1560177598063, "rating": 5.0, "text": "These guys are the real deal!", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "101679007993323825529", "name": "Hazel Gracelin", "time": 1531343487470, "rating": 3.0, "text": "How snooty can one place be?", "pics": null, "resp": null, "gmap_id": "0x8889f8d66617b291:0x7940dfc270a90cab"}
{"user_id": "104104202528487635044", "name": "Evan Waugh", "time": 1489103978097, "rating": 5.0, "text": "Been there twice now. If you're looking for a store that is...more corporate this isn't the place for you.  If you want good service from guys that know their stuff, even if they aren't amazingly fast, this is the place for you.  I walked in with the specialized that I built when I was working at a shop in the mid-2000's. I knew it was showing it's age, particularly the drivetrain. The short version is $500 to get mine back in good shape, or trade it for a new one for an extra $500. It only made sense.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN3SwNneyi1Odvm_Rgm11W-LTZg4k1oKr15SXzW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMi7nm-Khbh2Xw65WhP1iiLIl6agQacTdwL3hMN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "109667882531599296305", "name": "Randy Barefoot", "time": 1506254298438, "rating": 5.0, "text": "Great service. The crew at Madison Cycles are friendly, helpful, and experienced. The prices are reasonable. They tuned my e-bike and I'm getting 10% more life out of my battery. Even adjusted the handlebars for comfort as an extra. Fixed my flat while I waited a few minutes past closing. Love these guys.", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "102767345595977547625", "name": "Jon G Woods", "time": 1476933244540, "rating": 1.0, "text": "Slow service! No communication! Not serious about business! Went to pick up my bike today after it was dropped off exactly a week ago. I was told the bike would be ready the same day, hopefully by close of business. I did not receive a single follow up phone call all week. So I went in expecting to pay and walk out within five minutes because they were obviously waiting on me, right? When I asked the status of my bike, at first, he didn't know where my bike was located, I had to point it out to him. Then when I asked why my bike wasn't fixed yet he said, \"we have a lot of bikes\" and he shrugged. Then I asked him how long it would take to fix and he said about a half hour. So basically, he's telling me in 47 hours of a working week they couldn't get a 30 minute bike job done. Even if he had exactly 94 bikes this past week that each took a half hour to fix I still would be skeptical. Had to ask myself, \"Why should I wait around another 30 minutes while he does a lazy poor repair?\" But he did recommend to avoid riding the bike not to cause any further damage, \"Ya think?\"! No hustle no dedication. Go here if you want to be treated like your time and money are not worthy.  I decided to take my business elsewhere.i", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "105969574643934975094", "name": "Frank Smith", "time": 1505620097299, "rating": 5.0, "text": "Best bike shop in Madison county. Friendly knowledgeable staff. They were able to fix my bike while I waited.", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "106586543099540177305", "name": "Clarissa Harrold", "time": 1488602221307, "rating": 5.0, "text": "ALWAYS very helpful and they take the time to make me feel like my questions are important. Very happy I chose to shop here and get a quality bike and helmet.", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "105801393063899155077", "name": "Matt Dade", "time": 1486674156357, "rating": 1.0, "text": "Store looks dirty and cluttered. Waited for 10 minutes and wasn't even acknowledged. I understand waiting your turn for another customer, but even just a \"hi, be with you in a minute\"would have been ok.", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "113616523511220548879", "name": "David Cypert", "time": 1496250473036, "rating": 5.0, "text": "Went in to get some tubes and info on converting my Giant to tubeless.  Got help quickly and they were spot on explaining my tubeless options.", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "107432362102288826200", "name": "Stanley Griggs", "time": 1481330819908, "rating": 5.0, "text": "Excellant very helpfull", "pics": null, "resp": null, "gmap_id": "0x8862657be82f5a01:0x4e6552dd399437b7"}
{"user_id": "118242130295250080846", "name": "Timothy Sagely", "time": 1618022256403, "rating": 5.0, "text": "I had a set of wheels spoked today at Spinning Spoke Cycles and was very satisfied with the service and very nice ppl, I will be back to do more business with those guys. Great Service. I'll show more when finished.  God is Great.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNPBlgtEJzDUQ34l00MBhvmtdOthHgZZvvUKEuj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105209767590682089781", "name": "Julie Pitts", "time": 1621710230192, "rating": 5.0, "text": "Really friendly staff! Great stock of high end bikes. We were looking for something specific they did not carry but they still went above and beyond to help us get the information we needed. Really good people!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "115639332775376349404", "name": "Chuck Creamer", "time": 1618679108192, "rating": 5.0, "text": "Nice bike shop.  Very helpful.  Did not know this was there until I found them online. Worth seeing", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "106886917136433723216", "name": "Jason Holt", "time": 1619279934808, "rating": 5.0, "text": "Fantastic local professional bike shop!\nVery much appreciate the customer service and willingness to make sure we had a great bike purchase experience.  Thank you guys very much!  The bikes are awesome!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "101493382217797155686", "name": "Eric Manduca", "time": 1624908277073, "rating": 5.0, "text": "STAFF WAS VERY HELPFUL AND KNOWLEDGEABLE WILL DEF BE BACK AGAIN.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "100911967190906480699", "name": "Amy Crews", "time": 1617411628647, "rating": 5.0, "text": "I have purchased two Trek bikes from Spinning Spoke. Every time I go in the store for something the employees are attentive and knowledgeable and really care that I have the best experience with my bikes. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "114900163774414004279", "name": "Tyler Smith", "time": 1594929760203, "rating": 5.0, "text": "The staff is knowledgeable, kind, and eager to assist, all while not applying undue pressure. The store carries a good inventory of quality bikes and accessories. And they offer great advice for maintaining your bike, which is quite helpful for the novice cyclist like myself.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMI9N4qT3Tf-QnPscpZVAqQvnc2kznLVDgGyTL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "104774516422169601744", "name": "Michael Schneider", "time": 1614205897767, "rating": 5.0, "text": "Great shop and employees.  Work is done right the first time.  Overall a great experience and will be back again.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "116153606792544169073", "name": "Joey Holt", "time": 1617196603278, "rating": 5.0, "text": "The entire staff was very knowledgeable about all of their products. They really seemed to value me as a customer.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "112102322518291570215", "name": "Ehrrensmommy", "time": 1593391106983, "rating": 5.0, "text": "I have nothing but positive words about this business and it’s staff.  The best experience my husband and I could have had!!  From the moment we walked in the door the atmosphere and customer service was amazing!!  We worked with Jeffery and Max I think was his name!!  I felt so comfortable and was giving so much helpful information.  We were not rushed, pushed or up sold!!  We live like an hour away and will drive here anytime we need servicing or need anything related to our new bikes!!  Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "112473615580700212886", "name": "Todd Perry", "time": 1619218468956, "rating": 5.0, "text": "These guys put a BB and crank on my bike while I waited. I was out of there in 45 min. It might have been a slow Monday afternoon for them and I was lucky they had the parts in stock but same day service on a bike repair these days is unheard of.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "100891423357702453533", "name": "Michael Cottrell", "time": 1600475813127, "rating": 5.0, "text": "These guys are great!  I bought a 2021 Trek Checkpoint from them.  I’m from Georgia and was met in Birmingham with the bike.  Amazing customer service!  Also, I needed a shorter seat post and they hooked me up with one too.  I would highly recommend this bike shop!!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "109897365590496585079", "name": "Angela Lawler", "time": 1613257016657, "rating": 5.0, "text": "Bryce is awesome! Great customer service. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "102812901672385689334", "name": "Pam Butler", "time": 1617893526019, "rating": 5.0, "text": "Very helpful and friendly staff, always make me feel appreciated.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "103804885236177522650", "name": "Tabitha Ray", "time": 1609779822384, "rating": 5.0, "text": "I was very pleased with my experience at The Spinning Spoke. If you are looking for an excellent customer service experience, this is the place to go.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "101329548534733243923", "name": "Kristy Blackburn", "time": 1612196699244, "rating": 5.0, "text": "Helpful and friendly!  Great selection of bikes and accessories.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "103834210893764536980", "name": "Matt Williams", "time": 1603169062994, "rating": 5.0, "text": "Got my first road bike here recently. They helped me alot during the process! I'll definitely be shopping here more in the future.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "117275851021018623570", "name": "Teresa Sesler", "time": 1594160286258, "rating": 5.0, "text": "The folks at Spinning Spoke are top shelf! Very knowledgeable and friendly staff! My wife and I have been a customer of theirs every since they started in the Bicycle business! The Shoals area is very fortunate to have a “true” bike sales and service outfit!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "108274330590440339019", "name": "Tony E", "time": 1625843183552, "rating": 5.0, "text": "Nice folks, good selection", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "104518851910458994713", "name": "Lynn Reese", "time": 1596311212576, "rating": 5.0, "text": "Bought a 3 wheel bike for my daughter with downs. They guys at Spinning Spoke were great and let her try it out to make sure that she could ride it. It is red and she loves it!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "109697774092197254960", "name": "Harrison Womack", "time": 1594649535961, "rating": 5.0, "text": "Super friendly and easy to work with. They hooked me up with a very slick Checkpoint AL 4 that rides very smooth and comfortable for me! If anyone is wanting to get into cycling you've got to go to The Spinning Spoke for all your bicycling needs! 10/10!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "117879208869099956862", "name": "Tracy Churchwell", "time": 1592691545486, "rating": 5.0, "text": "Staff was very helpful, they helped me pick out the right bike and correct size for my needs. They had a bigger inventory than bike shops anywhere around. Highly recommend any one looking for a bike give these guys your business.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "109191669808820886887", "name": "Loren McCoy", "time": 1606930653541, "rating": 5.0, "text": "Great shop!  Our family gets all of our bicycles from here.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "100907210294808028073", "name": "john cicala", "time": 1602182110308, "rating": 5.0, "text": "Everyone here is incredibly helpful, knowledgeable, and wonderful to work with. They enjoy what they do and it really makes a difference.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "103559137332403091728", "name": "Timothy Helms", "time": 1593029128236, "rating": 5.0, "text": "A great local place for all your bike needs. I had been looking for a hybrid Trek for a months. I walked in the store and found a great deal with friendly service. I highly recorded giving The Spinning Spoke a visit.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "117213781275955161829", "name": "Eric Meyer", "time": 1572532711468, "rating": 5.0, "text": "Eero was great and very helpful. I'll be back.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNDwX74tQ2UAkFrsKQ2VOVpYMnTbK3Hm8ydhYIN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "111790840943310507550", "name": "rhee perry", "time": 1586887969784, "rating": 5.0, "text": "Bought our daughter a bike here a few years ago, and the service was incredible. Just bought myself a new bike and the purchase couldn’t have been easier.\n\nThe family rides make this bike shop a true community bike shop!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "104356625336455534732", "name": "Clay Thompson", "time": 1597258029868, "rating": 5.0, "text": "Spinning Spoke had the bike in stock and promptly put it together before the end of the day. Great service and selection of bikes.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105331197211603769351", "name": "Charles Wickwire", "time": 1572442244010, "rating": 5.0, "text": "I greatly appreciate the experienced mechanics, those talented repair people who keep my bike in fine tune.  They are always willing to take short look to make sure all is well or do the bigger repair.  And, the product selection of bikes and accessories is just what we need.  Good quality products that I can rely on.Bicycling is about safe riding and the the sheer fun of riding.  Everyone at the Spinning Spoke has that same focus and enthusiasm.We have needed a first rate bicycle shop in town and I am very thankful that the Spinning Spoke is here.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "117999750298449702502", "name": "Mark Holley", "time": 1608153106885, "rating": 5.0, "text": "Great bike shop! Pleasure to do business with!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "109548507996824632134", "name": "Jon Goggans", "time": 1595618748255, "rating": 5.0, "text": "Great folks.  Braxton is the best.  But they are all super helpful.  Will be back!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "112723348626019555251", "name": "Brad Black", "time": 1617195348676, "rating": 5.0, "text": "The service is unprecedented! In a time where most businesses treat you like a number it’s so refreshing to be treated like you’re the only customer at The Spinning Spoke! I’ve been riding Trek products since 2015 and have been very pleased with the bikes and the warranty!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "117004403684915416400", "name": "Ben Bowling", "time": 1605825419762, "rating": 5.0, "text": "They were SUPER helpful and provided fast, quality work.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105848586845251792022", "name": "River Mayo", "time": 1596130140688, "rating": 5.0, "text": "Very helpful. Very nice people and a great atmosphere! I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "112107376980715359809", "name": "Mike Marks", "time": 1598269800460, "rating": 5.0, "text": "The Spinning Spoke staff was great in completely updating my 30 year old city bike and when I bought a new electric bike that was out of stock they drove to south Alabama to pick one up for me; they are very knowledgeable also. Thanks Mike Marks", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "109387328558318711182", "name": "Bethany Batchelor", "time": 1593180379643, "rating": 5.0, "text": "Been using them for a little over two years now. Always helpful and friendly! Couldn’t ask for better service.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "111549957565695281271", "name": "The Cool Kiddos", "time": 1566062467276, "rating": 5.0, "text": "Good, honesty company with employees who go above and beyond for good service! They replaced a tube for me and when we had problems again a couple months later, they fixed it, no charge, because it was their mistake that caused it to go flat the second time. We have 5 kids, and 3 bikes from Spinning Spoke. I’m sure it won’t be much longer til we have 2 more from them. I highly recommend them. And we love the kids trade-up program too!!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105366607460412660096", "name": "Cale Kress", "time": 1605394353683, "rating": 5.0, "text": "Awesome experience and very helpful and friendly staff!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "113609661204745985866", "name": "Whitney Moore", "time": 1591207484956, "rating": 5.0, "text": "Guys in the shop where so great to work with that we went back 1 week after buying the first bike to purchase the second one!!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "118058297575681609749", "name": "Lisa Rickard", "time": 1575761889918, "rating": 5.0, "text": "Blessed to have this wonderful shop in Florence! The staff is always super friendly and very knowledgeable!! They also go above & beyond to promote riding in our community and keep our trails clean & clear!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "115973115054110290735", "name": "Justin Carter PhD", "time": 1592485694217, "rating": 5.0, "text": "They were very helpful through each step and I am very happy with my purchase.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "108541920088448006945", "name": "Ashley R. Anderson (Stella's Planet)", "time": 1547218105592, "rating": 5.0, "text": "Extremely knowledgeable staff and great customer service! Also, the trade-in bike plan for kids is a life saver.  It allows us to buy good quality bikes for them, without having to worry about how quickly they outgrow each one. In fact, I would say that program is 99% of what kept us coming back for the first couple of years.  Now... we wouldn't even consider shopping somewhere else for our bikes and bike gear.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "113758889876641776317", "name": "Paige Sandlin", "time": 1546990863852, "rating": 5.0, "text": "Jeffery was so sweet to Joel by helping him pick out a bike for his birthday, and nifty accessories. He even set everything up for us! He made sure his helmet fit perfectly. That made me feel good knowing that his little noggin will be safe and secure during a ride! We had a wonderful experience, and this Mama will be back to pick out a bike for her birthday!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "102770719202402762727", "name": "Robert Newsom", "time": 1601689033478, "rating": 5.0, "text": "In store, hands on bike fit is a necessity. Thank you at The Spoke for keeping new inventory coming in!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "103758764327493828296", "name": "GolfBikeJeep Repeat", "time": 1576782163952, "rating": 5.0, "text": "I purchased a bike from them online. Eero and Timothy ensures the bike was tuned to my specs and personally DELIVERED to me in Birmingham. Absolutely awesome. 10/10.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "112854090188228674572", "name": "Jeremiah Stillings", "time": 1553889464594, "rating": 5.0, "text": "Very awesome shop. The tech was super knowledgeable all the way back to Schwinn's world tour days. I had a great time there today and will return even if I am not looking for a new bike because the staff is awesome.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "102944717926744729904", "name": "Sajel Speyrer", "time": 1589139057184, "rating": 5.0, "text": "Easy to work with and was a great help in find the right size bikes for my kids.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "106275668686084189450", "name": "Ted Roberts", "time": 1572438749579, "rating": 5.0, "text": "Spinning Spoke is a great place to get a ride!  The folks working there are great!  Love my two Townies and plan on getting a ebike as well!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "116934097968252536834", "name": "Melinda Smith", "time": 1539284238738, "rating": 5.0, "text": "Had a great purchase experience! The staff is super helpful, friendly and supportive. Just got our Trek Verve 2 bikes home and took a short spin to try them out. Loving them already! Would recommend The Spinning Spoke to anyone.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "110430072368676277053", "name": "Jeff Smith", "time": 1564099199409, "rating": 5.0, "text": "Great service, free test ride on Trek/Bosch electric bike while service was done. Highly recommended. Courteous and reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "103872673873610283338", "name": "Kyle", "time": 1533587652813, "rating": 5.0, "text": "I bought purchased my Trek road bike from Spinning Spoke about half a year ago and couldn't be happier. The staff was very helpful educating me on which product would be the right fit for my needs and they installed all the lights, clips, etc that I was also purchasing. The prices were fabulous and overall a very friendly/warm atmosphere.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "100452729308949350565", "name": "Jeff Moon", "time": 1604580036014, "rating": 5.0, "text": "The sales staff was very helpful.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "112517572044863187071", "name": "Deborah Walker", "time": 1552784681228, "rating": 5.0, "text": "Timothy and his team are the absolute best!  They are extremely knowledgeable, and their service is second to none.  Trek products are dependable, and I love riding both bikes I purchased from The Spinning Spoke.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "106597858871735766922", "name": "Bradley Mifflin", "time": 1549135994131, "rating": 4.0, "text": "If you are a Trek and Bontrager fan this is the spot. A great local bike shop. We need more places around like them. They do group rides and always have great service. Fun to just go in and chat.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "110703507037873243217", "name": "allen mcdonald", "time": 1498509676418, "rating": 5.0, "text": "We became stranded on the Natchez Trace Parkway due to flatting issues. We caught a ride to Florence and the spinning spoke had all the equipment we needed to get back to riding. The staff was friendly and was gracious to work us in so we could still make our B&B before dark!  Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "104463036511532046625", "name": "Angela Purcell", "time": 1601314614792, "rating": 5.0, "text": "The guys at the shop always answer any questions I have and they make every shopping experience great!!!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "117875338485620739571", "name": "Scott Morris", "time": 1595645317389, "rating": 5.0, "text": "Friendly service. Competent maintenance and repairs.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "104991910014985536424", "name": "robert johannes", "time": 1559159566835, "rating": 5.0, "text": "Helpful friendly and knowledgeable people thst care sbout their customer. Reliable and very reasonable. Good experience, but should have picked up some other accessories,  can't wait.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "111759013101201074453", "name": "ANTHONY SOLONE", "time": 1614273407961, "rating": 5.0, "text": "Jeff & Blaze rocked it! Those dudes are the best. Purchased a Roscoe 7 while there and they made my mind settled as I decided on my dream bike.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "113660874455606867509", "name": "Even Steven", "time": 1572661869218, "rating": 5.0, "text": "Friendly and professional. They know bikes and they know service. I consider them new friends.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "113094632372541917236", "name": "Brianna Wolfgang", "time": 1570477237601, "rating": 5.0, "text": "The people who helped me through my purchase were very friendly and helped me set up a payment plan that worked well with my budget. The two bikes that were purchased are beautiful and I get many compliments on them.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105227471645426925693", "name": "Blake Michael", "time": 1558647162550, "rating": 5.0, "text": "Extremely helpful and really nice people. Can't reccomend them enough. Thanks guys", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "103172771374330004307", "name": "TL Bullington", "time": 1572627582792, "rating": 5.0, "text": "Love these guys! They are absolutely the best!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "106860258345950624157", "name": "Vanessa Romano (The Jeep Diva)", "time": 1559568075057, "rating": 5.0, "text": "The three staff members that I had the pleasure of dealing with were courteous, knowledgeable, and professional.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "107624156917198270884", "name": "Danny Mitchell", "time": 1441826055722, "rating": 5.0, "text": "I have had several bikes serviced at The Spinning Spoke Shoppe, all were serviced very well. The staff is very friendly and helpful. I will be buying my bike and supplies there. I give the shop a\n5 star rating.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "111537621586127814885", "name": "Michael Burgess", "time": 1587941823013, "rating": 5.0, "text": "Always helpful, always professional!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "111627650676269805072", "name": "Joshua Jackson", "time": 1583155124691, "rating": 5.0, "text": "Great shop with good prices.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "102917101400582768238", "name": "Lindsay Aycock", "time": 1564974264691, "rating": 5.0, "text": "Very knowledgeable staff & excellent service!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "106074606165017342392", "name": "Ron Gresham", "time": 1581803171252, "rating": 5.0, "text": "they care about the customer and they are friendly     My  previous  one star review  is incorrect   Which was based on one   Occasion  and  miscommunication", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "111359230366278973961", "name": "Todd Ehlenfeldt", "time": 1541028193376, "rating": 5.0, "text": "Nice clean shop. Replaced my tire & tube while I waited.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "113102031173738582003", "name": "James Edwards", "time": 1617213755797, "rating": 5.0, "text": "Great staff. Always willing to help solve any problems with my bike that I may have.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "102227055397756339369", "name": "Jeffrey “jeff” Allen", "time": 1516311087405, "rating": 5.0, "text": "The folks at spinning spokes are awesome and always provide excellent service", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105284753022274408946", "name": "David Shockey", "time": 1523132587832, "rating": 5.0, "text": "Excellent bike shop with a friendly and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "105879540788009413725", "name": "Tony Alexander", "time": 1537640050918, "rating": 5.0, "text": "Good people, courteous and know their job", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "108956861493152218487", "name": "Pete Williams", "time": 1514044255081, "rating": 5.0, "text": "Nice selection and good staff service.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "104924127145008633973", "name": "Brock Armstrong", "time": 1558211022240, "rating": 5.0, "text": "Expensive yet knowledgeable staff and friendly environment.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "107103076042302172782", "name": "Sunflower Studios", "time": 1612211591064, "rating": 5.0, "text": "Service with a smile!", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "106589694404334749114", "name": "Bradley Dean", "time": 1415332543015, "rating": 5.0, "text": "Best bike shop in Florence. The only place to have your bicycle serviced too.", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "113132249331055928411", "name": "noah haddock", "time": 1500082763110, "rating": 5.0, "text": "They fix bikes GRATE", "pics": null, "resp": null, "gmap_id": "0x887d485c2aefc0e5:0x91aa6d7cd1feac29"}
{"user_id": "118105000561992413748", "name": "David Zuwiyya", "time": 1618424698550, "rating": 5.0, "text": "Trek Auburn recognized the piece that I wanted installed, they gave me a reasonable quote, did the service promptly, and charged exactly what was given in the quote. What more could you ask for? Thanks so much!", "pics": null, "resp": {"time": 1624785905833, "text": "Thank you very much David. It was fun helping you get going.\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "100332578060174446475", "name": "kevin horschel", "time": 1614016881485, "rating": 5.0, "text": "Ben and the rest of the staff are fantastic! Trek of Auburn is a pillar of our cycling community outreach through NICA sponsorship as well as several other causes. They are my trusted “go to” for anything bike related. We have other local shops, but they do not provide he same genuine concern for making a customer feel comfortable and appreciated. Trek of Auburn has excellent predictable service and fast turn-around times.", "pics": null, "resp": {"time": 1615840504981, "text": "Thank you Kevin\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "100348514128128748402", "name": "Maxon Hartley", "time": 1626298906372, "rating": 5.0, "text": "First time customer. Great experience.", "pics": null, "resp": null, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "114019754533479003372", "name": "Mike N", "time": 1616847452433, "rating": 5.0, "text": "Ben and team were fantastic during my journey to find the right bike. I drove in from Georgia as they were the only store in the area with the bike I wanted. Super low pressure but there to guide and read what I was going for on both a bike and accessories. Great experience and thanks again!", "pics": null, "resp": {"time": 1624785847354, "text": "Thank you very much Mike\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "115953269855508776064", "name": "Gid Alston", "time": 1620514604716, "rating": 5.0, "text": "These folks give excellent service at a reasonable price. This is by far the best bike shop I have ever used.", "pics": null, "resp": {"time": 1624786031921, "text": "Thank you very much Gid\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "101809528075746325936", "name": "As Roath", "time": 1626195969846, "rating": 5.0, "text": "Excellent and thorough service, courteous staff. Nice experience.", "pics": null, "resp": {"time": 1626218226173, "text": "Thank you\nRide safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "109209920710552184506", "name": "Mark Morales", "time": 1619483303877, "rating": 5.0, "text": "Your team did a great job making us feel welcome and getting my daughter into a new, well size bike. Thanks!", "pics": null, "resp": {"time": 1624785996694, "text": "Thank you very much Mark. It was great joy to help her get riding\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "104761601223319087369", "name": "J H", "time": 1553362634966, "rating": 5.0, "text": "It's obvious from the get-go, this is is a business that cares about what you want.  Their service is impeccable and they go above and beyond.  After talking with the owner I was happily surprised with the laid back feel, and they were able to answer all my questions knowledgeably and clearly.\n\nI've known the manager for years.  He is meticulous and takes great pride in his work.  A perfectionist when it comes to tune ups,  no matter what brand or age of bike you bring him.  He has an eye and appreciation for the finer details.\n\nCatch up with him at Chewacla, the local mountain bike park where he can be found riding the trails with his friends or family,  and sometimes hosting a bike demo for fun in his spare time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQDjzXb7F6MvN5w1xH3i0BINOeu3gOfdkWEUCt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdThbK0rVCOdQGGoQfNUVhpc1dZWtFXt7bpU3-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMPWEOtw_TcLc7kNYo_oQKnqt-kxxs0CLM6FA7D=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOglfY9J3do3wKddmZYAu8Nj0akgVDaa6NFRFiu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUEbPkJY7FgeuK95cTooDsUonllQhu0kotNKZd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMa8mMHQI01Y55dJE7rB8cbU5EFFxewSeGyeYdY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOrDkYXOAxcoLVXz34MaZsjpT3mboLaSvUqJkKG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRFuRP6cYqRxtLw4XrDZ66dBH2i4eyx2JFeWTM=w150-h150-k-no-p"]}], "resp": {"time": 1553383361570, "text": "Thank you Joe for your kind words\nRide Safe!!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "105679692019469985087", "name": "Lindsey Hern", "time": 1602123423301, "rating": 5.0, "text": "Exceptional customer service! They truly take care of their customers! These people are so knowledgeable about all of their products and everything bikes. They made good suggestions and didn’t try to over sell at all. 11/10 service.", "pics": null, "resp": {"time": 1602184674396, "text": "Thnk you Lindsey\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "108536749596559324875", "name": "Ross Lewallen", "time": 1595479185347, "rating": 5.0, "text": "Excellent service, very competent, and super easy to deal with.\n\nA couple of months ago I drove the five-hour round trip adventure to Trek Bicycle Auburn with a friend who was purchasing a bike that they had on hand.  After talking with Ben, the manager, I was pretty impressed with the business and the level of knowledge and technical skills the staff demonstrated.  I was impressed enough that I returned last week with my Canyon for a much needed tune up and preventative maintenance.  JT and James took a lot of time with me to ensure that they fully understood what I wanted while simultaneously inputting their maintenance advice to absolutely ensure that my servicing plan was exactly what I needed.  I valued their advice because as part of my service I wanted new cables, chain, front disk brake (slight warp), and new wheel bearings.  They agreed with the cables and chain but went out of their way to straighten the disk brake and clean, inspect, and re-grease the bearings, which of course wound up being a much greater value for the money, at least on my side of the deal.  I have around 100 miles on the service and the replacement parts and the service adjustments and tuning are perfect. These small things combined with the quality of the final product earn Trek Bicycles of Auburn a great deal of trust from me, which in turn ensures that I will make that tedious drive every time I need service for my bike.  Additionally, for new bike purchases and bike accessory needs the store has many bikes on hand and nearly every accessory that one should want or need.  Thanks Team!", "pics": null, "resp": {"time": 1595516501223, "text": "Thank you Ross\nRide safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "105970283171987529631", "name": "David Pearson", "time": 1615742453204, "rating": 5.0, "text": "Great bike store.  Knowledgeable staff.", "pics": null, "resp": {"time": 1615840528415, "text": "Thank you David\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "103219918094368553611", "name": "Laura Olds", "time": 1608859249311, "rating": 5.0, "text": "During an exceptionally busy time, the staff was friendly and communicated clearly. I had attached fenders to my road bike, but was having trouble with adjusting them so they wouldn't rub.  They told me that fenders on road bikes could be finicky and didn't make me feel incompetent. The adjustment was complete within a couple hours. Another great experience!", "pics": null, "resp": {"time": 1612813329105, "text": "Thank you for a great review\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "107795034027592308727", "name": "Dale Meeks", "time": 1615849756409, "rating": 5.0, "text": "Great people to work with!! Very knowledgeable. Ben was great!!!", "pics": null, "resp": {"time": 1615970551787, "text": "Thank you Dale\nRide safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "106188762396544396726", "name": "Bobby Rowland", "time": 1613848877599, "rating": 5.0, "text": "Great shop. Highly recommend.", "pics": null, "resp": {"time": 1615840562947, "text": "Thank you Bobby\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "113255481318555324400", "name": "Jackie Young", "time": 1597543314315, "rating": 5.0, "text": "The salesman was just awesome, extremely helpful, and not pushy at all. They delivered my bike same day and I’ve been on it every day since.  Love it!!!", "pics": null, "resp": {"time": 1597668688984, "text": "Thank you\nRide safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "100806294004957523294", "name": "Dale Lee", "time": 1602721450745, "rating": 5.0, "text": "The work on my Trek 930 was completed competently & professionally and my Bike was ready for pickup at the promised time.", "pics": null, "resp": {"time": 1612813385460, "text": "Thank you\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "112985146008630744857", "name": "Teresa Hall", "time": 1594562217468, "rating": 2.0, "text": "I visited this store on a Saturday afternoon. The service was great, and the staff was knowledgeable and friendly. Unfortunately they did not have a gravel bike in the store to fit my 5'3\" self, but found one in another store that they could bring over Tuesday or Wednesday; they took my name and number. The next weekend I called for a status check. They had overlooked getting the bike in for me, but the very friendly guy who answered the phone said he would check with the warehouse on availability and call me back in about five minutes. It's been four weeks so it's apparent they aren't interested in my business. It's a shame, I am eager to buy a quality gravel bike and no one else in town has any in stock. Very disappointed.", "pics": null, "resp": {"time": 1594678683141, "text": "Hey Teresa; I am sorry to hear about the negative experience you had at the store. I addressed the issue with the manager. He said he has made adjustments in the procedures and discussed the issue with the team to avoid similar occurrences in the future. Thank you for your feed back"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "108553079905826188458", "name": "Chris Brown", "time": 1578928945069, "rating": 5.0, "text": "Great, friendly service!  They took great care of my son and helped him make the right decision spending his birthday money.  Even gave him a free water bottle!", "pics": null, "resp": {"time": 1578992854083, "text": "Thank you!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "109208152657380684144", "name": "Nicholas Quinn", "time": 1602422653879, "rating": 5.0, "text": "Great staff, very helpful. Will most likely use again when we purchase our next Trek.", "pics": null, "resp": {"time": 1602421240048, "text": "Thank you"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "107196257983764607942", "name": "Jason Pope", "time": 1587956636342, "rating": 5.0, "text": "These friendly folks did a fine job tuning up my bike; rides like new, looks great. Will definitely be a returning customer.", "pics": null, "resp": {"time": 1588022347535, "text": "Thank you Jason"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "109985272197630330158", "name": "Jeff Blackston", "time": 1601726236422, "rating": 5.0, "text": "Awesome folks to deal with - very knowledgeable and super friendly.  Go see them for bikes,  service and gear!", "pics": null, "resp": {"time": 1598348934357, "text": "Thank you"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "109667384144830720783", "name": "Patrick Taylor", "time": 1605366488831, "rating": 5.0, "text": "Very helpful, great customer service!", "pics": null, "resp": {"time": 1612813343191, "text": "Thank you"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "117114518847293432070", "name": "Estelle Cornell", "time": 1600986228018, "rating": 5.0, "text": "Very nice and courteous and helped me out a lot", "pics": null, "resp": {"time": 1601202165618, "text": "Thank you Estelle\nRide safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "112989492894443566658", "name": "Nick Boyle", "time": 1553114664843, "rating": 5.0, "text": "The staff member Ben was extremely helpful. He took the time even when my questions and work order exceeded shop hours. He ensured I understood service and part options when getting some maintenance and service done on my bike.", "pics": null, "resp": {"time": 1553121134693, "text": "Thank You I will be sure to let Ben know\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "100437031451009191573", "name": "Robin Kurtz", "time": 1591018362041, "rating": 5.0, "text": "The folks at Trek bicycle have gone out of their way to help me. I got lessons in using an E bike and a house call on the bike got stuck in my SUV! I was referred to their store in Columbus to meet the needs of my road bike.I was turned on to a trainer for the bike and bypassed the high cost of a peloton. Nice people!", "pics": null, "resp": {"time": 1591544935305, "text": "Thank you Robin\nRide safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "114896647406454098125", "name": "Mark Grizzard", "time": 1598728964790, "rating": 4.0, "text": "Helpful staff.  Good prices.", "pics": null, "resp": {"time": 1601202094888, "text": "Thank you\nRide safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "102764440923900577238", "name": "Andy Tillman", "time": 1604798386529, "rating": 5.0, "text": "Great Bikes, Great People, Providing Great Service and Expertise!", "pics": null, "resp": {"time": 1612813354671, "text": "Thank you"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "112897168511370510291", "name": "Jimmy Bracht", "time": 1593645393313, "rating": 1.0, "text": "Tried to sell me a bunch of things I didn’t actually need yet. I was quoted $240 to get my bike rideable so I went to James Bro’s Bikes and got it done for $14.", "pics": null, "resp": {"time": 1593705288840, "text": "Hey Jimmy\nGlad to hear James Brother’s was able to get you riding, they are a good crew over there.\nRide safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "112617291723594357983", "name": "Bullish Nole", "time": 1565064677848, "rating": 5.0, "text": "Took an older Trek in for repairs. Ben the manager was very knowledgeable and helpful. They also have a great selection of newer models. I took one home. If you want to ride or need anything bike related this is the place to go!", "pics": null, "resp": {"time": 1565091649804, "text": "Thank You Joshua. I will be sure to share this with Ben\nRide Safe!!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "116750752034249849893", "name": "David Sharpton", "time": 1592839950707, "rating": 5.0, "text": "Was not happy with my previous bike shop.  Dropped in and chatted with the folks at Trek Auburn. Very pleased with my experience. Will recommend to my friends.", "pics": null, "resp": {"time": 1578992945353, "text": "Thank you"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "105970520370235356093", "name": "Josh S", "time": 1548279075762, "rating": 5.0, "text": "Ben and Rick are both fantastic and incredibly helpful. This is a clean store that does great work. Took my bike in for a tune and some repairs and they did a great job! They've become my go-to bike shop in the area.", "pics": null, "resp": {"time": 1548281164475, "text": "Thank You Josh Ride Safe!!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "108962589304258351325", "name": "Brent Wilson", "time": 1600724509451, "rating": 5.0, "text": "Great service and very fast!", "pics": null, "resp": {"time": 1601202120635, "text": "Thank you\nRide safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "112127361227699114081", "name": "Kevin Wilkinson", "time": 1549373404574, "rating": 5.0, "text": "The customer service and friendliness of the staff are top notch.  They believe in taking care of their customers.  The knowledge of the staff to guide their customer whether it be for a new bike or service of a bike is second to none.", "pics": null, "resp": {"time": 1549375121687, "text": "Thank You Kevin\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "114783938944455624721", "name": "Hunter Garris", "time": 1564601945496, "rating": 5.0, "text": "Ben was very knowledgeable and helpful. He patiently answered all of my wife’s and my questions and went above and beyond in helping us select and set up our new bikes and equipment.", "pics": null, "resp": {"time": 1564685208174, "text": "Thank you for your kind words I will be sure to share this with Ben.\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "111415527397588130202", "name": "joe best", "time": 1603572516199, "rating": 5.0, "text": "Very knowledgeable and helpful staff", "pics": null, "resp": {"time": 1612813368443, "text": "Thank you"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "113289414654917127168", "name": "Ryan Marbut", "time": 1565482835603, "rating": 5.0, "text": "From the moment I walked in the associate helped me greatly in finding the needed equipment for my bike at a reasonable price.", "pics": null, "resp": {"time": 1566926049250, "text": "That is great to hear\nThank you Ryan\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "107490122073727383542", "name": "Wendy Madison", "time": 1544472113362, "rating": 5.0, "text": "Picked up a bike we won off the radio. Ben was super nice and helped me load it. Great store and wonderful service. Thanks Ben!", "pics": null, "resp": {"time": 1544556532314, "text": "Thank you Wendy. I will be sure to past this on to Ben\nRide Safe\nRick"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "105431752196929926118", "name": "Jack Tomassetti", "time": 1559263487374, "rating": 5.0, "text": "Last Minute, day before the big Bo Bikes Bama event my crank fell off due to my mistake.  I called up Rick & Ben, and they yanked one off a showroom bike and delivered to me so I could ride the next day!  Talk about service... these guys go over and beyond to take care of their customers.   Glad these guys are in town :)", "pics": null, "resp": {"time": 1559599604859, "text": "Thank You Jack\nWe are glad we were able to help\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "115076741840475249963", "name": "Shane Jones", "time": 1555360521840, "rating": 5.0, "text": "Great Trek products and outstanding customer sales and service. Highly recommended!", "pics": null, "resp": {"time": 1555622335882, "text": "Thank You Shane\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "110690398807391978778", "name": "Zeb O'Bryant", "time": 1570065947792, "rating": 5.0, "text": "friendly staff and quality products", "pics": null, "resp": {"time": 1570732778037, "text": "Thank you Zeb  for your kind words\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "117241413071659825289", "name": "Logan and Michole Unwork to Travel", "time": 1575217157796, "rating": 5.0, "text": "Great service and great atmosphere!", "pics": null, "resp": {"time": 1575290983737, "text": "Thank you for your review\nRide safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "116901732193650915290", "name": "Andrew Hartley", "time": 1549739774336, "rating": 5.0, "text": "Rick was great!  I highly recommend this bike shop!", "pics": null, "resp": {"time": 1549760925377, "text": "Thank you Andrew\nRide Safe!!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "108368819224545018158", "name": "Brett A. Snell", "time": 1556037070471, "rating": 5.0, "text": "Good inventory and helpful staff.", "pics": null, "resp": {"time": 1556589428416, "text": "Thank you!\nRide Safe!"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "103990533578529661950", "name": "Ty Ford", "time": 1562541059519, "rating": 5.0, "text": "Great and friendly service !", "pics": null, "resp": {"time": 1562596108853, "text": "Thank you Ty\nRide Safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "100947984431611517011", "name": "Daniel Post", "time": 1555695857733, "rating": 5.0, "text": "Great service.", "pics": null, "resp": {"time": 1555798819166, "text": "Thank You Daniel\nRide safe"}, "gmap_id": "0x888cf36240fe7d81:0xbc45447be473701a"}
{"user_id": "102380658100672776025", "name": "James Adams", "time": 1620178776335, "rating": 5.0, "text": "Drove up to camp at Cheaha from Florida.  Forgot my SPD  Mt. Bike shoes. The guys found me set of flat pedals with cages so I could ride. Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "114023602152358503248", "name": "Jason White", "time": 1576262954521, "rating": 5.0, "text": "Very easy going staff and very friendly. Great service! They'll help you find exactly what you need. Just got a new Cannondale and am beyond happy with it. :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnmF54gTh2giUixLfG3i8BSgMa8nCTgg9yLuxC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "112843161581057705066", "name": "Keith Vicars", "time": 1615580699451, "rating": 5.0, "text": "Marcus is a great guy! Super friendly and great prices.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "106160442194947337649", "name": "Janie Whisenhunt", "time": 1617919103206, "rating": 5.0, "text": "The staff was not just friendly, but very knowledgeable and helpful.  I love my new bike and will suggest to anyone in the market,  to shop at Fun Wheels for the best deals 😎", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "109074031994067756716", "name": "carol fuller", "time": 1614986476965, "rating": 5.0, "text": "They did a great job fixing my bike tires, and very reasonable!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "103987850041915167133", "name": "Random Nation", "time": 1605377850652, "rating": 5.0, "text": "I love fun wheels best place to go, Jermey that works there is awesome and explained everything very well. Prices are awesome and I would definitely recommend this store to my friends. Btw the waffle house down the street is also a great place to eat the cook Kevin is funny and makes my day I eat there 4 nights a week and always his cooking.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "116952589325003485853", "name": "Matthew T", "time": 1616883782783, "rating": 5.0, "text": "Great service and selection of bikes for men and women.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "105384913919962375356", "name": "Richard Rodchester", "time": 1593639793881, "rating": 1.0, "text": "New to the area,Dove 20 minutes from Jacksonville only to find they have closed early. At the door at 4:20 pm, sign in the door says 5 pm. Would have been an easy sale for few thousand dollars. I really wanted a Santa Cruz or a Giant... looks like I’ll be spending my money at wigs wheels and getting a trek or a specialized instead. I’ll never be back", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "116195256638989434306", "name": "P H", "time": 1562464003723, "rating": 5.0, "text": "Had an excellent experience here. The staff is knowledgeable and friendly. Not pushy, won't try to sell you stuff you don't need or oversale you. Prices were already good, but there was an extra 20% off today or this week or whatever, so I got a fantastic price on everything. I travelled a little over 100 miles from Columbus, GA to shop here, and it was well worth the time and distance.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "103676634641813056204", "name": "Zach Stone", "time": 1538152741466, "rating": 5.0, "text": "Good selection. Knowledgeable. I enjoyed the experience. Installs anything you buy on your bike. Sells you what you need. Offered a helmet and I asked for a phone mount. Teaches you how the bike works so you can keep it going. Can't wait to put some miles on my new Cannondale!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "102707243237794497500", "name": "Steven Auer", "time": 1564499576361, "rating": 5.0, "text": "Awesome bike store. Great staff. Very Friendly. Very reasonable pricing.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "107577407615653729499", "name": "brannon gravlee", "time": 1546035426213, "rating": 5.0, "text": "Very Happy I drove from Birmingham to Anniston/Oxford to shop for a bike. Great service, not pushy, they just wanted to make sure I had the information I needed to buy the bike that was best for me. Like I said the service was great but the prices closed the deal.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "100699417409515204315", "name": "Susan Hinton", "time": 1544549569548, "rating": 5.0, "text": "My husband and I love our BICYCLES!!! The staff are very knowledgeable and helped us pick out what we wanted. They are so nice!!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "113846910931462532664", "name": "Anthony Adkison", "time": 1527369382434, "rating": 5.0, "text": "The owner is the nicest guy ever.  Great service area as well.  The sales staff is very up to date on bikes, riding styles and equipment.  Worth a visit.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "108116998695856839542", "name": "Frank Fletcher", "time": 1485780911390, "rating": 5.0, "text": "Very knowledgeable staff, that love the sport of mountain biking. Got the impression these guys would never steer a customer wrong on repairs or buying a new bike from them. They have some really nice Santa Cruz's in there.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "101467340042816314493", "name": "Dan Mathis", "time": 1546052727638, "rating": 5.0, "text": "Best bicycle shop!! Great prices, skilled work, wonderfully congenial. My favorite place to be a 'bike shop groupie'!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "103631851293976120716", "name": "Marcus Pettus", "time": 1595459274646, "rating": 5.0, "text": "I'm biased but I like this place!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "104748764215373134964", "name": "teresa delozier", "time": 1476315410768, "rating": 5.0, "text": "We have used Fun Wheels for years. Great and friendly service. Jimmy and Marcus will not sell you something you don't need. If you're looking for a family owned business Fun Wheels is the place to go!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "113741647857764257037", "name": "David Noah", "time": 1553963921236, "rating": 5.0, "text": "Up to date on the latest.Family like atmosphere. Great prices too!", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "103924074127554003600", "name": "Mandy Thornton", "time": 1544560198094, "rating": 5.0, "text": "Excellent prices and excellent customer service! Definitely worth stopping by for all your cycling or skateboard accessories.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "107182879783933812503", "name": "Davin Holt", "time": 1522521774002, "rating": 5.0, "text": "It is hard to find places to shop for skateboards and skate accessories, it is Even harder to find a place to find those things and want to hangout for a couple hours after buying what you need. Fun wheels not only fulfills both of these things but the prices are fair and you always walk out with a smile. 👍👌", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "111254464192184590835", "name": "Clint Wallace", "time": 1559429991543, "rating": 1.0, "text": "I got off work at 5 PM and drove 20 minutes to go to the store on a Saturday thinking they would still be open because everywhere you look says they are open till 6. Nah they were closed at 5:20. Why miss out on at least 600 dollars worth of business just to close up an hour early.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "107413439908750993899", "name": "Cecil Munroe", "time": 1519422341008, "rating": 5.0, "text": "Marcus and his Father run a first class bicycle shop! Family owned! Been a part of Oxford for years.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "100255161112581050010", "name": "Cindy Peters", "time": 1505338993079, "rating": 5.0, "text": "They Know What To Do!!  Had my bike up and rolling!!  Very reasonable priced and well stocked.  Will do all my bike shopping here because they stand behind their work and products.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "114680261451648870336", "name": "Wesley Jackson", "time": 1500322797232, "rating": 5.0, "text": "My family has used Fun Wheels since the 90's. They're the ones I'm gonna call when I need something bike related", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "101907149025368579605", "name": "Nicholas Paige", "time": 1473373424509, "rating": 5.0, "text": "Very friendly and always extremely helpful! Highly recommended over other local bike shop", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "110568385945963742279", "name": "Devin Leonard", "time": 1470929058992, "rating": 5.0, "text": "I've come here for years on and off, they always take care of you and don't nickel and dime.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "105607233090535855578", "name": "Jay Johnson", "time": 1347544245924, "rating": 4.0, "text": "Good selection on quality bikes.  Staff is helpful, very knowledgeable and most importantly kind.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "116989514315535599018", "name": "Joseph Munster", "time": 1490401435176, "rating": 5.0, "text": "Fast, dependable service along with a wealth of knowledge at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "104680268567761918595", "name": "Johnny Denson", "time": 1535829254979, "rating": 5.0, "text": "Marcus and hid Dad are Awesome!!! Love Fun Wheels!!!😎", "pics": null, "resp": null, "gmap_id": "0x888bb172c5823b01:0x2246eacacff0c6fc"}
{"user_id": "110157614931271321157", "name": "Evan Chandler", "time": 1622206996963, "rating": 5.0, "text": "Kenny was a great salesman and extremely helpful to someone ready to buy their first quality bike. I told him my budget and he laid out the options within +/- ~$200 of it, while explaining exactly what benefits each bike had and how (if I wanted to) spending a bit more would save me in the effort of upgrading down the road.\n\nI never felt pressured into going over my set limit and did not feel as though I was just dealing with someone trying to make a sale. He explained where each bike sat in performance levels and related specific components to the trails I would be riding on.\n\nHe recommended a Scott bike that was equipped with an air shock and remote lockout, both of which have been fantastic to have while out in the woods.\n\nHe also explained the current technology being used in helmets, assisting me in making the correct decision for the best protection, and even deciding on what color bottle cages/pedals would fit the bike. (\"these flat black cages will complement the graphics on the bike. Yeah! Those yellow pedals will definitely work with the paint!\")\n\nWill definitely shop at Cahaba Cycles again and will call Kenny when I'm ready to upgrade to a full suspension!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOturVQzzZEVAITeSZCcLtjKNfmJzV3xssaCif7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "103442457918835133957", "name": "Joseph Harter", "time": 1623540277954, "rating": 5.0, "text": "Top notch bike shop! I drove 170 miles from Atlanta to buy a bike from them. Everything was ready when I got there and everyone was attentive and helpful. I was made to feel like I was more than welcome and left without having any questions that needed to be asked. Brian was amazing and helped me with everything while I was there. I would not hesitate to drive back for my next purchase. Happy Trails!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "101378422977383080946", "name": "Kyle Hunter", "time": 1617654100064, "rating": 5.0, "text": "Very knowledgeable staff and Gene, specifically, was great! They also have a huge selection of bikes. Gene was patient with me and explained all the features of the different bikes I was looking at and let me try them out behind the shop. Once I made my selection, they were able to get the bike adjusted in the time it took to pick out my accessories. I am completely satisfied with my purchase and experience and would highly recommend! I drove from Nashville to find the bike I wanted and it was worth it.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "112988263958526876806", "name": "Uriel Cantu", "time": 1621107445334, "rating": 5.0, "text": "Cahaba Cycles was able to accommodate me with a super hard to find Marlin 6 when no one else could within a 200 mile radius. Additionally, they pulled the bike from the warehouse, assembled it, and had it ready for me within 4 days. Lastly, the employee was friendly and very helpful as I had to make my trip from North Florida. Super satisfied!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "118249065268593131817", "name": "Tony Bichler", "time": 1597359821583, "rating": 5.0, "text": "Great people, fantastic prices.  Totally blows BackCountry away.  they also had the best deals, give Virginia or Matt a call", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMKuJAE1JIp7eZA7Xxhlo-NMvP35-S4T4dXthnC=w150-h150-k-no-p"]}], "resp": {"time": 1597433195922, "text": "thanks Tony! Hope you're enjoying the ride!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "117444546497478014679", "name": "Sara Allbritton", "time": 1622730634554, "rating": 5.0, "text": "The whole staff at Cahaba Cycles in Cahaba Heights are like family. My sons stop in there all the time to see the employees and to inquire about bike insights. The whole staff is courteous, helpful and very knowledgeable. Mike is like the Bike Doctor!", "pics": null, "resp": {"time": 1622803645953, "text": "Thank you Sara..we always love to see y’all! We appreciate the kind words!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "109752012520238928853", "name": "Jim Crim", "time": 1621703010895, "rating": 5.0, "text": "Great service, fast, reasonable prices, friendly knowledgeable staff.  Large selection of bikes and related merchandise.  These folks know how to run a business by meeting customer needs.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "113506325171656033742", "name": "Danielle Brown", "time": 1625000888275, "rating": 5.0, "text": "Prompt, professional service. I received same day turn around and assistance in loading my bike.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "106851708074762728648", "name": "Dana D'Alessandro", "time": 1622035870112, "rating": 5.0, "text": "Great, responsive and professional staff.  Easy to work with and meet my needs.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "100687219402288112613", "name": "Will Davenport", "time": 1621512990413, "rating": 5.0, "text": "Honest recommendation on the bike for my needs.  Great people and excellent service.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "100668402356965494248", "name": "Glazell", "time": 1619875612254, "rating": 5.0, "text": "Easy, fast online transaction. Received earlier than expected. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "107949164784241035349", "name": "Reed Estes", "time": 1614377682842, "rating": 5.0, "text": "I have always had positive experiences with Cahaba Cycles, from purchasing children’s bikes to accessories, to even a cracked frame trade in. The sales and service staff have done a phenomenal job meeting my needs (worked predominantly with Mike Flowers, who knocked it out of the park).  I will definitely be back for future needs.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "117732437719630067903", "name": "Adam Wende", "time": 1617194025749, "rating": 5.0, "text": "The employee was knowledgeable and extremely helpful in repairing my daughter's bicycle.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114462333615198034100", "name": "David Link", "time": 1601498494632, "rating": 5.0, "text": "Cahaba Cycles is a superior local bike shop.  I couldn't ask for more regarding my recent purchase.  They made sure I got a bike that worked for my age and size and it fit my price target.  Their bike fitting service is worth every penny.  The most important thing is that I'm excited about getting out on the road and I know that if I have any issues, then CC has my back.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "108955672609108174773", "name": "Stan Davey", "time": 1614276455496, "rating": 5.0, "text": "This was my first service visit and Mike was very helpful. The cost was very reasonable too.", "pics": null, "resp": {"time": 1614277998351, "text": "Thank you Stan! We appreciate the opportunity!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "110006626307651643811", "name": "Justin Kirk", "time": 1591468582239, "rating": 5.0, "text": "Every Cahaba Cycles store I've ever been in deserves nothing short of 5 stars. They consistently provide exceptional customer service!\n\nThey are always willing to generously share their knowledge and answer all my questions. I highly trust Cahaba Cycles because they show integrity, give honest recommendations, and always try to make whatever it is right.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "115038664008250682545", "name": "fred clarkonlyson", "time": 1616069320322, "rating": 4.0, "text": "Competent bike technicians .Not sure they like doing business with someone who looks like me. Will try not to go back.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102643505149937102617", "name": "Caroline Sparrow", "time": 1605112997259, "rating": 5.0, "text": "Excellent advice, guidance and service from the staff at Cahaba Heights store, particularly Virginia, Sarah, Mike and Kenny. Love my Trek bikes, and love that the staff make it easy to be a loyal Cahaba Cycles customer.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "116411095641307550017", "name": "Trevor Ladner", "time": 1594309369701, "rating": 5.0, "text": "The staff here was extremely friendly and very helpful finding what I needed. I had ordered something online, and there was an issue with the order, but they helped me out kindly and quickly, and I got what I needed. Also, the store exercised proper caution with social distancing, which made me really comfortable going there in person.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102112335558068448109", "name": "Tk Bham", "time": 1607350846090, "rating": 5.0, "text": "What an awesome local bike shop.  People are so friendly, resourceful and, knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "117969899289576409612", "name": "gabe mccleave", "time": 1611233338620, "rating": 5.0, "text": "great staff. super helpful A++", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "116374022253863403279", "name": "W Brent Cook", "time": 1597247718704, "rating": 5.0, "text": "Sarah had outstanding customer service. I highly recommend her. Outstanding job helping us with our Trek Marlin 5! Job well done!!!", "pics": null, "resp": {"time": 1597433225283, "text": "Thanks Brent - Sarah says hey and thanks!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "105578265435629585233", "name": "Tina Zajch", "time": 1605736077276, "rating": 5.0, "text": "Nice product selection, great customer service, knowledgable salespeople. Already recommended.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "109403670247865491144", "name": "Jennifer Sykes", "time": 1591194984598, "rating": 5.0, "text": "Knowing the bicycle business is slammed, we expected delay on finding the right bikes for our grandsons.  Cahaba Cycle was right on with assisting us and we got lucky that they had two in stock.  I really like that they just don't just assemble and send out.  They have a quality control process to ensure assembly was handled appropriately. and that the gears and functions are as expected. Great place to do business with!", "pics": null, "resp": {"time": 1591267986694, "text": "Thanks for taking the time Jennifer .We thank your for your business. Hop the boys enjoy those bikes!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "103758764327493828296", "name": "GolfBikeJeep Repeat", "time": 1595250659181, "rating": 4.0, "text": "I had a negative experience at the Cahaba Heights location. After bringing this to the owner/manager’s attention, they quickly reached out to me and made it known they have received this complaint before and we’re actively working to correct it. Any company to address issues quickly is ok with me.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102277028979204452103", "name": "Justin Gilmore", "time": 1598114940607, "rating": 5.0, "text": "Great experience here with a Bontrager shoe warranty claim and custom bike build for a friend just getting into the sport! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "100154691487325960747", "name": "Ben Weil", "time": 1616418395761, "rating": 5.0, "text": "Great service, and very knowledgeable.", "pics": null, "resp": {"time": 1616776438736, "text": "thank you Ben! We appreciate your business!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "117858966920635625668", "name": "Brad Wingo", "time": 1592068727612, "rating": 5.0, "text": "Cahaba Cycles is great with awesome service.  We were coming through town staying with relatives on the way to the beach and one of our bikes’ brake cable almost snapped from the bike rack. Mike repaired the cable on the spot as we waited on a very busy Saturday.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "104634981308882355634", "name": "jennifer Gamble", "time": 1586391757980, "rating": 5.0, "text": "Friendly and knowledgeable employees. They really went the extra mile to put my son’s birthday present\n( bike) together in a timely manner. He loves his present!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "112355977618132322347", "name": "Wesley Slappey", "time": 1601496404827, "rating": 5.0, "text": "Only place I will ever go for bike things. Great service and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "106770345710078710142", "name": "Brian Barrett", "time": 1595873524666, "rating": 5.0, "text": "Birmingham's best Local Bike Shop. Sarah, Virginia & Ryan helped me get the stuff I needed, got my bike adjusted and ready to ride again. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114170777186879191359", "name": "Josh Firth", "time": 1601661527517, "rating": 5.0, "text": "Great customer service, helpful in finding products, and competitive prices.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "111189642995915604031", "name": "Barathi Chinnappan", "time": 1598017249832, "rating": 2.0, "text": "If you need repairs I wouldn’t go here. I took my older Trek in for a tune up. The guy was rude and barely touched it before saying it wasn’t worth fixing. I took the same bike to a shop downtown and they were very friendly and did the tune up within a week.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "100157245635456445539", "name": "Katherine Dease", "time": 1572369569772, "rating": 5.0, "text": "I love my local bike shop.  I get great service with a friendly smile.  I also love seeing the Cahaba Cycles van and technicians out on the race course for quick tune-ups.  It shows you care and are dedicated to the safety and fun of the sport.  Keep it up and we will keep supporting you.", "pics": null, "resp": {"time": 1572380767737, "text": "Thanks Kathrine! Its nice to hear some good feedback form our efforts! Appreciate your kind words."}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114798826590136637850", "name": "Andy", "time": 1603080621167, "rating": 5.0, "text": "Great bike shop! I'd definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "106161038708483354124", "name": "Kelli Hutchens", "time": 1592224673771, "rating": 5.0, "text": "Virginia was SO helpful over the phone and y’all are the only ones with 24 inch trek bikes in a Huge radius! So thankful for our random visit to Bham to see family and calling you!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "112708610594074732927", "name": "Will Slappey", "time": 1589218927206, "rating": 5.0, "text": "Staff is extremely knowledgeable and very helpful.  They have gotten me out of a pinch on multiple occasions with speedy service.", "pics": null, "resp": {"time": 1591268015653, "text": "Thank you Will!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "101597634925915249195", "name": "Betsy", "time": 1598271312235, "rating": 5.0, "text": "Friendly, knowledgeable service! Got great recs from the staff", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "110446984897989987949", "name": "John Hinson", "time": 1587162085972, "rating": 5.0, "text": "The folks at Cahaba Cycles were great!  Very friendly and made sure I was set for my ride in short order. Will go there again, soon.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "107649995320165204615", "name": "Jamorris Rivers", "time": 1578191554013, "rating": 5.0, "text": "Great staff, very helpful. Virgina was incredibly insightful with the style and look that need on the road. She even provided recommendations for accessories and places to ride. So far, I’ve been super happy with its performance and especially the service care that I’ve received from Cahaba Cycles-Cahaba Heights.", "pics": null, "resp": {"time": 1578228334454, "text": "Thank you Jamorris! We really appreciate you taking the time to give us some feedback. Thank you for the kind words. Glad we could help! Happy Riding !"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114313501573078720962", "name": "James Blumentritt", "time": 1602516699895, "rating": 5.0, "text": "Had what I wanted at a great price!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102555263394467752105", "name": "Bill Levey", "time": 1586568036005, "rating": 5.0, "text": "Prompt, professional service with curbside delivery too. A tremendous asset to our community!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "105082229495474807945", "name": "Donovan Johnson", "time": 1550017969448, "rating": 5.0, "text": "I usually don’t do reviews, but I had a great experience here. Chris was able to get me a great deal on a new Santa Cruz and I’d absolutely recommend at least considering these great folks if you’re in the market for a new bike. Great service and a friendly staff. Thank you!", "pics": null, "resp": {"time": 1551408026587, "text": "Thanks DJ - hope you're enjoying the new ride! Let us know how we can help in the future!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114547772565195178490", "name": "José Manuel", "time": 1583893170732, "rating": 5.0, "text": "The sales person give my a good tour explain diferent choices and products details. She is a nice person.", "pics": null, "resp": {"time": 1583966169809, "text": "Thanks Jose! Really appreciate you taking the time. Thanks for your business!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "109659296290799626060", "name": "Vicki Battan", "time": 1534375627936, "rating": 5.0, "text": "Great customer service. Spent extended time with me answering all of my questions. No question was too silly, especially since I am new to cycling. Got my new bike fitted to me - went above and beyond to make sure it was just right. I got everything I needed and left feeling good about my purchases (new Trek bike, new shoes) and the price.", "pics": null, "resp": {"time": 1534415349033, "text": "Welcome aboard Vicki! and Thank you for your business AND the great feedback. We hope to see you out on the bike soon!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "112139536849501969841", "name": "Sharon Bryant", "time": 1582771821892, "rating": 5.0, "text": "Excellent experience !!!  I would recommend Cahaba Cycles to anyone interested in purchasing a bike or accessories.  The staff is very friendly and knowledgeable.", "pics": null, "resp": {"time": 1582776803869, "text": "Thanks for taking the time Sharon! We really appreciate it and thank you for\nyou business!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "111329646685137592150", "name": "Neil DeWitte", "time": 1565834452677, "rating": 5.0, "text": "The employees at Cahaba Cycles in Cahaba Heights easily make this my favorite cycle shop in town. The mechanics are well-spoken, efficient, and knowledgeable; the sales staff are always willing to discuss new products and respectfully answer questions about technology that’s been around for a while. Cahaba Cycles is truly a first-class establishment.", "pics": null, "resp": {"time": 1554289991650, "text": "Thank you for the kind words Neil..very much appreciated!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "111886137464725148078", "name": "Robert Comer", "time": 1559608051417, "rating": 5.0, "text": "I took my mountain bike in to have a new fork installed. They completed the job faster than expected and even replaced a brake cable that was damaged. The customer service is always great when I visit Cahaba Cycles. If you need a bike repair, I would recommend Cahaba Cycles.", "pics": null, "resp": {"time": 1560773184044, "text": "Thanks Robert - very much appreciate your business! Faris Malki - owner"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "108335638917622875438", "name": "Mark Leo", "time": 1600261104389, "rating": 5.0, "text": "Top notch mechanics and sales.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "116203117180695167982", "name": "Matt Averett", "time": 1598193318085, "rating": 5.0, "text": "Excellent customer service!  Thanks for taking care of my son's bike so quickly!", "pics": null, "resp": {"time": 1583123705193, "text": "Glad to have the opportunity. Appreciate you taking the time for feedback! Thanks Matt!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "104030975808422049704", "name": "Joshua Williams", "time": 1564877240088, "rating": 5.0, "text": "I’ve never had a bad experience with any of the guys  or gals at Cahaba Cycles. Extra points to the crew that diagnosed / fixed the phantom frame creaks coming from my Fuel Ex 9.7 last week! Felt great to leave the trailhead yesterday on a carbon frame that didn’t sound like it was falling apart underneath me.", "pics": null, "resp": {"time": 1567218210999, "text": "Thanks for the kind words, Joshua. Hope to see you in the shop soon!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114150821650017318999", "name": "Ellen Hamilton", "time": 1576194228323, "rating": 5.0, "text": "They have a quick turn around time for bike repairs and are attentive and helpful", "pics": null, "resp": {"time": 1576278365756, "text": "Thank you Ellen. Very much appreciated. Hope to see you again soon!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "101150897352771316497", "name": "Trevor Kaple", "time": 1586561170239, "rating": 5.0, "text": "Superior customer service with top quality products.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "103942538873456472156", "name": "Ginny Smith", "time": 1552789798281, "rating": 5.0, "text": "Great experience!! Loved the sweet girl that helped us!! She was so patient with Huck our 8 year old💕 Very knowledgeable too!!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "103124694594309451627", "name": "Bryan Becker", "time": 1590781471933, "rating": 5.0, "text": "Always friendly, helpful, and looking out for the customer.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "109720827815759433623", "name": "Rachel Martinez", "time": 1537139194329, "rating": 5.0, "text": "Staff and service is great here. Sarah helped me get set up with some great gear. The fit I received was great. They greet you by name every time you come in.", "pics": null, "resp": {"time": 1537440344324, "text": "Thank you Rachel! We look forward to seeing you again soon!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "113811803129274797728", "name": "Glenn Kinstler", "time": 1554517833375, "rating": 5.0, "text": "Great staff.  I've been to Cahaba Heights and Homewood stores, and they're great (and they overlap).  Super friendly, helpful, AND THEY LISTEN!!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "112831436075050368771", "name": "Walter Berry", "time": 1551397848050, "rating": 5.0, "text": "The nicest, most knowledgeable bicycle shop I have ever been around.  They calmly take you through all of your questions....", "pics": null, "resp": {"time": 1551407795831, "text": "Thanks Walter! Very kind of you."}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "109361303454133268405", "name": "Bryan McCullar", "time": 1547167222310, "rating": 5.0, "text": "Had to order the bike I wanted.  Everyone kept me updated, by phone and email,  every step of the way.  They worked hard to help me find and buy the specific bike I wanted.This was my first Road Bike purchase.  Sarah had the guys in the back add my accessories.  John set a proper saddle height and handlebar angle.  Both were very friendly and helpful, answering all my questions.I shopped a lot of cycling shops before finding which bike and shop to choose.  You can forgo all that trouble.  For the best cycling service within 90 miles of Birmingham, go straight to Cahaba Cycles in Cahaba Heights.  There’s no reason to go anywhere else.", "pics": null, "resp": {"time": 1547478721773, "text": "Thank you Bryan! We appreciate it very much!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "106650479832617127228", "name": "Mathew M.", "time": 1564428241970, "rating": 1.0, "text": "Service dept is HORRIBLE! Bought a brand new Trek for my son. As soon as he tried it it was obvious one shifter didnt work at all and the rear derailleur was never adjusted. Tech refused to own that they didnt check it well before sending it out. Ordered shifter never called me to let me know. Installed shifter, never called me to let me know it was done. When I picked the bike up the rear tire was missing entire sections of tread and both tires have red mud on them even though my son only rode in the grass. Again, tech refuses to take ownership of the problem and points to me. Taken my bike there twice for repairs/adjustments but nothing is ever fixed. They also take over a week to receive brake pads for bikes they stock. Why on earth do you not stock such a common part? Service guys cannot handle a task as simple as documenting my phone number. I had to chase them around. Will never do business with them again. Wish there was a zero star option.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "100828313876967779189", "name": "Abraham Schuster", "time": 1567197274531, "rating": 5.0, "text": "Farris , Sarah, and their team treat you like family.  Relationships, expertise, and service are required to survive in an “online” world.  Cahaba cycles will thrive .", "pics": null, "resp": {"time": 1567218160111, "text": "Thanks Abe - and thank you for all your business over the years! Its always a pleasure!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "117387932325774652184", "name": "Wes Burton", "time": 1563549813036, "rating": 5.0, "text": "The team at Cahaba Cycles is very knowledgable about their products and highly focused on customer service.", "pics": null, "resp": {"time": 1563561267320, "text": "Thanks for the kind words Wes! We appreciate your business!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102027187167337286118", "name": "Stephen Hayes", "time": 1500910089158, "rating": 5.0, "text": "Gotta love this shop.  Great selection in inventory. If they don't have it, they will get it for you.  The staff cannot be beat.  They all know their stuff and genuinely want you to have as much fun on a bike as they do", "pics": null, "resp": {"time": 1530049450516, "text": "Thanks for the kinds words, Stephen!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "101597728387136788292", "name": "Brad Roberson", "time": 1512046754297, "rating": 5.0, "text": "These guys are awesome! As soon as I walked through the door Joe and Sarah greeted me with a smile  and I felt like everyone went above and beyond the call of duty to make sure that I felt like a family member there. They took the time to talk with me about a bike that I didn’t even buy from them, but were kind to me and very knowledgeable about my bike. I had a difficult situation on the bike I had purchased, but there mechanics dove right in and accepted the challenge. They were very reasonable ok their prices and again their service was superb! Thank you so much to the whole staff at Cahaba Cycles in Cahaba Heights!!! You guys ROCK!!!", "pics": null, "resp": {"time": 1530049419404, "text": "Thanks Brad - we appreciate you!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "112393127618055827816", "name": "Ken Harper", "time": 1581549484285, "rating": 5.0, "text": "Very professional and friendly.  I drive over 4 hours one way to get service at Cahaba Heights.", "pics": null, "resp": {"time": 1582776839628, "text": "Thanks Ken - very much\nappreciated!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "103946310018241443992", "name": "Matthew Colson", "time": 1486421519102, "rating": 5.0, "text": "Some of the best customer service I've encountered. I'm buying some used bikes for me and my wife bc we are intermediate riders and the staff has been phenomenal in helping me find the right bikes and educating me. 1000% recommend.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "111297878747780050938", "name": "Stanley Holditch", "time": 1556660225712, "rating": 5.0, "text": "Friendly staff and great prices", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "118329430300887716512", "name": "Robert Lane", "time": 1522277620148, "rating": 5.0, "text": "I’ve beento two of their locations and felt very welcomed at both. Great customer service.", "pics": null, "resp": {"time": 1530049378062, "text": "Thanks Robert - stop in and see us again soon!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "110768696363474430595", "name": "Todd Quire", "time": 1535213616425, "rating": 5.0, "text": "Great place always friendly and helpful staff also convenient when I'm in bham or trussville", "pics": null, "resp": {"time": 1537440413905, "text": "Glad we could help Todd! See you soon..."}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "117925691180365188765", "name": "David Phillips", "time": 1494249672280, "rating": 5.0, "text": "Got me in on short notice to fix shifting problems on a Di2. My bike has never shifted better! I drive from the Montgomery area to come here and it is worth the extra effort. Thanks Again to the entire staff.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114833628422130765787", "name": "Martín Moya", "time": 1550018981280, "rating": 5.0, "text": "Very helpful staff, big inventory, highly recommend!", "pics": null, "resp": {"time": 1551407979506, "text": "Thanks Martin - appreciate you taking the time!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "104246493768844360544", "name": "Samuel Solliday", "time": 1455377810034, "rating": 5.0, "text": "I love Cahaba Cycles they always treat me right with service bikes sales and they are always very friendly.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "104162722737104335663", "name": "BruceQC Hamilton", "time": 1608474722796, "rating": 5.0, "text": "The service department went above and beyond to get my bike back on the trails. It was much appreciated.", "pics": null, "resp": {"time": 1532866769595, "text": "Thank you for the feedback Bruce! We really appreciate it! Hope to see you out on the trails!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "111356079390615838042", "name": "The real Buster", "time": 1571246871591, "rating": 5.0, "text": "Always helpful, the folks at Cahaba are the best!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102529056326264976893", "name": "roxas the rogue", "time": 1452482795996, "rating": 4.0, "text": "Staff is just amazing, all very friendly, but prices are little high when getting repairs.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "105373167391060765287", "name": "Cheesegnarfle", "time": 1591734865426, "rating": 5.0, "text": "People are nice", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "110024924097553965184", "name": "lineacademy", "time": 1576482474163, "rating": 5.0, "text": "Cahaba Cycle wrote the book on customer service.", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "110522424818590428688", "name": "Elliott Pike", "time": 1486921760271, "rating": 5.0, "text": "Knowledgeable staff, good selections, great value!", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "111444871762869552127", "name": "Fernando Garza", "time": 1539249485635, "rating": 5.0, "text": "Very knowledgeable and friendly team.", "pics": null, "resp": {"time": 1539257832238, "text": "Hello Fernando! Thanks for the compliment. We appreciate you!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "101306577829607975122", "name": "Bart Combs", "time": 1554080098122, "rating": 5.0, "text": "always friendly, always helpful, very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "113311373043103294146", "name": "Ann Pierce", "time": 1568251007930, "rating": 5.0, "text": "Cahaba Cycles is the best!", "pics": null, "resp": {"time": 1568286125744, "text": "Thank you Ann!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "105393852931403156868", "name": "Paul Kinsella", "time": 1535238906421, "rating": 5.0, "text": "Friendly and knowledgeable staff.", "pics": null, "resp": {"time": 1537440373257, "text": "Thank you Paul!"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "115378232697695077768", "name": "Fred D", "time": 1574644713668, "rating": 5.0, "text": "excellent", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "104309543144785046621", "name": "Chad Hathorne", "time": 1539732665608, "rating": 5.0, "text": "Professional and helpful", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "114672241869108402360", "name": "Racolene Rogers", "time": 1545964727518, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "105382793254373343207", "name": "Jeffrey Florio", "time": 1503773325336, "rating": 1.0, "text": "They do not purchase used bikes as advertised on their website. Only exchange.", "pics": null, "resp": {"time": 1511873169558, "text": "Hi Jeffrey..We do purchase bikes as advertised. However, we only purchase those that fit our needs and requirements at that time. It is probable that the bike you brought by was not one that we were interested in purchasing. My apologies for any confusion."}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "102760681873446181435", "name": "Yung Cherry", "time": 1482776773668, "rating": 1.0, "text": "Website said the place was open, drove a whole hour and half out of my way just to find out they are closed the entire week, so thanks, won't be making my way back.", "pics": null, "resp": {"time": 1530049619599, "text": "Dear Krunch - There must be some confusion here. The only day we ever close at this location is on Sundays, and 4 holidays (Christmas, Thanksgiving, 4th of July, and New Years) We have NEVER closed for an entire week, or even 2 days in a row for that matter. Please try us again. Our hours are posted on our website..www.cahabacycles.com"}, "gmap_id": "0x888917650a5c120f:0x30611142408795ed"}
{"user_id": "104162722737104335663", "name": "BruceQC Hamilton", "time": 1617490186761, "rating": 5.0, "text": "Bike for sale very reasonable. Receives donations of used bikes. Refurbished bikes are sold. Non profit that donates bikes to kids in need.", "pics": null, "resp": null, "gmap_id": "0x88891be81f48ea65:0x2b2bdc597812cb0d"}
{"user_id": "104538791071549824332", "name": "Brady Wilson", "time": 1612034641869, "rating": 5.0, "text": "CALL FOR AN APPOINTMENT!  Mr. Doug Brown is the best!", "pics": null, "resp": null, "gmap_id": "0x88891be81f48ea65:0x2b2bdc597812cb0d"}
{"user_id": "103744404066101204509", "name": "Brian Wood", "time": 1613068615820, "rating": 5.0, "text": "These guys are great and make you feel extremely welcome. Very helpful and super knowledgeable. If they don’t have it they will order it for you and make sure you get what you need. The prices are very fair and the shop is super nice too. I highly recommend stopping by. Way better than the other shops in town!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6_Sr37R_FgQBRIwm9i-AlvPD5TkPgMYYM985k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRSfwocA4GVuyh0lE7f10O7naxaO8r1Ht6pSYx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "106408768361101792065", "name": "Luke Caldwell", "time": 1615116574410, "rating": 5.0, "text": "I couldn't recommend a better bike shop in the Auburn area. Eddie is a super nice guy and loves to make sure you are getting what you need. And Raleigh is a class-act mechanic. There's not another person I trust with my bike more. These guys really care about their customers and want them to be able to enjoy riding their bikes because that is what it's all about.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "101305661586293359963", "name": "Josh Cissell", "time": 1618680817791, "rating": 5.0, "text": "Awesome shop! Everyone inside was very helpful. Tons of great gear. I was in town for a NICA race and had an emergency repair. They took care of me asap.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "107704983518735584669", "name": "Jin Elkins", "time": 1620505750042, "rating": 5.0, "text": "Always helpful. Great selection of bikes and parts.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "105323156060154697909", "name": "daniel butler", "time": 1609877708933, "rating": 5.0, "text": "James Bros....Well Done.  On a five point scale, you all earn a six.\n\nAfter all these years, I thought it important to write down how wonderful these folks are and what an awesome bike shop they have.  The Auburn area is most fortunate to have this asset in our community.\n\nI purchased my first mountain bike 5 years ago from James Bros when they were still located in the bank building.  Although a novice at the beginning, I was helped to find a bike that would meet my needs.  I was not oversold.  I was fitted both in terms of how I would ride, my budget and my overall enjoyment with the sport of trail / mountain biking.\n\nWell three bikes later, two for my daughter and one more for me, and I am still extremely satisfied with everything the team does for me and my daughter.  I have upgraded to soft tails and happy I have done so.  James Bros does an excellent job of keeping my bike(s) operating safely.  I cannot stress the term \"safely\" enough.  If you have loose or worn out parts, you are putting your life in jeopardy on the trials in the area.  The staff at James Bros makes sure everything that goes out the door is ready to ride - safely.\n\nEddie and Raleigh offer sound, professional advice.  They do NOT try to sell you something you do not need.  They DO make sure what you ride is safe and enjoyable.  They listen to you.  Really listen.  They find price points and products to fit your needs.  James Bros does not sell \"cheap\" products.  They offer solid value for the money for quality bikes and service.  If you need something they do not have in stock, they will find it.  They will service it.  They will back it up every time.\n\nOne example of how they help.   I needed a locking device for my new soft tail.  Eddie could have easily sold me what was in stock or even ordered a cable set.  However, that is not really what I needed.  So, he  suggested going a big box building store - Lowes - get a long length of plastic coated cable, a good lock and make the custom cable I needed for transporting and storing the bike in my truck.  Problem solved.  And he did it knowing he could have sold me a short cable set that would NOT have met my needs.\n\nEach time I stop by, I am greeted as if I were an old friend.  That is how they treat everyone.  I would like to think I am special.  Perhaps.  But they treat everyone as an old special friend.   There has been more than one time when I have arrived near closing time when the team went ahead, took the bike in, and had it serviced before the end of the next day.  Eddie even came in when the shop was technically closed to help me with a part that was misbehaving.\n\nOverall, I want to make sure folks know James Bros is a well respected bike shop.  If you need something, they will find it and help you with it.  Regardless of your skill or budget, James Bros will work with and for you.\nThank you for many years of a happy biking.\n\nSincerely,\nDanny Butler", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "111986293776593717096", "name": "Erica Zacek", "time": 1581382759774, "rating": 5.0, "text": "Helpful staff, good rental selection, good shop swag to browse. I was around for one weekend day in January and was thankful for the shop. Chewacla is a gem to have in their backyard.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOzate9mhYSZM-7JjL56xV1nFN52ORzLxDNniV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNA6ROsRlOg_zWvvHoF0ONhzR2CMcgG5NY5qlDM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "117968748160839007420", "name": "Mike Lunsford", "time": 1601748814626, "rating": 5.0, "text": "I highly recommend James Brothers Bikes in Auburn! Cameron and the owner Eddie were very knowledgeable and helpful. They weren't pushy like some places you go too. I will definitely buy from them again.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "117842428247147204568", "name": "John W", "time": 1607454078019, "rating": 5.0, "text": "Favorite bike shop! Highly recommend! Buy from here...very professional.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOU1jFGT76WlxvJ8PkhDVipkEb7Fq6r90Tk79OX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "102027187167337286118", "name": "Stephen Hayes", "time": 1500910916314, "rating": 5.0, "text": "Awesome shop.  I was visiting one weekend and my bike was in the shop but I wanted to ride Chewacla.  The staff was great - they set me up on a nice rental, told me all I needed to know about the trails and also had a good talk about some new bikes when I got back.  Great guys.  My rental was only for 6 hours but they treated it like I was buying the bike making sure it was setup perfectly for me in every aspect. That is quality service...\n\nAlso, the shop was very well stocked - especially considering it is in a smaller town. I'm impressed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ-NM5URtC1UdNVbJObRmJuyN4cPxFtyq1i3Bw=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "110152245725721097813", "name": "Philip Faris", "time": 1550982799448, "rating": 5.0, "text": "A+, 5 star, absolutely fantastic bike shop! I was in Auburn for a bike race and needed a quick repair to keep my bike going through the weekend. I arrived at the shop about 30 minutes before they closed to get it fixed and the entire staff was open and willing to help me out. They made sure my bike was taken care of and fixed properly. A big shout out to Raleigh, one of the members on staff, for being extra helpful and making sure everything was taken care of. I highly recommend this bike shop!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "111930910660253748904", "name": "Russell Suther", "time": 1588992994605, "rating": 5.0, "text": "Could not have found a better bike shop anywhere, staff was very helpful and not pushy in helping me find an outstanding bike for my grandson.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "117428670977347678623", "name": "Joe Allen Dickerson", "time": 1574724506432, "rating": 5.0, "text": "The entire team at James Bros Bikes are incredibly helpful! I've gotten my bikes maintenanced here, and they will give you a quote and even places that are need work. They even offer texting as an option for contact! Their technicians operate quickly and can offer incredible advice on what to ride and how to maintain your bike as you ride. There's plenty of room to park and it's easy to find from the road.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "117465792848664176689", "name": "Bruno Ulrich", "time": 1543433324328, "rating": 5.0, "text": "Been working with James Brothers Bike for over four years re maintenance on my two bikes.  I've never been disappointed in the quality of service, nor regarding their advise with respect to accessories. Danny and Amanda's integrity is above reproach.  I always feel welcomed, as has anyone I've ever seen enter the store.  I highly recommend customers visit their two stores; and, yes, staff at both the Auburn and Opelika make you feel just as welcomed as Amanda and Danny, and offer their advise with expertise be it road, travel, or mountain bikes.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "115956543474701938500", "name": "Randall Plaisance", "time": 1543005590815, "rating": 5.0, "text": "I usually have an idea of what I want - but Danny helps me figure it out exactly.  Then his crew makes everything fast and easy.  Quick set ups and quick high quality service.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "103956619579573150667", "name": "Christopher McGrath", "time": 1527374519127, "rating": 5.0, "text": "They repaired my 21 speed townie in the time frame they promised. They had convenient Saturday hours  and they are open until 6 most weekdays. The price was reasonable, the people were polite, the work was fast.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "107720420922310352596", "name": "Tiger Limo", "time": 1581622437216, "rating": 5.0, "text": "Great customer service. Will pair you up work what you want.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "114424403109146234866", "name": "William Pavelec", "time": 1553535044194, "rating": 5.0, "text": "A great place for knowledgeable people, who really go above and beyond, to take care of your needs. A real pleasure to do business with!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "117535763437959281849", "name": "William Brawner", "time": 1410021574493, "rating": 5.0, "text": "Great place to buy a bike.  Danny and the staff are helpful and knowledgeable.  Very patient with all my questions.  They offered a large selection of bikes and never came across as pushy with their recommendations.  Once I decided on a bike they got it ordered and ready to go quickly and when I picked it up all the accessories I had requested were already installed on the bike.  And I got the bike for a very fair price as well.  Highly recommend these guys.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "102471196185097994955", "name": "Chris Cochrane", "time": 1445006692108, "rating": 5.0, "text": "WOW... I was looking for a great relationship out of a bike shop and, I finally found one!  It's hard to find that 'feel' that your business is appreciated. We're new to cycling and, it's a perfect way to exercise as I recover through paralysis and such. We live in Florida, but as Auburn grads, my wife and myself spend a lot of time in Auburn visiting my mother.  We decided to check it out and, we're very glad that we did! You won't be disappointed!\n\nThese guys HAVE to be commended on the personal service helping a handicapped man and his family. For instance, as I already mentioned being cycling newbies, we needed to find a car carrying method easy for us with my limitations and, find a specific trailer hitch/bike carrier that my wife can easily use without help.  A couple of phone calls later... the 'Hollywood Sport Rider' fit our needs perfectly and, showed up in two days! When we came-in to pick it up, they had ALREADY ASSEMBLED it for us!!  The thing is like a jigsaw puzzle! They didn't charge us to assemble it AND, the company is big on giving to the Active Duty a Military discount... I wish more American shops/stores/services etc., embrace the James Bros Bikes business model.  Thank you so much guys!  Can't wait until the next time! Cheers!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "115494955383167209450", "name": "Shawn Wheeler", "time": 1536691602293, "rating": 5.0, "text": "Very knowledgable and friendly, great products and good prices. Just bought my first 29'er from them and couldn't be happier, look forward to doing business with them again.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "113001109831257403436", "name": "Keith Thompson", "time": 1462547903920, "rating": 5.0, "text": "James Bros. is the best!  Awesome service and great people. I will always do my biking business with James Bros.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "103754184482978612514", "name": "Noah Triplett", "time": 1412372158929, "rating": 5.0, "text": "Nice shop, everybody was friendly and helpful.  All employees were very nice. Will make more purchases soon.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "115325294755530497060", "name": "David Mackinnon", "time": 1432599617088, "rating": 5.0, "text": "We stopped by this shop during our trip out of town from South Florida.  We were mountain biking in Chewacla Park for Memorial weekend.  We dealt with Danny James and the service and attention to detail was awesome.  We had a beginner without a bike with us and had to rent one,  normally the rentals would be for 24 hours but since they wouldn't be open the following day we would have needed to get the bike back to the shop before closing (4pm) Danny went out of his way to get our contact information and personally pick up the bike from us the following day so that our beginner could really get a good chance to enjoy the trails.  He also took the time to point out great trails and sites we should see before we depart.  When we got the bike he took the extra time to fit the bike to our rider and make sure the shocks and tires all had the correct pressures.  I've rented bikes from other shops and have yet seen anyone else take this extra time and effort.  Any time I'm in the area you can bet on me returning to this shop for my needs.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "102842347528857544289", "name": "Ronald Shaw", "time": 1415120023652, "rating": 5.0, "text": "This is my bike shop of choice. The staff is super and the products are quality. I may look at bikes in other stores but when I am ready to make a purchase, you will find me at James Brothers!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "107168189750771883916", "name": "Darren Berry", "time": 1547932510803, "rating": 5.0, "text": "Good service and nice courteous staff.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "112949585083352871575", "name": "Caroline Donnelly", "time": 1441246912060, "rating": 5.0, "text": "Took our Surly Trolls in to have new chains installed and a general safety check. Taylor did a fantastic job . We love James Brothers bikes and wouldn't go anywhere else . Super service and always with a smile.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "113198760678382028923", "name": "Randall Marshall", "time": 1531515065568, "rating": 5.0, "text": "Excellent service and selection. Wouldn't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "100203000331916479129", "name": "Carter Brown", "time": 1523125465219, "rating": 5.0, "text": "Great service and selection. Best bike shop around.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "105442051813170676789", "name": "thomas colbert", "time": 1514489182191, "rating": 5.0, "text": "Very helpful in finding parts I needed! Best bike shop in Auburn!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "103771519792758218109", "name": "Sam Bartlett", "time": 1447360995608, "rating": 5.0, "text": "Great store, very helpful and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "108076312145682004307", "name": "Allen Adams", "time": 1515944993366, "rating": 5.0, "text": "Great local bike shop!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "104536960467872578810", "name": "Kendall Simmons", "time": 1458586802289, "rating": 5.0, "text": "2nd to none!", "pics": null, "resp": null, "gmap_id": "0x888cf3957860c0f1:0x11d9dc83b7f994c3"}
{"user_id": "102786521465130414897", "name": "Kristin Deaton", "time": 1624285556865, "rating": 5.0, "text": "Y’all rocked it! I called the day before to make sure they had the bike I wanted. They answered my questions. When I came in they made sure the bike was in perfect working order for my son!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110809734806650245699", "name": "Jean Beaumont", "time": 1584746498557, "rating": 5.0, "text": "Nice experience .., we came from Quebec and Bicycle Cove provided us with new Trek Bikes that we rented after booking them from Canada ..., Really Satisfied ...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-XZSbV7INpwF4m9DsXq79aUE0B-T9WqkE1Fa1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "112091844668835916907", "name": "Brian Miller", "time": 1615412614226, "rating": 5.0, "text": "Our family has always had a positive experience.  Staff is very knowledgeable and always friendly.  They consistently go out of their way to make it right.  And, they have put on great little seminars for the local youth on bike maintenance for both the NICA team youth, as well as the Boy Scouts that I have seen first hand.  Great to have them in our neighborhood!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "112423379991756943730", "name": "Cheryl Barnes", "time": 1615592353167, "rating": 5.0, "text": "Excellent bike shop. The staff is very knowledgeable and always willing to go the”extra mile” to help me. I have bought several bikes here and recommend them👍👍", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109399715876579102378", "name": "Rebecca Dotson", "time": 1568503819077, "rating": 5.0, "text": "Great service.  We have bought all our bikes here and had them all serviced continuously here.  Friendly and very knowledgeable staff.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNI1-j4sm0Hzug984TVW4iMVVjj4DphRhF8cVWy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "100946269410036575523", "name": "Clint (Radiozombie)", "time": 1623330248921, "rating": 5.0, "text": "Was greeted at the door by happy helpful and friendly staff. Dropped off bikes for service and picked up some parts for a DIY project at the house.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "112028134515311621683", "name": "Mic Roa", "time": 1613367972129, "rating": 2.0, "text": "Placed an order for a bike. There was an error on the invoice (size should have been medium instead of large) that I pointed out to the employee who took my order. I was assured it would get fixed. Time passes and I get a call from the store telling me that the bike is ready for pickup. Arrived at the store to quickly realize the error never got fixed. The bike size was incorrect.\n\nThe store did however try and reorder the correct size bike several times but was damaged (no fault of Bicycle Cove) intransit.\n\nWill look elsewhere because of the invoice error debacle.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111754708950139281103", "name": "Mike Hoger", "time": 1620964644306, "rating": 5.0, "text": "Quick,friendly, expert service department with reasonable prices!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "106777723277922922990", "name": "Steve Holland", "time": 1613258832659, "rating": 5.0, "text": "Good customer service but today....... They went even further and hosted 2 sessions of bike maintenance for middle and high school kids on the local NICA race teams.  Basic to more advanced skills for the high schoolers.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "117135311118487058904", "name": "Ed Santiago", "time": 1616208690724, "rating": 5.0, "text": "It is my shop to go for bike maintenance and fixing.  Also, Chris is amazing doing g bike Fiting", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "103590212937293085767", "name": "J Mc", "time": 1613442440086, "rating": 4.0, "text": "We have bought many things from Bicycle Cove, both before and since the pandemic. We'll always shop here, although it's a little troubling that they really only sell one brand of mountain bike (Trek). Ruth, Tom and the crew are awesome.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "102352745483916750354", "name": "Julie Satterfeal", "time": 1615813282847, "rating": 5.0, "text": "This was the easiest purchase I have ever made, and walked away with the perfect bicycle for me!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "104115085259960969061", "name": "Travis Willis", "time": 1601788220448, "rating": 5.0, "text": "What I like and appreciate was that it didn't take long for my bike to arrive, for it was already on pre-order.  The staff was professional and knowledgeable. I haven't bought a bike in years and enjoyed the experience and still. The facility was nice and clean and safe. I look forward to getting my next bike from them as well.  Thanks", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109728250264758732395", "name": "Richard Wegrich", "time": 1616413641026, "rating": 5.0, "text": "Found exactly the bike I was looking for, and they had it built the same day. Great staff, very friendly and knowledgeable about the different bikes and options.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "118317546970460488169", "name": "Hunter Pearson", "time": 1607363531600, "rating": 5.0, "text": "Great service!  I can always count on these guys to get my bikes back up running in tip top shape.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109629375783350599813", "name": "Richard LeVan", "time": 1605364737449, "rating": 5.0, "text": "Really enjoyed my first experience with bike cove.  Ended up ordering a bike and some accessories while I was at it.  Also bought some parts to keep my old bike going until the new one gets in.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "107149701075778523402", "name": "Christy Price", "time": 1606343658904, "rating": 5.0, "text": "Nice people every time I've been there. Wasn't expecting my bike to be tuned while I waited. I was glad I didn't have to drive 45mins home and then back to pick it up.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "102410858802725880180", "name": "Bianca Walker", "time": 1606436157347, "rating": 5.0, "text": "Great customer service, everyone is always very polite and courteous. Bike Service is always been done in a timely manner!! We’ll be back for sure!!!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "102627364337483172842", "name": "Jim McEuen", "time": 1611888940922, "rating": 5.0, "text": "Customer service and expertise setting up my new bicycle was great.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "100808889974220094819", "name": "Mary Knight", "time": 1594085285625, "rating": 5.0, "text": "Really liked the personal attention.  Kudos to Bicycle Cove for letting me pick up my bike after closing.  I’m really glad I chose Bicycle Cove to do my bicycle business with.  Thanks to Ruth for putting my repair bag together for those just in case moments.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116058455676674756188", "name": "Julie Heflin", "time": 1622220345757, "rating": 5.0, "text": "Great folks and thorough service!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "115332665166229187772", "name": "karl stine", "time": 1619921594047, "rating": 5.0, "text": "Very excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "106011436673457128025", "name": "Harry Greenbaum", "time": 1589310279598, "rating": 5.0, "text": "They have been absolutely buried during quarantine, but still providing excellent service.  A couple weeks ago the Hampton Cove location gave me a great deal on a previously owned, but like new, Trek that has been the perfect first bike for my son.  The Madison location sold me a great Trek hybrid today that is my first new bike since college.  Very thankful they are open providing us with a great activity during Covid-19 life that I know we will continue to enjoy for years to come!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "100872905729610403847", "name": "Bobby Allen", "time": 1605731492912, "rating": 5.0, "text": "Always helpful and knowledgeable! The best Trek dealer around.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110970469583216806713", "name": "Robert Handford", "time": 1600707940348, "rating": 4.0, "text": "A few days ago I gave Bicycle Cove a bad review based on my experience with service scheduling and the price of a pair of gloves. After I posted my review, I expressed my concern in person and Chris immediately apologized and discounted the price on the gloves. I'm totally satisfied now.  Thanks very much!!!", "pics": null, "resp": {"time": 1600013348880, "text": "Robert,\n\nThis is hugely disappointing.  I thought I had made things right on Friday when you came into the store.  I explained that product pricing and labeling happens at Trek.  However, there are times when Trek changes prices or puts things on sale without our knowledge.  Because of this we always happily match prices on trekbikes.com. In your case, I applied the difference in what you paid to your service estimate, You assured me this was acceptable, and mistakes happen sometimes..  I do, however, understand unmet expectations concerning the estimate for your bike service is frustrating. I'm sorry it took longer than we communicated.\n\nThanks,\nChris"}, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "104053631369563408291", "name": "Steve Drake", "time": 1601157756894, "rating": 5.0, "text": "Tom and crew take great care of our bikes, ensuring that they're always in tip-top shape.  Everyone in the shop is super-friendly and anxious to ensure that we have everything we need to ensure an outstanding biking experience.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "115036212154508319279", "name": "Ingrid Davis", "time": 1594085233079, "rating": 5.0, "text": "Great service, great selection and great prices!! Everything you want in a bike shop. The staff is really courteous and helpful and will walk you through whatever you may need.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111990891957460220087", "name": "Collene Underwood", "time": 1585358948339, "rating": 5.0, "text": "Really the best place to go for all your bike needs. Chris was so nice and helpful with fitting/ fixing/ and explaining my bike to me. He broke everything down simply and made me feel so comfortable... (even with my little knowledge of riding). He took the time to help me based on my goals and current needs with no pressure or upselling. It's just very clear the people who work here really enjoy what they do. I will go here for all my future needs.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "113246051388175454748", "name": "Geo Ritt", "time": 1612178547071, "rating": 5.0, "text": "Great service, reasonable price!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "100387090287804679966", "name": "Ford Adams", "time": 1601051406972, "rating": 2.0, "text": "I called to ask about tandem bicycles. The lady who answered the phone gave me a brief description of the one they sell, although they're not currently in stock. She then directed me to go online to look at them (fair enough, I suppose). I then asked her if she could ballpark the price on one, and she said she couldn't, and then directed me online to look at the price. Lady, if I wanted to go look everything up online myself, then I would just order it online myself! The whole reason I called was to get the service of a local business, and, in return, to spend my money with a local business!\n\nI'm giving 2 stars instead of one, because they answered the phone.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "104801513383892208216", "name": "John Bryson", "time": 1605898848603, "rating": 5.0, "text": "Outstanding customer service and product; love my TREK since 1987!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "118050249585712961585", "name": "Ben Nemec", "time": 1607524493778, "rating": 5.0, "text": "Great service and communication. Professional and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "103938071910809872442", "name": "Robert Handford", "time": 1600275071091, "rating": 4.0, "text": "A few days ago I gave Bicycle Cove a bad review based on my experience with service scheduling and the price of a pair of gloves.  When I expressed my concern in person after I posted the review, they made up for the issues and I'm totally satisfied now.  Thanks very much!!!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110594296810497919232", "name": "Frances Graham", "time": 1580344747331, "rating": 5.0, "text": "I can't say enough nice things about Bicycle Cove. We were in need of a sturdier bike rack for an upcoming trip.  Ruth Marie Oliver was super helpful and knowledgeable and helped us get fitted with an appropriate rack at the last minute. She went totally out of her way to help us near closing time just before we were due to go out of town. Thanks again!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110688319285589261112", "name": "Ana Isabel Da Silva", "time": 1609182320150, "rating": 5.0, "text": "They have great quality bikes and customer service!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "105580230063966091081", "name": "Michael Vinson", "time": 1595018845741, "rating": 5.0, "text": "Great shop. Staff is knowledgeable and they have competitive prices. There is a repair shop one site too.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "104303784271527466183", "name": "Lorin Jackson", "time": 1595033005072, "rating": 5.0, "text": "There’s nothing like a local bike shop! Everyone that I had the pleasure of speaking to throughout my bicycle search and purchase was extremely patient, helpful, and knowledgable!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109223999688970650636", "name": "Orrin Coufal", "time": 1591922451728, "rating": 1.0, "text": "Took my new bike to Bicycle Cove because they wouldn’t have me a price over the phone to look over my bike, torque stuff down, and make sure it’s safe. That’s fine. Somewhat understandable since they don’t know what all will be involved. The mechanic comes out and was a little rude to be honest. It was like he was being inconvenienced. Still couldn’t give me a quote but took my name and number and said they would call the following day. I finally get a call a few days later but they were looking for someone else. I explain that I am waiting for a call and she says okay and hangs up. So I went to Trailhead and got everything I needed done for less than it would have cost to have the wheels trued at Bicycle Cove. Trailhead is great. Bicycle Cove, not so much.", "pics": null, "resp": {"time": 1592558615818, "text": "Orrin,\n\nTo say I’m mortified by what happened in my store is a gross understatement.  I’m super embarrassed for lots of reasons.  However, the key reason is I’m the tech who spoke with you, and I’m on the owner.  My behavior and performance sets the tone for the rest of the store.  I can assure you what happened is far from the norm, and I completely understand why you are so disappointed by your experience!   What happened  to you falls under human error. When your information was put in to the work order list the wrong status was selected.  So, this whole time the techs thought we were waiting on you to bring the bike instead of you waiting on us for a phone call.  How embarrassing!\n\nI know there are a lot of choices for bike shops in the area, and I’m grateful you were able to get what you needed done at Trailhead.  Tommy and his crew are great people.\n\nI’m super hopeful you will be willing to give us a second chance.\n\nThank you so much for your feedack!"}, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109904492794549418122", "name": "Sabrina Stedman", "time": 1585964298347, "rating": 5.0, "text": "I really enjoyed working with the Cove Monte Sano location on bicycle selection, fitting and outfitting my new bike. We were able to complete my purchase safely and respectfully with regards to quarantine guidelines. Thank you! See you on the mountain or at one of the triathlon events!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110839474749283621499", "name": "Ashley Collins", "time": 1593654880139, "rating": 5.0, "text": "Great experience working with knowledgeable and helpful staff even during these crazy times!! So excited for the new adventures I will find riding my new bike!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116059753806489540986", "name": "Regan Christian", "time": 1592851127833, "rating": 5.0, "text": "Good selection and helpful, knowledgeable staff. I have not had service done on a bike there yet.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "107755292616093168626", "name": "Thomas Kennedy", "time": 1571431301710, "rating": 5.0, "text": "I really like having them work on my bicycle. The location is convenient. They are helpful and friendly. They’ve always done a good job and I trust them.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "113347325942927003664", "name": "Wayne Alvis", "time": 1599858607880, "rating": 5.0, "text": "Shopped here for 7 years. Best customer service ever!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111137572955312572547", "name": "Adrian Owen", "time": 1560644268033, "rating": 5.0, "text": "Awesome bike fit from Chris. I had been wanting to get this done for awhile now & the experience did not disappoint! It truly feels like i’m riding a different bike. I drove 1.5 hours and will definitely be back. Everyone I met was helpful & knowledgeable. Great place!!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "113309069044877347737", "name": "Darrel White", "time": 1595528797702, "rating": 5.0, "text": "Very friendly and knowledgeable staff! We can't wait to join them for events!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "117767006584625663797", "name": "gerald brackett", "time": 1564022998229, "rating": 5.0, "text": "Great experience in Hampton Cove (Brownsboro) store. Just wanted to say thanks to Chris, Ruth, and Tommy for all of the hard work and extra time that was put into ordering, reordering, re-shipping, and building my P1 dream bike. Great store....great people. Best bike shop in the state. We are lucky to have this place in Huntsville!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "102669030455547236122", "name": "MH", "time": 1583544909561, "rating": 5.0, "text": "Friendly and knowledgeable! Had my bike in for tuneup and tire replacement! Will use them again.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "101973531620734388269", "name": "Jim Morris", "time": 1564701603720, "rating": 5.0, "text": "I recently bought a very nice Trek bicycle and accessories from Bicycle Cove.  The salesperson, is a very helpful, knowledgeable, and friendly person who made it a very pleasant buying experience.  Chris adjusted my bike perfectly and everyone I've dealt with is friendly and helpful.  I'm happy to give Bicycle Cove my highest recommendation.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116876027925404699363", "name": "Morgan Sisk", "time": 1558370101441, "rating": 5.0, "text": "Excellent customer service! The staff is very knowledgeable and went above and beyond, not only in servicing my bike, but by providing race-day recommendations and advice. I could not imagine taking my bike anywhere else.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109388552368926408235", "name": "S T", "time": 1559960225763, "rating": 5.0, "text": "Chris and his team at Bicycle Cove go above and beyond to ensure that you are completely satisfied with the product you have purchased from his store.  Definitely one of the better bike shops in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116100946960399638042", "name": "Luke Short", "time": 1567198743312, "rating": 5.0, "text": "I wish I could give them six stars. Thanks for the fast fix, you saved our trip.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116943606141599881212", "name": "Suzanne Erickson", "time": 1549417834530, "rating": 5.0, "text": "Absolutely love the outstanding customer service and attention to detail I receive each time I walk in to this shop, but the very best thing is the 48 hour guaranteed service turn around time. It's hard to be without my bike, so getting it back quickly is a top priority to me. Thank you Bicycle Cove!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "107447006038536013886", "name": "Harry Pennington", "time": 1557321333665, "rating": 5.0, "text": "Helpful and courteous staff. Very good attention to detail. High quality of repair work - very thorough.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "104326537501769405738", "name": "Don Counts", "time": 1565575693384, "rating": 5.0, "text": "I appreciate the time Ruth Marie Oliver gave\nme demonstrating the latest technologies in cycling.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "109710232415003767957", "name": "BCM", "time": 1599596342235, "rating": 1.0, "text": "This used to be my go to place for my bike.  Unfortunately not anymore.  I have noticed since summer last year the customer service started falling.  With covid it has become non existent and almost down right rude.  I get they are busy, but won't answer phone calls and when they do they don't care if you come in or not.  The Trek bikes are not proving to be reliable IMO.  I have had to replace too many items on a bike that is two years old.   I have a 10 yr old giant that has only had cables replaced once.", "pics": null, "resp": {"time": 1600013820972, "text": "BCM,\n\nCovid and the resulting Bike Boom has put a massive strain on my staff.  Business increased 10x out of the blue, and staff stayed the same.  We are continuing to learn how to operate in our new normal.  Getting feedback both positive and negative helps us to do a better job. Thank you for taking the time to let us know how we are doing.\n\nI'm sorry we are no longer your go-to shop.  Is there something we can do to earn your business back?  Would you be willing to be more specific about the issues you are having with your bike?  I would be super grateful if you'd be willing to call the shop (256-533-2300) so we work together to find a solution.\n\nThanks!\nChris"}, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "103245449458720794136", "name": "Jeff Mccorveysproshop", "time": 1565218661430, "rating": 5.0, "text": "Ben is very knowledgable and easy to work with. I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111221702189718326098", "name": "Amy Stahlman", "time": 1560120500067, "rating": 5.0, "text": "Great staff. Good selection of bikes. I would recommend.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "105841829317592444629", "name": "Kari Lippert", "time": 1575432538302, "rating": 5.0, "text": "The staff is always so friendly and helpful. It's been great working with them.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "117009007320257106798", "name": "Dana DeBardelaben", "time": 1461260926709, "rating": 5.0, "text": "We are fortunate to have several great bike shops in Madison County. Everyone who works here is friendly and helpful. They have what I need and have done great work on my bikes and my husband's bike. Chris does a great job fitting the bike to you (rather than trying to make your body conform to the bike).", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "105424013699538557999", "name": "Michael Behr", "time": 1539282855236, "rating": 5.0, "text": "Been on the ambassador program for 2 years. The Cove knows how to take care of people. They have an awesome 48 hour turn around on most repairs!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "102406985667556093451", "name": "Mark Hudnall", "time": 1539799728114, "rating": 5.0, "text": "Friendly and expert staff.  Quick turnaround on tune-ups and repairs.  They stand behind what they sell and provide incredible and personable customer service!!!  Trek Owner x3!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110559023539268230450", "name": "Bramblett Day", "time": 1546132108127, "rating": 5.0, "text": "Great service the 2 individuals that helped me did not try to make a sale they were genuinely interested in helping me get the repairs I needed.  I went in on 28 Dec 2018 with around a 20 year old bike.  Ben looked it over told me what he thought needed to fixed.  Ben called me on the 29th with some minor adjustments to his previous assessment.   The total cost was around the same he had previously quoted me. Ben called me back on the 29th to tell me my bike was done.  The staff at Bicycle Cove is extremely friendly and helpful. I will be back with any of my future bicycle needs.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "112361815803144020910", "name": "Derek Rose", "time": 1361974493636, "rating": 5.0, "text": "Great bike shop! They have built one wheel for me and trued another. Each time they were very helpful and they had it done very quickly - their prices are very reasonable! They are also great for answering biking questions and helping out with the small stuff that comes up.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "107212337553056573441", "name": "Brad McClellan", "time": 1493176125133, "rating": 5.0, "text": "Fast friendly service. They try to get quick repairs done while you wait. I will definitely go back", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "112035387863306059099", "name": "olga steiner", "time": 1595728618907, "rating": 5.0, "text": "The best Service!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "101732102479438835373", "name": "Jessica Johnson", "time": 1545413867086, "rating": 5.0, "text": "Wonderful experience! Ruth was friendly and knowledgable. I highly recommend Bicycle Cove!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "115607972653989845373", "name": "Jeff Hataway", "time": 1503855493317, "rating": 5.0, "text": "I bought my 2nd bike from Bicycle Cove over the weekend. They have a great selection of bikes and the customer service is second to none. I have recommended them to many friends and always enjoy the bike buying experience.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116402472953818955940", "name": "Nelson Crouch", "time": 1539300962871, "rating": 5.0, "text": "The people at Bicycle Cove are the best.  They have kept my bikes in perfect condition for 5 years and have made adjustment to my bike fit that have allowed me to ride over 12,000 miles so far.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "113190391254227683595", "name": "Lori C", "time": 1543583423777, "rating": 5.0, "text": "Great selection of cycling gear and bicycles for adults and kids. The staff is friendly, knowledgeable, and helpful.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110745479511514033584", "name": "Linda Hisaw", "time": 1436278787511, "rating": 5.0, "text": "A great place to buy a bike. They were very patient with me while helping me find the perfect bike. I love the bike and often tell others about Bicycle Cove. I wish they had free maintenance for the life of the bike like some of the other shops in Huntsville, but it was worth getting the perfect bike for me. Linda Hisaw", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111541463568374269989", "name": "Susan DeBacker", "time": 1551547220359, "rating": 5.0, "text": "I loved the service here and everyone including, Cody the dog were very friendly, and made me feel very welcome there. I'm also super happy with my brand new tricycle that I'll be riding in the downtown Hsv Mardi Gras parade this afternoon!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "117494820814493410805", "name": "Jeremy Biggs", "time": 1554750632682, "rating": 5.0, "text": "Very helpful, put up with me; we will be back!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "106674618296143985529", "name": "Kirstin DeRosa", "time": 1377095548648, "rating": 5.0, "text": "Staff is very knowledgeable and even more helpful (they installed my bike rack for me!). It is clear that they are passionate about bicycles. Totally worth the drive.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "114695915275681982371", "name": "Andy Dorman", "time": 1554153009939, "rating": 5.0, "text": "Very helpful and prices were pretty good.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110416174794719835253", "name": "Steve Justice", "time": 1539306165233, "rating": 5.0, "text": "Dope-azz bike shop. Sick bikes and killer service. I broke my rig hucking it off a sweet jump. My homies were like, \"send it, bro.\" I was like \"Nah, I don't even have my Enduro bike, dude.\" I boofed the landing and jacked my suspension. I took my steed to Bicycle Cove and was like \"Brah, I mitted my sled shredding the gnar, can you help?\" They were like \"no problemo, bruh.\" They tweaked my piece and I was railing again in no time. Thanks Bicycle Cove, you're the dopest.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "102163486344202594730", "name": "C R", "time": 1432853772373, "rating": 5.0, "text": "Amazing people.  Helped me get my bike back together after destroying it at Monta sana. Even offered to help with first aid and printed me directions back to where I was staying. Seriously the nicest people I have met in Alabama.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "116687178454011039908", "name": "Chad Stutts", "time": 1618098764637, "rating": 5.0, "text": "Chris and his staff helped find and fit the perfect bike for my wife. Thanks!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "101412920350593324563", "name": "Mel H", "time": 1540309098385, "rating": 5.0, "text": "Always kind and friendly service that can fix our bicycles.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "115106485471262052813", "name": "Paulo Cardoso", "time": 1560303561629, "rating": 5.0, "text": "Great crew and nice place for cyclists...", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "115412558063873766637", "name": "Kyle Jett", "time": 1486399435148, "rating": 5.0, "text": "Professional, friendly, and very helpful! I would highly recommend Bicycle Cove!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "104142993026421447758", "name": "Randy Carter", "time": 1564701308827, "rating": 5.0, "text": "Always very friendly, and very helpful!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111319633897019848755", "name": "Lisa Eskridge", "time": 1573652778141, "rating": 5.0, "text": "Way above and beyond our expectations, every, single, time!!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "111185588050723665139", "name": "Lonnie Cawthorn", "time": 1473868943663, "rating": 4.0, "text": "A great store!", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "105289710763692846043", "name": "Matthew Bell", "time": 1468253546064, "rating": 5.0, "text": "Best bike shop in Alabama.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "105286943426715131965", "name": "Michael Lane", "time": 1443443758991, "rating": 5.0, "text": "Fantastic, honest, and fun people to work with.", "pics": null, "resp": null, "gmap_id": "0x886213d0ca88e745:0x4e5962037bd7324c"}
{"user_id": "110614656084046845447", "name": "Edgar Iwamoto", "time": 1622974281629, "rating": 5.0, "text": "Couldn't find the product I was looking for anywhere in town or online for months.  Then LG Outdoors posted it was IN STOCK!  and ordered a few boxes.  Got the confirmation and notice of shipment emails soon thereafter, and the product in only SEVEN days time! Wonderful during this pandemic! Product is as described, and have already sent quite a number downrange!  Thanks LG!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116271343520990137638", "name": "Laura Rothermund", "time": 1621088607054, "rating": 5.0, "text": "We placed an order and got a tracking number within a half an hour of doing so and received our products in about 4 days!! Shipping was so fast! Almost unheard of these days! We were very pleased with reasonable prices too!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110862218734163045076", "name": "N McGuire", "time": 1623067557003, "rating": 5.0, "text": "this was the first time I ordered from lg outdoors and they were just great! In the midst of this insanity we've been forced to endure and as far as ordering anything online with delay upon delay you guys were none of that! my order was shipped within a couple of days and it was on my doorstep before the week ended ! thank you very much!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118370654792794902442", "name": "Charles Johnson", "time": 1621428329773, "rating": 5.0, "text": "Lg Outdoors,treated me with respect. I really appreciated the fast service they rendered. It really didn’t take long for them to send my order. They’re are a good company. Sincerely Charles J.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107331775682805284861", "name": "DBNY23", "time": 1620389578731, "rating": 5.0, "text": "I have added LG Outdoors to my list of dealers I look at when shopping. I ordered a case of 5.7x28 ammo last week and it shipped very quickly and was well packaged.  Was great being able to buy the ammo I needed without having to pay the huge premiums it is selling for on places like Gun Broker.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102232348636301317111", "name": "William Hejl", "time": 1623068920282, "rating": 5.0, "text": "First time ordering from LG Outdoors but not the last!  They were great answering my questions and shipped the product in a very timely manner.  Thanks!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104536924644774852619", "name": "B737Jim", "time": 1623528821172, "rating": 5.0, "text": "The product I ordered came fast and was exactly what I was looking for. I wouldn’t hesitate to order from them again.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115735999868877857019", "name": "Bram S", "time": 1621784242108, "rating": 5.0, "text": "Hogue stock. Had just what I was looking for in stock. Prices were in the ballpark. Paid a few dollars more then some of the other sites I found. But they had it in stock! And plenty worth it, considering it arrived days earlier then anticipated. Will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106392262767799194096", "name": "Ernie Wroten", "time": 1622022951070, "rating": 5.0, "text": "this was my first time placing an order with these folks. the process was extremely easy and they sent emails with each step in the process of the order from beginning to end. I recommend this company and will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108822962687228573727", "name": "Tom Szczepaniak", "time": 1623496538037, "rating": 5.0, "text": "I was glad to finally find some small rifle magnum primers to keep my 223 and 450 Bushmaster going.  Shipping was fast too.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113939676494688225638", "name": "Rob Coopman", "time": 1621437330547, "rating": 5.0, "text": "I ordered my item from LG Outdoors through the auction site Gunbroker.  The transaction was flawless and I received my order promptly, and at a great price.   If another opportunity presents itself I will not hesitate to do business with LG Outdoors again!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114978823578658299558", "name": "Mark Nice", "time": 1621593695271, "rating": 5.0, "text": "I was very surprised to find the bullets that I needed after failing to find them at other sources.  LG Outdoors not only had them in stock, but at a very reasonable price, and they arrived at my home in just a few days!!  I've ordered from LG Outdoors in the past and I've always been pleased with my purchases.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103545254030294535504", "name": "mmalf", "time": 1623407929825, "rating": 5.0, "text": "Top notch place to shop.  Easy order, fast delivery, and quick to respond if there is a customer concern.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118090379842669678915", "name": "Nicole Offenheiser", "time": 1616953129455, "rating": 5.0, "text": "I highly recommend LG Outdoors! I ordered ammo from their website and it was a smooth transaction. I was glad that they had 380 ammo in stock during this ammo shortage. Shipping was very quick and I received email notifications throughout the entire shipping process.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101689116038813947102", "name": "Loren Wilson", "time": 1616582168608, "rating": 5.0, "text": "After searching extensively for .45 LC cartridge cases I found a good supply of Winchester cases here.  My order was filled and shipped quickly and arrived by FedEx delivery in perfect condition.  I am very happy with my experience ordering from LG-Outdoors.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101442428795755595300", "name": "Damon Weatherspoon", "time": 1620389884473, "rating": 5.0, "text": "Ordered some VERY hard to find ammo! Excellent price and SUPER fast shipping. I will definitely order again if the item becomes available.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106318995896240204641", "name": "steve ivie", "time": 1621522108529, "rating": 5.0, "text": "LG was one of the few places I could get the caliper I needed for the rifle handed down from my father. Their shipping was prompt and kept me informed along the way. Product works as it should, will be re-ordering.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111450884471026306483", "name": "Marcus Apipattanamontree", "time": 1620571208253, "rating": 5.0, "text": "Gun broker product as described and for a very fair price.  Shipped super fast!  Will do biz again with you guys thank you!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108053641213604041684", "name": "Chris Torre", "time": 1620911724984, "rating": 5.0, "text": "The products shipped very quickly and they answer any and all of my questions that I had. Great customer service", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116932292601182538848", "name": "Jim Wilson", "time": 1619789097440, "rating": 5.0, "text": "I ordered some reloading brass and received my order in three days in Texas. Outstanding! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108379302804521330884", "name": "Jango DeMonica", "time": 1620194486556, "rating": 5.0, "text": "Received item quickly, was correct product as advertised. No hassle. Great prices I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116369557837900592749", "name": "David Thompson", "time": 1616858639323, "rating": 5.0, "text": "I was hesitant at first to place an order with this company due to the nature of some of the reviews. I ordered a 1851 Colt Navy .44 caliber steel frame revolver from them and I couldn't be happier. Great price and I received it within 1 week. The transaction couldn't have gone smoother!! It's an absolutely gorgeous piece and a great price. I tried to order the same revolver from dixie gun works and after one month it still hadn't shipped so I cancelled the order. Shipping was fast even with a nationwide firearms and ammo shortage as well as the pandemic crisis.  I could not be happier,  I will order from them again. Great job you guys !!!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118141025655775855327", "name": "JS", "time": 1614866835672, "rating": 1.0, "text": "Gouging with over pricing of Rifle Primers.  Jacked up the price 7 times the normal selling price.  No Thanks LG Outdoors!\n\nUpdate: Received a response from LG Outdoors and they pretty much played the blame game on bots buying up all the Primers. At $419.99 for a box of 1000 Primers is a ridiculous price. Normally primers are $0.04 each and with this price, it makes it $0.41 each. Just shows human greed from a company. Understand there is a shortage. Maybe hold off on selling Primers until supplies come readily available and go back to a reasonable price. I yes I have not bought from this company and never will. Karma will come back to you in the end.", "pics": null, "resp": {"time": 1614834360243, "text": "We have an A+ rating on the BBB\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nSo you are complaining but you have not bought anything from us and you can't find it cheaper anywhere else so you're mad at us because we have current lowest price.?  If you can buy it for less some where else, why are you not buying from them and wasting your time complaining to us.  No matter what we set the price at, you would never be able to buy it because the guys running the Bots buy it all up before you ever get a chance.  Yes prices are because the public drove them up not us.  I advise very one not to buy more than they need but way t many people are hoarding  and making the problem worst."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100309657323946742243", "name": "Gina Flores", "time": 1619975319054, "rating": 5.0, "text": "LG Outdoors did a great job of getting my order out on time, and complete. Very easy to do business with. Ted.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118292793673905612665", "name": "Sales Account", "time": 1616710705313, "rating": 5.0, "text": "Called to ask about the stock availability shown on the website. Sales associate assured me that the system was correct and that my order, if placed, would be filled asap. Just got the shipping confirmation and couldn't be happier. Thank you for your help and support!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110586399774528269590", "name": "Josh Unal", "time": 1621594958695, "rating": 5.0, "text": "All my orders are received on time in excellent condition. Post order services and customer service is extraordinary and I will definitely keep buying from LG Outdoors.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "112895286900518930354", "name": "Michael Burnthon", "time": 1623594352665, "rating": 5.0, "text": "It was a transaction that you would like to get everywhere, every time, I am very happy. MTB", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105524390498623735976", "name": "Jim Hansen", "time": 1615903871090, "rating": 5.0, "text": "It is nice to see a company that is not inflating prices due to the current shortage of reloading supplies. Ordering and delivery were extremely easy and fast. An outstanding company to work with.", "pics": null, "resp": {"time": 1616082458600, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100571325601017140090", "name": "Donald Westhoff", "time": 1621677614192, "rating": 5.0, "text": "Everything arrived quickly and it was an accurate order I'm very pleased with the entire process thank you and I will be ordering again in the future.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108379037901393099754", "name": "John Slagter", "time": 1616008177482, "rating": 5.0, "text": "I was somewhat hesitant when I first purchased the ammunition because I didn’t immediately receive an email confirmation, however, within about 24 hours I did. The package arrived in less than a week it was exactly as represented and I’m very happy with the service provided I would definitely order again. Thank you", "pics": null, "resp": {"time": 1616082469991, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116084275853492220896", "name": "Rob Ciulla", "time": 1617898222535, "rating": 5.0, "text": "My order shipped fast and was exactly what I was looking for. Fair price and they had them in stock when nobody else did. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111722396380771102761", "name": "MrSkillmaker", "time": 1619992545170, "rating": 5.0, "text": "quick processing.  simple purchase.  everything arrived as promised.  no hassles.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116679028798928508534", "name": "Cas Grys", "time": 1616323475530, "rating": 5.0, "text": "I am very happy, I found exactly what I wanted. Ordering and payment was easy and I received the magazines within a week.\nThank you for a great shopping experience,\nCas", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110962443663256724073", "name": "Paul Chipelo", "time": 1620843804266, "rating": 5.0, "text": "Excellent service. Fast delivery time. I will use them again!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101874772775877688661", "name": "Jeffrey Rasper", "time": 1620565326679, "rating": 5.0, "text": "I was very pleasantly surprised with the quick processing, and shipping of my order.  Before I knew it, it was at my door.  A very good job in a time of delays, and being short handed, Well deserved applause for all of the folks at LG Outdoors!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103768670478510292825", "name": "cbh cz (hazmat)", "time": 1617373262031, "rating": 5.0, "text": "Ordered 44 Bulldog from gun broker.  It shipped quickly from Caroline Guns.  Considering the shortages on everything related to firearms, I’m surprised at the  shipping speed.  I’m happy with overall purchase and shipping.  I ordered 44 brass and received new Starline.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103805730921966317998", "name": "Chris Fisher", "time": 1617880758388, "rating": 5.0, "text": "Great company to deal with. No problems at all and fast shipping. Will use again", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101067307384199845306", "name": "Gary Fisler", "time": 1615302119487, "rating": 5.0, "text": "LG Outdoors had shotshells in stock when they were unavailable every where else. They did not scalp the prices either. Delivery was fast. Very pleased.", "pics": null, "resp": {"time": 1615390528129, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111546781787548646113", "name": "Josh Sadler", "time": 1613407462890, "rating": 1.0, "text": "Ordered in stock items, three weeks later and two emails from me and I finally get told they were back ordered. As soon as I asked to speak with a manager the responses got very rude. Never did get in touch with a manager, they cancelled and refunded my order even though i repeatedly said I did not want my order cancelled.\nThe emails threatened that if I leave bad feedback i better make sure it’s accurate because I’ll be held accountable.\nDocumented the whole process with names and email screenshots and submitted to BBB.", "pics": null, "resp": {"time": 1613617156931, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111949203351553050433", "name": "Kelly Shurtleff", "time": 1612059774448, "rating": 1.0, "text": "In my humble opinion this company spent way more time trying to indemnify them self, than trying to operate a business that is accurate and tries to take care of the customer. They stated that inventory is accurate and updated hourly. Yet my purchase attempt was \"Backordered\" hours later and still the listing on line showed 6 more for sale. Then I believe that they left feedback in a retaliatory way. Check feedback and look at the \"neg\" and I believe you will see a pattern.", "pics": null, "resp": {"time": 1612062013964, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117619916773963546588", "name": "Mick Randall", "time": 1617293298211, "rating": 5.0, "text": "Online purchase of Walther P22 magazines through gunbroker.com. Very fast delivery and reasonable pricing. Definitely will do business with them again.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101821022064071629591", "name": "Matt S", "time": 1619264423223, "rating": 5.0, "text": "Had what I needed!  My purchase has eluded me for sometime.  Happed to stumble on this site in after countless searches. My purchase was at a great price and shipped the same day!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118376488788284558902", "name": "Keith Whittington", "time": 1615835903566, "rating": 5.0, "text": "They communicated well to me on the status of my order. Shipping was good considering Covid-19. I would buy from them again.", "pics": null, "resp": {"time": 1616082444870, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104500831045136977670", "name": "Brian N.", "time": 1616717484168, "rating": 5.0, "text": "LG OUTDOORS is a great place to purchase anything you need for all of your outdoor needs. The have great prices, quality products, and a super friendly  helpful staff.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110324553395690313669", "name": "Dale Smith", "time": 1615300325757, "rating": 1.0, "text": "Will never buy here again. Aside from the very slow shipping and poor response to communication, any company that gouges prices during a crisis (see primers at 10x their value) will lose my business. Enjoy your short-term gain (if anyone is desperate or stupid enough to buy), I suspect you’ll have few customers after this is all over.", "pics": null, "resp": {"time": 1615302060040, "text": "We have an A+ rating on the BBB. If you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113802373683878532091", "name": "Verlin Cross", "time": 1616784801222, "rating": 4.0, "text": "I was able to purchase #11 percussion caps. The only issue I had was I did not get a conformation email for my order and I did not print the invoice at the time of the order. I was glad to see the order when it showed up at my door.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104133641658484373292", "name": "Darrell Lahman", "time": 1616641020037, "rating": 5.0, "text": "No bs shipping with these folks. They are extremely fast and very reasonable to work with. Real pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105874161213886327118", "name": "Marcus B", "time": 1614962790949, "rating": 5.0, "text": "Ordered scope covers from them online, awesome to work with. Very fast shipping. Highly Recommend!", "pics": null, "resp": {"time": 1614964637597, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104578057765055241970", "name": "Pete Johnson", "time": 1620258089514, "rating": 5.0, "text": "Really did a great job for me. My thanks. Pete J.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107899808267072162010", "name": "William Quire", "time": 1622378520874, "rating": 4.0, "text": "L G out doors was very quick in getting my order out to me I was very satisfied as a customer and I will be back soon. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101469830417878763697", "name": "dj koontz", "time": 1621165763013, "rating": 5.0, "text": "I was impressed with the quickness of the delivery and emails updating me on the status of order", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113611301109776746289", "name": "Erik Solberg", "time": 1617119526812, "rating": 5.0, "text": "With ammunition hard to get, LG Outdoors was great at communicating status of order. Also called and person I spoke with was very polite and told me what I needed to know about my order", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116687863965895210064", "name": "luc cote", "time": 1614885340653, "rating": 1.0, "text": "Price gouging. These people are what wrong with America. Don't bother with these clowns.", "pics": null, "resp": {"time": 1614887415687, "text": "We have an A+ rating on the BBB\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114734104180417509687", "name": "Bud Lumis", "time": 1619448457714, "rating": 1.0, "text": "Ordered the wrong parts and the company contacted me quickly and said that I could return them for a refund.  When I got refund about 1 month later, it was not the purchase amount. I was told there was a restocking fee of $15.00.  Item I bought was 2 0mm clips. Very hefty charge to restock. Will never buy from them again.", "pics": null, "resp": {"time": 1619619145253, "text": "Unfortunately it cost us more to process all the paper work and restock a product than it takes to sell and ship a product.  We also do not get back he credit Ard fees, so we are out a lot of money.  We clearly state in the terms and conditions that you must agree to that we charge a restocking fee.  You made a mistake and expect us t pay for your mistake.  You need to take responsibility for your mistakes and not expect other people to pay for your mistakes."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115474114240869596380", "name": "Sam's Auto Service", "time": 1611611688673, "rating": 1.0, "text": "BUYER BEWARE!   I ordered 2 magazines and when i received them they where not what was shown..  The part # was not what was pictured.  I called to speak to a supervisor and they said, they just use a standard photo.  I think this is misleading.  I asked if they could exchange for the part that match's picture and of course it's not available.  I asked if they would return item and they said' Yes for a 15 % stocking fee and I have to pay shipping.  I feel they misrepresented item and should take care of this. Poor customer service!  Be careful what you buy here, you may not  get what you thought you ordered.", "pics": null, "resp": {"time": 1613617922717, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114844948370273169649", "name": "John Embrey", "time": 1615390223859, "rating": 5.0, "text": "I've had several purchases from LG Outdoors and they have all been good experiences. Quality goods, fast shipping, and excellent communications.", "pics": null, "resp": {"time": 1615390540111, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117221488151475109896", "name": "Heronimo 42", "time": 1611598621820, "rating": 5.0, "text": "ordered ammo on 1/21/21 and received it on 1/25/21.  Email said the order was processing still, so didn't know what to expect.  fast shipping, new items and great price.  Happy overall.", "pics": null, "resp": {"time": 1613617961109, "text": "Thank you for your order. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117498201834366127048", "name": "Herb Spangler", "time": 1620568370262, "rating": 5.0, "text": "Transaction was very smooth and shipment was very prompt. Would do business with seller in the future.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111024721275162921545", "name": "Terence Reffeor", "time": 1619689215695, "rating": 5.0, "text": "Their service and prices were excellent and I would order from them again..", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115816144443084145734", "name": "Larry Wright", "time": 1618144782939, "rating": 5.0, "text": "With everything hard to get these days you all got order filled and fast Thanks", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106002838404578716602", "name": "Stephen Fey", "time": 1618499423500, "rating": 5.0, "text": "Good Price; Quick Delivery; Product as advertised. Definitely will be a return customer", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106315277367305501371", "name": "Joe Escalante", "time": 1622241923357, "rating": 5.0, "text": "Always find great deals with assured delivery.. Will always come back for more.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107557207619440781167", "name": "Leo Fronczkiewicz", "time": 1619784306501, "rating": 5.0, "text": "Great price and speedy service will be making my place to do business", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "112355640378909798674", "name": "Jeff's", "time": 1618424264067, "rating": 5.0, "text": "Everything was great. Received my purchase in a timely manner and communication was good.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113846371251174251431", "name": "Brian Celayeta", "time": 1614700630781, "rating": 5.0, "text": "Product was brand new as advertised and works great.  LG was easy to deal with, very quick and responsive through out the buying process.", "pics": null, "resp": {"time": 1614964614350, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113400815251491509057", "name": "Thomas Rondello", "time": 1616604040411, "rating": 5.0, "text": "Smooth transaction with a nice item at a good price. Fast shipping as scheduled, will do business again", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113901396727801463069", "name": "Lex Bland", "time": 1622127281896, "rating": 5.0, "text": "Items were priced fairly and delivery was in a timely fashion.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113717508537202195860", "name": "Michael Widdup", "time": 1619354255885, "rating": 5.0, "text": "Great transaction from start to finish we definitely will order from them again!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108858397175838260548", "name": "Scott Justice", "time": 1620401582067, "rating": 5.0, "text": "Very good quality service . Fast and excellent . Very well pleased....", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115896962489240468834", "name": "Jared Morrow", "time": 1613643289007, "rating": 1.0, "text": "This is a sister company to Wholesale Hunter and they responded to my feedback. This was the first feedback for a business I have posted but it was needed because of the personality of who I spoke with.  They called me snoobish in their response so here is my second.", "pics": null, "resp": {"time": 1613652735530, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117395113554014723256", "name": "Dave Kaufman", "time": 1615555851484, "rating": 4.0, "text": "I placed an online order and was extremely pleased.  The item shipped the next day and I had it a few days later.  I had never heard of LG Outdoors, but  hope to do more business with them in the future.", "pics": null, "resp": {"time": 1615833511398, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100587898979307898223", "name": "Stacy Thomas", "time": 1615835765053, "rating": 5.0, "text": "I have made multiple purchases from LG and each time has been a positive experience. Good prices and quick shipping.", "pics": null, "resp": {"time": 1616082442555, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104449464443206133588", "name": "Robert Stanley", "time": 1613618701601, "rating": 1.0, "text": "Price, gouging by justifying it with the going market rate... is it ok to sell water at 10$ a gallon during a crisis? no its illegal. while what you are doing is not illegal is shimmy as hell and i hope your business tanks because of it", "pics": null, "resp": {"time": 1613620626212, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allows verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104387367722326715638", "name": "Russ Parsons", "time": 1622295701573, "rating": 5.0, "text": "Awesome company to work wit. Item as described.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104336056967031355728", "name": "Tommy Norman", "time": 1615528695192, "rating": 5.0, "text": "The  Magazine I ordered for my rifle came and was a perfect fit I wanted to have a second one so I did not have to carry live ammo in my vest the shipping was fairly quick I received just what I wanted so I would have to say it was a very good experience good job guys thumbs up", "pics": null, "resp": {"time": 1615833506731, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105216545446715059496", "name": "nikstud", "time": 1616801890684, "rating": 5.0, "text": "Great prices and fast shipping.  Very pleased with my purchase transaction", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115740895803630559610", "name": "riko Nicholas", "time": 1619705961926, "rating": 5.0, "text": "Fast shipping ups tracking accurate will order again soon", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "112331133354187041221", "name": "ryan linderman", "time": 1615609906789, "rating": 5.0, "text": "Ordered .308 die set from LG on gunbroker. Fast shipping and product came exactly as described. Would buy from again", "pics": null, "resp": {"time": 1615833520835, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104878013623849263440", "name": "Mike McDonald", "time": 1616710649855, "rating": 5.0, "text": "Product as advertised and described. Great service and communication. Fast shipping.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105237726179738226684", "name": "David Deal", "time": 1620227310151, "rating": 5.0, "text": "Good prices and prompt shipping. Plus they had what I was looking for which says a lot these days.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108863028630827295948", "name": "SteveT", "time": 1616671466168, "rating": 5.0, "text": "Great company to work with good communication, timely shipping, no damage and the product was just what I was expecting! Online ordering today is more about the lesser of two evils but LG Outdoors has my business going forward!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "109925508574664192710", "name": "Steve Loftness", "time": 1616020049569, "rating": 5.0, "text": "Received a confirmation e-mail within 24 hrs of order. Update e-mails thru process . Shipped promptly, received what I ordered promptly. Thank you!", "pics": null, "resp": {"time": 1616082474621, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118117455621618807251", "name": "Joanie Ridlen", "time": 1617278105305, "rating": 5.0, "text": "great guys to buy from great products at good prices very patient with me i bought a little too much and got a little confused they fixed the confusion with no problems in a way that appreciated.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111019687963604564352", "name": "stacy soper", "time": 1623180154336, "rating": 5.0, "text": "Fast shipping Good price Good place to deal with!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111073015604557635314", "name": "Jeff Sory", "time": 1616503040104, "rating": 5.0, "text": "Ordered online through Gunbroker.com. Transaction was smooth and seemless. Fast shipping and product was as advertised.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101227493695918744336", "name": "Jim Dessey", "time": 1620401384883, "rating": 5.0, "text": "Product was delivered in a timely fashion and seems to be of good quality.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111725350885482127642", "name": "Jim Krieger", "time": 1619017250616, "rating": 5.0, "text": "Great to do business with!  Fast and accurate order delivery!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102441890413879923102", "name": "John Watts", "time": 1615901075337, "rating": 5.0, "text": "Very fair pricing for the item that I purchased.  Good communication as well.", "pics": null, "resp": {"time": 1616082456558, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "112803375054911634419", "name": "Edward Stehling", "time": 1620049439538, "rating": 5.0, "text": "The site is easy to use and the shipping was super fast!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106236930347735764188", "name": "Robert Blackburn", "time": 1611130875155, "rating": 4.0, "text": "Wrong ammo sent to me and after mailing it back, the company said they would charge me a restocking fee.  After trying to resolve this with the supervisor--Ben--he still refused to waive the fee.\n\nUPDATE:  Once Exec VP--Jason Marsh--got involved, the issue was resolved quickly.  I will be receiving a FULL refund.  I think this is a communication problem that Jason will fix and I don't foresee ever having another issue.  I do plan to do business with this company in the future.", "pics": null, "resp": {"time": 1610737305943, "text": "Dear Mr Blackburn,\n\nI am sorry to hear of your experience with us. It is not our policy to take restocking fees if we truly shipped you the wrong item. I will personally look into your order and if we did misship your order we will be issuing you a full refund.\n\nThank You,\nJason Marsh\nExecutive V.P."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108772436851123015650", "name": "Guy Mellott", "time": 1622128193587, "rating": 5.0, "text": "Great service  fast  shipping product  was as advertised", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103428495997132972516", "name": "Richard Zook", "time": 1614806589841, "rating": 1.0, "text": "Stay far away. Do not buy from here. They are the biggest RIP-off around. No decent business over charges 10 times normal retail and then attacks their customers and would be customer who call them out on it by claiming that they are bots or trolls. Seriously? No they just royally ticked off and screwed over their customer base. Goodbye. Your not the only place in town.", "pics": null, "resp": {"time": 1614833787165, "text": "We have an A+ rating on the BBB\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nSo you are complaining but you have not bought anything from us and you can find it cheaper anywhere else so you're mad at us because we have current lowest price.?  If you can buy it for less some where else, why are you not buying from them and wasting your time complaining to us."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105307304511552181136", "name": "JR24", "time": 1616032303746, "rating": 5.0, "text": "Good price, proper item, fast shipping.  What more can one ask for?", "pics": null, "resp": {"time": 1616082477730, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106722144825600270105", "name": "John Taylor", "time": 1623327630326, "rating": 5.0, "text": "Prompt service. Completely satisfied.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103530236129856265619", "name": "Michael Quiner", "time": 1616716216554, "rating": 5.0, "text": "Speedy service and  great   communication while the order was pending.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100724719649131013296", "name": "Jr Ivey", "time": 1615342167813, "rating": 5.0, "text": "Very fair prices and quality stock. Shipping was fast.", "pics": null, "resp": {"time": 1615390535302, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111401188517171956723", "name": "Jeremy Shank", "time": 1615985178160, "rating": 5.0, "text": "Incredibly fast shipping. Qould order from here again", "pics": null, "resp": {"time": 1616082466827, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115832004736922607970", "name": "Shamaz Mayginnes", "time": 1615637316523, "rating": 5.0, "text": "These guys stayed in touch and delivered. I am very happy.", "pics": null, "resp": {"time": 1615833522616, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106386836512551941343", "name": "Fred Wynkoop", "time": 1615291485316, "rating": 5.0, "text": "Perfect for what I am doing, reasonable price and fast shipping too", "pics": null, "resp": {"time": 1615390523480, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117839631132811700964", "name": "Trevor Teague", "time": 1614945965535, "rating": 1.0, "text": "On reloading components, LG Outdoors are price gougers of the highest order. They taste right there with CTD. It's sickening to see them increase prices more than tenfold. Stay away.", "pics": null, "resp": {"time": 1614964576286, "text": "We have an A+ rating on the BBB. If you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111401188517171956723", "name": "Jeremy Shank", "time": 1615985178160, "rating": 5.0, "text": "Incredibly fast shipping. Qould order from here again", "pics": null, "resp": {"time": 1616082466827, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111724276633611107848", "name": "Patty Moyer", "time": 1618061438546, "rating": 5.0, "text": "I was always updated as my order was processed. Items shipped quickly!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114970307496563197606", "name": "Manny Diaz", "time": 1614989106174, "rating": 1.0, "text": "Bought Primers at my local Bass Pro Large Pistol Magnum  $39 per 1000  bought 2 boxes,  LG outdoors wants $399 per 1000, literally 10x regular price. And they don't even have the decency to offer Free HAZMAT, I see those FAKE 5 star reviews you cant get out of this one", "pics": null, "resp": {"time": 1614998733849, "text": "We have an A+ rating on the BBB. If you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116284260533768652948", "name": "Michael H", "time": 1622791323537, "rating": 5.0, "text": "Fast shipping great customer service", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114947951873971112659", "name": "Colton Byrd", "time": 1615550490215, "rating": 5.0, "text": "Product was exactly what I ordered and shipped in a timely manner.", "pics": null, "resp": {"time": 1615833508979, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113223081620917689500", "name": "Thomas Clayton", "time": 1621775466242, "rating": 5.0, "text": "Product was as discribed, fast shipping.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101296782295170400025", "name": "Douglas Goree", "time": 1617325869343, "rating": 4.0, "text": "The mags fit my Walther Creed but have not fired it yet using these mags. I'll keep you in mind when I'm looking for something else.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "109910134114560133139", "name": "Ted Gui", "time": 1616539048349, "rating": 5.0, "text": "Product as advertised, prompt delivery ,good communication. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107477850919848166796", "name": "Mark Foradora", "time": 1615834321012, "rating": 5.0, "text": "Great products and pricing. Fast dependable deliveries.", "pics": null, "resp": {"time": 1616082440663, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113847813888752760978", "name": "Al Sosa", "time": 1615862536553, "rating": 5.0, "text": "Great experience. Order was delivered promptly.", "pics": null, "resp": {"time": 1616082449288, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107010406289391734437", "name": "doc adelman", "time": 1618753604661, "rating": 5.0, "text": "Fast ship of a very odd model of Lula Loader, they actually had one for a PM30 in stock and got it out, bang zoom. An Amazon purchase.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103200859602533633598", "name": "Gary Major", "time": 1615911425521, "rating": 5.0, "text": "Order came on time and was packaged very well.", "pics": null, "resp": {"time": 1616082460917, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117027270877540557526", "name": "DaBoo 77", "time": 1616710084861, "rating": 5.0, "text": "Good seller, quick shipping and great price.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113496575643760577871", "name": "Adam Osiecki", "time": 1614276650764, "rating": 1.0, "text": "Price gouging at its finest. I received a notification that they had primers in stock, so I went to place an order. They were asking $315/1000 for Federal small pistol match primers and $250 for Federal large rifle primers. These normally go for about $50 and $40 respectively. They are 100% trying to take advantage of people due to the shortage. Between this and the fact that they are probably one of the worst reviewed companies I've ever seen I can't believe anybody gives this place a dime. It'd probably be less painful to burn the money you were going to give them and throw yourself down the stairs.\n\nEdited to add:  Your response is laughable. All the reputable stores (Midway USA, Natchez, Brownells, Cabelas, etc.) are still selling primers for regular price. They just sell out as soon as they get them in stock so you need to have in stock alerts set up and be ready to buy immediately. You look even worse for trying to justify being a price gouger.\n\nEdited to add again:  I see you've changed your response from justifying your price gouging to now claiming there is some coordinated effort to attack your company.  I personally don't know, nor have I communicated in any way with any of the other reviewers.  If you think reviews from perspective buyers who opted not to buy from your company due to shady business practices are irrelevant, then you are a complete moron.  But go ahead and try to dismiss valid reviews of your company genius.", "pics": null, "resp": {"time": 1611247904514, "text": "Please read all the reviews we have recived since you this non-customer left his. People who actually do business with us are happy with the service they we provide. We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "109181011882245224601", "name": "robert may", "time": 1616018423013, "rating": 1.0, "text": "Scumbag price gouging.\nReply to your reply.\nYour standard copy and paste response doesn't change the FACT your are price gouging rifle primers that normally cost $50 or less per 1000. You have marked up to over $400.", "pics": null, "resp": {"time": 1615220504756, "text": "We sell all items at their current market rate. We understand that some prices may be higher then you are willing to pay, but there people that are willing to pay those prices and are happy to be able to get those items. We have an A+ rating on the BBB. If you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103515836172730853439", "name": "Dave Kunz", "time": 1608629140428, "rating": 2.0, "text": "Review TBD.  I placed an order 12/12/2020.  I get the “unprecedented demand “ stuff but most of the companies I buy from ship within 2-3 days currently for gun parts and accessories.  I’ll give these guys a week or so before updating. I ordered before reading the reviews and hope I don’t regret it.  The reviews have me worried. Bought off gunbroker.  If I get my order in a reasonable time (if I get it) I’ll update.  Same if I have issues. Also - not happy about getting rapped with a $15 or so shipping fee for something that’s less than 1 pound. Update: I canceled my order because they sold me something that they didn’t have.", "pics": null, "resp": {"time": 1613618452846, "text": "Hi Dave,\nPlease check out our true reviews at resellerratings.com where we have 3,726 reviews with an average of 4.72 out of 5. https://www.resellerratings.com/store/LG_Outdoors"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "104087895463658986113", "name": "Dubya", "time": 1614719211640, "rating": 1.0, "text": "Do not do business with LG, made an order with them. Then purchased similar ammunition for dollar less per round. After seeing how much they were gouging me for canceled my order with LG and then was hit with a cancelation fee although the order was never packed or shipped.\n\nEdit: there is no coordinated attack on these guys, the negative reviews are a result of their bad business practice and their abhorrent price gouging.\n\nI am a real customer and I have real problems with LG that just so happen to be shared by many people, there new threads on reddit about how these guys are gouging the heck out of primers right now. Absolutely disgusting company.", "pics": null, "resp": {"time": 1613618222436, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107694519850470706442", "name": "G R", "time": 1613618761693, "rating": 1.0, "text": "Garbage, price gougers and owner defends it by saying is the market going rate.. Good job taking care of the 2A community", "pics": null, "resp": {"time": 1613620528131, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113531513543952455601", "name": "Support Selecta", "time": 1614284114554, "rating": 5.0, "text": "Great price, awesome product and fast delivery. Paulo Ferreira.", "pics": null, "resp": {"time": 1614368145810, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116398610284573409449", "name": "ken wickes", "time": 1607090075923, "rating": 1.0, "text": "Literally marking up x10 on the primer price.  I'll remember you guys when this all dies down.  Eat A D.  I'll tell everyone about you until the day I die.  Run away from these scammers.    Also, I see below you claim market rate.  When powder valley, and other suppliers get them in stock they are literally 37 bucks per 1k.   Never forget", "pics": null, "resp": {"time": 1613619247082, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107379621457718987256", "name": "Thomas Hepler", "time": 1615647135717, "rating": 3.0, "text": "1000% mark up on prices, its a shame stores are taking advantage of consumers. I used to pay .04 cents a primer, now paying over .42 cents for the same thing.", "pics": null, "resp": {"time": 1615678023569, "text": "We are truly as upset about the price of primers as the public , but we have no controls over that.  You and the public set the price.  If these primers were any lower cost, you would not be able to buy them because some else would have already bought all of them.  The only reason you have any chance at all buy some is due to the fact they are priced at the low end of the market price, any lowered and they sell out instantly before you even get a chance.  So is it better not to be able to buy any at all, or is it better to be able to pay a little more and just buy enough for you immediate needs.  The public sets the price they are willing to pay.  When the goods are priced lower than market, they are gone instantly ad most people never have the chance to buy any at all.  More often than most people realize the market price for some things is far below cost and dealer and distributors end up selling them at a loss.  The good must continue to move, it does no good to eave product on the shelve that doesn't, it gets discounted until it reaches the market price and ten it will finally sell and if that is below cost we have to eat it.  You never hear customers complain that they bought some thing too cheap.  It works both ways my friend.  Personally I will not pay the going prices and I thing every one needs to slow down so prices go back down to normal."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102273523716768736791", "name": "Orion S", "time": 1615933321989, "rating": 1.0, "text": "Gouging with over pricing of pistol primers and reloading supplies.  Would never recommend buying from vendors like this.", "pics": null, "resp": {"time": 1616082543021, "text": "We sell all items at their current market rate. We understand that some prices may be higher then you are willing to pay, but there people that are willing to pay those prices and are happy to be able to get those items."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114748170277226572356", "name": "Paul Janssen", "time": 1614613827075, "rating": 5.0, "text": "Great transaction.  Everything happened as planned.", "pics": null, "resp": {"time": 1614964607788, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107853710187666277695", "name": "Kent Walz", "time": 1618363391060, "rating": 5.0, "text": "Great prices and customer information.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105415696721375964336", "name": "Tom Kennedy", "time": 1620250268646, "rating": 5.0, "text": "Fast service, thanks TK2020", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117348510131276738903", "name": "James P. Phraner", "time": 1611235945258, "rating": 1.0, "text": "Sold me a product on Gunbroker that wasnt in stock. After a month issued a refund, and they opened an Unpaid item case with gunbroker. Would never recommend\n\nUPDATE: After the owner called me a liar, I posted the receipts and email", "pics": null, "resp": {"time": 1611233477246, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100175558042230694631", "name": "Dan Decker", "time": 1616698226764, "rating": 5.0, "text": "Great product at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115275104431156209732", "name": "Jessie Towery", "time": 1612992128096, "rating": 5.0, "text": "Very reasonable shipping cost and fast turnaround time", "pics": null, "resp": {"time": 1613617351085, "text": "Thank you for your order. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105499233982464457267", "name": "Gene Barcher", "time": 1620832076341, "rating": 5.0, "text": "excellent service and fast shipping", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108373512172167307954", "name": "George Phillips", "time": 1618910180496, "rating": 5.0, "text": "Super inventory and fast shipping in these difficult pandemic times.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "112747816569625311547", "name": "Shane Harlson", "time": 1615858935970, "rating": 5.0, "text": "Fast service thank you.", "pics": null, "resp": {"time": 1616082447367, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102393949780578057455", "name": "Julie Hudson", "time": 1618000216769, "rating": 5.0, "text": "They had the shotgun barrel I wanted, and delivered it quickly despite problems associated with covid. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107356303699038832488", "name": "Charles Grainger", "time": 1599933046423, "rating": 5.0, "text": "Bought several things - some of which are difficult to find elsewhere or which later become popular but are new on the market.  Some prices low and some a little high.  Great resource.", "pics": null, "resp": {"time": 1613619544236, "text": "Thank you for your order."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113794144108601272934", "name": "dchevron77", "time": 1600290518882, "rating": 1.0, "text": "Look at the other reviews on here and LG's own responses to get an idea if you want to shop here. I wrote a longer review detailing the horrible customer service I received but it's magically gone. Buyer beware.", "pics": null, "resp": {"time": 1613619429430, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103878090419788249323", "name": "Jay Macklin", "time": 1614628921580, "rating": 5.0, "text": "Great service and fast response.", "pics": null, "resp": {"time": 1614964610381, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102554450822065209552", "name": "Anthony Robinson", "time": 1620647467479, "rating": 1.0, "text": "I order magazines and never received my products.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106496196521957229430", "name": "Doyle Dyer", "time": 1622203438155, "rating": 5.0, "text": "Good experience overall!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102813627215869201659", "name": "Emily Hurst", "time": 1614714207307, "rating": 1.0, "text": "Go read the reviews before buying. just as bad as GunBroker prices.", "pics": null, "resp": {"time": 1614714301111, "text": "We have an A+ rating on the BBB\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "109900919973147877250", "name": "Ryan Ellenburg", "time": 1614884325016, "rating": 5.0, "text": "Great doing business with them!", "pics": null, "resp": {"time": 1614964634051, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108479399879130455145", "name": "Noel Furniss", "time": 1615933372086, "rating": 5.0, "text": "Fast service, fast delivery!", "pics": null, "resp": {"time": 1616082465042, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115036586713228809715", "name": "Chris Anderson", "time": 1617284456101, "rating": 5.0, "text": "The only place I could find the reloading brass I need and I had it 2 days later I was not too sure about LG at first after reading reviews on BBB but I had a great experience", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105654255528465950322", "name": "I AM BATMAN", "time": 1592928078754, "rating": 1.0, "text": "Seller doesn't communicate with customers about shipment.  Seller waits until we message them than makes false claims stating the item will be shipped yesterday but than still not shipped. Seller obviously has no communication with their staff. Seller claimed they will refund me \"if and when their warehouse responds\" UNACCEPTABLE . you obviously have no uniform in your company. And this is why you received 1 star. Sadly your overall google review is a 2.2 rating and you wonder why? Sadly some people in this world just aren't meant to manage. GOOD DAY.", "pics": null, "resp": {"time": 1592935926018, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105084401607105738964", "name": "Matt Smith", "time": 1615567404226, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": {"time": 1615833514389, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114324337304703918468", "name": "Mark Harris", "time": 1621605018830, "rating": 5.0, "text": "Great experience.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116786234314124054701", "name": "cortney malvich", "time": 1619817683113, "rating": 5.0, "text": "Great service an fast shipping!!!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108129565162287906316", "name": "AR_Patriot", "time": 1616138661622, "rating": 5.0, "text": "Online ordering is a cinch and it opens up options of finding what you need when you need it.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103597095911672872497", "name": "ALEX KEATING", "time": 1599525055364, "rating": 1.0, "text": "I see my last review magically disappeared.  Just read the rest of the reviews here and you'll know if you should shop here or not.  Enough said.", "pics": null, "resp": {"time": 1613619613418, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108204890972584432883", "name": "James Evans", "time": 1614613555503, "rating": 5.0, "text": "sold me a die they didn't have was nice enough to send me my money back.", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101885482857726232291", "name": "C Jackson", "time": 1604711020526, "rating": 1.0, "text": "They won't even answer the phone. Horrible service. Never again.", "pics": null, "resp": {"time": 1604717057414, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118268443762307937271", "name": "Kyle Moschell", "time": 1599588150079, "rating": 1.0, "text": "These people are price-gouging like crazy, trying to take advantage of the shortage and selling primers at 4x the normal price. Avoid at all costs and do not ever do business with these scammers.", "pics": null, "resp": {"time": 1599658408087, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105078376525112991281", "name": "Scott Freeland", "time": 1615595959583, "rating": 1.0, "text": "What a horrible company, how do you sleep at night?", "pics": null, "resp": {"time": 1615833482179, "text": "We have an A+ rating on the BBB. If you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5. Most of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself. If you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110482832480320885615", "name": "Elvis Uribe", "time": 1615217304107, "rating": 5.0, "text": "Fast and perfect service", "pics": null, "resp": {"time": 1615220497371, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100961209384368375517", "name": "Shidokan77", "time": 1615367735795, "rating": 5.0, "text": "Outstanding Transaction.", "pics": null, "resp": {"time": 1615390537929, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103641288281803563377", "name": "Matt Munyon", "time": 1616538869507, "rating": 5.0, "text": "Excellent service!", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "118262845936867355240", "name": "Sam Miller", "time": 1614714284260, "rating": 1.0, "text": "Artificially inflated prices.", "pics": null, "resp": {"time": 1614714372270, "text": "We have an A+ rating on the BBB\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "102342005278387078236", "name": "Paul Trohoski", "time": 1612977929372, "rating": 1.0, "text": "They are charging $425.99 for primers that are $45 elsewhere!", "pics": null, "resp": {"time": 1612985389994, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100569541195811415192", "name": "Thomas James", "time": 1597760220711, "rating": 1.0, "text": "The absolute worst customer service ive ever experienced.", "pics": null, "resp": {"time": 1613619855532, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116523940879320601499", "name": "J K", "time": 1601930329071, "rating": 1.0, "text": "Owners price gouge and when you call them out on it they have their lawyers send a cease and desist notice.", "pics": null, "resp": {"time": 1613619266976, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "117893988702428029171", "name": "Rick W", "time": 1618065953539, "rating": 5.0, "text": "Seamless Process", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107074488272822678709", "name": "Ricky Beck", "time": 1591216620649, "rating": 1.0, "text": "I made an order andwas told there may be a slight delay in processing.  9 days following placing of order I received one part of the order. My account on there website says that everything had shipped the same day. I called and asjed what was going on and was told that the rest of the order had not been processed as of yet. I was cut off by the male customer service representative and asked \"do you want me to try to cancel the remainder of the order\" I told him no But and he hung up on me.\nNever again will I do business nor recommend anyone else doing 10cents of buisness with them.\nPoor internal operations.\nExtremely poor and rude customer service.\n1 star is to good for this type buisness structure.", "pics": null, "resp": {"time": 1591226888494, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100898531162042109822", "name": "Kenneth Belisle", "time": 1615221447574, "rating": 5.0, "text": "wonderful experience", "pics": null, "resp": {"time": 1615302071849, "text": "Thank you for your business. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "107375662408838293072", "name": "Neil Kapoor", "time": 1585766298851, "rating": 1.0, "text": "horrible company to deal with. ordered Ammo on gun broker.on site it says clearly on top NO FFL required, after placing order they called that they can not ship it to my home address despite on top it says no FFL required. i will not recommend them to anyone. bad seller.", "pics": null, "resp": {"time": 1613620201654, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "103195162573594847582", "name": "Justin Bolwerk", "time": 1570742257346, "rating": 1.0, "text": "Purchased an item from them and it was damaged on arrival. Tell me I need to call the company that made the product it isn’t their fault. How is it the manufactures fault that the item was damaged in shipping. Talked with Shelly. Should have read the reviews seems like she has no clue how to work in customer service. LG Outdoor might want to look into these complaints if they want to keep doing business.", "pics": null, "resp": {"time": 1613621641579, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "111694989632243675406", "name": "Brandon Crosby", "time": 1578593322998, "rating": 1.0, "text": "I purchased a item that I never received, I was told that the package was refused upon delivery. I was charged a 20% restocking fee, I was charged twice to send it back and was charged a refusal fee. I was refunded literally pennies on the dollar!  I will NEVER buy from LG OUTDOORS again. Hope this will help with your research, find whatever you looking for and buy it somewhere else I was told you by a LG OUTDOORS employee that my item was sent back to whatever location by the shipping company, I was never contacted me in anyway shape or form by LG OUTDOORS. And was told that my package was refused because and I quote “ I was dead or I moved “ how’s that for customer service.. at the end of the day you got MY item that I paid for and I got nothing.. happy new year may it bring you wealth and happiness from swindling people out of their money.", "pics": null, "resp": {"time": 1578579737615, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113533576605062556810", "name": "william colleran", "time": 1620569224019, "rating": 5.0, "text": "nice", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116994790055435858309", "name": "Tyler Winston", "time": 1579649843666, "rating": 1.0, "text": "Recieved the wrong item and they was unwilling to return it. All because I opened the package, it had never been used. Very displeased", "pics": null, "resp": {"time": 1613621499475, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100389881635487015986", "name": "Steve West", "time": 1616729782352, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108007003854772549927", "name": "Jonathon White", "time": 1598452835102, "rating": 1.0, "text": "I accident Lee ordered something from them 30 seconds later canceled it they sent item anyways said they didn't see cancelation but cancelation was in the instructions of the order they showed me to confirmed order they took so long in getting the return approval I cannot make it in this 7 days they require for a return so they just ripped me off.", "pics": null, "resp": {"time": 1613619757897, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114280969958398374871", "name": "Southern Adventure Outdoors", "time": 1567705343872, "rating": 1.0, "text": "My name is Brandon Conley. I too had a poor experience with Shelly. I ordered an item from Amazon. an air purifier. It was sent \"adult signature required\" in error by the warehouse. That is different than \"signature required\" shipping. Adult sig required  means no changes, no address change, no local UPS store pickup. LG outdoors tried to change it on Thursday. I tried to have it re-routed and couldnt. Saturday delivery was not even an option. I had no way to sign for the package without taking time off work. I could only pick up from a UPS hub that was over an hour from my house so I had UPS return the item. The item arrived back to them on Friday. On Tuesday I told them to just send the item back via regular shipping. A man from customer service and I had a pleasant conversation about this on Thursday. This week Shelly has been in. On Tuesday she said she was waiting on the warehouse to respond to their emails. Today which is Wednesday I sent another email asking for an update since I was suppose to hear back by end of business on Tuesday. Shelly told me they were still waiting on the warehouse and I should hear back by the end of the day today. I told her that is exactly what you told me yesterday. She then said they were waiting to hear back from me on if I wanted a refund or return shipment. I told her that we had emailed yesterday about just sending it back and that everything she has told me so far has been a lie and all seems repetitive. Shelly then raised her voice, changed her tone to a very condescending one. After you all made an error and I still was patient and tried to work you, you give me the customer and attitude and hang up the phone? So yes. #$%* you just give me a refund. I even called back to give her another chance. She answered the phone with an attitude. Look at their feedback on amazon and on here. It seems Shelly has been losing more business than her services are worth.  Their negative reviews are increasing according to their amazon profile. 20% over the past year and now 28% over the past 6 months with less reviews being left. My advice is to close the doors on Shelly or close the doors on your 20 year old business. I will work with you to correct an error and we tried that until she got involved. I understand that mistakes happen but I will not be downgraded and spoken to like a child while attempting to do business with you.", "pics": null, "resp": {"time": 1613621687471, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115738545052075159976", "name": "S W", "time": 1567715364426, "rating": 5.0, "text": "Brittany P was amazing helped me with everything i needed", "pics": null, "resp": {"time": 1613620232025, "text": "Thank you for your order"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "105333909488774358199", "name": "Michael Bryson", "time": 1548441588110, "rating": 5.0, "text": "Very helpful and knowledgeable staff, great prices as well!  Will definitely be doing business with them again.", "pics": null, "resp": {"time": 1565212662340, "text": "Thank you for the feedback. If we there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "113100374474664779027", "name": "Rick Rizzo", "time": 1511286723011, "rating": 5.0, "text": "Good experience online purchase.  I purchased a case of ammunition from this company.  Best price I could find online.  Fair priced UPS ground delivery was quick to my door.", "pics": null, "resp": {"time": 1565212726969, "text": "Thank you for the feedback. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101344625895567766494", "name": "kathi Bazler", "time": 1545321482116, "rating": 1.0, "text": "Never again will I order from these idiots.  I order night googles in dec 10, never got them. I called and they said they were out of stock, no call, no email, nothing.  It was my husbands gift.  What losers", "pics": null, "resp": {"time": 1545323857533, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110770821537677195777", "name": "Mark Zorich", "time": 1547341798846, "rating": 1.0, "text": "I bought a pair of lacrosse mallard 2 waders on line. I tried them on and they felt great. I went to wear them on a hunt and with in 100 yards of walking I found the boots rubbing my legs raw through my base layer. The boots ended up being to short for my build and brusied my calfs. I tried to exchange them for a different pair and they told me no. They were not even worn for 15 mins. So now I have a pair of $250.00 waders that are useless because they are so painful to wear. I should have just paid extra and shopped at a local retailer", "pics": null, "resp": {"time": 1547348089814, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "114459918678176414913", "name": "David Lowe", "time": 1503760055166, "rating": 1.0, "text": "Went to store front to buy in person.  Was very disappointed in what i found. They really don't have a store front where u can look at there inventory. I called earlier and was told they are open on Saturdays and i could look at there inventory of over 25 million. What they have is a very small store front with a few guns,ammo and reloading supplies.There store front is no more than 20 by 40 feet. Area where customer can look. Very disappointed.. Drove 2 hours one way to see this place. Waste of my time.. They dont need to tell people they have a store front where u can look at there inventory.", "pics": null, "resp": {"time": 1503765011755, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "101716489200427761317", "name": "Manager", "time": 1567715267555, "rating": 5.0, "text": "Had  another experience with Brittany today! Will always go back for her", "pics": null, "resp": {"time": 1613620243515, "text": "Thank you for your order"}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108428006368099893916", "name": "D O", "time": 1482544886967, "rating": 1.0, "text": "Terrible experience and I sure wish I would have read these reviews prior to purchasing!  Although the gun came quickly and sales staff is friendly the owner himself seems a bit off balance.  I am active duty military stationed in AL and when I went to pick up the rifle I showed my military ID and my AL concealed carry permit.  The owner wanted a copy of my USMC orders bringing me here to AL and when I stated that is not something we generally carry on our persons, he stated it was federal law. When I questioned him in an attempt to get a better understanding of the law and using as example in the last 18 months I have purchased weapons from Walter Craig, Gulf States Distributors, and Gander Mountain in Montgomery with no requirement to furnish a copy of my military orders, he no kidding exploded!  Literally told me to get the (f-bleep) out of his store and he would charge me for a restocking fee!  This was one of the most insane and oddest moments I have ever had in a retailers shop.  This experience is difficult to describe in believable terms and was rather off putting.  As far as I could tell he was the only angry person on the premises.\n\nI was able to talk to his sales staff and they explained that it was his policy.  I understand that and the information upfront would have been extremely helpful.  I want to comply with any reasonable store policies and would have had I known this was an issue for the owner.  In the end my wife was able to email me a copy and I completed the transaction.  His salesman saved the purchase and I truly believe he is a sincere and helpful person.\n\nHaving said all that I really think purchasing from this establishment is a mistake and I wish I would have walked after the verbal assault and string of profanities.  If you do decide to venture into his place of business be careful; He appeared genuinely angry (which should concern any responsible gun owner), completely narcissistic, not open to any conversation that would question his authority, and is armed!  This man went from 0 to 100 in a nano-second over an issue that I still can’t quite figure out.  Could be he is not a fan of the Marine Corps or the military in general...hope that is not the case and he was just having a bad day but I won’t trust him with my business again.", "pics": null, "resp": {"time": 1482593794721, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "110193742288382242746", "name": "whosZelda", "time": 1548436635718, "rating": 5.0, "text": "Great customer service/variety. Britt was a big help.", "pics": null, "resp": {"time": 1565212713842, "text": "Thank you for the feedback. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "106533818437072948760", "name": "Philip Davin", "time": 1501204758396, "rating": 5.0, "text": "Have ordered ammo multiple times without a hitch!", "pics": null, "resp": {"time": 1565212731962, "text": "Thank you for the feedback. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "108364784641259281046", "name": "Charles Couser", "time": 1509744435334, "rating": 1.0, "text": "Parasites\n\n“Why rate you parasites? Because you feed on others. I order a set of hearing protectors. They arrive and I try thy out. They do not work so I ask to return them. They say no way, as I used them. I appeal to Amazon and they begrudgingly say I can return them, but must suffer a 50% restocking charge. Their customer service rep has a brutal attitude to boot. Shame on them, and more shame yet on Amazon because they were ok with it”  Now you try to say I did not order from you when I proved to Google I did.", "pics": null, "resp": {"time": 1503254559990, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "115378740950229043953", "name": "Josh Hamby", "time": 1491966401433, "rating": 5.0, "text": "Great place to buy your hunting supplies.  Mr Marsh and family are friendly and they treat everyone like they know them.", "pics": null, "resp": {"time": 1565212828658, "text": "Thank you for the feedback. If there is anything else we can help you with please let us know."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100409257466230214433", "name": "self aware", "time": 1588191379219, "rating": 1.0, "text": "Avoid this place.", "pics": null, "resp": {"time": 1588196124097, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "100363121687189098537", "name": "Ronald Jewell", "time": 1503193310873, "rating": 1.0, "text": "Fraudulent selling practices and deceptive marketing DO NOT DO BUSINESS WITH THIS PLACE!!!!", "pics": null, "resp": {"time": 1503238818717, "text": "We have an A+ rating on the BBB\nhttps://www.bbb.org/us/al/wetumpka/profile/sporting-goods-retail/lg-outdoors-0463-90021317\n\nIf you want true reviews of our company then please check out our reviews at resellerratings.com where we have over 3,726 reviews with an average of 4.72 out of 5.\nhttps://www.resellerratings.com/store/LG_Outdoors\n\nWhen we send out our customer satisfaction emails we use Reseller Ratings. They only allow verified customers to leave a feedback where as Google allows anyone to leave a feedback whether or not they have ever done business with a company. You can read the reviews for your self and decided.\n\nMost of these negative Google reviews are not true and most are not even from customers of ours. They are mainly left by internet trolls that got together on chat forms and decided to try and burn us to send business to one of their buddies. Please look at the other reviews they have left and you will see for yourself.\n\nIf you would like to call us before placing an order with us we welcome your call. Our # is (888) 547-4679 We take calls M-F 8 AM to 6 PM. You can also email us at service@LG-Outdoors.com\n\nThank you for your time and consideration."}, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
{"user_id": "116840635232246043204", "name": "Doc Livingston", "time": 1619618074688, "rating": 5.0, "text": "(Translated by Google) Service theft. Stealing product\n\n(Original)\nGoid service. Goid product", "pics": null, "resp": null, "gmap_id": "0x888c246d066e1d5f:0x138e2ef35db4e9ed"}
