{"user_id": "100591419874427983954", "name": "Ethan Shelton", "time": 1628010578516, "rating": 1.0, "text": "If you miss one appointment then they won’t let you donate anymore and also one of the women that answer the phone is always rude I use to love this place not anymore I’ll never go here again", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "103626821680274237415", "name": "Tim Eum", "time": 1618425339722, "rating": 5.0, "text": "Discovery Donor Clinic is a wonderful place to give blood samples for research. They take blood samples from you and then give you a gift card for $50 to $75 that can be used for anywhere that takes MasterCard credit cards. Discovery Donor Clinic is always looking for healthy volunteers.", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "109709347119797643225", "name": "Sarah Gross", "time": 1619636155946, "rating": 5.0, "text": "Staff was very nice and made sure I was comfortable the whole time. The process was relatively easy and the fact they have hulu and netflix to pass the time was really great. I'd definitely recommend them to family and friends.", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "109254897699473617949", "name": "Paul Streeter", "time": 1614800734822, "rating": 5.0, "text": "Very nice people and a great experience, technicians are very knowledgeable about what they are doing and all people are doing covid masking and cleaning up after patients. Fantastic place 😀", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "114379395858149324212", "name": "tomy johnson", "time": 1620920808270, "rating": 5.0, "text": "Good staff good nurses have no complaints", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "118223677659829833655", "name": "Matt Kennedy", "time": 1612383973124, "rating": 5.0, "text": "Staff is friendly and very thorough and explains the apherisis process in much detail and provides all the documentation you need in order to become a donor.  I try to give blood and such every chance I can because you know what they say about the life you save and this company I was very patient with me.", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "107865063715472416959", "name": "Mary Zivat", "time": 1617226448369, "rating": 5.0, "text": "Peesonnel are great! Very pleasant experience!", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "107192597514217491139", "name": "Tyler Clark", "time": 1597068908978, "rating": 5.0, "text": "Absolutely love all of the amazing staff here! Love donating blood here and seeing these great people every so often!", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "115711395959199657827", "name": "Jackie Turman", "time": 1604959673837, "rating": 5.0, "text": "Great staff and a great place to donate blood and plasma.", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "110758506992011152600", "name": "Leslie Hargrave", "time": 1619740290267, "rating": 5.0, "text": "It was great!", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "118105687681576768947", "name": "Prodigal Son", "time": 1604619189196, "rating": 5.0, "text": "100% Legit will come back again.", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "101139871747634617145", "name": "Tim Stephens", "time": 1606325335913, "rating": 5.0, "text": "This place is the 💣 💣 💣!!! Very respectful and polite staff!!!", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "105995295585381826670", "name": "Amy Landreneau", "time": 1614812462482, "rating": 5.0, "text": "Wonderful people!!!", "pics": null, "resp": null, "gmap_id": "0x88626fbb86f35849:0x6bc17dbf8297ab04"}
{"user_id": "107272868595683921316", "name": "Sky Olds", "time": 1559839407752, "rating": 5.0, "text": "I really love this place. What better way to make cash why saving lives Of others. The Staff is friendly, fast, and very knowledgeable!! Hands down, Best place to donate Plasma!", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "103089614484984381013", "name": "JodiLea", "time": 1495059115310, "rating": 1.0, "text": "Very rude. Need to be within 60 miles. Need at least 3 hours just to be evaluated. All to get barely enough money to break even in gas. Oh and VERY RUDE!!!!!! The woman literally asked 'why would you drive that far?' Um because people need money!!! Why else you fool? We aren't there for any other reason but BECAUSE people need money. Jesus", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "104295428728999729122", "name": "Jennie Losee", "time": 1505147058263, "rating": 5.0, "text": "The staff was so helpful, knowledgeable and professional. They had me in and out quickly.", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "109090384869857333556", "name": "LALA", "time": 1490795769583, "rating": 5.0, "text": "I have nothing negative to say ! Everyone that works there are amazing, kind, and the best people I have ever met !! If you have a problem they adress it immediately. Keep up the good work !!!", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "104813864558355085932", "name": "Monique Anderson", "time": 1453425847400, "rating": 1.0, "text": "Awful experience.. Technician crying in front of me..blew two veins, leaving a bruise from my elbow to my wrist...I almost passed out, they were told to check my vital s...they didn't... And now my right arm and hand goes numb and finger tips tingle...and no one seemed even slightly concerned !!", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "102114416133232361463", "name": "Jacqueline Uline", "time": 1480123412281, "rating": 1.0, "text": "I donated a total of 11 times all of my experiences where about the same where your machines will beep due to no-flow or some other reasons.. After my experience today i vow to never donate plasma again. I was being disconnected asked for extra gauze because I knew sometimes i bleed slightly for a bit. I experienced the worst gushing bleed out of my life.. Was told to stay calm. My blood was all over my arm my hand my clothea the bed as well as the floor.. I felt terrible all day took nearly an hour for the $30 donation and i was not offered anything for the bleed out.. Im done donating plasma is not worth my life..... Good Luck to anyone dealing these people.", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "111630669512583164663", "name": "Christine Trawick", "time": 1497532857698, "rating": 1.0, "text": "They were stiff about verifying my address. I wanted to use my previous address (family) since I'm in the process of moving and don't know how much longer I'll have my place. So they sent a postcard, complete waste of gas. I also had questions about if I was even able to donate since I do have a disease, but they were in such a hurry all they could say was to come back with the postcard verifying my address. It says open 8a, but I've called 3 times with no answer and the message says it's after business hours. Also, it says open until 6pm, however they don't take walk-ins after 3:30 or 4. I'm not thrilled about this place after reading other reviews, and not trying to waste my gas either! Which sucks because honestly people need money myself included", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "111336036721627529349", "name": "Sabrina Watson", "time": 1468605688288, "rating": 1.0, "text": "Horrible experience! Blowed a vein over a week ago with no regards to it at all until I came back to do it  with a huge bruise on my arm where I was questioned about what I had done to myself that is when I explained they had done it to me I couldn't even use my arm at all the next day an every since then they find a way to defer me from donating due to their mistake an negligence  I am currently posting from the lobby of the place right now where I was told I'd half to see a doctor before I could try today however they are unsure when the doctor will be back meaning they are sticking people without a licenced doctor here if something was to go wrong", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "102688754591837218694", "name": "Darron Ellis", "time": 1484836093019, "rating": 5.0, "text": "I've always had a wonderful experience. But I think that they should pay more because if u go to Montgomery or Birmingham and give they pay u more they pay u like $90.00 for the first time and then they pay u $50.00 after the first time. We should at least get paid more than $20.00 after ur first five visits. Kedplasma could at least pay u $30.00 Everytime u give. Remember if it want for the donnars giving there would be no way to help save people's lives.", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "104389701542952182400", "name": "Kris bunkley-henderson", "time": 1479761601681, "rating": 1.0, "text": "i went there today it was not alot many people there and not to mention they had called my phone and asked me to come in and give plasma.6 people went to a bed including me,they skipped all over me after they had hooked all of the men up.the two women kept telling the other 6 people they would be right with them but would never tell me anything like if i was not even sitting there.they were wiping down beds but still over looked me after 27 minutes after still on the bed and all the men were half way finished.i am a gay woman and i think it has alot to do with my sexuality.they called my phone for me to come in and donate but treat me unfair and make me feel some typa way yall were not that busy. 11/18/2016 other workers did notice what i was saying...my patient id# 234422..review the camera if it works.i dont need the money that bad,walked with 200 dollars in my wallet.see this is why barley come there...i dont need yall if im gone be looked over.the money does come in handy but dont forget i came to save lives but because of this makes me dgaf.that gave me a feeling i did not like how those two women kept bypassing me like they did.thanks stephanie for calling me to come to ked plasma,i know you were not there when i came in around 920.i will let you know i will not go anywhere if i dont feel worth or valued because i am.again you were not that busy..yeah busy enough to run down one end by my bed and stopped someone from whispering something in my ear as they were leaving out.even those she claimed to be so busy so sooner than i got off the bed not even 30 seconds the bed was being cleaned as i was talking to other workers on the other side,but not even 27 minutes nothing at all was said to me until i got upset.", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "115864830524096731118", "name": "becka wilkins", "time": 1468604934518, "rating": 1.0, "text": "If your not a drug addict they wont take you !!!! They checked my fingers and toes and arms for needle marks and then wouldnt take me after they found nothing but took all the drug addicts waiting ! They told my husband he had hep c and told him he couldnt come back and he doesnt have it !  They blew my friends vein and let her sit  there for 15 mins without doing anything to help her and now she has a huge bruise on her arm and they asked her what she did and will no longer take her. And they have no liscensed doctor there incase anything happens !", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "116669890309534067237", "name": "Jay Gill", "time": 1471726797289, "rating": 3.0, "text": "The experience was fair, but I was fooled into believing I would not receive a 1099. I thought I had read in the initial handbook that if I donated too much that I would receive a 1099, but when I asked to see a handbook I was giving another book that didn't say anything about a 1099. The whole thing is foolish. WARNING: Be careful on how much you donate or you will receive a 1099!!", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "116280052174193535677", "name": "dropof blood", "time": 1543344410555, "rating": 5.0, "text": "Not very busy friendly staff", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "114560200550677817791", "name": "Dawson", "time": 1499115363578, "rating": 1.0, "text": "Wait time", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
{"user_id": "118039429330532042969", "name": "BA Nadeau", "time": 1471115462977, "rating": 5.0, "text": "Store hours need to be fix to read when the doors actually close.", "pics": null, "resp": null, "gmap_id": "0x8892927d9c5b7a77:0x7d05e19dfb9665ed"}
