{"user_id": "118045740458175825402", "name": "Mike & Stephanie Freeman", "time": 1548777177538, "rating": 5.0, "text": "We first called the company “Critter Capture” and had them come out to get rid of a squirrel that had made his nest in our gutter. After checking our attic and seeing that the squirrel had not yet made an entrance into our house, they told us there was nothing they could do.  The guy didn’t even have a ladder to check our gutters!\n\nSo we call Jim from Exclusive Wildlife & Pest Control.  He laughed when I told him the previous encounter with the Critter Capture company and then proceeded to get his ladder (that he brought himself!) and take a look at our gutters and ensure that the squirrel had not damaged our roof yet and also took the time to double check our attic. No damage was noted except for the fire pit cover we caught the squirrel tearing up the previous weekend.\n\nJim gave me two options on how to get rid of our furry new houseguest; we could capture him alive and release him elsewhere or set a trap similar to a rat trap that should kill him instantly. After much discussion my husband and I decided on the rat trap since the evenings here have been very cold and the poor squirrel may freeze to death in a live trap. Jim was so very patient as we weighed our options and was able to give me the pros and cons on both methods.\n\nAfter one failed attempt to trap him (the trap caught his tail instead of his neck) Jim text me throughout the evening to reassure me that he would get him the next day and that all would be OK. Jim returned promptly the next morning, set the trap again and was able to get the squirrel instantly. He disposed of everything and cleaned the nest out of the gutter.\n\nJim was so very pleasant to work with I will definitely be calling again if any other squirrel decides to make his home here!\nI would recommend Jim and Exclusive Wildlife to anyone who is looking for good, quality, and prompt service.\n\nThank you Jim!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBbVC-1NoRZZKkz46lqwpMR0kKMUXVSo0HNWyH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOpMImbqi6WT6TFmbGFntrWu9R1ePdVJL0QITRP=w150-h150-k-no-p"]}], "resp": {"time": 1548888877159, "text": "Thank you Mike & Stephanie Freeman, it was my pleasure helping you rid your home of your unwelcomed guest and it was nice meeting you."}, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "103366309176078943651", "name": "Jim R.", "time": 1561308658309, "rating": 5.0, "text": "Wow, what a professional service! From the meet and greet to the finished job. Neet and clean and thorough. 100% satisfied!", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "113379450846746276634", "name": "Lynne Casey", "time": 1499700139906, "rating": 5.0, "text": "They came on a Sunday afternoon. Very professional. Did a wonderful job inspecting under a trailer in the mud.  Stayed with it for hours until a huge dead possum was located and removed. I will definitely recommend this company to anyone and everyone. From large to small insect, animal, rodent prevention, inspection or removal. JIM RICHARDS is your man.", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
{"user_id": "107950158733247526469", "name": "Leslie White", "time": 1557423805901, "rating": 5.0, "text": "Friendly and informative", "pics": null, "resp": null, "gmap_id": "0x889a1b2dea85547d:0x4c0bde02d4614206"}
