{"user_id": "114723348851265397542", "name": "Andy Hargrove", "time": 1623898200852, "rating": 5.0, "text": "Great trip with Capt. Patrick!  He was great with my 8 year old, put us on the fish, and made sure we had a good time.  I will definitely book again if we head out to Mobile Bay!", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114337320036072770007", "name": "Eric Wittig", "time": 1623450952825, "rating": 5.0, "text": "Captain Patrick did an awesome job listening what we wanted to catch on our trip and putting us on a load of fish. The morning definitely flies by when everyone is catching fish and you get to land some fish on a variety of tackle setups. I would highly recommend Ugly Fishing to anyone who is taking a trip down to the coast! Book now, you won’t regret it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMgEDwbKVNDjkzRMn88-EdRi87PoWmqjSVbeLQp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPEUbmaUJZG69r3QY2-AM39NJ49iXdZbaGkysGm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMs4MugQcfW2X9wVZbyyBLNcwxgyqjPlLcCWwPT=w150-h150-k-no-p"]}], "resp": {"time": 1623503350441, "text": "Thank you sir for the review and for the business. It’s a real joy for me as a guide for anglers to be able to experience a variety of fish and or tactics. You and your dad did fantastic and I hope to be your guide again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "101519326332276940404", "name": "Jamie Lindsey", "time": 1623962231251, "rating": 5.0, "text": "Captain Patrick is awesome.  We had been on 5 trips with him and we always have a great time and catch lots of fish.  His wit and wisdom make the trip very enjoyable", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112288867397054591227", "name": "Davina Hood", "time": 1617237763679, "rating": 5.0, "text": "Love our trips out with Captain Patric! He put us on some good fish to catch. We have booked 2 trips with him to date and for sure will book when we come back again. Captain Patric has us spoiled to fishing, which is only made better by family competition!\nI definitely recommend using Ugly fishing LLC. This is definitely a new family favorite that our kids look forward to! Thank you for such a great time !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO1AHVBK3xOGOS_xrbh1XzYj_QkddDT1gHT10oX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMn_qCrhFQP7ulQDz39gO1pk4wwK9wi6dquxgIi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-lk-c-hBLjxew8hVUKjAwmehjth8VhvmJx4n_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOiSrEqgOI_HJu28Fy770J_VnFXTQ8PazDlptMQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSOzRfx-3anwdD5LYazbaIoL-9R6EEZdP56oEH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNkBNhF0uvhX8qecIXl9KZOgQfPF5obkKW4OcxX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZMD0P9RIhK8fUB80tld83DsNX6dfPRjtoz3nh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNaJ-zuq1Q30ESFpKzRS8ACn14GlYHzxN0arwbf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0AIPN_bESW1rffLKA6chqHdVKkVvhCQ5Mn5F3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUUIIu17n9snqBTLxGheg5Vwt8cygDfLYpRQxp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMjisHin81_jXNv-7SJgVPDNUlK4UvXWsVlUsQ0=w150-h150-k-no-p"]}], "resp": {"time": 1617276174965, "text": "Thank you so much for continued business and for the awesome review! It’s a real pleasure to be your family’s fishing guide and I absolutely love the competitive nature."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102679475974695426697", "name": "Bryan Viles", "time": 1623873486637, "rating": 5.0, "text": "Captain Patric is a class act. He put us on the fish! We  connected with multiple trophy sized speckled trout! Definitely the guy to call if you’re in the area and looking for an excellent fishing experience.", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112990195166020509561", "name": "Daniel Barbier", "time": 1611782199084, "rating": 5.0, "text": "I highly recommend Capt. Patric if you’re in the Mobile Bay Area and want to catch fish. I was on a family trip in Dauphin Island and wanted to make a solo trip to try and find some bigger speckled trout and we did just that.  Within 45 minutes of leaving the dock, I had a 22” we each had a 20” in the boat along with some others that were in the 15-18” range.  Overall I was very pleased with the trip, Capt. Patric was very knowledgeable and the boat was really nice.  I’ll definitely be giving him a shout next time I’m in the area. Thanks again Patric!", "pics": null, "resp": {"time": 1611803585497, "text": "Thank you for the review Daniel! It’s my pleasure to have put you on the fish you were after. I hope you enjoyed your trip to South West Alabama. Please give me a shot again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115438660589731222329", "name": "George Moore", "time": 1623459461954, "rating": 5.0, "text": "This was the best inshore charter. The boys wanted  to catch Shark and man we caught them. Two fifteen year old boy slept good that night.", "pics": null, "resp": {"time": 1623503478124, "text": "Thank you for the review and for the business. It was a real pleasure to serve y’all. The boys were very appreciative of everything which makes my job that much more rewarding. I hope to guide y’all again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108254130219600471690", "name": "Todd McGarrity", "time": 1619444860742, "rating": 5.0, "text": "I have fished with Captain Patric multiple times and have a great experience every time. He is knowledgeable and fun to hang with but most importantly - you can tell he LOVES what he does. Can’t wait to fish with him again soon!", "pics": null, "resp": {"time": 1619832075205, "text": "I like that I’m fun to hang with 😁! Thank you for the review Todd. I look forward to y’all’s next trip to Mobile Bay."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106776952162476267099", "name": "Marc Nations", "time": 1615560151930, "rating": 5.0, "text": "The day fishing with Patrick was great. He put us on fish quickly and took care of us all day. He knows his stuff and he made sure that we knew how to fish successfully. I highly recommend him as a Mobile bay fishing guide.", "pics": null, "resp": {"time": 1623672866129, "text": "Thank you for the review and thank you for choosing me to be your fishing guide. I hope to be your guide again in the future"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112515393976709127737", "name": "Victor Menoni", "time": 1617729566331, "rating": 5.0, "text": "Fantastic experience. Patric was very courteous and knowledgeable. Put us right on the fish. Nice haul of redfish and speckled trout. Highly recommended.", "pics": null, "resp": {"time": 1618058247835, "text": "Thank you for booking and for the review! I hope to be your fishing guide again in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115976875975145618180", "name": "Vic Wiggins", "time": 1617710770012, "rating": 5.0, "text": "I took my son and grandson Sheephead fishing with Patric and we couldn’t have had a better experience. Patric is extremely knowledgeable and really makes the trip a lot of fun. He put us on the fish immediately and we caught a lot of really nice Sheephead. We all had a great time ! I will definitely be booking another trip with Patric later this year. He’s the best !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7I4FmyZ-yErnbdfNFQauBMHpsIi8rGGYm6dXM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2LezITeLCBu9PqbA7vBBWZIIGGbNBIXiRDJTI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPtZd7FCIQzVH1U29baa2VViNI-5nOUvSH6ZD1w=w150-h150-k-no-p"]}], "resp": {"time": 1617714602394, "text": "Thank you for the review Vic. It was a pleasure to show y’all a small portion of the Alabama Coastal fishery. Thank you for booking and I look forward to our next trip."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106504844261527888618", "name": "Shane Taylor", "time": 1609368353166, "rating": 5.0, "text": "20 stars if it would allow it. Our family had a great fishing trip with Captain Patric. We had a family of 5 and his boat accommodated us very well. He worked hard taking us to several spots to get us on some fish. We were able to keep 38 sheepshead and 1 spotted trout.  I really respect how he will meet you at the boat launch that gives us the best shot at catching fish for the day. He's now our choice of charter while visiting the beach. Absolutely will be booking again soon. Thanks Captain Patric for a great day on the water.", "pics": null, "resp": {"time": 1611089561085, "text": "20 stars would be awesome and I’d give y’all a 20 star review for being awesome customers! I am looking forward towards our trip you scheduled in March."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108323363346242959095", "name": "Beard Face", "time": 1618258335206, "rating": 5.0, "text": "Great fishing trip. Patrick knows where the fish are. We had a great time.", "pics": null, "resp": {"time": 1618259141601, "text": "Thank you for the review. It was a great pleasure to be your fishing guide today."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111488906388231439760", "name": "Cawthon", "time": 1619831024874, "rating": 5.0, "text": "If you want to get put on the fish, Capt Patric Garmeson is the guy.  Already looking forward to our next trip!", "pics": null, "resp": {"time": 1619832191364, "text": "Thank you Cawthon! I too will be looking forward to our next outing. Thank you for the return business and I will be anxiously awaiting the new baby photos"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102617461385412036297", "name": "Patrick Bane", "time": 1617736680419, "rating": 5.0, "text": "We had a great father/son trip!  Captain Patric is very knowledgeable and great with kids!", "pics": null, "resp": {"time": 1618058185233, "text": "Thank you for choosing me to be your fishing guide and thank you for the review! You and Hutton did great! I hope to guide y’all again on future trips."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104327447995684552345", "name": "MIKE Stanley", "time": 1620159583938, "rating": 5.0, "text": "Great Captain Chris very personal good guide will come back!!", "pics": null, "resp": {"time": 1620321433839, "text": "Thank you for booking with us Mike. I’m great full we were able to get Capt Chris to help us with your group."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108292637759880513255", "name": "Tommy Lauderdale", "time": 1624024219833, "rating": 5.0, "text": "We always have a great time fishing with Captain Patrick After several years of fishing with him I can say with confidence that you won’t go wrong going with ugly fishing. We always have a great time", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "100633466778598357067", "name": "Chris Stano", "time": 1603374310046, "rating": 5.0, "text": "Had a great time out with Capt. Patrick and we caught fish the whole trip. If you are ever in the Mobile area I would recommend you reach out to him to plan a trip.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBmq_bAf5Xxy7-OE9UYED6x9CxRv85h_jGo8b3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPncryAGkViwzvXcZv6zetPTSRXUwCDDfPg6GLn=w150-h150-k-no-p"]}], "resp": {"time": 1606087400980, "text": "Thank you for the review and for booking with me. I hope to be your guide again some day."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "110639886361457674238", "name": "Susan Jernigan", "time": 1610935015262, "rating": 5.0, "text": "Had the best day catching trout and sheephead today!! Highly recommend Captain Patrick and Ugly Fishing. First time for trout, catch 8 and had fun with this big sheephead!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOoG_SnOQu5zY--8J0CUfv8-BbjsLNak2fvxxBM=w150-h150-k-no-p"]}], "resp": {"time": 1611089486787, "text": "Thank you for the review Susan! It was a real pleasure to be your fishing guide and to net your fish! Its an honor to know that I guided you to your first speckled trout 😁"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114373837102055768484", "name": "larry bailey", "time": 1602119325575, "rating": 5.0, "text": "Been going fishing with Captain Patrick for four years now. Sometimes twice a year. Never disappointed, and have a blast. Best fishing guide around, and I’ll\nNever use anyone else. We come from KY just to fish with him. He’ll put you on the fish and it’s an experience you’ll never forget or regret!  You want a fishing trip of a lifetime? Then plan a trip with Captain Patrick @ Ugly fishing !!", "pics": null, "resp": {"time": 1606087993740, "text": "Thank you for the review and for the repeat business. I always enjoy guiding my Kentucky guys! Till next time my friend!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "101684729814506271779", "name": "Tim Gentzlinger", "time": 1600026928985, "rating": 5.0, "text": "Captain Patric of Ugly Fishing in Mobile Bay Alabama is a top notch fishing guide. He put us on a redfish bite like I have never seen before. He completed my quest to catch a redfish in Alabama within the first 5 minutes of the trip. Very knowledgeable of the area and a pleasure to fish with. Can’t wait to get another day on the water with him. Once again thank you for the memorable day on the bay. Fish on brother 🔥", "pics": null, "resp": {"time": 1606087820099, "text": "Tim, it was a real pleasure to be your fishing guide. You have know idea how happy I was to be the guy who put you on your first Alabama redfish. Thank you for booking and I hope you can do it again sometime."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102546391256786209798", "name": "Greg Pridgen", "time": 1602372268213, "rating": 5.0, "text": "CPT Patric got us on the fish early and kept us on them all day.  He’s very knowledgeable of the area and was fun to be around.  We were able to land a few big Jacks in addition to a few nice Reds, some Specs and White Trout....  we even got an unexpected flounder.  Definitely plan to book him again in the future.", "pics": null, "resp": {"time": 1606087580583, "text": "Greg I really appreciate the review! I love a nice mixed bag day like y’all had. Thank you for your business and I hope to be your guide again some day."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "103511089747163787260", "name": "Gail Moore", "time": 1602558188281, "rating": 5.0, "text": "What a great fishing trip with Captain Patrick. Early we caught so many speckled trout we lost count. While we were doing this Tom and George each caught a big bull red. Then it was off to look for more redfish which we found and caught. Captain Patrick was so helpful with instructions and giving us different baits and lures to try when the bite would occasionally slow down. What a fun day. We will definitely book with Captain Patrick again.", "pics": null, "resp": {"time": 1606087481278, "text": "Thank you for the review Mrs. Gail! It was a real treat to be y’all’s fishing guide for the day. I hope to see y’all again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106966110518514246451", "name": "Chris Gurner", "time": 1623957552133, "rating": 5.0, "text": "I have fished with Ugly Fishing for several years now and can say that every year the experience is top notch. If you are looking for a guide service that knows where to fish and how to fish you’ve found it with Patric.", "pics": null, "resp": null, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114746379913204352311", "name": "Bill Meadows", "time": 1611085809758, "rating": 5.0, "text": "Had a blast fishing for trout, sheephead  and flounder with Captain Patrick. It wasis a very cold day and he didn’t hesitate to take us fishing and show us a great time!", "pics": null, "resp": {"time": 1611089387626, "text": "Thank you for the review but most importantly thank you for booking with Ugly Fishing! We aim to please 😃"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114697752129989772463", "name": "Brandon Davenport", "time": 1602119090325, "rating": 5.0, "text": "Had a blast fishing with Capt. Patrick was awesome. I’m not much on fishing but hooking into those jacks was amazing! Never thought I’d have as much fun or stay as busy on fish as we did both days. Going to try and get out there again next year for sure.", "pics": null, "resp": {"time": 1606087924409, "text": "Thank you for the review Brandon! It’s always a pleasurable day on the water with my boys from Kentucky! I’m pumped the jacks were so cooperative and those snapper were awesome as well!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111663804439205299813", "name": "Ian Bjuro", "time": 1606673835519, "rating": 5.0, "text": "I have been fishing over a handful of times with Patric. He is by far the best and most knowledgable guide in the Coastal Alabama area. He will put you on fish!", "pics": null, "resp": {"time": 1606733435566, "text": "Thank you for the review Ian! Most importantly thank you for the return business!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114934986020092099079", "name": "Jacob Chandler", "time": 1606090157909, "rating": 5.0, "text": "I can not say enough good things about Capt Patric Garmeson and Ugly Fishing Charters. Over the last few years my family and I have been on several trips with Patric and not once did we come back without smiles on everyone’s face.  Capt Patric has a true love for his profession and it shows through the knowledge he freely shares with his guests. If you are considering trying Ugly Fishing I suggest you book early because his schedule stays packed!", "pics": null, "resp": {"time": 1606091021595, "text": "Thank you for the review and the continued support. You are correct I absolutely love my job and the fishery I get to guide on. I love taking the boys fishing but it was nice to actually be your fishing guide this last time around. Till next time my friend."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114934986020092099079", "name": "Jacob Chandler", "time": 1606090157909, "rating": 5.0, "text": "I can not say enough good things about Capt Patric Garmeson and Ugly Fishing Charters. Over the last few years my family and I have been on several trips with Patric and not once did we come back without smiles on everyone’s face.  Capt Patric has a true love for his profession and it shows through the knowledge he freely shares with his guests. If you are considering trying Ugly Fishing I suggest you book early because his schedule stays packed!", "pics": null, "resp": {"time": 1606091021595, "text": "Thank you for the review and the continued support. You are correct I absolutely love my job and the fishery I get to guide on. I love taking the boys fishing but it was nice to actually be your fishing guide this last time around. Till next time my friend."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "117057127693547295735", "name": "randy white", "time": 1603766518520, "rating": 5.0, "text": "Very knowledgeable of the Mobile Bay.  Taught me techniques and tactics that I didn’t previously utilize.  Highly recommend for anyone from beginner to expert in inshore fishing.", "pics": null, "resp": {"time": 1606087357824, "text": "Thank you for the review and for booking with me. I hope to see you again either as a customer or on the water using the techniques you learned."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113538655632242926802", "name": "Marshall Short", "time": 1606091735017, "rating": 5.0, "text": "It got real ugly out there!  He got us on to some monster reds! Patric was great! He has the best boat we've ever been on as well.", "pics": null, "resp": {"time": 1606087687222, "text": "I love the review! Yes it did get Ugly! Ugly in a good way. Thank you for your business and I hope to be your guide again some day!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115283198002902827536", "name": "Chris Graves", "time": 1596806211655, "rating": 5.0, "text": "Patric kept us busy from the time he picked us up until the time he dropped us back off.\nCouldn't have asked for a better day or trip.  My 10 year old son hasn't stopped taking about the 12 foot hammerhead shark!  Highly recommend taking a boat ride with Patric. We will be back.  Thanks again!!", "pics": null, "resp": {"time": 1596840163184, "text": "Thank you for the review! It was a real pleasure guiding y’all on the Gulf. The hammerhead is certainly the highlight of my summer as well."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102797417447031717786", "name": "Forrest Meeks", "time": 1590531144598, "rating": 5.0, "text": "My family had a great time fishing with Patrick. Conditions weren't favorable for snapper so he put us on the trout and redfish. He was awesome with my 3 girls ages 9 to 15. Two of which had never been out a charter trip.", "pics": null, "resp": {"time": 1590694121610, "text": "Thank you for the review and most importantly thank you for choosing Ugly Fishing. The girls were awesome, polite and coachable! It was a real pleasure to guide you and your family on Mobile Bay."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108449632326853164609", "name": "Mark Sabol", "time": 1597186985242, "rating": 5.0, "text": "Captain Patric was outstanding, he was patient with the kids, taught the adults a few new things and most importantly, we caught a lot of fish.", "pics": null, "resp": {"time": 1598205185169, "text": "Thank you for your review Mark. Most importantly, thank you so much for your business!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111823433838779965024", "name": "T Tat", "time": 1581012402479, "rating": 5.0, "text": "Patrick is absolutely the best guide! We took my 5 year old nephew with us, he spent the day helping him so we could fish. Caught a bunch of fish, Patrick was very informative and knowledgeable in the different species. Great gear, great guide, great time, cannot wait to get out on the water with him again", "pics": null, "resp": {"time": 1581069302677, "text": "Thank you for the review. I really love my job which many people can see my passion when we are on the water. Thank you for the kind words."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "106548525713807228147", "name": "Justin Williams", "time": 1596836237817, "rating": 5.0, "text": "Had a blast with Patric. Highlight of the trip was definitely the hammerhead!! Will book again!!", "pics": null, "resp": {"time": 1598205955579, "text": "The hammerhead was a highlight of my career! As an inshore/nearshore Captain I don’t carry tackle big enough to handle a shark of that size. It was awesome! Thank you for booking and the awesome review!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113425921858795304073", "name": "Dan Walsh", "time": 1597110431720, "rating": 5.0, "text": "Fantastic trip.  Knowledgeable and friendly guide.  Will hire again.", "pics": null, "resp": {"time": 1598205307557, "text": "Thank you for your review and thank you for choosing me to be your fishing guide."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102707685768080587444", "name": "gary roberts", "time": 1581190743760, "rating": 5.0, "text": "We been out with Captain Patric a couple times he always put us on the bite. The last time we went to a natural gas rig, there were multiple boats fishing we had the only boat catching fish. We limited out on red snapper then went after redfish. Captain Patric is very knowledgeable and makes fishing a great experience for everyone. I wouldn't use anyone else for my fishing trips", "pics": null, "resp": {"time": 1581195567321, "text": "Thank you for sharing your experiences. Y’all are a pleasure to guide and it’s an honor to be your only guide! Thank you for the repeat business and I look forward to our next outing. And thanks for stopping by to say hello at the baseball field it was good to see you!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102707685768080587444", "name": "gary roberts", "time": 1581190743760, "rating": 5.0, "text": "We been out with Captain Patric a couple times he always put us on the bite. The last time we went to a natural gas rig, there were multiple boats fishing we had the only boat catching fish. We limited out on red snapper then went after redfish. Captain Patric is very knowledgeable and makes fishing a great experience for everyone. I wouldn't use anyone else for my fishing trips", "pics": null, "resp": {"time": 1581195567321, "text": "Thank you for sharing your experiences. Y’all are a pleasure to guide and it’s an honor to be your only guide! Thank you for the repeat business and I look forward to our next outing. And thanks for stopping by to say hello at the baseball field it was good to see you!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114998074481087603160", "name": "John Christian", "time": 1585014997256, "rating": 5.0, "text": "Had a great trip with Patric and highly recommend. Patric is extremely knowledgeable and works hard to ensure his clients have a great experience. I can’t wait until our next trip!", "pics": null, "resp": {"time": 1590694670260, "text": "John, thank you so much for the review and for booking with Ugly Fishing. The boys did great and I hope to be your guide service again one day."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113180987557622259168", "name": "kyle lapp", "time": 1618173771844, "rating": 5.0, "text": "Went out on with my 6 year old son and within minutes of being on the boat we were on some speckled trout. After catching many, we moved on to catch some redfish and that didn’t take long either. We both had a great time.", "pics": null, "resp": {"time": 1590694507429, "text": "Thank you for the review and most importantly thank you for booking with Ugly Fishing. It was a lot of fun helping Eastwood catch fish. I’m so happy the trip was a success."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "111386227579196049736", "name": "Jeffery Carter", "time": 1581012257318, "rating": 5.0, "text": "We had a blast.  Super knowledgeable guide. Caught a ton of fish and leaned even more along the way", "pics": null, "resp": {"time": 1581069405501, "text": "Thanks Jeff. I hope to share a little something with my guests each time out. I’m happy to know you were soaking in the info I was sharing."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "116982197408484833753", "name": "J. Brongo", "time": 1568137771336, "rating": 5.0, "text": "Excellent fishing.  Guide is top notch and the boat is very comfortable and clean.  I would highly recommend Patric to anyone who wants to catch fish!", "pics": null, "resp": {"time": 1568516705664, "text": "Thank you for the business and the 5 star review. I hope you make it up my way again for a future fishing trip. I’m not 100% sure I can top the results of your first trip but I will certainly attempt to do so."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "105894341016168064605", "name": "Shane Brooks", "time": 1581021685682, "rating": 5.0, "text": "I have fished all over the country with guides.  Professional & Sincere,  are hard attributes to come by and Patrick has them.  He wasn’t there to take us on a “boat ride” he wanted us to create some memories; And we did! -great job", "pics": null, "resp": {"time": 1560132459774, "text": "Creating memories is what I do! Thank you for choosing me to be your fishing\nGuide!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113206989759206162488", "name": "John Coll", "time": 1581172908854, "rating": 5.0, "text": "Captain Patrick made this fisherman's dream come true. We started with world class Sheep Head and ended up successfully sight fishing for Bull Reds. We caught plenty of quality fish including a state record hooked by Pat. The whole experience was truly memorable.", "pics": null, "resp": {"time": 1581181643458, "text": "Thank you for the review John and It was an honor to share that day with you. Let’s do it again!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "105919898551956926329", "name": "David Johnson", "time": 1592525680042, "rating": 5.0, "text": "Best fishing experience I’ve had in years", "pics": null, "resp": {"time": 1592622403848, "text": "Thanks for the review David and I enjoyed being your fishing guide."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "101930706416925829801", "name": "Tommy Copeland", "time": 1514663408522, "rating": 5.0, "text": "Captain Patric was awesome my son and I had a blast and left with plenty of reds and specks ..Have done several fishing charters through the years ..Ugly Fishing out shined them all..will recommend it to anyone interested in charter fishing. Captain  was very knowledgeable and personable..thanks for a great time", "pics": null, "resp": {"time": 1515515253939, "text": "Thank you for the kind words Tommy. It was a real treat to be able to provide the service for you and your son. I absolutely loved watching him reel in all those fish!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "103807721201829083166", "name": "Tamara Akins", "time": 1585267829017, "rating": 5.0, "text": "Absolutely the most fun!!!  Attentive and engaging.  Highly recommend Captain Patrick!!!!", "pics": null, "resp": {"time": 1590694576163, "text": "Thank you Tamara! I really enjoyed guiding and teaching you and Jerald on how to catch sheepshead."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "114863785628835590114", "name": "Greg Kennedy", "time": 1546038727368, "rating": 5.0, "text": "Patrick took us out Christmas week and we had a great trip!! The weather was questionable but with Patrick’s local fishing knowledge with cleaned up!! Filled the cooler with speckled trout, white trout, black drum and a redfish! We’ll be frying fish for weekends to come! Thanks for a great memorable trip! Well be back for sure!", "pics": null, "resp": {"time": 1546043308253, "text": "Greg, thank you for the review and opportunity to guide y’all. I really enjoyed teaching the three of you how to catch the winter time fish in deep water. I hope to be your guide again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108619786373232586356", "name": "Joshua Knight", "time": 1574713589226, "rating": 5.0, "text": "Patrick put us on fish all around the bay! Awesome boat, highly recommend, the man knew his stuff.Thanks again.", "pics": null, "resp": {"time": 1578989238520, "text": "Josh, thanks for the review! Two things I can always control. 1st my effort into putting customers on fish. 2nd the quality of my equipment. It means a lot that you noticed and that you highly recommend me and my company. Till next time my friend!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "103466349702030848580", "name": "Vanessa Hale", "time": 1541720325573, "rating": 5.0, "text": "Capt. Patric was great! He took great care of us, even baiting our hooks! Super fun day out on the bay!!! Thanks so much!", "pics": null, "resp": {"time": 1541721633636, "text": "Thank you so much for the review Vanessa. Y’all caught some great fish! I hope I can be your captain again someday."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104966177620278515749", "name": "Dan L.", "time": 1559673938729, "rating": 5.0, "text": "Captain Patric is a true pro.  He's patient with inexperienced fishermen,  works hard for his clients, gets results, and is simply a pleasure to go fishing with.  Highly recommended.", "pics": null, "resp": {"time": 1560132254785, "text": "Thank you for the kind words Dan. It was a real treat to be able to teach Vaughn how to catch a fish."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104649308760577411732", "name": "Craig Newton", "time": 1581013363222, "rating": 5.0, "text": "Very knowledgable captain that works hard to keep you on the fish!!", "pics": null, "resp": {"time": 1581069146659, "text": "Thank you Craig. Trying to learn a little bit each day and pass that along."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115491344976019991529", "name": "Ried Baker", "time": 1543725416534, "rating": 5.0, "text": "A very knowledgeable captain. He was able to put us on top of some fish. It was a very good time.", "pics": null, "resp": {"time": 1543748972883, "text": "Ried, thank you for the review! Your fishing trip was a lot of fun! I’m still amazed by the size of some of the fish y’all caught!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115370310546403957076", "name": "Andrew Carpenter", "time": 1533667436319, "rating": 5.0, "text": "Had a blast, and caught a lot of fish. Captain Patric kept us on top of the fish all day, and there was not a dull moment. He taught me a lot about saltwater fishing, and you could immediately tell he loves what he does and is very good at it. I will definitely be back and plan to make it into at least a yearly trip.", "pics": null, "resp": {"time": 1534379586777, "text": "Thank you for the awesome review, Andrew. It’s a real pleasure to take anglers like yourself fishing on Mobile Bay. The bay is my home and I thoroughly enjoy my job."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "109081194534742327040", "name": "Kevin Gore", "time": 1531613170077, "rating": 5.0, "text": "Went fishing with Captain Jeff yesterday morning. We had a great time catching red snapper, Spanish makrel and a nice jack. Captain Jeff is very knowledgeable of the area and I would highly recommend Ugly Fishing to anyone!", "pics": null, "resp": {"time": 1534379959947, "text": "Thank you for the review Kevin. Jeff is a   New addition to the team and he certainly has his heart in the job. Thanks for choosing Ugly Fishing as your fishing guide service"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "117318952124579621874", "name": "Danielle Davidson", "time": 1530499936037, "rating": 5.0, "text": "We went fishing today with Capt. Patric on the eastern shore of Mobile Bay. Patric is an extremely knowledgeable guide with an affinity for making his anglers feel safe, confident, and fulfilled. We are experienced anglers that are new to the area and feel that we can now head out on the water with a solid plan. Patric is a fantastic teacher, we learned about the area, local techniques, and  seasonal patterns. No questions about recommending Captain Patric to anyone from novice to expert for a great day on the water, he will go above and beyond to make your personal experience the best it can be.", "pics": null, "resp": {"time": 1530571026250, "text": "Thank you so much for the review Danielle. It was a great honor to be your fishing guide. You and Nobel are both great anglers and it was a treat to be able to share with you what I have learned over the years."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104243180211938944554", "name": "Hank Arnold", "time": 1570624593117, "rating": 5.0, "text": "Fished with Patric for redfish last week. Took some buddies from South Georgia that have fished for trout and redfish their whole lives, Patric impressed them in the delta. Limit of redfish plus trout, drum. lots of catfish and a bass. Lots of action, lots of over slot fish to throw back. Patric never quits, I tell him its like having a buddy with a cool boat that knows how to make it happen! Spent the day \"whackin pumpkins\". Thanks for the great time, we will be back, the \"bucket list\" keeps growing. KWE!!", "pics": null, "resp": {"time": 1578989417550, "text": "Hank, it is about time to go whack some more pumpkins sir! Thank you for the review and the detail you put into it. For those who don’t know a pumpkin is a term used for a redfish that is really orange in color much like a pumpkin. This coloration also tends to show up the most in the fall of the year."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "109467048007286505542", "name": "Josh Ayers", "time": 1532568069715, "rating": 5.0, "text": "Booked at noon same day last minute and Patrick had no issues taking us out for a few hours. Very patient with the rookies. Would definitely recommend for any bay fishing....", "pics": null, "resp": {"time": 1534379764512, "text": "Josh, thank you for your review! It is frustrating for me when I have customers calling and I can’t get them on the water. I’m so glad that we were able to work things out."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "108092105618536322369", "name": "Harrison Balzli", "time": 1516996208379, "rating": 5.0, "text": "Awesome morning out in the delta rivers. Went for reds and had our limit in less than a hour. They were the larger slots as well as quite a few bulls that were tagged and released for another day! Also had a few bags of speckled trout to bring home. Patric was a great host and really knows how to navigate these waters well and find the fish!Thanks for the trip", "pics": null, "resp": {"time": 1517015501907, "text": "Harrison, thank you for the review! It was a great pleasure to spend the morning with you and your father and I hope to be able to teach you more about Mobile Bay in the future."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112541612860712208953", "name": "rhoward2780", "time": 1559343940955, "rating": 5.0, "text": "If you like catching fish, Captain Patric will put you in the middle of the action. Had a great day of catching red fish, speckled trout, and a variety of other fish. Ugly Fishing, LLC is the way to go on Mobile Bay!", "pics": null, "resp": {"time": 1560132363177, "text": "Thank you for the great review. It was quite enjoyable to teach you how to catch Speckled trout and redfish on artificial lures."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115180146382403877781", "name": "Amanda Griswold", "time": 1546207255042, "rating": 5.0, "text": "Amazing!! Patrick is a very well educated guide. He made the trip enjoyable by sharing facts of the surrounding environment, his knowledge about different species of fish, and how to catch them. He did a great job keeping us busy and moving around as needed. As well as being patient, and stepping in to assist with casting if needed. It seemed he would do as little or as much as you wanted him to, and somehow could pick up on it without a word. It was an excellent trip. We asked for Redfish and got the most I’ve ever caught. We will be back to try out more fishing in the spring.", "pics": null, "resp": {"time": 1546212868723, "text": "Thank you so much for the review, Amanda. I am really glad that we were able to get this trip put together on such short turnaround. Y’all did a great job listening and capitalizing on the bites. Nice work and congrats on catching some great redfish. Check out The post I made on Facebook and Instagram."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104032130813831683492", "name": "Jimmy Ray Smith (JRay)", "time": 1540925662980, "rating": 5.0, "text": "On time and ready to catch fish. Patric took great care of us from beginning to end. Caught a bunch of red fish and trout.", "pics": null, "resp": {"time": 1540939484335, "text": "Your the man Jimmy Ray! Thank you for the review"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113661204694900054203", "name": "jason pepperman", "time": 1486055309603, "rating": 5.0, "text": "Went out after speckled trout with Patric on New Years Eve morning. He's very knowledgeable about the fish as well as the water we were fishing. He suggested a couple of different hard baits and we got the trout biting. We caught a lot of fish in just a couple of hours and I caught my biggest trout ever that morning. Great trip. Looking forward to going again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMPtHNCov8wqv2QsZd7a9B7H3rsGioXrpEKuumF=w150-h150-k-no-p"]}], "resp": {"time": 1486061446053, "text": "Thank you for the review Jason. Teaching people new techniques and strategies while figuring out what the fish want is so much fun. I am very excited about being a part of you landing your trophy speckled trout. I look forward to our next outing."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113549603117243814220", "name": "The Barn at Big Oak Hill Ranch", "time": 1499216297492, "rating": 5.0, "text": "We had a great day on the water today with Captain Patric with Ugly Fishing. He was very patient, incredibly knowledgeable of the area, and knew exactly where the fish were biting! We caught our limit on Red Snapper and Speckled Trout. Almost every cast was a bite! He even took great photos and video footage of all the action that we will treasure forever! We highly recommend booking with Ugly Fishing Charters and look forward to booking again!", "pics": null, "resp": {"time": 1501528736004, "text": "Thank you so much for sharing your story with everyone. I really enjoyed spending the day with you and your family and thanks for rescuing me."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "112794738939712005807", "name": "Patrick Landry", "time": 1508620987949, "rating": 5.0, "text": "This is my second charter fishing trip in Mobile Bay Area. Last year was my 1st & I went with a group charter that was good (3) at best. This trip with Ugly Fishing by Captain Patrick was great. Patrick called fellow colleagues to get the most up to the minute reports where conditions were good for catching desirable fish. He moved around looking for favorable conditions. We limited out on Speckled Trout and caught two 15-20 pound Jack  Crevalle's that were released. He cleaned and bagged our Speckled Trout. It was a Great Trip.", "pics": null, "resp": {"time": 1508838844706, "text": "Thank you for the review, Pat. It’s very important that our clients feel as if they received maximum effort. Some days we can drive straight to the fish and catch them as soon as we begin and other days we have to hunt and peck to find them."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "115834778715793748970", "name": "Joseph Steele", "time": 1582317505767, "rating": 5.0, "text": "IT BE WAS FUN", "pics": null, "resp": {"time": 1582321518447, "text": "Thank you for the five star review!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "113526031255055308348", "name": "Joshua Weaver", "time": 1522190219188, "rating": 5.0, "text": "Took a trip March 2018.  Captain Patric is fantastic.  We did an inshore trip due to the East wind.  We caught a few redfish and trout early on and covered some water.  We then pulled into Weeks Bay and the last couple hours just hammered redfish.  It was a blast.  At one point, we had three on at once.  My kids (2 boys - 9 and 11) called it the best!  Without a doubt recommend Ugly Fishing and Capt Patric.", "pics": null, "resp": {"time": 1523471448892, "text": "Thank you for the great review Josh! The conditions certainly were challenging but I try and roll with the punches that Mother Nature throws our way. I really enjoyed spending the day with you and your family. I hope to fish with y’all again in the future"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "105692210380610616167", "name": "BamaBassFishing TV", "time": 1525657027891, "rating": 5.0, "text": "Booked a trip for speckled trout fishing with Ugly Fishing LLC on 3/4/18 with family and I can honestly say Capt. Patric Garmeson did not disappoint! He is very knowledgeable of the sport and lifestyle of fishing teaching us alot of tips and tricks on how to be better fishermen. He made sure to put us on some fish and make us more than satisfied. He went above and beyond to make sure our only worry was getting our fish to the boat he took care of any entanglement or hooked fish to make sure we got back into the water and fishing asap. We caught our limit on speckled trout and even got into a mess of redfish. We will definitely be booking with Capt. Patric again in the near future! -Chance Mosley", "pics": null, "resp": {"time": 1525823999728, "text": "Thank you for the awesome review! It’s our pleasure to provide a memorable experience."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104861631481787973643", "name": "Corey Mosley", "time": 1525545816119, "rating": 5.0, "text": "May 4 2018 I called to schedule my First speckled trout charter with my boys. We were taken out by Captain Patrick.\n\nthings started a little slow at first then he put us on some redfish.\n\nwe caught a nice mess of fish only keeping 4 nice size reds then we moved around looking for specs with a hit and miss here and there .\n\nWe caught  a shark we released.\n\ntime moved on and we went to another spot where we started getting hits.\n\nthe spec bite turned on and we sat in that one spot and  limited out of some really nice specs.\n.\nWe had a blast out on the water all day\n\nCaptain Patrick was very knowledgable teaching us stuff and helping out .\n\nhe handled everything  all we had to do was fish.\n\nWe hooked up three and four specs at once multiple times  he definitly worked hard keeping our baits in the water to catch more fish\n\nI will defintily be goin back again lots of fun to be had when fishing with him. Corey .", "pics": null, "resp": {"time": 1525823836042, "text": "Thank you for choosing Ugly Fishing to be your fishing guide provider. Captain Patric strives for a high quality fishing and on the water experience. We hope to work with you and your family again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "104587862144712224183", "name": "Bill Holland", "time": 1499303486967, "rating": 5.0, "text": "Had a fantastic trip today with Ugly Fishing. Caught redfish, sheepshead and some of the largest speckle trout we've ever seen. Cptn. Patric was super, even when my grandson and his buddy (both 15) got lines tangled. We saw other boats struggling, but we got the fish. We HIGHLY recommend Ugly Fishing. Bill from Brandon Ms.", "pics": null, "resp": {"time": 1501528619889, "text": "Thanks for the awesome review Bill. I enjoyed watching the boys catch fish and don't you worry about the tangled lines because they will happen almost everyday. I hope that we can do it again."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102625499132121910309", "name": "Arrow Networking (Carl)", "time": 1509660850516, "rating": 5.0, "text": "I have fished with some other fishing guides but Patric with Ugly Fishing has to be the most versatile fisherman there is on the Gulf Coast. Twice I booked at charter at two different locations we were vacationing at, once at lower Mobile Bay and the other time at Dauphin Island. How he can find fish to catch no matter where he is amazes me!\nThe other time we have been fishing with Patric was on Christmas Eve day, wind blowing, cold, but we filled the cooler with delicious white and speckled trout!\nDon't think the price of the Ugly Fishing's charters are expensive. Patric works hard to make sure you have a great time and he has quite a lot of money tied up in his boat and tackle.\nPatric is a humble guy but he is top-notch in my opinion. Whether you are a seasoned fisherman or a first timer, don't hesitate to give Patric a call.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPHIA5_5tE8oSHkHxlqPeEhzbEAbsDePiVu4_ji=w150-h150-k-no-p"]}], "resp": {"time": 1510441145446, "text": "Thank you so much for the review Kyle. I look forward to our next trip.\n\nI enjoy learning the entire Mobile Bay and northern Gulf Coast to ensure that I can provide a very memorable fishing experience for all of our clients. Alabama may have a small coast line but we have a tremendous amount of high quality fishing."}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "107947675458331170884", "name": "Jason Haas", "time": 1529398467145, "rating": 5.0, "text": "Just Passing on several people's opinions.", "pics": null, "resp": {"time": 1530571048214, "text": "Thanks for the recommendation pal!"}, "gmap_id": "0x889a43d7fc7e52ed:0x48bc0edbe8fe04da"}
{"user_id": "102243688199585538714", "name": "Ramonalesa Fifth", "time": 1616178508374, "rating": 5.0, "text": "I love this place I use to live here and I should have stayed here looking for a good place to go and camp with a view check it out one of the best owners you will ever meet a beautiful caring soul", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "109168962694955633266", "name": "lydia lee", "time": 1551207256102, "rating": 3.0, "text": "Very nice place. It has a nice family feel to it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTRd0kFivJSt2uzS8A1R38vI5Yg9klaeNvrP0P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMQBvcp1TRAimWhYSWR4JKyCvtI_NdpgsAhoBg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOKtrzoxyvuulnZOmqA0CdIK7e0le3VYTKYRGfL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "104072022121275447786", "name": "Crystal Madru", "time": 1623751193791, "rating": 5.0, "text": "Great place to relax and unwind!", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "111506625377798742913", "name": "KJ Aubrey", "time": 1596340623251, "rating": 1.0, "text": "The owner was friendly over the phone at first, but I feel that she could have been more up front about the nature of her place. That would have saved us a wasted 23 mile trip both ways. Waterloo is a beautiful place, but I would rather stay on the free TVA land than at this so-called campground. The campground is actually a trailer park with some spots for camping. We stay in many campgrounds, some better than others, but this is the first time we have driven through a campground and left. I could not even find the camp office to begin with and everybody at the trailer park was staring us down when we drove through.\n\nWhen I couldn't find the office, I called the owner back to tell her we had changed our minds. She did not answer her phone. I got a phone call later on from a different number and it was the owner. I let her know that her park was not what we expected and that we had changed our minds. She got an attitude with me and said, \"Thanks for letting me know. I waited for you for over an hour.\" I then informed her that I had tried to call and she didn't answer. I did not bother to mention that she wasted an hour of my time and the gas that I used to drive to her disappointment of a trailer park that she is trying to pass off as a campground. If you do decide to camp in Waterloo, I would suggest that you turn right on the road before you cross the bridge into town and stay on the TVA land. It is well maintained, peaceful and it is free.", "pics": null, "resp": {"time": 1596388937393, "text": "I am sorry that our campground was not what you expected. Our property is 2 businesses, a small campground on the water with bathhouse, boat launch, fishing dock. The main portion are Lake lots that we lease yearly for vacation sites. It's not unusual for people to turn in the wrong drive; I keep meaning to get new signs but since my husband died in March I've been trying to juggle the whole thing alone. After we spoke, I did see that you had called the office number, which is supposed to be transferred to my cell phone. So I called you at 6:10 and we both missed each other. I apologize for my shortness, I have no excuse for that except that 14 hour days, 7 days a week sometimes gets me overwhelmed.   I'm usually pretty nice.  Our campground is usually not full in the fall, and the weather is perfect for camping. If you ever decide to reconsider camping with electric, water , and hot showers, I would be glad to make up to you your \"wasted 23 mile round trip\". Thank you for your review."}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "111580044071031207746", "name": "Michelle McFall", "time": 1548566200904, "rating": 4.0, "text": "Great place for sunsets and sunrise over the TN river. And eagle watching !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4XQU-RnNk40g-ish4FgdnH4V6gbfKhZDe3KuT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "107009208558358647785", "name": "Mary Morrison", "time": 1596397929775, "rating": 5.0, "text": "Been going to this campground for 13 years....it is like family and going home. We camp at many different campgrounds from private to state parks and they all offer different amenities.  At Hart it is shaded, beautiful views of the water, hot showers and friendly people...the owner treats everyone like family...we love Harts", "pics": null, "resp": {"time": 1596406455767, "text": "You are family! Thank you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "116395176407479116374", "name": "RV Mobile Repair, LLC", "time": 1572718148990, "rating": 5.0, "text": "A beautiful place to camp along the Tennessee River. Everyone seems really friendly there.  If you're there and you need some RV work call662 me306 at0937", "pics": null, "resp": {"time": 1583441164687, "text": "Thank You!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "116497042075129356365", "name": "Lee Hemming", "time": 1552742282552, "rating": 2.0, "text": "We were greeted by the very helpful and friendly owner. The views are beautiful, however with the description and great reviews, we expected a little more. This is more like a rustic fishing camp. It was recommended that we not use the coffee maker and the microwave at the same time. Yikes! 30 amp service is old. Picnic tables need help. Grass sites. Also there was a dog roaming in the park that was unfriendly, so we didn't feel comfortable having ours out and about. Paid $17 for the night, a fair price, probably. With a few upgrades, this could really be a hidden gem. Grocery and dining not close, so bring what you need.", "pics": null, "resp": {"time": 1552757632542, "text": "Thank you for staying with us, Mr. Hemming. Your review is pretty accurate, upgrading our electric and some cosmetic work on the tables etc have been in our plans. We actually met with the Utility Company last year , and are still waiting on their approval of the plans . The campground sites were built in the 1970's, and RV requirements have definitely changed since then. We do have some 50amp service, I'm sorry I did not show you those sites. I hope we will be able to get to work on that soon, and that when we do, you will come see us if you ever swing south again!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "106657943049957080985", "name": "Fred Pearson", "time": 1547833590304, "rating": 5.0, "text": "The most beautiful location,  and the owners and the friendliest people you would ever meet anywhere.", "pics": null, "resp": {"time": 1583441218845, "text": "Thanks Fred and Darlene!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "101108458958246713864", "name": "Rich Singh", "time": 1505543727621, "rating": 5.0, "text": "Hart Park is the most wonderful place on Earth. I want to live there, the Hart's are the nicest people and it's a wonderful place to stay visit at once .", "pics": null, "resp": {"time": 1505603420575, "text": "Thank you, Richard!! Come Back Soon - we miss you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "112044836098910936961", "name": "Sheila Gilbert", "time": 1527211783386, "rating": 5.0, "text": "Considering a purchase of a place here, it's looking like it's going to happen! I love the idea of having a waterfront summer place again.", "pics": null, "resp": {"time": 1527213688005, "text": "Thank you Sheila! We hope you and Rick decide to have your vacation home with us!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "103276936838777509212", "name": "Ricky Franks", "time": 1537204044561, "rating": 3.0, "text": "Great place for a family fishing and camping trip.", "pics": null, "resp": {"time": 1537288563048, "text": "Thank You! Hope to see you again soon!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "100929038730606830551", "name": "Cricket Hanback", "time": 1552663635354, "rating": 3.0, "text": "Great camping on lake in WATERLOO", "pics": null, "resp": {"time": 1552757066958, "text": "Thank you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "104470303809770742935", "name": "Ramona Fifth", "time": 1517187524722, "rating": 5.0, "text": "I use to live here love being near the water I miss it.", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "106853335721575062153", "name": "Carol Diane Poole", "time": 1534906501273, "rating": 3.0, "text": "Its a pretty place", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "109867373327648303697", "name": "Donna Robbins", "time": 1541541111726, "rating": 5.0, "text": "Peaceful on river", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "115309460698403558002", "name": "Kirt Daniel", "time": 1561778651390, "rating": 4.0, "text": "Beautiful", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "115787910258258649224", "name": "Tammy Woods", "time": 1478556078765, "rating": 2.0, "text": "Not taken care of.", "pics": null, "resp": {"time": 1478563869440, "text": "I'm so sorry you found us lacking, Ms. Woods. When did you camp with us? We try to maintain our Campground  to please all of our campers.  I hope you will let us know when you camp with us again and perhaps we can go over your concerns and make your stay more enjoyable! Thank you for your input."}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
