{"user_id": "100806810487255197312", "name": "Robin Otte", "time": 1630417727612, "rating": 5.0, "text": "We had a great experience with Budget Blinds! We had a skylight in our bonus room that left the room WAY too bright and hot.  They went above and beyond to ensure our satisfaction. The customer service is second to none!", "pics": null, "resp": {"time": 1630430014581, "text": "Thank you for allowing us to provide your cellular shade solution. Hope you and your guests enjoy the room darkening effect. We are so grateful for your business!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110447959062849173610", "name": "Jawan Olive Smith, Attorney", "time": 1624361284647, "rating": 5.0, "text": "Scott and his staff go above and beyond!  They sell quality products that are custom fit for the windows and have a huge selection!  Their service is impeccable. A year later after mine were installed, one of them fell.  I called Scott to look at it.  It was a problem in the construction of my property and has nothing to do with the blind installation. Scott, at no charge to me, fixed the construction defect, reinstalled the blind, and charged me nothing!   He is such a standout guy running a standout business!  Thanks Scott!  I will always use you for my window treatments!", "pics": null, "resp": {"time": 1542669363096, "text": "Thank you for the 5 star rating. You are a five star customer! Thank you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104232060758051464056", "name": "John Waggoner", "time": 1624212965654, "rating": 5.0, "text": "Scott is kind, thoughtful and has integrity with his work. He also does high quality work with his products and installation. The blinds we installed continue to work great. Thanks Scott!", "pics": null, "resp": {"time": 1624238277611, "text": "Thank you! It was a joy working with you. So glad you like your cellular shade -- great for energy efficiency."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110528638695384328760", "name": "Glenda Hodges", "time": 1616278653907, "rating": 5.0, "text": "Scott was always on time for appointments. I was shown several different products to choose from and there was no pressure from him as I made my choice. I ultimately chose shades and I am so pleased with the quality of the product.  The installer was great, what I expected to take up most of my day was completed in a short time.  I would definitely recommend this company.", "pics": null, "resp": {"time": 1616369986846, "text": "Thank you! We thoroughly enjoyed working with you and hope you enjoy the shades that complement your beautiful home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110729596662943453530", "name": "Becky Robertson", "time": 1617130689310, "rating": 5.0, "text": "I am so pleased with my shutter blinds and shades. They are just beautiful!  Scott and Jonathan were very professional and helpful to me.  I highly recommend using Budget Blinds!", "pics": null, "resp": {"time": 1617133314469, "text": "Thank you so much! It was a pleasure working with you and I hope you enjoy them for a long time! Great choice on the shutters and the color of the roller shades!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "118201662897147051026", "name": "Karen M", "time": 1611026109614, "rating": 5.0, "text": "We just had blind installed, and could not be happier with end result!  Scott was the best!.....from measuring windows all the way through installation.\nHe worked with us, helping to decide which blind would be best for us, will absolutely no sales pitches or pressure!  I recommend Budget Blinds 100%!", "pics": null, "resp": {"time": 1611108214065, "text": "It was a joy working with you! Your cellular shades provide the insulation you need, then open to enhance your amazing views. We are truly grateful for the opportunity to work with you in your beautiful new home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100588353604719356821", "name": "Kelley Notestone", "time": 1619656819282, "rating": 5.0, "text": "Scott was wonderful!  He made the process easy and stress free.  He was always available to answer questions and very patient.  I highly recommend Budget Blinds and Scott!!!", "pics": null, "resp": {"time": 1619718780527, "text": "Thank you so much! We loved your selections of faux woods, roller shades and woven woods in your lovely home. It was a pleasure working with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "116223984879432251832", "name": "Alice Murphy", "time": 1604366905423, "rating": 5.0, "text": "We needed to replace window shades in our LR/DR.  We checked several places and Scott at Budget Blinds was clearly the way to go.  They came to our house and helped us select just what we needed.  They came in quicker than expected and were installed within a few days. Everything was very professional and we highly recommend Scott at Budget Blinds. We are so pleased we are updating the kitchen next, and Scott is helping us.  Thank you for such a good experience.", "pics": null, "resp": {"time": 1604593960076, "text": "Thank you! It has been a pleasure working with you and Mr. Murphy! I hope you enjoy your shades and I look forward to working with you more!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "114148403031895722316", "name": "Pamela", "time": 1600814769605, "rating": 5.0, "text": "I recently had new window shades installed by Budget Blinds.  Scott was wonderful to work with and spent much time with me as he showed me samples and explained my options.  When the shades came in, he quickly scheduled a time to install.  I am beyond pleased with the new blinds.  They far exceed my expectations (and that’s saying a lot) and are perfect for the room.  I cannot say enough about the great customer service and quality of the product.  I highly recommend Scott at Budget Blinds to anyone looking into window treatments!\nPam Burkett\nFlorence", "pics": null, "resp": {"time": 1600878053056, "text": "Thank you for your great review! It was our pleasure to work with you! You have a beautiful home with views that are amazing! I'm glad we were able to provide what you were looking for, the privacy but opportunity to enjoy the views! Thank you again for the opportunity and it was a blessing to work with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108951067336753598962", "name": "Carol Streater", "time": 1598533899508, "rating": 5.0, "text": "A few weeks who Budget Blinds of the Shoals installed plantation blinds and solar shades on 27 windows in an old family home we have renovated. I would like to commend them for their great service. They came prepared and installed them in 4 hours. Disposed of all of their trash and cleaned up after themselves. I would not hesitate to recommend them to anyone. Very pleased!!", "pics": null, "resp": {"time": 1598579533289, "text": "Thank you! It has been a pleasure to work with you and an honor to help enhance your historic family home. You have done a beautiful job on the renovation. May you enjoy the blessing of family for many years to come!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108451332383691539291", "name": "Jordan Morgan", "time": 1598561548101, "rating": 5.0, "text": "Scott and Budget Blinds of the Shoals knocked it out of the park. Our shades are exactly what we wanted for our newly constructed home. We greatly appreciate his professionalism and prompt responses. Scott did a fantastic job helping us pick out the perfect shades. I would highly recommend them to anyone that is in the market for shades/blinds.", "pics": null, "resp": {"time": 1598580017020, "text": "Thank you, Mr. Morgan! It was a pleasure working with your family in your beautiful new home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112283843090457831150", "name": "Keith Collier", "time": 1612322948540, "rating": 5.0, "text": "A great job by some great people! Professional, on time, within budget and even cleaned up ! Will be doing more business in the future!", "pics": null, "resp": {"time": 1612358114752, "text": "Thank you! I'm glad the shades took care of the sun issues for you! You have a great store and look forward to visiting more!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108966324509390002491", "name": "Glen Doane", "time": 1610150102580, "rating": 5.0, "text": "Excellent customer service!  Ordering and installation professional!  Highly recommend!", "pics": null, "resp": {"time": 1610202603557, "text": "Thank you! It was a pleasure working with you! You have a beautiful home with beautiful views! I think the shutters add beauty to your already beautiful remodel! I hope you enjoy them a long time!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "118317294281475178752", "name": "Kristy Gist", "time": 1609786173865, "rating": 5.0, "text": "Budget Blinds of the Shoals is great to work with. Very friendly and knowledgeable of their products!", "pics": null, "resp": {"time": 1609791003260, "text": "Thank you Mrs. Gist! You have a beautiful home and it was a pleasure working with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108582657745930615705", "name": "Thomas McGill", "time": 1600813203220, "rating": 5.0, "text": "Budget Blinds got the blinds for our house in a timely manner even during the Covid pandemic. They installed the blinds in a couple of hours, cleaned up before they left, and were very professional. Our house has 21 doors and windows that have blinds or shades so it was not a small job. We highly recommend this company.", "pics": null, "resp": {"time": 1600877895615, "text": "Thank you Mr. and Mrs. McGill. It was a joy to work with you both! You have a beautiful new home and we are thankful you allowed us this opportunity to be a part of your new home!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112038141375276108263", "name": "Sierra Ginevan", "time": 1600129269114, "rating": 5.0, "text": "Excellent customer service and fantastic products.\nScott went above and beyond. I highly recommend budget blinds of the shoals!", "pics": null, "resp": {"time": 1600133428008, "text": "Thank you! We are grateful for the opportunity to work with you. Enjoy your shutters and your beautiful views."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112514088290715400485", "name": "Glenda Williams", "time": 1594776618479, "rating": 5.0, "text": "I am very pleased with the service that was offered. I love my blinds and I am happy I chose Budget Blinds.", "pics": null, "resp": {"time": 1594821980182, "text": "We're so happy you love your dual shade!! Thank you for the opportunity and it was a joy to work with you!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "106326631130228304613", "name": "JONATHAN PARKER", "time": 1593045600710, "rating": 5.0, "text": "Thank you for a professional job well done. We strongly recommend!", "pics": null, "resp": {"time": 1593108376139, "text": "Thank you sir. It was a privilege to work with you and Mrs. Parker! I hope you enjoy your interior shutters and you amazing new home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108150382972821792614", "name": "Darti Eason", "time": 1578410540167, "rating": 5.0, "text": "I was so impressed with Scott.  He was knowledgable and  seemed very experienced.  It made the selection process painless.  The installation was just as easy.  Scott and Aaron were quiet and efficient...and left no trace.  The plantation shudders are stunning!", "pics": null, "resp": {"time": 1578415242849, "text": "Thank you so much! It was our pleasure to help enhance your beautiful home with new window coverings. It was a joy to work with you and look forward to serving you again!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115167653085298250602", "name": "Roger Mardis", "time": 1590544357127, "rating": 5.0, "text": "Scott does great work with a great product...check with him for your next job.", "pics": null, "resp": {"time": 1590584582325, "text": "Thank you Mr. Mardis! It was a pleasure to work with you. Thank you for your patience during this COVID pandemic! You have a beautiful new home, welcome back to the Shoals!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "103479278903817114537", "name": "Susan Pass", "time": 1574026055693, "rating": 5.0, "text": "I highly recommend Budget Blinds of the Shoals! Scott and Donna came to my house to help me find a thermal covering for a huge west-facing plate glass window in my 2 story foyer. Scott showed me his solar shade and how it could greatly reduce the amount of heat the window produces in the summer. He was very professional and knowledgeable, but no pressure. And it was reasonably priced. I am thrilled with the solar shade!!! He did a fantastic job of installing it...and the color matches my trim beautifully!  I also asked him about new blinds for our LR/DR...and they fit perfectly as well...they were installed in a jiffy. Very pleased and would definitely use Scott’s services again.", "pics": null, "resp": {"time": 1574038100550, "text": "It was a joy working with you and Doug on this project! Thank you for trusting Budget Blinds of the Shoals with window coverings for your beautiful home."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "107246742670896907520", "name": "Micheal Rea", "time": 1570730480180, "rating": 5.0, "text": "Budget Blinds has excellent customer service and goes above and beyond to make sure the customer is 100 percent satisfied with their products.  Very friendly and easy to work with.  I would 100 percent recommend them to anyone.", "pics": null, "resp": {"time": 1570744624170, "text": "Thank you Mr. Rea. It has been my pleasure working with you on the Plantation Shutters, Roman Shades and future Woven Woods! Thank you again and I look forward to working with you more!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104029690515507052446", "name": "Jo Robinson", "time": 1544545911753, "rating": 5.0, "text": "Scott with Budget Blinds of the Shoals is a true pleasure to work with.  He is honest, friendly, cooperative, and goes over and beyond his duty to make your budget work for window treatments you want.  His products are quality and guaranteed.  He will work until you are completely satisfied and will provide you with the best pricing.   I highly recommend him for any window treatments you need.", "pics": null, "resp": {"time": 1544580992675, "text": "Thank you so much Mrs. Robinson. It was great to work with you and Mr. Robinson! I'm so happy that you love your shutters and the shutters for the arches!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115708644977551185642", "name": "Denise Retherford", "time": 1582078910428, "rating": 5.0, "text": "I am so pleased with my blinds. Scott was most professional and kept to his timeline. I would highly recommend his company!!", "pics": null, "resp": {"time": 1582161832121, "text": "You are so very kind! It was an honor to work with you! You were a blessing! It was great to be able to sit down and talk about life!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "102032903741287095190", "name": "Elizabeth Shelton", "time": 1593707921065, "rating": 5.0, "text": "I can not say enough about how scott an his staff.They were on time,professional, cleaned after they were done,but most importantly, scott made sure they were perfect. If they weren't, he took them down an started again. I am more than pleased an so so happy with my shutters.Thank you Budget Blinds!!!", "pics": null, "resp": {"time": 1594040407467, "text": "Thank you!! It was our pleasure to work with you and meet your family! I hope you enjoy your shutters and you can finish your remodel soon! THANK YOU for the Grapico!!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "106843234061663669677", "name": "Tigger R", "time": 1569799618560, "rating": 5.0, "text": "Scott was great! We love our plantation shutters. Great quality and quick installation process.", "pics": null, "resp": {"time": 1569846575614, "text": "Thank you for allowing Budget Blinds to be a part of your new home! Welcome to the area. It was our pleasure to work with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110695379660150753065", "name": "Tammy Fisher", "time": 1569440299509, "rating": 5.0, "text": "Great experience from start to finish! Scott was absolutely awesome. Thank you for listening to what I  wanted.", "pics": null, "resp": {"time": 1569427263806, "text": "Thank you so much!! It was our privilege to work with you! You did an amazing job picking the color and I thought the draperies looked awesome! Thank you again, you have a beautiful home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115274663400397727919", "name": "dixie griffin", "time": 1594333429481, "rating": 5.0, "text": "We recently remodeled the den and kitchen area of our home. I knew I wanted shutters and blinds for the window treatments so I researched the internet.  I found Budget Blinds of the Shoals’ website so I gave Scott a call. We couldn’t be be more pleased with the end results! Our shutters and blinds gave us exactly what I wanted. I highly recommend Budget Blinds if the Shoals.", "pics": null, "resp": {"time": 1594404252296, "text": "Thank you so much, Mrs. Griffin. It was a pleasure working with you on window coverings to enhance your beautiful remodel!  Let us know when we can serve you again. Blessings to you and your family."}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100153198076260721379", "name": "Debbie Clark", "time": 1554556481371, "rating": 5.0, "text": "Wonderful service.  Scott was so professional. So knowledge of his product. Very helpful with selection.  The shutters look great and add so much to my bedroom", "pics": null, "resp": {"time": 1554596884106, "text": "Thank you so much! You were a joy to work with and appreciate your patience. You have a BEAUTIFUL lake home!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "101752865936099779587", "name": "Richard Ingram", "time": 1568977763408, "rating": 5.0, "text": "Scott was efficient and competitive.  The installer did a neat and clean job.  We would definitively do business with them again.", "pics": null, "resp": {"time": 1568980223261, "text": "Thank you Mr. Ingram! It was our pleasure to work with you and Mrs. Ingram! You have a beautiful new home! Welcome to the Shoals!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100990331814188210808", "name": "Kenny Gammill", "time": 1585702867937, "rating": 5.0, "text": "Scott and his team are amazing! From start to finish I was extremely pleased. The product and installation exceeded my expectations. I highly recommend Scott and Budget Blinds!", "pics": null, "resp": {"time": 1590796008876, "text": "Thank you so much, Mr. Gammill, for trusting us to provide the window coverings for your beautiful home. We truly appreciate you and your family!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "107036237154961916638", "name": "Seth Stanfield", "time": 1575670273670, "rating": 5.0, "text": "Very knowledgeable and will work closely with customer to ensure the best possible plan for installing blinds and shades. Highly recommend.", "pics": null, "resp": {"time": 1575727090018, "text": "Thank you Seth!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104869818250775136590", "name": "Gloria Richardson", "time": 1570803411716, "rating": 5.0, "text": "Scott and Aaron were awesome. We moved from Texas and had only been in our new home once. I called Scott and he went to the house and ordered the blinds. I could not have done it better myself. I totally trusted him and he delivered. Would use them again.", "pics": null, "resp": {"time": 1570805181570, "text": "Thank you! It was my pleasure to work with you! Welcome to the Shoals and hope you love it here!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "117149808394786969202", "name": "Cam Price", "time": 1560887651557, "rating": 5.0, "text": "What was promised was done. The product is great but the service was even better. Will definitely use Scott and Budget Blinds of The Shoals for next project.", "pics": null, "resp": {"time": 1560890998202, "text": "Thank you Cam. It was great to work with you and your beautiful renovated church! I'm happy that we were able to solve the heat issue problem but not hide those beautiful stain glass windows!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112693659010726080148", "name": "Kelly Graham", "time": 1570637919831, "rating": 5.0, "text": "Scott did a great job on our Plantation Shutters.  I highly recommend Budget Blinds of the Shoals!", "pics": null, "resp": {"time": 1570644123406, "text": "Thank you so much! It was our pleasure to work with you! Hope you enjoy the Plantation Shutters!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108635712013319093199", "name": "Danny OToole", "time": 1560863483750, "rating": 5.0, "text": "Great service with great knowledge of all product lines and options   Really helped us decide which blind we needed in each window   Nice to deal with a company that communicates and follows up.  Highly recommend!", "pics": null, "resp": {"time": 1560864589815, "text": "Thank you Danny! It was a privilege to work with you and Becky! You have a BEAUTIFUL home and I think the shutters were a great choice!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "108689622310885570921", "name": "Alaina Anderson", "time": 1576555625899, "rating": 5.0, "text": "Great experience, very professional and I’m very happy with my bamboo shades!", "pics": null, "resp": {"time": 1576584017551, "text": "Thank you Mrs. Anderson. It was our pleasure working with you and look forward to working with you again! We're so happy you love your woven wood shades!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "114521551518191102670", "name": "Lee Lambert", "time": 1566658121933, "rating": 5.0, "text": "Scott's team really did a great job installing my blinds!  I would reccomencd them to anyone. Real professional.", "pics": null, "resp": {"time": 1566746891152, "text": "Thank you Lee! It was our pleasure!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112077648261857904353", "name": "Carol Jones", "time": 1582139979974, "rating": 5.0, "text": "Love our new blinds at river. I would recommend Scott at budget blinds of the Shoals for all your window coverings. He was fast and very easy to work with. Can't wait till spring to start staying there. Thanks again Scott.", "pics": null, "resp": {"time": 1582220229167, "text": "You are very kind! Love you Lake Home!! The Solar shades was a great choice for you and your family. To be able to still see the beautiful views but keep the sun out! I hope you enjoy them and thank you for the opportunity to work with you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "113412619936022911580", "name": "Allison Click", "time": 1546837625712, "rating": 5.0, "text": "Scott does a terrific job & is great to do business with. He knows his stuff! I highly recommend Scott & Budget Blinds.", "pics": null, "resp": null, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115469340608566029954", "name": "Brooke King", "time": 1557195515965, "rating": 5.0, "text": "Scott is very professional and quick to respond. He does quality work, and I would certainly recommend calling Budget Blinds for any window treatments!", "pics": null, "resp": {"time": 1557231801371, "text": "Thank you so much! It is an honor and a pleasure to work with you, Will, Melanie and Sam!!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "115728510914811849585", "name": "Steve Merry", "time": 1552934543237, "rating": 5.0, "text": "Great service.  Very personable.  Enjoyed working with them.  Very good selection of blinds to choose from.", "pics": null, "resp": {"time": 1543190804319, "text": "Thank you Mr. Merry. It was my pleasure! Thank you for choosing Budget Blinds!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "116351463595486411655", "name": "Mickey McClure", "time": 1569427061894, "rating": 5.0, "text": "Great experience, very prompt and installed on time as agreed.", "pics": null, "resp": {"time": 1569447391029, "text": "Thank you Mr. McClure! I appreciate you helping me getting started in the business and glad I was able to work with you and your mom! She is a sweetheart!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "100207699221190636064", "name": "signman Bob", "time": 1561485626383, "rating": 5.0, "text": "Outstanding service and very knowledgeable professionals.  They were very careful to cover their feet when coming into my house and did a beautiful job with the installation all around.", "pics": null, "resp": {"time": 1561487352296, "text": "Thank you so much for your review! It was our privilege to serve you!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "104824978378226527741", "name": "Shelly Stepp", "time": 1570660336267, "rating": 5.0, "text": "Scott and crew were very professional andeasy to do business with. Our school's upgrade looks amazing!", "pics": null, "resp": {"time": 1570661794264, "text": "Thank you! You, your staff and kids were so sweet and great to work with! Thank you for this opportunity and hope you enjoy the shades!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "109441850038843912764", "name": "Vanesha Mason", "time": 1569155884102, "rating": 5.0, "text": "Budget Blinds has great service and knows how to please their customers!!!", "pics": null, "resp": {"time": 1569161923027, "text": "Thank you, it was our pleasure! Enjoy your new home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "106718705749550003098", "name": "Jennifer Berry", "time": 1554433908622, "rating": 5.0, "text": "Great customer service and products!  Would definitely use them again!", "pics": null, "resp": {"time": 1554499620440, "text": "Thank you so much! It was a pleasure working with you! Hope you enjoy them!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "112440617228680610449", "name": "Jeannie Epperson", "time": 1571759596208, "rating": 5.0, "text": "Great, friendly, professional service.", "pics": null, "resp": {"time": 1571765335509, "text": "Thank you so much! It was our pleasure and I look forward to working with you again! I hope your son enjoys his new home!"}, "gmap_id": "0x88623f6d2b5de441:0x5ae566fbd4a5bfe"}
{"user_id": "110063225943498164957", "name": "Jennifer Pearce", "time": 1623111501405, "rating": 5.0, "text": "I'm so pleased with my shutters and blinds. They are beautiful and were perfectly installed. My home feels cozy and more like home now. Thank you, Budget Blinds!😊", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105242807437046218713", "name": "Brian Johnson", "time": 1622225095163, "rating": 5.0, "text": "Great experience once again.  Designer helped me pick out the cellulose blinds I needed to blackout my room.  The installers were on time and installed quickly and professionally.  Will use again.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106993416586624190429", "name": "Nancy Edwards", "time": 1623592058595, "rating": 4.0, "text": "Good service overall. Some inconsistency with ability to \"set\" desired height of shades when operating. Installation issues: One set of shades were hung unevenly & techs did not fix the problem.  Most hardware from old shades were left on th floor. Did not install hardware to retain cords.", "pics": null, "resp": {"time": 1623693193285, "text": "Hi Nancy, thank you for the generous review, given the issues you describe above. We are about to call you to get these taken care of."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "109235499176316209452", "name": "Marty Russo", "time": 1620066323314, "rating": 4.0, "text": "Some great people working there..one of a kind products. Very professional!!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "118197390954157557612", "name": "Laurel Thomas", "time": 1599837881629, "rating": 5.0, "text": "Budget Blinds did a great job caring for my historic home!   They put up beautiful indoor shutters that go beautifully with a house built in 1908.  Upon installation they were careful with the woodwork and even though the windows are odd sizes they fit perfectly.  I need two other bedrooms done so I will definitely be calling them back when we finish painting those rooms.", "pics": null, "resp": {"time": 1600361927088, "text": "Thank you. The plantation shutters are classic. We are glad to hear they work well for you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "104169811529090968217", "name": "Kathy Royals", "time": 1601652039636, "rating": 5.0, "text": "Dealing with Budget Blinds here in Mobile, AL was an excellent choice.  Very professional, knowledgeable about their products and friendly as well. From the beginning consulting with Donna coming to my home to the installers I give them all an A+.\nYou won't go wrong with choosing Budget Blinds.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105697215266454755311", "name": "Laura Perez", "time": 1593792224527, "rating": 5.0, "text": "I love my shutters from Budget Blinds! I purchased a house with a set already here and hunted down who had put them in because I loved how they looked in the bedroom already. I then wanted the same in other rooms of the house!  Glen came to house and matched the style and color so that they matched and fit perfectly. When shutters came in they sent a friendly guy out to install quickly. He worked hard and cleaned up nicely afterwards. I highly recommend!", "pics": null, "resp": {"time": 1594062819001, "text": "Thank you for the kind words. We are so happy you love the plantation shutters."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "117432455342111124105", "name": "Jim Jacobs", "time": 1599838387872, "rating": 5.0, "text": "Budget Blinds did an excellent job from start to finish. Donna helped throughout the process from measuring, ordering, and putting  up temporary shades when we needed them. The installation crew did a fantastic job installing the blinds. If you need blinds highly recommend giving Budget Blinds a call. They will take care of you.", "pics": null, "resp": {"time": 1600361714092, "text": "Thank you, Jim. It was a pleasure."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "101807759364284643517", "name": "Richard Crump", "time": 1583169739274, "rating": 5.0, "text": "It was great working with the Budget Blind team. From the initial appointment to discuss shutter options all the way through installation they were always on time and helpful. You can’t beat the quality, service, and professionalism that Glen and his team bring to the table!", "pics": null, "resp": {"time": 1584110051809, "text": "Thank you Richard. It was a pleasure working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105506481432503955386", "name": "Scout’s Awesome Channel", "time": 1583174978658, "rating": 5.0, "text": "We worked with Donna on our blinds and she was great. Super knowledgeable and professional. She gave us great advice and had samples of everything. The installation was quick and everything came in within the stated timeframes. I would highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "115067938088084911827", "name": "Sarah Stanton", "time": 1595868131375, "rating": 5.0, "text": "They are very friendly and quick. From the consultation to the installation took about two weeks to complete the project. This is the second time I’ve used budget blinds and highly recommend them!!!", "pics": null, "resp": {"time": 1600362099698, "text": "Thank you. It was a pleasure."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "103096849534184173618", "name": "Helen Inge", "time": 1601653294816, "rating": 5.0, "text": "Our recent project with Budget Blinds could not have been easier. We've used them over the years and continue to experience the same excellent professional service.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "114616569362032656018", "name": "Iris Jackson", "time": 1593635507488, "rating": 5.0, "text": "Glenn was my sale consultant, he was very thorough in his work, he talked thru all the details of my blinds that I ordered, helped me choose the correct style of blinds for my home and made the process easy, the young man that installed my blinds was very professional and courteous, and when I had a question after ordering, someone always picked up the phone with a pleasant voice. I highly recommend this company for all your window needs.", "pics": null, "resp": {"time": 1594063605991, "text": "Thank you so Much Mrs. Jackson. We are glad you are pleased with the interior shutters. They handle arches like yours particularly well."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "117669765747809049382", "name": "Brandon Jackson", "time": 1594656472617, "rating": 5.0, "text": "Great blinds at a great price! Installer was courteous and professional, the sales consultant was helpful and easy to reach throughout the whole process.", "pics": null, "resp": {"time": 1600362213892, "text": "Thank you. It was a pleasure working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "118247287391936143894", "name": "Jessica Sweeney", "time": 1595876302190, "rating": 5.0, "text": "Great customer service. Beautiful blinds. Excellent experience.", "pics": null, "resp": {"time": 1600362034534, "text": "Thank you for the kind words. We hope you are enjoying the cellular shades."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "105471312955487649028", "name": "AJ Muller", "time": 1592840777669, "rating": 5.0, "text": "Excellent product and professional installation.  We’re very happy with the blinds and shutters.", "pics": null, "resp": {"time": 1593187995723, "text": "Thank you for the review. I enjoyed working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "112059471671980016966", "name": "Leslie Nelson", "time": 1591217010440, "rating": 5.0, "text": "Quality product, great team!    Thank you to Donna and the installer,  very happy with my purchase!", "pics": null, "resp": {"time": 1591371806540, "text": "Thank you for the review Leslie. We are glad to hear you are enjoying the new cordless roller shades."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "102750089811379891085", "name": "Harper Groom", "time": 1593197977443, "rating": 5.0, "text": "Great process start to finish. Would highly recommend Budget Blinds.", "pics": null, "resp": {"time": 1593613475610, "text": "Thank you so much. I hope you enjoy the shades and blinds."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "112303192095071819119", "name": "Clay Doyle", "time": 1583173681198, "rating": 5.0, "text": "Glenn and the rest of the Budget Blinds team are extremely professional. The entire process was easy and the blinds look great!", "pics": null, "resp": {"time": 1584108012141, "text": "Thank you for the kind words. I hope you enjoy the shutters."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "107068136901083212921", "name": "Paula Helmly-Parker", "time": 1592955475739, "rating": 5.0, "text": "Very helpful staff. Have not ordered blinds yet but plan to use them when ready.", "pics": null, "resp": {"time": 1593188021907, "text": "Thank you Paula. We are looking forward to working with you."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "100135601899193879757", "name": "David B", "time": 1583171563987, "rating": 5.0, "text": "Wonderful team of people. Very helpful staff and excellent work!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "110783828943478665577", "name": "Bill Duke", "time": 1601058474694, "rating": 1.0, "text": "Made time for appointment.\nMessaged me on the day of the appointment at 6:54 in the morning and canceled. I don’t understand this kind of treatment from merchant who is trying to make money. I will not bother to use them again.", "pics": null, "resp": {"time": 1601302615689, "text": "Hi Mr. Duke I am so sorry that we found it necessary to cancel the appointment. We do not cancel appointments lightly. The appointment was scheduled by mistake as we do not offer the product you are looking for. The designer caught the error when she was reviewing her appointments for the day. As she said in her text to you, we do not offer screens. She felt it was best to let you know as soon as she had discovered the error. She used text instead of a call due to the early hour. Also, we have found text is the best way to communicate with the majority of our customers. Again, I am sorry that did not work for you. I hope you find the screens you need. If I can be of any assistance, please call the office and ask for Glen."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "107451092853362278859", "name": "Brenda Barnes", "time": 1571402513983, "rating": 5.0, "text": "Good place to shop. Excellent service.", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "104279699730317476463", "name": "Eric Droblyen", "time": 1528988914680, "rating": 5.0, "text": "Friendly and timely service.  Had a problem with a motorized blind.  Company got me a replacement ASAP!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "100675848324794942851", "name": "JOE VERNEUILLE", "time": 1582855958049, "rating": 5.0, "text": "Very professional and efficient", "pics": null, "resp": {"time": 1582926681467, "text": "Thanks, Joe. I hope you love the new shutters."}, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106292150084210782495", "name": "Leo Reed", "time": 1549051807549, "rating": 5.0, "text": "So far so good!", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1546699896108, "rating": 5.0, "text": "Really professional staff", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "109525881319931606934", "name": "Phil Martinez", "time": 1549994845403, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x889a4cffbd3ca347:0x2f5d7ba064928087"}
{"user_id": "103908521611964126159", "name": "Brad Nicolini", "time": 1517007134128, "rating": 5.0, "text": "I tried several other companies in the area and these guys are the best!!! They were on time, super friendly and care about quality. Best quality and cheapest price anywhere. Don’t settle go with The Blind King... love these guys!!!", "pics": null, "resp": null, "gmap_id": "0x889a6887f3729323:0x9daacbed46a74cfe"}
{"user_id": "109168618629265597203", "name": "Stephanie Collins", "time": 1533780054794, "rating": 5.0, "text": "I was very satisfied with  how my sun room  blinds were done.  The owners of the company were very professional in providing excellent and quality service.  I would recommend this company to anyone looking for blinds or any other types of window treatments at an affordable cost!", "pics": null, "resp": null, "gmap_id": "0x889a6887f3729323:0x9daacbed46a74cfe"}
{"user_id": "105157695958151343431", "name": "Chad 2020 (Chad2018)", "time": 1546714946319, "rating": 5.0, "text": "Great customer service, friendly staff and AMAZING SELECTION. Awesome experience with a smile... I will be telling all friends and family where to get their blinds!!! Loved the entire experience....", "pics": null, "resp": null, "gmap_id": "0x889a6887f3729323:0x9daacbed46a74cfe"}
{"user_id": "104972254677560012252", "name": "Michael Baines", "time": 1529505077639, "rating": 5.0, "text": "Best Blind Job Ever! Work was completed quickly and correctly the first time.", "pics": null, "resp": null, "gmap_id": "0x889a6887f3729323:0x9daacbed46a74cfe"}
{"user_id": "100682807683298467076", "name": "Keegan The Vegan", "time": 1513690699165, "rating": 5.0, "text": "They did an excellent job and are reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x889a6887f3729323:0x9daacbed46a74cfe"}
{"user_id": "108461345992821767233", "name": "Karen Landrum", "time": 1523567259727, "rating": 5.0, "text": "I’ve never needed to order draperies before & I was looking in the Yellow Pages & found Western Draperies.  I asked the gentleman who answered the phone if they made block out draperies & he said yes.  The rest was history as Mary came out & made some measurements in my “hot box” bedroom.  I’ve been on my own since I was 21 & moved out of this house ever since.  Mama passed away & she loved lacy valances & mini blinds but it was too hot in this front bedroom.  I moved back in as I knew it would benefit both daddy & I.  But the sun came in fast & furious & I sleep better when it’s dark.  Mary was very personable & definitely knew what she was doing.  My draperies are beautiful!!  And they work so very well w/blocking out that sun that baked me in the early morning.  Her husband was such a nice man & did a wonderful job installing my drapes.  I was like a kid in a candy store!! 👍🏼 💯% satisfied customer!!", "pics": null, "resp": {"time": 1554999857341, "text": "Thank you so much, Karen! We really appreciate the review!"}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "109332975547593912319", "name": "cash wilkerson", "time": 1476814263290, "rating": 5.0, "text": "Great... both Mary and Phil are true professionals ... magicians with the fabric.\n\nTwo big thumbs up.", "pics": null, "resp": {"time": 1477684242947, "text": "Cash, thanks for the nice review and for your business!"}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "115502573476427931475", "name": "Mike Denton", "time": 1448313185336, "rating": 5.0, "text": "We were looking for someone to make a half circle window treatment (fanlight approx 3' x 6') for us, but found that no one did that kind of work anymore. It was the look we wanted. We were finally referred to Western Drapery in Homewood. They have a new vender who will make any shape frame you want from a template. After discussing the way fabric would go on the frame with the kind people at Western Drapery, we decided that we could do it ourselves as long as we had the frame. So after carefully measuring and creating the template, it was ordered, made, and shipped. We attached sheer fabric to get the star burst look we wanted to achieve and the end result was perfect. We couldn't have done it without Mary and her brother at Western Drapery and the company that made the form. They were both great to work with.\n\nMike and Randy Denton", "pics": null, "resp": {"time": 1449507015705, "text": "Thank you Mike for leaving the great review.  We appreciate your business and hope your window treatment is perfect for you."}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1504276276388, "rating": 5.0, "text": "They do amazing work!!", "pics": null, "resp": null, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "117097590346646117872", "name": "Cameron al Shaqar", "time": 1592312514772, "rating": 5.0, "text": "Tatiana at Calico Corners in Hoover is lovely! She is so knowledgeable and has helped me make my house just the way I wanted it. She is clear, concise, works within my budget, and an all-around fantastic decorator and person!", "pics": null, "resp": {"time": 1596552875630, "text": "Hello Cameron,\n\nThank you for taking the time to complete our survey and for the 5 star rating! We are happy to hear that you had a great experience at our store with Tatiana, we will definitely let her know.. We look forward to working with you again very soon. Thank you - Vik"}, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "117737124671984138232", "name": "Julie King", "time": 1498072205869, "rating": 5.0, "text": "Excellent service! Tatyana is like having your own designer- so talented and willing to help. The store is clean and organized, and again the customer service is fantastic. I won't be going to any other fabric stores- they have it all!", "pics": null, "resp": null, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "115907037500852997677", "name": "Merrilyn Cook", "time": 1532090806408, "rating": 5.0, "text": "Great selection of fabrics and great service. Be sure to see Jeannie. She is wonderful!", "pics": null, "resp": null, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
{"user_id": "115141523618536058183", "name": "Mary Jane Karwoski", "time": 1489884428554, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8889226b77fa5111:0x5ed1145ff87b0598"}
