{"user_id": "116289214289302660854", "name": "Jeremy Baker", "time": 1628176563287, "rating": 5.0, "text": "I’ve been going to the Mobile location since they opened, right before Covid hit. They’ve always appeared to be diligent about keeping the donors and their employees safe. The location gets busy sometimes in the early morning and late evening, but they usually adapt and make it work. Staff is very friendly and always willing to answer questions and address any discomfort. The repeat donor programs and coupons are fairly lucrative and pop up frequently.", "pics": null, "resp": {"time": 1628261837668, "text": "Hello Jeremy, we appreciate you taking the time to leave us this review.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117569283765167629583", "name": "Levi Davis", "time": 1620403639766, "rating": 4.0, "text": "My donation today was awesome. The processing had a really long line for returning. Ms. Regina was my donation specialist. She was very on top of it. So quick at setting up to my stick. The stick was painless and swift. She was very attentive to her section that was constantly full. Also she was very respectful and professional even during less desirable situations. Hope I get her every time I’m in.", "pics": null, "resp": {"time": 1620657615255, "text": "Hello Levi, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103354158762850465487", "name": "lisa marlowe", "time": 1628259978944, "rating": 5.0, "text": "Very clean very friendly staff easy to do and help save lives", "pics": null, "resp": null, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117279566708766283349", "name": "Sydney Burt", "time": 1625092479722, "rating": 5.0, "text": "This was my first experience donating plasma & I'm glad it was at this location. The staff is very nice & made me feel completely comfortable through the entire process. I highly recommend coming here.", "pics": null, "resp": {"time": 1625147499804, "text": "Hello Sydney, thank you for taking the time to leave a review for us at BioLife Plasma Services. We're happy we could meet your expectations.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "107772571432839366622", "name": "Gabrielle W-P", "time": 1615491760158, "rating": 5.0, "text": "I was fearful of what to expect, but the facility is clean and beautiful. The staff is AMAZING. I’ve been to the Mobile location 3x and each experience had been better then the last. Today a tech was about to leave, as her shift was finished. However, she returned to her station to make sure a gentleman was given immediate assistance. Kind and impressive! I definitely  recommend this location. Give today!", "pics": null, "resp": {"time": 1615559580445, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "104975512853097909858", "name": "Josh Murray", "time": 1621962671554, "rating": 5.0, "text": "This place is great.  The staff very much cares about their donors.  Highly recommend going here if you want to donate plasma.", "pics": null, "resp": {"time": 1622034188297, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "101452492376349490586", "name": "Rhiannon Summers", "time": 1622665004957, "rating": 5.0, "text": "Much more organized and thorough than the others I have used. The appointment system ensures that you are in and out in a timely manner as well.", "pics": null, "resp": {"time": 1622724480176, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "108322900650254962632", "name": "Jennifer King", "time": 1619204078139, "rating": 5.0, "text": "Love our Mobile location!  Staff is always kind & professional, facility is always so CLEAN, & my favorite phlebotomist Regina goes above and beyond. The staff do a great job of getting people in and out as quickly as possible too. Check them out & save a life!", "pics": null, "resp": {"time": 1619529550550, "text": "Thanks for the awesome review, Jennifer! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Thanks again for your feedback!"}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "107169235199984568745", "name": "Fujin Wind", "time": 1627224939237, "rating": 5.0, "text": "The people are great and the attention and atmosphere is like no where else", "pics": null, "resp": {"time": 1627306590715, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103768410834778404641", "name": "Angelica Walley", "time": 1619811657536, "rating": 4.0, "text": "Had a great experience today with lorie no pain! Didn't even feel the needle. Everyone is very friendly. The only downside was the wait but there were a lot of new donors there today as well", "pics": null, "resp": {"time": 1620054456525, "text": "Hello Angelica, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110370603632357209954", "name": "kourtney hatcher", "time": 1619135935490, "rating": 3.0, "text": "The best one in mobile, but dont waste your time with evening appointments, because they will lie to you and tell you your levels are not good. I had a 6:40 pm appointment and sat there and watched them tell 2 people ahead of me that there vitals were off and them me, when i never have a problem with my vitals when i come at any other time.", "pics": null, "resp": {"time": 1619149816866, "text": "Thank you for providing your feedback. All prospective donors are important to us and we would like to speak with you directly on this topic and about your experience. Please email us at BioLifeMarketingAndCommunications.US@takeda.com and let us know the best way to contact you."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117364784545817030071", "name": "Andrew Walters", "time": 1624548838238, "rating": 3.0, "text": "They don't like to answer the phone apparently. It rings a few times then just hangs up.", "pics": null, "resp": {"time": 1624652087195, "text": "We're so sorry for this phone frustration Andrew.  Please email us at BioLifeMarketingAndCommunications.US@takeda.com and we will forward along any concern/question.  Make sure you include your name, center, and best way to contact you.\rThank you!"}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "100927476594592710345", "name": "amber pierce", "time": 1604610607667, "rating": 5.0, "text": "Bio Life Plasma Services is a wonderful donation center.  I have not used other centers.  But their staff is so friendly and helpful.  Everything is nice and clean.  I never have to wait.  I use their app to make and change appointments. Super easy.  I highly recommend using them if you're thinking of donating plasma.  🙂", "pics": null, "resp": {"time": 1604670955291, "text": "Hello Amber, we appreciate you taking the time to leave us this review.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106148435366517379974", "name": "Sherry Pruitt", "time": 1612913493663, "rating": 5.0, "text": "CLEAN! CLEAN! CLEAN! I have donated at a different facility and questioned the sanitation process, but not here wonderful facility friendly staff. It is also the fastest process no long lines to wait in, I'm in and out in one hour and 30 mins. The first donation was longer because of paperwork but other than that great!! I recommend BioLife for your plasma donation help save a life and put a little extra cash in your pockets all at the sametime!!!!", "pics": null, "resp": {"time": 1612965133752, "text": "Hello Sherry, thank you for taking the time to leave a review for us at BioLife Plasma Services. We're happy we could meet your expectations.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "102172858393831367544", "name": "Andrew Parker", "time": 1626882046731, "rating": 1.0, "text": "Don't try calling, they hang up on the second or third ring.", "pics": null, "resp": {"time": 1626893314002, "text": "Thank you for sharing your feedback about your experience. We encourage you to share additional details by email at BioLifeMarketingAndCommunications.US@Takeda.com so that we may look into the issue further.  We truly value you and your commitment to plasma donation, and we hope to see you at BioLife again soon."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106869453481299735748", "name": "Destiny Smith", "time": 1611100538406, "rating": 3.0, "text": "Be prepared. The techs here hate their job 😂\nIt’s a nice facility and their process is very cut-and-dry. But don’t look to be catered to or be paid attention to by some techs. Not all are unprofessional, just the noticeable ones. The nurses and office staff are kind.", "pics": null, "resp": {"time": 1611150209718, "text": "Thank you for sharing your feedback about your experience. We encourage you to share additional details by email at BioLifeMarketingAndCommunications.US@Takeda.com so that we may look into the issue further.  We truly value you and your commitment to plasma donation, and we hope to see you at BioLife again soon."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "105304602643356845013", "name": "Christiana Singleton", "time": 1603319250906, "rating": 5.0, "text": "BioLife Plasma of Mobile is the best plasma center in Mobile. I’ve donated at other centers in the past and BioLife is a wonderful donation center. No other center comes close! There’s no waiting room. So no waiting for hours to donate. Every donation has an appointment time so you go start back. Very friendly environment where everyone knows you by name. Carleta is the best hands down.", "pics": null, "resp": {"time": 1603372189837, "text": "Christiana, we're glad you have such a wonderful experience with us! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106338033830270444904", "name": "Payton Wallace", "time": 1598561547637, "rating": 5.0, "text": "BioLife plasma is by far the best plasma donation center in Mobile, AL. I used to donate at a different local plasma center, and I would wait 2 hours before I would even get called back to the donation station. I am typically in and out in 45 minutes to 1 hour at BioLife. The staff is very friendly and efficient at their job. I’ve donated 4 times, and they already know me by my name. I highly recommend donating at BioLife Plasma Services.", "pics": null, "resp": {"time": 1598618761483, "text": "Hello Payton, we appreciate you taking the time to leave us this review.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "105849917789237208564", "name": "Wendy Enfinger", "time": 1604693722141, "rating": 5.0, "text": "This is a great facility with fantastic employees. It is very clean and organized. They are on top of  COVID procedures and you feel safe. Thank you for a great place to do some good and make a little extra money.", "pics": null, "resp": {"time": 1604930702390, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110678713749033329906", "name": "Aly Vicious", "time": 1603304403380, "rating": 5.0, "text": "This is my first time at this facility, the staff is very friendly and informative. They let you know what’s happening every step of the way.\nI have donated at other facilities (out of state) and this is by far the cleanest and most professional.\nI will be back and will be bringing others to help save lives!", "pics": null, "resp": {"time": 1603371968532, "text": "Aly, we're glad you had such a wonderful first time donor experience with us! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103151023504584506431", "name": "Janice Shriner", "time": 1614527817542, "rating": 4.0, "text": "I have been donating now for 3 weeks , twice a week . Clean place , some staff is really friendly , but some are not friendly at all , they don’t speak to u as much as they should , I pick my own person to stick me because some will bruise you bad ... even some of the supervisors.... but as long as I can pick who will stick me , I will kept coming back ....", "pics": null, "resp": {"time": 1614606818785, "text": "Hello Janice, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "102565657286021940223", "name": "brandi williams", "time": 1600966388047, "rating": 5.0, "text": "Everyone was super nice and professional. This was my first time donating. They explained every process in detail so you will understand the process before hand. I will definitely be donating again!", "pics": null, "resp": {"time": 1601038254929, "text": "Hi Brandi, we are very happy we could provide you with a positive first time donor experience! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "105003937429040539577", "name": "Skorch M", "time": 1611168159448, "rating": 3.0, "text": "clean facility and the staff up front are friendly the Ines in back are hit or miss and they like to dig into you. on top of thatbif they bruised you up they say it won't affect your compensation and then turn around and pretend like they never said that. make sure you keep your gaurd up while your here and make sure you stop them if you don't feel good about them sticking you. you have the right to request someone else and I strongly incourage you to do so", "pics": null, "resp": {"time": 1611236042912, "text": "Thank you for providing your feedback. All prospective donors are important to us and we would like to speak with you directly on this topic and about your experience. Please email us at BioLifeMarketingAndCommunications.US@takeda.com and let us know the best way to contact you."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "109440205544723969797", "name": "Casey Moore", "time": 1601411679732, "rating": 5.0, "text": "I've donated at other facilities and this is by far my most favorite!! The staff is so friendly, and informative. I highly recommend giving them a try.", "pics": null, "resp": {"time": 1601469955822, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "111200144562465132905", "name": "Johnathon Barnette", "time": 1602345750183, "rating": 5.0, "text": "Fast, friendly experience. Well worth the time spent here. Jessica is one of my favorite people here", "pics": null, "resp": {"time": 1602524559359, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112195531516101943975", "name": "Nate the Indigo", "time": 1605222467541, "rating": 5.0, "text": "This is by far the best plasma center that I've been to and I've been to alteast 3 other centers before Biolife. Biolife is by far the fastest and most professional experience when it comes to donating plasma. The staff are all very friendly and accommodating. Make an appointment, walk in, do your questions, let them check your vitals and then walk to the back to give. Unlike other centers were you may wait on the bed to get stuck and start giving, this center will stick you pretty quickly once you're in the back. They pay pretty good too, the platinum rewards offer they have going right now is pretty profitable. All in all, my best experience so far.", "pics": null, "resp": {"time": 1605278004471, "text": "Hello Nate, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103343824331081877205", "name": "Christel Carpenter", "time": 1598659063801, "rating": 5.0, "text": "Everyone was super nice. This was my first time donating. They explained every process and the next in detail so you will understand the process before hand. I will be back.", "pics": null, "resp": {"time": 1598836173941, "text": "Hi Christel, we are very happy we could provide you with a positive experience! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "115905535097264176750", "name": "Nissi DeNas", "time": 1599851167229, "rating": 5.0, "text": "Excellent staff! Excellent customer service! I could not be in more better hands! A keeper!", "pics": null, "resp": {"time": 1600048590813, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112101246193558199415", "name": "Troy Naquin", "time": 1614637384050, "rating": 5.0, "text": "Quick and convenient I'm not looking", "pics": null, "resp": {"time": 1614695141081, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "116135992257856879443", "name": "Marina Spagnolo", "time": 1601666194135, "rating": 5.0, "text": "Amazing staff, they are always very attentive and professionals at putting in the Plasma donation needle, making it  quick and painless.\n\nWould recommend Biolife to anyone!!", "pics": null, "resp": {"time": 1601902657863, "text": "Hi Marina, thank you for taking the time to leave a review for us at BioLife Plasma Services. We're happy we could meet your expectations.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "109817469696375034960", "name": "tracie finch", "time": 1595177464693, "rating": 5.0, "text": "This is a very clean facility.  Staff are very nice and personable. The process is easy and very organized as well.  Would highly recommend Biolife Plasma center on Airport Blvd.", "pics": null, "resp": {"time": 1595181717476, "text": "Thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112741993869788219236", "name": "Shawn Irle", "time": 1598473398848, "rating": 5.0, "text": "Great staff, they make pleasant to donate. Most even know my first name. Highly recommend this place!!!", "pics": null, "resp": {"time": 1598532113066, "text": "Shawn, thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "113020080852922579671", "name": "Amberleah La C", "time": 1584217880259, "rating": 5.0, "text": "Appointment only which is great for crowd control. Very friendly and helpful employees. You will do your initial paperwork, do your screening, take an evaluation on their computers, complete your physical and then do a blood sample on your first visit. You will then be asked to schedule an appointment at a later date for your first donation.\nThis center offers a playroom for children, which you can schedule with your donation appointment.\nVery clean facility and well-lit. There is a ton of parking as well.\nYou may donate twice a week with at least one day in between donations. Example: Monday and Wednesday would be acceptable.", "pics": null, "resp": {"time": 1584376127340, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and would love to include a link to our referral bonus for March.\nThank you for your part in helping to change lives.\nhttps://pub.s1.exacttarget.com/begcm5hsch5"}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "101836054690418303225", "name": "Toni Busby", "time": 1596573147294, "rating": 5.0, "text": "Very nice and clean. Friendly staff. Each team member is efficient and works in a friendly and timely manner.", "pics": null, "resp": {"time": 1596734252765, "text": "Toni, thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "100511759020959660963", "name": "Tina Castillow", "time": 1597349070290, "rating": 5.0, "text": "Very easy and well-organized process to begin donating plasma.  BioLife is a very clean facility with a wonderful staff and friendly atmosphere.", "pics": null, "resp": {"time": 1597409134615, "text": "Hello Tina, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "102849300922479036330", "name": "Aultman Belvin", "time": 1595626398252, "rating": 5.0, "text": "Wonderful staff! Clean facility! Easy and painless process! Definitely worth the drive to Mobile! Five Stars for BioLife on Airport!!", "pics": null, "resp": {"time": 1595854291145, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117195092991120405033", "name": "PRISCILLA Pena", "time": 1604164790979, "rating": 4.0, "text": "Had a great experience, nice and friendly staff. Will be returning and telling others!", "pics": null, "resp": {"time": 1604326948431, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112828230286526426374", "name": "Amanda “Mandie” Barbarow", "time": 1603981423219, "rating": 5.0, "text": "This place is so clean and the staff are nice and caring.", "pics": null, "resp": {"time": 1603997505801, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106736756112861494982", "name": "Robert Yoder", "time": 1598750364559, "rating": 5.0, "text": "I have only donated plasma with Biolife.  The center is clean and the employees are professional and skilled.  There are lots of promotions that increase your compensation through their app.  One thing that I appreciate is that they still pay you  if there is a phlebotomist error which causes you not to be able to complete your donation.\n\nThey require masks and it feels very safe from Covid transmission.", "pics": null, "resp": {"time": 1598836090081, "text": "Hello Robert, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "109269069027659519564", "name": "Sam Belvin", "time": 1595459510544, "rating": 5.0, "text": "Great place. Clean environment. Friendly staff. Easy way to support a good cause.", "pics": null, "resp": {"time": 1595473434288, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110342776290494656302", "name": "Jaci Murden", "time": 1596209078932, "rating": 5.0, "text": "BioLife has great workers and a great atmosphere! I always feel safe and taken care of when giving!", "pics": null, "resp": {"time": 1596485779593, "text": "Thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "118408334176165382165", "name": "MACK Finch", "time": 1595175539529, "rating": 5.0, "text": "Biolife has a wonderful staff. I have never thought of giving plasma until my wife referred me. I was nervous at first, but the staff was awsome. Go I've plasma, and make a differance.", "pics": null, "resp": {"time": 1595181710834, "text": "Thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "111601550173365289188", "name": "Paul Holland", "time": 1599947628168, "rating": 5.0, "text": "Great place to go very frequent bonuses extremely friendly and fast!!!! They care about you here!!!", "pics": null, "resp": {"time": 1600048583703, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "115621029546955243725", "name": "Josh Gartman", "time": 1601593170520, "rating": 5.0, "text": "Awesome nurses and always a pleasant experience!!! Very friendly staff", "pics": null, "resp": {"time": 1601660597595, "text": "Hi Josh, we are very happy we could provide you with a positive experience! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "108124103773922055405", "name": "Robert Chaney", "time": 1599339580621, "rating": 5.0, "text": "The staff was amazing and was a very smooth experience", "pics": null, "resp": {"time": 1599570151170, "text": "Robert, thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106474539901162988606", "name": "Allison Thomas", "time": 1602959546025, "rating": 5.0, "text": "Very sweet and professional staff", "pics": null, "resp": {"time": 1603114084105, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112509930026091806197", "name": "Darryl Morris", "time": 1609117727909, "rating": 5.0, "text": "Professional staff", "pics": null, "resp": {"time": 1609163673612, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110141722951284520222", "name": "Jazmin Linkous", "time": 1611714322452, "rating": 1.0, "text": "They need new management. It's not a place you can feel appreciated for your hard work. The goals are unachievable and the accountability is not evenly distributed.", "pics": null, "resp": null, "gmap_id": "0x8862847c6ff990a3:0xbd36f18ed6c369f4"}
{"user_id": "114634566171273933410", "name": "C Bennett", "time": 1613228586894, "rating": 5.0, "text": "Pleasant experience donating blood. Staff was friendly, professional and caring.", "pics": null, "resp": null, "gmap_id": "0x8862847c6ff990a3:0xbd36f18ed6c369f4"}
{"user_id": "113168840831252236164", "name": "Mary Lou England", "time": 1536244224404, "rating": 5.0, "text": "Love the staff (professional/caring) & squeaky clean environment.  As soon as you walk in the door you are greeted & treated as someone special. 💕💕 ~ MLE", "pics": null, "resp": null, "gmap_id": "0x8862847c6ff990a3:0xbd36f18ed6c369f4"}
{"user_id": "104140630529413958506", "name": "Jeffery Robison", "time": 1546890934898, "rating": 5.0, "text": "Staff is always friendly and helpful, always a pleasant experience, enjoyable experience that does good not only for myself but for someone else also. If your not giving take a minute to give today and feel good.", "pics": null, "resp": null, "gmap_id": "0x8862847c6ff990a3:0xbd36f18ed6c369f4"}
{"user_id": "105485512891875961434", "name": "Tamela Hampton", "time": 1467420536605, "rating": 5.0, "text": "The workers were very professional, very sanitary and genuinley cared about my comfort and well being.", "pics": null, "resp": null, "gmap_id": "0x8862847c6ff990a3:0xbd36f18ed6c369f4"}
{"user_id": "104704331189593680058", "name": "Thomas Ray", "time": 1538085786758, "rating": 5.0, "text": "Donate today and help save a life!", "pics": null, "resp": null, "gmap_id": "0x8862847c6ff990a3:0xbd36f18ed6c369f4"}
