{"user_id": "106606765107701680867", "name": "Amber Waldrop", "time": 1628950135078, "rating": 5.0, "text": "Now that I've been to other centers in mobile I have to say this location is the best. Almost always quick, courteous and clean. If you are going to donate, donate here On moffett rd", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "109651452171087631986", "name": "Marquita Davis", "time": 1630617898320, "rating": 1.0, "text": "Ignored by two people trying to get information they are lazy ,unprofessional and rude. When you ask them something they walk away👎🏾", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "109085003627546139117", "name": "Jamee L", "time": 1610737849133, "rating": 1.0, "text": "They scammed me out of a hundred dollars because my friend went to a different location. It doesn’t say anything in the refer your friend to that pacific location. Me and as well as my friend will donate somewhere where they don’t give out information that is basically a lie!!", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "110575857615738305134", "name": "Ant Hall", "time": 1603473591162, "rating": 5.0, "text": "A wonderful place to donate plasma. Their staff was wonderful and professional.", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "109627695625542916921", "name": "Jessie James (Jess)", "time": 1613734187388, "rating": 5.0, "text": "Wish they would fix building and come back they where like family miss u momma u know how I'm talking bout", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "112331069973041301561", "name": "Tammy Brown", "time": 1530981167003, "rating": 5.0, "text": "I've been donating here off and on for about two years, it's one of the better places I've donated to over the last twenty plus years.. great people work here!!! I highly recommend them!!!", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "118296503209125175726", "name": "Kelly Reed", "time": 1555679294742, "rating": 5.0, "text": "Very good place. Me Shirley is one of the nicest and best staff there", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "102512584755817178340", "name": "Robert Hughes", "time": 1564576600052, "rating": 1.0, "text": "Don't be misled by the 4 and 5 star reviews, this place is rough and the staff are rude.  I used to be a regular plasma donor at CSL a few years ago but haven't had time until recently.  I'm on a break between semesters so I thought I'd make a donation (you know, towards those life saving therapies) and make a little money.\n\nI gathered all of the required documents, per Ked's website, and arrived at their donation center early.  First impression- rough.  People loitering outside shouting at passersby or donors as they enter.  The parking lot and building are disgustingly unkempt with litter and trash strewn about.\n\nI approached the new donor side and met a joyless, rude employee who very obviously didn't want to process a new donor.  She rattled off a list of documents hoping I was missing an item so she wouldn't have to do her job.  \"License?\"  Check.  \"Social Security card?\"  Check.  \"Utility bill?\"  Two of them, check.\n\n\"Something else with your social on it?\" Nope, you got me.  All I have is the document the Federal government issued to me that is accepted EVERYWHERE.  \"W-2?\"  Nope, I'm a graduate student.\n\nApparently the list of documents that Ked says is acceptable isn't acceptable if the bouncer at the front desk doesn't want to do her job.  I could drive home, print tax documents (like my 1098-T) and return... but I'm sure she'd find another reason not to do her job.\n\nSo I'm going to go donate whole blood to LifeSouth.  I'd rather give my blood away for free, knowing that it goes toward a good cause, and be treated with dignity than ever return to Ked again.  And if any other students (or anyone for that matter) ask about donating plasma I'll point them to Biomat.", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "101455860091032212280", "name": "Danny Frisby", "time": 1534207328861, "rating": 5.0, "text": "By far the best staff, and cleanest plasma center I've ever been too, and they even gave me crackers and bottled water! I will be donating here for a long time to come.", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "101253590648547556761", "name": "Jessica West", "time": 1502972090389, "rating": 5.0, "text": "Great people and staff. I used to go and EVERYONE was super nice.", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "107838873830130545449", "name": "Khloee_gang", "time": 1515990696573, "rating": 2.0, "text": "I hv been donating dare since 2014 love it very good people wrk dare..very professional", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "106543244397866186150", "name": "skoker1111", "time": 1496675305839, "rating": 2.0, "text": "Staff is nice but very slow, talk to much while ignoring customers, and they do not honor their promotions at all!! FALSE ADVERTISING!!! They also lost my blood sample 2 months ago and I can't donate for 2 weeks because of their own mistake. I'm done with this place!!!!", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "109637965576211479297", "name": "Dave Dopke", "time": 1462939162744, "rating": 5.0, "text": "Love the people. Great side cash", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "112213771929743384806", "name": "Jessica Hunter", "time": 1482893682336, "rating": 5.0, "text": "Its a geart place and the staff is  very nice.", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "103152368500222586659", "name": "Colin Wright", "time": 1540048627466, "rating": 5.0, "text": "Great place lovely people!", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "110074222802298600513", "name": "CaSeJaSe 4eVeR", "time": 1529798834131, "rating": 5.0, "text": "Nice place and great employees", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "100328051473984291780", "name": "micheal stevison", "time": 1461867102613, "rating": 5.0, "text": "Great people and clean environment", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "108729813003762782327", "name": "torri Walker", "time": 1499104816224, "rating": 5.0, "text": "Now that I've been to other centers in mobile I have to say this location is the best. Almost always quick, courteous and clean. If you are going to donate, donate here", "pics": null, "resp": null, "gmap_id": "0x889a52b58886a5c7:0x15f6a7f4b85bbcaf"}
{"user_id": "109881043398345623911", "name": "Jeremy Schill", "time": 1623059307123, "rating": 5.0, "text": "Love this place it's great for some quick cash but I'm permanently deferred for some reason I don't remember the name of oh well", "pics": null, "resp": {"time": 1625856345201, "text": "We apologize that you were unable to donate plasma.  Our centers follow strict federal and international regulations and procedures to determine if plasma donation is safe for both you and the patients receiving products created from your plasma.  Donor safety is a priority at Grifols plasma donor centers. If you have further questions, please contact us by calling 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "107616799213819868269", "name": "Polo Haze", "time": 1623274648618, "rating": 3.0, "text": "It’s decent.. It just take a while for you to get on and off the machine.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "100591964600350448146", "name": "NikNik Griffith", "time": 1603811967970, "rating": 5.0, "text": "Just my second time, but this place is amazing compared to the one I'm used to. So far, everyone on the staff seems to have good moral & super great attitudes. I'm very pleased.", "pics": null, "resp": {"time": 1603930941970, "text": "Hi Nik Nik- Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "117957115577359456339", "name": "Chris Dietzel", "time": 1625404989734, "rating": 5.0, "text": "Great place great pay", "pics": null, "resp": {"time": 1627673047838, "text": "Thank you for your feedback. Patients count on you!"}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "117024829608040391359", "name": "Shelby 2826", "time": 1607417016749, "rating": 1.0, "text": "I was yelled at by the temperature taker here a few months ago. She was very rude.Let me say there was no guidelines to stay outside so I didn't know to stay outside. I then transferred to Pheonix City Location and still had problems with the outside distance markers for the lines. There is no designated person to enforce guidelines and the people giving don't know how to follow simple directions so I will not be back to this company as I'm going to CSL Plasma.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "117652770088652053521", "name": "Shannon Arnold", "time": 1578969718010, "rating": 5.0, "text": "This is a great place. I like it better than Auburn. They let u use both arms here that way if they stick u and have to stick u again for whatever reason if you happen to get a bruise from them sticking you the next time you can use your other arm. And that's the problem I had in Auburn they were messing up and then from there miss up I had to wait a whole months or longer for it to heal right so it is a great place to go there in Opelika Alabama the people there are great and nice and friendly and it's fast service", "pics": null, "resp": {"time": 1578965697185, "text": "Patients appreciate your commitment, and we do too! Thanks for donating plasma."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "102470112581561848384", "name": "Houston Harrod", "time": 1575938589907, "rating": 1.0, "text": "I went because my fiancee had given before and it's always good to help people. After what took forever I was told I couldn't give because my temp was 99. The woman that did my evaluation was rude when she said it. Makes me feel like they look to waste people's time. They let people donate to buy drugs and others with heart problems but a person that's never been sick in their life no way. By the way if they say donating takes an hour they are lying to you.", "pics": null, "resp": {"time": 1575994440796, "text": "Thank you for your feedback. We apologize that your experience was less than satisfactory and we'd like to hear more. Please call us at 1-855-697-5276 to speak with a representative."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "103339002513994051673", "name": "Spooky Zooki", "time": 1535231445535, "rating": 5.0, "text": "This place is super clean and all the staff are super nice and friendly! They make you feel very comfortable while going through the donation process and they do everything they can to get you in and out and fast as possible! I love this place. It would be nice if the donor rates were a little higher though... hint hint.....", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "106749506955007109515", "name": "chad Allen chambers", "time": 1534363059172, "rating": 5.0, "text": "Real great staff.. Nice environment. They always make Me feel comfortable on my visit every week. I think  they are the best and the hardest working staff in the city.. They really do care about their donors..", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "104628341349582962555", "name": "Elizabeth Everett", "time": 1573947366101, "rating": 5.0, "text": "Excellent staff no waiting. The staff will joke around and have a good time with you while you donate", "pics": null, "resp": {"time": 1574124184313, "text": "Hi, Elizabeth! Patients appreciate your commitment, and we do too! Thanks for donating plasma."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "111631115451652161536", "name": "Melisa Blake", "time": 1591817778802, "rating": 1.0, "text": "I came dond here today I broke my arm 6 month ago and they still want let me give and I still haven't received my refurl money that's been 6 months ago no I will not refer no one else to y'all people", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "112735039777866526407", "name": "Wanda Ramie", "time": 1534856515853, "rating": 5.0, "text": "I have learned a few things I didn't know about plasma. My experience as a donor has been a pleasant one. The staff is courteous and professional. I would recommend the facility to future donor's.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "109794750518473145638", "name": "Robin Sharpe", "time": 1499097297937, "rating": 5.0, "text": "First visit takes awhile but after that it goes pretty quick. People are very friendly and great at their job. I switched from Phoenix City due to closeness and I do not regret it one bit.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "104894867868236571891", "name": "Sommer Cook", "time": 1534190347653, "rating": 5.0, "text": "There always nice and friendly.  Ready to work.  Have a good attitude . I love coming here. Keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "114211164507562683933", "name": "Avin Helton", "time": 1569936448804, "rating": 2.0, "text": "They give you decent money but they have become so careless and so slow it’s almost unbelievable. Seems like everyone is constantly training but nothing is actually improving.", "pics": null, "resp": {"time": 1569957138638, "text": "Hi Avin Helton, we apologize for the wait time and appreciate your patience. Your feedback is important and will help us improve every donor's experience. If you would like to provide additional feedback or have any questions, please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "116517404227569948360", "name": "Keaundra Watts", "time": 1534804585374, "rating": 5.0, "text": "I love donating at Opelika, their the best and you will always be satisfied... Very great staff, very friendly and CLEAN. I HIGHLY  RECOMMEND YOU DONATE HERE 💕", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "115484154378577091916", "name": "Theron Brown", "time": 1534860321432, "rating": 5.0, "text": "Nice and well organized staff. Quickly screened and you finish in a timely manner. I really love the friendly staff", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "105267564712128167847", "name": "WooskeeDaDon", "time": 1535040489223, "rating": 5.0, "text": "I love donating here, the staff is very polite and professional. Also they make the process quick so you can continue with your day", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "107139185491767873557", "name": "Mariah Cotton", "time": 1535029735340, "rating": 5.0, "text": "The staff is kind and helpful. They are very respectful and help in anyway they can to make your visit a good one", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "101138467761639065869", "name": "austin johnston", "time": 1524265896243, "rating": 1.0, "text": "THEY WILL GIVE YOU THE RUNAROUND FOR ANY GIVEN SITUATION AND WILL MAKE EXCUSES AS TO NOT SERVE YOU AS THEY PLEASE. PLEASE MAKE SURE IF YOU DECIDE TO GIVE THIS PLACE YOUR BUSINESS, BE READY FOR ANY AND EVERYTHING. DO. NOT. RECOMMEND.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "104825847808152471038", "name": "Pamela Dowdell", "time": 1534855668390, "rating": 5.0, "text": "I really enjoy coming here everyone is friendly and cares about the customers I appreciate that so much. I will not go to another plasma center I like this one better although this is the only one I been too but it’s nice to feel appreciated", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "110358214815568581065", "name": "Xavier Tinsley", "time": 1535219936275, "rating": 5.0, "text": "Good, Fast, Nice!! Nothing Needs To Be Changed. Very Great People Work Here", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113918165642446520204", "name": "D Floyd", "time": 1563050482327, "rating": 1.0, "text": "My husband and I showed up and signed a clipboard and checked new donor. An hour later we were told we needed to sign in on another clipboard for new donors. We filled put some paperwork that included a medication list and then my husband was given an appointment an hour and a half later and mine was 2 hours later. No mention of any medicine disqualifying us to donate. We go eat and come back to wait another 2 hours before being told we did not qualify due to being on Metformin. The nurse was very apologetic and tried to get us an inconvenience fee, but apparently they quit giving those out last month. We wasted the majority of a day trying to donate. All they would have had to do was have a sign at the desk for new donors to talk to an employee and then have the nurse look over the medicine list before scheduling an appointment for the new donor. If you want to waste your day try to donate, but there are much better ways for me to utilize my time.", "pics": null, "resp": {"time": 1563305235096, "text": "Thank you for your willingness to help save lives, D Floyd! We appreciate your patience, and we're sorry about the long wait and miscommunication. Your feedback is important and will help us improve every donor's experience. Please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "100190546445331822148", "name": "Opelika Alabama", "time": 1533759007450, "rating": 5.0, "text": "I transferred from the Phenix City location and I do not regret it one bit. The workers are very helpful and professional. I love all of the management also!! Keep up the great work Opelika location!!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "105796324135027965504", "name": "Jasquesda Sharpe", "time": 1543191697860, "rating": 5.0, "text": "This place is great. Just a few hours a week get this bread. Mookie Menefield ain’t bout nothing. Don’t read her reviews. She trash!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "102086567374232906432", "name": "Jessica Nickerson", "time": 1534258954852, "rating": 5.0, "text": "Even tho I wasn't able to donate... Mrs. Betty was so helpful and professional... A+", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113823564393080637412", "name": "Tonya Graves", "time": 1538751362074, "rating": 2.0, "text": "Very clean but every time I get near my donation for bonus they say my iron is low! I drive all the way from Lagrange to be turned away. Also, why should after donating many times should I get paid less per donation at the start of each month? Plasma is liquid gold for these centers. They sell the plasma for at minimum $200 a liter! Depending the need they get up to $500 per liter! Donors should get $50 per donation period! And until they do I am DONE! I am all for helping but not so they can just get rich in the process!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "103868113593323955228", "name": "Allyson Gilmore", "time": 1535124838625, "rating": 5.0, "text": "I Enjoy donating ,, and saving Lives it Really worth it!!  I recommend it to anyone that doesn't mind donating and saving lives like me 😊 !!!!!! Plus the staff very Friendly and they make you feel very comfortable and welcome all the Time !!!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "100422188455341650451", "name": "Torrance Hutchinson", "time": 1535029691496, "rating": 5.0, "text": "Great customer service...the employees are always friendly and always willing to help. Love it there!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "106391267336222991415", "name": "Head Shot", "time": 1545256902050, "rating": 1.0, "text": "Extremely rude and ghetto.\nA lady was screaming for help that she felt bad and not one employee looked her way. I didn’t even try to donate I left GO TO CSL!!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "100623956361469264222", "name": "Patrick Watson", "time": 1534856593758, "rating": 4.0, "text": "Professional and caring staff.\nNever a bad experience.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "109522932721147529570", "name": "Dasia gang", "time": 1534804000284, "rating": 5.0, "text": "I love donating here the staff is so friendly and\nprofessional they make you feel very comfortable with donating plasma and saving lives👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "112837402881892594070", "name": "Wilford Swint", "time": 1534362802104, "rating": 5.0, "text": "I love coming to the plasma center it help you when you in a time of need", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "104441458802274753810", "name": "Malik Williams", "time": 1535127748093, "rating": 5.0, "text": "I think the staff there is great and these two women made me feel like one of there own Ms. Theresa and Ms. Gwendolyn are awesome. Thank you guys", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "105407092317291306234", "name": "Franklin Shields", "time": 1535221550017, "rating": 4.0, "text": "Good staff...... fun people to be around to make time fly by.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "116097993398888162479", "name": "Sean J", "time": 1534273196736, "rating": 5.0, "text": "Quick and fast but it should be more than 40 dollas for return donation", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "117959773802447723897", "name": "Sonta Whatley", "time": 1535042419516, "rating": 5.0, "text": "Very welcoming and professional environment. Great atmosphere to be in👍", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "102834796915565890397", "name": "Pookie Sheffield", "time": 1534968835188, "rating": 5.0, "text": "Best plasma center in Auburn/Opelika area. Professional, courteous, well trained.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "117430765589748955184", "name": "Eula Pendleton", "time": 1533848410653, "rating": 5.0, "text": "I love coming to this plasma place they make you feel welcome from the time you come in to the time you leave my experience here with Mrs Rachael my first stop she is my class mate an she keeps me up on how to keep. My HTC up an Mrs Theresa is always there to coach I love her shes very pleasant I love all the people that I have came in contact with in the opelika center even the ones in the back from Mrs Salina walking the floor making sure everyone is seen about to Wesley's stick that man got hands of god with that needle an i got to thank Sebastian I have never had a problem with my funds Theo is a grate.manger. he will  jump right in where ever help is need I have been coming here a long time an I enjoy my visit here every time my only request is to show the people that come to the plasma place what there donations really do for our people an I love Mrs.Dallas boss lady sincerely Eula Pendleton", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "115468440441851848322", "name": "Gina Carpenter", "time": 1535030000331, "rating": 5.0, "text": "Fast, and friendly staff! Easy way to earn some extra cash.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "106175524509746481654", "name": "Tarrell Hunter", "time": 1534805281451, "rating": 5.0, "text": "Very Good Place I Love Donating Here The Staff Is Friendly & The Service Is Fast !!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113416506426394687955", "name": "David Wyatte", "time": 1534970331051, "rating": 5.0, "text": "AWESOME STAFF! Great way to earn extra $$ and help others.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "105309029096073444896", "name": "Marshall W", "time": 1536488778836, "rating": 5.0, "text": "Grifols Talecris is the best place in the South to donate...      They have the best flare ups and the. Place is clean man The plasma place in opelika has the best flare up in the united States of America ms. Tiffany Done.she is good at her job... The people there treat you with respect and that goes along ways... Keep up the good work...LISTEN OK LISTEN IF YOU WOULD LIKE TO DONATE PLEASE GO TO GRIFOLS TALECRIS IN OPELIKA YOU WILL FIND MORE COMFORT THERE.MARSHALL WILLIAMS.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "106979598175860883082", "name": "Ronnie Whitlow", "time": 1534855550268, "rating": 5.0, "text": "Very nice and polite staff they make you feel right at home", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "110312828053906173872", "name": "Richard Dome", "time": 1546143167118, "rating": 4.0, "text": "This fool “Headshot” gone talk bout going to donate at Talecris. Hear some women ask for help and no one look her way. SMH! Hey Bruh, stop lying. Err body know they treat you better at GRIFOLS! Jus check out dem donor fee$! Aight!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "102391636300409379422", "name": "Brian Michaels", "time": 1534805213603, "rating": 5.0, "text": "Clean environment, fast serve times, friendly staff, decent pay.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "105519967004674409883", "name": "Summer Price Price", "time": 1542326906289, "rating": 2.0, "text": "My husband has been 3 times and they have refused him. He completed his screening and physical and passed everything and passed his test. 2nd time he went they told him he needed proof of address they wouldn't take blood sent him home. So he gets home checks the mail and just so happens that he had a letter with our address and his name on it. He goes back that Thursday previous was on tuesday and they won't except the letter as proof of address. Still doesn't take blood and sends him home again. So here it is third time he has proof of address they still won't take it says it's not enough that they need a letter with a stamp. First of all letters hardly come with stamps anymore most are all postage paid husband has been living here for 4 years. Ok so I send him pictures of his address change confirmation from where he changed his mail from his old address to mine and they refused that to. I'm livid. So they told him they would send a little to him in the mail to bring next time. Ok ppl hello should have done that the first time and saved us the trouble and the gas.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113751486769430514974", "name": "Lance Vanpevenage", "time": 1535476876825, "rating": 5.0, "text": "I love giving plasma. It helps out the needy, plus extra money in my pocket", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "116041315629080699418", "name": "Richard O'Barr", "time": 1534855544353, "rating": 5.0, "text": "Great staff and a great way to contribute to the community.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "111605918602226318511", "name": "Wanda H", "time": 1534856140501, "rating": 5.0, "text": "The entire staff is always nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "114209675384358304794", "name": "Daiane Gist", "time": 1524513726281, "rating": 1.0, "text": "I have been there already 6 times trying to donate and every single time there is a different problem. On my 4th visit someone told me I had to fax a document from my allergist. I did it. After recieving a call saying that I could donate, I get at the center for the 3nd time at the same day, and they say that I have to wait more 4 days so they doctor can check it. Seriously! What a waste of time! Horrible.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "116908604640989904486", "name": "Morris carr", "time": 1534855913724, "rating": 5.0, "text": "The staff is great. I haven't had any bad experiences.Need higher pay for donations", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "108408164070190039254", "name": "Brandon Koon", "time": 1534369390749, "rating": 5.0, "text": "Great staff especially the sweet helpful LaTerria", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "102617575561043368659", "name": "Misty Elliott", "time": 1535002885987, "rating": 5.0, "text": "They are very nice people that work there", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "103946423558737958315", "name": "Lauren Bentley", "time": 1501107364316, "rating": 1.0, "text": "Just awful and ghetto, This was my First time coming to this place and I wasn't there  for at least 20 minutes & the workers were talking bad about patients and employees, Then one former employee came in talking about don't bring your man up here cause this \"ho\" named Selena will sleep with him. Awful and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "110248990295812827819", "name": "The Black View", "time": 1511426703630, "rating": 1.0, "text": "Learn more, lol! Rudy, Tynehsia, Felicia, Tip, Christine, Theo Watup!   Cedral", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "107521854536682710863", "name": "Desmond Andrews", "time": 1542989719637, "rating": 5.0, "text": "Great workers and very clean and maintained facility", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "108688964711478541558", "name": "Arno Meadows", "time": 1535128361149, "rating": 5.0, "text": "Great customer service and they actually care about they donor. 💪💪💪💪", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "109309619301024602645", "name": "Erin Pressley", "time": 1500311595728, "rating": 2.0, "text": "They are inconsistent. The machines never read my bp nurse always signs off and I go back. This trip once again machine doesnt read it, nurse checks it and sends me back to the machine for 2 more tries and guess what it doesnt read it. So I get turned away. What was the purpose of the nurse then.  Also friend referrel doesnt say after they donate twice and then you donate. I've sent 2 ppl and they have donated twice or more but since I couldn't donate today I also dont get my referrel $.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "114234662581275175220", "name": "Jonathon Jackson", "time": 1497378772400, "rating": 1.0, "text": "Garbage. Takes 3 hours to be seen as a new donor! And I'm still waiting, GO TO AUBURN, at the CSL facility. You get in and out. No problem, no waiting, and awesome people that work there.\n\nGO TO CSL !!!!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "104444559865743645047", "name": "Steven Mellott", "time": 1516465583674, "rating": 1.0, "text": "Nasty mouth workers they expect you to know the state rules of donating and then they say you are unreliable if you go to a different center to donate. I guess it's not about saving lives but more about making a buck to these people", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "103860342872238930079", "name": "Somika weathers", "time": 1503758586414, "rating": 5.0, "text": "Stop lying on salina.shes is the lead phetoblomist there..she is very professional & has her own man to worry about.THANK YOU!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "106743274790555755599", "name": "According to His Will Ministry", "time": 1534855684911, "rating": 5.0, "text": "Very personable staff and a pleasant experience", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "101445143987967332094", "name": "christina crowder", "time": 1534804793694, "rating": 5.0, "text": "They are very fast and friendly!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "101267868339286798827", "name": "Justin Segrest", "time": 1534862209240, "rating": 5.0, "text": "Clean donation center with no hassel", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "106130685884116119610", "name": "Kristy Ellis", "time": 1532447674826, "rating": 5.0, "text": "Very professional individuals. Workers put donors as their first priority!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "101573196951241915958", "name": "deaisa holmes", "time": 1534272870853, "rating": 5.0, "text": "I love this place 💜", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "108222381032245607209", "name": "alicia tarver", "time": 1534804046992, "rating": 5.0, "text": "Great place and staff!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113468989697018380293", "name": "Justin Woody", "time": 1535040633444, "rating": 5.0, "text": "I like it when Lexus sticks me...lol", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "101985203784793439144", "name": "Roodelyne Desilus", "time": 1534852872565, "rating": 5.0, "text": "Awesome place to work!!", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113660472386703358158", "name": "Jettski Grizzley", "time": 1564584921853, "rating": 3.0, "text": "Workers have bad attitudes", "pics": null, "resp": {"time": 1564801461139, "text": "Thank you for your feedback Benjamin. We apologize that your experience was less than satisfactory and we'd like to hear more. Please call us at 1-855-697-5276 to speak with a representative."}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "113930894391230607924", "name": "Xzavious Hooks", "time": 1534855543078, "rating": 5.0, "text": "Good place an respectful", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "114869730823197856567", "name": "John Calvin", "time": 1535029922207, "rating": 5.0, "text": "Very good service", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "110376813974775846403", "name": "Demarcus Edwards", "time": 1535220911048, "rating": 3.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "118153639171050490659", "name": "Jesse Williams", "time": 1526573229570, "rating": 5.0, "text": "Fast, easy, fun, professional, and educational.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "115444132752471092875", "name": "Optimus_ Jas", "time": 1535027593385, "rating": 5.0, "text": "I come super early and I'm in and out.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "100859254152782899616", "name": "Danielle Gibson", "time": 1534863834683, "rating": 5.0, "text": "Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "105031545124135117136", "name": "lorenzo jackson", "time": 1535221620792, "rating": 5.0, "text": "They Straight", "pics": null, "resp": null, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "107764706337715096437", "name": "김태운", "time": 1581202647542, "rating": 5.0, "text": "(Translated by Google) Three o'clock closes the door.\n\n(Original)\n3시면 문을 닫습니다.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPFLNEBSw139rFy4ot8FP5lpJIj2Fo3bpHI6uc-=w150-h150-k-no-p"]}], "resp": {"time": 1581380294711, "text": "(Translated by Google) Patients appreciate your dedication! Thank you for your donation!\n\n(Original)\n환자들은 당신의 헌신에 감사합니다! 기부 해 주셔서 감사합니다!"}, "gmap_id": "0x888c92cbc4542a8b:0xa643e7b01f042e3e"}
{"user_id": "110668899647276617496", "name": "Toni Swoopes", "time": 1625850529406, "rating": 5.0, "text": "Very pleasant staff.  Professional  and caring.  I don't understand why they Have to be so quiet now, though. Nothing wrong with a little conversation. It helps the process go by easier.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "113488444092938720868", "name": "Charlie Webster", "time": 1624394262752, "rating": 2.0, "text": "This place would get 0 stars if it wasn't for the staff. It's the sideways management or the head doctor in charge that just got the 0 star rating. He or she should go and thank everyone of the staff there for the 2 stars. Must be about money otherwise I would be donating right now. I would usually suggest that you never go to a place that I'm giving 2 stars but this is about saving lives and helping the sick. Like I said I give the staff here 5 stars and the management or head Dr ZERO.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "109663084633985521766", "name": "Allie Bradfield", "time": 1626136426154, "rating": 1.0, "text": "Staff has always been pretty friendly when I've tried to donate. However this is getting a low rating for a few reasons. When I first went I was completely honest (best thing to do right?) While documenting my tattoos and piercings one of the questions I was asked was about self harm. I told the truth including that I hadn't done it in about 10-11 months. I was deferred for a year because it had to be six months since the last time. I had already been there for 6 hours. I felt so bad when I left.\nThe next time I went (a year later) I was informed my hygiene was bad and they wouldn't accept me because of that. I had a shower before I went. Also, told that due to my meds I needed my family doctor to fill out a form so I could donate. I was on the same meds the first time I went. The staff who checks your iron and no are friendly. Once your in that room for a physical it hasn't been as polite iny case. I gave up trying to donate with them. Since I'm not doing it for money I go donate with Life south.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "101417077988477595508", "name": "Kristi DeJaynes", "time": 1627587264223, "rating": 1.0, "text": "This place is redicuolously slow ... Get through my 8 times I'm head back to florence... They leave you standing and not one person in this place seems to be enthusiastic about their jobs. Slow all the way around here definitely would not recommend ked plasma to anyone.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "107665765561527970772", "name": "Chris Tate", "time": 1617994356773, "rating": 5.0, "text": "Very clean, safe, and efficient! Very nice and helpful staff! Very pleased with the time and process!", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "114109468715512830364", "name": "Douglas W Smith", "time": 1627980485644, "rating": 1.0, "text": "My wife and i both went here to donate and as we first walked in the staff appeared to be in good spirits which is always a good experience to encounter but it did not last long as she was told she didnt have any good veins and was rejected as a donor. I know she has good veins because not only are we repeated donors at lifesouth but we have to have blood drawn before each Dr. visit. They made her wait outside in the van using requirements as an excuse. Then when i explained that i was familiar with the procedure of donating plasma since i usually donate to lifesouth without pay they rolled their eyes and started criticizing and downgrading them which in my opinion is being judgmental and kinda makes kedplasma look pretty bad and childish. They had me to go through the entire process of watching videos and creating an account before testing my blood and telling me that my protein level was too high by one point. After having it tested by the Dr. Only to find out it wasnt high at all which tells me that they could possibly be giving out bad test results to others either by faulty equipment or on purpose. In either event i have decided that we will not be returning to this facility just in case it's faulty equipment.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "114462793193462205562", "name": "Lawanda Bailey", "time": 1617665875844, "rating": 5.0, "text": "Always friendly, clean, nest and considerate of you time and needs or concerns.  Fun , upbeat environment *****", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "106891255574031812863", "name": "Melissa Ohlrich", "time": 1623520732926, "rating": 5.0, "text": "I love coming here!!! Everyone is so friendly and Lexsis does a great job sticking.  Kristy is always so friendly and Akeshia (i believe that's how its spelled) is amazing as well. All around a great group of employees.  They make the environment fun and welcoming,  yet adhere to strict cleanliness and sanitization policies.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "114954401806090674478", "name": "Sonia Heflin", "time": 1617661215931, "rating": 5.0, "text": "Great place and people!! Come see them and help people!", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "115120766495206761275", "name": "Brenda Garrett", "time": 1614198795278, "rating": 1.0, "text": "They lie to you about their referral. Just for you to keep coming back. So unprofessional if i could give less they one i would. Lies ask for person in charge. No one in charge.", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "114653345510237064095", "name": "AraTheEsFana Productions", "time": 1608684251679, "rating": 1.0, "text": "They didn't let me donate today, and they use the excuse, that my SSI was signed, I had 5 forms of identification of government identification, and the lady turn to the other person that's African American that's a client, said this won't take a minute, and I feel like I got discriminated against..", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "112659112338883298172", "name": "Tyler Smith", "time": 1628198742145, "rating": 1.0, "text": "Very disorganized", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "118329037276763865472", "name": "Carl Swann", "time": 1601914938520, "rating": 5.0, "text": "Lovely place", "pics": null, "resp": null, "gmap_id": "0x886287cc2c21a737:0xd1d0290475537ade"}
{"user_id": "116289214289302660854", "name": "Jeremy Baker", "time": 1628176563287, "rating": 5.0, "text": "I’ve been going to the Mobile location since they opened, right before Covid hit. They’ve always appeared to be diligent about keeping the donors and their employees safe. The location gets busy sometimes in the early morning and late evening, but they usually adapt and make it work. Staff is very friendly and always willing to answer questions and address any discomfort. The repeat donor programs and coupons are fairly lucrative and pop up frequently.", "pics": null, "resp": {"time": 1628261837668, "text": "Hello Jeremy, we appreciate you taking the time to leave us this review.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117569283765167629583", "name": "Levi Davis", "time": 1620403639766, "rating": 4.0, "text": "My donation today was awesome. The processing had a really long line for returning. Ms. Regina was my donation specialist. She was very on top of it. So quick at setting up to my stick. The stick was painless and swift. She was very attentive to her section that was constantly full. Also she was very respectful and professional even during less desirable situations. Hope I get her every time I’m in.", "pics": null, "resp": {"time": 1620657615255, "text": "Hello Levi, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103354158762850465487", "name": "lisa marlowe", "time": 1628259978944, "rating": 5.0, "text": "Very clean very friendly staff easy to do and help save lives", "pics": null, "resp": null, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117279566708766283349", "name": "Sydney Burt", "time": 1625092479722, "rating": 5.0, "text": "This was my first experience donating plasma & I'm glad it was at this location. The staff is very nice & made me feel completely comfortable through the entire process. I highly recommend coming here.", "pics": null, "resp": {"time": 1625147499804, "text": "Hello Sydney, thank you for taking the time to leave a review for us at BioLife Plasma Services. We're happy we could meet your expectations.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "107772571432839366622", "name": "Gabrielle W-P", "time": 1615491760158, "rating": 5.0, "text": "I was fearful of what to expect, but the facility is clean and beautiful. The staff is AMAZING. I’ve been to the Mobile location 3x and each experience had been better then the last. Today a tech was about to leave, as her shift was finished. However, she returned to her station to make sure a gentleman was given immediate assistance. Kind and impressive! I definitely  recommend this location. Give today!", "pics": null, "resp": {"time": 1615559580445, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "104975512853097909858", "name": "Josh Murray", "time": 1621962671554, "rating": 5.0, "text": "This place is great.  The staff very much cares about their donors.  Highly recommend going here if you want to donate plasma.", "pics": null, "resp": {"time": 1622034188297, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "101452492376349490586", "name": "Rhiannon Summers", "time": 1622665004957, "rating": 5.0, "text": "Much more organized and thorough than the others I have used. The appointment system ensures that you are in and out in a timely manner as well.", "pics": null, "resp": {"time": 1622724480176, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "108322900650254962632", "name": "Jennifer King", "time": 1619204078139, "rating": 5.0, "text": "Love our Mobile location!  Staff is always kind & professional, facility is always so CLEAN, & my favorite phlebotomist Regina goes above and beyond. The staff do a great job of getting people in and out as quickly as possible too. Check them out & save a life!", "pics": null, "resp": {"time": 1619529550550, "text": "Thanks for the awesome review, Jennifer! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Thanks again for your feedback!"}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "107169235199984568745", "name": "Fujin Wind", "time": 1627224939237, "rating": 5.0, "text": "The people are great and the attention and atmosphere is like no where else", "pics": null, "resp": {"time": 1627306590715, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103768410834778404641", "name": "Angelica Walley", "time": 1619811657536, "rating": 4.0, "text": "Had a great experience today with lorie no pain! Didn't even feel the needle. Everyone is very friendly. The only downside was the wait but there were a lot of new donors there today as well", "pics": null, "resp": {"time": 1620054456525, "text": "Hello Angelica, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110370603632357209954", "name": "kourtney hatcher", "time": 1619135935490, "rating": 3.0, "text": "The best one in mobile, but dont waste your time with evening appointments, because they will lie to you and tell you your levels are not good. I had a 6:40 pm appointment and sat there and watched them tell 2 people ahead of me that there vitals were off and them me, when i never have a problem with my vitals when i come at any other time.", "pics": null, "resp": {"time": 1619149816866, "text": "Thank you for providing your feedback. All prospective donors are important to us and we would like to speak with you directly on this topic and about your experience. Please email us at BioLifeMarketingAndCommunications.US@takeda.com and let us know the best way to contact you."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117364784545817030071", "name": "Andrew Walters", "time": 1624548838238, "rating": 3.0, "text": "They don't like to answer the phone apparently. It rings a few times then just hangs up.", "pics": null, "resp": {"time": 1624652087195, "text": "We're so sorry for this phone frustration Andrew.  Please email us at BioLifeMarketingAndCommunications.US@takeda.com and we will forward along any concern/question.  Make sure you include your name, center, and best way to contact you.\rThank you!"}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "100927476594592710345", "name": "amber pierce", "time": 1604610607667, "rating": 5.0, "text": "Bio Life Plasma Services is a wonderful donation center.  I have not used other centers.  But their staff is so friendly and helpful.  Everything is nice and clean.  I never have to wait.  I use their app to make and change appointments. Super easy.  I highly recommend using them if you're thinking of donating plasma.  🙂", "pics": null, "resp": {"time": 1604670955291, "text": "Hello Amber, we appreciate you taking the time to leave us this review.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106148435366517379974", "name": "Sherry Pruitt", "time": 1612913493663, "rating": 5.0, "text": "CLEAN! CLEAN! CLEAN! I have donated at a different facility and questioned the sanitation process, but not here wonderful facility friendly staff. It is also the fastest process no long lines to wait in, I'm in and out in one hour and 30 mins. The first donation was longer because of paperwork but other than that great!! I recommend BioLife for your plasma donation help save a life and put a little extra cash in your pockets all at the sametime!!!!", "pics": null, "resp": {"time": 1612965133752, "text": "Hello Sherry, thank you for taking the time to leave a review for us at BioLife Plasma Services. We're happy we could meet your expectations.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "102172858393831367544", "name": "Andrew Parker", "time": 1626882046731, "rating": 1.0, "text": "Don't try calling, they hang up on the second or third ring.", "pics": null, "resp": {"time": 1626893314002, "text": "Thank you for sharing your feedback about your experience. We encourage you to share additional details by email at BioLifeMarketingAndCommunications.US@Takeda.com so that we may look into the issue further.  We truly value you and your commitment to plasma donation, and we hope to see you at BioLife again soon."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106869453481299735748", "name": "Destiny Smith", "time": 1611100538406, "rating": 3.0, "text": "Be prepared. The techs here hate their job 😂\nIt’s a nice facility and their process is very cut-and-dry. But don’t look to be catered to or be paid attention to by some techs. Not all are unprofessional, just the noticeable ones. The nurses and office staff are kind.", "pics": null, "resp": {"time": 1611150209718, "text": "Thank you for sharing your feedback about your experience. We encourage you to share additional details by email at BioLifeMarketingAndCommunications.US@Takeda.com so that we may look into the issue further.  We truly value you and your commitment to plasma donation, and we hope to see you at BioLife again soon."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "105304602643356845013", "name": "Christiana Singleton", "time": 1603319250906, "rating": 5.0, "text": "BioLife Plasma of Mobile is the best plasma center in Mobile. I’ve donated at other centers in the past and BioLife is a wonderful donation center. No other center comes close! There’s no waiting room. So no waiting for hours to donate. Every donation has an appointment time so you go start back. Very friendly environment where everyone knows you by name. Carleta is the best hands down.", "pics": null, "resp": {"time": 1603372189837, "text": "Christiana, we're glad you have such a wonderful experience with us! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106338033830270444904", "name": "Payton Wallace", "time": 1598561547637, "rating": 5.0, "text": "BioLife plasma is by far the best plasma donation center in Mobile, AL. I used to donate at a different local plasma center, and I would wait 2 hours before I would even get called back to the donation station. I am typically in and out in 45 minutes to 1 hour at BioLife. The staff is very friendly and efficient at their job. I’ve donated 4 times, and they already know me by my name. I highly recommend donating at BioLife Plasma Services.", "pics": null, "resp": {"time": 1598618761483, "text": "Hello Payton, we appreciate you taking the time to leave us this review.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "105849917789237208564", "name": "Wendy Enfinger", "time": 1604693722141, "rating": 5.0, "text": "This is a great facility with fantastic employees. It is very clean and organized. They are on top of  COVID procedures and you feel safe. Thank you for a great place to do some good and make a little extra money.", "pics": null, "resp": {"time": 1604930702390, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110678713749033329906", "name": "Aly Vicious", "time": 1603304403380, "rating": 5.0, "text": "This is my first time at this facility, the staff is very friendly and informative. They let you know what’s happening every step of the way.\nI have donated at other facilities (out of state) and this is by far the cleanest and most professional.\nI will be back and will be bringing others to help save lives!", "pics": null, "resp": {"time": 1603371968532, "text": "Aly, we're glad you had such a wonderful first time donor experience with us! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103151023504584506431", "name": "Janice Shriner", "time": 1614527817542, "rating": 4.0, "text": "I have been donating now for 3 weeks , twice a week . Clean place , some staff is really friendly , but some are not friendly at all , they don’t speak to u as much as they should , I pick my own person to stick me because some will bruise you bad ... even some of the supervisors.... but as long as I can pick who will stick me , I will kept coming back ....", "pics": null, "resp": {"time": 1614606818785, "text": "Hello Janice, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "102565657286021940223", "name": "brandi williams", "time": 1600966388047, "rating": 5.0, "text": "Everyone was super nice and professional. This was my first time donating. They explained every process in detail so you will understand the process before hand. I will definitely be donating again!", "pics": null, "resp": {"time": 1601038254929, "text": "Hi Brandi, we are very happy we could provide you with a positive first time donor experience! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "105003937429040539577", "name": "Skorch M", "time": 1611168159448, "rating": 3.0, "text": "clean facility and the staff up front are friendly the Ines in back are hit or miss and they like to dig into you. on top of thatbif they bruised you up they say it won't affect your compensation and then turn around and pretend like they never said that. make sure you keep your gaurd up while your here and make sure you stop them if you don't feel good about them sticking you. you have the right to request someone else and I strongly incourage you to do so", "pics": null, "resp": {"time": 1611236042912, "text": "Thank you for providing your feedback. All prospective donors are important to us and we would like to speak with you directly on this topic and about your experience. Please email us at BioLifeMarketingAndCommunications.US@takeda.com and let us know the best way to contact you."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "109440205544723969797", "name": "Casey Moore", "time": 1601411679732, "rating": 5.0, "text": "I've donated at other facilities and this is by far my most favorite!! The staff is so friendly, and informative. I highly recommend giving them a try.", "pics": null, "resp": {"time": 1601469955822, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "111200144562465132905", "name": "Johnathon Barnette", "time": 1602345750183, "rating": 5.0, "text": "Fast, friendly experience. Well worth the time spent here. Jessica is one of my favorite people here", "pics": null, "resp": {"time": 1602524559359, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112195531516101943975", "name": "Nate the Indigo", "time": 1605222467541, "rating": 5.0, "text": "This is by far the best plasma center that I've been to and I've been to alteast 3 other centers before Biolife. Biolife is by far the fastest and most professional experience when it comes to donating plasma. The staff are all very friendly and accommodating. Make an appointment, walk in, do your questions, let them check your vitals and then walk to the back to give. Unlike other centers were you may wait on the bed to get stuck and start giving, this center will stick you pretty quickly once you're in the back. They pay pretty good too, the platinum rewards offer they have going right now is pretty profitable. All in all, my best experience so far.", "pics": null, "resp": {"time": 1605278004471, "text": "Hello Nate, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103343824331081877205", "name": "Christel Carpenter", "time": 1598659063801, "rating": 5.0, "text": "Everyone was super nice. This was my first time donating. They explained every process and the next in detail so you will understand the process before hand. I will be back.", "pics": null, "resp": {"time": 1598836173941, "text": "Hi Christel, we are very happy we could provide you with a positive experience! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "115905535097264176750", "name": "Nissi DeNas", "time": 1599851167229, "rating": 5.0, "text": "Excellent staff! Excellent customer service! I could not be in more better hands! A keeper!", "pics": null, "resp": {"time": 1600048590813, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112101246193558199415", "name": "Troy Naquin", "time": 1614637384050, "rating": 5.0, "text": "Quick and convenient I'm not looking", "pics": null, "resp": {"time": 1614695141081, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "116135992257856879443", "name": "Marina Spagnolo", "time": 1601666194135, "rating": 5.0, "text": "Amazing staff, they are always very attentive and professionals at putting in the Plasma donation needle, making it  quick and painless.\n\nWould recommend Biolife to anyone!!", "pics": null, "resp": {"time": 1601902657863, "text": "Hi Marina, thank you for taking the time to leave a review for us at BioLife Plasma Services. We're happy we could meet your expectations.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "109817469696375034960", "name": "tracie finch", "time": 1595177464693, "rating": 5.0, "text": "This is a very clean facility.  Staff are very nice and personable. The process is easy and very organized as well.  Would highly recommend Biolife Plasma center on Airport Blvd.", "pics": null, "resp": {"time": 1595181717476, "text": "Thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112741993869788219236", "name": "Shawn Irle", "time": 1598473398848, "rating": 5.0, "text": "Great staff, they make pleasant to donate. Most even know my first name. Highly recommend this place!!!", "pics": null, "resp": {"time": 1598532113066, "text": "Shawn, thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "113020080852922579671", "name": "Amberleah La C", "time": 1584217880259, "rating": 5.0, "text": "Appointment only which is great for crowd control. Very friendly and helpful employees. You will do your initial paperwork, do your screening, take an evaluation on their computers, complete your physical and then do a blood sample on your first visit. You will then be asked to schedule an appointment at a later date for your first donation.\nThis center offers a playroom for children, which you can schedule with your donation appointment.\nVery clean facility and well-lit. There is a ton of parking as well.\nYou may donate twice a week with at least one day in between donations. Example: Monday and Wednesday would be acceptable.", "pics": null, "resp": {"time": 1584376127340, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and would love to include a link to our referral bonus for March.\nThank you for your part in helping to change lives.\nhttps://pub.s1.exacttarget.com/begcm5hsch5"}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "101836054690418303225", "name": "Toni Busby", "time": 1596573147294, "rating": 5.0, "text": "Very nice and clean. Friendly staff. Each team member is efficient and works in a friendly and timely manner.", "pics": null, "resp": {"time": 1596734252765, "text": "Toni, thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "100511759020959660963", "name": "Tina Castillow", "time": 1597349070290, "rating": 5.0, "text": "Very easy and well-organized process to begin donating plasma.  BioLife is a very clean facility with a wonderful staff and friendly atmosphere.", "pics": null, "resp": {"time": 1597409134615, "text": "Hello Tina, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "102849300922479036330", "name": "Aultman Belvin", "time": 1595626398252, "rating": 5.0, "text": "Wonderful staff! Clean facility! Easy and painless process! Definitely worth the drive to Mobile! Five Stars for BioLife on Airport!!", "pics": null, "resp": {"time": 1595854291145, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "117195092991120405033", "name": "PRISCILLA Pena", "time": 1604164790979, "rating": 4.0, "text": "Had a great experience, nice and friendly staff. Will be returning and telling others!", "pics": null, "resp": {"time": 1604326948431, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112828230286526426374", "name": "Amanda “Mandie” Barbarow", "time": 1603981423219, "rating": 5.0, "text": "This place is so clean and the staff are nice and caring.", "pics": null, "resp": {"time": 1603997505801, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106736756112861494982", "name": "Robert Yoder", "time": 1598750364559, "rating": 5.0, "text": "I have only donated plasma with Biolife.  The center is clean and the employees are professional and skilled.  There are lots of promotions that increase your compensation through their app.  One thing that I appreciate is that they still pay you  if there is a phlebotomist error which causes you not to be able to complete your donation.\n\nThey require masks and it feels very safe from Covid transmission.", "pics": null, "resp": {"time": 1598836090081, "text": "Hello Robert, thank you; we appreciate your feedback.  Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "109269069027659519564", "name": "Sam Belvin", "time": 1595459510544, "rating": 5.0, "text": "Great place. Clean environment. Friendly staff. Easy way to support a good cause.", "pics": null, "resp": {"time": 1595473434288, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "110342776290494656302", "name": "Jaci Murden", "time": 1596209078932, "rating": 5.0, "text": "BioLife has great workers and a great atmosphere! I always feel safe and taken care of when giving!", "pics": null, "resp": {"time": 1596485779593, "text": "Thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "118408334176165382165", "name": "MACK Finch", "time": 1595175539529, "rating": 5.0, "text": "Biolife has a wonderful staff. I have never thought of giving plasma until my wife referred me. I was nervous at first, but the staff was awsome. Go I've plasma, and make a differance.", "pics": null, "resp": {"time": 1595181710834, "text": "Thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "111601550173365289188", "name": "Paul Holland", "time": 1599947628168, "rating": 5.0, "text": "Great place to go very frequent bonuses extremely friendly and fast!!!! They care about you here!!!", "pics": null, "resp": {"time": 1600048583703, "text": "Thank you so much for your kind words. We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "115621029546955243725", "name": "Josh Gartman", "time": 1601593170520, "rating": 5.0, "text": "Awesome nurses and always a pleasant experience!!! Very friendly staff", "pics": null, "resp": {"time": 1601660597595, "text": "Hi Josh, we are very happy we could provide you with a positive experience! Thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "108124103773922055405", "name": "Robert Chaney", "time": 1599339580621, "rating": 5.0, "text": "The staff was amazing and was a very smooth experience", "pics": null, "resp": {"time": 1599570151170, "text": "Robert, thank you for your praise and kind comments about our team. Your donations are helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "106474539901162988606", "name": "Allison Thomas", "time": 1602959546025, "rating": 5.0, "text": "Very sweet and professional staff", "pics": null, "resp": {"time": 1603114084105, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "112509930026091806197", "name": "Darryl Morris", "time": 1609117727909, "rating": 5.0, "text": "Professional staff", "pics": null, "resp": {"time": 1609163673612, "text": "Thank you for the 5-star review! We appreciate your continued plasma donations and thank you for your part in helping to change lives."}, "gmap_id": "0x889bb3aa43a1069b:0xed8d4804356db978"}
{"user_id": "103633133083982886887", "name": "The Book Of Abby", "time": 1624984930164, "rating": 1.0, "text": "They employ the absolute most unqualified and least educated phlebotomist in the state of Alabama. Went there three times trying to give blood and naked never stick a vein. DO NOT WASTE YOUR TIME!", "pics": null, "resp": {"time": 1627415579616, "text": "We apologize that your experience was less than satisfactory. Patients count on donations such as yours, and we would love to see you again. Your feedback is important and will help us improve every donor's experience. Please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com so that we may better understand your concern and address any issues."}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "114442725583605897065", "name": "Elliot Wise", "time": 1623505722728, "rating": 1.0, "text": "(Reviewing under an alias so I do not out myself)\n\nDon't go here.\nThe staff is unprofessional. Their doctor hasn't been in in two weeks and no one can tell me when they're there, but I'm on hold for some unknown reason until they get it together.\n\nI am a trans man and am male-passing (have been for years) and still get \"ma-am\"d by their staff every time I go in because there's zero trans competency and all the staff does is look at the paper that aligns with your license.\n\nThere are about three staff members who have it together and actually pay attention, but other than those select few, everyone else is not good. I won't be returning; they can meet their quotas with someone else's plasma and time.\n\nTl;dr\nThis center does not know what they're doing, and (especially if you're trans) don't go.", "pics": null, "resp": {"time": 1626383878615, "text": "We appreciate your willingness to donate and help save a life. We apologize for the miscommunication and inconvenience. Your feedback is important and will help us improve every donor's experience. Please consider sending us a message via the \"contact us\" page on www.grifolsplasma.com and leave your contact information, so that a member of the center's leadership team is able to reach you directly to better understand your concern and resolve this issue."}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "102145638687202379413", "name": "Micah Turnbull", "time": 1619740663831, "rating": 5.0, "text": "Swift service and very friendly. They resolve any issues very professionally and always provide an awesome experience!", "pics": null, "resp": {"time": 1620170563068, "text": "Hi, Micah! We appreciate loyal donors like you! Thanks for your feedback!"}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "100777814508849053310", "name": "Arlicia Johnson", "time": 1613568860320, "rating": 1.0, "text": "Currently 735am.. and the doors arent open and no one will even pick up the phone.. got donors standing outside in the cold", "pics": null, "resp": {"time": 1613571636056, "text": "Hi Arlicia! Thank you for your feedback. We apologize that your experience was less than satisfactory and we'd like to hear more. Please call us at 1-855-697-5276 to speak with a representative."}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "104303304113655827462", "name": "Unhappy Client", "time": 1602600315286, "rating": 1.0, "text": "DO NOT GO TO THIS CENTER !  My job this year has been reviewing all of the plasma centers in Birmingham.  This center is the only one that I gave 1 star and i would have given less if that was an option. In short....\nThe Front Desk staff is RUDE and UNPROFESSIONAL.\nThe training staff blew another colleagues vein and the trainee wasnt suppose to do it at all.\nTHERE ARE ALWAYS PROBLEMS with giving. Another colleague went in at 9am on Sunday and was told ITS TOO LATE- WE ARENT TAKING ANYMORE NEW CLIENTS TODAY.\nI could list more but just know, this Blogger warns Birmingham Family to go ANYWHERE ELSE.\nEven the other location downtown didnt pass.\nALL other plasma centers, ie BIOLIFE or CSL, have friendly STAFF, NOT RUDE EMPLOYEES LIKE PLASMACARE.\nYOU ARE WARNED BY MY BLOG.\nTHE EXPERIENCE IS AWFUL", "pics": null, "resp": {"time": 1602800869396, "text": "UnHappy Client-  We apologize for your less than satisfactory experience and thank you for bringing this to our attention. We take issues like this seriously. It is the goal of all of our team members to treat each donor with dignity and respect. If you would like to share additional concerns or if you have further questions, please contact your center directly or through the \"contact us\" page on www.grifolsplasma.com so that we can better address your concern."}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110890072862633771040", "name": "Tyler Volz", "time": 1605361735111, "rating": 1.0, "text": "I donated one time and was told that I needed to have a blood sample taken because there were too many lipids in my donation. I was told it would take 5 days, then 7 days, then 10 days. It's been over two weeks now and still no sample. Every time I call, I can tell I'm annoying them. I wish I would have gone somewhere else.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "115378247928158790186", "name": "JaLessa Wright", "time": 1551402468601, "rating": 5.0, "text": "The facilities and staff are top notch. No visit has ever been unpleasant. The phlebotomists are very skilled not only at their jobs, but also in making you feel welcome and comfortable during your donation. Even the donors are like family. I've never donated anywhere else; however if I do, they'll have a high standard to meet.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "113248860476214258542", "name": "L Terry", "time": 1551401229017, "rating": 5.0, "text": "I donate plasma regularly here and always have a good experience. The staff and phlebotomists are all very friendly and professional. The donating process itself is very easy and you’re able to help saves lives while being well compensated. I would highly recommend", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "117345802578929271527", "name": "AMY OLIVER", "time": 1546003378238, "rating": 4.0, "text": "I haven't met a single grouchy person. I have even observed how the staff talks to people on the phone and also in person. Everyone has been very kind. The facilities are clean and the process is easy. I am in and out within an hour.... Of course your results may vary depending on your body. Parking is pretty easy as well and I always feel safe.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "104350193548771918659", "name": "Kristina David", "time": 1551456685345, "rating": 5.0, "text": "One of the nicer plasma donation centers I’ve been too. The employees are always nice and making jokes. It’s not the best having your blood sucked outta you, but you get compensated for your time! No complaints! Great job Grifols Bhm!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "111541706517454388858", "name": "Cassandra Norris", "time": 1575671020080, "rating": 1.0, "text": "Lady told me I needed to drop my baby off and come back before i could donate and I be back by 5 pm. Now its not even  430 pm and this lady at front desk told me I had to come back on another day. Dishoneat employees and costed me gas to get here.", "pics": null, "resp": {"time": 1575947464152, "text": "We apologize that your experience was less than satisfactory. Patients count on donations such as yours, and we would love to see you again. Your feedback is important and will help us improve every donor's experience. Please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com so that we may better understand your concern and address any issues."}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110840018638150051967", "name": "Gerrymi Norris", "time": 1552925137801, "rating": 1.0, "text": "DO NOT GO TO THIS CENTER !! MY FIRST VISIT 3/11/2019 and MY SECOND VISIT 3/13/2019 WAS COOL. Today 3/18/2019 BEING MY THIRD VISIT...I GOT THEIR @ 8:00AM BY 8:30 THEY TOLD ME I WAS DEFERRED BECAUSE TESTED POSITIVE FOR SOMETHING. I IMMEDIATELY LEFT AND WENT STRAIGHT TO DOCTOR AND GOT MY BLOOD TESTED FOR EVERYTHING. EVERYTHING CAME BACK NEGATIVE...I HAD NOTHING AT ALL WHATSOEVER...I CALLED THIS PLASMACENTER BACK AND INFORMED THEM OF MY NEGATIVE RESULTS AND PAPERWORK TO PROVE IT AND I WAS TOLD IM STILL DEFERRED REGARDLESS. I honestly believe this center lied and purposely “shammed” my paperwork in order to keep from paying me because I was getting the maximum payment for my plasma. DO NOT GO TO THIS CENTER !!!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110746295965595530359", "name": "Briana Colvin", "time": 1551400911338, "rating": 5.0, "text": "I am absolutely thankful for the excellent service. Ms.Sharmin always stick me, and she’s very great at what she do. 😊", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "116301019814554237117", "name": "Ardreana Thompson", "time": 1501789993254, "rating": 5.0, "text": "It wasn't bad. I got what I normally get st other centers and I've donated in Florida... So... All the reviews seem like they come from people who haven't donated before. But idk.. who am i?", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "107595652818038449763", "name": "Mon Jay", "time": 1551398963738, "rating": 5.0, "text": "I’ve been coming here for just shy of 5 years. Any problems I’ve had were addressed and handled. Glenda, Nay Nay, Teressa, Julia, Trina are Amazing. Emmitt is extremely thoughtful and has done great things for this location. Bre is funny if she gets to come out and visit. Nay Nay is one of the best sticks you can get.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "118060061363109742918", "name": "Antoine Thornton", "time": 1551459732775, "rating": 5.0, "text": "The staff is great and very professional. I love those guys. Especially Kay Kay..", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "116233963644120523408", "name": "Anna Aleander", "time": 1551980125637, "rating": 5.0, "text": "The staff is always nice smiling and they know me by name. Love the people here", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "116573804636273824905", "name": "Shaina Harris", "time": 1551453250509, "rating": 5.0, "text": "I love coming to this location. Always positive energy. 😍😁", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "106913498950979487483", "name": "LouAnne Harrison", "time": 1551399854995, "rating": 5.0, "text": "Very friendly staff. I felt very welcomed. . the phlebotomist are very professional and awesome at their job..", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112554623101476695693", "name": "R. Edward Brewer", "time": 1551400584420, "rating": 5.0, "text": "The staff at this location has always been wonderful and courteous. The “Plebs” in the back do great work, especially Sharmin and NayNay. The staff is the reason I’ve been coming here for over four years.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109670795113734170173", "name": "Monique Thomas", "time": 1551401000764, "rating": 5.0, "text": "The staff are very nice and well trained. The floor crew work around the clock daily and achieves there goals.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "107792692132673579215", "name": "TheCarrolls", "time": 1551398368548, "rating": 5.0, "text": "Julia and Nneka are super sweet and funny! So full of life super caring! Love them!!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "117155904504138189994", "name": "BEEPONOMO ENT", "time": 1551481661214, "rating": 5.0, "text": "I love xomcom here and being able to know that im helping someone who really needs plasma.. and the staff are nice and friendly no matter how much I get on there nerves.. sometimes I have such a good donation I forget about the money.. Thanks For all y'all do for us donars.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "111687065747342335765", "name": "Aj Lewis", "time": 1551454327908, "rating": 5.0, "text": "Have a good experience Everytime I come. Everyone is very professional and respectful and does a excellent job.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "101584218727696949832", "name": "Charlie Hawkins", "time": 1551453381972, "rating": 5.0, "text": "I've never had a bad experience literally my second job", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110748393164878785781", "name": "Christopher Abrams", "time": 1551463545204, "rating": 5.0, "text": "This is a great place to donate and pass time.. The staff is very friendly from the front to the back.. The phlebotomist are very good at their job!! Only problem i have is how the donors treat the phlebs sometimes and supervisors dont handle it properly.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "105006235482932327046", "name": "Brent Hurt", "time": 1551464498445, "rating": 5.0, "text": "Love em, nuttier than a fruitcake at times but aren't we all? keep up the good work", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "101239595180366512606", "name": "MOW GLI", "time": 1551535487582, "rating": 5.0, "text": "It’s a great place go and they take good care of you.!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109545002190095579497", "name": "Minnie Raven", "time": 1551513233439, "rating": 5.0, "text": "Ashley is the best phlebotomist here. She is highly reliable and professional.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112232703398627663682", "name": "Kerri Nichols", "time": 1563078599163, "rating": 1.0, "text": "DON'T WASTE YOUR GAS! They turned me away due to medicine I take that has NO effect on my plasma, even with a prescription.\n\nI went there for gas money and wasted the gas to get there. Just don't.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "105817850669193593926", "name": "Timothy Kelly", "time": 1551480654841, "rating": 5.0, "text": "My donation at grifols plasma care was a comfortable experience Miss Ashley and Miss Julia was greetful,experienced  kind clean workers who made my donation a breeze 😍💯", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "100678459693014447673", "name": "stephanie waldrep", "time": 1551398086738, "rating": 5.0, "text": "Such nice and efficient workers ! Could never have a complaint ! Nneka is always so caring and tries to cause the least amount of pain as possible!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "104243844161716220337", "name": "Qronik Jonez Official", "time": 1552319276373, "rating": 5.0, "text": "The staff is friendly,  knowledgeable and patient.  A great experience", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "114323627225315298497", "name": "Shamika Brown", "time": 1535295333700, "rating": 1.0, "text": "Not going back. I just felt uncomfortable and too much talking. The only lady I recall actually helping works in the back office and she is only one that actually knows how to handle a proper vein.  I felt brushed off while trying to get attention from the staff. 🙄🙄🙄🙄", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112489603119134914986", "name": "Robert Goldstoen", "time": 1550723915653, "rating": 1.0, "text": "Plz people don't do it not worth it time or the bond money u will have to spend for to get out of jail !! If u r a grown man or woman u will not stand for the treatment u will receive here .The so call nurse or whatever have had NOOOOO MEDICAL TRAINING AT ALL !!!.\nLORD GIVE ME STRENGTH NOT TO GO HAM IN THERE. WILL NEVER DONATE AGAIN TRUST !!  FYI", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "100642937713022948660", "name": "Melinda Gatelyi8", "time": 1512152335395, "rating": 1.0, "text": "The first time I came it was amazing. The staff was very nice.  The second time however I was barked orders. I chose to stand against the wall because the waiting area with seats was crowded with people.  I was told to sit down that I could not stand yet there weren't any seats. The lady at the front desk was so rude I will never be back again.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109054636751267297853", "name": "Jordan Dial", "time": 1551449226506, "rating": 5.0, "text": "This place is very clean nice staff is very professional too", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110613195728161153468", "name": "darrick streeter", "time": 1551471130031, "rating": 5.0, "text": "I truly enjoy my experience down at Grifols Plasma care the employees are very nice ... I always tell them Stay down til you come up!😂😂😂", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "111552899020668223378", "name": "Autumn Sanders", "time": 1551976912490, "rating": 5.0, "text": "Good place and good custmore services check them out", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "115069061144191216509", "name": "loren caswell", "time": 1546298797005, "rating": 5.0, "text": "It's a great center everyone is very nice at this center I won't use the other one on 4th ave north the staff  here are the best", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "111326849963782384726", "name": "Julia Anderson", "time": 1551455783951, "rating": 5.0, "text": "Love the center the phlebotomist are awesome in the back I will be returning", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "111260644586725024482", "name": "Shem Chirwa", "time": 1551471780003, "rating": 5.0, "text": "Grifols is a great place. The whole complete staff is absolutely wonderful. I started off as donor February 2018 and was encouraged by the friendly staff to become a certified Phlebotomist myself which I have been successfully working as for a full year. Special shout out to Glinda, Ashley, Julia, Markita, Bri, Trina, Sharmin, And Emmit from the 3rd Avenue south location in Birmingham Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112198720729865775080", "name": "Leo Rasta", "time": 1551446893502, "rating": 5.0, "text": "Great Work.. 6 Stars ✡️🖤", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "100319657305180027406", "name": "lilpmoney gogetter", "time": 1552079056928, "rating": 5.0, "text": "Most wonderful workers i ever know  they were great  julia is a great person so is kay kay and sharmin is also a great person", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109195485824862378382", "name": "LaShay Thompson", "time": 1551459307573, "rating": 5.0, "text": "The employees are efficient and make the experience enjoyable.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "108355698209544006296", "name": "Y Christian", "time": 1533648946954, "rating": 5.0, "text": "I LOVE the staff here.  Julia, Naka, Shan, Sharmin, Glenda, Charles, Pam, Julie, Mr. Emmett,  and the list goes on, but they are all very nice.  I don't know all of their names but could name off several more if I did. They will cut up with you and make you feel comfortable while still being professional.  I have read the reviews on here, and in my experience with this Grifols location for over a year now, I have had a couple of times where my money was not deposited or I got the wrong amount, however, when I called them, they looked into it and it was taken care of in a timely manner.  They are only human as we are and they are processing a lot of people daily, and mistakes are expected but not typical here.  I have also encountered a couple of people who were somewhat rude, however, I do not judge the center as a whole off of the few.  I know that if they keep up that behavior they will not last long at this job, as Mr. Emmett is all about customer service and taking care of his donors. I would recommend anyone to donate at this facility.  You can help save lives and make a little money in the process.  It's a win win situation!!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112645378585218899444", "name": "Bradley McCarty", "time": 1519760739478, "rating": 1.0, "text": "Some of the dumbest disrepectful people I have ever met. I don't think anyone that works there made it past the 3rd grade. I would recommend to stay away from this place. It's not worth the time or money.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "117643512941900570432", "name": "Shakiyla Tremble", "time": 1446909930581, "rating": 1.0, "text": "My first experience wasn't the worst but it wasn't the best. It took entirely to long. ( past the 2 hours they tell you) There was in issues with my machine, I had been on the bed for over two hours and wasn't even half way finished. After I felt I was about to pass out I called for help. The ladies was really nice In helping me, that is until some white lady came over and was basically telling me it was all my fault. I'm not sure of her name but she's normally at the front desk. I think she acts as the nurse. But the actual nurse was very nice and helpful. The other lady is always very rude and disrespectful. I don't like the way she talks to us like we are literate or like everyone is on drugs or something.i only started going because it was a grade for a class. I've stop going on serval different occasions simply because of her. I feel belittled every time she says something. It jus makes for a bad experience when she's one of the first people you come in contact with. There have been other situations as to why I will never go. Like lying about the money they will pay or not honoring the bonus they send in the mail. Moral of the story, just go somewhere else, save your self the headache.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "106498353998858360012", "name": "Devante McClain", "time": 1551453952726, "rating": 4.0, "text": "My experience been good at Plasma Donation Center & somewhat of a friendly staff. 😉😊", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "101672671844860577460", "name": "Shawn Thompson", "time": 1551480249531, "rating": 5.0, "text": "I really love the energy at this location. The staff is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112667493378437051475", "name": "Shufon Wood", "time": 1527617455079, "rating": 1.0, "text": "I had the most horrendous visit with this facility today. I'll start back to a couple of days ago I came in (right before close) as soon as I finished on the kiosk I get called to the back, despite the fact that there were multiple people ahead of me I go to get screened and a few minutes later she tells me my hemo-something is to low. I say what's that meaning, as in do I need to drink more water, eat iron or what? She rudly says that means you can't donate. I leave feeling like I was lied to in order for the staff to get off work on time, but I still come back today. Today I get called in to be screened by the same girl from Last time, I go back to the desk and POLITELY ask for another screener because she made me a little uncomfortable the last time. They agree but not before allowing the other screener to approach me like she wanted to fight and says \" you gotta problem\". Very unprofessional I thought. I get the new screener which is a Caucasian girl with glasses, I can tell she was young because she was very defensive about the other screeners behavior as if the way I felt didn't matter. Not once was she understanding of what I was saying. Everytime I would start to explain she would cut me off very condescendingly and argumentative like I did something wrong or made her uncomfortable. Mind you this is a supervisor who not once said, I'm sorry you feel that way, what can we do? I got so fustrated, still as calm as can be an say \"you are very defensive and are not listening to what I'm saying so if I'm done I'll just meet you at the door. She obviously angry, says your being hostel so I'm cancelling your visit. I asked well how am I being hostel? She says your being very disrespectful so I'm gonna have to ask you to leave. I ask what did I say that made you feel disrespected? she continues to say I'm gonna have to ask you to leave. I ask to speak to the person above her and she quickly says he's in a interview call back later. These employees need a class on customer/donor service. Just because I'm getting this little bit of change for my donation doesn't give you the right to treat or talk to me anyway.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "113476421371555948487", "name": "Zulu Musa", "time": 1500597863311, "rating": 1.0, "text": "They talk to you like you are nothing for $20. Stenphie Lee the director walks the center screaming at her employees and degrades the donors. If you are desperate and have no dignity this is the place for you. You can tell someone character by how they treat others who can not do anything for them. Stenphie Lee has horrible character stay away from this place go else where", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "113212685871034674015", "name": "Vincent Bersanti", "time": 1512153850462, "rating": 2.0, "text": "About the same as any other \"ghetto\" donation center. Slow, rude, unprofessional, ect... the receptionists act unapproachable for any questions. I see most* employees goofin' off playing around & enjoying a lil' personal chitchat than opposed to working to process people..", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109312289454541951973", "name": "Crystal Pettway", "time": 1517619780201, "rating": 1.0, "text": "I wish there was a way to post zero stars. My husband and I are long time donors,but will not be back. My husband has been told twice he\"clotted off\" and blamed his,even though the needle backed out of the vein so there was no blood to pull,and they are the ones who allow blood to sit stagnant in the line for several minutes while they drift around the floor and eventually make their way back over to try and stick the other arm. There are 4 other patients who have had the same experience in the last couple of weeks,and the same thing happened to me today. When a crop of new faces appear in the phleb pool,and bam every other patient is suddenly \"clotting off\" or who's veins all of a sudden \"ain't no good\" shouldn't that tell you something?? AND you call your patient a liar to their face when they relate to you what they have just watched happen to their arm?? 2 long time donors gone.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "113041806933804925579", "name": "Desire Scott", "time": 1515943518633, "rating": 1.0, "text": "Workers here are very rude and have no communication structure , came for my second vist and they were so rude. Employee was black. They wanted my address to be proven which I wasn't aware of it , came in before 8 people and got treated like I wasn't a memeber , I have been a grifols memeber for 9 years and this is the worst one this employer needs to be talked to our fired very unprofessional. Her name is pam.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "102706544281604140893", "name": "Marcus Edwards", "time": 1546080474145, "rating": 4.0, "text": "Great experience. Great people.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "101067982863222399976", "name": "Mrz Perry", "time": 1432994990831, "rating": 1.0, "text": "The LIES they tell! I was suckered into donating plasma supposedly to help people live so I came when they opened at 8a.m. Since I was a new donor to THIS company the website informed me it would take about 2.5 hours for the full process and to be patient. I am patient. What I am NOT cool with is seeing exactly how many people work here and how little is actually getting done. It is now 11a.m. and I have just made it to a donating chair surrounded by women taking about holiday plans and shopping trips. HELLO some of us would like to not be here for closing! I was told I can't leave so now my stomach is growing because I've been being patient since 8 am. Honestly I used to donate a lot but it became more of a burden on recent years than helpful to me so I haven't come back in years. They're going to pay me $50 today for plasma they can't use because I will NOT be back.\n\n*** UPDATE *** It is now May and I was contacted by a member of management concerning my bad experience almost 6 months ago. I wasn't actually able to donate because the untrained phlebotomist Jasmine had punctured my vein and blood was everywhere so the got me off the table and out the door with 50 bucks not telling me ANYTHING about how to care for my carved up arm. When I got home I took the bandage off and it was purplish. I iced it thought I would be fine, no it bruised enough to cover the entire inside of my arm and elbow. I went back to show them they thought I was trying to donate and turned me away so I washed my hands of it. 6 months later in may NEW management with the SAME staff calls me to tell me they will pay me the new donor fee of 50 plus the 70 I WOULD'VE made had Jasmine not messed up my arm. So I go back. Jasmine is still there and the new mngmnt lied to get me there. I was one week out side being a new donor, so I only got 20 plus 70 but no prob right I just won't let Jasmine anywhere near me. (She tried to help but I was like NO she devil stay FAR away!) So I got a different sticker and she did fine but tried a new vein I had never used before but it seemed fine till it was time to put blood back then my whole arm started hurting. I made it up in my mind then no matter how much she calls or sends letters I'm NEVER going back. Then I get home and take the bandage off 5 hours later and a golf ball sized lump is under my skin. I panicked and called them back they said ice it and it should be fine. That was a week ago and I STILL have no strength in my arm. NOW my arm has bruised outrageously AGAIN. The messed up part though is the FACT that it's summer time so I'm having to wear sleeves to hide THEIR mistakes. PLEASE PLEASE PLEASE don't go to these butchers! I know sometimes life gets hard but your LIFE is worth so much more than a punk a$$ 20 dollars. Stay FAR FAR FAR away from this place!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "113531031735129323127", "name": "sylvester Tolbert", "time": 1551396510303, "rating": 5.0, "text": "I love the people that work there", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "101626491612325778514", "name": "Lucas Armstrong", "time": 1508008773208, "rating": 1.0, "text": "Bossy, disrespectful staff treats innocent people like criminals and children.  Go to another center chances are prices are better anyway.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "117906071969212529026", "name": "Archie Brooks Jr", "time": 1551447783970, "rating": 5.0, "text": "They are the best!!!!!! Excellent staff and service", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109590546840693686592", "name": "Tammy Bernosky", "time": 1551469153659, "rating": 5.0, "text": "The lady Ashley, Glenda, and Julie are the best", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "103321699263436462959", "name": "Kira'Cole Harris", "time": 1440544616312, "rating": 1.0, "text": "I accompanied my husband down to the center for support as this would have been his second time donating. Our first overall experience was very pleasant as far as the actual donating of his plasma. Unfortunately the customer service we received was UNACCEPTABLE but we were grateful for the compensation. We also respected the possibility of knowing we could actually safe a life. On our second visit (which was within the same week) my husband was informed that our address was not accepted and he would have to provide mail from a different address in order to donate presently and in the future. We returned to the location 3 different times with mail from his mother's address whom he had resided at and currently still does from time to time when we are in a bind. All the mail was unacceptable. At this point I intervened into the situation asking to speak to a Manager whom I felt would give us a more detailed explanation of  information required of us.  This is where my whole experience turned negative plus. An African American customer service rep with long black braids name Yvette (I believe) was standing at the counter with a young gentleman representative when we approached to ask for a Manager. The young gentleman politely informed me he would get someone to assist me. He exited the area to wards Tha back (I'm thinking) to go get a Manager. The representative Yvette stayed at the counter inputting keystrokes into the computer terminal she was standing in front of. I proceeded to discuss with my husband that he should always ask for a Manager if he is not understanding what is being requested of him. While I'm talking I look over toward the back waiting for a Manager and I see Yvette totally engaged in our conversation as she was looking directly at us. I involved her into the conversation for her input b/c she is an employee at this center. I asked her if she understood what we were asking of them. She rudely responded \"No I don't, but I hear you talking.\" I told her okay nevermind & thank u. She replied. \"I know that's real.\" Then proceeded to grab paperwork off the counter and walk away laughing. I responded with a mimick of her laugh. Three minutes later she returned calling my husband's name requesting him to meet her in one of the consultation rooms. I could hear their entire conversation from the waiting area. She, Yvette (the same representative whom earlier had no input nor help on our situation, informed him he needed a post office marked letter or an unopened piece of mail addressed to him from a different address. We left went and got another piece of mail for the fourth time. We returned an hour later to find out that unopened mail without a post mark was unacceptable. At this point my husband was given a blank envelope and told to mail himself a piece of mail to the address and this would be acceptable. In my hesitation we agreed to do so. We got the mail the next day and returned to the center. He was informed that they also needed a utility bill in his name from his Mom's address. We left and decided that was enough for us. We will never recommend this particular location to anyone. The rep Yvette is rude discourteous and unprofessional and we will not tolerate this type of behavior in any business endeavor we participate in. FIND ANOTHER LOCATION, IN THE END YOU WILL APPRECIATE ME.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "115530579157285700959", "name": "Richard Parker", "time": 1473184998023, "rating": 1.0, "text": "I have never in my 45 years of living has been to a more disorganized place. PERIOD After 6 hrs first time, I went back, gave \"head of the line\" pass 2 hours later I got to the counter girl glanced at my arms nope cant do it. I had this on my arm last time,  nope. Next 2 times the same. One time gave head of line pass, I left after 1 and half why waste it. Finally I call managment, sure that's ok you can give. Its not where you get stuck. Told him what happen. Im gonna get you ahead of the line pass today give you an extra one. Hour and half later ge walks out, I throw my hands up, I get walked back. Suppose to get 50 first 5 times today after my 7th visit but only 3 time able to give. Got paid 20 bucks now more time wasted got to call. WHAT IS SO HARD? Ridiculous. I dont do this. This is the first reveiw ever.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "106126986372164310484", "name": "Barbara LaCross", "time": 1527785382391, "rating": 1.0, "text": "Employees don't give a deal\nabout people's situations and it seems they always find a reason not to let you donate the days you are supposed to get more than $25.", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "116281797792588979179", "name": "Skylar Nicole", "time": 1551400973311, "rating": 5.0, "text": "Great techs and environment!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112923180045727543593", "name": "Cortez Smoot", "time": 1563299910991, "rating": 1.0, "text": "These people just turned me away as soon as I walked in for wearing shorts ARE THEY SERIOUS", "pics": null, "resp": {"time": 1563505621881, "text": "Thank you for your feedback Cortez. We apologize that your experience was less than satisfactory and we'd like to hear more. Please call us at 1-855-697-5276 to speak with a representative."}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110284628095109252063", "name": "Susan Ashworth", "time": 1551401098575, "rating": 5.0, "text": "They are very nice", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110008789929541911751", "name": "laci coleman", "time": 1574100927146, "rating": 5.0, "text": "Awesome staff", "pics": null, "resp": {"time": 1574353893519, "text": "We appreciate your feedback. Thanks for being a loyal plasma donor!"}, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112686613645846679061", "name": "Lamar Avery", "time": 1551401017592, "rating": 5.0, "text": "Phlebs are excellent! !!", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "108741988203669197718", "name": "hambyanthony", "time": 1551472608770, "rating": 5.0, "text": "All employees treats everybody with respect and care", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "109509368792806769477", "name": "Charles Bryant", "time": 1525974049100, "rating": 4.0, "text": "Good for the people and the pockets", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "104904873996659216051", "name": "Danny Dickens", "time": 1551458359174, "rating": 5.0, "text": "I like yall", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "110571528998103340523", "name": "Davaron Pickens", "time": 1551463285723, "rating": 5.0, "text": "Easy and painless", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "112456167681102220733", "name": "Stephanie Ray", "time": 1551401422105, "rating": 4.0, "text": "Great care", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "114722624625517078192", "name": "Arthur Green", "time": 1551976799260, "rating": 5.0, "text": "Love this place", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "106947756009564268202", "name": "#1BADAZZ SAVAGE 4LIFE", "time": 1544666519003, "rating": 5.0, "text": "Great atmosphere", "pics": null, "resp": null, "gmap_id": "0x88891bbfe824dcdd:0xa2d02235b2cc2f66"}
{"user_id": "102109079454821389822", "name": "Amber McKelvey", "time": 1626454960581, "rating": 1.0, "text": "If the workers would stop talking about their personal business on the floor maybe they could stick more  people without them having to wait 45 mins plus. Other than that this place is good to donate at. Clean restrooms and Renee and Zandra are GREAT!!!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105203261543232451288", "name": "Valeryia Jones", "time": 1622322437321, "rating": 5.0, "text": "The techs and the staff here are Absolutely Awesome!!! They take really good care of their donors, and treat you like family. And there's never a dull moment here at Octapharma Plasma! And they have this Awesome message on a nicely done bulletin board that reads \"MAY YOU BE PROUD OF THE WORK YOU DO THE PERSON YOU ARE AND THE DIFFERENCE YOU MADE\"  which shows you how awesome they really are😎", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "111670124724064282461", "name": "Kimberly Salinas", "time": 1622578494229, "rating": 5.0, "text": "The staff is very friendly. I usually come in and out fast and in no time. The staff is never rude.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "113895786143954785496", "name": "Jamie Storvik", "time": 1620492906620, "rating": 3.0, "text": "The facility was clean. The staff was friendly. However, Victor was the only one who knew how to wear a mask. The rest of the staff just wore them as chin straps. There was a manager looking person who didn't even bother. Brooke, who stuck me, didn't give me the run down for the new donor I should've gotten. She also went between patients without changing her gloves. These serious health violations should be dealt with. Everyone could use a refresher training. Too much personal talk on the floor.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112190183322658160797", "name": "Kristy Barnett", "time": 1621349502208, "rating": 5.0, "text": "Great place to go to donate. Friendly staff, very knowledgeable, and make every visit comfortable. Will keep donating here!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "108245774531242387182", "name": "Desmona Wynn", "time": 1626439485013, "rating": 3.0, "text": "Awesome staff however can we get two ppl in front in the morning because 45min wait when there are at least one more person that can help that one lady in the front come on Jeff let's get some front staffed ppl ..we don't like to wait when there is more ppl in the buildythat can help the front line seriously..let do better with this because this is ridiculousness at its best with this tomfoolery come on please and thank u.. The back is great moving pace bit that front my gawd", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "109640299068057132399", "name": "Allison Davis", "time": 1622929266927, "rating": 5.0, "text": "Sweet and kind staff! Coming here really helped me get over my fear of needles and i love all the staff here! They rock!!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105550723215696280972", "name": "destiny santoyo", "time": 1622043624905, "rating": 5.0, "text": "Great place! Super clean and staff is always super friendly", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "101648384314699644340", "name": "Joseph Chatman", "time": 1624902533638, "rating": 5.0, "text": "I've been comin here foe 7 years and love da staff, I'll keep donatin to help save lives until I can't anymore.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105290547551859224785", "name": "Kristy Luttrell", "time": 1620420235330, "rating": 5.0, "text": "Staff is hands down awesome....best place to donate your plasma! Fast in and out.....", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "113176932187386844256", "name": "Teka Boshell", "time": 1620419641164, "rating": 5.0, "text": "I've come here for about 2 months.   It's a great way to make money & help!!  I bruise sometimes, but it hasn't stopped me (until my bruises go away).", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116251792024716552931", "name": "Dezi Wynn", "time": 1622031840670, "rating": 5.0, "text": "Shay and Ana just to name a few up there that keeps me loling and take good care of they patients", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112024642181760200176", "name": "Kim Salinas", "time": 1620668083691, "rating": 5.0, "text": "I love the staff at octapharma everyone is always so friendly and nice. I get in and out fast.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106415143298527672164", "name": "Winnifer McAtee", "time": 1620335841767, "rating": 5.0, "text": "Awesome place and very friendly people! Great pay and they always have wonderful promotions and prizes!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "110595189994127907511", "name": "Shana SalinasFulks", "time": 1620669587249, "rating": 5.0, "text": "I love octapharma the staff are wonderful and so nice. I come in and out fast.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "114792500362673648005", "name": "Alexis Zeis", "time": 1620936617522, "rating": 5.0, "text": "They are very sweet nice and do their job it’s a great environment and experience", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "107342187853623660550", "name": "Joshua Barrand", "time": 1620833831847, "rating": 5.0, "text": "It's the best place to donate plasma they are great people", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106306634691552269201", "name": "Anna Hinton", "time": 1620832920142, "rating": 4.0, "text": "Great people and easy way to earn some money and help others", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105622580904520290728", "name": "Frank Fredella", "time": 1621197328640, "rating": 4.0, "text": "Good fast friendly staff,best place by far to donate, cool raffles like a xbox x, and boneses if you are dedicated to helping others", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "113400614278302886882", "name": "Jason Hendrix", "time": 1622053738560, "rating": 4.0, "text": "Friendly and hardworking staff. Easy and great experience!!!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106610294377099808235", "name": "Sports Young", "time": 1620486332220, "rating": 5.0, "text": "Great people. Great cause. Extra money. 👍", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116758364282086957789", "name": "Kat W", "time": 1620487023401, "rating": 5.0, "text": "The best! Everyone is super friendly :)", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "101424969672912381219", "name": "Jessica Myrick", "time": 1621003584656, "rating": 5.0, "text": "The staff is friendly, quick,and efficient!! I love this place!!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112616906020949779934", "name": "Django Freeman", "time": 1620754849171, "rating": 5.0, "text": "Clean environment, friendly staff & a well run establishment.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "114525516190655814569", "name": "ChrisNChristy Wheeler", "time": 1620562494373, "rating": 5.0, "text": "Always professional, and treat you kindly at the Florence blvd octapharma plasma", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "114581223856596221023", "name": "Kingston King", "time": 1620478687686, "rating": 5.0, "text": "Nice place, Nice Service. Helpful Staff.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "109717619495328448426", "name": "Ashley Bass", "time": 1620420630793, "rating": 5.0, "text": "Excellent staff. Clean environment", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116023834762997029051", "name": "6IGxKAP_424 TV", "time": 1622051728717, "rating": 5.0, "text": "The workers are very nice", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "101613486624049020805", "name": "Venus Allen", "time": 1620590349787, "rating": 5.0, "text": "Great place awesome people", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106166608232715956385", "name": "Josh Bass", "time": 1620845365329, "rating": 5.0, "text": "Octapharma plasma has a excellent staff", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "115688570060781392611", "name": "Laken Bell", "time": 1622043987838, "rating": 5.0, "text": "Stuff very friendly and place is very clean.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "114855434306766831780", "name": "Catrina Royce", "time": 1620252090331, "rating": 5.0, "text": "Very clean environment, friendly staff", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "104895438771666612965", "name": "David Hinton", "time": 1621002020396, "rating": 5.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106596745666395321666", "name": "Dixie Littrell", "time": 1570287518262, "rating": 1.0, "text": "Every time I come and Sergio is here I wait 30 minutes to just be stuck when he’s standing at my station or he just skips over me completely!\n\nAnyone else that works there gets me really quickly and does there job! I think this place should get their workers to work!\n\nI have a job and kids, I don’t have time to wait on your bad employee to quit running his mouth about Alabama fans so when he finally does stick me he misses and has to dig in my arm when everyone else gets me first go!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116988628673653831884", "name": "Amber Vess", "time": 1576132315125, "rating": 5.0, "text": "I've been going for years and the staff has been so friendly and nice, almost like family... They are very clean and sanitized and have a nice work environment", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "115426783793587746023", "name": "Privately Known", "time": 1572886034368, "rating": 2.0, "text": "For the most part staff is great. Friendly, professional and efficient, however they need more staff to complete intake. Keiosk takes five minutes, standing in line to get vitals screened has been taking around 45 minutes. Go to the back and sit and wait another 45 minutes. They call your name and you wait another twenty minutes or longer just to be stuck. That Sergio will what feels like intentional dig in your arm if you say or complain to him about anything. Never have a problem with any other staff sticking me but Serigo left my arm bruised for two weeks. I even told him that he was hurting me and I swear it got worse. Needless to say Sergio avoids me at all now. That tells me that he did it on purpose and knew exactly what he was doing. Otherwise why avoid eye contact and doing anything and everything he can to avoid having to deal with me at all. Probably best that he does.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112092555969964168165", "name": "dawafo 256", "time": 1525286932227, "rating": 5.0, "text": "The staff here are always pleasant and friendly. Any questions that I've had they've always been helpful and informative. This is also a great way to give back to help those in need. I would like to thank the Octapharma Plasma Center for being part of our community and helping others in their time of need.", "pics": null, "resp": {"time": 1525700247922, "text": "Thanks for your great rating of Octapharma Plasma! We try to make your plasma donation experience as safe, easy, and rewarding as possible, and we’re happy to see you enjoyed your visit. Come back and see us soon!"}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116773176850047790204", "name": "Mackenzie Varnell", "time": 1523885408538, "rating": 5.0, "text": "The staff are always pleasant and helpful! Not only is it for a good cause but you get monthly bonuses and entered for prizes. I definitely recommend this location.", "pics": null, "resp": {"time": 1523893120924, "text": "Thank you for your positive review of Octapharma Plasma, Mackenzie. We appreciate each of your life-saving plasma donations, and we can’t wait to see you again in our center soon!"}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "107861335051464831419", "name": "Lakyn Wallace", "time": 1496418924499, "rating": 5.0, "text": "I love this place. Very courteous and professional. Always clean and quick with their work. Not really had to wait any either. Quick in and quick out. :)", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "100984563108123891223", "name": "Laney Smith", "time": 1488086765196, "rating": 4.0, "text": "I have O- and have always wanted to do this because I know it's not a plentiful blood type. The staff was super professional, and I even got turned away the first time for not having the correct information. They follow the rules 100%, which actually made me more comfortable coming back. Professional, caring, clean, and will answer all questions even if you ask twice.", "pics": null, "resp": {"time": 1488547611705, "text": "Hi Laney, thanks for the review. We are always happy to have a new donor at our center. Customer service and safety are very important to us, so we are glad you were able to provide correct documentation. We look forward to seeing you back in center again soon."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "110052130290702339600", "name": "Bridget Simms", "time": 1582988591304, "rating": 3.0, "text": "Nice staff but there is a high turnover and the back maybe clean but the front  Lobby is filthy", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112328699382033191072", "name": "Tanya Settlemyer", "time": 1505248927968, "rating": 5.0, "text": "The nicest place to donate life saving plasma.  The staff is always friendly and answer any questions you may have.  They are fast as well.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "103963245896800786615", "name": "Jessica Chambers", "time": 1489158027803, "rating": 5.0, "text": "I absolutely love the staff here! They are kind , courteous, and prompt.  Also this is by far the fastest place to donate plasma with minimal wait time!  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102622075505701659702", "name": "Ashley Carpenter", "time": 1599508533533, "rating": 5.0, "text": "Staff is the greatest!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "101763808107036576683", "name": "Jeff Martin", "time": 1542050099534, "rating": 2.0, "text": "This isn’t a reflection on the workers, it’s the management, but it’s obvious that they are trying to get by with the least amount of staff possible. I’ve had to leave the past few times because I was waiting for over an hour and a half from the time I made it to the back til I was done and when there is a full staff I’m out in 30 minutes. It’s ridiculous. I’m don’t wasting gas to drive there and see 5 people waking around doing nothing while two people are trying to take care of 50 customers.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "107562713761666231761", "name": "Hannah Wheeler", "time": 1530309416992, "rating": 2.0, "text": "Great for quick money . Although you could stand waiting a hour mostly and a lot of the people sticking are fresh out of school or training . So expect some issues . Would defiantly only go in the early morning when the staff is in a good mood and flow !", "pics": null, "resp": {"time": 1531920553811, "text": "Hi Hannah, Octapharma Plasma works hard to staff each of our donation centers with courteous, respectful, and professional employees. We appreciate feedback on any areas our staff can improve, because our donors deserve the best customer service possible! Please speak with your local donation center management so we can address and solve any of your concerns moving forward."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116467250096820673314", "name": "Shannon Butler-Hobson", "time": 1477257947728, "rating": 1.0, "text": "Would not recommend to anyone! Was treated as if I was seeking drugs instead of being there for them to take blood(plasma)!!! My boyfriend, (on his 2nd visit) was looked at for 30 seconds and told his vein was too hard to find!  Basically got the impression that some of the staff didn't want to be bothered! The one star was for the nice lady at the front desk...", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112660243260461672415", "name": "Tiffany Bitting", "time": 1535808506232, "rating": 1.0, "text": "Called just to get information about donating and was placed on hold for 18 minutes before I finally hung up and called back. I explained to the lady who answered the phone what happened and she started speaking to me as if I were an idiot. The entire conversation was not professional at all. Front office staff is the face of your company. Hire better representation or you won’t get people in the door. I know I won’t be, because if I can’t trust you to get corrrect answers from simple basic questions then I definitely won’t be trusting you to put a needle in my arm.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "108500749821371772303", "name": "Kara Williams", "time": 1524979074104, "rating": 5.0, "text": "Great staff and very easy-going and caring. They are very experienced and do their job well", "pics": null, "resp": {"time": 1525093425988, "text": "Thank you for your review. Our staff love interacting with our amazing donors, and we always appreciate hearing from customers who've had a good experience at Octapharma Plasma!"}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106657943049957080985", "name": "Fred Pearson", "time": 1538771834801, "rating": 1.0, "text": "Under staffed a short wait is 2 hours but most days figure on being at the center for 3 hours plus. The staff never completely explains that for any reason after doing the kiosk which takes between 5 and 10 minutes and a wait in line on a screener they can tell you that your deferred for reason not explained with the first signing up procedure to go home and come back tomorrow.  This place is waste of time for a max cash of $65 a week.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112192271310415508844", "name": "Kenneth Davis", "time": 1489530109489, "rating": 5.0, "text": "Florence's Octapharma Plasma staff is the best hands down. They always make you feel welcomed regardless of the day their having and they even greet you with a smile.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "115380397290346105277", "name": "Arturo Arellano", "time": 1524868877568, "rating": 5.0, "text": "Very clean facility and everyone is super nice and helpful! Everyone normally works very hard to get you in and out as fast as possible.", "pics": null, "resp": {"time": 1525093040245, "text": "Thanks for your great review of Octapharma Plasma! We're happy you enjoyed your plasma donation experience, and that you had excellent customer service. We hope to see you in our center again soon!"}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "114676511933089321438", "name": "Joshua Carlisle", "time": 1498065676731, "rating": 5.0, "text": "Great center. The only down side is everyone is so fabulous it makes me feel quite plain.", "pics": null, "resp": {"time": 1498569836275, "text": "Thanks for the kind words, but if you are a life-saving plasma donor you could never be plain!  We look forward to seeing you back in center again soon."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "108140608553121643904", "name": "Anna Hinton", "time": 1545572982455, "rating": 3.0, "text": "Some of the people are good other's not so mich if you have been on a program at other centers they do t have theese programs stay where you are to get bonus you are entitled to", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106296881587867780016", "name": "Andrew Flanagan", "time": 1476913793085, "rating": 1.0, "text": "Prejudice and discriminatory!!!\nVery uneducated and ignorant staff member I dealt with. Also backed up by her superior, obviously another brain dead individual.\nWhen coming here for a second time to try and do something good (as I didn't have the correct proof of address the first time), the blonde haired woman refused my social security card as identification. Saying we can't accept this??? The very purpose is identification issued by the government, the highest form of identification proof obtainable.\nThe blonde woman incorrectly stated it wasn't a social security number?? It was for work purposes only. Lost for words... Well if I'm not mistaken the entire purpose of a social security number for citizens, is actually work related.\nThe lack of intelligence is astounding!\nMy social security card does indeed say for work purposes because I am from the UK, it is informing me that it is an important piece of information for me to work in this country.", "pics": null, "resp": {"time": 1478878049737, "text": "Customer service is very important to Octapharma Plasma, and we hope you will give us a second chance. First time donors will need to have a current, valid photo ID, proof of your Social Security number (original Social Security Card acceptable), and proof of address. For more information on acceptable identification documents, visit http://octapharmaplasma.com/donor/first-time-donors ."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116862486991410377950", "name": "Susan Cushion", "time": 1568213059439, "rating": 1.0, "text": "I drove an hour for them to tell me since my last name is different on my id than on my social security card that they couldn't allow me to donate. Had to turn around and drive an hour home.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102606221306317468063", "name": "Brian Vaughn", "time": 1575484349771, "rating": 1.0, "text": "This place is bull..they say donate twice in a week period and get more money,but when you do they come up with some excuse to why it's only $25 again,a rip-off,they take people's plasma give yo a low amount n sell it for 5 times more than they give you ..this place is a joke", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105704321663283122750", "name": "ShadeOfKrimson Gaming", "time": 1562369262551, "rating": 1.0, "text": "When it comes to get your physical, just hang it up. They will continue to help people after you while you sit and wait in frustration. They are under staffed and only care about keeping the flow of donates moving.", "pics": null, "resp": {"time": 1563282477117, "text": "Hi MyKnee. Octapharma Plasma makes great efforts to keep our donation centers staffed with the necessary employees to give you a first-rate donation experience each time you visit. While the number of employees on the floor may vary during peak and low donation times, staff always knows to focus on customers as a top priority. If you would like to start an open communication with your center about staffing, please speak to center management. Thank you for your life-saving plasma donations."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102488180359728646604", "name": "Mykell Ramsey", "time": 1498691620557, "rating": 5.0, "text": "Always friendly, and professional. No complaints. Can't ask for much more from your friendly neighborhood phlebotomist.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "117378054950499773753", "name": "Leah Miles", "time": 1526856556441, "rating": 5.0, "text": "Great place to give back to humanity a get a amall check for the generosity!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "115389535968306311367", "name": "marcus pruitt", "time": 1563479241144, "rating": 5.0, "text": "Ok i have been donateing at this center since they gave out cash so ive been throughtthe bad times with them.the staff is amazing but now they got new machines and now the wait time is way longer than it used to be. It takes thirty minutes to a hour and a half to be stuck now once you get back there because they have less machines and are understaffed. They say they pay you for your time and if that is supposed to be true they need to raise how much they give. Takeing up to 3hours to donate is bad.  Other than that great place and great staff. And one other thing the promotion the have been doing lately 50 dollars for the first 5 donations I didn't get and I didn't get to skip people in line.  Things need to chang", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "111163223007760247228", "name": "Karen Dodson", "time": 1475941052604, "rating": 5.0, "text": "I've been going to the same Plasma  place for years and have always been treated nice and professional.  Would recommend it to anyone", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105818455037352460443", "name": "Karla McDonald", "time": 1565730811657, "rating": 1.0, "text": "We sat here for 4 hours and still didn't get finished and  it's not like there weren't numerous employees aren't just standing around discussing their vacations and you guys have been begging for donations and new donaers yet the wait time is insane and pay minimal - come on y'all get it together plz!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102285630605361285733", "name": "Jeremy H", "time": 1482144403086, "rating": 4.0, "text": "The staff is very personable and they take you through the process of donating in a timely manner.", "pics": null, "resp": {"time": 1487779477727, "text": "Thank you for kind words and life-saving plasma donation. We look forward to seeing you back in center soon."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "115023118413442352875", "name": "Seth Ferguson", "time": 1489450159300, "rating": 5.0, "text": "Great customer service, fast wait times. I highly recommend this place!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "117922668575108112123", "name": "Deanna Kent", "time": 1495477349385, "rating": 5.0, "text": "Awesome staff. Great way to make money", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "104779591506606912126", "name": "Brandon Madden", "time": 1493831316830, "rating": 5.0, "text": "Awesome!! Been going there for a while..Staff is always nice..", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "115479331614628335955", "name": "Dena Edwards", "time": 1496067301461, "rating": 5.0, "text": "I love the plasma center y'all really do have some good workers!!!!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "111630612111606082425", "name": "Jamie Allison", "time": 1541589188846, "rating": 5.0, "text": "I have donated since 2011. I love helping save lives and earning extra money!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "101866894407613110906", "name": "Rebecca Sanchez", "time": 1511916128229, "rating": 1.0, "text": "Well i go get my plasma done and they miss both times,bruise both my arms and have the nerve to ask what did u eat....I never had this problem before and my eating habbits dont change..then im told come back tomorrow so i do but when i get in the exam room im told my bruises r to bad cant donate..wow wasted my time and fuel.. I ask to speak with someone and im made to wait 45 min and still nobody shows up.... Not professional at all..\nComing from a fellow Phlebotomist", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102278482927883838709", "name": "Jason Smith", "time": 1523481881712, "rating": 5.0, "text": "The staff is awesome been donating for 3 yrs", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "114023698018264760310", "name": "Dustin Vigil", "time": 1572989371255, "rating": 3.0, "text": "Very slow about getting u in and for first time donors it takes between 3 to 4 hours to start", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "110224777155899339899", "name": "Ron Almy", "time": 1547252509823, "rating": 5.0, "text": "There really good with people", "pics": null, "resp": {"time": 1547844811017, "text": "Thank you for sharing your feedback, Ron Almy. We appreciate hearing from our loyal plasma donors and look forward to seeing you back in center again soon."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "106914150426563034723", "name": "Kayla Crowson", "time": 1492804939238, "rating": 5.0, "text": "Great way to make extra money!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "110584994047331967001", "name": "chris Barnes", "time": 1491329005874, "rating": 5.0, "text": "Everone is nice and have great persanalities", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112247464521377388356", "name": "Crisco Kraven", "time": 1390157977854, "rating": 1.0, "text": "WORST PLACE EVER!  Full of dumbasses.  Wasted money on gas for two trips that I wasn't able to donate my plasma for because of their stupidity for either not having a way to pay people or because they forget to tell you that you need things other plasma centers don't.  Avoid this place at all costs.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "100722822889794999862", "name": "Randall Ricks", "time": 1489616628173, "rating": 4.0, "text": "Fast paste and good service.", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "107943412333095558697", "name": "JOSEFF BENDALL", "time": 1554874745722, "rating": 3.0, "text": "Understaffed, takes 3 hrs to donate. I think the pay should be raised!!!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "109749140615502852335", "name": "Deamz", "time": 1502659701923, "rating": 5.0, "text": "They are professional and very helpful", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "110681594352682509516", "name": "Erykah “Dee” Watson", "time": 1490381366584, "rating": 5.0, "text": "Very nice & friendly staff!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "101813888625403778693", "name": "Betsy Bogus", "time": 1427714053821, "rating": 5.0, "text": "People are very nice that work there", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "109648020198355761978", "name": "Allen Davenport", "time": 1490393577031, "rating": 5.0, "text": "Great staff very friendly", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102882424962499789260", "name": "Jade Hammer", "time": 1489955887262, "rating": 5.0, "text": "This place is great!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "109707563028608755659", "name": "Brittany Roberson", "time": 1521314331803, "rating": 1.0, "text": "Rude ppl in professional talk smack about me", "pics": null, "resp": {"time": 1521735723777, "text": "Hi Brittany, Octapharma Plasma works hard to staff each of our donation centers with courteous, respectful, and professional employees. We appreciate feedback on any areas our staff can improve, because our donors deserve the best customer service possible! Please speak with your local donation center management so we can address and solve any of your concerns moving forward."}, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "105769135627622540898", "name": "Josh Watts", "time": 1489612450099, "rating": 5.0, "text": "Very nice staff", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "107876213959667345118", "name": "lori gessini", "time": 1495477254360, "rating": 5.0, "text": "Bring a jacket, it's always cold!", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "116234106474444155975", "name": "Jake Green", "time": 1496595260409, "rating": 5.0, "text": "Good experience", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "103908368091501424141", "name": "David Dawson", "time": 1545826699516, "rating": 4.0, "text": "The people", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "112475427449116616844", "name": "Tareon Reed", "time": 1495888027398, "rating": 5.0, "text": "Professional", "pics": null, "resp": null, "gmap_id": "0x887d358a2bad86a9:0x6070101daf8518ac"}
{"user_id": "102577814348765177537", "name": "Jake Swardz", "time": 1607701380742, "rating": 4.0, "text": "Great friendly people there. Never have had a problem. Took a star because I can never get anyone to answer the phone before 11, but other than that everything is good.", "pics": null, "resp": {"time": 1607789105528, "text": "We value your feedback. Thanks, Jake, for helping save lives and being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103034408494525470904", "name": "Leon Wilson", "time": 1607554245727, "rating": 1.0, "text": "Call six ppl who arrive after me and when i talk to manage to deal with it....it didnt work out. Will not go there again", "pics": null, "resp": {"time": 1607556386906, "text": "Hello, Leon - We apologize that your experience was less than satisfactory. Patients are counting on your plasma donations, and we would love to see you again. Your feedback is important and will help us improve every donor's experience. We'd like to hear more about what happened, please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105789368687036850507", "name": "Kierra Grillo", "time": 1578411458545, "rating": 5.0, "text": "Everyone and the staff here is great and very sweet. They are always extremely helpful and feel like I've been a family with these people. There are slow times but every employee works their hardest to keep things moving timely. Great experiences.", "pics": null, "resp": {"time": 1578494110067, "text": "Thanks for doing your part to help save lives! Patients appreciate your commitment."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "117024829608040391359", "name": "Shelby 2826", "time": 1607416068096, "rating": 3.0, "text": "Covid-19 Guidelines are falling through the cracks. No one designated to enforce outside social distance markers and rules as 1st come 1st served. 12/7/2020 @ 8:00 A.M. Sorry this incident ruined my experience and I probably won't be back.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104772940079749333270", "name": "Luis Castillo", "time": 1580999747557, "rating": 5.0, "text": "The entire staff is really really thorough, personable, and professional. Your first time donating will take a little while with the initial physical, but after continuous donations it gets faster every time. They really help you understand how important it is to continue to come in order to make your donations count!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100881208573382484758", "name": "Bridget Thompson", "time": 1581185676375, "rating": 5.0, "text": "Great staff! Everyone is very nice and professional. Would recommend to everyone who wants to earn some extra money it’s easy and helps saves lives", "pics": null, "resp": {"time": 1581692810010, "text": "It's not often you get to do something that helps other people while earning a little extra income. Thank you for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105970774930578883558", "name": "Peter Ishman", "time": 1581172162530, "rating": 5.0, "text": "The employees are great. They're always happy with a friendly smile. The facility is clean. There's hardly any wait time at all. This location is the only one that I will go to. How do you recommend", "pics": null, "resp": {"time": 1581692515430, "text": "Thank you for donating and your feedback. We are dedicated to making sure our plasma donor centers are clean and a healthy environment for all our donors."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "109159384200852456433", "name": "Damon McGruder", "time": 1599059174948, "rating": 1.0, "text": "The staff is not friendly. Most of them act like don’t want to be there. They hurt you when they stick you with the needle because most of them don’t know what they’re doing. The worst part is the receptionist. She’s always so rude, never wants to help. They’re awful unhappy people.", "pics": null, "resp": {"time": 1599172671498, "text": "Thank you for bringing this to our attention. We apologize, Damon, for your experience while you were in our center. Your feedback is very important to us. We are dedicated to making sure our center team members are respectful to every plasma donor. If you would like to provide additional feedback or have any questions, please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108447182860030575226", "name": "Pam Jean Nelson (DeLunartiC)", "time": 1594479288482, "rating": 3.0, "text": "Great facility but donar fee isn't accurate.\nAdvertised as $40, but there's fees deducted.\nFor example, donor card fee and state tax fee.\nEmployees are careless conducting jackpot. They forget to initial or place stickers on winners. Causing donors loss of bonus pay.\nThey're not thorough with money refunds.\nOverall the amount for donation isn't fair.\nDue to current circumstances of COVID-19.\nFee should start $50, plasma is expensive.\nIt's use cost alot, so balanced ratio is required", "pics": null, "resp": {"time": 1594483447452, "text": "Thank you for sharing your concerns. Your feedback is important as it will help us to improve every donor's experience at our plasma donor centers. If you would like to provide additional feedback or have any questions, please call us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106433126025677692413", "name": "Bailey Daniel", "time": 1581018030137, "rating": 5.0, "text": "The changes they have made in the past few months are amazing! Fast service and friendly and professional staff! I would recommend Talecris to anyone thinking about donating plasma.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "110753174614869687453", "name": "Felicia Chambers", "time": 1574789835099, "rating": 5.0, "text": "I love the staff here they are friendly, professional, and always give great advice on how to make your plasma experience a great one. I hope very soon that upper management will allow these staff members to have more holidays off beside Christmas and New Year's. They all deserve to be able to spend time with their love ones especially when they are here everyday to save many lives without complaining ever.", "pics": null, "resp": {"time": 1575066288635, "text": "Thank you for letting us know about the good job our Staff is doing. We appreciate donors like you! Thanks for helping to save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104647202267152997165", "name": "Erin McClendon", "time": 1578406202739, "rating": 4.0, "text": "I have a pretty good experience most  of the time I’m here. It’s been a little slow for lack of employees, but overall this place is ok. The employees here are more friendly than when I first came! Thank you Mrs. Lopez!!", "pics": null, "resp": {"time": 1578494072921, "text": "Patients appreciate your commitment! Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108973194719880113994", "name": "Lauren Mcneill [Student]", "time": 1580999745396, "rating": 4.0, "text": "Overall it's a busy place but the employees are organized to get people through. I average about two hours each visit and I come on Tuesday and Thursday mornings. I think with a few more employees it would run smoother. Bria and Cyntina are my top two favorites. Both ladies work hard and fast and most importantly they are professional.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115967473403427990280", "name": "Molly Williams", "time": 1581028082438, "rating": 4.0, "text": "Facility's clean. Staff is pleasant. Wait times vary and depend on the time of day.  Sometimes I'm there for an hour, others I'm there for 3. Occasionally there's a slow staff member that contributes to wait time. I do wish they had a children's area so I could still come donate during the day when my kids are off school. I would still recommend this center.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "113604669909360894786", "name": "Mann on Fire", "time": 1581186006045, "rating": 5.0, "text": "This place is usually really good at customer management.  During tax season,  typically you can be in and out within 2 hours.  When it's getting towards the summer, you'll spend about 3 hours here.  I've been coming here for about 3.5 years now. Every month they have new donor fee specials as well.", "pics": null, "resp": {"time": 1581693374791, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104891670166063264070", "name": "Plain janeee", "time": 1581001736254, "rating": 5.0, "text": "Great people ..fast service.Very clean facility.\nSmiling faces like Cyntina and Jennifer always make me feel welcomed.\nThey always have games an other ways to win Extras..", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100987114107569105538", "name": "D' amber Coleman", "time": 1581193781447, "rating": 5.0, "text": "I love this place especially Mrs. Lopez from France and Mrs.Tay. I've been coming here since 2012 and I've found more things out with them than the people that's been here for years. Teaching me about donating and the way I move my arm etc. Thanks ladies ❤️😊", "pics": null, "resp": {"time": 1581694005467, "text": "We love our donors! Thanks for being awesome!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107890372107766087900", "name": "Matt Butts", "time": 1581000030965, "rating": 5.0, "text": "The staff here is very friendly. Everyone makes me feel comfortable. After coming here for a month and seeing the smiling faces make each trip easier.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111978096853588969308", "name": "Lakisha Pennington", "time": 1581081688862, "rating": 5.0, "text": "I really enjoy the experience and people that work here. Everyone is nice and it’s a pleasure to have found a place that feels like home.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103081669648698097642", "name": "Paul Henson", "time": 1581113400495, "rating": 5.0, "text": "Best donation center in town. Very professional staff and management. Appreciate Ms. Lopez for her hard work and dedication to her job.", "pics": null, "resp": {"time": 1581691982692, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116648609057940814313", "name": "Ta Juan Kennedy", "time": 1581092573529, "rating": 5.0, "text": "I absolutely love Benneh Lopez. She is amazing!! She is the best phlebotomist in the center. She is so pleasant and she always manages to keep a smile on her face.", "pics": null, "resp": {"time": 1581690847860, "text": "We love our donors! Thanks for being awesome!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107899071511513344752", "name": "Wayne Clothier", "time": 1581259952451, "rating": 5.0, "text": "What a great place they treat you like a VIP.. I am a VIP and they treat me even better. Always great service when you are VIP. Just remember and let them know that Wayne Clouthier is a VIP!!!!!", "pics": null, "resp": {"time": 1581547352067, "text": "Thank you so much for sharing this wonderful feedback.  We take pride in our plasma donor community! Your plasma donations are very important to patients all over the world. Thanks for your commitment, Wayne!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106298512448796139232", "name": "Glass Roads", "time": 1564603473428, "rating": 1.0, "text": "Where do I begin?  Well, as I sit here I’ve watched 6 or 7 people be called that walked in after me.  I then respectfully go to the desk and let it be known....  it’s been over an hour now.  I’m also listening to people walk around, cursing at each other (not employees), regardless.... That type of language is not for this place I would suspect...  Such a wonderful thing for people to be destroyed of a good experience by people who are rude, inconsiderate, and disrespectful.  God forbid if I stand up....Lol.  Either way... Changes need to be made at this establishment to be able to enjoy giving to others in such a way.  In regards to owners response, I do appreciate The information in order to contact corporate, however I do believe that is the responsibility of the manager to do so.  I’m simply a person donating to your establishment, but thank you very much.", "pics": null, "resp": {"time": 1564196818794, "text": "We apologize for the wait time. Your feedback is important and will help us improve every donor's experience. If you would like to provide additional feedback or have any questions, please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116511138489858234529", "name": "Levoyd Thomas", "time": 1581165763788, "rating": 5.0, "text": "The plasma center has been good to me it’s fast easy with no problems they get u in and out in a pretty good time plus it saves life if u haven’t came up here u need to quick fast in a hurry", "pics": null, "resp": {"time": 1581691949647, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103473074069434230412", "name": "James Smith", "time": 1581093771883, "rating": 5.0, "text": "Always a pleasant visit. Nicest staff you will ever meet and Always there when you need then with a smile", "pics": null, "resp": {"time": 1581690826603, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "110707090066112227602", "name": "Martika Glass", "time": 1581109369387, "rating": 5.0, "text": "The staff is very friendly and kind to all of their donors. I would recommend anyone who is able to donate do. The friendly faces of Eric, Cornelius, both Ashley's", "pics": null, "resp": {"time": 1581692005747, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108750608393784075918", "name": "Lexus Edmonds", "time": 1581467304804, "rating": 5.0, "text": "Really don’t have to wait long . Donate less than 2 hrs top. Love it . Free money. Thanks.. Good during hard times ..", "pics": null, "resp": {"time": 1581694019647, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "114848273689856657512", "name": "Amanda Holder", "time": 1581091702476, "rating": 5.0, "text": "Everytime I've been to this location I've been treated with kindness and fast paced service. Ms. Lopez is a very patient and kind phlebotomist! My favorite!", "pics": null, "resp": {"time": 1581690873357, "text": "Thank you for sharing your feedback. We take pride in our plasma donor community!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111687802860079094168", "name": "Desaray Darovitz", "time": 1581022130301, "rating": 5.0, "text": "Wonderful experience! Wonderful kind and patient staff! Saving lives one donor at a time thank u Talecris!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "110008426925336348028", "name": "Rhonda Booth", "time": 1580997745450, "rating": 5.0, "text": "Very nice staff! Most of them are always in a good mood so that donating a lot easier", "pics": null, "resp": {"time": 1581114529533, "text": "We appreciate your feedback. Thanks for being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "117398333156187660167", "name": "Chris Moore", "time": 1623512223927, "rating": 5.0, "text": "They’ll rather give new donors a 1000 bucks a months but the loyal returning donors still donate for small change basically !!! I would think they would want to show us returning donors some appreciation by now !!!!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115905746307453568098", "name": "Spencer Patty", "time": 1581110358990, "rating": 5.0, "text": "It's easy and fast to get started.  Staffs helpful and courteous and very efficient.", "pics": null, "resp": {"time": 1581691993409, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108306494613116038380", "name": "Sockswflipflops 91", "time": 1574788307334, "rating": 5.0, "text": "Great staff very friendly and professional. I'm normally in and out within an hour. I feel comfortable with the staff and what they do. Glad I'm apart of this experience.", "pics": null, "resp": {"time": 1575067675804, "text": "Thank you for letting us know about the good job the staff is doing. We appreciate donors like you! Thanks for helping to save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100054698070901640829", "name": "Latisha Binn", "time": 1581181822233, "rating": 5.0, "text": "I love it here Ms.Lopez is an amazing person the staff is amazing  y’all come see her you won’t be disappointed thank you again Ms.Lopez😘😘", "pics": null, "resp": {"time": 1581692751096, "text": "We value your feedback. Thanks for helping save lives and being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105169118090185855879", "name": "Donnie Payne", "time": 1581167908494, "rating": 5.0, "text": "Phenix City Alabama plasma center has been one of the greatest experience that I ever have been with they are good I gave them five stars", "pics": null, "resp": {"time": 1581692278781, "text": "Thank you for sharing your feedback. We take pride in our plasma donor community!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105619315537814304324", "name": "Lotto Majesty", "time": 1581183266813, "rating": 5.0, "text": "Excellent service professional staff. I recommend Ms Lopez very friendly and knowledgeable of her craft.", "pics": null, "resp": {"time": 1581692766831, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107559675232351129033", "name": "Abdul Holt", "time": 1581013269866, "rating": 4.0, "text": "The most best professional plasma center I’ve been in. The nurse very professional quickly to assist you", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "118427741584671928770", "name": "Karen Romero", "time": 1581090780980, "rating": 5.0, "text": "The staff are very profesional and friendly. They definitely take pride in what they do.", "pics": null, "resp": {"time": 1581690461256, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103971070629710191668", "name": "Autumn Dudenski", "time": 1581188930218, "rating": 5.0, "text": "The staff is extremely good does good work love coming here treat you just like family", "pics": null, "resp": {"time": 1581689531925, "text": "We appreciate loyal donors like you. Thanks for your feedback!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "114623426138154494491", "name": "daniel11b25", "time": 1581186325251, "rating": 5.0, "text": "Great service and the people there take care of you. Busy busy place during the week. Service to the max when you there and doing a donation.", "pics": null, "resp": {"time": 1581693394242, "text": "We appreciate your feedback. Thanks for being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115891919759438018407", "name": "Mallory Thomas", "time": 1581083152892, "rating": 5.0, "text": "They Are Nice , Sweet & Very Respectful . Love It Here . Another Family Away From Home .", "pics": null, "resp": {"time": 1581690392919, "text": "We appreciate your feedback. Thanks for being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106867013503679484873", "name": "Renay Martin", "time": 1581081247962, "rating": 5.0, "text": "Awesome staff members.....Ms. Lopez is an awesome comforter for those afraid of needles! Best location in town . I would highly recommend anyone !!!! Visit visit visit !!!", "pics": null, "resp": {"time": 1581689555040, "text": "Thanks Renay for being awesome and helping save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105825500926068350528", "name": "Joshua Jones", "time": 1581191373502, "rating": 5.0, "text": "Great friendly staff very professional . I get off work come here and out pretty fast most days.", "pics": null, "resp": {"time": 1581693986604, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103200147688005542230", "name": "Deshon Tate", "time": 1581980200056, "rating": 5.0, "text": "Calm and cool environment, friendly people, smooth process....and better then Columbus talecris 🤐", "pics": null, "resp": {"time": 1582217257504, "text": "We appreciate loyal donors like you. Thanks for your feedback!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100087651185181159375", "name": "Lenard Allen", "time": 1581102456923, "rating": 5.0, "text": "I've been coming here for many years now and have no problems with the staff or donations", "pics": null, "resp": {"time": 1581691311725, "text": "Patients appreciate your commitment, and we do too! Thanks for donating plasma."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106779376667602337002", "name": "honest jokers81", "time": 1602566763298, "rating": 1.0, "text": "No comment I have a good reason why I'm not explaining anything to anyone I have nothing to say  to anyone god  bless you", "pics": null, "resp": {"time": 1602634045844, "text": "Thank you for your feedback. We apologize that your experience was less than satisfactory and we'd like to hear more. Please call us at 1-855-697-5276 to speak with a representative."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "113940311168283141221", "name": "itxan montalvo", "time": 1581103976284, "rating": 5.0, "text": "Awesome place to make plasma donation and good ambient!! I recommended 💯", "pics": null, "resp": {"time": 1581691323128, "text": "We appreciate your loyalty. Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116577781390493357936", "name": "Brittany Porter", "time": 1577989038649, "rating": 5.0, "text": "I always have a pleasant experince when I donate. The staff and management are all very friendly and caring!", "pics": null, "resp": {"time": 1578232771469, "text": "Thank you for being awesome and helping save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103595258717940316033", "name": "Joe Webb", "time": 1581167325422, "rating": 5.0, "text": "Great location, professional staff. Awesome Management. Good experience.", "pics": null, "resp": {"time": 1581692333687, "text": "Thank you for being awesome and helping save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112879433076001284672", "name": "Kaylei Cantrell", "time": 1581081701287, "rating": 5.0, "text": "The employees are always polite and very professional. The time is always fast and Miss Lopez was very professional and helpful.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115021855471521561826", "name": "Kaila Green", "time": 1581174924058, "rating": 5.0, "text": "Come here all the timeee always pleased to see the team and them say hey Kaila lol also I’m so proud of the growth of Jaime i remember her doing my screenings now she sticking folks yaaay Jaime !!!", "pics": null, "resp": {"time": 1581692526280, "text": "Patients are grateful for your commitment to donating plasma. Thank you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107112200237421339176", "name": "Rodney Kimbrough", "time": 1581531930555, "rating": 5.0, "text": "To whom it may concern,i just wanna say that Grifols plasma center in phenix city Ala are the best ever the staff was great my first time donating was 02/12/20 but Benneh Lopez was amazing she kept checking on me to make sure I was doing OK the whole time I was there and truthfully I really think Benneh deserves a Raise !", "pics": null, "resp": {"time": 1581694040066, "text": "Thank you for letting us know about the good job Benneh is doing. We appreciate donors like you! Thanks for helping to save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100475024236628880632", "name": "Naida Nieves", "time": 1580996068185, "rating": 5.0, "text": "They are some good workers i love ashley santiago she ao sweet always talking and smiling🗣🖤", "pics": null, "resp": {"time": 1581689665305, "text": "We appreciate your loyalty. Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116872623606434001506", "name": "Stephon Goshay", "time": 1581192058642, "rating": 5.0, "text": "I love the plasma center it’s good in good people work there thank u 🙏", "pics": null, "resp": {"time": 1581693996676, "text": "We value your feedback. Thanks for helping save lives and being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100104179531762334439", "name": "Blake Thompson", "time": 1578405856869, "rating": 5.0, "text": "Fast paced, got in the back very fast everybody was very nice and Ms. Lopez was on point like she always is", "pics": null, "resp": {"time": 1578494041038, "text": "Thank you for your feedback. Patients count on you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111815763122707908250", "name": "Ginger Campbell", "time": 1581099865204, "rating": 5.0, "text": "The staff is always so friendly and take such good care of me!!😁", "pics": null, "resp": {"time": 1581691093926, "text": "We appreciate loyal donors like you. Thanks for your feedback!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107929820808393487859", "name": "Big Girl Talk", "time": 1581094518178, "rating": 5.0, "text": "I love talecris they help out a lot with gas when you donate plasma not only that they always have some type of bonus to get you more money the staff is awesome and and very fast", "pics": null, "resp": {"time": 1581689616754, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "113637678322994701332", "name": "roy gbiv", "time": 1581107931023, "rating": 5.0, "text": "They havent missed my vein and offer adequate compensation. Clean and friendly place", "pics": null, "resp": {"time": 1581691344639, "text": "It's not often you get to do something that helps other people while earning a little extra income. Thank you for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101202769626628803614", "name": "Brent Hauge", "time": 1581005042388, "rating": 5.0, "text": "Get place to earn money, friendly staff and fast service!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111826647552024857835", "name": "Joseph Harris", "time": 1581084641697, "rating": 5.0, "text": "Great Customer Service and Hospitality Favorite phlebotomists Ms. Lopez would recommend", "pics": null, "resp": {"time": 1581690422626, "text": "Thank you for sharing your feedback. We take pride in our plasma donor community!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101915738171424372454", "name": "NoTime For It Crawford", "time": 1581029256580, "rating": 4.0, "text": "Helping others while getting help family friendly people working together", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116360559126704812168", "name": "Taylor Johnson", "time": 1540050093993, "rating": 5.0, "text": "This plasma lab has really changed in recent months for the better. My pay gets better the more times I donate every month, and I am getting in and out quick. They got some good people working here now.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116617913063216744893", "name": "ashley smith", "time": 1581001767837, "rating": 5.0, "text": "Great people always have great service here! Very Friendly workers!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116557617932462513834", "name": "Brian Matthews (TroupWeather)", "time": 1569544208407, "rating": 5.0, "text": "Very fast and professional staff. The boss man stays late and helps out until everything is done and he thanks his donors and employees. Very good experience donating here. Columbus is a JOKE! PHENIX City is where it's at", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103406476416731102173", "name": "Tamara Hughes", "time": 1581083927018, "rating": 5.0, "text": "Ms. Lopez and staff are very professional. Great location and great service.", "pics": null, "resp": {"time": 1581690401593, "text": "Thank you for your feedback. Patients count on you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "109558654927867932616", "name": "Michael Krug", "time": 1581015819831, "rating": 5.0, "text": "Kind, professional, thorough in explaining process, appear concerned about my well being.\nSeem to work well as a team.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104818235875935467222", "name": "Will Caro", "time": 1581187798476, "rating": 5.0, "text": "The Phenix City Talecris location has friendly and professional staff.\nJust make sure you are properly hydrated, and you'll be in and out in no time.", "pics": null, "resp": {"time": 1581693413795, "text": "We appreciate loyal donors like you. Thanks for your feedback!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105276608769221625101", "name": "Jasmine Brooks", "time": 1581013940795, "rating": 5.0, "text": "They are amazing here, friendly and sweet. There is no other place I'd rather be but here", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101659385765628740871", "name": "Courtney Powell", "time": 1581189397985, "rating": 5.0, "text": "Quick way to help others while also helping yourself.", "pics": null, "resp": {"time": 1581693505516, "text": "It's not often you get to do something that helps other people while earning a little extra income. Thank you for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "110717389923116466461", "name": "Elycia Timpone", "time": 1581609656432, "rating": 5.0, "text": "Everyone here has been so nice and welcoming.", "pics": null, "resp": {"time": 1581694050538, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "102052554383389483640", "name": "Alexandria Smith", "time": 1544973657133, "rating": 5.0, "text": "They did a appreciation lunch for us the other day that was really nice. We got drinks and Nachos and a cool hand sanitizer for your keys. I usually come in the morning time and am able to get in and out quickly.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "110065085123879088020", "name": "Life With J. White", "time": 1553650850454, "rating": 1.0, "text": "Don’t come here the management is awful and corporate won’t get back with you on complaints. The management make jokes about people donating and other things happen here as well. Nothing can be done about it because corporate will not contact u back", "pics": null, "resp": {"time": 1554173797383, "text": "We appreciate your willingness to donate and help save a life, Jeremy. We apologize for the miscommunication and inconvenience. Your feedback is important and will help us improve every donor's experience. Please consider sending us a message via the \"contact us\" page on www.grifolsplasma.com and leave your contact information, so that a member of the center's leadership team is able to reach you directly to better understand your concern and resolve this issue."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107049368268227999361", "name": "Pug Wendlandt (Bailey)", "time": 1581034104611, "rating": 5.0, "text": "I enjoy coming here the staff is very friendly and helpful. I've been coming for years.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100595755503098276971", "name": "Cyane Joseph", "time": 1580996400116, "rating": 5.0, "text": "Love it here, pleasant experience every time I come!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103019120745968098653", "name": "Dexter Calhoun", "time": 1581092534871, "rating": 5.0, "text": "Quetta is a great worker. Very delightful!!", "pics": null, "resp": {"time": 1581690862577, "text": "Thank you for letting us know about the good job Quetta is doing. We appreciate donors like you! Thanks for helping to save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112008159788953128144", "name": "Elizabeth Thomas", "time": 1609255145280, "rating": 1.0, "text": "Today is very bad, have a lot of techs on the floor but no one is getting called to a chair.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111051344668818852620", "name": "Jamie Henderson", "time": 1539275847626, "rating": 5.0, "text": "I have come to this location a few times over the last few years, and lately it is much better! The workers are much friendlier and more helpful. The wait time is much shorter than it used to be. It also looks like managers are helping the workers more than in the past.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115829518606657212467", "name": "Victor Moore", "time": 1581167545600, "rating": 5.0, "text": "Friendly staff They get you in-and-out quick", "pics": null, "resp": {"time": 1581692287308, "text": "Thanks for doing your part to help save lives! Patients appreciate your commitment."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100881836359458570396", "name": "Madness 119", "time": 1540400070046, "rating": 5.0, "text": "Ive been going here for almost 5 years. The staff is great. Denise Fitzpatrick is a top notch tech. All of Talecris techs are top notch. Thanks guys here's to another 5 years !!!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106854746463070846194", "name": "casey burns", "time": 1581185007207, "rating": 5.0, "text": "Great place to go, very customer friendly, staff is amazing! #donate", "pics": null, "resp": {"time": 1581692797469, "text": "Patients count on you! Thanks Casey for being awesome!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "109349115329921911117", "name": "Bart Ro", "time": 1581091067494, "rating": 5.0, "text": "Very friendly staff especially for Newcomers. Highly recommended.", "pics": null, "resp": {"time": 1581690895967, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "113749753837457276878", "name": "Jonathan Lockerman", "time": 1581095479053, "rating": 5.0, "text": "Awesome staff, Professional and welcoming. Ask for MS. Lopez, when you go.", "pics": null, "resp": {"time": 1581691106380, "text": "Thank you for being awesome and helping save a life!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116203095141655890978", "name": "Steven, Dennis", "time": 1601396142423, "rating": 2.0, "text": "Here we go with the waiting on doctor to review blood sample I've Ben told 4 different dates from 4 different people saying when my blood sample would be review when doctor was thair and the doctor has Ben thair 2 of them dates but didn't review my blood sample sure it's not her fault but y'all could hire another one to help out this is silly every year this happens to me and they send a number for you to call like it's are job to call and report stuff I wouldn't write bad reviews no more if y'all fix the wait time on reviews on blood samples that's the only problem I have with this center its Ben over a month still can't donate", "pics": null, "resp": {"time": 1569531421413, "text": "Hi Steven, Dennis, your feedback is important and will help us improve every donor's experience. We're sorry to hear about the delay in reviewing your blood sample results and we'd like to learn more.  Please call us at 1-855-697-5276 to speak with a representative and a member of the center leadership team will reach out to you directly. Thanks for your willingness to donate plasma and help save lives."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103753306352788951563", "name": "Antrell Bradley", "time": 1581100780828, "rating": 5.0, "text": "Excellent service, great clean-facility.", "pics": null, "resp": {"time": 1581691054585, "text": "Thank you for donating and your feedback. We are dedicated to making sure our plasma donor centers are clean and a healthy environment for all our donors."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101122009613278590014", "name": "Nycreddog", "time": 1533673025735, "rating": 4.0, "text": "Okay these reviews are over a year old it has changed dramatically the employees are all professional they respect you and make sure your okay and treat you the way you supposed to be treated I come here and I've never had a problem with anybody who works there .. they make you comfortable and take care of you while you're there I recommend this place for anybody who needs extra cash and at the same time saving lives.. after all those people giving those bad reviews they still come here all the time ...keep up the good work Talecris", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116892009710739805930", "name": "Andrea Robinson", "time": 1581179135634, "rating": 5.0, "text": "FrIendly people and great staff they get you in and out !!!!", "pics": null, "resp": {"time": 1581692547305, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111637285916333128830", "name": "michael williams", "time": 1581170295891, "rating": 5.0, "text": "Great staff and very professional... I’m always in and out...", "pics": null, "resp": {"time": 1581692242646, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101855559208538249056", "name": "Letitia Wallace", "time": 1581100991539, "rating": 5.0, "text": "Great place and good people . They are the best.", "pics": null, "resp": {"time": 1581691045659, "text": "We appreciate your loyalty. Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116464712333950364661", "name": "Taylor Hayes", "time": 1558952284467, "rating": 5.0, "text": "It's a great way to help others and earn cash @ the same time!", "pics": null, "resp": {"time": 1559360371683, "text": "Helping patients to live improved lives and earning a little extra income is a definite win-win. Thanks for donating Taylor Hayes!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103256785355622896792", "name": "Jane Doe", "time": 1456522304328, "rating": 3.0, "text": "It's okay. But the people who work there need to learn to be more professional. I swear I come in to help donate plasma; not to hear about your sex life and what kind of positions you like sexually. Some NOT all,  can be heard bitching about the donors or job in general.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116169078758062355245", "name": "Anthony Murray", "time": 1581034596349, "rating": 4.0, "text": "The employees are usually very nice.\nI can't complain.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100585709539649793926", "name": "Daysha Williams", "time": 1581090102734, "rating": 5.0, "text": "Staff Very Polite & Always smiling and Fast", "pics": null, "resp": {"time": 1581690454437, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116704515422043146752", "name": "Janelle Briscoe", "time": 1544038640472, "rating": 1.0, "text": "The majority of employees are unprofessional and rude. SO slow, literally heard an employee say, \"maybe if we take our time donors will start walking out.\" Maybe, just maybe if the employees weren't so consumed in talking negatively about other employees and what somebody else is doing they could put their focus on their own work and the process would speed up.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "117708199938536787717", "name": "M C", "time": 1534935581261, "rating": 5.0, "text": "The staff was professional and friendly. It was my first time and they answered all my questions. Everything was clean and organized. I am definitely going back.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "113464612854498429067", "name": "Angel Robinson", "time": 1581180460099, "rating": 5.0, "text": "I love to help save lives!", "pics": null, "resp": {"time": 1581692565688, "text": "Isn't it wonderful to know that you are helping to improve someone's life? Thanks for donating plasma!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116466106082199724436", "name": "Soulja T", "time": 1581092833021, "rating": 5.0, "text": "Good people very professional and great vibes", "pics": null, "resp": {"time": 1581690840166, "text": "We appreciate your feedback. Thanks for being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112211929324599656246", "name": "Lakisha Hunter", "time": 1581166369445, "rating": 5.0, "text": "They do a great job and very respectful", "pics": null, "resp": {"time": 1581691942356, "text": "We appreciate loyal donors like you. Thanks for your feedback!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103291045804633594607", "name": "Nicholas Mitchell", "time": 1563309052211, "rating": 5.0, "text": "This is the best job ever I recommend working here", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103514566153550636559", "name": "Brandi Mcghee", "time": 1581194016602, "rating": 5.0, "text": "A great place staff is wonderful 💯💯", "pics": null, "resp": {"time": 1581694013696, "text": "Thank you for sharing your feedback. We take pride in our plasma donor community!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115160062889020895072", "name": "Yaya Licious", "time": 1539352147337, "rating": 1.0, "text": "Lmmfao!! So i asked the employees if they check up on these reviews? They said and i quote \" oh we don't care about it we don't even check it \" ........... They take entirely way too long to tend to people. They stand in a huddle and sounds like they gossip. They play too much amongst themselves. People don't have all day like they do just to donate. We have lives and jobs too. I just wish they would do their job like it should be done. Be more professional about your profession. Stop laligaging please and smile. Not only do you drain my blood but you also drain my spirits with those long faces and attitudes. Not a very friendly environment. Don't take it personal. I know people tend to take things personal now a days. Opinions can be deadly in 2018. Constructive criticism:)\nGreat day. Also don't forget to smile. Grumpy faces are kinda ugly.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "115704242521217108896", "name": "nobody frfr", "time": 1550281435352, "rating": 1.0, "text": "WORSE PLASMA DONOR EVER ! Highly unprofessional and undeducated . I’d like to know who’s responsible for keeping it open til this day . They have rude employees who are over weight, built like a house and four eyed and tells your business which is supposed to be “CONFIDENTIAL” by the way. Takes forever to donate because their too busy gossiping about each other. If I had to choose between impeaching trump and closing this place down , I’d choose closing this place DOWWWWNN", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105635380504928839027", "name": "Dave Jackson", "time": 1540142934977, "rating": 5.0, "text": "Quick and painless. My sticker was friendly and made me feel important.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112586007185998092471", "name": "Marquis Washington", "time": 1545855711768, "rating": 1.0, "text": "they are slow here, you spend about 4 or more hours here, the staff does a lot of talking joking and playing when they should be getting people in and out. I have watched workers leave people on the beds 20 mins after donating because they were too busy taking to remove the needle from their arm. I've been donating over 10 yrs and this is the worst and slowest center I have ever been to...", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101355724844330465330", "name": "Kristina Allen", "time": 1543249479872, "rating": 2.0, "text": "There is no way (I've donated at other places and never experienced this) that it should take 2- 3 hours nearly every time (tried on varying days at varying times) to donate!!! They pay well and have bonuses and jackpots to get more money. But seriously sloths on ambian move faster and have more energy than these people!! They are friendly sometimes and to some people and overall are professional but they have got to work on the wait time. When over half the beds are empty and the waiting room is full something is wrong..seri seriowrong. Hire more people!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "117693540168495513706", "name": "Ree Jones", "time": 1581026830342, "rating": 5.0, "text": "Great place, great people, and great service.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "102129911460183149653", "name": "April Minster", "time": 1581108804104, "rating": 5.0, "text": "There very nice people an quick", "pics": null, "resp": {"time": 1581691351694, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116090666186862871885", "name": "Angie b Wendlandt", "time": 1462039123962, "rating": 5.0, "text": "I feel good about donating and I feel the staff is great, they are pleasant, fast they get you in and out in the am don't know about pm.  They all have to deal with the public and sometimes that's difficult but they are always smiling and friendly they get the job done.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "117213350564411780355", "name": "Michael Johnson", "time": 1532090539187, "rating": 3.0, "text": "Every thing is good til the saline return and equipment takes a dump so I'm sitting forever waiting", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112481340696869054413", "name": "Madeline Butler", "time": 1539121686432, "rating": 5.0, "text": "This place is awesome! Very personable and professional.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "103994803475893180581", "name": "Brenda Watts", "time": 1486761164056, "rating": 1.0, "text": "Went in with a friend because she needed the extra money and didn't want to go alone. Staff is VERY unprofessional and the wait takes forever. This should not be an all day event. It takes hours just to be called to answer questions on screens. Then you still have to wait for them to check your blood pressure before you wait in the line to be on the beds in the back to have plasma drawn.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105093197295222152464", "name": "gina Howard", "time": 1539268004591, "rating": 5.0, "text": "Love the staff, they make the experience so much better.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108983007672612945355", "name": "Alison Austin", "time": 1509285711246, "rating": 1.0, "text": "This center started out ok but they have some serious management AND customer service issues. I arrived today at 6:55 am and there was already a small crowd as they only had two people working. Dawn setting up beds and Cornelius sticking. Many people in the lobby complained about Cornelius sticking them - and Dawn two blew out my vein(with his assistance) less than a month ago and I agree they are not the best phlebotomists. After two hours, a guy who came in after a large group of us, complained that he had something to do and was taken right to the back... so I complained to dawn that I have things going on today and also would like to go back. She said that she took him to the back because she wasn’t going to lose any donors? I told her everyone saw what happened and in the future would try the same thing. She asked my name and told me if I tried to do that, she’d remember and know I was just trying to skip line. well, she lost me and my husband. There is a waiting list for a reason. Her rude attitude like she is the boss of something has gone to her head. Most of the staff members have the same attitudes. Very few actual “good” employees at this location. Will not be back.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "118362275449595171083", "name": "Kingston Smith", "time": 1581027889026, "rating": 4.0, "text": "I was nervous about this but it's worth doing it", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "102178232635958139891", "name": "Dee Jay", "time": 1581186761845, "rating": 5.0, "text": "Great fast an excellent service", "pics": null, "resp": {"time": 1581693379547, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111316649245380012843", "name": "Just Ice", "time": 1581094776702, "rating": 5.0, "text": "Great place and great staff", "pics": null, "resp": {"time": 1581691113039, "text": "We appreciate your loyalty. Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101982682028378937837", "name": "Joseph Register", "time": 1476830810485, "rating": 1.0, "text": "Terrible customer service. Not enough people working. They allow people waiting to drink alcohol. A few of the females think they are better than anybody else.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "114887453710419543034", "name": "Nick Jenkins", "time": 1581082319843, "rating": 5.0, "text": "Ms.Lopez is so nice and  professional", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100283008354011919737", "name": "James Dotson", "time": 1581029915550, "rating": 5.0, "text": "Great place and friendly people", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112561997374228105559", "name": "Corey Jacky", "time": 1451658317793, "rating": 1.0, "text": "Some of them are fine looking if you catch them out of their work uniform. But looks can be deceiving they have some nasty attitudes and sometimes you can over hear them talking about donors.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "109409908435289740901", "name": "Andrea Jenkins", "time": 1581180530231, "rating": 5.0, "text": "Great staff, clean , fast , friendly .", "pics": null, "resp": {"time": 1581692741807, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "101518125445996448765", "name": "Sandra Fontana", "time": 1476648822067, "rating": 2.0, "text": "Very unprofessional and won't work with you at all. Had me running around back and forth for no reason. Told me I only needed a certain document but still wouldn't accept anything I tried to offer. My bill was over 30 days and still nothing. Been there since 12:30 p.m. today and they had me going everywhere til almost closing time. Wasted all my gas and and worst staff I've seen in years. Won't be going back.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106595987500947382951", "name": "Latonia Harris", "time": 1581085192751, "rating": 5.0, "text": "Great location and staff members", "pics": null, "resp": {"time": 1581690434406, "text": "We value your feedback. Thanks for helping save lives and being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105315243689853996075", "name": "Kelvin Stephens (Kel-Nardo)", "time": 1371713369379, "rating": 4.0, "text": "Donating plasma is something I'm glad I got put on. It's like they're paying you to clean your blood. But you get a good laugh each visit you make and if you go tell them I sent you.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100677319463972759335", "name": "Ashley Smith", "time": 1519180832831, "rating": 1.0, "text": "This place is terrible!!! The employess are super ghetto. There is no type of professionalism at all.I had an issue a week ago and was made to leave and because the other person was known more by the facility they were able to stay without reprecutions.The \"manager\" was very ignorant and disrespectful..  shes the light skinned girl who use to be really big. Now everytime I come in she HAS to make sure i see her irrelvant ass. Plus they treat you like your needy. Some of the employees are very nice", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106208516005590633206", "name": "MEYOSHIA JOHNSON", "time": 1484410545614, "rating": 1.0, "text": "This is the worst place i have ever seen. Im not sure how they still operating this piece of crap. Very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116962787077661361266", "name": "Pattie Turner", "time": 1581033612398, "rating": 5.0, "text": "They are so sweet to me", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "109742291987481719974", "name": "Veteran Charger", "time": 1555432729513, "rating": 1.0, "text": "Worst plasma center ever horrible place. DO NOT GO", "pics": null, "resp": {"time": 1555555704300, "text": "Hello, thank you for your feedback. We apologize that your experience was less than satisfactory and we'd like to hear more. Please call us at 1-855-697-5276 to speak with a representative."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116104075375864097012", "name": "Chance Terrell", "time": 1481856723052, "rating": 1.0, "text": "I am a loyal donor for to Talacris plasma center in Phenix City, Al. I am employed and i often have to work til 6pm and it is tough to make it to the center before 6:30. Well Today i made it at exactly 6:30 and the doors were already locked so i walked around to the side door that the donors exit from and tried to speak with one of the managers i had spoken with before in the exact circumstances and he allowed me to donate..... Well in this case today, which is December 15th, i spoke with another gentlman named ELI  and he denied me permission to donate as well as said he was deferring me for my actions. I explained to him  i have a daughter who is 5 years old and i need the $ from my donation for her Christmas i have on layaway. He kept asking my name so he could defer me. I apologized for the way i walked in through the back exit door and explained  That i was just in very much in need of the $. When it comes to my lil girl i do not give up and i will do anything and everything for her. I was never rude but i did not give him my name. I showed him i had $80 in my wallet and let him know i was not one of the drug addicts and desperate for money for dope, but that i was a working father who is doing what he can and would love to see his dauggter happy and excited on Christmas. Though Eli never quit or even thought about changing his mind after i explained what that little but of change they give us for donating meant alot to me. And i apologized sincerely numerous of times. Well as i walked out he said to me. You cant donate today and ill see u again and when i do u will b deferred. It furiated me to the point i dont like. He purposely and willingly stood between me and my lil girls happiness. I find that Eli (the manager) is very unprofessional and is fully taking advantage of his authority. I am wanting the corporate or head offices number. I want to speak with the men or women that is/are Eli's Boss. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105135779500456523104", "name": "Daniel Dauzat", "time": 1576687480241, "rating": 1.0, "text": "Horribly slow I've been here over a hour and haven't even been screened to go to the second waiting area staff is very rude gets all mad if you ask anything", "pics": null, "resp": {"time": 1576882242515, "text": "Thank you, Daniel, for bringing this to our attention. We apologize for your experience while you were in our center. Your feedback is very important to us. We are dedicated to making sure our center team members are respectful to every plasma donor. If you would like to provide additional feedback or have any questions, please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "118222739960671481990", "name": "skyla duke", "time": 1581099927869, "rating": 5.0, "text": "Mrs . Lopez is great !!!", "pics": null, "resp": {"time": 1581691082271, "text": "Thank you for your feedback. Patients count on you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104581858546440244064", "name": "Anteanna Hargrove", "time": 1506451813999, "rating": 2.0, "text": "They are very unprofessional towards donors and change hours without notice and the money is bullcrap for your plasma", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108403046988027549680", "name": "London King", "time": 1581027041711, "rating": 5.0, "text": "Great Staff.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "111576568717911272815", "name": "Brittany Burns", "time": 1581184957236, "rating": 5.0, "text": "Friendly atmosphere.", "pics": null, "resp": {"time": 1581692777074, "text": "We appreciate your feedback. Thanks for being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107780847282974669635", "name": "Maria Hoyne", "time": 1482255880982, "rating": 1.0, "text": "4th time here always the same wait forever and if they know you ,you get hooked up faster", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104669099253183165676", "name": "Wardell Ellis", "time": 1581167339187, "rating": 5.0, "text": "It has saved me a couple of times", "pics": null, "resp": {"time": 1581692300675, "text": "Thank you for taking the time to donate plasma and help save lives!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "102687719073736546915", "name": "Marie Gossien", "time": 1569334307994, "rating": 1.0, "text": "Takes forever\nThe people are very unorganized", "pics": null, "resp": {"time": 1569351789203, "text": "Hello and thank you for your willingness to help save lives, Marie Gossien! We appreciate your patience and we're sorry about the miscommunication. Your feedback is important and will help us improve every donor's experience. Please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "117759137045992656110", "name": "D S", "time": 1581185720915, "rating": 5.0, "text": "Awesome sticking", "pics": null, "resp": {"time": 1581693353725, "text": "We appreciate loyal donors like you. Thanks for your feedback!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108321238890480964830", "name": "Charlie Hall II", "time": 1581164233188, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": {"time": 1581691972594, "text": "We love our donors! Thanks for being awesome!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106854826718207017309", "name": "Rachael Wireman", "time": 1581100090878, "rating": 5.0, "text": "Amazing service", "pics": null, "resp": {"time": 1581691075857, "text": "We value your feedback. Thanks for helping save lives and being a loyal plasma donor!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108253160398338006340", "name": "Charity Fulmore", "time": 1581086284096, "rating": 5.0, "text": "Great workers", "pics": null, "resp": {"time": 1581690441592, "text": "We appreciate your loyalty. Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "102542260306290181966", "name": "Monkey King3", "time": 1581169426029, "rating": 5.0, "text": "Yay!", "pics": null, "resp": {"time": 1581692256960, "text": "Thank you for your feedback. Patients count on you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107737192644202795303", "name": "Robert May", "time": 1581092623097, "rating": 4.0, "text": "Clean and friendly", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "114702988334626421183", "name": "Beth Gaskin", "time": 1581383467801, "rating": 5.0, "text": "Giving plasma to help others!", "pics": null, "resp": {"time": 1581637478300, "text": "Patients appreciate your commitment, and we do too! Thanks for donating plasma, Beth!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "108900515029504609066", "name": "Debra Culpepper", "time": 1581171342430, "rating": 5.0, "text": "Very friendly staff", "pics": null, "resp": {"time": 1581692236777, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105406617720021400673", "name": "Jay Brown", "time": 1536344676288, "rating": 1.0, "text": "Hours later money still isn't on the card! They didn't make anyone aware of this and they aren't answering the phone at all. Absolutely selfish and downright terrible", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "110703106612791680698", "name": "Joseph Bass", "time": 1581092898122, "rating": 5.0, "text": "Great center", "pics": null, "resp": {"time": 1581690832433, "text": "We appreciate your loyalty. Thanks for donating!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "105596054229468378083", "name": "Sabrina Phillips", "time": 1544112464437, "rating": 5.0, "text": "Nice people and helpful", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "102460703785188095893", "name": "Dr. qjmasta", "time": 1526144887076, "rating": 5.0, "text": "They were really helpful", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "107021279394640297960", "name": "John Broushard", "time": 1535657235611, "rating": 1.0, "text": "I hate this place. Unprofessional, Ghetto!", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112093531687348415534", "name": "Gina DePietro", "time": 1542405381646, "rating": 5.0, "text": "Friendly and professional staff.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "104100394061788352233", "name": "Howard Romero", "time": 1581106838249, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1581691334097, "text": "Thank you so much for sharing this wonderful feedback. We appreciate donors like you!"}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112949760358980009623", "name": "Truda Zobek", "time": 1571153807017, "rating": 3.0, "text": "Long wait.", "pics": null, "resp": {"time": 1571274407612, "text": "Truda, We apologize for the wait time and appreciate your patience. Your feedback is important and will help us improve every donor's experience. If you would like to provide additional feedback or have any questions, please contact us at 1-855-697-5276 or through the \"contact us\" page on www.grifolsplasma.com."}, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "112263588240715723864", "name": "mrsnapmanjohn", "time": 1482436529872, "rating": 1.0, "text": "Am tired of having to wait between 4 to 5 hours every time I go to donate. Not enough staff and most, not all, are very rude.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "113996841748282880865", "name": "Black Bill Gates", "time": 1451660138035, "rating": 5.0, "text": "You can get paid to look at pretty faces. The donors should pay them 😂😂😂", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116274553382172284238", "name": "Nijah Wilson", "time": 1546845514281, "rating": 1.0, "text": "Need new manager asap", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "116946053657570426847", "name": "Jeff Lynch", "time": 1501781330386, "rating": 1.0, "text": "Horrible customer service. 14 phone calls and no answer.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106885216220707823626", "name": "Kendallpaige harvey", "time": 1486084515821, "rating": 1.0, "text": "The people are very rude and unprofessional. I have permanent scars where they missed veins.", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106396932395367370393", "name": "Amanda Bullock", "time": 1492866840480, "rating": 2.0, "text": "They are rude and take forever...\nThey under pay when I've been paid a lot more at another donation center...", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "106701666941728207751", "name": "Shantavia Mackey", "time": 1625710810172, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x888ccddf946dc0e9:0xbe16bc6fc7676d0c"}
{"user_id": "100360960941180720848", "name": "Peet Son", "time": 1493310939973, "rating": 5.0, "text": "I donated here twice. Friendly enviroment, beautiful nurses. Great place for those who wants to donate for the cause & not the money. Shout out Megan because she made it well worth it. So gorgeous :)", "pics": null, "resp": null, "gmap_id": "0x889a4cbacbb7af7f:0xdc45859ccffacfe"}
{"user_id": "104051569898473151494", "name": "John Bobbitt", "time": 1485271071418, "rating": 2.0, "text": "It's 9am on a Tuesday, and its already standing room only. After finding sign-in counter, took 10 minutes to for someone to tell me what I had to do. Thus far, each employee I've seen or heard looks to be pondering the easiest way to kill themselves. Only come here if you REALLY need the money, and be sure to lock your car door.", "pics": null, "resp": null, "gmap_id": "0x889a4cbacbb7af7f:0xdc45859ccffacfe"}
{"user_id": "117524296218682080271", "name": "Layla Reed", "time": 1500118372398, "rating": 4.0, "text": "Quick and easy money", "pics": null, "resp": null, "gmap_id": "0x889a4cbacbb7af7f:0xdc45859ccffacfe"}
{"user_id": "109994372488646730611", "name": "Clo Fuentes", "time": 1485003266847, "rating": 1.0, "text": "Always lie to you about how much they can give you alsways packed 5 hours then the workers always with attitude", "pics": null, "resp": null, "gmap_id": "0x889a4cbacbb7af7f:0xdc45859ccffacfe"}
{"user_id": "117963278604751245435", "name": "Herschell Brewer", "time": 1472582119462, "rating": 5.0, "text": "How much do they pay", "pics": null, "resp": null, "gmap_id": "0x889a4cbacbb7af7f:0xdc45859ccffacfe"}
{"user_id": "116934791454397705625", "name": "Anthony Jackson", "time": 1616606875068, "rating": 1.0, "text": "Short on staff, they can't walk & chew bubble gum at same time, its horrible!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "101053756198579841096", "name": "Madison", "time": 1571558370335, "rating": 1.0, "text": "This place is a joke. No one can seem to help you because they are busy talking about drama. Nonetheless I feel the staff isn’t trained because they do not like when you ask questions. Furthermore, I’d like to add the people who stick you do not have a clue of what they are doing.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNMWP9bl1d6yOMztlZWgBBu-dmq94Vuz8Lseeg4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109085003627546139117", "name": "Jamee L", "time": 1610738057189, "rating": 1.0, "text": "They give out misleading information. They tell you to refer a friend to ked plasma. So I did and my friend donated twice but because he didn’t go to the one I went to which is two miles away. I don’t get the referral bonus. They are a lie and a joke so no wonder the ratings are so low. JOKE", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "111191558323619735212", "name": "KASTOR TROY", "time": 1608142995343, "rating": 1.0, "text": "I had a 20.00 coupon to use that they sent me for not donating in last 30 days,, so I went and donated... Only to find out after donating that they would not honor the $20 coupon if I had known that I would have never gone and donated cuz I didn't need the money. So my advice to you would be to find another company to donate with this isn't the first problem I've had with them.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "107060752849984490843", "name": "Rick Ranes", "time": 1471006826037, "rating": 4.0, "text": "Doing good in the world.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0bmBbk6lSUro9HyMOpA-zuQ9iS7oKS1nPjVs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109257919423011519566", "name": "Hanifah Abdullah", "time": 1614205585908, "rating": 1.0, "text": "They move so slow and the nurses call people out of order", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109178296117778478347", "name": "Rh Hdjen", "time": 1594740000009, "rating": 1.0, "text": "No one in here knows how to stick!!! Both of my arms have been played in to find a vein and then I was told because of bruising I had to sit out weeks. What a joke go to a different one!!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "112210874733379094704", "name": "jazlyn atkins", "time": 1599077389885, "rating": 1.0, "text": "This place is so unprofessional. More gossip and talking then anything else. The nurse wait is ridiculous long considering I seen a full staff. Very deceiving, i will never return.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100765774233557559797", "name": "Markiss Michael", "time": 1511014517817, "rating": 1.0, "text": "The minute you walk up to this place, you feel less then. The employees and hired security, and staff will  make sure you understand that they don’t care. The place is just a bad choice if you have any other options, go with that!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "110130535752324666174", "name": "Madison Brewer", "time": 1566504857733, "rating": 1.0, "text": "This place is a joke. No one can seem to help you because they are busy talking about drama. Nonetheless I feel the staff isn’t trained because they do not like when you like questions. Furthermore, I’d like to add the people who stick you do not have a clue of what they are doing.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "107060752849984490843", "name": "Rick Ranes", "time": 1471006826037, "rating": 4.0, "text": "Doing good in the world.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0bmBbk6lSUro9HyMOpA-zuQ9iS7oKS1nPjVs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "106421161400464950837", "name": "Marcus Lankford", "time": 1559651159396, "rating": 5.0, "text": "I love all the staff an it's a nice place to see friends an family there an they get the job done very quickly", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "116005067613650629719", "name": "Toni Hicks", "time": 1571751749190, "rating": 5.0, "text": "GEAT AND AWESOME STAFF VERY PROFESSIONAL", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "112853482138821034815", "name": "Larry Middleton", "time": 1533550530913, "rating": 5.0, "text": "Great staff, friendly and always smiling even though many people going in treating very rudely. I guess they are under they the impression that they are entitled to act horrible and like they themselves are going to make money yet they think they are getting a pre-cooked burger from BK and they'll be in and out in 5 minutes.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "111390469745170832118", "name": "Russell Floyd", "time": 1579789661650, "rating": 1.0, "text": "Extremely unprofessional. Every employee in here stands around and talks about drama. Something seriously needs to be done about this place it’s a joke!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "108696832356362162401", "name": "James Vice", "time": 1539704448081, "rating": 5.0, "text": "Called to get info and a very respictful woman named Brandy answered and was very patient and helpful with all the info i was trying to obtain.. So im heading in to see if they are just as good in person!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109013404049550664586", "name": "chris upchurch", "time": 1575235511584, "rating": 1.0, "text": "Biomed pays alot more!!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "108747204765625419255", "name": "Brian Carver", "time": 1541418908910, "rating": 4.0, "text": "Usually a good experience. Its 2 to 3 hours but not bad", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100319643639001864918", "name": "Ashton Howell", "time": 1534363609775, "rating": 1.0, "text": "If I could leave a lower review and post pictures I WOULD!!! This location is a freaking joke! My best friend spent 4 hours to be sent out with not one but TWO BLOWN VEINS and NO MONEY COMPENSATION! Then gives them another chance and gets, you guessed it, ANOTHER BLOWN VEIN!!! Only after spending literally 5 hours and 17 minutes on a RETURN VISIT!!!! There are other locations you can choose such as moffet that is wonderful! But the staff at this location UNTRAINED, UNPROFFESIONAL, and RUDE!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "108747204765625419255", "name": "Brian Carver", "time": 1541418908910, "rating": 4.0, "text": "Usually a good experience. Its 2 to 3 hours but not bad", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109094301282695735497", "name": "Scott Murray", "time": 1563393696630, "rating": 1.0, "text": "Would give NO stars.  Staff too busy gossiping to work.   4 of us in the donation area and after 20 minutes no one has hooked us up to donate.   Totally unprofessional.  Will start going to BioMed", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "110323509403989103411", "name": "Alexis Alexis", "time": 1515302080887, "rating": 1.0, "text": "This place is by far the worst plasma center. The staff is very unfriendly. No one is nice. On my first visit I felt like i was bothering them when I came in. And one time I got a bruise on my arm from a person who stuck me wrong with the needle and I went back in the next time and told them and they said put some ice on it.  They really need new management and staff. I highly recommend not going here. I have now started to donate at Grifols and its a totally different experience.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100392975726737831232", "name": "DU YU", "time": 1504290758490, "rating": 1.0, "text": "The amount of of unprofessionalism is staggering, ..between the standing around and gossiping,  on the phone, jab stickers,( those are the ones who don't either know what they're doing,  or just Don't wanna do it) , bad attitudes,  ( clearly in the wrong line of work  , if u don't want work with the public), which is a shame cause the few maybe. ..4-5 employees that are good..don't get the recognition they deserve.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "107396806796088872271", "name": "Heather Hubbard", "time": 1519667163647, "rating": 1.0, "text": "I got there at 2:30.and didn't get out until 7:30 at night.. very slow..no professional people there what so ever..alot of standing around gossiping about whatever...even in the middle of asking the doner for information they stopped a few times to talk to another company worker about something that happened to someone else the day before... legit just spewed this person's info...if I had not already spent so much time in the process I would have left...I got stuck twice before the vein was found and witnessed the lady spill plasma onto the desk out of one of the containers and she just wiped it up with a paper towel and kept on going..no antiseptic was sprayed or anything...I just cringed...sad to say this is one of the better places to donate....", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100506550147406163814", "name": "Montrez Golay", "time": 1448649810667, "rating": 1.0, "text": "Very poor..  Mangers no help..\nSystem no good...  They f over people and dont feel bad..  Work slow..  Always packed up like a suitcase..  Never use all the beds...  I advise another center... These peoples are crimanals...  They lie and waste valuable people time and effort ... I give them zero stars", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100312779554817159203", "name": "LaTonya Harrison", "time": 1522715946573, "rating": 1.0, "text": "They are very very slow i set their 2 hrs for them to tell me i couldnt donate. The little girl who checked me in never told me to sign in then she kept on calling me sweetheart an i have a daughter almost her age.Seems getto to me I cant wait till i have my day in court with them.They deferred me because i got upset a lady stuck me wrong on purpose at one center an then at other center i was attacked by a security guard dont waste your time at Kedplasma centers.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "101792900332934580367", "name": "Goddbod. Junya “iceberg” Winston", "time": 1581738026867, "rating": 5.0, "text": "associates are very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100785107767796459798", "name": "Lovebug Meshia", "time": 1559669569546, "rating": 1.0, "text": "This place is horrible the lady in management is rude and the spread lies. I called to ask about a piece of mail and they flipped it and said that I said I was living in a hotel which was false. So unprofessional to spread lies and I only been for 2hrs.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "115510217676779662368", "name": "Lena Baybee2394", "time": 1568491646584, "rating": 1.0, "text": "This place is unorganized af they don’t know how to stick u just horrible", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "111016869411528903879", "name": "Tee yjum", "time": 1569457918180, "rating": 1.0, "text": "Terrible service, a lot of playing around wasting time", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "112645565690965577024", "name": "Ashley hayes", "time": 1537799581754, "rating": 1.0, "text": "Customer mentioned he been there for 2 hours and employees says i don't need u to tell me how to do my job. U complaining put a application in..... Wow", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "101530563630323937730", "name": "Ansley Helms", "time": 1523986535516, "rating": 1.0, "text": "Sat here 4 hours, yes it was first time, but usually don't take that long anywhere for a first time visit foh... 👿👿👿", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "110735867727945400518", "name": "Ric Booker", "time": 1447167731890, "rating": 1.0, "text": "Lot of good workers Denise Girly Shannon.but notice guard picks an chooses who gets to wear hats.not a place I'd  recommend..they give u a card to get extra momey.they only added the first time. Not since.offer 5 extra 1-3 pm.didnt get mine from 2 was ago.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "106370088765433325015", "name": "Scotti Jackson", "time": 1467864180642, "rating": 1.0, "text": "During one occasion, one member of the staff accused me of having a bad oder on my person\nThe employee in general wanted me to leave, until someone else stood up for me. After my donation another employee said that there wasn't a smell she was just doing it out of spite for some reason", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "114188573634400572326", "name": "Elroy", "time": 1515456208222, "rating": 1.0, "text": "Took over 5 hours. Might as well go to work.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "117332909382875123440", "name": "Karterrius Tate", "time": 1547484349887, "rating": 1.0, "text": "Rude, slow, and I will never go again. I wouldn't recommend a homeless person  to go there. And they cheat you out of your pay. Can't do it", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "102523556438165902075", "name": "Brian Wilson Sr", "time": 1495307037390, "rating": 1.0, "text": "The only reason I'm putting one star is I have to. If you don't have to come to this place do not the staff is sorry,they don't keep the place clean. One lady was vary rude too my wife. There is other words I'd like to say but I'm not. Do not go herw", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "100224843211989012513", "name": "Jennifer Miller", "time": 1521246020885, "rating": 1.0, "text": "This past Thursday is the second time they've shorted me on my payment this time by $40. Then the website is broken so i can't even submit a message. Then they take twice as long since relocating. Awful experience.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "101482701712084951871", "name": "Eric Stanford", "time": 1534169596617, "rating": 1.0, "text": "Most of the staff are rude and instead of doing their job they play around to much.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "101874733932886751695", "name": "Dixie Robinson", "time": 1572105351283, "rating": 1.0, "text": "terrible place", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "118380198901333823005", "name": "Bridget Harris", "time": 1539461310571, "rating": 1.0, "text": "Its always trashy always trash all over the floor you will spend at least 4 hours here on a good day half of the people don't have a clue what they are doing its just a bad experience all around", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "102934396977131840382", "name": "Kristen Moody", "time": 1504372403684, "rating": 1.0, "text": "This place is garbage. The staff is severely unprofessional, on one occasion two of the women who work there got into an altercation with each other. They lock the door, two hours earlier than their closing time online. They are missing out on so many donations due to the way they operate.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109778233359560657804", "name": "bebe walker", "time": 1546372766542, "rating": 1.0, "text": "They refuse to change the days, they don't work with your schedule, and pretend the computer system they use can not be overridden", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "116925213945797075326", "name": "ALLEN WOODS", "time": 1535570601634, "rating": 1.0, "text": "Don’t pay enough money for the time you are there!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "115333188336773482203", "name": "Michelle Knight", "time": 1464101442254, "rating": 3.0, "text": "Some of the star are wonderful and some are just plain ugly and rude.", "pics": null, "resp": null, "gmap_id": "0x889a4d9628209d83:0x5cc7ed2e92d828a9"}
{"user_id": "109200325510050705684", "name": "Los Santos", "time": 1622125623823, "rating": 5.0, "text": "Staff keeps it a 100 they really care and the donor tech  Steven he's awesome always looking for ways to make ur visit as pleasing as possible", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "102740244483878380216", "name": "Nakisha Cook", "time": 1621312951777, "rating": 5.0, "text": "Great group of people caring and concerning..if you have any issues speak to management! They will address Concerns", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "106729315557990751640", "name": "Kelsey Jones", "time": 1622399830660, "rating": 5.0, "text": "They are always very nice. I always have a good time when I am there", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112353039185998087457", "name": "Mel Mc", "time": 1621204923772, "rating": 5.0, "text": "The staff are mostly AWESOME- rarely you will have someone who isnt great BUT 99% of the time they are all very nice and caring- THANKS for making donating not so bad😊", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101362467223736147217", "name": "nicole fuller", "time": 1622398427900, "rating": 5.0, "text": "The OPI Team there are all great from the screening process to the donor floor.\n\nShavanna is such a Queen.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "110194447165921489167", "name": "Marc Copeland", "time": 1622397841752, "rating": 5.0, "text": "Mostly all the employees are friendly. The new employees and the I younger ones. Katlin, Quanita, Kimbre, Steven, Robin, Shavanna are among the best. Helpful and good workers.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108061668231548174449", "name": "Anthony Powell (Tony Powell)", "time": 1615244709560, "rating": 5.0, "text": "I donate at the midfield branch and today christina & Lexus did an awesome job! They are very competent and professional at their job! One of the best experiences I have had  since I have been coming to this location!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112379907077264620288", "name": "Boris Perry", "time": 1620431626492, "rating": 5.0, "text": "I donate at the midfield branch and Kimbreia and Terri did an awesome job! They are very competent and professional at their job!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108784557573883254231", "name": "Runyan Richardson", "time": 1615556860470, "rating": 5.0, "text": "Very well established. Professional staff,  very kind and considerate. Warm welcome.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101481195290093165722", "name": "Tristan Eaton", "time": 1622403047869, "rating": 5.0, "text": "The staff is great and I had a wonderful visit", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "117923448205089207891", "name": "crystal scott", "time": 1615739220825, "rating": 4.0, "text": "After the initial visit, every visit is seamlessly quick.  The staff is personable and friendly.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "104006648426927968240", "name": "Gary Bradley", "time": 1615916804313, "rating": 5.0, "text": "Located in midfield al, nice staff and great customer service l.. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115477809547699076223", "name": "Clifford Keith", "time": 1615255074931, "rating": 5.0, "text": "Love the employees on the floor, and in screen ing room. Also the nurses. They are good people people!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "100239507361187736782", "name": "Antwan Parker", "time": 1622395190938, "rating": 5.0, "text": "Good service. Friendly environment", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108844577486427053556", "name": "Nichelle Scott", "time": 1615738275622, "rating": 5.0, "text": "Friendly staffing, they make the donation process easy, and it’s an overall great experience", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115726639835739743758", "name": "Justin Hawkins", "time": 1615244464289, "rating": 5.0, "text": "Great staff everyone’s nice friendly very professional never had any issues with anyone Lex, Christina.bri,Justin ms Chris great ppl those r my go to guys💯💯💯💯", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "117407758331702245417", "name": "Willie Anderson", "time": 1616248759182, "rating": 5.0, "text": "THIS IS A G A GREAT CENTER WITH A GREAT CENTER DIRECTOR.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112511907692982437548", "name": "Brian Jackson", "time": 1615745182430, "rating": 5.0, "text": "Great staff, Great staff.. They handle their business at all times...", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "103323586729182644387", "name": "Ruby Redd205", "time": 1622399313777, "rating": 5.0, "text": "Love the people and services here !", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "100414024972464906946", "name": "Chris Allen", "time": 1615744964779, "rating": 5.0, "text": "The team members are always helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "117714048338454915204", "name": "Nikolas Gilmore", "time": 1614377347113, "rating": 4.0, "text": "A bad stick, which lead to severe brusing and minor pain in my right arm.  NURSE was very nice as far as explaining the details.  Have to wait 14 days until i can donate again.....so long  JANUARY BONUS..I knew it was to good to be true...from this day forward I refuse to get stuck by New Phlebotomists until they are fully trained. Only CHRIS, BRI, AND PHILYIS, Ms CHRIS, Justin AND Terry  have my permission.....the rest of you keep working on it, but not me.  I like it here, the staff is pretty kool and you meet new people who don't mind sharing their views on LIFE. Everyone is really friendly, and i rarely experience staff members with bad attitudes..", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "107764641713554728649", "name": "Vincent Allen", "time": 1622397842068, "rating": 5.0, "text": "The staff is always great", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "116822199757485043785", "name": "Driq Ez Ent", "time": 1615562678163, "rating": 5.0, "text": "I love the service and staff thanks y'all", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "105359593960506580688", "name": "Vincent Christon", "time": 1616537238397, "rating": 5.0, "text": "Good experience, everyone is professional and nice.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "116509380083313597181", "name": "Barry Young", "time": 1615555167445, "rating": 5.0, "text": "Very courteous and sweet both Phyllis and Lexus", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108380992255904364484", "name": "James Holley", "time": 1615247134137, "rating": 5.0, "text": "Great experience, I will recommend other People!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "109898525572506603638", "name": "Corey Wright", "time": 1615243245883, "rating": 5.0, "text": "It's always a good experience with Christina and Lexus", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "110400550013702020111", "name": "Ledarrius Eaton", "time": 1615554901872, "rating": 5.0, "text": "Ms Phyllis is a great sticker and great worker", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112095743698444837805", "name": "Tip Moodz", "time": 1612824270426, "rating": 1.0, "text": "Slow, no desire to do the job. Stood at the desk for over 20 minutes waiting for someone.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "107927442788870098164", "name": "Jnette Steward", "time": 1615556726159, "rating": 5.0, "text": "Always courteous and respectful.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "118156875011963904142", "name": "Claudia Collins", "time": 1617216049809, "rating": 1.0, "text": "it smells so bad in here my eyes are watering", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "106869324421270872334", "name": "Steven Carter", "time": 1622397740179, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112020726534761730053", "name": "CADEZ SZN", "time": 1615562603196, "rating": 5.0, "text": "Best place in Birmingham", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "105869520659593008108", "name": "Breanna Webb", "time": 1615564117550, "rating": 5.0, "text": "Fast and excellent workers", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "114460573811394697303", "name": "Chris Peacock", "time": 1615247036067, "rating": 5.0, "text": "Very quick and friendly", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "100351197279930325618", "name": "Joshua Evans", "time": 1615240924643, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "110221484104010728362", "name": "Jasmine Mitchell", "time": 1563423679698, "rating": 1.0, "text": "This place is a scam horrible I advise if you are looking to make sum money go somewhere else. I entered my name in the raffle after I won it's been months & I still haven't received my prise management keep telling me corporate office will take care of me but I haven't received a dime they don't value their donors who keep their business operating the girl usually at the front desk is not very nice they never answer the phones the nurse is the only one with humility. It's a sham I wouldn't advise my worst enemy to b a donor there it's horrible.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "117020324390363567311", "name": "Michael Woods", "time": 1537926931574, "rating": 1.0, "text": "Incredibly rude workers(with the exception of a few nice ladies!) Apparently donating life saving plasma entitles you to be talked to like trash at this facility! Maybe they should give courtesy classes to employees so that everyone would have a better experience when trying to do something that is desperately needed. Also this facility has run down machines that blow veins more often than the rude workers! Hopefully things change soon otherwise I doubt this branch will be open too much longer and that's a shame considering how much plasma is needed to help save lives!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "113831023725850811624", "name": "alyssa isaac", "time": 1574118167200, "rating": 3.0, "text": "I've been up here constantly giving all of the documents that I'm supposed to give to donate. The nurse said that the doctor is still going to give it right back and not approve it. I don't know what else to do. I'm giving up on trying to donate. I did everything they told me to do and it still isn't good enough. It's Crazy and very Frustrating.", "pics": null, "resp": {"time": 1574278275933, "text": "If you’ve already expressed concerns to center management and feel your issues haven’t been fully resolved, we’d like an opportunity to follow up further. Please reach out to our donor relations team at https://octapharmaplasma.com/contact with your concerns and steps you’ve already taken so we can address as needed. Thank you."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112554091159884900864", "name": "Jessica Leila", "time": 1541792184613, "rating": 5.0, "text": "The ladies and gentlemen here are always professional, caring, and efficient. Thank you for all you do! We appreciate you so much, and we have the upmost respect for you, your chosen profession, and wonderful service. 💗👩🏻‍🔬👨🏽‍🔬👩🏻‍⚕️👨🏻‍⚕️💉🔬🦠🎗🏆", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101262608364516338358", "name": "Madison", "time": 1527204741765, "rating": 1.0, "text": "Staff was extremely rude. Waiting room is obnoxious. I was just informed that I am permanently deferred and never heard a reason. I went to donate in Midfield and wore a knee length dress with Shorts underneath. I was told I could not donate wearing this. I had not completed ANY testing or anything. I have donated plasma throgth Red Cross with no issues. Come to find out after I moved to the state of Washington, I had to get a transfer from the midfield location. Even though I had not donated or gone through screening. So. They lied. Be careful if you go here, you could end up permanently deferred because an employee can do it.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115824282285412920717", "name": "Anthony Goree", "time": 1615558858891, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "116980789823440131925", "name": "Eye_inter_taine", "time": 1486508985072, "rating": 2.0, "text": "Highly dissappointed with patience service.rarely acknowledged even with eye contact I was consistently walked passed. new donor takes about 2hrs normally. I left in 4hrs and with the amount of business at the time I feel like I could've been done within the 2hrs they predicted", "pics": null, "resp": {"time": 1486740339340, "text": "Your time is valuable to us. One alternative is to consider making your donation during off-peak times. Before/after work and during lunch hours are our busiest times. Work with your local donation center staff to find days and times that work best to fit around your schedule."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "105563885940149073021", "name": "Devante Williams", "time": 1545155296646, "rating": 5.0, "text": "It's a great environment, everyone does the best they can to give you a positive experience", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115187521316060964947", "name": "Nay Carmichael", "time": 1515619455269, "rating": 5.0, "text": "I had a strenuous time trying to get a transfer from a different OPI in a different state. I won't lie, I almost didn't come here because I read the reviews. I'm glad I did come. Robin is amazing and she definitely went above and beyond to help me out. I read a lot of people say that they are rude and unprofessional here. I can be glad to say that NOT ONE person was rude, crass, unprofessional or anything of the sort. Maybe they got rid of all the bad seeds but I have not had a problems here and I will gladly return and refer others here", "pics": null, "resp": {"time": 1517257040533, "text": "Thank you for sharing your feedback. We appreciate hearing from our loyal plasma donors and look forward to seeing you back in center again soon."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "105848734068193205145", "name": "Kodey Hogan", "time": 1537907398417, "rating": 1.0, "text": "Disrespectful and rude front desk employee. Everyone else there is wonderful and honestly I would never come back if it wasn’t for the nurses that take care of you during the donation process.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "110183518128754208828", "name": "Nathan Bassham (Nate)", "time": 1536698673716, "rating": 5.0, "text": "The staff is really nice and down to earth .it fills like family when u come in everytime thank u", "pics": null, "resp": {"time": 1537299798056, "text": "Thanks for your high star review, Nathan Bassham! At Octapharma Plasma we work hard to make sure our customers have a positive plasma donation experience, and we love hearing from satisfied donors."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108780228091515002424", "name": "C Told", "time": 1544223720771, "rating": 4.0, "text": "It's a nice place the people are friendly and they really help", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115187521316060964947", "name": "Nay Carmichael", "time": 1515619455269, "rating": 5.0, "text": "I had a strenuous time trying to get a transfer from a different OPI in a different state. I won't lie, I almost didn't come here because I read the reviews. I'm glad I did come. Robin is amazing and she definitely went above and beyond to help me out. I read a lot of people say that they are rude and unprofessional here. I can be glad to say that NOT ONE person was rude, crass, unprofessional or anything of the sort. Maybe they got rid of all the bad seeds but I have not had a problems here and I will gladly return and refer others here", "pics": null, "resp": {"time": 1517257040533, "text": "Thank you for sharing your feedback. We appreciate hearing from our loyal plasma donors and look forward to seeing you back in center again soon."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "110506893520618183211", "name": "Mark Eason", "time": 1509983083395, "rating": 1.0, "text": "I am giving the place a one star.  I have been going for a little over a month and some of the staff are very friendly and helpful but others are very rude and unprofessional and raciest . I have given several referrals to give plasma to my friends but want be doing it again especially here.  one of my referrals   drove all the way from Cullman and she stated how unprofessional it was.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115116358905916104203", "name": "Kevin Allen", "time": 1543258905100, "rating": 4.0, "text": "Great service friendly staff convenient location!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0U8dC-Nk0D0_aTdfku2WQhDTKOwNEzC3jhwJh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "102993565637065628945", "name": "Supa CG", "time": 1512001630722, "rating": 1.0, "text": "I found the normal staff members to be pleasant but the doctor and management both have issues. Specifically, I suspect racial issues to be the real reason I was treated so poorly. They kicked me out because I had an allergic reaction of some sort. Was told to never come back. I don't understand why they had to be so ridiculously rude to me about it considering I had been donating for over a year and had yet to have any problems up to that point. They accused me of being on drugs. Completely disrespectful.", "pics": null, "resp": {"time": 1490114121107, "text": "Thanks for the feedback. We always like to hear from our loyal donors. We know your time is valuable and work hard to process donors in the most efficient ways possible. One suggestion is to consider making your donations at off-peak times. Work with your local donation center staff to find days and times that work best to fit around your schedule."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115661603257455267695", "name": "Amanda Marlin", "time": 1499524753920, "rating": 1.0, "text": "Staff is VERY unprofessional here! When they are not making racist comments...they are trying to sell you heroin. Also I went 3 times and the same exact employee would run over to me to stick me with the needle. And each time she ruptured my veins leaving me black and blue and severely sore! The last incident I caught the staff laughing amongst other employees, saying how she was doing it to \"that white girl's veins on purpose\" Needless to say, that staff member got fired that day. Regardless, I have yet to donate Plasma there again, and never ever plan to.", "pics": null, "resp": {"time": 1500298663307, "text": "Thank you for informing us of your experience at our Midfield donation center. We are following up with our management as appropriate to improve the customer experience at this location and appreciate your feedback and patience. Thank you for coming in to donate."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115802637100681774507", "name": "saquan bostick", "time": 1459352178576, "rating": 1.0, "text": "It's literally amazing how terrible the professionalism is there. I'm giving one star, only for the respect of the very few good employees they have on staff- but for the most part this is the worst patient/ customer care assistance I've ever encountered. Donating plasma should be a courageous, pleasant experience. Having to deal with undisciplined, unprofessional staff makes things alil more uncomfortable having being injected with that huge needle. Wish donating plasma could be a more pleasant experience, but I guess that's too much to ask. (Shrugs shoulders)\n* note- This review ONLY refers to the Midfield, Alabama location. The South side, Birmingham location has an incredibly awesome team of caregivers.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108318776008774662495", "name": "watson cornelius", "time": 1556299566407, "rating": 4.0, "text": "It has been a great opportunity", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "114878351881870053185", "name": "Travis Lewis", "time": 1524602926873, "rating": 3.0, "text": "They could be fast the donation time isnt bad its not packed with alot of people and i think that is a friendly place..  A-ok", "pics": null, "resp": {"time": 1524833908381, "text": "We think of our donors as family, and it's great to hear directly from you that we're providing a friendly and efficient environment. Thank you!"}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108516135508034292869", "name": "Cynthia Diggins", "time": 1511632696756, "rating": 4.0, "text": "I am a firm believer in customer service.\nI spoke with a employee by the name of Kelley, her telephone etiquette was incredible. I had several questions and she was more than happy to help me.\nI have been in management for half of my life and Kelley's customer service should be implemented in your employmee training. In the past I have been made to feel less than a person.\nbecause I am donor. I am not in it for the money\nbecause you give the bare minimum.\nYour company is really not competitive in paying donors for our donations, with other plasma centers for such a priceless , life saving act.\nEmployees like Kelley and her kindness and regards for donors is what make your business a sucess and ease the animosity\nof being under paid, by the way Grifold give $75 per donation , is that because your company is located in the western part of town and the race of your donors.\n\nThank You Kelley\n\nMidfield location", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112053020375297052060", "name": "Tony Feltman", "time": 1550071362375, "rating": 5.0, "text": "Staff is very courteous and knowledgeabl.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "109317837712972307907", "name": "Constance Minniefield", "time": 1436118496017, "rating": 2.0, "text": "I'm only giving two stars because the actual phlebotomists down stairs are pretty cool. Other than that the service was terrible. Some of the nurse and staff up front are very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "113697659880794907375", "name": "A Google User", "time": 1462464980987, "rating": 1.0, "text": "This place is a total cluster f**k. The employees in the back just goof off, gossip and flirt with all the guys. They act as though they are at the club and not at work! They will blantently ignore the donors when we need assistance. Corporate really needs to clean house here. Also, it is in their Policy that they can kick out a Donor if they use profanity but the Employees in the back cuss and talk dirty talk ALL THE TIME!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "111126800264373955460", "name": "C Woods", "time": 1473605902572, "rating": 1.0, "text": "Horrible there very unprofessional and they tell u 1-2 hours its really 3-4 hours no matter what time you go. But the workers are beautiful. :-)", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115752550406580772405", "name": "Staci Johnson", "time": 1473793203297, "rating": 1.0, "text": "Service is horrible!!! Phlebotomists have horrible attitudes, argue over who suppose to be doing what. Slow, so slow I sat for 2.5 hours to get stuck. That did not include waiting to be called. After waiting 3 hours I had to leave to get my kids from school and they told me I couldn't come back after patiently waiting all that time. Sad!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "105174797802647930909", "name": "lisa beasley", "time": 1465324881201, "rating": 1.0, "text": "They tell you not to drive yourself yet they will not even let your ride sit inside in the air conditioning. Its probably 90 degrees outside. And I don't have air conditioning in my truck. So I am sitting outside on the sidewalk in an unsafe part of town all because they won't put more chairs in the lobby. And they are very rude. If I could give 0 stars I would . We will never be coming back to this location.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "103515857592118405361", "name": "Jeff Marks", "time": 1485498469463, "rating": 5.0, "text": "Great staff. Crowded at times. Wi-Fi. Soda-snack machine.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112168728274781980030", "name": "Deonna Walker", "time": 1510049126196, "rating": 1.0, "text": "The wait is ridiculously awful,, an unprofessional. They messed mi money up on three different occasions..then when called about it a member from the desk says \" Well what make you think your owed money?\" Witch I gave my plasma!! It's terrible an just down right ghetto. I'm looking to transfer now. An to reply to that owner you dont care because its not you! Rate you guys a 0!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115644680855907868102", "name": "Joanie Furgason", "time": 1582074272123, "rating": 1.0, "text": "Very rude and very racist", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108094399694191238992", "name": "Alvin Lewis", "time": 1451835593411, "rating": 1.0, "text": "They are terrible not enough employees And The wait is ridiculous.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "113059291202668147737", "name": "Jennifer Davis", "time": 1541895158309, "rating": 5.0, "text": "Very friendly staff.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115913239638826668284", "name": "Arielle Meow", "time": 1519866080342, "rating": 4.0, "text": "Racist towards white people. In general chill lax staff...", "pics": null, "resp": {"time": 1521737000011, "text": "Octapharma Plasma works hard to staff each of our donation centers with courteous, respectful, and professional employees. We appreciate feedback on any areas our staff can improve, because our donors deserve the best customer service possible! Please speak with your local donation center management so we can address and solve any of your concerns moving forward."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101717304599469724005", "name": "Terrance Whitt", "time": 1542463594943, "rating": 1.0, "text": "They’re very unprofessional and the wait time is ridiculous", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "112157349614338939380", "name": "Shawona Hodges", "time": 1531160010299, "rating": 1.0, "text": "They are rude when I went there the first time she said my mail was expired them I went to get another piece of mail she said it wasn't a date on it. Not coming back", "pics": null, "resp": {"time": 1531424547450, "text": "Thanks for letting us know about your experience. We are always looking for ways to improve our customer service and we will pass on your feedback to donor center management as applicable."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108230958202784736165", "name": "HJ", "time": 1482350492638, "rating": 1.0, "text": "Well my experience was terrible. I got stuck wrong, when my blood returned it returned in my tissue instead of my vain and the next day my arm was black.", "pics": null, "resp": {"time": 1482501130830, "text": "We’re sorry to hear about your experience. All Octapharma Plasma center staff are trained through a rigorous, regulated program. Most people do not experience any side effects from donating plasma, but if you are we recommend that you consult with your medical professional. Your health and safety should come first. Thank you for your life saving plasma donation."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101448761181431712747", "name": "Ms Grayson", "time": 1545936099814, "rating": 3.0, "text": "Been coming here about 10 years now my only complaint is they are understaffed always kinda makes me wanna take up phlebotomy instead of CNA and come lend a helping hand", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115638677770917337547", "name": "Princess Tammy", "time": 1542129336216, "rating": 1.0, "text": "Nasty attitudes", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101626491612325778514", "name": "Lucas Armstrong", "time": 1508008517468, "rating": 5.0, "text": "Keeps it real!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115789966873863400072", "name": "Nate Rice", "time": 1507126708963, "rating": 1.0, "text": "The worst place to go", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "107338876118582587627", "name": "Cain", "time": 1505053934562, "rating": 1.0, "text": "Customer service sucks.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "117603157624881466733", "name": "Tifini Bryant", "time": 1515886023296, "rating": 4.0, "text": "Usually you get in and out...if you get there at the right times......", "pics": null, "resp": {"time": 1517256679625, "text": "Thank you for sharing your feedback. We appreciate hearing from our loyal plasma donors and look forward to seeing you back in center again soon."}, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "107338876118582587627", "name": "Cain", "time": 1505053934562, "rating": 1.0, "text": "Customer service sucks.", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "109821740658811902571", "name": "brandon bonner", "time": 1472218508532, "rating": 2.0, "text": "Alright I guss", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "115638677770917337547", "name": "Princess Tammy", "time": 1542129336216, "rating": 1.0, "text": "Nasty attitudes", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "101626491612325778514", "name": "Lucas Armstrong", "time": 1508008517468, "rating": 5.0, "text": "Keeps it real!", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "110140852586126819399", "name": "Christina Brown", "time": 1465940912200, "rating": 1.0, "text": "worst ever", "pics": null, "resp": null, "gmap_id": "0x8888e1dcc69bb5ef:0xdfbe15e426032af8"}
{"user_id": "108210502233042599868", "name": "Lester Taylor", "time": 1608238770705, "rating": 5.0, "text": "Support our local blood supplier. All the hospitals in North Alabama use this blood.", "pics": null, "resp": null, "gmap_id": "0x887d485861afffff:0xf2f6038df602df77"}
{"user_id": "118427567350612200553", "name": "Brian Patrick", "time": 1569358738471, "rating": 5.0, "text": "Matt done great! Will be back", "pics": null, "resp": null, "gmap_id": "0x887d485861afffff:0xf2f6038df602df77"}
{"user_id": "102620422445875173373", "name": "Amanda McClellan", "time": 1544125364072, "rating": 5.0, "text": "God bless these people that save lives", "pics": null, "resp": null, "gmap_id": "0x887d485861afffff:0xf2f6038df602df77"}
