{"user_id": "114720194413747308763", "name": "R T", "time": 1614901009216, "rating": 1.0, "text": "I went by there to find out the cost to mail something simple 9 x 6 envelope with papers enclosed. I was given a price of $4.36 to mail it. I asked what the store store was (Surcharge) and the lady did not know. I left and did not mail it there. I took it to the post office downtown Decatur, Alabama and the Total cost was only $2. What kind of extra charges is this place charging?", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114441491131382657787", "name": "Kris Small", "time": 1595953548046, "rating": 1.0, "text": "I've never once been asked what I am shipping ever by any company. I was attempting to ship some very valuable items to my brother in Ca. today and was asked what I was shipping, I stated personal items nothing hazardous. She asked me to describe the item.... that's how they figure out what packages to steal I guess.  because I've had plenty of packages go missing in the mail. if it's hazardous sure I understand but it's not and not on the prohibited list. so they don't need to know. I'll take it to UPS or Fedex next time directly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "113782076434936919802", "name": "Joey Anderson", "time": 1581617285842, "rating": 5.0, "text": "I am very impressed with this store and their employees. I was greated before I made it completely through the door. The staff is upbeat and professional. They were able to service all of my needs and super knowledgeable. I will definately be going back. Thank you for such a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105894517387541931417", "name": "Jason Jameson", "time": 1571417959113, "rating": 5.0, "text": "Amazing store, most polite employees, FedEx shipping. Ignore other reviews where people are not posting honest information. The Shipping Store & More offers FedEx shipping and has amazing employees!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108084887572777496456", "name": "Jay Boyd", "time": 1581458906888, "rating": 5.0, "text": "The employees are very friendly and helpful at this esablishment. I am exteremly satisfied with their professionalism and expertise. I appreciate their services and friendly smiles.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100483729770111816809", "name": "Glen Hunter", "time": 1576823465784, "rating": 5.0, "text": "The 2 clerk's working today were very helpful and professional and handled my packing and shipping needs very quickly. I would definitely recommend this store for all your packing and shipping needs.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107824479444157216157", "name": "Bill Jehle", "time": 1440517629378, "rating": 5.0, "text": "As the chief cook and bottle washer of my own business, the kind folks at The Shipping Store are my staff. I could not run my business without them. Shipping and receiving, not a problem. Notary, not a problem. Photocopies, packing material, anything an average office would need, not a problem. Blueprints, full-sized plans that require a plotter, again, not a problem. Plus, it's great to walk in and folks know me by name. Let The Shipping Store be your secret weapon to make your life or business life a little bit easier.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109508137692215896816", "name": "Captain_Redpill", "time": 1553722820451, "rating": 1.0, "text": "Won't be going back to this place ever.  The lady working there completely refused to serve me.  Went two miles down the road and had the service performed at the ups store,  without question.   Continue to watch your business fail.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116113654703355588114", "name": "Alexa Womack", "time": 1462886507362, "rating": 5.0, "text": "Such a welcoming store! I was greeted by every person in the store upon entering and leaving. They were even willing to get my package ready to go even though it was UPS. I was only there for a few minutes but I really felt that the employees enjoyed their job! Definitely recommend using them.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105389454577494015329", "name": "Brian Moran", "time": 1448147712160, "rating": 5.0, "text": "I have to say that I've never been taken care of in the way this team takes care of my needs. As a small business person myself, I appreciate the attention to detail, warm environment, and sincerity I receive when I walk into with The Shipping Store. I've read some of the other reviews and I would have to say that their prices are very fair. They provide a service that I have not seen matched with other big company chain stores. It is an absolute pleasure to do business with these guys!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107847402129431752361", "name": "Sandra Austin", "time": 1594243283093, "rating": 1.0, "text": "Anytime I mail from here it takes many days for the package to get anywhere.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106934267714093912358", "name": "Christina Morse", "time": 1463755936331, "rating": 5.0, "text": "The employees at The Shipping Store were super friendly and helpful! They did everything they could to save me money on shipping. If you have anything to ship, I would definitely recommend The Shipping Store. They made shipping a breeze!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100668768891717817680", "name": "Jennifer Melcher", "time": 1464146531134, "rating": 5.0, "text": "We took in a fragile item and they packed it for us wonderfully. They were super nice and not just to us but to everyone that came in. They also showed us ways they could help our small business save money on shipping and printing. We will definitely use again!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "110547199723346370010", "name": "John Wallace", "time": 1563465552462, "rating": 1.0, "text": "They do not ship fedex, waste of my, yours and everyone's time.  Fedex sign in window, rude lady behind the counter..DO NOT GO HERE IF YOU ARE TRYING TK SHIP A FEDEX PACKAGE, FALSE ADVERTISEMENT..!!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106542589286602344651", "name": "jose villa", "time": 1575930733783, "rating": 1.0, "text": "Waste of time they say they ship fedex but they don't they are limited so you have to go to the one in Madison. Why even call it the ship in store where they can't ship nothing", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "118445472702982105366", "name": "susan hassett", "time": 1441054295523, "rating": 5.0, "text": "I have used The Shipping Store for many years to mail packages, have copies made and faxes sent. I appreciate the professional and friendly staff. Their packaging services help me save time and enable me to send packages hassle-free.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109596769324101350077", "name": "Tracy Roberson", "time": 1463225262109, "rating": 5.0, "text": "The staff are always professional and courteous when I bring things in to have shipped.  I wish the same was true of USPS. The Shipping Store has never lost any of my parcels with the many dealings I have had with the business. You can probably guess who has. I will continue to bring my business here as long as they are here. Thank you.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "115160726920482923383", "name": "Jenna Burfield", "time": 1558036223914, "rating": 1.0, "text": "Store staff was very rude. TERRIBLE CUSTOMER SERVICE!! I brought in a package to be shipped and asked for documentation stating that I dropped a the package off. The lady behind the counter stated that if I wanted a receipt that I could wait until FedEx picked it from their location and scanned the barcode (who is to say they wouldn't loose my package) or I could drive to Madison.\n\nEdited to inform that I was able to take my package to Walgreens for drop off. The Walgreens staff were friendly and promptly emailed me a recept for my records. THERE IS ABSOLUTELY NO EXCUSE for the pushback I received when I asked for a simple drop off receipt from The Shipping Store.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104087776520124817766", "name": "Mary McMahan", "time": 1440260718055, "rating": 5.0, "text": "Amanda saved me from losing my $4900.00 ring to a scammer on Craigslist.  I am so grateful to her and to this store for hiring her.  This experience has brought renewed faith that there are still people who work for businesses that genuinely care about their customers !!  Amanda, you are an angel, I will always be grateful for you and I pray blessings upon you and your family !!  The Shipping Store....don't ever let her go !!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1462390895397, "rating": 5.0, "text": "Great people, great service!  The Shipping Store is a place where you will be taken care of.  Great folks!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117270700978745782182", "name": "AK Lee", "time": 1495585833241, "rating": 5.0, "text": "They offer a great service and and I even paid for the tape it was worth it", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117701923495067398210", "name": "L D", "time": 1377130186414, "rating": 2.0, "text": "Way overpriced. $0.75/each for stamps! Their shipping costs are also astronomical. I went there to ship a package and was quoted an amount so high that I thought it was a joke. It wasn't. I then went to Staples right down the street to get a quote from their shipping center and it was 50% less. Stay away from this place!", "pics": null, "resp": {"time": 1493327901599, "text": "Jill,\n\nFirstly, thank you for patronizing our business.  We take great pride in our friendly, high level of customer service.  As to your comments about our service charges,  If we weren't able to realize some level of margin over our costs, we would not be able to maintain a viable business or be able to offer the level of service that we so pride ourselves in.\n\nThanks sincerely,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "101710291188347059144", "name": "cassandra chittam", "time": 1447866224969, "rating": 1.0, "text": "Closest shipping place to our company.  We will be driving the extra distance to find an actual post office from now on.  Pricing is extremely high to send out items USPS.  When I called asking why they charged my assistant 10.74 for a small FLAT RATE box, I was told they do not honer flat rate shipping.  I then asked why did they not inform my assistant of this and they stated because all she said was she needed to ship these items. The lady behind the counter didn't know what she was doing.  First time she rang up the bill the total came to $4000 for USPS shipping. Wanting to use USPS services for your packages stay away from this place unless you want to pay double what you would if you went to the post office.", "pics": null, "resp": {"time": 1493328931183, "text": "Ms. Chittam,\nFirstly thank you for patronizing our store.  We take great pride in deliverying friendly, high quality goods and services.  As to your comments about USPS flat rate boxes, we do not offer them as they simply aren't big enough for average small shipments.   Per your comment about the cash register misring, we are sorry but we as humans are not infallable.  Fortunately, our system will catch any errors before the transaction is complete.  We apologize for the momentary delay.   Regarding your comment that our USPS prices are double the Post Office,  yes, we do charge a nominal service charge to cover our overhead and the ability to maintain a viable business thereby offering our customers a level of service they might not realize at the Post Office.    In fact many of our USPS prices are actually lower than the Post Office as we realize volume discounts that an individual would be unable to quality for.\n\nThank you again for your comments.\nSincerely,\nDon Cantrell\nPresident,\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114990420188726533020", "name": "Daryl Piner", "time": 1441294603051, "rating": 5.0, "text": "Excellent service and very friendly people who will go the extra mile to help you.  I reccomend this place to everyone.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117049772022464651991", "name": "Lee Bates", "time": 1452354104733, "rating": 5.0, "text": "Always friendly service and they do the job right. I drive extra miles for this quality.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105075834732383199786", "name": "Elise van zandt", "time": 1464366522941, "rating": 5.0, "text": "A+++ service! Very friendly staff and super helpful!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112593356385282467328", "name": "Rodrigo Banzon", "time": 1464385634824, "rating": 5.0, "text": "Excellent service.  Outstanding staff!", "pics": null, "resp": {"time": 1493327616424, "text": "Thank you. We take great pride in our level and quality of service."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "111708991384449542120", "name": "Brenda Caudle", "time": 1448047458517, "rating": 3.0, "text": "Fast and friendly service. The cost was higher than expected.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108899288135944656892", "name": "Misty Myres", "time": 1470087060480, "rating": 1.0, "text": "Very rude staff. I called ahead to verify all details and was told something different when I got there leaving me to rush to FedEx in Madison to ship my packages.", "pics": null, "resp": {"time": 1493327550562, "text": "Ms. Myres,\nFirstly, thank you for patronizing our business.  We pride ourselves in deliverying friendly,  high quality goods and services.  However, we are unable to access your or any other customers FedEx account number to charge shipping to.  We gladly accept FedEx prepaid packages at no charge, which have the shipping label already affixed.  Otherwise we are glad to create a label for you for which there would be a charge.\n\nRespectfully,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112071219118800431716", "name": "Karla Gibson", "time": 1463250306071, "rating": 4.0, "text": "People were Very nice and helpful.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104660907043666156150", "name": "John Buckelew", "time": 1496504042314, "rating": 5.0, "text": "I use them for my mailbox, shipping, and FAX service. Professional in every way. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109557001826874830430", "name": "Jim Nichols", "time": 1463653639672, "rating": 5.0, "text": "Its like when Butch said to Sundance, \"Who ARE those guys?\"", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109658838689981900939", "name": "Rodney Scott", "time": 1464175044310, "rating": 5.0, "text": "Had a legal document that had to be handled asap and the store more than exceeded.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116022121710779188150", "name": "Teresa Hutto", "time": 1464316250880, "rating": 5.0, "text": "They are great people!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "101145405627728326190", "name": "Shanna Jennings", "time": 1620822866300, "rating": 5.0, "text": "I am very happy with the stock plan that we purchased and had amended. Initially it was going to be a few small changes, and it turned into a much larger project than anyone anticipated. Throughout all the changes, the team was responsive and quickly turned changes around for approval. They even worked with my builder to finalize a few details that he needed to show for permit purposes. I am hoping that we are building our forever home, but if not, I would not hesitate to use ERDD again. Money well spent.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "115610796077373046229", "name": "Holland Dixon", "time": 1619004878007, "rating": 5.0, "text": "They took our vision and produced a work of art allowing me to refine my future building project. Correcting things we didn't see or hadn't thought of and highlighted useful addition needed to be functional. Very professional, always responsive and overall a GREAT company to work with!", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105120994784252943306", "name": "Renée Dates", "time": 1618932877895, "rating": 1.0, "text": "Multiple phone calls and messages left for a job. All calls are screened and no one will follow-up with repeated requests for assistance. The poor reviews are absolutely correct - THEY DO NOT CALL OR FOLLOW-UP! BEWARE OF THIS COMPANY!", "pics": null, "resp": {"time": 1618934221293, "text": "You are a customer of our client Bama Sheds. We have been in contact with Bama Sheds.  If  they have not been in contact with you that is not something we can control."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "103880698808308487788", "name": "Kristie Potts", "time": 1599105422850, "rating": 1.0, "text": "Absolutely terrible. I paid a deposit for future home plans. I was very descriptive when speaking to Christy about my plans- One level barndo, specific interior layouts and sq ft. She explained to me that they certainly could design my plans. I paid a deposit, sent the EXACT exterior structure of what I wanted, along with additional interior layout and door. I heard nothing for several weeks, with many phone call attempt. I received a random email apologizing for the delay, that a family member had an illness. Weeks go by again with no returned calls. Finally, I requested they return my deposit and I would outsource a more reliable designer. I recently received another random email with some generic sketches that were nothing of mine. I responded and asked them if they were able to adequately provide services.- NO RESPONSE. I have since then called multiple times, left multiple messages in request to have my deposit refunded. As of today, I have reported them and contacted my bank. After reading reviews and doing further research( I should have prior to hiring them)I see the EXACT same scam happening over and over. What a waste of my time, money and energy!", "pics": null, "resp": {"time": 1602576522982, "text": "The project was delivered late but we did provide two options based on the client provided sketch and exterior she was looking for."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105766203325923846337", "name": "Brent Timmerman", "time": 1612743464910, "rating": 1.0, "text": "BEWARE! DO NOT DO BUSINESS WITH THESE PEOPLE!\n\nI will spare the specifics of my experience, However I will warn any prospective person interested to please read the reviews. They ( The bad reviews)are highly accurate !\nThese people will take your money, and disappear from communication.  With the exception of lying to you through messenger app.. And then when you are able to contact them from a different phone number that they are not screening,  they will blame you for their VERY UNETHICAL business dealings . With that being said, I have nothing to gain from this review,  however I am out 400.00 for services that I never received,  And based on reviews that I have now read. Christy ( The Owner ) will counter this review saying she refunded my payment, which she lied about on the phone with me , because I followed up with Discover ( My financial source ) and Square ( Her financial source  ) and both confirmed to me that no such transaction had taken place!  These people use every excuse in the book to get away with taking your hard earned money and giving you ABSOLUTELY NOTHING IN RETURN.\n\nSTAY AWAY!!!!\n\nLOOK BELOW TO OWNER'S RESPONSE\nITS ALL LIES TOO !!\nTRUST. ME", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105858571544200180137", "name": "Joe Wilson", "time": 1618968445218, "rating": 5.0, "text": "Very nice people who do excellent work at fair prices.\n\nI plan to use them again soon on another project.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116843509127231600011", "name": "Chris Gourley", "time": 1527360652830, "rating": 5.0, "text": "We are happy with our plans from ERDD. They did their best to help us to design our forever home and we are happy with the end results. They were willing to make many changes to the original design which shows they are willing to go the extra mile to make their customers happy. They came to our home initially to see where the house would be built and we had our finished plans within 2 1/2 weeks. They could have finished much quicker but my wife and I made a lot of changes so we went thru about 11 drafts to get to the finished project. The fact that they were willing to work with us to this extent means we would use them again if we ever need an architect again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkQ3GjaU-mEYsaZJkzzmhzC7RPd34rObYZd-TT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4fuc1vYck4ppxJwgTkr6_RH4SDclN6lYZXrgP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ3hqXCu98M0hpDACWafyJyIoVqKYbX-JXQ6lp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116462465451882637890", "name": "Jackie Wirth", "time": 1603419986300, "rating": 1.0, "text": "Not an actual client, but based off the repeated and disappointing testimonials of others... I would suggest avoiding this company.  The accusations, articles, and evidence provided are so concerning that these individuals should be investigated.", "pics": null, "resp": {"time": 1603420680268, "text": "The others that have make claims against us have either been refunded or they did receive their plans and still asked for refunds. There are two sides to every story. I will gladly share any evidence supporting our side of these claims as well if you would like. Our email is listed on this page and my cell phone is (256) 595-1574 If you like further information."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "113897147587663313137", "name": "Jessica Logan", "time": 1601305558847, "rating": 5.0, "text": "Amazing to work with! They took our general ideas and produced our dream home! Highly recommended!!", "pics": null, "resp": {"time": 1603403247240, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108893244794006776925", "name": "Tina Johnson", "time": 1603452142325, "rating": 5.0, "text": "Some people have growing pains and are not always right in the way they handle things. Yes Elaine Roberts Drafters and Designers May I made mistakes. But they delivered my plans to me and in a reasonable time. Not everyone is perfect. Some people only want to bash people with negative reviews.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107524635065726496476", "name": "Drue Poynter", "time": 1602510380640, "rating": 1.0, "text": "TERRIBLE TERRIBLE SERVICE! We have tried to get in contact several times after sending our deposit. It has been 4 weeks and they have not been able to give us anything. After posting a bad review on Facebook they told us we would have our plans by the end of the week and NOTHING! I would not recommend them to anyone! After reading more reviews this seems to be very a common thing for them!", "pics": null, "resp": {"time": 1602576507155, "text": "Sir you are not even a customer of ours."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108698223108757046173", "name": "Yvette Moss", "time": 1582268363900, "rating": 5.0, "text": "We love these guys! They were very helpful and wanted us to achieve the dream home we were after and never complained about how many times I called! =) I will use then again for other projects if we ever need this type of service!!", "pics": null, "resp": {"time": 1603403258966, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "113035287779586737864", "name": "Jennifer Parent", "time": 1586810129240, "rating": 5.0, "text": "Super helpful with the design and floor plan of my 1500sq foot barndominium style stick built home. Very patient with my multiple requests for desired changes. We are very grateful and would greatly recommend.", "pics": null, "resp": {"time": 1603403251987, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "116938191468292914766", "name": "Kat Lange", "time": 1582038200154, "rating": 5.0, "text": "Our construction plans came in today and I am beyond excited to start working on building our home together! Elaine Roberts Drafters & Designers went above and beyond to make every single edit to our plans and help us design our perfect dream home. If you know anyone needing house plans this is hands down the best people to go to on all aspects, I cannot say enough about how blessed we are to have worked with them for our barndo design!! Thank y’all!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOUZ6QtW5q8qHmwEpmpyBFaH_nP-XwmAcNy1kxW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNI_RPmon2GolG1Egqgd6_TuAoSXGEmpIXj1y2M=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "106692338295826863736", "name": "Kieth Dunn", "time": 1582033489202, "rating": 1.0, "text": "Reading all these bad reviews reminds me of my experience, which has been going on for four months so far with no resolution. I have had all the same difficulties that the others have described and then some....way too may to list here. I cannot express strongly enough how disgusted I am with these people who proclaim christian doctrine in their emails and website. By the way, the good reviews are from the Parker family, which is another name that they go by.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108582921054818107002", "name": "Jaycie Phillips", "time": 1603399902986, "rating": 1.0, "text": "Awful customer service! They will not respond even after payment of house plans!", "pics": null, "resp": {"time": 1603403211775, "text": "I do not believe that you are an actual client, but friends with Derrick Loftis. Mr. Derrick Loftis has been issued a refund per his request, he also received plans/drawings in the past.\n\nThank you\nJimmy Parker"}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109296448497964462244", "name": "Luke Barker", "time": 1602577004200, "rating": 5.0, "text": "Highly recommend Elaine Roberts Drafters and Designers for all your design needs.", "pics": null, "resp": {"time": 1603403236626, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "115541182831429788307", "name": "Barbara Gray", "time": 1575589704428, "rating": 1.0, "text": "I would have to say this is the worst attempt of blueprints I have ever seen. Nothing was to scale, there was no detail information at all, and was not the design we had ask for. Measurements were not all noted. We have had a hard time trying to figure out what we need but thanks to Shaw Building Supply they had to basically redraw in order to estimate the material. These people are not draftsmen at all.  This was just a waste of $1500. I could have drawn this plan better than they attempted to.", "pics": null, "resp": {"time": 1575522527782, "text": "Ms. Gray, I am sorry you were not satisfied with the plans you received from us. You approved the design and layout prior to the completion of the plans. Per our contract you were allowed to make additional changes as you need/wanted. If you had made attempt to reach us over the discrepancy in the plans we would have address and worked with Shaws on any changes or information that was needed. We provide cad files to all building suppliers per there request on a regular basis. None of which was made by Shaws or yourself."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107368239673350922978", "name": "Kelsie Norris", "time": 1602623112965, "rating": 5.0, "text": "Elaine was a pleasure to work with on our recent home designs..", "pics": null, "resp": {"time": 1603403229733, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "100275128980831193854", "name": "Andrew Bales", "time": 1600380460022, "rating": 1.0, "text": "These guys are big no shows! Wasted three or four weeks of my time and did nothing. If you are looking for extra stress, headaches and to p-off your client, then call Elaine Roberts drafting.\n\nREGARDING ELAINE ROBERTS REPLY. That is right I gave you the project told you its urgency and instead of saying \"we are too busy to take on projects\" you said nothing until weeks had passed and my emails went unanswered. This outfit needs to grow up and learn some business ethics.", "pics": null, "resp": {"time": 1575295159871, "text": "Mr. Bales,\nIt is hard for us to be late on a project we were never hired for. We provided us informaton for a quote and timeline for your project. We sent several emails to you and your office for clarification on a few items, all with no response. It is not our fault that your lack of communication caused your client to be upset with you. Nor could would have completed work on your project without the proper go ahead from you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "107978936229458934943", "name": "Creekside Designs", "time": 1527361203504, "rating": 4.0, "text": "We have been working with Jimmy off and on for six months now & he has been very quick and professional. I had to make several changes and Jimmy was prompt and delivered the correct drawings that we needed. I would highly recommend Elaine Roberts Drafters and Designers", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "106448052808753561964", "name": "David Vermeulen", "time": 1578017111810, "rating": 1.0, "text": "We paid a deposit and had a verbal contract to design drawings for permit ready construction plans on 2/3/2019\nI received zero updates from ERD&D, we reached out dozen of times per email & phone only to be given the run around. Actually spoke once with Elaine Roberts herself I believe and still no follow up or follow through. As of today 12/11/2019 we are still waiting on a response or communication of any kind. I called and left a message today, lets see if we get any response\n--------------------------------------------------------------------------------------------------------------------\n\nResponse from the owner 3 weeks ago\nMr. Vermeulen.\nI am sorry that you feel like you slipped though the crack somewhere. We made numerous attempts to contact you thought out the year with no response from you. I will gladly refund your deposit if you would like. Response from the owner 3 weeks ago\n----------------------------------------------------------------------------------------------------------------\n\nAfter leaving a review, an email and voicemail with my contact info on 12/11/19 and requesting a refund, I am still waiting for Elaine Roberts to get back to us.\n2nd request 1/2/20 - Elaine please refund our deposit.", "pics": null, "resp": {"time": 1576074908630, "text": "Mr. Vermeulen.\nI am sorry that you feel like you slipped though the crack somewhere. We made numerous attempts to contact you thought out the year with no response from you. I will gladly refund your deposit if you would like. I will be in touch with you this morning to work out the solution that works best for you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "101763881385564984591", "name": "Christy Leigh", "time": 1554842626084, "rating": 5.0, "text": "They are amazing! Loved the whole process and they made it so easy and wonderful. Very accommodating to all our changes.", "pics": null, "resp": {"time": 1555383687030, "text": "Thank you for the kind words. We enjoyed working with you on your home."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109859671819636961055", "name": "Paul Hines", "time": 1603203267985, "rating": 5.0, "text": "Great people to work with.", "pics": null, "resp": {"time": 1603403223036, "text": "Thank you."}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "108615516573729085777", "name": "Jimmy Parker", "time": 1530038351334, "rating": 5.0, "text": "Great small little design firm. Husband and wife team that works hard on each project. They are not perfect and have flaws but the work and designs they produce are top notch.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "111713600234971474209", "name": "Mark Hamm", "time": 1521645892343, "rating": 4.0, "text": "Great work at a reasonable price.  Having some delays in the delivery of the plans is the only reason for not getting a 5.", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "109043575819100981984", "name": "Nona Muss", "time": 1539501642562, "rating": 1.0, "text": "So last year I found a business on a local small business group Facebook page - Elaine Roberts Drafters and Designers. I paid them a deposit of $250. As of today, the work has not been delivered. It was promised 10 days after payment. As of today, they are 100 days past due. I posted an honest review on their Facebook page, starting off by saying I hoped I could change it to a positive review in the near future. They changed their Facebook template to not allow reviews so mine could no longer be seen. They always say they are working on my plan and they will have something in a few days. Then I don't hear from them and nothing is ever delivered. Their Facebook page has photos they post- and therefore imply that the work depicted is their own. Through reverse photo look up I found photos they had \"lifted\" from other sites and I contacted the owners. Indeed they did not have permission to use the photos and it was not their work. When I tagged the owners in the misused photos they were promptly deleted from the Elaine Roberts drafters Facebook page. One of the owners of the business from which they had plagiarized the photos of others' work, did know Jimmy Parker - one of the owners of Elaine Roberts Drafters. He told me specifics of how the owner (Jimmy) of Elaine Roberts Drafters worked for him previously and had stolen from him, and described him as one of the biggest con-men he has encountered. Perhaps occasionally they deliver a product enough to keep up an image, I don't know, but after my own experience and what I heard from Jimmy Parker's previous employer, I sure wouldn't trust him with my money again!\n\nAlso look at their other reviews. Jimmy and Christy Parker are the husband/wife team that “own/operate’ this business they call Elaine Roberts Drafting and Design. (These are their respective middle names.)  Previously they operated under the name “Creekside Designs.” I guess they had to give up on that name after they accumulated so many bad reviews. You can google it. Anyway, three of the other reviews for this business are from the owners themselves (Christy Parker, Jimmy Parker, and their old business named Creekside Designs. A fourth is from a family member - Sheila Parker. So half of the reviews contributing to their “4.1” rating are ones THEY CREATED RATING THEMSELVES! They did the same thing on Yelp until I reported them and Yelp notified me they had removed those reviews because they violated their terms.", "pics": null, "resp": {"time": 1520985386952, "text": "Mrs. Hall,\nI am terribly sorry for the poor customer service that we provided.  We are not scammers, crooks, or anything of that nature.  We simply took on to much work at one time. It is not an excuse but we are still learning how to deal with our blessing of growing pains.  We are human and make mistakes.   I am terribly sorry that your project fell through the cracks.  In regards to your refund we asked for a mailing address to process you refund and I have not yet received it.\n\nAgain we are sincerely sorry for the poor customer service and wish you all the best in the future.\nRespectfully,\nChristy Parker"}, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "117275097344007566653", "name": "Christy Parker", "time": 1576361452991, "rating": 5.0, "text": "The team at Elaine Roberts is very professional and there work is top notch", "pics": null, "resp": null, "gmap_id": "0x8889d1d2854ae819:0xa8f8546c5fbb10e7"}
{"user_id": "105622862154281004327", "name": "Susan Johnson", "time": 1575490011057, "rating": 5.0, "text": "I am so glad to have found this place to print my large format patterns. They take all kinds of print orders. They’re fast, the prints are of great quality and the price is affordable! They’re a great bunch of people too. They are the best kept secret in Mobile! Thank you guys!", "pics": null, "resp": null, "gmap_id": "0x889a4cff6df41d91:0xff8f9cd415e1c2a7"}
{"user_id": "110998298399222781991", "name": "Robert Peterson", "time": 1546518155279, "rating": 5.0, "text": "Knowledgeable, friendly people with integrity.  Only locally owned shop in the area.  Great fast service!", "pics": null, "resp": null, "gmap_id": "0x889a4cff6df41d91:0xff8f9cd415e1c2a7"}
{"user_id": "104555613191518730912", "name": "John Petersen", "time": 1502816394661, "rating": 5.0, "text": "good pricing but excellent customer service!!!", "pics": null, "resp": null, "gmap_id": "0x889a4cff6df41d91:0xff8f9cd415e1c2a7"}
{"user_id": "118245182859355352266", "name": "Jinefor Taleton", "time": 1495666132290, "rating": 4.0, "text": "What a wonderful place ‼️", "pics": null, "resp": null, "gmap_id": "0x889a4cff6df41d91:0xff8f9cd415e1c2a7"}
{"user_id": "118226834310070090372", "name": "Sable Marston", "time": 1616096518026, "rating": 5.0, "text": "Grace was amazing to work with! Very professional, and great creativity went towards our project request! I would recommend them again!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108201553788060631812", "name": "Cecelia Asberry", "time": 1618960350031, "rating": 5.0, "text": "Helpful and kind people. Ready to help your shipping needs through FedEx.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "104097605628754816777", "name": "Crystal Bailey", "time": 1620240714116, "rating": 5.0, "text": "My number 1 place for all my organization personalized needs, great service and friendly staff!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "112584179374515529130", "name": "Tony Smith", "time": 1612545719352, "rating": 2.0, "text": "I have used The Plot Shop in Daphne for dropping off my FedEx packages several times but recently come across a rude young man behind the counter. He seemed a bit entitled and above helping me with my request. I barely ever leave reviews but this felt like it should be addressed. Customer service has gone downhill in the past several weeks no doubt. Hope customer service gets back on track.", "pics": null, "resp": {"time": 1612550509322, "text": "So sorry to hear of your experience! Please call the shop & ask for the manager so I can fully understand what happened & make it better! We don't have record of purchases under your name so would appreciate your time to let us know what service you have received from us in the past."}, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "103143961733238989245", "name": "Tensawlakerunner", "time": 1612296612925, "rating": 1.0, "text": "I place a call to them and asked could they ship my uverse equipment back.. I told them I had shipping label....they said they could no problem. so after a 30 mile drive when I got there... they said it could not be shipped", "pics": null, "resp": {"time": 1612288115304, "text": "Please let us know why there was 1 star review so we can improve!"}, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "118372879005998032714", "name": "Bridgette Hill", "time": 1606239192118, "rating": 5.0, "text": "Today I had some packages to send off through FedEx, a nightmare because my ink was too light. Daniel Bertagnolli was so patient in helping me get the labels done. It should have been an easy technology task but oh no, I'll say my computer was not wanting to cooperate but I'm sure it was probably operator error lol! Thank you, thank you Daniel for being so patient and understanding with me today.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "115449505856744315265", "name": "garrett cox", "time": 1612827549974, "rating": 5.0, "text": "Great experience every time I come to the plot shop. The workers are excellent.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "116642314849585408962", "name": "Gabe Gonzalez", "time": 1605720239401, "rating": 5.0, "text": "Everyone is very nice and super helpful.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102694171092648940942", "name": "dianne bernasconi", "time": 1500557240301, "rating": 5.0, "text": "In the past I used Plot Shop for my house plans.  This year, after meeting with Julie, I found a new great use!  I am an avid sewer.  I often order patterns online.  Instead of taping together 25 pieces of paper to make the pattern, I send the files to Julie and my patterns are printed on the large format paper.  Plot shop is efficient, well priced, and easy to work with!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "100361363644659820807", "name": "cheryl johnson", "time": 1499734274949, "rating": 5.0, "text": "Truly grateful for this business which is extremely convenient for me to frequent. This team provides the ultimate customer service with a contagious attitude.  I bet you would have a good experience if you visited THE PLOT SHOP.  Check it out soon!\nCheryl S. Johnson", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108862083814163193279", "name": "joe hurd", "time": 1499738255021, "rating": 5.0, "text": "Laura and her staff are superb professionals that go above and beyond to make each customer feel special. Their turnaround time on blueprints is amazing. It's always a pleasure doing business with The Plot Shop. It's my go to, one stop, shop.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "114796316661742113647", "name": "Firej6460", "time": 1499721545773, "rating": 5.0, "text": "Super friendly staff and really fast turn around times. Great prices too. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "110560678539813251609", "name": "Dexter Curry", "time": 1498592176404, "rating": 5.0, "text": "Laura and her staff are the best! I have been going to the Plot Shop for my printing needs for 10+ years. They know me (and my family) by name and are always a pleasure to do business with.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "115990197552452325065", "name": "Simmie Yarborough", "time": 1570554188156, "rating": 5.0, "text": "Super SUPER nice people!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "101152165329252335299", "name": "Becky Whiteside", "time": 1500475653203, "rating": 5.0, "text": "Great personal service and professional staff that provide high quality large document printing in a timely manner.  Works with the customer to provide desired artistic reproductions and documentation.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108206602411194150261", "name": "Daphne Stainbrook", "time": 1572528090568, "rating": 5.0, "text": "Awesome experience! Fast, friendly service!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109405513757014622141", "name": "Tyler Horton", "time": 1548198464856, "rating": 5.0, "text": "Every time I visit, they’re always courteous and professional. I’d recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "110959842379632018615", "name": "Jennifer Farlow", "time": 1533864610102, "rating": 5.0, "text": "We always receive excellent and fast service. Our orders are always correct.  The staff is always friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "106812646897319878864", "name": "Patrick McNellage", "time": 1500478823709, "rating": 5.0, "text": "Fast, friendly, and easy.  We use The Plot Shop for our business and we know we can count on them to get our work done in a fast and efficient way.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107342085872270006464", "name": "Brian Donelson", "time": 1555097692361, "rating": 5.0, "text": "Great customer service - I would definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "117196197927978829943", "name": "Lauren Arington", "time": 1500472851856, "rating": 5.0, "text": "The Plot Shop makes my job easier. They can handle anything, and everything! They have a convenient location, and a very knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "101635032099896825910", "name": "Logan Robinson", "time": 1598465648597, "rating": 5.0, "text": "A awesome store", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "100083643519971243458", "name": "Becky Lentz", "time": 1500477526989, "rating": 5.0, "text": "Laura and her staff have always been so helpful and courteous.  I will recommend The Plot Shop to anyone and just want to say Thank You for all you do.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102822235855218646771", "name": "Karla Mason", "time": 1497459063807, "rating": 5.0, "text": "Great service,  quick and easy. In my experience they were very helpful,  I would definitely recommend it.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109525179512976524447", "name": "Michelle Langley", "time": 1500479781388, "rating": 5.0, "text": "Such a pleasure to deal with!  Always has stuff ready when you need it, and will go the extra mile for you.  Wouldn't go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "115952594432401139353", "name": "Randy Crocker", "time": 1500503573803, "rating": 5.0, "text": "The Plot Shop is the best place for your printing needs. Great service and a wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "111839397626664674177", "name": "Pam Curry", "time": 1499717405220, "rating": 5.0, "text": "Laura and Staff are super friendly, professional and take care of our needs in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "104122808007802038608", "name": "Deidra Dueitt", "time": 1507558301423, "rating": 5.0, "text": "Laura is the best.  Staff is wonderful and all are very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "100425708489393795711", "name": "Ruddmaster kirktnt@centurylink.net", "time": 1499745897331, "rating": 5.0, "text": "I have been a client of the plot shop now for well over 10 years. The Team and thier leader Laura, are at the top of the service industry.\nFriendly, quick turn arounds, knowledgable, staff. Printing needs on any level. Plans can be printed same day if needed, or within a few hours for a walk in turn out emergency need. They are high quality bounded edge prints. There's no place I rather do business with that the plot shop in Daphne,\nFor my business needs. Great job to Laura and her Team. Thanks for 10 great years.\nSincerely,\nKirk Thomas\nk.a.t Designs Inc.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109816014716310510842", "name": "Jim Smith", "time": 1499720669625, "rating": 5.0, "text": "Best customer service anywhere!!!  Knowledgeable staff and smiling faces.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107978154272017999342", "name": "Wanda Houston", "time": 1599844675507, "rating": 5.0, "text": "Great to have", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107886442678411213560", "name": "Daniel Wagner", "time": 1470165492410, "rating": 5.0, "text": "Quick and easy drop off. Will be coming back in the future.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "111755415063618219939", "name": "Amy Brown", "time": 1499782246172, "rating": 5.0, "text": "Great service!   Very quick turn around!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "117490914467863309813", "name": "K.T. Thornton Icons Sport Mobile Region Media", "time": 1531345667155, "rating": 5.0, "text": "They are awesome and have great prices! Check them out!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "108126427130815183911", "name": "Lene Legrone", "time": 1501027576351, "rating": 5.0, "text": "Need to mail package, need to get there in a hurry? Our local FedEx can get there for you.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "116675815643794483268", "name": "Kenny Marmar", "time": 1546541063921, "rating": 5.0, "text": "Great people,everything went well,thank you all", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "111627690934526997298", "name": "David Lindsey", "time": 1500474164545, "rating": 5.0, "text": "The Plot Shop staff are not only nice to me, but to everyone that comes into their business.  Always one of the bright spots in my day.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102155597352811376235", "name": "Boise BMDMILTON", "time": 1500661020823, "rating": 5.0, "text": "These guys are great! ...and they're prices too!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109144599423611958127", "name": "Miyuki F.", "time": 1502290788138, "rating": 5.0, "text": "Friendliest owner ever!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102632414601158435958", "name": "Good Citizen (Good Citizen)", "time": 1531706297578, "rating": 5.0, "text": "Very convenient.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "105142050938273994298", "name": "Fred Butler", "time": 1506518148834, "rating": 5.0, "text": "Fast service", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "113228339283766094318", "name": "C.C. Long", "time": 1500570628915, "rating": 5.0, "text": "Awesome customer service", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "107725480381763351929", "name": "Jeff Windham", "time": 1499715997038, "rating": 5.0, "text": "Fantastic personalized service!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "104555613191518730912", "name": "John Petersen", "time": 1498592547148, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "109269707208110694985", "name": "Randal Rocker", "time": 1471951908827, "rating": 3.0, "text": "The place doesn't have a sign up to notice it but the gps is correct, turn on and go to the front parking lot.", "pics": null, "resp": null, "gmap_id": "0x889a421e4a488535:0xd2d19dbe2c32d223"}
{"user_id": "102780644021638631749", "name": "Red Beard", "time": 1598459086555, "rating": 5.0, "text": "My go to place for copies and laminating.  You cannot do better than this guy.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "103538778209738568808", "name": "Timothy Townsend", "time": 1576857065154, "rating": 5.0, "text": "They do a lot of work for my business.  Exceptionally nice people, and are reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "113378398045060468241", "name": "Shallazar", "time": 1570568050270, "rating": 5.0, "text": "I had 50 missing cat flyers printed and was not charged due to kindness. They are nice people there.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "112051559563058676196", "name": "Dennis Mynatt", "time": 1525361678411, "rating": 5.0, "text": "I always enjoy visiting Copy World for my office printouts. Affordable prices, prompt turnover time on orders, and great customer service have kept us happy customers of Copy World", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "117830929214078936531", "name": "River City Roofing Solutions", "time": 1579635250794, "rating": 5.0, "text": "Fast friendly service.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "104144378418079452571", "name": "Michael Hamilton", "time": 1473181472461, "rating": 5.0, "text": "The staff is very friendly and professional! They are reasonably priced, centrally located on 6th ave across from subway. This is the only place I will go get my work done as far as printing!", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "109629364138304967729", "name": "Zakaria Jamal", "time": 1530654623377, "rating": 5.0, "text": "very professional .i called on the phone.sent them my documents before i came to the store.i found them ready. the lady that was on the phone was very nice and patient .\ni highly recommend this store", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
