{"user_id": "115043355422474242759", "name": "Andrew Nuckols", "time": 1625769336235, "rating": 5.0, "text": "Honest Mechanics that know their stuff. May not be the cheapest but you absolutely get what you pay for. Job is always done right the first time.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "107861465996015858272", "name": "Tiffany Alexander", "time": 1500835892659, "rating": 5.0, "text": "Great place to get your car fixed, or get a  performance modifications especially if you have a German or Asian car, they specialize in Porsche and BMW", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOPnjvY-fHk64MAiGumahSrA2KGrKv_esA6v6kE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2j17vikcNIvgfA_2uswIJSkzFNY07X-OwPpJc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcCspFVVMzNGVEUhvDqTqtc815Deb38-91-nAi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTsXcbuN6GRJ2cikUKZvNo1888rIRVB6pPPO16=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "102793911254239446671", "name": "Clint Fillingim", "time": 1606401068678, "rating": 5.0, "text": "Awesome service! Was driving through the area and these guys went above and beyond to take care of me. Would highly recommend, they are very knowledgeable.", "pics": null, "resp": {"time": 1606487549506, "text": "Thanks for the review Clint. Glad to help"}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "110289588658253797314", "name": "Alton Hill", "time": 1605053713284, "rating": 1.0, "text": "Terrible experience they try to rip you off depending on what you know about parts I’ll rather take my Porsche to Porsche of Birmingham instead rip offs!!", "pics": null, "resp": {"time": 1615215420873, "text": "I do not have a record of ever doing business with you."}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "113519031964328627121", "name": "David O'shea WOODRUFF", "time": 1582406387842, "rating": 5.0, "text": "Need your classic Porche repaired or restored? Then, look no further.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "114616615027763617158", "name": "NIckSellsCars Bham", "time": 1520353029425, "rating": 5.0, "text": "Took my 911 here a while back for some preventive maintenance (and some needed) and they took fantastic care of the car. They upgraded the IMS and a myriad of other known weak points in these cars, as well as gave it a new clutch. Top notch work in a laid back environment.", "pics": null, "resp": {"time": 1520356803624, "text": "Thank You! We appreciate your review"}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "110334569985586804046", "name": "Jekyll H", "time": 1607974390289, "rating": 5.0, "text": "Good job guys!", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "107563204725036923852", "name": "Jessica Rogers", "time": 1561673974293, "rating": 5.0, "text": "Place is great. The guys are very friendly. Always a pleasure", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "101333392980680016561", "name": "Randy James", "time": 1449517426043, "rating": 5.0, "text": "I purchased a 2006 Porsche Carrera S (997) earlier this year in Atlanta. I drove it to Birmingham to have Eurasian perform a pre-purchase inspection. They were very thorough and answered any and all questions I had for them. They put my mind at ease as to a couple of issues. I purchased the car and I have continued to use Eurasian for my service needs even though I live in Montgomery. All of the guys are excellent technicians and mechanics. I give them two thumbs up!", "pics": null, "resp": {"time": 1449789412263, "text": "Thanks Randy !!\nWe really appreciate you business and look forward to seeing you in the future.\nCasey"}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "115401493223725355923", "name": "Bert Ellis", "time": 1476967672060, "rating": 5.0, "text": "These guys are the best.   Austin, Casey, and Devin are competent, enthusiastic, honest, and friendly.    I highly recommend them for anything your Euro / Asian car wants or needs.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "112651661697691180519", "name": "Ty Hottel", "time": 1408902864207, "rating": 5.0, "text": "Knowledgeable people and reasonable pricing. Don't be put off by the non-descript appearance on the outside. It's like a Porsche toy store inside", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "113857458025046541931", "name": "Joseph Lathem", "time": 1476728424551, "rating": 5.0, "text": "These guys have integrity, knowledge, and competent skill. I highly recommend them and look forward to using their services in the future.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "112635696426496015807", "name": "Corey Crowe", "time": 1573070318728, "rating": 5.0, "text": "Great work on my Porsche", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "101165565782576882273", "name": "Andre' Greenwood", "time": 1409679189651, "rating": 5.0, "text": "Real advice you can trust and service second to none. Keep up the great work guys!", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "105244773759432642643", "name": "Frank Samuelson", "time": 1493259543510, "rating": 5.0, "text": "Fantastic Porsche experts!  Extremely knowledgeable and professional.", "pics": null, "resp": {"time": 1493382728953, "text": "Thanks Frank! Much appreciated."}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "117359251825971223489", "name": "Euge", "time": 1424965888358, "rating": 5.0, "text": "I live in Wisconsin and found a car in Alabama I wanted to buy. A friend recommended Eurasian Auto to do the PPI so I gave them a call. I spoke with Devin, who also did the PPI. Devin was very helpful in explaining the PPI process and covering what they look for. Fast forward a couple days, and I got a call from Devin and he talked me through everything they had found with the car. After having them look over the car I'm flying down to buy it this weekend with no fears whatsoever.\n\nIf you need a PPI or need work done to your vehicle, I feel like this shop is honest and does thorough work.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "107118653345836586141", "name": "Tiffany Alexander", "time": 1408903638960, "rating": 5.0, "text": "Great, friendly,  professional, and they provide honest care of one of my prized possessions", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "112150632740979804082", "name": "josh crawford", "time": 1624466367134, "rating": 5.0, "text": "I visited 4 different lots then ended up coming back to the very first one (stallions) for my car. They have some of the cheapest prices in Birmingham and the car buying process was super easy. Samir was very friendly and let me test drive until I found the car I wanted. Mrs.Audra was eager to help inside and paperwork was done in no time. Would definitely recommend", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114579636425080695488", "name": "Kelly Ballam", "time": 1616462276008, "rating": 5.0, "text": "Rakan was very friendly and very helpful. The process of buying my car went very smooth and was a pleasant experience all around.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMI74YSHI4eREYvnQHxTtb11hz2u9ytpOO2vDnk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112790379382707159145", "name": "kr", "time": 1620346089025, "rating": 5.0, "text": "I needed a reliable car for a decent price. I looked online and found stallions auto and knew immediately where I needed to go.\n\nI test drove any car I wanted and was able to come to a decision in under an hour. a good selection of cars, all constantly being detailed. I left the lot with a car newer than I expected and well under budget. I highly recommend this business!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105087236777064509136", "name": "Larry Smitherman", "time": 1557464200839, "rating": 5.0, "text": "Just like any other father, I was very scared and hesitant in shopping for a car for my upcoming 16 year old, I mean who wouldn’t? I want to make sure I put my kid in a safe and reliable vehicle. Upon arriving to the dealership (which is not a fancy dealership by any means) I saw the vehicle that we had seen on this dealerships partner advertising site. Moments later I walked up to the office and met the person that I had originally spoke with on the phone, Lee. He made me feel at home and welcomed me in a polite manner. No pushy sales person mentality here. Very straight forward and comfortable atmosphere. I test drove the vehicle, liked it. It’s a used car and I don’t expect perfect for $6K. Needless to say, the 2012 Rogue with 120k was the perfect buy. AWESOME! Will be back and will recommend you to friends and relatives in the area, cheers.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9EpjUavPdcG2TvBdC0C7Kj6-H5PdDqQa8PKhr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110652951409821960752", "name": "Amos Sunday", "time": 1624535822465, "rating": 1.0, "text": "They are scammers. I bought a car for over $10,000.00. Check engine light came on before I made it home. I called them 3 times to discuss options. Each time they said they would call me back. (Never did) . I suggest only buying cars from here if you have had them fully checked out by a mechanic or if they still have a warranty.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107615754153957842074", "name": "Nick R", "time": 1615524635083, "rating": 5.0, "text": "The best used car buying experience my family and I have ever had. I was a student looking for an inexpensive user car and they had tons of options. Found the perfect car and got a fair price and drove it home that day. These guys are great and were honest with me from start to finish. I’ve had this car for about a week now and no problems it’s been a great ride. 5/5 stars, Stallion Autos is the way to go!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112688614385931780476", "name": "kat osborne", "time": 1614980949562, "rating": 5.0, "text": "It’s really hard to find great quality, prices and customer service in today’s world of car shopping! I hit pay dirt with these guys!!! The office manager, putting it mildly because she can do any job there, Audra was down home pleasant and eager to help! Lee was helpful and courteous!! Our family is planning another purchase and we will give Stallions our business!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103720676785866893107", "name": "Calvin Jenkins", "time": 1619299757529, "rating": 5.0, "text": "Very easy. Friendly. Well mannered staff. Professional. They knew they’re inventory by heart. A wide variety of vehicles. I was very impressed and pleased with my purchase. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104099598367036383258", "name": "adam ledbetter", "time": 1613701220209, "rating": 5.0, "text": "Very nice group of people here! Reasonable prices and they still worked with me on an out the door price. Paid cash and completed the transaction in under 20 minutes. Highly recommend going here if you are looking for a good used car. Very large selection.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112505894827810042486", "name": "dward eagle", "time": 1612212661980, "rating": 5.0, "text": "This place was great. We drove an hour to test drive a car and turned out to be a good first car for my daughter. Everyone was nice and not pushy like the normal used car places. Process of purchase was quick and easy. We will def be coming back when looking for a vehicle!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103459942685287554976", "name": "Lori Mckoy", "time": 1614969640068, "rating": 1.0, "text": "I bought a 2010 Toyota Prius for my teenage daughter there. When I asked, the salesman if the car was in good condition, he said the car was in great condition. Since buying it not quite 2 months ago I’ve had to spend almost $1,000 after buying it for 5,000.  I would not recommend Stallions to anyone. I called after the first repair asking if I could just return it for a refund and was told no. So that shows they don’t stand behind the quality of the cars they sell.", "pics": null, "resp": {"time": 1615015256630, "text": "- [ ] Hey Ms.  Lori. My friend just  bought a brand new Maserati. Only been a few months and he’s having to do some repairs. Few thousand dollar repairs. I’m not sure what the problem was with your car but we could have helped you by sending you somewhere to get a better price. But every car will eventually need something fixed.  Parts get worn out and go bad. It’s normal."}, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113465992268863135953", "name": "Lamar King", "time": 1617256504474, "rating": 5.0, "text": "Did not purchase a car but I thought I should review the great customer service .Ronza was very polite , understanding, and committed to her work .she was great at explaining everything to us. Great customer service is hard to find, but you can find it here.I highly recommend anyone to her and Stallions Auto for your next car purchases.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109446701247085096854", "name": "Chris Banks", "time": 1615422192712, "rating": 5.0, "text": "Great people great cars you want find anywhere else.. quick service I was in and out in a flash... I will go back and recommend them to new buyers", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104597224939786278021", "name": "Jessica Hennington", "time": 1610749052501, "rating": 5.0, "text": "This was the calmest shopping experience I’ve ever had. I was happy to purchase my Kia from here as a new mom my number one goal was a safe and reliable vehicle. Lee and Alex knew my needs and went above and beyond to make sure they were all met. Mrs. Audra in the office was extremely polite and patient with all of my questions during the paperwork process. I would definitely recommend buying a car from here!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107144220610284040474", "name": "Ran Cedriq Washington Sr.", "time": 1614290480787, "rating": 5.0, "text": "My son, Ronald Washington bought a car from this company in November of 2020 and it had NO PROBLEMS safe out runs GREAT. My wife and I are ooking forward to going and purchasing a BMW sometime soon. A great company to purchase from! We'll do more business with Stallions!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117209473438117280714", "name": "Cyndi Bonner", "time": 1624107166361, "rating": 1.0, "text": "Do not finance your car through this company.   They will repo your car if one payment is late and cost you thousands of dollars to get your car back.   You have been warned!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111273549006685092832", "name": "Kimberly C Nunn-Washington", "time": 1614291222110, "rating": 5.0, "text": "My son, Ronald Washington bought a car from this company in November of 2020 and it had NO PROBLEMS safe out runs GREAT. My husband and I are ooking forward to going and purchasing a BMW sometime soon. A great company to purchase from! We'll do more business with Stallions!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "118295914834234723125", "name": "Jessica Alnemer", "time": 1617325852735, "rating": 5.0, "text": "the workers inside the office are very polite and they help you get answers to all of your questions. very easy to communicate with. affordable prices. rakan and laith are very professional, helpful people. would recommend.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116419639473892880184", "name": "Muhammed", "time": 1606598053915, "rating": 5.0, "text": "Stallions was awesome. The customer service was impeccable. They helped me find the perfect fit for me and my wife. We both financed our vehicles from stallions, and have shopped with them over the past ten years with amazing service. I currently drive a Toyota solara, while my wife drives a Toyota Camry- both of which exceeded our expectations. Would recommend to shop all your auto vehicles from this spot", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104642239650398912373", "name": "Alex Paquette", "time": 1611359491252, "rating": 5.0, "text": "My experience with stallions was great. Jessica helped me with every step of the buying process from finding the vehicle to getting my paperwork done. It was the easiest car buying experience I've had", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109686716466561749957", "name": "Darkness X", "time": 1614291153720, "rating": 5.0, "text": "Ronald Washington whom is my brother came home with this fresh new car from this company last year in November. It's so clean and he won't let us eat in it!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100632863728978108776", "name": "Kenitra Young", "time": 1614373848955, "rating": 5.0, "text": "Mr.Lee has been a great salesman ., I’ve purchased a Sequoia Toyota 2005 and he has good running cars . I truly would recommend any other person to him . I Thank him so much for his service .", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105495775091729340257", "name": "MADD Boom", "time": 1620504934726, "rating": 5.0, "text": "Great people really helpful n they care .", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100060591705420238590", "name": "William Beaty", "time": 1598728208419, "rating": 5.0, "text": "These guys are awesome! Family owned and operated. 19 years here. They know the area. They gave us an amazing price, and negotiated fairly with us. They are all about building relationships, and establishing their reputation as an honest business contributing to our community.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116859492972504268416", "name": "Tez Finley", "time": 1614441793260, "rating": 5.0, "text": "Variety. Quality. Affordable. Good business. Recommend", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104234580216581879819", "name": "Pete Zane", "time": 1606855892778, "rating": 5.0, "text": "Spectacular experience every time since 2014. Thanks. Keep up the good work. I always send people looking for a vehicle your way because y’all always done me right", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106418862282581305419", "name": "Johnathan Washington", "time": 1614291653707, "rating": 5.0, "text": "Man.. My brother Ron WASHINGTON bought a Passat and it looked better than mine! I bought mines before he bought his! My got scratches on it cause I bought it out of BIRMINGHAM but I should've waited for him before I got mine. How was also CHEAPER THAN MINE! UMM GON'T but my next car from Stallions cause I see EVERYBODY IN my town, riding wit a Stallions tag on they cars.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109109243667965765821", "name": "Maya Nelson", "time": 1605039588348, "rating": 5.0, "text": "This place was awesome! Lee was very helpful and informative of whatever questions I had even when I felt like I was asking too many. Would definitely recommend y’all!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108648396411112079708", "name": "James Holeman", "time": 1606965169487, "rating": 5.0, "text": "Happy to leave a 5 star for this place. Visited 3 lots and ended up back where I started. Price won me over. Thanks Lee", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100026762317609042273", "name": "Bethany Beaty", "time": 1598728230803, "rating": 5.0, "text": "We had a great experience at Stallions Auto! We found the listing online, test drove it, and took it to a mechanic for pre-purchase inspection. The price was so great that no negotiation was even needed! Once we decided to buy, we had papers signed in 10 minutes. Great hassle free experience!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115939034885643871869", "name": "jeremy lane", "time": 1594482396414, "rating": 5.0, "text": "This was my second stop. I spoke with Lee and he was super upfront about the vehicle I was inquiring about. Gave me the run down on what it needed and what was almost due as far as maintenance. I enjoyed the straight forwardness and which I had put a deposit down to hold the vehicle. I chose to go look at one more car lot and take my chance, by time I chose to do business with Lee the vehicle I initially wanted was sold. I explored more options and ended up in a 2013 Toyota Camry Le. Paid cash, was provided a Carfax and went on my way. Easy short and sweet.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116506181559749378738", "name": "Hun Lui", "time": 1594000491019, "rating": 5.0, "text": "I found exactly what I was looking for at Stallions Auto. A good dependable reasonably priced automobile for my daughter. They had such an incredible selection of vehicles at the price range I was looking for. When in search for a used car I don’t expect a PERFECT used car, I am reasonable and I think they were more than reasonable with me. Answered all my questions, showed me the Carfax and had me on my way in about 25 minutes. Will definitely be a repeat customer thanks to the excellent customer service and pricing.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114032727713011975716", "name": "Tonya Henson", "time": 1600377863283, "rating": 5.0, "text": "New to area and luckily found these guys! Took the nerves away and prices I can afford!! Very customer service oriented and Audra was super helpful!! Rick and Lee so sweet", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113903102084528628354", "name": "Marcus Brown", "time": 1594000859359, "rating": 5.0, "text": "I am going to give these folks a high five ! What a pleasant experience. Very friendly, effeciant, and honest. I felt very comfortable in my decision. I know it is an unfamiliar time with what is going on around us. We planned ahead. I applied for credit and spoke with Lee. It was so simple and what a great deal !. Everyone was wearing a mask and being observant of caution. I was literally only there for an hour ! My purchase / completion of paperwork maybe took 30 minutes ! What an awesome experience and a great car !\nMini Countryman S...I am in love", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112825742290696556175", "name": "Gerica Cammack", "time": 1609977597491, "rating": 5.0, "text": "This is the 1st place I've came across that do layaway. This is a good way to earn someone's business.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110037611933999919623", "name": "Robert Joe", "time": 1605379499485, "rating": 5.0, "text": "Lee was great. Not a fancy dealership but cars are priced very fairly and great selection of vehicles for cheap. Drove of the lot in my brand new Altima in no time!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101111660244164415097", "name": "rolando antonio", "time": 1592001867617, "rating": 5.0, "text": "my sister told me about this place after she bought her car, she said they have good deals. i saw good reviews online so i got a car for my son. car is running good no issues. good business. good prices", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116403843373529519939", "name": "crane industries LLC", "time": 1590259328720, "rating": 5.0, "text": "Bought a company sales delivery automobile from Lee and I was very content with the value and price. Paid cash money and was presented true straight forward information in regards to condition and history. Came with good tires and body looked fair for the price. Happy man overall. I will recommend you", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109932577279112955193", "name": "Jackie Olson", "time": 1593467403558, "rating": 5.0, "text": "I went to stallions because they had great deals and My credit is not great and no where would finance me. They also have good quality cars my mom told me about them after I ran all around town. Thank you Rick and everyone at stallion see y’all in 2 weeks", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105317351572591204074", "name": "Samuel London", "time": 1599087878343, "rating": 5.0, "text": "This is my second time purchasing. Great  experience and not to forget to mention how awesome their customer service is. Make sure to ask for Rakan or Lee, very helpful!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114930002559992688239", "name": "Jarrod Jones", "time": 1588483773453, "rating": 5.0, "text": "Very well. Nicely put together package. They fit well with what we were looking for. Honest, trust worthy, upfront people. Very “unsalesman” like. Pointed me in the direction of which  3 vehicle to narrow my search down. Listed pros and cons on each and was very enlightened on his knowledge of his vehicles. Will definitely buy another in the future (hopefully not anytime soon)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102631686684123622177", "name": "Gina Portobello", "time": 1592428051191, "rating": 5.0, "text": "Amazing service. One stop shop. Did my financing on one car through them without checking my credit and bought another one cash. I was also referred to a upholstery store to  take my aunts car that needs seats repaired. All in all I’m beyond satisfied. Thank y’all", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108763648592851928466", "name": "Ronza Alnemer", "time": 1592066480554, "rating": 5.0, "text": "Everything went smoother than expected. I would recommend them to anyone looking or needing a good dealership..... Lee was very considerate and courteous and extremely helpful  He will help you with everything you need He is very professional...I would recommend any one to him!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103519808544546077864", "name": "Alexa Naiomi", "time": 1615323660240, "rating": 5.0, "text": "Just got my Infiniti from Rick at stallions. Y’all go see him. I went to 4 dealers before I went there and no one wanted to sell me a car but he did. Thank you", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101004178483303409400", "name": "Jill Crenshaw", "time": 1594482383193, "rating": 5.0, "text": "My go to car guys for 6 years now. They got me 3 different cars that I asked them to find. I’m thankful to know some people like them in the car business because I got screwed when I lived in Florida! So I appreciate you", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109193210076701376656", "name": "Dj Simmerton", "time": 1580426619541, "rating": 5.0, "text": "Made a drive out to see the vehicle my daughter wanted, they were very nice over the phone as well as in person. Drove back and have kept us with my services since then, no problem at all what so ever with the way they handled our procedure! Very hands on and quick, we appreciated the conversation! Good place to conduct a cash sale (We looked) - Thank you Lee", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114313955194913722717", "name": "John Kennedy", "time": 1614990669544, "rating": 5.0, "text": "Great selection and very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103988780056698872221", "name": "Samir Huneidi", "time": 1591080627105, "rating": 5.0, "text": "10/10. Great selection of vehicles at fair prices with a fantastic staff. Everything was very straightforward and I got my car and the paperwork done In no time. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104828462970355187487", "name": "Darryl Little", "time": 1581628274998, "rating": 5.0, "text": "Man y’all were all so good to me and my family and just want to take time out our day to say thank you in a few ways. We’ll be bringing all your employees lunch next week. We went to a few other places and no one treated us the way y’all did or did half of the things y’all did. THANK YOU! We love our cars from y’all", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103608063866390807869", "name": "Tyler Rose", "time": 1596227397449, "rating": 5.0, "text": "Stallions has helped my family out so much man. We can’t say thank you enough. I appreciate y’all. Great customer service", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101869882247231206410", "name": "Northernhighlandgourmet Gourmetfeast", "time": 1583304710246, "rating": 5.0, "text": "The guy with the short hair and a beard helped me significantly. Not only in my car buying process, but also in recommending me a place to upkeep my Porsche! Good cash deals. Good smooth transaction. Straight to the point. I’m the type of person that likes someone to shoot me straight! Thanks", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114954525864752220423", "name": "Freddie Percy", "time": 1592428014150, "rating": 5.0, "text": "5 stars. Ask for Lee. Straight forward dude. I wanted a good price for a dependable vehicle. An overpriced car at a “fancy” dealership was not what I was in search of. Stallions did the job for me. Thanks guy", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105926788475315470187", "name": "Jose Terrado", "time": 1603510829446, "rating": 5.0, "text": "Came to look at a Prius that I saw on Cars.com, I liked the way it handled. I didn’t end up buying the Prius but I bought a Jetta. Enjoyed working with these folks. (5 weeks ago)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112652767672866861063", "name": "Nicholas Cole", "time": 1583281262971, "rating": 5.0, "text": "I was very impressed with their inventory and their customer service. all the cars I inquired about were priced well under book value. Lady that picked up the phone had great customer service skills. My wife is happy. So I’m a Happy customer", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105890608066285277067", "name": "Debbie McAlister", "time": 1582250320594, "rating": 5.0, "text": "I loved my whole experience. I got a great deal because I was coming with straight cash.  Lady was nice and informative over the phone. Highly recommend this business. Many great reviews. A++", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111069281053716598822", "name": "Lorie Smitherman", "time": 1590719598849, "rating": 5.0, "text": "Straight forward. I don’t like car shopping for weeks, they make it easy. Not forceful and pushy. Liked the bluntness and I appreciate a straight forward person more than anything. Lee gave me the down payments and review the paper work with me in no time. Was a happy and satisfied customer", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111326529731832753584", "name": "Anna Lawson", "time": 1590259522223, "rating": 5.0, "text": "I am so freaking happy I finally got the car I wanted and it was in our budget. I’ve been looking for 3 weeks and the Volkswagens all were all priced more than what I had. I found one at Stallions with lower miles and even cheaper. I was in shock. Thank you Rick me and my family loved working with you and your workplace.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114999433304940003087", "name": "mike clemens", "time": 1606343759927, "rating": 5.0, "text": "nice selection. under book value. carfax on all", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113710971735662521504", "name": "Tony Alaraj", "time": 1591929691830, "rating": 5.0, "text": "The cash deals I found at Stallions were unmatchable in the area. Lee answered all my questions, showed me the vehicle history and was straight up with me. I did not need any credit and I was a cash buyer. Very well mannered sales people.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104298314633089441447", "name": "cleandria kennedy", "time": 1587038917385, "rating": 5.0, "text": "Literally the best experience! Beautiful family, very professional and trustworthy! Thank you guys, I don’t think I would have found a better deal! If you don’t know where to start, start here, you will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106723074829771857280", "name": "Ricky Bailey", "time": 1596563293651, "rating": 5.0, "text": "I found a few vehicles I liked after I searched other dealers for a long time. Prices were way below the other local dealers. I respect their way of operating. Thank you for your time and business", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101333494008706294900", "name": "sharlay gibson", "time": 1585690341162, "rating": 5.0, "text": "Talked to them on the phone and set up a time to go in for a test drive, car was in excellent condition, they faxed my bank all the paper work and I drove off in my new Jeep! hassle free. great prices and friendly staff. thanks again", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101407008529457418291", "name": "justice sanders", "time": 1586891433521, "rating": 5.0, "text": "Wonderful experience. Very friendly staff. Spoke with a young lady over the phone after I looked up their deals on their website and now I’m driving a car I saw on the website. Thank you guys for being so great", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100384970295325656243", "name": "Melissa Small", "time": 1614138682193, "rating": 5.0, "text": "Pleasant experience would do again", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110278736203149948153", "name": "Veronica Parker", "time": 1595555323001, "rating": 5.0, "text": "I went to stallion auto sale to look at cars and when I got there I got that BMW  and when I tell you iam please with the salesman who sold me the car if any one looking to purchase a car I highly recommend y’all go to stallion auto y’all won’t b disappointed I’m in love with my BMW 28i turbo everyone is so nice and friendly", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107886324192656191007", "name": "Hamzah Tarawneh", "time": 1599087568477, "rating": 5.0, "text": "By far the best car lot around town awesome deals and great customer service!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109388626099893848612", "name": "jackie aldridge", "time": 1564613046597, "rating": 5.0, "text": "I want to thank the boys at the shop at Stallions for making it easy for me to test drive and buy the Accord. They were sweet, laid back and honest. I knew i was buying a used car and they walked me through the car buying process very quickly and had me in and out the door within 30 minutes. I cant walk far distances or stand on my feet for very long so i appreciated that.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114214911899061849199", "name": "Dede Charles", "time": 1561777053114, "rating": 5.0, "text": "Love my car. Love y’all. I can’t stress how happy I am. I didn’t feel pressured. I felt welcomed and appreciated. My cousin told me to come here. He’s happy and our friends are happy dealing with y’all. We’ll be back. Good business", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104286549774209359411", "name": "Shala", "time": 1591985466376, "rating": 1.0, "text": "I bought a car in honesty and WAS NOT sold a car in honesty. Prior to buying the car he stated there was nothing MAJOR wrong with car. Once I bought the car and realized the key remote was not programmed to the car so it would not lock, it needed a new battery, the dashboard headset was not working. I just came from VW dealership to get the key reprogrammed and they check that the car had a gas leak and the turbo needed fixing. 3500 dollars worth of work. I called Lee at the dealership and he told me I should have gotten it checked. You bought the car! i would NEVER recommend this dealership to my worst enemy. I believe if you are going to sell a car at a higher rate, then you need to make sure the car is worth selling it at that rate. If I could give them  zero stars I would. he just a salesman trying to sell you a far, he doesn't care what happens to you afterwards.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108155094804510325551", "name": "Dee Smith", "time": 1594000167152, "rating": 5.0, "text": "If your exhausted, from high pressure  car dealerships sales department,s then I highly recommend  This place ,  the staff was a refreshing experience and extremely helpful,  and awesome  vehicle, s , I will recommend them from now on ,sincerely  Dee . s👍", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113820527073222499535", "name": "Marsha", "time": 1576629878558, "rating": 5.0, "text": "This place is awesome! They truly care about their customers! I would recommend them to anyone looking to get a good car for a good price.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111465845936444058908", "name": "Victorian", "time": 1621656721676, "rating": 5.0, "text": "Updated post: They say the third time is a charm and it is!!!!!! Went back to Stallions today and I love my new car!!!!! Same great prices and there's a new Sheriff in town lol. Yep new management, Lee is the best!!!!!\nOld post: I Went to  Stallions 3 months ago and really enjoyed myself! Bethany was great!!!!! She and I talked the whole time, just girl talk and family talk. I laughed the whole time I was in the office. Our salesman was Lee and he was great also!!!! Don't believe the bad reviews because I almost did, and was hesitant about going. Glad I went!!!! All you need is a down payment,  drivers license, social security card, and you'll have the car of your dreams. I hope this helps someone.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111834074954221551750", "name": "mahmoud A", "time": 1591930119634, "rating": 5.0, "text": "I was very pleased with my visit this past weekend. We originally came in looking at a Jetta until my wife steered me into looking at a Mercedes CLS500 that caught her eye. We test drove it, walked in the office, 15 minutes of paperwork and we were on the road. I will not overlook this lot. Will be back!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113833718229182445228", "name": "Michael Winston", "time": 1602946958014, "rating": 1.0, "text": "Very unprofessional!!  I was told several lies throughout the buying process. Their system for accepting payments are stone-age and they lied about the condition of the car (service lights, broken mirror, and scratches). Buy at your own risk!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110369899650546854691", "name": "Linda bowden", "time": 1568476072313, "rating": 5.0, "text": "I work next door to Stallions and It was time for a new vehicle so I decided to stop by. My husband came with me and we were very pleased with our experience thus far. Nice array of cars! Thanks guys. Changed my oil and that's it!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101628007932097936668", "name": "Bailey Chapman", "time": 1582761785901, "rating": 5.0, "text": "Me and my sister just drove off in our new cars. I Was in and out. Very Happy customers. great service and great cars", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102138053821976970647", "name": "Jessie Langston", "time": 1572891822622, "rating": 5.0, "text": "Got in touch with Stallions over the phone and set up a appointment to view a vehicle. Came in test drove it and paid with money orders. Very easy and smooth transaction. Not pushy. Answered every question me and my brother had. Thank you Rick.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109154281488285509762", "name": "Ali Fulladi", "time": 1591112202130, "rating": 5.0, "text": "Bought my car from here, and my brother got his from here as well.\n\nI had a great experience and I have nothing but good things to say about these guys, I got an Audi and it runs like a beast. Super friendly staff and they walk you through the whole process and make it easy for you. I've had a terrible experience in the past with car dealers but these guys broke the stereotype. Laith was my rep and i'm so impressed. Thank you guys for your help.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101586894297325885404", "name": "Jerry Pridemore", "time": 1572624309895, "rating": 5.0, "text": "I had a good phone conversation prior to arriving, asked about tires since I had a 2 hour drive back. Dealer was honest and told me that the vehicle had 1 bad tire that he was willing to change. I appreciated that a lot. Most used car dealers would waste my time. I don't expect a perfect vehicle for $8000. But I damn sure good a good deal. Thank you guys for getting me in the car.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100061137901281331666", "name": "David Thorsby", "time": 1576015055210, "rating": 5.0, "text": "Pleasure doing business. I was told about a battery before leaving the dealership. Changed it myself ($90) and I’m good to go! Dealer really priced his vehicle to sell. Happy overall", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107904666180630714196", "name": "Savanna Silver", "time": 1590252767608, "rating": 5.0, "text": "I found the best car here and would recommend friends families and strangers to shop here for first time buyer they work with you and they're real nice people I would definitely come here for my next car", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101301919163399100994", "name": "Tonys Morris", "time": 1568219388087, "rating": 5.0, "text": "I had the best experience with you guys. I really do appreciate you guys, and I will be referring my friends to you. You guys are wonderful. I’ve  bought many cars in my life and some were good some were night mares. Website has many detailed pictures. They let me put some money towards the car I wanted so it wouldn’t get sold until I got the rest of the money, that was a blessing! Thank you thank you thank you!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108276949651574364455", "name": "Gegory Hausler", "time": 1570314333140, "rating": 5.0, "text": "Very happy with what this car lot was doing. Great business and we are happy to provide you with our future car needs (2 kids to go). Easy, n hassle and NOT PUSHY!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107982069425529937627", "name": "Trey Kingsley", "time": 1571668782036, "rating": 5.0, "text": "I was very happy with my purchase. My dad was out of state and still managed to get my funds transferred over to me while Stallions held the car for me (with a small deposit). I spoke with Lee and felt like I was speaking to a friend, not a Salesperson. He was honest and told me what they car needed,tires. I knew it was a used car and it’s expected for it to need something minor like that. I respect that type of business. This was about 2 months ago, better late than never. And I did receive my title in the mail!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115232952390193971783", "name": "Rod Chesthill", "time": 1584632417578, "rating": 5.0, "text": "I just came across stallions autos on a website called cargurus that had great deals and looked them up and saw some great reviews and I just purchased a 2011 bmw 3 series. I have to say I was not expecting this kind of service and treatment. These guys are selling cars in the customers best interest and they let me know some things that I didn’t know without asking. My nephew will be coming to see you guys in a few days so look out for him like you did me, and I’ll be back", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117385460147881633258", "name": "jill coleman", "time": 1590761721651, "rating": 5.0, "text": "4 years later my car is still going strong. ill be coming by soon my sister needs a new car", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106010287069714119117", "name": "sumar abukhudeer", "time": 1589583321655, "rating": 5.0, "text": "Customers service is awesome and the perfect place if you’re a first time buyer. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102790658192694603832", "name": "Josefina Kirkley", "time": 1574372955090, "rating": 5.0, "text": "At first I didn’t like the front right  tire on the car that I drove for. The owner gave me $100 discount and I was pleased with that. Good used car for the money. Looked at several cash cars", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100935598215511735884", "name": "kevin crosby", "time": 1590179754639, "rating": 5.0, "text": "They didnt check my credit, although not a cash car I was financed in and out hassle free. Nice car with nice rims and tires. Thanks", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106834349602013325703", "name": "Joe Impello", "time": 1578537942214, "rating": 3.0, "text": "Nice selection of cars around $6000. Salesman greeted us and pointed out several options but was not overbearing. He checked in with us to answer some questions. We  were just looking and left without purchasing.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109108578821904864986", "name": "Maria Valdez", "time": 1576874379903, "rating": 5.0, "text": "I did not want to put a down payment. I paid cash and got the best bang for my buck. Looked around and saw many roads leading me back here. Compared online prices. Satisfied", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112374816551080747341", "name": "TAO CHENYU", "time": 1581451526282, "rating": 5.0, "text": "thank you very much guys. I appreciate all help. nice meeting you. I love it", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109455321386529050564", "name": "Joshua Northcutt", "time": 1617032855591, "rating": 1.0, "text": "I don't recommend this place", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109417164868720144057", "name": "Romero Alvaraz", "time": 1565743912738, "rating": 5.0, "text": "I’ve lived all over the south east and I’m very familiar with non franchise car dealerships. With that being said, the profit margin these folks place on top of their vehicles has to be very very minimal based on their website prices. Ever car we inquired about we found cheaper here than anywhere else. Very transparent and very straight forward, they rely on selling quantity rather than a big mark up on a used car. They understand the market and have a great business model. I didn’t catch the owners but I wanted to say thanks and assure you that my family and I will not take our business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107979162420526664858", "name": "Emily Bowden", "time": 1570848846478, "rating": 5.0, "text": "Almost had a heart attack when I first arrived and thought the vehicle I drove an hour for was sold. Although the sales person was sweet and advised me to put a deposit over the phone because their vehicles will quick, I took my chance. Anyways, it was parked out back and I got to it first :) *Quick change of mood*", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112144313819972045378", "name": "Brittany Deflo", "time": 1561236541836, "rating": 5.0, "text": "Just great. Very nice. Not pushy. Customer service was excellent. Provided all the information I asked for and needed. I got the 411 on a place that sells very cheap full coverage insurance. Im so grateful I found this place", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113794119552133977157", "name": "Christie Downey", "time": 1568399134575, "rating": 1.0, "text": "Steer clear of this car lot! They sold us a car that they knew was for our 16 yr old daughter. We made it home and the next day the car would not shift into gear and then completely died. The owner did take our call and told us it was because a ground wire caused the transmission to stop working. We got the car to a local mechanic we use for everything who tested the car and said there are major electrical issues and multiple transmission codes. They knew this car was a lemon when the sold it to us. I get that used cars are a gamble but not the kind of issues this vehicle has. It's not even worth fixing. TRUST Me there is a reason their cars are priced so cheap. I'm sure not every car the sell is bad but they do sale junk cars/lemons.\n\nBEWARE, Save your money.  You get what you pay for.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110068712270774662550", "name": "Jonas Knox", "time": 1570668847854, "rating": 5.0, "text": "I was pleased to leave in a cash car and not have any payments. They showed me the true book value of what they sold me. Happy guy", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116099934903921578566", "name": "JESSICA LAMONT", "time": 1593466904252, "rating": 5.0, "text": "bought a used 2012 VW Jetta Diesel for my mother. She loves it", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112050912634973403138", "name": "Tulip Chasity", "time": 1571845272207, "rating": 5.0, "text": "I highly recommend this establishment. I had no hope in getting in a Mercedes with my credit although I had some money saved up. They got me in one by putting a good down payment and a decent monthly payment.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116166137901713782374", "name": "Kristia Jovid", "time": 1583989155905, "rating": 5.0, "text": "Helpful and friendly guy. Car price is good. New tireS and drive very good.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117707730033685359171", "name": "KIMBERLY WALLIS", "time": 1567620872766, "rating": 5.0, "text": "I just bought a beautiful Lexus , and this is my second car from there. My daughters driving my Honda I got from them 4 years ago. I have sent several of my friends there and everyone has been happy.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115608209015899663357", "name": "gary underwood", "time": 1552335622735, "rating": 5.0, "text": "They have a big selection of nice cars reasonably priced for a buy here pay here. I was very satisfied with my purchase. Lee was a great help and made my car buying experience a breeze. He was willing to wait for me past closing hours for me to secure my vehicle! Straight forward man", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116942896030465885585", "name": "Dave O'Shaughnessy", "time": 1575852245473, "rating": 1.0, "text": "They sold us a lemon. The engine light came on, ON THE WAY HOME FROM THE LOT. Apparently they reset the engine light before they sold it to us. It had 4 different codes. The repairs to the transmission were $1,400. We’ve put another $500 into the exhaust system. Nobody from Stallion would ever call us back. Not to mention brakes and rotors were $400. Seems to me that they’re running a scam operation.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102102827858692142678", "name": "Hector Ricardo", "time": 1586808821189, "rating": 5.0, "text": "Got a great price on a 15 Mercedes Benz. Well below market, I did my homework! Happy 19 year old Bday present", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101056710614648376227", "name": "Michael Bryant", "time": 1564484981251, "rating": 4.0, "text": "Worked my deal over the phone and the information was straight forward and my vehicle is running strong. Be sure to do your research on any used car but don't overlook Stallions. Thanks again Lee.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102211611874715573953", "name": "Cristie Shumaker", "time": 1569004350008, "rating": 5.0, "text": "They gave us a fair price on a good vehicle. We didn't need anything fancy, just something solid. They had a Carfax and beat a nearby competitors price. Pleased, thanks", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116422868818750400064", "name": "Gloria Richardson", "time": 1593999620949, "rating": 5.0, "text": "Best bag for the buck. I’ve dealt with Stallions going on 10 years now.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102820568948911361594", "name": "peggy brenton", "time": 1558467617977, "rating": 5.0, "text": "RESPONDED PROMPTLY, MADE IT TO THE LOT AND WAS GREETED. THE KEY FOR THE VEHICLE THAT I CAME TO PURCHASE WAS MISSING, ALMOST GAVE UP AND LEFT. ONCE IT WAS FOUND I TOOK IT FOR A SPIN AND PULLED RIGHT UP TO DO PAPERWORK. IT WAS WORTH MY WAIT TO GET A VEHICLE FOR A GOOD DEAL. PRICE MADE WAIT TIME NO PROBLEM", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103186033483545146639", "name": "Alexis Brown", "time": 1585173166382, "rating": 5.0, "text": "Very Great Car lot My car works Great and the people Are very nice and helpful  I Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112053442310289919836", "name": "donesha houston", "time": 1583259952376, "rating": 1.0, "text": "I purchased a vehicle on last Thursday and was told at the time that all there vehicles are checked out by a mechanic before placing them on the lot for sale. A few days after I purchased the car I took it to the dealer to have serviced and they found multiple things including leakes from the valve cover gasket and oil filter housing also the oil was jet black and the inside of the oil filter was submerged due to the oil not being changed for a long time! They also had the wrong battery in the vehicle and the front breaks are metal to metal! I would not recommend anyone to purchase from this company!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116830277940200261714", "name": "JAMIE PROTEGE", "time": 1554998375476, "rating": 5.0, "text": "Stallions made my 3 and a half hour drive well worth it. I asked all my questions over the phone prior to making my drive from Lucedale, MS. I dealt with Lee. Very upfront and knowledgeable of what he was selling. Showed me great respect and didn't waste my time. I like to be in and out when buying a car. Best 6K that I've spent on any car so far", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117927834807605786071", "name": "Lilkahtan", "time": 1569286178265, "rating": 5.0, "text": "I got my BMW X3 and my uncle got a bmw 5 series’s  a year ago. Thank you Rick I will always deal with you guys. And I will recommend people to you. I love the way you guys run the business keep doing what you are doing. A+++", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113825466956478990431", "name": "Jill Escott", "time": 1558897398795, "rating": 5.0, "text": "Great car selection. Lovely staff. Bought my car a year ago. Just went back to get my brakes changed Cheaper than anywhere else I could find", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115928416215055885439", "name": "Fernando Miguel", "time": 1575071048058, "rating": 5.0, "text": "My family and me get a very nice truck. Clean title no problem. Good tire. Finance and no driver license. They send me to lendmark and my wife sign with me. Good dealar", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111940456050499534339", "name": "Catelyn Joann", "time": 1558828767061, "rating": 1.0, "text": "I drove up today may 25,2019 to check out a vehicle. This vehicle that, “claimed” to be great condition! Turned out to be a nightmare on the lot. They didn’t mention to me at all that the paint on this car was completely destroyed, not just tiny flakes here and there the paint peeling over 50% of this vehicle. We ended up passing on the vehicle the man working Rick was absolutely sweet is why I even handed this review a one star. Rick showed us another vehicle, dead battery but you know we thought, “maybe it’s just been on the lot a second”. Little jump start, and it fires right up. Problem one radio didn’t work, problem two the air wouldn’t even get cold. The biggest problem of them all is we tried to test drive this vehicle and the brakes sounded like steel on steel it was god awful. We didn’t even have second thoughts, we straight turned that vehicle around before we even got a second to pull it off the lot. Ridiculous because the photos that were used on Facebook didn’t show any detail of all of the paint job involved on this car. A waste of an hour drive to the location. Please know what your getting involved in on this lot.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107672445145322462502", "name": "Becky Sprawlig", "time": 1577135806913, "rating": 5.0, "text": "Just drove off in my Malibu! Thank you Jesus! Thank you Stallions! thank you Rick! Love my new car!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111108518104501438305", "name": "jeremy little", "time": 1548094335200, "rating": 5.0, "text": "My niece purchased a Honda 2 months ago. Car got totaled, came back for another. The sales person was helpful and gave us a good deal once we got the insurance check back. Very fair prices", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109915860811973578084", "name": "Kyle Bishop", "time": 1580311603605, "rating": 5.0, "text": "Called over the phone and set up a time to drive the cars I wanted and ended up driving off in the one in less than 45 minutes. I was very pleased with these young gentlemen’s hospitality", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107734105331130697479", "name": "Alexis Kinsley", "time": 1574293493412, "rating": 5.0, "text": "Talked to the young lady over the phone and came in a few days later and drove off without having to put a down payment financed through my credit union. Easiest transaction and very pleased with their fabulous customer service", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112794869871054384104", "name": "JKL Automotive Repair", "time": 1572484512285, "rating": 5.0, "text": "Pleased to do a quick cash sale with Lee. Needed an extra work truck for my company. Quick, easy and fair", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105564176599103119847", "name": "Aaron Bennett", "time": 1582664217794, "rating": 1.0, "text": "Found what I thought was a fair deal on a Nissan, ad and salesman said everything worked. The day after it went into \"limp mode\", code read MAF sensor, so I changed it out ( it had obviously been re-wired)...check engine light still on and still going into \"limp mode\". Took it back to dealer and they had their mechanic look at it, 3 days later they said it was running fine.. Check engine light still on and back to \"limp mode\" the next day. Online research says it could be a failing ECMb saleman told me that I will have to take it to the dealership to fix it.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111908643274096157357", "name": "Hamad Nawaz", "time": 1593749035634, "rating": 5.0, "text": "Good spot for a reasonably price automobile.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109266222642458609928", "name": "Renae Hoskins", "time": 1575427649853, "rating": 5.0, "text": "Good cash cars. Got on the phone and left them a voicemail and got a call back 19 minutes later. Will be shopping back here", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103479520032328924665", "name": "Jennie&Frank Knight", "time": 1574292506820, "rating": 5.0, "text": "We did good. Our little one was happy. Made a phone call, drive down and left with a car. All in 23 minutes lol", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110753437593030817702", "name": "GRANDMLLLC COMPANY", "time": 1564178211321, "rating": 5.0, "text": "Pleasure working with Lee, very straight forward and knowledgeable. Made my sons car purchasing experience a breeze. Also made my 3 hour drive well worth it.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "118364626906313065671", "name": "pete seville", "time": 1569005132408, "rating": 5.0, "text": "many cars to pick from, very low prices. and I have bad credit and I still got the car I wanted. highly recommended", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100018491179559980367", "name": "Cordarius Boyd", "time": 1618068041752, "rating": 5.0, "text": "Usefulled", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102209376181038919218", "name": "Tasha Lewis", "time": 1541702586045, "rating": 5.0, "text": "I cannot describe how happy me and my family are because of this place. I was treated like family or a friend. Every questioned I had was answered. Carfax was provided for free. (Another dealer tried to charge me for one). They were very patient with me test driving and encouraged me to do so. I just felt like they were Very honest people. Had nothing to hide. Very friendly. I can't say thank you enough. At the end of the day the car speaks for itself. But it's just nice to get great customer service", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106019153354411649046", "name": "Terry Brown", "time": 1538155007776, "rating": 5.0, "text": "I went last night and checked out the inventory on the lot and found a few vehicles I liked and a couple I didn't but these are used cars. Rick was very helpful as well as his brother and the gentleman on the lot. I fell in love with a 2012 Honda civic that was well below kbb estimated value. It had some paint issues but it's a solid driving vehicle. Great brakes,great tires,cold a.c.,heat,everything works great,no check engine lights. I'd definitely recommend this place to a friend!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117391807987016113687", "name": "Kels Griffin", "time": 1564336744571, "rating": 5.0, "text": "Amazing dealership overall as well as people. I asked too many question lol about too many cars and they gave me all the info I asked for and more. I went to another dealership first and they tried to force me into certain car. Then I came here and they told me I can buy anything I want from the options they had lol. Not pushy or aggressive. I felt so welcomed. Thank you guys!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108220376336232501039", "name": "MICHAEL BEVIS", "time": 1561236491383, "rating": 5.0, "text": "Thanks Lee. Did what he was supposed to do. 2012 VW (needed nothing but tires and a detail) for close to $2000 below market price. Pleasure doing business with you. 2 thumbs up", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116290038787158124509", "name": "Michael Halbert", "time": 1566832343274, "rating": 1.0, "text": "Don't trust these people at all!! In fact just stay away. I purchased a convertible from them about a few weeks ago and was assured that it did not leak anywhere. I washed the car as soon as I got home and there was a small bit of water on the inside right by the door. I figured it might be because the car was sitting still and I was directly spraying it with water, however I contacted the guy about it anyways. He said he would talk with one of his guys and get back to me.... It has now been several weeks and I havnt heard anything from him. Today (8/26) I got stuck in a heavy downpour and the top was leaking from every angle. I got to work and I was soaked and so was the inside of the car. So now I'm going to have to rip out the carpet and get that cleaned and hopeing that no water got in anything electrical. Will never do business with these people again!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108827468951873943160", "name": "TJ Lemier", "time": 1567174886711, "rating": 5.0, "text": "Thank you Stallions. Highly recommend them. good lookin out", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106265824971173450133", "name": "gregory howell", "time": 1569870798354, "rating": 5.0, "text": "Bought me a work truck from Stallions. Used car, didn't need anything but the typical oil change etc. Runs as it should. Pleasure. Be back for more", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109957478457373035157", "name": "Jesse Weaver", "time": 1566860526411, "rating": 5.0, "text": "Bought Tiburon. Promised a good review for the service. Here you go. Thank you. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109498479910447485677", "name": "Tatiana Blue", "time": 1572624100933, "rating": 5.0, "text": "Finally found a place to let me make payments on a nice car without pullin my credit because my credit is a joke. Thank yall. And thank you for telling me about the place for tires. My whole family ended up going there haha", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103729845106009837094", "name": "nash muzavi", "time": 1568495153314, "rating": 5.0, "text": "Did not buy. Clean cars. They check out. Consider my 2 offers, needed 2. Thanks", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102284837909581957461", "name": "Matthew Dowdy", "time": 1548308947253, "rating": 5.0, "text": "Fantastic experience. They a nice selection of vehicles and super friendly staff. They made my car buying experience easy and stress free.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113636621111875019317", "name": "joseph nestor", "time": 1535134493611, "rating": 5.0, "text": "I purchased a 2008 Honda Accord from this dealer about 2 months ago and have had zero problems what so ever. The price brought me in (way below book value). The guys were very polite and car savy, knew what they were selling. I continuously look online and I still haven't seen a vehicle matching my specs and mileage for a price near what I purchased mine for. Very happy customer right here. I would 6 star you, hats off.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104937319019105859690", "name": "Julliana Moreno", "time": 1559100121066, "rating": 5.0, "text": "Highly recommend them. I shopped at many different used dealers around town. Stallions was the best I found hands down", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105048975419168063976", "name": "Jamesha Crawley", "time": 1555692438770, "rating": 5.0, "text": "I put a down payment on a Mercedes and rick helped me get cheap insurance and didn’t check or run my credit. My friend sent me to Stallions and she gott 100$ taken off her payment for sending me. Very easy people to deal with", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112499364555696834808", "name": "The Orchard Live", "time": 1566844092024, "rating": 5.0, "text": "Thank you to all the team members for such hospitality and warmth. They went above and beyond for us!!! Thank you Thank you Thank you", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108021141238228970758", "name": "Jared Lorino", "time": 1577402600094, "rating": 5.0, "text": "Great value on cash cars. Although I didn’t buy, I will be back.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110771378882788016249", "name": "MICHELLE LANGSTON", "time": 1521830467918, "rating": 5.0, "text": "Purchased a car from Stallions 2 years ago, came back for another this past week. One of the easiest people to work with, always been sweet and are very reasonable to work with. for a buy here pay here I could not find anyone to work with me the way these people did. These are used cars and if you expect to get a brand new car that needs nothing then you should buy a brand new car. But for a used car dealership they are a 9/10. I would go back again and again :)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110339882662453375673", "name": "lexi duckett", "time": 1559219732986, "rating": 1.0, "text": "Never buy a car from here!!!! They had apparently fixed something on the car i bought from them but completely did it wrong and it wore out within a year of normal driving. Cost me $2500 to fix.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116143263836237732843", "name": "ryan butler", "time": 1551801477693, "rating": 5.0, "text": "Very sweet and polite. Efficient experience . It made my car buying experience a breeze. Ask for Lee!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108934243810071102583", "name": "LandsMineLLC LandsMineLLC", "time": 1567097542826, "rating": 5.0, "text": "Highly recommend. Straight to the point and good price point.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105309796829191593068", "name": "Devier Cohen", "time": 1559253447029, "rating": 5.0, "text": "Dealer responded to my phone call and I scheduled a time to come in and test drive. 15 Kia Rio with 80,500 miles for $7000. I'm a happy camper.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113639031650486055576", "name": "alex khan", "time": 1609804328942, "rating": 5.0, "text": "Very impressive", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103451305225209001457", "name": "Ryan Butler", "time": 1565560528975, "rating": 5.0, "text": "Friendly people willing to help you get in the right vehicle.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113123887710368540477", "name": "Augusta Bryant", "time": 1551471588540, "rating": 5.0, "text": "Great place and excellent service. I would recommend this place to anyone. People was very nice.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112348028255994427690", "name": "Kristy Schneider", "time": 1569189508456, "rating": 5.0, "text": "The man waited for me and meet me an hour after their typical closing time. Sweet people", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107297638615138272833", "name": "Geoffery Lavelle", "time": 1557598283455, "rating": 5.0, "text": "Deal of the week here. Thank you for your business. We were happy to spend a couple hours of our Saturday at your dealership :)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108018542480576131803", "name": "Lamar Langston", "time": 1520349772586, "rating": 5.0, "text": "I love my car from stallion. My car runnin good I ain't have no problems. They hooked me up with this guy that got me real cheap insurance too. Good people", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106173176005519584349", "name": "janice terry", "time": 1583535127195, "rating": 5.0, "text": "Bought cars all around Alabama. Fairest deals in town hands down.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114311309107833900107", "name": "DARIUS LARRYFIELD", "time": 1552316449664, "rating": 5.0, "text": "Easy to deal with. Very fair people. Lee was great and knew his inventory", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111960686034225538237", "name": "Fincher Enterprise LLC", "time": 1557606588043, "rating": 5.0, "text": "Received my title in the mail last week. Pleased with my purchase. Thank you", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109814299705600991431", "name": "Whitney Penn", "time": 1508725478912, "rating": 1.0, "text": "Do not do business with this company !!!! Take your money elsewhere. Would give a negative rating if I could.  Purchased a car from this place and they were nice and responsive until they got their money. The very next day the engine started tapping and the same salesman that sold me the car was too busy to talk or see me. Obtained verified diagnostics test from dealership stating the car had a bad engine and would cost $1000's to replace. The salesman Lee originally told me they would fix the car for me than later changed his statement saying there was nothing wrong with the car while it was here and that his mechanic was booked up for the next few months. Not responding to phone calls, emails, and very rude during follow up visit. This place is a joke of a business.  The cars look good but they are lemons. Save yourself hardship and a headache and do not do business here.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104459151144659729619", "name": "Tonya Morrison", "time": 1566349569485, "rating": 5.0, "text": "I think it’s “Blake”? Did a marvelous job.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111627472598976290485", "name": "Brittany Boyd", "time": 1567553858450, "rating": 1.0, "text": "They posted a 2007 ltz tahoe on Facebook. I talked to Lacy over a two day period about it. Tahoe looked great in the pictures on Facebook but after driving 2 1/2 hours to buy it we got there and it had been wrecked in the rear, windshield was cracked, front tires had wires showing they were so bald, airbag, and check engine light was on. NOT ONCE did Lacy bother to mention any of these issues the entire time I was talking to her about it. Even tried to convince me to put down a NONREFUNDABLE $300 deposit over the phone to \"pull it off of the lot\". Don't make the same mistake I did. Don't waste your time at this place. If I could give a Zero star review I would.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101271369919054381245", "name": "Farhana Trinity", "time": 1566424468019, "rating": 5.0, "text": "Had me drive down from Decatur once I got my loan pre approved at Guardian credit union. They were quick", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114568133767939558405", "name": "Chaney", "time": 1541515302156, "rating": 1.0, "text": "If I had the option to buy a toy car here I wouldn’t. This place is terrible and they lie about the condition of the cars. The good reviews on here are half of the family members that work there. I REPEAT DO NOT BUY A CAR FROM THEM. THEY ARE SHADY!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112696572740519235206", "name": "tim varner", "time": 1535386800984, "rating": 5.0, "text": "Good variety of cars. prices beat all other local dealers that had the same cars. Rick helped me more than I could have ever asked for", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108637161420316913441", "name": "Russell Carmody", "time": 1496865025078, "rating": 5.0, "text": "I had a fabulous experience. Their staff is very competent and easy to work with. Felt more like family than any where else I've been. It is because of the excellent value and service I received that I am now a client for life.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100564145905560547821", "name": "James Blunt", "time": 1525203024961, "rating": 5.0, "text": "These folks are hands down the best and easiest people to work with. Inventory is constantly updated. I was Treated with nothing but respect.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106333471910777311782", "name": "Jen Weaver", "time": 1477077618624, "rating": 5.0, "text": "Good experience will go back for another car. Very helpful on getting me into the right vehicle with the down payment I had. People are super nice. Will recommend to all family and friends.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116567238416175149781", "name": "Evan Lewis", "time": 1561470283698, "rating": 2.0, "text": "Recently bought a car from them. Car seems like it’s a great vehicle and for a reasonable price.\n\nThe only problem I had is that we made a deal with them to replace the battery in the car (which was a hybrid) and they gave us a battery that wasn’t for a hybrid. I went back and what should have been a calm discussion about getting the right battery turned into a very heated exchange when the dealer began to call my mother rude and claiming the battery was fine.\n\nThe battery ( the 12 V startup one) is a specialty type of battery for a hybrid that only the dealer provides and costs about 500$:\n\nWe ended up getting a check from them to get the battery from the dealer (they wouldn’t pay the install price, just the wholesale). The thing is, is that this review would have been 5 stars if they had just been polite and understating when we came to them about the problem. We could have gotten to the same point without the very unpleasant arguing and lying. That had us coming away with what seems to be a great car but a really bad taste in our mouth about the dealer.\n\nHope the car runs for a long time, but when buying a car from here .... MAKE SURE you get any agreement in writing (be very specific) and check with an inspection place they have done the work correctly  before sigining the dotted line.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107115832381234527119", "name": "Mary Lavicka", "time": 1558135758198, "rating": 5.0, "text": "Not the type to generally leave a review, but Im doing so in this case since we felt very strongly about  the people we dealt with. Great, genuine people here. Drove an hour and a half to the location, test drove the 2014 Nissan and took it to get checked out at a near by garage. It checked out- As any used car it had minor things that needed to be addressed but that's to be expected with any used car. I don't expect a brand new car, besides a mechanic shop HAS to give you a long list otherwise they feel like they have not done their job correctly. Came back, negotiated price (which was already low and I admit to that since I did my research). The gentleman was polite and told me he could knock of $200. Paid it in cash and made it through the paperwork hassle free in less than 15 minutes. On the way out I ran into  the owner who  explained to me the way that they conducted their business. They seemed to do well and sold many cars at that location. He was a very down to earth person. The reason for my detailed explanation is to make it clear to anyone that looks at online reviews to take them for a grain of salt. Mid-conversation with the owner I watched a man come into this dealership and demand new brakes and tires on a vehicle he bought a few weeks back apparently, and otherwise threatened to leave a bad review!! People like that get on my last nerve. These folks are selling good quality cars for a fraction of the price. If someone wants a brand new car they need to help themselves to a brand new car store. We don't see shops like this anymore, everything is being bought out and turned into a franchise sore where you would pay at a lot more for the exact same car. We need to value these people.  Anyways it made me angry seeing someone act in such a way. These people treated us very well. We will be back to see you guys.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106831074974977742037", "name": "jermiera jackson", "time": 1557605408758, "rating": 5.0, "text": "Thank you Stallions. Y'all are appreciated. see yall again in 1 month", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107275055251502717879", "name": "Sharon Calhoun", "time": 1573739866142, "rating": 4.0, "text": "Have some nice used cars", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100656125154144970464", "name": "Bethany Lemier", "time": 1582769205975, "rating": 5.0, "text": "Bought the red Tahoe. Thanks.\n\nBtw found out what that extra sunroof switch was for :)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109278915369518121719", "name": "rmq92", "time": 1527699166227, "rating": 5.0, "text": "Great people. Easy transaction. Very fairly priced vehicles. Not many buy here pay here lots that have these affordable prices. Ask for Laith or Rakan as they were very helpful to me!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113153022184173421102", "name": "jackie benson", "time": 1522702557278, "rating": 5.0, "text": "A++ I LOVE LOVE LOVE THEM! i don't know where i would be without them. ive been through some tough times and they was there for me instead of pickin up my Honda. god bless", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104143365071897449140", "name": "Markeon Rahman", "time": 1551829891610, "rating": 5.0, "text": "My niece and my nephew been tellin me ab this place for 2 years now. I came thru and got me a 2014 Altima from them. They was nice and professional and told me I was gonna have it paid off in 2 years. Very happy with these people!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103960263644170041588", "name": "jesse smisson", "time": 1525203513945, "rating": 5.0, "text": "honest! cheap priced comparing to others I looked at in the market. 2 thumbs up (Coming back for more)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109077055156912678645", "name": "Birmingham Ala", "time": 1547087452869, "rating": 5.0, "text": "This place has the lowest prices around , they were good cars too. Good job Stallions", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112461177895688443917", "name": "Jason Freeland", "time": 1536806100295, "rating": 5.0, "text": "-Saw online\n-Priced well (car fax provided)\n-Got info and directions\n-Sceduled test drive\n-Came in and spoke to nice salesman\n-Came off price some for new tires\n-Pleased with purchase. Car and price A1\n\n(Company did refer me to a trusted close by bank to get me financed- much appreciated)", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107718216733583792854", "name": "Christen Buehler", "time": 1558712653853, "rating": 1.0, "text": "I bought a VW Jetta from them. They told me it had good tires and ran great. It drives great however that was after new tires and breaks and it also had a cabin air fliter that was black. Plus i was told that my tax, title, and rag was included in the total price. I went to the DMV to get my tag and they have not paid any tag taxes on any of the vehicles they sell. So make sure your carrying an extra 200$ or more to get you tag. They basically screw people on the cars. It may be wholesale prices but not worth it at all! They need to work on theyre cuatomer servuce too. Hanging up on people who bought a car from you is bad business. Ill juat make sure to spread the word on yalls scams!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101653962745476216073", "name": "Xavier Mendez", "time": 1528874346282, "rating": 5.0, "text": "Good business. nice people. many type of cars. Low down payment. No check credit. A++", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115001118329978332053", "name": "Sincere Clark (Sincere)", "time": 1539723782173, "rating": 4.0, "text": "Pretty Decent Prices for The Car Selection. Extremely Helpful And Willing To Work With You.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "118212978911948787753", "name": "Kevin Carson", "time": 1533153218740, "rating": 5.0, "text": "Bought a Tahoe in April 2018 now Aug 2018 still running ok. Thanks. Just sharing my experience. The guys there were really nice to deal with", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105902349707911834158", "name": "Mirandal Kendricks", "time": 1555629020785, "rating": 1.0, "text": "While I don't usually leave reviews for places I visit, I was strongly compelled to inform the people of Alabama about my visit and the \"OWNER\" of this establishment. If I could leave 0 stars, I would.\n\nMy mother purchased a car a few weeks ago and today she decided to go on her lunch break and get her tag. Information that should've been provided during her purchase at the dealership was requested from the clerk at the tag/title office. She placed a call and got the owner on the phone and he was attemping to assist her. While he was able to eventually get her the information she needed the process of how she had to get the information from the owner was where she had an issue. She stated that there was a language barrier which she didn't personally mind BUT as she was on her lunch break and had limited time to talk she requested to speak with someone with better English that could accomodate her and articulate the information she needed in a timely manner. The owner became rude with her during her phonecall even prompting the clerk at the window to comment on his rudeness.\n\nI later accompanied her to his dealership as she needed to make a payment on her vehicle as well. Once arriving conveniently the owner was sitting on the front \"porch\" of the lot. When she expressed to him her issue with the process that it took to get information from him earlier and why she requested to speak with someone with better English he became rude with her again, and constantly interrupted her.  I happened to accompany her on this visit and made a comment about his direct rudeness. I guess he didn't take our visit too well because we'd interrupted his flirting with his employee but he then proceeded to invite the both of us into his office and present to us a dusty old box containing his many \"degrees\" which from what I saw were merely laminated certificates as if that gave him the right to conduct business and talk to us the way he did. I made the comment that both myself and my mother carried actual degrees from accredited universities, she even having her Masters which at the end of the day should not matter. Him having the title of \"OWNER\" and his many \"degrees\" should never give him the right to believe that he should be able to be rude to customers or anyone else for that matter. It takes way more than walking around and merely calling yourself a business owner. Its a matter of action as well. As an owner you should be able to take criticism and responsibility for your actions. A simple apology would've been good enough but my mother didn't even get that. I myself began to get upset because of the way he chose to speak to my mother. I simply could not allow it. I began to explain her position yet he attempted ot interrupt me like he did her. I wasn't allowing that either. Our conversation ended up being a mix of words in which he eventually summoned one of his employees into the room for reasons I still don't know. She attempted to explain that the owner was alone by himself at 8 AM until she was able to get into the office and the fact that she hadn't been able to hang up her purse because he asked her to take the phone. This made no difference to me or my mother because 1. She called around 1 PM not 8 AM & 2. As a business \"OWNER\" he should've done a better job with tailoring his business to order to fit the needs of customers. If you had staffing issues then as an \"OWNER\" it was on him to take on that matter himself. Either way it should not fall on the shoulders of the customer to deal with your rudeness and lack of customer service. My mother always raised me to be honest and to speak my mind so here I am speaking my mind and saying that the \"OWNER\" of this establishment is trash and should better spend his days gaining proper accreditation on what it means to be a good business owner and how to deliver good customer service as well taking some time to fix up his dealership because all it takes is for the wrong person to have an accident on that janky \"staircase\" on his lot and his entire business under fire due to lawsuit.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105668544373139633701", "name": "Rory Curtis", "time": 1551829446418, "rating": 5.0, "text": "Purchased a 2012 Kia Sedona, clean vehicle with a good Carfax. Priced well below retail. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104254408990149034189", "name": "tasha combs", "time": 1521836458616, "rating": 5.0, "text": "they sure did gimme a car with a good down payment. They aint run my credit and i paid 1900 and got a nice Benz that they was cleanin. Good peeps", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109354357131468107580", "name": "JEROME DAVIS", "time": 1525465609674, "rating": 5.0, "text": "FOUND A CHEAP ONE WAY TICKET FROM GA TO BHM AIRPORT TO PICK UP MY SWEET IS250. GREAT DEAL, PRICED BELOW RETAIL, GOOD CUSTOMER SERVICE AND WELL WORTH MY TRIP TO SAVE A COUPLE THOUSAND DOLLARS", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117733010456782235457", "name": "Richard Tyler", "time": 1579289554674, "rating": 2.0, "text": "Will not stick to their word don't trust try to sell for hundreds more than what they say", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116573678115960615833", "name": "Kimberly Starks", "time": 1500679819447, "rating": 5.0, "text": "This is my 2nd purchase from Stallions. Friendly people and Wonderful Service. They treat you like family. I will always go back for more purchases from this lot", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110216847887083205369", "name": "kennedy williamson", "time": 1576187023983, "rating": 5.0, "text": "Shout out to my man Lee! Ask for him. Told yall ill leave reviews when I leave.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104513060789486167701", "name": "BILL SMOKE", "time": 1553542096414, "rating": 5.0, "text": "Salesperson was very nice and helpful. However did not have car for me.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100220797935993400539", "name": "rivera alan", "time": 1530721617615, "rating": 5.0, "text": "worked with me like no on else ever has. I really appreciate you guys", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102690279595691017038", "name": "Jacob Chad", "time": 1496944844481, "rating": 1.0, "text": "Just now getting around to this since I'm on the hunt for a car again. A little over a year ago I saw a Honda accord on Craigslist, the mileage wasn't listed(as they never did until recently) the asking price was way to much and to top it off, this man who said to text him was EXTREMELY rude and disrespectful to me, not realizing or caring I had CASH in on hand to purchase this red accord coupe. I'm in customer service and my mouth almost hit the ground, plus I hear they sell junk anyways.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116943531983106554920", "name": "Josh Lorino", "time": 1559517404393, "rating": 5.0, "text": "Satisfied Customer. A++", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111689293457134678175", "name": "Misty Vega", "time": 1568172775508, "rating": 1.0, "text": "I bought my car june 29 2019 they told me to come back in 2 weeks to get my title application I went back two 2 later they gave me the title application and told me it would take 4 to 6 weeks to get my title I said ok the 6 weeks mark was up August 29 2019 so I called the lady that answered the phone said oh you should get it next week here it is September the 10 and still no title so I guess I will be making a trip up their again or I will call my  attorney because I paid cash for my car watch out before up buy from here", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112266591744900091339", "name": "Mitchell Seal", "time": 1550607928231, "rating": 5.0, "text": "I bought a Escalade from them, I was treated very well!! Truck is going strong after a year and a half!!....do research on a vehicle, and just because you picked a possible lemon does not mean its the \"used\" car lots fault!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103477813611770412577", "name": "Akin Okegbile", "time": 1487696532079, "rating": 5.0, "text": "Best bang for my buck.\n\n$2000 out the door for a 7 year old vehicle. running and driving no issues..\nStill driving 2 years later.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105085813421996963389", "name": "Rayan Huneidi", "time": 1449711866425, "rating": 5.0, "text": "I've bought cars at many buy here pay her lots, nobody has worked with me as much as these guys did. They have me a good price and treated me fairly, even worked with me when I was in a bad spot in my life and was late on a payment. I recommend them to anyone needing a car", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105661709190424066591", "name": "Corionta Nevels", "time": 1517617316157, "rating": 1.0, "text": "I put $1200 down on my car and paid my car note on time. After my first car note, my car broke down. I only had my car a month and a week. I was already having to buy parts for the car when I first got it as well as pay for labor. The car needs a transmission and all 4 control arms. This is the worst car dealership I have ever delt with. I told them if they would buy the parts & I pay for the labor or the other way around that I would do that and they wouldn't. They want me to pay for the parts, labor and my car note. That don't work with me. They are crooked and their cars are lemons. I advise everyone to go to another dealership. They're nice when you're looking and rude after you get it. They look out for who they want to look out for. They did my sister and cousin the same way. STAY AWAY!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109881277018163988060", "name": "J Live Overdrive", "time": 1535237248325, "rating": 1.0, "text": "Run! Run away from this place immediately.  I called to ask about a car. I was told it was there....I called again to check their hours and ask about that car and another.  I was assured they were there.  I said it will take me 45 mins to get there...they said they would be ready for me.  Rick was the guy I spoke to.  I arrive and it's sketchy ....lots of cars with damage and flat tires...Rick greeted me and I said hey I was here to see the Mercedes-Benz C Class\n...he says, Oh the black one? We just sold that last night...I said, I called you twice today before I came..he said well we got this gray one...both front tires flat on the ground, he said...they just need some air...I said nah let's look at the Hyundai, Rick says, it's right here...points to a really damaged vechicle...says let me get the key..and runs off...another man in a cart come by and hands me the key and I get in and the overhead visor was down in my view so I pushed it up to the roof...it fell right back down...again I tried...again, it fell down...I put the key in the ignition and turned it....nothing...the battery was dead...I looked at the guy and he said \"oh you wanted to crank it\"....I said well yeah, how else can we test drive..he said, well we don't crank these cars a lot and some have been sitting for awhile...just needs a jump real quick....I said no, I'm going to take my money and leave...what a sketchy place.  If you buy something here it had better be your last hope for anything cause you will not be happy...they straight lied to me\n..caused me to drive 45 mins for trash.  I had cash in my pocket ready to buy.  Glad I trusted my gut and left....they wanted 3k for that lemon....I picked up something waaaay nicer at a real car dealership, paid cash and rolled out happy...Do Not Buy From Them!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104147855060022400216", "name": "angela harris", "time": 1520082665806, "rating": 1.0, "text": "This place is a joke. My sister went here because she found a car that she wanted.  When we pulled up I had second thoughts because the place was a dump.  There were cars on the lot with flat tires, cars with broken window panes, cars wrapped in plastic, and she asked to use the restroom and the inside of the place was nasty.  She went on and purchased the car and the damn thing put us down less than 10 miles from the place.  She called the sales person and he came with an attitude and of course he claimed it was just out of gas.  Of course they didn't want to refund her money, but a few days later they did and withheld 200 of her down payment.  I would not recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114552753585467361072", "name": "Kathy Levert", "time": 1523842165474, "rating": 1.0, "text": "Why haven't they been reported to the Better Business Bureau?", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110802712628659578541", "name": "Cheneda Anderson", "time": 1471474126701, "rating": 1.0, "text": "The worst buy here pay here auto sales in the state of Alabama, there very nice when your looking and it's very easy to get a car. No matter how desperate you are for a vehicle don't purchase from them, I know the cars are as is but as soon as you leave the lot and two days later it breaks down and the owner Sam tells you things happen and your not asking for money back just a trade then there not good people. I say don't even get out your car to look at any of there vehicles keep driving. They take your hard-earned money and don't even care and it should be against the law.I SAY KEEP IT MOVING, don't give your money away because that's exactly what will happen.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104572018844830071665", "name": "TOMMY SKINNER", "time": 1524508140730, "rating": 5.0, "text": "THEY GOT ME IN A GOOD CAR, REASONABLE AND QUICK!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116579191652511758756", "name": "LAKIESHA MEADOWS", "time": 1571352841168, "rating": 5.0, "text": "I TOLD LEE I WOULD BE BACK. ONLY ONE I TRUST IN THE CAR BUSSINESS", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105732766796553416216", "name": "Ashley Sims", "time": 1561222481816, "rating": 5.0, "text": "Just brought a vehicle and they were very helpful and I could not have asked for any better customer service!!!! If you need a vehicle please check them out!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104114024643707962402", "name": "Lacey Brooks Bennett", "time": 1453228346578, "rating": 5.0, "text": "THE GIRL IN THE OFFICE WAS VERY NICE AND THE 2 GUYS IN THE OFFICE WERE VERY HELPFUL, I HIGHLY RECOMMEND ANYONE LOOKING FOR A GOOD DEAL TO GO SEE THEM!! I GOT A GREAT ACURA TL SO CLEAN AND NICE AND GREAT PRICE....", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107812094740557307431", "name": "Craigslist ad", "time": 1536694979593, "rating": 1.0, "text": "Wow the number of bad reviews. Never seen this low of a rating. These guys buy junk and sell junk just to make a quick box on the back of those with no credit. Stay away and save yourself. Lots of junk that wont last. Proces online differ from real one when its time to sign the papers. Dont fall for them, lots of other dealers out there, stay away!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108039557293968659795", "name": "Saint Whitman", "time": 1517115287068, "rating": 5.0, "text": "I couldn't make it there during regular store hours so they stayed until 8 o'clock and let me test drive a few cars I found the car I wanted for the price I wanted. A+", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103242069765329470408", "name": "Adrian L", "time": 1514397460868, "rating": 1.0, "text": "Buyer beware, bought a car and it lasted one week, no kind of help when you bring back a car from them that no longer works.  This place polishes turds and sells the to the next customer (sucker) to be that person's problem. I'm a single mom and this did not help my situation at all, only made my life worse. DO NOT DEAL WITH THESE FORGIN CROOKS!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115348415235282256554", "name": "latisha beal", "time": 1513593861504, "rating": 5.0, "text": "The salesman laith was very nice an helpful with the purchase of my car will definitely be going back", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108863249425145378230", "name": "DeeDee Anderson", "time": 1471388960541, "rating": 1.0, "text": "Don't take your chances here!! Got a 2005 Ford Expedition, payed the down payment and exactly 3 days later the axle broke on the truck!!! The same day we drove the truck off the lot, we saw 2 ROACHES IN THE TRUCK!! Called the owner about the axel on the truck and he did not help at all. That was money wasted because I have no transportation. Please don't go here and don't listen to the reviews that gives this place 5 stars because it hurt me to give them 1 star because they don't even deserve that!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103985438564204797281", "name": "Preston Cross", "time": 1505411845115, "rating": 1.0, "text": "This place is a disgrace. They sold a friend of mine a car that literally lasted 2 days. The car had only drove for maybe 30 miles total in those 2 days. The car had to be towed and of course the owner would not help pay for towing. At this point it seems the car will need a real heavy repair that will cost thousands.... its one thing for someone to go through this type of headache and stress, but now that I see dozens of comments and reviews stating they had the same problems with their cars being a lemon. DO NOT BUY FROM STALLIONS.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117782222099799755201", "name": "STEVEN BEVIL", "time": 1534432361203, "rating": 5.0, "text": "A+ CAR BUYING EXPERIENCE. IM SENDING PEOPLE YOUR WAY", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110090523894281304328", "name": "nia kelvington", "time": 1522703399968, "rating": 5.0, "text": "I got me a good deal on an Acura from them, looks good and they aint run my credit at all. monthly payments were good and process was quick. Im comin back to get another with my sister at end of May!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114448046557493609349", "name": "Amy Turro", "time": 1527865986534, "rating": 5.0, "text": "Got my second Lexus from there yesterday. I love my cars!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100191347059806882309", "name": "Diana Owens", "time": 1528280325550, "rating": 2.0, "text": "I would reccomend taking your business elsewhere . I was looking at a Honda Civic, on the website the price is 7,490. When I got there to look at the car, he told me the price was 7,999. Then he told me the price is only that way if I pay all cash, and no down payment is acceptable. Its false advertisement, if the car was listed at 7,490 that should be the price final.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103985861949171296085", "name": "DeBrett Williams", "time": 1459619556190, "rating": 1.0, "text": "They are complete scam artist. If you cherish your hard earned money DO NOT buy from them. Don't fall for the nice talking it's a front. The son is a punk and will curse the women out.....very disrespectful. The cars are total lemons and they will \"Jerry rig\" it up till you leave the lot then BOOM there goes your car. Several have caught fire. By the way, they won't give you your money back either", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111930248455328699913", "name": "alice pickerton", "time": 1521830435625, "rating": 5.0, "text": "Me and my mom bought cars from here and both cars have been great. we  were referred by a close friend. they told her she didn't have to make her payment since she brought us in. they worked with me on my monthly payment since im on a fixed income and they didnt check my credit because it is badd lol", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109318424367175023136", "name": "Rene' Howell", "time": 1527142429118, "rating": 2.0, "text": "Cars don't present well,  detailing and a wash would help. Nice salesman", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "115075422751605548925", "name": "Cindy Knight", "time": 1520021601958, "rating": 5.0, "text": "I was referred to them by a friend who got a car from there years ago and never went anywhere else. Best Buy here pay here I've dealt with and I've dealt with MANYY!! Finding a used car can be a nightmare because there are cars that end up having problems..that's why you check the car your buying. They don't hesitate to let you test drive the car like some other bhph dealers around. Cars from most bhph places are sold as is but I've had my brakes and roaters replaced by them much cheaper than it would have costed me anywhere else. Just check what your buying your not forced to buy anything. Your Treated the way you treat people. They were so understanding when I was going through some tough times, where I had my car reposssesed after being late on a payment one time without a phone call through some other guys around town. The employees at stallions have called me when I miss my payment and let me know that I need to make a payment before I have to pay a late fee!! Not just repo my car the first second they can", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111932482694386675709", "name": "Taunya Jones", "time": 1452811820116, "rating": 5.0, "text": "The guys are friendly and are very flexible with getting you into a good car.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100568305318378844491", "name": "Michael Williamson", "time": 1528833612145, "rating": 1.0, "text": "Warning Warning Warning: Don't buy a car here...I Purchased a car for my son from this place. This guy \"Matt\" lied to us several times, the car started leaking coolant within 3 days, the battery went out, water pump went out and the Valley coolant hose started leaking. Matt wouldn't return my calls or text messages. All this cost me over 3k to have fixed. Matt is now selling cars on Craigslist so Beware.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114882140259544220086", "name": "Sheena Tkay", "time": 1552952472751, "rating": 5.0, "text": "I made a great purchase here", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111020505892933388295", "name": "Zachary Hunter", "time": 1583887943750, "rating": 1.0, "text": "Sketchy, uninformed, car was not in condition that it was stated as.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114853891509202138268", "name": "Honie Button", "time": 1567905237774, "rating": 3.0, "text": "Prices are a bit steep but in line with most buy here pay here places", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112228450626163461368", "name": "Mesha J", "time": 1497452182924, "rating": 1.0, "text": "Horrible place to purchase a vehicle. Post cars that they don't have. Cars are completely junk vehicles. All the reviews with Huneidi last name are family so don't believe it. Your car will break down in less than a week & they won't help you whatsoever. The girl who works in office is retarded. The father & son are scammers. They post vehicles in Facebook market not letting you know it's a car lot. RUN & SAVE YOUR COINS because they are the worse bhph dealer in the state of Alabama.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104033704065785123088", "name": "BYRON PROCTOR", "time": 1525113173536, "rating": 5.0, "text": "good peeps. never had no problems.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "118027607705546449054", "name": "Aeriol Barbee", "time": 1439611719267, "rating": 5.0, "text": "Great service great cars reasonable price and willing to work with you...", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "118343913183436958271", "name": "Jashay Valaza Gragg", "time": 1523473401286, "rating": 1.0, "text": "Worst car place ever.. I got a car from them, I didn’t even have it for a year and the motor started knocking. At first little things was going on with the car. Then it got bigger and bigger leading up to the motor going out. Don’t shop with them!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114643238918796259621", "name": "Frank Bloomington", "time": 1583281292434, "rating": 5.0, "text": "Nice people!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116471229491482516058", "name": "Mcquael Frazier", "time": 1436988588846, "rating": 1.0, "text": "DO NOT BUY CARS FROMS \"STALLIONS AUTO SALES\" THEY ARE TAKING ADVANTAGE OF BLACK PEOPLE AND THEIR CARS ARE NO GOOD!!!! WHEN YOUR CAR BREAKS DOWN, THE'LL PULL IT PUT TAPE ON IT AND SELL IT TO ANOTHER VICTIM!!! DON'T DO IT!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107094768046444728335", "name": "Chad Holloway", "time": 1557969836990, "rating": 1.0, "text": "Sold me a lemon, wouldn't make it right.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106003769121287245588", "name": "jameshia wright", "time": 1525466342779, "rating": 5.0, "text": "they is the bestest. i don have nun to complain about.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111231096453428419850", "name": "Ricky Bush", "time": 1551557736774, "rating": 1.0, "text": "It was very bad the car we test drove like to had killed us the front was about to come off do not go there", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111522591237929612658", "name": "monjea gant", "time": 1584027218662, "rating": 5.0, "text": "Great deals", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "103243579178590674984", "name": "April Quarles", "time": 1489704710632, "rating": 4.0, "text": "Nice place to get a  used car", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112364392125083941675", "name": "Mario Vienna", "time": 1558893870821, "rating": 5.0, "text": "Talked to Lee and Rick, they knew their cars", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107459660214475049257", "name": "J.R. McKINNEY", "time": 1600425726856, "rating": 2.0, "text": "Overpriced", "pics": null, "resp": {"time": 1615016471856, "text": "Dealerships buy cars from us to resell themselves because we price our cars too low. Very often."}, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "118222933461184764459", "name": "Edogg", "time": 1547877095377, "rating": 5.0, "text": "Friendly people and great prices!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113890797663407231864", "name": "Jasmine Demore", "time": 1544953059153, "rating": 5.0, "text": "Great dealership!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110955878904540425782", "name": "D Gelpin", "time": 1484585051805, "rating": 1.0, "text": "You'd be a fool to even entertain the thought of setting foot on that lot... Take it from a fool...", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108584579415603057650", "name": "Shane Caton", "time": 1552186739359, "rating": 5.0, "text": "Awesome folks here", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "108175351520332605733", "name": "Steve Robinson", "time": 1563146797822, "rating": 4.0, "text": "2nb", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109195789674628909937", "name": "Edward Cowan", "time": 1560640336931, "rating": 5.0, "text": "Large selection of vehicles to chose from", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112582686429164810162", "name": "Kellen Brewer", "time": 1523506885406, "rating": 5.0, "text": "They will work with you and the fact they don't credit check is the best", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109895534948400432316", "name": "catherine Gardner", "time": 1540326028623, "rating": 5.0, "text": "Nice Selection!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100327981298506875971", "name": "Letitia Hairston", "time": 1546705650464, "rating": 1.0, "text": "Buyer Beware!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107675207081553817956", "name": "Belinda Wright", "time": 1530149843472, "rating": 5.0, "text": "It's", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102158914785686003531", "name": "Shanequa Moore", "time": 1520549370596, "rating": 3.0, "text": "Great cars", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117836317675693623033", "name": "Jeffery Townsend", "time": 1520106554341, "rating": 5.0, "text": "Amazing car!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109269137012685085011", "name": "Angelica Baity", "time": 1527799217475, "rating": 1.0, "text": "Very bad cars", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105772502295547913955", "name": "Yurmonta40 Watts", "time": 1506455794022, "rating": 1.0, "text": "Had to call several time.and when someone answer the phone was very rude and just hung up in face!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "112001652154235049653", "name": "Darlene Strong", "time": 1517497912508, "rating": 1.0, "text": "Never in my life will I buy a car from them, very disrespectful and their paper work is off point, you better keep up with your payments are else you will be paying for your car twice....", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116222491953180099666", "name": "James Willis", "time": 1529822461124, "rating": 5.0, "text": "Very Satisfied returning customer", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114141142658223090756", "name": "Jermart Williamson", "time": 1505138458927, "rating": 1.0, "text": "Stallions Auto Sales are a bunch of crooks they sold me a vehicle that broke down on me and family which left us stranded on the highway for 3-4 hours so my advice don't buy a vehicle from them go somewhere else", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "113216133040086284704", "name": "amy huneidi", "time": 1440692545722, "rating": 5.0, "text": "I've bought cars everywhere, nobody treated me and worked with me as well as these guys did", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "107800039790031282392", "name": "John Britting", "time": 1483037766431, "rating": 1.0, "text": "Put a deposit on a car and was told a story to find out they sold our car to someone else for more ! Not honest !\nSTAY AWAY !!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "117836857030726866540", "name": "Lora Rich", "time": 1471784641459, "rating": 1.0, "text": "Worst car lot I have ever dealt with. They are rude one of the ladies in the office hung up on me cause I asked them a question. My advice find another car lot.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "110322434645252667794", "name": "Qunitus Moore", "time": 1460217038164, "rating": 1.0, "text": "They cars are junk do not buy any car from them the are lemons", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "105511360878090203597", "name": "T. Taylor", "time": 1455393802786, "rating": 1.0, "text": "COMPLETE LEMON DEALER!!!!!! RUN!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "100797109236465651153", "name": "janiah williams", "time": 1449244242181, "rating": 1.0, "text": "Don't buy from them!!!!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102287259851641749459", "name": "Savannah Pate", "time": 1435437329604, "rating": 1.0, "text": "Was very rude over the phone including some cursing and not answering questions", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "111807431818465781328", "name": "Jorge Alagagana", "time": 1583771500391, "rating": 5.0, "text": "(Translated by Google) very good cars and very cheap\n\n(Original)\nmuy buenos autos y muy baratos", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "104389485843212325065", "name": "Javi Motobello", "time": 1564612884614, "rating": 5.0, "text": "(Translated by Google) Very good cars and good prices. Thank you.\n\n(Original)\nMuy buenos autos y buenos precios. gracias.", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "106724406135419392644", "name": "fernando ruiz", "time": 1555361290096, "rating": 5.0, "text": "(Translated by Google) Very good wey cars. Thank you!\n\n(Original)\nMuy buenos coches wey. Gracias!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "116290943837583998481", "name": "Phi Lang", "time": 1567573132800, "rating": 5.0, "text": "(Translated by Google) Nice Kia!\n\n(Original)\nNice Kia!", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "109363736434306732188", "name": "Yolanda Molina", "time": 1544481772643, "rating": 3.0, "text": "(Translated by Google) good place and good business is done\n\n(Original)\nbuen lugar y sehacen bueno negicios", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "102318635920857744847", "name": "jorge garcia", "time": 1564613881702, "rating": 5.0, "text": "(Translated by Google) Thanks guys\n\n(Original)\ngracias muchachos", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "114595190661057095484", "name": "Pablo Viera", "time": 1558466913326, "rating": 5.0, "text": "(Translated by Google) Thanks guys !\n\n(Original)\ngracias muchachos !", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
{"user_id": "101525424379571671982", "name": "RAUL CARERA", "time": 1548805428779, "rating": 5.0, "text": "(Translated by Google) very good\n\n(Original)\nmuy buenos", "pics": null, "resp": null, "gmap_id": "0x888923b189b005c9:0x6db750ee718606e9"}
