{"user_id": "117720623755051928461", "name": "Edward Carr", "time": 1613434565000, "rating": 1.0, "text": "Couldn't even get into the store due to them only serving one person at a time. I'll be spending my money with other hobby shops.", "pics": null, "resp": {"time": 1613507476726, "text": "Edward, we are very sorry we were unable to serve you immediately when you arrived. Unfortunately with the current pandemic we are trying to protect both our customers and employees to the best of our ability and this policy is reflective of that. We know that your time and all of our customers time is valuable (as is your potential business with us) and we would be happy to assist you with preparing an order prior to your arrival we are available to communicate with your through email (Gametimehobbiesopelika@gmail.com), Facebook messenger (https://www.facebook.com/gametimehobbies), or even over the phone (334-737-6960) to go over our offerings and a potential order should you be unable to wait for any customers we may be currently assisting. We appreciate your feedback and hope you consider giving us another chance in the future to earn your business.\n\nDrew"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "113998136546407818988", "name": "Chris", "time": 1568780166826, "rating": 5.0, "text": "This is a great local store that has always taken care of me and helped me find what I need. The staff is always really friendly and helpful. The play area is large and clean, they have a great selection on magic and related accessories, and they have a clean restroom. There’s a lot of care that goes into this store, and it shows. I’ve been to plenty of LGSs that left a lot to be desired in terms of service, product selection, and cleanliness, and I have never felt that way at Game Time. I highly recommend this place to anyone wanting to play some magic or one of the other card games they host events for.", "pics": null, "resp": {"time": 1570118501948, "text": "Thanks Chris for your review and kind words.We sincerely appreciate your business and enjoy having you as a member of our community!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "103876320464509850135", "name": "Michael Fain", "time": 1591472272583, "rating": 5.0, "text": "The staff at Game Time Hobbies is beyond helpful and are always putting customers first. I recently purchased a copy of Dominion: Guilds and Cornucopia and have been thoroughly satisfied!!! In the past I have played Pokemon TCG in store (no longer offered) and learned how to play magic, the staff taught me and helped me get started! Hoping that more dominion expansions get stocked because I will definitely be buying them. Easy 5/5, although I would love to see the Pokémon prereleases come back :(", "pics": null, "resp": {"time": 1591476665796, "text": "Thank you Michael for your review, we sincerely appreciate your business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "103365313428599869664", "name": "Tara D.", "time": 1593821824899, "rating": 4.0, "text": "Limited to 1 person at a time due to virus. Owner super nice.", "pics": null, "resp": {"time": 1593825947922, "text": "Hey Tara, thank you for the kind words. We are definitely sorry about the customer limit currently but want to air on the side of caution to protect all members of our community. When things begin to return to normal we have tables set up for guests to play games we carry and we run events for those products as well. Thank you for your business and review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "100910854808193602578", "name": "David Axford", "time": 1555126427271, "rating": 5.0, "text": "Recently got into MTG and was met with such friendly response by everyone at the store. Excellent people run the store and excellent people show up. I will definitely be coming back! Thank you for the warm welcome to the MTG community!", "pics": null, "resp": {"time": 1555129364786, "text": "Hey David! We are glad you felt welcome! That means so much to us. It was great playing with you tonight! Thanks for the kind words and welcome to the community!\n\n-Drew"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "114501910072347154533", "name": "Stephen Colburn", "time": 1556335361885, "rating": 5.0, "text": "Great table top gaming site!  Awesome people,  always something going on,  great board game,  d&d, and magic the gathering selection.  If they don't have it they can usually get it for you pretty quickly.", "pics": null, "resp": {"time": 1565124116780, "text": "Thank you Stephen we sincerely appreciate your review and business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "105166401914924774327", "name": "Meme Machine", "time": 1566523328215, "rating": 5.0, "text": "Incredibly friendly people and the staff is really knowledgeable. Fun and clean space to play cards, DnD, board games, etc, and they have a great selection of products, as well as fair prices. I highly reccomend them to be your local game store!", "pics": null, "resp": {"time": 1570118565649, "text": "Thanks Meme machine we appreciate the review and kind words! We are glad you enjoy our store!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "102093818294092344970", "name": "Drew Mackay", "time": 1542246347734, "rating": 5.0, "text": "Great store carries the best board games, trading card games, and role playing games. Huge selection of RPG miniatures, dice, and trading card game accessories. Also a very large magic the gathering singles collection with great prices. Events every day they are open and friendly employees. Definitely check this place out if you like gaming.", "pics": null, "resp": {"time": 1542247022073, "text": "Thanks for your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "101787743300567717554", "name": "Jordan Gilchrist", "time": 1553921901253, "rating": 5.0, "text": "Great place for cards and board games. I love the magic selection and events they have as well as the cardfight vanguard tournaments", "pics": null, "resp": {"time": 1553987499369, "text": "Thanks Jordan we appreciate your review and business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "105948039914730222074", "name": "Mr Loyal", "time": 1566193402886, "rating": 5.0, "text": "Pretty nice employee, selection is fairly limited but its a small shop so im not really complaining. I'd rather spend my money here instead of Walmart or target. They have several tables that could be used for more product but it seems like theres a larger interest in letting the community come together and i respect that 100%", "pics": null, "resp": {"time": 1566220152622, "text": "Thanks for the review Mr. Loyal we appreciate it. If there is ever a product you are looking for that we don't carry or currently have in stock we would love to try and order it for you as well!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "102115748208728721533", "name": "Kuhlu", "time": 1488548330801, "rating": 5.0, "text": "The staff are super friendly,  knowledgeable and happy to introduce anybody with limited knowledge to fun board/card games. The atmosphere is great for hanging out, and they have tons of different board games that are free to play (which is great for those of us with little money who want to hang out around town.) Definitely worth checking out this little local gem.", "pics": null, "resp": {"time": 1507127205880, "text": "Thanks Katelyn we appreciate you review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "115639473201888006791", "name": "Mason Monday", "time": 1525390523370, "rating": 5.0, "text": "Great location with very friendly staff and clientele.  I buy most of my cards here because of their generous pricing.  Be sure to learn who Ethan is and how to properly deal with him.", "pics": null, "resp": {"time": 1525428884776, "text": "Hey Mason thanks for your review we definitely appreciate the kind words! If you play commander and want any suggestions for keeping Competitive with Ethan we would be happy to help, that being said I feel it's always the proper choice when playing a game of commander for everyone to take Ethan out first haha! Again thanks for shopping with and spending time with us we certainly appreciate your business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "104359565120997458295", "name": "Ethan Thomas", "time": 1534523513457, "rating": 5.0, "text": "Fun atmosphere, lots of board games, MtG cards, and D&D accessories. There's also a room in the back you can reserve for D&D sessions and the like.\nI recommend stopping by for Friday night Magic.", "pics": null, "resp": {"time": 1534660074454, "text": "Thanks Ethan we appreciate your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "100396277396039906113", "name": "shannon smith", "time": 1582413376813, "rating": 5.0, "text": "Great shop lots of game and friendly people", "pics": null, "resp": {"time": 1582418185464, "text": "Thanks Shannon we appreciate your review and your business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "100126511129465293612", "name": "Jordan Morris", "time": 1537809113511, "rating": 5.0, "text": "The owner Drew is always so helpful. Whatever you're gaming needs he can help you or direct you to the right place. I love playing D&D here weekly! D&D 5e playtime is Thursdays at 6pm go to the back room and introduce yourself.", "pics": null, "resp": {"time": 1507127251281, "text": "Thanks Jordan"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "108801123969736003900", "name": "Laura Conklin", "time": 1532813260674, "rating": 5.0, "text": "Great selection for anyone who plays Magic,  Pokemon,  DnD, Star Wars Legion,  board games,  or other similar games.\nThey have a big bin of games that are free to sit and play through.\nVery friendly,  relaxed family atmosphere.", "pics": null, "resp": {"time": 1532818912141, "text": "Thanks Laura we sincerely appreciate your review and your business! We love having you as a part of our community."}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "103825707532627521342", "name": "Hank Womble", "time": 1485651978139, "rating": 5.0, "text": "Excellent place to play board and card games. Very clean and well kept with an impressive stock of games and accessories. There is a bathroom in house and from what I can tell, many events throughout the week hosted there. Will go back soon!", "pics": null, "resp": {"time": 1507127282682, "text": "Thanks Hank we appreciate the kind words."}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "100547692925865824480", "name": "David Klash", "time": 1540756379524, "rating": 4.0, "text": "Small game store.  Primarily Magic the Gathering. Also board games and D&D. No Games Workshop (Warhammer) at all but does have Reaper D&D miniatures and Army Painter paints. Several tables for MtG tournaments and such.", "pics": null, "resp": {"time": 1540764136942, "text": "Hi David! Thanks for taking the time to review our store! We don't Carry Games workshop but we do have the availability to order their products for customers if you are interested in their line! Also we don't currently stock reaper the many minatures we carry are from the Wizkid D&D line. Hope you had a good experience overall!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "108787687950792337936", "name": "Skylar Skylar", "time": 1562394109990, "rating": 5.0, "text": "Worst Gamestop Ever, i came in looking for cooking mama and all they had babysitting mama. Never again will I buy my bakugan from here. Bey lade bey lade let it rip!", "pics": null, "resp": {"time": 1565124071531, "text": "Skylar, We appreciate your rating and although your review is fabricated we appreciate the humor!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "108104789573865147655", "name": "Sunny Grisham", "time": 1534650065262, "rating": 5.0, "text": "Good place to buy cards and the play games. The staff is very knowledgeable on their items", "pics": null, "resp": {"time": 1534660010471, "text": "Thanks Sunny we appreciate the kind review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "106588080780293493790", "name": "Mirage", "time": 1506977343122, "rating": 5.0, "text": "The owners are really nice. Great local scene for Pokemon TCG and Magic the Gathering. Great selection on board games too!", "pics": null, "resp": {"time": 1507125930527, "text": "Thank you! we appreciate the kind words and your business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "111918319995649860217", "name": "Hart", "time": 1556141326556, "rating": 5.0, "text": "This is a great Local Gaming Store and the staff is awesome and helpful. I love doing business here", "pics": null, "resp": {"time": 1565124159252, "text": "Thank you Hart for your review and for your business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "105308121938484271706", "name": "jason bond", "time": 1542998597679, "rating": 1.0, "text": "I went in on there for black Friday and they had sales so naturally I looked at their 50% sales. They had cards agasint humanity for 49.99 with 50 percent off. This store doubled the price and then used the discount to make it look like a deal. The game normally goes for 25 dollars. This is predatory. Either have a sale or dont.", "pics": null, "resp": {"time": 1543005807275, "text": "Hey Jason sorry about that. We typically sell most all board games for MSRP. Unfortunately we are not able to do that for CAH as they are exclusive to Target and Amazon, so they only way for us to carry this game is to order through Amazon and increase the price since they do not work with brick and mortar stores. We are planning on not stocking this item in the future which is why it's on the sale shelf at selling at 50% of the marked price. We literally just get back our initial investment, which isn't predatory although I can certainly understand why it may seem that way. Sorry for the misunderstanding and we hope that you will give us a second chance in the future.\n\n-Drew"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "114467720980057636299", "name": "David Pugh", "time": 1542485717948, "rating": 5.0, "text": "Great selection of board games and a super friendly and knowledge staff!", "pics": null, "resp": {"time": 1542488879887, "text": "Thanks David we appreciate the kind review! Hope to see you again soon!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "114155742541366169115", "name": "Randy Wade", "time": 1536600186302, "rating": 5.0, "text": "Drew and crew are the best,  engaged,  and look ot for their loyal customers well.", "pics": null, "resp": {"time": 1536601460794, "text": "Thanks Randy! We really appreciate your kind words and review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "107803537001118090587", "name": "Michael Smith (MrMahga)", "time": 1527825378019, "rating": 5.0, "text": "Both the staff and the regular customers that I've run into have been extremely helpful every time I've gone in. Whether I'm looking to buy a $100+ box of magic the gathering boosters packs or looking to trade a few cards, I've always been treated with respect and genuine kindness. I won't go anywhere else for my gaming needs.", "pics": null, "resp": {"time": 1527840062170, "text": "Thank you Michael, we sincerely appreciate your kind review and are glad you enjoy the service we provide. Thanks for shopping and spending you time with us!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "113598792995136184784", "name": "Joey Stuart", "time": 1531696446495, "rating": 5.0, "text": "Staff is friendly and helpful, and do everything in their ability to make customers happy.", "pics": null, "resp": {"time": 1512875906873, "text": "Thanks for your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "107846769115783442530", "name": "John Thomas", "time": 1559605493001, "rating": 4.0, "text": "I liked some of the activities in there.", "pics": null, "resp": {"time": 1558630106677, "text": "Thank you John for your review. If there is anything you think we can improve about our business so we can better satisfy our customers please let us know!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "113598792995136184784", "name": "Joey Stuart", "time": 1531696446495, "rating": 5.0, "text": "Staff is friendly and helpful, and do everything in their ability to make customers happy.", "pics": null, "resp": {"time": 1512875906873, "text": "Thanks for your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "102321021186549150368", "name": "Amy Hewitt", "time": 1499610016485, "rating": 5.0, "text": "Great game store with great people. Lots of fun!", "pics": null, "resp": {"time": 1507127013978, "text": "Thanks Amy! We are glad you enjoy the store!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "108158070162275261882", "name": "Christopher Sommerfield", "time": 1521050905169, "rating": 5.0, "text": "Loads of Magic the Gathering events. Courteous sales team.", "pics": null, "resp": {"time": 1521134925107, "text": "Thanks Chris!  We appreciate your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "109973314376290691340", "name": "Logan Uvula", "time": 1548623839561, "rating": 5.0, "text": "Excellent service and great gaming environment!", "pics": null, "resp": {"time": 1548651134821, "text": "Thanks Logan we appreciate your review and your business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "109954623713943006847", "name": "Anna Powell", "time": 1548814201417, "rating": 5.0, "text": "Great place. Very friendly.", "pics": null, "resp": {"time": 1565124192163, "text": "Thanks Anna! we are glad you had a great experience here!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "117595479388874095031", "name": "Corey Lowenberg", "time": 1524843903276, "rating": 5.0, "text": "Friendly and helpful staff and owners. A pillar of the local gaming community.", "pics": null, "resp": {"time": 1528457147163, "text": "Thanks Corey for the review we appreciate it!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "100589385270808767202", "name": "Ogrox1", "time": 1565208684577, "rating": 5.0, "text": "good owners and atmosohere", "pics": null, "resp": {"time": 1565270625040, "text": "Thanks for the Kind Review Ogrox! we appreciate your business."}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "108134006510951501290", "name": "Clifford Henderson", "time": 1527887561620, "rating": 5.0, "text": "Helpful staff, great selection, easy to find location.", "pics": null, "resp": {"time": 1528456980772, "text": "Thanks Clifford! We appreciate your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "116788055537121087302", "name": "Casey F", "time": 1564953092678, "rating": 5.0, "text": "Great store and staff!", "pics": null, "resp": {"time": 1565123993645, "text": "Thank you Casey for your review and business!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "113785202095940203382", "name": "Mike L", "time": 1494214599009, "rating": 5.0, "text": "It's a fun, friendly, clean gaming store. If your into magic, board games, or anything else geeky it's a must visit if your in the area.", "pics": null, "resp": {"time": 1507127169482, "text": "Thanks Michael! Hope you are doing well!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "103314513456644330614", "name": "Jeri Ward", "time": 1488121337973, "rating": 5.0, "text": "Amazing staff and a great selection.", "pics": null, "resp": {"time": 1507127229762, "text": "Thanks Jeri we appreciate your review!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "109101162734056437989", "name": "MALGUS78 STARKILLER", "time": 1521843746132, "rating": 1.0, "text": "This place is ok if you are into the role playing board games but do not stop by looking for model building kits or diorama accessories because they do not carry them.", "pics": null, "resp": {"time": 1522070693358, "text": "Hi Malgus, I am sorry you did not find what you were looking for. Unfortunately with the cost of some product lines or accessories we can't carry everything. We specialize in trading card, role playing and board games. I don't think its fair to fault us with a 1 star review because we don't carry other product lines. However if you are looking for Model kits Hobby Town near Panera Bread or Hobby Lobby in Tiger Town may be a places that would carry what you need."}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "109755505470288866369", "name": "Phillip Cross", "time": 1503163065669, "rating": 5.0, "text": "Very helpful staff", "pics": null, "resp": {"time": 1507126809334, "text": "Thanks!I am glad we were able to help you out!"}, "gmap_id": "0x888cf2a9e40c9db9:0xa43e564d4401ddc1"}
{"user_id": "101310756448659979179", "name": "John Moody", "time": 1623560722836, "rating": 5.0, "text": "Great place. Great people. Mark is top on my list of shop owners who really connect with people. All around Great", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "107133335214731195713", "name": "Jacob Burrell", "time": 1617215426619, "rating": 5.0, "text": "Very helpful staff. Friendly and knowledgeable! Will be using them again!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105324516273711896320", "name": "Thomas Smith", "time": 1606629003384, "rating": 5.0, "text": "I love buds place. Great games,great friends. It's the one thing I do for myself every week", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100934268910059679156", "name": "Courtney Campbell", "time": 1613889730960, "rating": 5.0, "text": "Always fun to go here every Saturday i really enjoy it", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105191454872307993461", "name": "roger crossgrove", "time": 1614907490326, "rating": 1.0, "text": "Said open 3 times. Visited 5 hours before closing 3 times. Closed 3 times.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113669550756749181710", "name": "Dustin Caston", "time": 1621591571076, "rating": 5.0, "text": "Great place for hobby supplies", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109929605203784838004", "name": "Ethan Forrest", "time": 1602891087026, "rating": 5.0, "text": "Great place, we went there to play games, had a wonderful time!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116652009315478167368", "name": "Grillenheimer", "time": 1583643752332, "rating": 5.0, "text": "Small yet they have a ton of cards, games and accessories.  Super nice owner.  They even sell Transformers deck boxes!  But no boosters.  They even have the large top loaders for characters like Omega Supreme, Fort Max, Metroplex and Trypticon for only $1.  Rooms upstairs and multiple tables downstairs for game play.  Parking can be an issue but Leeds doesn't have that much traffic.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106102417184669762480", "name": "Joshua French", "time": 1551901031775, "rating": 5.0, "text": "Bud's Place Games is the place for table top games in Leeds. They have events, free private rooms, and a great selection of games of all types to buy. If they don't have it they are more than willing to try and order it for you and it is almost always at least comparable to Amazon, sometimes it is even cheaper.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "110075713610063946169", "name": "SadMoonBeam", "time": 1548264850573, "rating": 5.0, "text": "I order cards online from them and pick up in store, super easy and convenient. Saves me time and waiting for cards from eBay. I highly recommend more people use this, so more cards can be put in the online store. Buds place is also a great place to play table top rpg games, with plenty of room to play.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103051368144766635882", "name": "Rick Goudeau", "time": 1555698788472, "rating": 5.0, "text": "A great place for playing games and to get your games and cards. Nice selection of games to choose.  My FLGS with the emphasis on Friendly. Love having my weekly game night there.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109085189746461005328", "name": "Stephanie Newman", "time": 1574523088522, "rating": 5.0, "text": "We go to Bud's at least two times a month. Great place to game and the people are great.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105762132944531395121", "name": "Chris McCormick", "time": 1551538625506, "rating": 5.0, "text": "Hands down the best place for gaming and your gaming needs. Owner is incredibly friendly and offers the best prices around coupled with the best gaming environment around! Love this place and wouldn’t go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113019709584251410314", "name": "Andrew Thomas", "time": 1568136308929, "rating": 4.0, "text": "Good place. These guys are very accommodating to the table top gaming community.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "115877518597041300513", "name": "Mark", "time": 1572104073156, "rating": 4.0, "text": "Great game store - awesome range of boardgames and plenty of space.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111083237564336965364", "name": "Seth Hiatt", "time": 1570824115258, "rating": 5.0, "text": "Great store!  Mark is a great guy and really knows his stuff!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109235889235142187176", "name": "Nicholas Toth", "time": 1559470092764, "rating": 5.0, "text": "Really great staff. They actually care and want to see people happy.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108000167801958027226", "name": "Serendipity Awaits", "time": 1539260733255, "rating": 5.0, "text": "Big fan of Bud's place!! This was my 1st visit in 4 plus years.  They've made some awesome improvements!! The store seems more family friendly and they have tons and tons of tabletop games to encourage family time at home!!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114150549155963493646", "name": "Lynn Culpepper", "time": 1353361547245, "rating": 5.0, "text": "An awesome place for gaming and socializing with your geeky friends.  It is the BEST place for buying or selling MAGIC singles.  They are fair and honest.  They have air conditioning, bathrooms, snacks and cold drinks, and A LOT of tables for whatever game you want to play!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105259615434253707284", "name": "Adora Scruggs", "time": 1554160717508, "rating": 5.0, "text": "Very friendly and helpful staff and good selection of items. There are also nice rooms upstairs to have separate games going at the same time.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "117507005839139856136", "name": "Justin Moorer", "time": 1352994874269, "rating": 5.0, "text": "I have been coming to this store for the last 2 years. The owner is very helpful and seems upbeat.  I found this place through my best friend and have been coming here ever since.  The staff is wonderful and the game choices are really excellant.  Kudos to the owner and the staff for making this my place to hang out on lunch from work or just to go during the week and weekend.  Friday Night Magic is one of their busiest nights!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108511844308611778486", "name": "Michael Streufert", "time": 1531631200745, "rating": 5.0, "text": "The guys here are amazing with my kids and very helpful.  They host assorted tournaments every week.  There are a lot of tables to play on and they have a loaner library of games you can try out.  I have known these guys for a long time and enjoy visiting.  Bud's Place is very prompt to reply to Facebook messeges.  I cannot say enough nice things about this place.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "118342818184107114104", "name": "John Sotiropoulos", "time": 1563568140002, "rating": 5.0, "text": "Awesome.  Pokeman, Magic the gathering, Yu-Gi-Oh are played frequently.  They buy cards.  Crowded every weekend.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106721273788422653046", "name": "greatcornholio", "time": 1373067921975, "rating": 5.0, "text": "Its rare to find people who love what they do as much as the guys here seem to. They are honest and hard working and will do their best to get you the best deal. Its by far the best place I have found to get Magic the gathering singles even cheaper than you can find them on eBay. If you're ever in leeds and a gamer you should stop in and see what you've been missing out on.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100768510409227105822", "name": "Jesse Sierke", "time": 1515333763157, "rating": 4.0, "text": "I had a great time here playing games with awesome people. The staff were supportive of my needs, and the selection of items for my game (D&D Adventurers League) was pretty good. I'd love to help them set up some display tables for wargaming, but I understand that space is a premium.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116941289609668194524", "name": "Roland Garofalo", "time": 1526992392090, "rating": 5.0, "text": "I have not visited their physical location, but I must say their customer service is phenomenal. A few months back I ordered some MTG cards online that came through their store. Unfortunately, the cards never shipped due to a processing error, no big deal. I gave 'em a call, and they immediately put all their effort into fixing the error and sending me the cards. AND they also included some foil promos in the package that were worth way more than the cards I purchased originally. It's great to see a LGS that truly supports their customers. If you are in the area, I highly recommend checking them out.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104099598367036383258", "name": "adam ledbetter", "time": 1563686042579, "rating": 5.0, "text": "Great store! Always a good experience when I go here.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108807375376158388387", "name": "patrick tatum", "time": 1539811042124, "rating": 5.0, "text": "I’ve been a regular for years. Mark is one of the most kindest and caring store owners I’ve ever met. Matt Johnson the Gen. manager is a professional and keeps a tight ship as well as he works with customers.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102988102716022634416", "name": "Aaron", "time": 1558746079697, "rating": 5.0, "text": "Have generally always had good experiences here.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102816650738572407672", "name": "M M G", "time": 1540014914408, "rating": 5.0, "text": "Great selection of board games and card games. Drove 30 miles to check the store out, wasn't disappointed at all.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109624069832771882442", "name": "Brian Graves", "time": 1486559849916, "rating": 5.0, "text": "Best game store in town.  The owner genuinely cares about his customers and will stay open late just for the players to enjoy sometimes.   Very fair on pricing and the best selection of products around.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108301385463687097775", "name": "Ian McPherson", "time": 1530543363317, "rating": 5.0, "text": "Nice small shop. Plenty of space for playing really anything. There are private rooms upstairs for dnd or boardgames.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "101187465808003844331", "name": "Morgan Pendley", "time": 1508104094990, "rating": 5.0, "text": "Absolutely wonderful shop, one of the best in the Birmingham area. Extremely friendly owner and staff, by far the best service around. Good selection of product, everything from MTG to board games.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "101956140575368842664", "name": "thomas hames", "time": 1577199536440, "rating": 5.0, "text": "Always a great place to game.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109641766410808790189", "name": "Captain England", "time": 1517781411551, "rating": 5.0, "text": "Best place I've ever been to for games. Great for Magic, Pokemon, and Vanguard card games. Nowhere else is as good for Board games, manager is extremely knowledgeable. Has multiple rooms/areas for board gaming, rpgs, or  anything the like.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103437716099532124221", "name": "timothy dumas", "time": 1441406287903, "rating": 5.0, "text": "This store is pretty amazing. I've been going weekly for two years and the Owner Mark is exactly what you want for this type of store. He is upbeat, honest, hard working and willing to help you out if he can. their prices for mtg are going to be the lowest in the birmingham area because of his pricing system. he has all the standard cards in binders so you can flip through at your convenience,with a lap top connected to his store sitting right beside them so you can check his stock online just as fast as he can. he has two glass cases with his more expensive cards which are organized like they should be by color, white, blue, black, red, green and artifact followed by lands. and also by format, standard, modern, legacy, commander. If you never have been before it is worth your time if you're close to stop in and say hey and look around. Thanks for the great store Mark!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108341074087600503589", "name": "Tanner Buckley", "time": 1429142507405, "rating": 5.0, "text": "This is a really good place with a lot of good cards. They have very good prices and knowledgeable. I wish that they got more attention then what they do!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114917561558426515774", "name": "Louis Frohock", "time": 1508109615880, "rating": 5.0, "text": "An excellent shop, one of the best in the state. The friendliest owner and staff, the sweetest service around. Great selection of product, everything from card games to board games.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104943155967530499750", "name": "Jacob Lee", "time": 1516514327405, "rating": 5.0, "text": "Matt and Alex are super awesome. The atmosphere is fantastic and they assist however they can. Will be back starting next week!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113951051217584677920", "name": "Kevin Cassidy", "time": 1522463625908, "rating": 5.0, "text": "Decent little shop, very friendly service, and great prices and availability. Came in looking for some card sleeves, deck box, storage box, and possibly a few single Yu-Gi-Oh cards. He had all of the above, including a computer for ordering cards on their own website, then receiving them in only 15-20 minutes (their warehouse was right up the street). Place was very lively and busy with players too.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109332471925722082366", "name": "Rachel Kendrick", "time": 1579636139863, "rating": 5.0, "text": "It's fun, everyone is very friendly, and it's local.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109926422530972863291", "name": "Shawn Temple", "time": 1422398386329, "rating": 5.0, "text": "Best prices I've found in Alabama by far, below TCGplayer Mid price. Great selection, very organized, amazing owner. Parking isn't the best but I've been at worse places. If you're in the area check it out!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109030411516492577263", "name": "Vivian Downs", "time": 1455523553069, "rating": 5.0, "text": "Home sweet home!! My boyfriend and I were looking for a place to play Magic after Mad Doctor in Birmingham closed. We had tried another that really just didn't cut it, and then  friend of ours told us we should really come here. Instantly I felt at home. I made friends fast and the owner takes good care of his customers. He helps them with all of their needs and works with them when he needs to to give them the best experience he can. I just recently got into Heroclix, and Bud's has the friendliest heroclix community around!! I love this place, and support it as much as I can!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109391888876163709634", "name": "Sherri Anderson", "time": 1505256653652, "rating": 5.0, "text": "I had a lot of fun playing Dungeons and Dragons there. Also, they've got a nice selection of comics, games, and toys.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114768054416520355513", "name": "aj goble", "time": 1523323638257, "rating": 5.0, "text": "the staff is very friendly and helpful and the selection is great. there are also always new events going on and something fun to do.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112694592668379033074", "name": "Lane Miller", "time": 1542831854988, "rating": 5.0, "text": "Great staff, good environment, a little cramped during big events.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105593193803210504572", "name": "Ryan Herrin", "time": 1531208459017, "rating": 5.0, "text": "Helpful and friendly staff with a great selection of games and cards with plenty of room for gaming.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106809462392385631112", "name": "og LiquidDeath", "time": 1554593486049, "rating": 5.0, "text": "Great people great customer service always!!! I love this place!!!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108860083180217699765", "name": "Brad Milburn", "time": 1522758700122, "rating": 5.0, "text": "Nice variety of games and variety of heroclix singles. Was there for Winter WKO, event was ran really well.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114984570437187460636", "name": "Doug Schaefers", "time": 1539700590839, "rating": 5.0, "text": "Despite it's small size it does carry a large variety of games and gaming supplies. Plus, if they don't have it in stock they can order it and have it in store in no time.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111626308153450153978", "name": "Keaton Abernathy", "time": 1546122421808, "rating": 5.0, "text": "Friendly staff, excellent events, and fun games. What more could you want from a game store?", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111038856285474488886", "name": "94shadowolf", "time": 1531507012425, "rating": 5.0, "text": "Great place,amazing shop, super friendly staff, and an amazing selection of all tcgs.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102320135344051806839", "name": "Sirens Final Gift", "time": 1528473556538, "rating": 5.0, "text": "Great place for everyone from hard core gamers to new people just starting", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106742041114990529498", "name": "Alexander Nathan Bailey", "time": 1519569333309, "rating": 5.0, "text": "People were polite and helpful. Overall had a great time and experience.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116796819872900985042", "name": "Novapierce 1", "time": 1500843708443, "rating": 4.0, "text": "Good service with a friendly atmosphere in a quaint little shop . A bit out of the way but definitely  one I'd recamend.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "110823527839120486469", "name": "Shai White", "time": 1513817662414, "rating": 5.0, "text": "Great place for gamers to hang out and meet more of the board and card gaming community!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100833022368411705294", "name": "Rosemarie Stipati", "time": 1518092354979, "rating": 5.0, "text": "Great staff. Fun place to play D & D Adventures League.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106100216121948603954", "name": "Mega Dic", "time": 1387266335988, "rating": 5.0, "text": "I was introduced to magic not long ago and fond this store not long after. Just the other day I walk in hoping to have my first magic match, but with my luck no one was even there playing magic. Luckily the owner, Mark, told me to go get my cards. He stomped me, but thought me so much about magic and I had a blast!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "113693676323240955902", "name": "Sherman Deal", "time": 1528602234025, "rating": 5.0, "text": "Friendly and safe place to go and you card or board games", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102167859178545290828", "name": "Metal Dad1318", "time": 1535911682606, "rating": 5.0, "text": "Great place to game and meet new people.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "106963845491371669809", "name": "Rose Stipati", "time": 1497949879220, "rating": 5.0, "text": "Great selection of board games. Friendly & knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "117666082010320463897", "name": "Keith Wideman", "time": 1515617937172, "rating": 5.0, "text": "Awesome store.  Very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "109663116005659638365", "name": "Patrick Isbell", "time": 1341125624268, "rating": 5.0, "text": "Great place for MTG, tournaments thurs fri and sat and easy to pick up commander games.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103873168523776663231", "name": "Michael Berryhill", "time": 1413380844021, "rating": 5.0, "text": "Out of the many MTG locations I've been to in the past 7 years, this one takes the cake.  Friendly atmosphere, varied selection, and a great owner make this establishment truly top-notch.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102799321743800274649", "name": "Ronald Brock", "time": 1498305924886, "rating": 5.0, "text": "Great store, the owner Mark is a great guy and will work with you", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "108370640039579065812", "name": "Fatsu Swagneel", "time": 1506228028079, "rating": 5.0, "text": "If you and 30 friends had OCD you could not organize better than Bud. get rekt noob.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "103277960227268048701", "name": "Paul Gleaton", "time": 1542497438557, "rating": 5.0, "text": "Great place to game, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "102295040877077736466", "name": "Steve Uptain", "time": 1533354543071, "rating": 5.0, "text": "Great place for all types of games!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104269742669627379292", "name": "FATE Destiny (FATE)", "time": 1460742881343, "rating": 5.0, "text": "The best of the best, with Friday night magic, DND, and lots more.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111777164732979772696", "name": "Magic City Game Club", "time": 1443326214938, "rating": 5.0, "text": "Awesome owner and very accommodating. I definitely enjoyed my time and will be returning on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "117711447631154434340", "name": "Seraphina Croi", "time": 1518706105436, "rating": 5.0, "text": "Great place for all your gaming needs!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112313894069043718267", "name": "Dylan Deaton", "time": 1552920270422, "rating": 5.0, "text": "Great for people of all ages", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "111225272255895477554", "name": "Emmerald Sado", "time": 1564244812585, "rating": 5.0, "text": "Really nice people", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112874047899013754863", "name": "Mark Singleton", "time": 1556948287979, "rating": 5.0, "text": "Has everything you need for gaming", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "114316782055090361562", "name": "Rob Barnett", "time": 1542563096705, "rating": 5.0, "text": "Great Shop ... Great Service...", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100566325966085729911", "name": "Mid9ight _", "time": 1540168719673, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "107168347942316501622", "name": "Jen Barber", "time": 1547551977636, "rating": 5.0, "text": "Great in every way", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "116286244369039862251", "name": "Andrew Wakefield", "time": 1491067052457, "rating": 5.0, "text": "Great game and comic shop, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "105547171466691532989", "name": "Shane DeRossett", "time": 1524240575979, "rating": 5.0, "text": "Nice shop, with friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112784301598131514855", "name": "Tim Poe", "time": 1510803884108, "rating": 5.0, "text": "Shop is ran well and a lot of improvements being made recently", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "104065038829112086514", "name": "Joshua Brooks", "time": 1558423637343, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "112351998030703278133", "name": "Jill Hill", "time": 1529865933761, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "115394713828965717656", "name": "stella Conatser", "time": 1498772757126, "rating": 5.0, "text": "Great. Loved the people.", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "100046088641603838345", "name": "Aguilar Santy", "time": 1465566582491, "rating": 5.0, "text": "it's awesome", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
{"user_id": "107380005546060726191", "name": "Tom Bruno", "time": 1460758559951, "rating": 5.0, "text": "I LOVE THIS STORE!!!!", "pics": null, "resp": null, "gmap_id": "0x88896d0a5105ab99:0xe2e703c0e6443154"}
