{"user_id": "106557981959566411249", "name": "C Taylor", "time": 1506453448447, "rating": 5.0, "text": "Helpful and friendly. I went to my first board meeting since moving to the area and the Superintendent greeted me as I was walking in. Nice folks. Seemed to really care about the kids in this county.", "pics": null, "resp": null, "gmap_id": "0x888980b01d670b77:0xad054e4c37499655"}
{"user_id": "111642197346124676758", "name": "Phil Schmidt", "time": 1505318136226, "rating": 5.0, "text": "Our 3 boys are products of the Madison City Schools. The rigorous academic courses, wide variety of sports, arts, and student government opportunities prepared them very well for college and life in general. Walking into the schools you quickly sense a positive atmosphere. Teachers, administrators and students want to be there and are confident good things are going to happen every day. The school board members serve for 5 years with no pay. Only people with a strong desire to keep improving schools would do such a thing. Our sons weren't all at the head of the class, but every one of them said they were well-prepared, and often much better prepared at the 4-year universities and 2-year community college they attended. You'd be hard pressed to find a superintendent anywhere in the country that puts as much heart and soul into knowing the students and working for higher standards in a public school system.", "pics": null, "resp": null, "gmap_id": "0x8862650c4bf20d1f:0xe4f46092faad191b"}
{"user_id": "104088751804109976666", "name": "DeShawna Scott", "time": 1500642461932, "rating": 4.0, "text": "Everyone is friendly and wants to help. Sometimes there is a little breakdown in the process and you end up a little frustrated. The 'online' answer is very frustrating since there was a problem with one of the process.\n\nOverall it's one of the best School districts to deal with and best set if schools.", "pics": null, "resp": null, "gmap_id": "0x8862650c4bf20d1f:0xe4f46092faad191b"}
{"user_id": "115550375456325056820", "name": "Destin Klein", "time": 1520088431412, "rating": 5.0, "text": "The Madison City School system, school board, and superintendent are top notch!", "pics": null, "resp": null, "gmap_id": "0x8862650c4bf20d1f:0xe4f46092faad191b"}
{"user_id": "100029431521809640108", "name": "Jon Jackson", "time": 1439228684666, "rating": 1.0, "text": "SCHOOL BUS HITS MY TRUCK and this is what i am dealing with Lucy Sellers\nAug 7 (3 days ago)\n\nto me\n\nATBE's offer included the full cost to repair your vehicle as documented by the Landers McLarty Chevrolet itemization.  ATBE does not pay for rental vehicles up front, therefore the rental vehicle charges were excluded from the base offer.  ATBE's offer included a more than generous reimbursement option if a rental vehicle is necessary while your vehicle is being repaired.\n\nPlease also understand that your vehicle was parked on the side of a road near an intersection and the location of your parked automobile contributed to damage sustained.\n\nIf you are uncomfortable with ATBE's offer then you may elect to assert a claim to your personal commercial automobile insurance company, who may then elect to assert a subrogation claim for reimbursement.\n\nAgain, if you have any questions please email me.", "pics": null, "resp": null, "gmap_id": "0x8862650c4bf20d1f:0xe4f46092faad191b"}
