{"user_id": "113375226065543745306", "name": "Amy Baldwin", "time": 1628496464021, "rating": 1.0, "text": "Columbus girls academy is full of chaos and neglect I can promise you as a past student here that if you send your kids here they will not be the same and it won’t be the change that you want they will come out more depressed more anxious they will come out with long term trauma and lack of real people skills and understanding of everyday things. There is a lack of attention to needs such as medical needs, and mental needs aswell. This place will tear your family apart and either your child will resent you or your not gonna recognize them when they return please please do not send your child here", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "113263297407341235030", "name": "Sweetrollrat", "time": 1619981939131, "rating": 1.0, "text": "I would urge any parents considering this place for treatment to reconsider. This place has only added to my already long list of trauma. And I think all the negative reviews from past students really speaks for itself. Your child will most likely resent you for sending them here. Don’t make the mistake my family did. I’d also like to say I know multiple girls from this program have actually passed away since attending. They were all so young too. While the demographic of teens that attend probably is at a higher risk for premature death, if this place was really helping these girls like it claims it does I’m sure some of these deaths could have been prevented. I don’t think it’s a coincidence that a lot of the girls I attended with are still struggling. I think this facility needs to reevaluate their methods and treatment of their students and make some serious changes. All the good reviews are from parents that they probably urged to leave these reviews in the first place or they are from students that are freshly out of the program who haven’t been given the time to process the actual trauma of it all.\n\nPlease think very hard about it before putting all your money, time and energy into this program. You can’t get any of it back.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "107731789429531299788", "name": "TL Phillips", "time": 1621444272812, "rating": 5.0, "text": "Our family is so thankful for Teen challenge and especially Columbus Girls Academy.  They have partnered with us to provide an exceptional experience for our daughter and provided the hope  we have needed during trying times.  The peaceful setting and skilled staff was instrumental to the success of our daughter.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "105537791515675645334", "name": "Candace Murphy", "time": 1609465376517, "rating": 5.0, "text": "Wonderful environment. The school goes above and beyond in giving the students opportunities to learn and grow. I am honored to have been part of this process and given the chance to facilitate the Horsemanship program.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "113959182501189044475", "name": "Kuanysh Akkuzov", "time": 1563287180987, "rating": 5.0, "text": "It's awesome place.  Thanks Teen Challenge for that place and glory to God.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvwcyLFRckszejYVRd32PWSuDpxsgkrJT3zymg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmhDgBLTMUjqNuBRBlou1cuH1gZm7LnNhj_yDm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvuCCaXfibFJrejg_x7zVsk-TmtofLhUuDv196=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "100227309845763117202", "name": "aubree stclair", "time": 1617224459314, "rating": 1.0, "text": "it was terrible. they lie and lie to your parents over and over so your parents can keep paying up. they give disciplines out like candy and you have to write 2000 words on a PDR for the littlest things. they keep you from the whole world even your parents. please please don’t send your child here. you’ll regret it in the outcome. find a different place. out patient in a mental hospital works for me now. that place is terrible. staff are up your butt about everything and don’t let you do ANYTHING!!! keep away!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "110663863994829814631", "name": "Chance Jones", "time": 1625094250882, "rating": 1.0, "text": "Every one has been warned about teen challenge in previous post! Don’t send any kid to any of the facilities!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "114643186733834325864", "name": "Nathalie Vargas", "time": 1616204693260, "rating": 1.0, "text": "Honestly the worst experience I’ve ever lived through. Came out with more trauma and anxiety that I did not have before. Please seek out any other options before considering this place.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "114766826440830670394", "name": "Andreia Harris", "time": 1592960998282, "rating": 5.0, "text": "Extremely happy with Columbus Girls Academy. The facilities are really clean and neat, the overall environment is very peaceful and I thank God every day for having guided me to find this place.\nFeel free to contact me if you have any questions.\nandreiaharris@gmail.com", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "107109896635646597822", "name": "Greg Bacheller", "time": 1597000946348, "rating": 5.0, "text": "As you might imagine, no parent looks to the day where they have to consider a program to get help for their daughter.  Unfortunately, we found ourselves in that very place and CGA has been an amazing help to our daughter, our family, etc.  The campus is beautiful, staff amazing, and real change is happening in our daughter!  We are incredibly grateful for CGA!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "101077794834692838983", "name": "Lauren Money", "time": 1577127171748, "rating": 5.0, "text": "At Columbus Girls Academy, girls are able to excel in many ways- academically, spiritually, and emotionally. The staff is loving and work well with the girls to help them to grow and succeed. I have seen girls who were failing in school come out with straight A's because of the structure of classes and one on one help/counseling they receive. Also, the campus is beautiful and well taken care of. I highly recommend this program!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "116826742957913662507", "name": "Jerry Scarborough", "time": 1577115850027, "rating": 5.0, "text": "My wife and I have been supporters of the home in Seale, AL for many years.   For the last few years, we have sponsored a Christmas luncheon for the many teenagers living there as well as their counselors.    Though blessed by all this, what really has been a tremendous blessing over the years is attending a number of graduations.    To see a student who went through an 18 month discipline share her testimony and to hear her family give praise to God for what He has done is an incredible privilege and honor.   May God continue to bless the Columbus Girls Academy of Teen Challenge in 2020 and until Jesus returns.    May hundreds of homes be restored and healed through this ministry.", "pics": null, "resp": {"time": 1577125605892, "text": "Thank you Jerry.  Our team and the girls in our care are blessed by the friendship and generosity of your family. May you have a wonderful Christmas and New Year!"}, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "107617751850404003112", "name": "Joe Waldo", "time": 1592594660938, "rating": 5.0, "text": "The 15 month long program was not easy.  Definitely had ups and downs, however the sooner I as the parent learned to let go of control the more positive the results became.  I hold the staff at CGA in high regard for the dedication they have to their calling have restoring every single girl to a life of purpose.  I would encourage all parents to go into to this with humbleness and I true desire to do whatever it takes to have a positive impact on your daughters time at CGA.  I am forever grateful!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "105774081107384038246", "name": "Blayne Jarrett", "time": 1592504656475, "rating": 1.0, "text": "I went through the program from June 2, 2017 to October 19, 2018. I CAME OUT WORSE THAN I DID GOING IN! This program was very traumatizing for me. Although I am thankful for certain aspects like the fine arts program, branded, and other extracurricular activities. I found it extremely hard to participate in these activities unless you were perfect and conformed to their idealistic beliefs of what the \"perfect\" woman was. I mainly went because I had issues with depression and suicidal thoughts. However, instead of recieving the \"therapeutic approach\" the website claims to have. I found myself being punished for my depressive thoughts and they continuously threatened to take away my privelages because of this. This lead me to believe I should deal with my depression in quiet. Throughout the program, I delt with bullying not only from the peers but from staff as well! Also, I found my counselor discrediting some of my thoughts and beliefs as if the weren't enough to be accurate. I never recovered from self harm, instead I did it in the dark and out of sight which was hard enough. I did not speak to the opposite gender for 16 months, this lead to sexual confusion and now I find myself having a hard time saying no when I'm uncomfortable in a situation. Another aspect that is concerning is finance. I am no stranger to the amount of money parents have to spend for their daughters while they go through this program. It's almost like it goes down the drain. The food was terrible, I can't eat Shepard's pie, grilled cheese, or lasagna anymore because I used to throw up after every single meal there due to the extreme amounts of grease. Also, the girls ran kitchen cleanup, yard maintenance, car washing, and even scrubbing a dumpster with a rag! These were considered \"chores\", we did not earn a single penny. Isn't this child labor? All in all, please think twice before you send your daughter here. I don't know a single girl who has came out as the angel there parents were expecting. Please save yourself the financial dept, there are other options! Blessings, Blayne Jarrett (Teen Challenge Graduate)", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "105481938599391521729", "name": "Kevin Kudrna", "time": 1579016793029, "rating": 4.0, "text": "My family is grateful for Teen Challenge Columbus Girls Academy. For a few years, our daughter had been extremely defiant, refused to go to school on many occasions, and had once resorted to violence. We tried counseling, medication, getting the police involved and it was all ineffective and didn't know what to do. She didn't want to act up either but was unsuccessful in making a change. I was researching boot camps and military schools for her with no success but stumbled upon the Teen Challenge website. I immediately realized Teen Challenge was the solution and researched the many schools for girls that are in the US. After doing further research and speaking to staff, I knew the Columbus Girls Academy was the best place for my daughter to get help with her behavior and academics.  It wasn't easy for us or for her but it changed her life and she is operating as the young lady God created her to be. She also got great opportunities like competing in fine arts competitions, learning piano, and being part of an equestrian program.  The experience helped us become better parents as well. Thank you for taking care of our daughter and changing the trajectory of her life!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "112792427103872223153", "name": "Payton Larsen", "time": 1588274152788, "rating": 1.0, "text": "At teen challenge I expected to receive therapy for my hurt and pain. Although I loved my counselor I felt much discomfort by the treatment of the other staff. I experienced inappropriate behavior by the girls surrounding me that led me to be afraid and trust anyone. I don’t recommend sending anyone here since I am now in more therapy for the experiences I had in this program.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "108342208129993571582", "name": "Rachel Tumanello", "time": 1529760918228, "rating": 5.0, "text": "Teen Challenge...man where to begin. I went in kicking and screaming, hating it at first and trying to run away 3 different times, convinced it was a cult. But each time God miraculously (and I mean miraculously) put people in my path or somehow brought me back. I finally realized there was something much bigger than myself at stake, and surrendered to the process. The program is hard and there is discipline involved, but never without truth, growth, encouragement, and the love of God. The rebelliousness (if you struggled with that) WILL be uprooted, but the deeper underlying causes also healed and mended. Bob and Karla - I will always remember as being my spiritual parents in my newness to coming to know God. They will always hold a place of utmost respect in my heart. The counselors and staff are always available and willing to help you heal, dig deep, pray and embrace true heart/life change. So many miracles and amazing growth happened to me and so many others while I was here. It's true that you get out what you put into it, or rather how you surrender to it (and letting God and the authority He's ordained there to move in your heart). All in all - I wouldn't be here if it weren't for this program, and I am forever grateful for the impact that year had on my life. I didn't know I could encounter God's love on such a personal level once I finally allowed it all in, and have since had a passion and desire for ministry. I have always been and will continue to be a radically changed person because of my time here - sitting at the feet of Jesus amongst these amazing servant leaders.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "110331468126595941528", "name": "Teahna Barron", "time": 1588295417820, "rating": 1.0, "text": "CGA is not somewhere you should ever send your daughter. I say this from experience. I was sent to CGA in 2017 and it was a very traumatic experience for me. The staff don't treat you right I even had a staff tell my dorm that we were a waste of breath. The biggest issue is that the staff belittle you. They make you feel as tho you are nothing so that you will listen to them. And during my time there I became very depressed and suicidal and when I told my counselor this she didn't care. They only way to make it through the program was to be perfect which is impossible. I couldnt be myself there I had to fake who was which did not help me at all I just ended up losing myself. I couldn't make any friends cause once I did they would move them away from me and make sure that I couldnt talk to them. I now have nightmares and wake up in the middle of the night crying because of how badly I was treated. PLEASE DO NOT SEND YOUR DAUGHTER HERE THERE ARE OTHER WAYS GET THEM TO LISTEN.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "104469886040578957125", "name": "Michelle Sanchez", "time": 1506998289774, "rating": 5.0, "text": "Teen Chalange is a place where God's presence dwells. I felt safe and loved from the moment I stepped onto their campus. It's humbling to have had the opportunity to witness such an incredible team of leaders working together for the growth of each girl. They are passionate about what they do and it's clear that they care so much about each one. I'm so thankful for this ministry and for the many lives they are touching. May God continue to blesses the work of their labor.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "111968409911715664639", "name": "Michael Bush", "time": 1566256143677, "rating": 5.0, "text": "Leaving my daughter was one of the hardest things I've ever done; however, she said the other day its like she never left when she see's me and her siblings.  Its because she hasn't and has remained in our hearts and can now value our love for her.  Columbus Girls Academy has taken an unresponsive girls headed in the wrong direction and completely reshaped her and helped her rediscover her identity In Christ and value as a person.\n\nOne graduation was all I needed to see to validate my decision.  Young ladies share their stories of all types of abuse and challenges but proudly proclaim their victory and smile with pride as the blinders are slowly removed and they become aware of their capabilities, worth and value as young women.\n\nHaving been an instructor for enlisted and officer candidates in the US Army I know a thing or two about breaking down and rebuilding and CGA has mastered this through discipline, challenges, accountability, responsibility, counseling and rewards.  The program not only teaches the girls but teaches the parents too.  You enter into a convenient that will give your child their best possible chance of success.\n\nI have yet to meet parents that were not pleased with the results they are seeing.  As my daughter nears graduation I couldn't be prouder and as you can see from her picture she is radiant despite still having a few months to go.  If you are exhausted and don't seem to be making progress and fear the path your daughter is on; Columbus Girls Academy is a tough choice but the best one.  I highly recommend this program and commend its personnel and commitment to giving our daughters their best possible chance at the abundant life God has for them.\n\nM. Bush\nFather", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMg9ZYtdO-SQlJNx0wCPDmaATHs4iT1ng1sKVlZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "109565084379610910271", "name": "Tracy Carrillo-whitton", "time": 1507581896926, "rating": 5.0, "text": "I am so excited and blessed that my daughter completed teen challenge. Teen challenge stepped in for my daughter when my family was out of options. We found teen challenge and they assisted the transformation. When I turned my daughter over to the group of people at teen challenge it was scary as I was unsure what to expect, but felt a sense of peace. However the wonderful staff and counselors guided not only my daughter but the family through the program. Although difficult at times, it was worth every day that my daughter was there learning, growing in faith, and learning to love herself.  I would recommend teen challenge to those families who feel that they are not sure where to turn, and have a daughter who has life controlling issues.  With the assistance of teen challenge and the faith in Jesus Christ working through them, your child will be transformed. I am thankful for the program every day and Pray the success of this program continues. Blessed mother of teen challenge graduate.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "110285922132915790256", "name": "EmmaRiley Clegg", "time": 1593557461552, "rating": 1.0, "text": "Yall, there’s an insane amount of fake reviews here. Don’t believe any one of them. This place will traumatize your daughter.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "108995155149186143488", "name": "Lorena Edwards", "time": 1566171890560, "rating": 5.0, "text": "We are very pleased with CGA. We sent our daughter here because we knew we were about to lose her and we were out of options. It was an extremely difficult decision to make but a good one and we would do it again. The staff loves them and helps them to get back on track. We have our daughter back and are so grateful to how the Lord used CGA!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "105058754540065202937", "name": "Anna McGraw", "time": 1474255886842, "rating": 1.0, "text": "I'm only speaking out because my experience at Columbus Girls Academy has impacted my future so negatively that I can't not speak out. I understand your daughters are giving you a hard time right now, and I understand you think Jesus Christ is the answer. It very well may be, but there are other, less damaging alternatives. Any addictions or harmful behaviors will just be replaced by an unhealthy amount of religion. My parents sent me to Teen Challenge because I was their first child and they didn't know how to handle me. We laugh now because I have three younger siblings who have had similar problems and have been just as rebellious as I was. Before Teen Challenge I hadn't been diagnosed with anxiety or depression, but after exiting the program I was reassessed and diagnosed with post-traumatic stress disorder, anxiety, and depression. I have extreme abandonment issues and albeit my attempts to work through them, those issues are still a work in progress. I'm okay, I'm happy, and overall I'm okay but most who leave the program are not. Love your daughter, don't judge her or try to change her. Please be careful and do not be hasty when considering this program. If anyone would like to talk to my parents or me for a different perspective, feel free to reach out.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "109778697318256087579", "name": "Lydia Worley", "time": 1576630628183, "rating": 4.0, "text": "The program gave me a place away from everything to work through some serious life-controlling issues. Yes it was difficult at times, but that is why they call it Teen CHALLENGE and at the end of it all I am thankful.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "104458600199244160342", "name": "Kaitlin Vied", "time": 1480830672014, "rating": 5.0, "text": "I am so grateful for Teen Challenge and what it has done in my life, and how God has used it! When I was 14, my life at home was a disaster - I was tearing myself and my family apart.My parents had already sent me to therapists and doctors and nothing had helped. As a last resort they reached out to Teen Challenge.\nThat was seven years ago for me, and my life hasn't been the same! I graduated the program in 2010. Since then God restored my relationship with my family completely! The loving staff and directors were always willing to invest in me, and it was through their dedication that I realized God's love for me and that He had a plan for my life. Now I'm serving in full time ministry and I am able to give back! Thank you Teen Challenge!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "104577127902550746248", "name": "Morgan Cascioli", "time": 1541781706624, "rating": 1.0, "text": "A lot of reviews on here are from the parents who never really experienced the program. I was 16 when I went in and didn’t get out until I was 18. This place is horrible. Almost 3 years after being out of the program and I’m still having nightmares of going back. I never struggled with anxiety before but once I got out I have major anxiety of all forms, PTSD, and depression. I wake up in the middle of the night and get taken to the hospital because my panic attacks are so bad. Do not send your child here. What she is going through might be difficult on everyone but she does not deserve this place and the emotional damage it does to you. I cannot stress this enough. Please don’t send your daughters there.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "109369073116660943601", "name": "June Morfi", "time": 1506969821612, "rating": 5.0, "text": "This is a wonderful program I have been involved with first hand for many years.  The girls are are surprisingly well behaved and the staff do a great job at running a structured and fun environment for all the girls. I would highly recommend this program to anyone that needs it.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "106250212909430233360", "name": "Dan Williams", "time": 1545244559914, "rating": 5.0, "text": "CGA is an amazing place, where girls are loved and challenged to change the destructive path that they may be on. True, lasting change does not happen without doing something that is challenging! To any parent who may be looking to place their daughter here, you can trust CGA with your daughter. They are given a great education, counseling, classes to help change negative behavior all in a loving atmosphere at a beautiful property. It is filled with dedicated staff who genuinely care about your daughter and her future.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "114357682225966675775", "name": "Cherie Wenk", "time": 1579978033150, "rating": 5.0, "text": "This place saved our daughters life! We're SO thankful for this program and what God provided for her and how he worked in our family!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "116921834437956347951", "name": "Vicki Spencer", "time": 1481579568250, "rating": 5.0, "text": "CGA was a God send for my daughter. My husband and I did everything we could for our daughter but she still continued to resist and rebel against us. We took her to therapy, we tried talking with her or disciplining her when it was necessary, but nothing worked. After her running away, we knew we needed to do something more for her. When we brought her to Teen Challenge we were torn at leaving our daughter behind but also confident that this is where God had led us. The team they have there is incredible. They not only helped my daughter but also helped us as parents! It was not easy leaving my daughter there, but we knew if we stuck through with it we would not be sorry. My daughter met the Lord there and made a complete turn around. She is now in college pursing a Bachelor's degree and is also recently married! The relationship we have now is completely restored and we are still growing together as a family. We praise God for what He has done through Teen Challenge!", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "102184290547736523667", "name": "Sara Alexander", "time": 1613769696803, "rating": 3.0, "text": "I am a graduate of this program. ( I graduated in 2016.) I want to say that I intend for this to be an honest and accurate representation of my experince for parents considering sending their kids here. I will say that the program DID help me before I start. OKAY, I have a lot to say. First of all, my parents did not tell me they were going to send me. One day, they sprung it on me and dropped me off. I do not recommend this at all, as it was quite traumatizing. I recommend good communication. It is important to note that this is a PROGRAM and very serious. The girls walk in lines, have conversation guildines, and recieve punishment such as work detail. Also, the environment encourages \"accountability\" amoungst the girls. This can lend itslef to toxicity, as girls are rewarded for telling on others. Unfortunatly, many girls adopt a fake persona to get through the program. Many parents are told that there is an extrmely high scusess rate. I do not know the overall statistcs, but I can tell you from observing girls' social medias that I was in the program with, that many girls were actually hurt by the program, and have come out worse. This is not becuase of the staff or the religious emphasis. I belive that these are both great. The staff is wondefful, and I genuiny developed a relationship with Christ that absolutley changed my life. But, there is not much transition from the program to home life when nearing the end. This is a HUGE problem. Girls are dropped into a secluded environment for over  a year and then dropped back into the real world, with no practical coping skills. I think the program is helpful in two ways: First, It removes girls from a toxic enviroment. Second, it exposes girls to Christ. These are great things. But, it honestly depends on the person if it works. My time there was the hardest 15 months of my life, and this decision should not be taken lightly. I would recommend it in certain cases only. ALSO, I want to say that the food offered is from Cysco, and not healthy. And, it is extrmely hard to get proper medical attention. If you are sick, you are taken to a free walk- in clinic sometimes after weeks and weeks of asking. These are all things to be considered. I am greatful for it at the end of the day becuase my life was changed. But that is not the case for evryone.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "101448264541881841550", "name": "Claire White", "time": 1464268416554, "rating": 5.0, "text": "This program was a gift from God to our family. The 15 month process is painful, but end the end worth it. While my daughter was at Teen Challenge she turned her life over to the Lord and He set her free from the destructive patterns she was choosing. Our family is very grateful for this ministry! The journey continues after you leave, but Teen Challenge does a wonderful job laying the foundation for these girls to be successful after they leave.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "114891926722520701875", "name": "Michael Cascioli", "time": 1481652597145, "rating": 5.0, "text": "TC has restored not only our daughter but our entire family.  Without the loving and caring staff centered around Christ we would have lost our daughter.  This is truly an amazing program built around God values.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "108076509798465888834", "name": "Hailey Galloway", "time": 1400261734751, "rating": 3.0, "text": "Okay, this is an addition to my previous review: I used to be in the 200's (weight-wise) at the age of 14, extremely overweight, but through participating in the extreme exercise and workouts we did in P.E. class I am now a lot healthier and have lost most of that weight. I'm not skinny as a pencil, but I'm nowhere near as heavy as I once was. Most girls in the program take every opportunity to pig out even when the food that is provided is optional. Also, many girl refuse to push themselves to participate in the exercises we perform and \"pretend\" to do the exercises. So...many girls gain weight because of the choices they make while in the program, not because of the program itself. I'm not the only girl who has lost significant amounts of weight since being in the program, and I certainly wont be the last. We are required to eat all of our food other than the optional items such as desserts and sides because there are many girls who would starve themselves otherwise, because girls come to this program with a variety of issues, not just substance abuse. (Just for clarification, I myself never had any sort of substance abuse issues). They did not feed us spoiled food. The church is very spirit-filled, but that is exactly what gets through to many girls who wouldn't be open to God otherwise. I've seen girls legitimately have demons caste out of them and then have a total life transformation that was not evident whatsoever beforehand. No girls are required to be prayed over, the only thing required is for girls to stand during worship services and be in attendance, but everything else is voluntary. There are multiple girl I can reference who went back to their old lives, and I'm not surprised, considering their behavior in the program. I can also reference multiple girls who are still walking strong in the world, going on missions trips, and living lives of freedom and joy for the first time in their lives. All of my nightmares, insomnia, unsettling flashbacks, addiction, depression, and rage is now completely gone from my life. I'm pursuing a strong relationship with God and going to Taiwan and India to do missions for the next year before pursuing an unconventional career in ministry. I've already been offered an internship at a local ministry, attend 3 youth groups a week, am applying for a student leadership position at one of these youth groups, and am living life to the fullest beyond anything I've ever known. So...take my word for it, if you daughter chooses to pursue God during her program...good things will most definitely come out. :)", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "105548005026165850621", "name": "Dodi Lindsay", "time": 1553015971111, "rating": 5.0, "text": "my daughter was spiraling out of control, with the help of CGA she is back on the right path, being responsible, respectful, and a joy to be around.  She has been home 1 month and still texts her counselor and other staff frequently, she has an excellent supportive relationship with the staff.  In the beginning she complained about everything, the uniform, the other girls, etc.  She felt she didn't belong there.  At month 4 she actually thanked us for sending her there, that she had indeed been going down a dangerous path.  She is not perfect now, nor do we expect that.  She has however made great strides and thanks to the CGA year round school she only has 4 classes as a junior and will also only have 4 classes as a senior, and will be able to take community college courses in the afternoon.  It is a hard process to change, but she put in the effort and now is heading in a positive direction and I am forever grateful to CGA staff.  I have my daughter back.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "106743243744433902095", "name": "Cheasanee Hetherington", "time": 1481590581941, "rating": 2.0, "text": "I'm an alumni of Columbus Girls Academy. I see that most of the reviews are from parents, but here's the thoughts of someone a few years after graduating.\n\nColumbus Girls Academy is a  Teen Challenge Center, meant for teenagers with life controlling issues such as substance abuse, suicidal tendencies, or criminal activities.\n\nThey use Alpha Omega Academy to teach their students. It's all online and teachers in the class room have almost no involvement in the curriculum. It's not a very challenging school and doesn't adequately prepare students for a college education.\n\nThe campus is beautiful, and students live in dorms on the edge of the lake.\n\nThe food is cheap, with lots of donated food from local food pantries and places like Atlanta Bread Company.\n\nDisciplines can be extreme, such as adding multiple months on the already arduous 15 month program and taking more of your money.\n\nThe tuition cost my family around $25,000 for my 15-month program, which I was unable to graduate from due to my religious views. I never got any months added, followed the rules, and I was once an ESL (their internship program). But I didn't agree with how they ran their operation, so they kicked me out without a graduation.\n\nParental contact is very limited. Parents can only call their child every other week for 10 minutes. Children can send 3 letters a week. After you've been there for a couple of months your parents can come see you for a weekend every other month. Once you're in the last three months of your program you can go visit your parents at home for a few days.\n\nOverall, my experience at Teen Challenge was poor. I was sent there because my foster parents didn't know how to raise a kid who had a rough past, having lost both of her parents. I was depressed. I didn't have any substance abuse problems and I wasn't rebellious. I was just depressed. The experience turned my away from Christianity, like many others. If you want to send your child here, think about it first. Teen Challenge should be a last resort, when you no longer know how to parent your child. Try everything else first, instead of wasting all the money.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "106313796811861396967", "name": "Andy Boone", "time": 1480737925075, "rating": 5.0, "text": "I have known of this school first hand for years and have personally witnessed the kindness of the staff, the stand apart facilities and positive outcomes.  Anyone who is interested in this school should give them a call, schedule a tour and talk to the staff and students there, you will see it for yourself.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "116969575263351873085", "name": "Allison Kay", "time": 1478903678182, "rating": 1.0, "text": "I went here until they kicked me out after a year. This place fits every definition of a cult. Please I beg of you do not send your daughters here. I know you think it will help but I promise you she will be terrified. I honestly felt brainwashed by the directors. They convince the parents to not believe their daughters \"storys\" because we're all just manipulative. Please do not choose this school. It's been 4 years since I left and I still have issued with anxiety because of my experience their.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "110222994009009917490", "name": "Chelsa Jean", "time": 1596044060851, "rating": 5.0, "text": "Honestly, The program was amazinggg", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "115553518874213819121", "name": "Hakim Bougasba", "time": 1609630155365, "rating": 5.0, "text": "Beautiful", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "105747936041845547114", "name": "Gloria Florez", "time": 1476144625955, "rating": 5.0, "text": "This is such a great school I am so thankful for this program, thank you CGA", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "116997456322313116957", "name": "Adriana Alfonso", "time": 1476145575478, "rating": 5.0, "text": "If it wasn't for this school I don't know where my daughter would be, they have had such a positive impact on me and my daughters life I definitely recommend this place to any parent who is having trouble with their teenage daughter.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "110390896707395637508", "name": "Debra Cockrell", "time": 1366256159379, "rating": 5.0, "text": "A God-send - truly, the place itself is beautiful, and the presence of peace is tangible.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "109884509976011798437", "name": "kenny K", "time": 1476143335929, "rating": 5.0, "text": "Great school to attend this place is heaven sent thank God for this place.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "102037343795435799952", "name": "camae white", "time": 1476143582090, "rating": 5.0, "text": "This place saved my daughters life, she was on a path of destruction until I discovered CGA thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
{"user_id": "116130534136276141322", "name": "Kimberly Tingler", "time": 1514060861837, "rating": 5.0, "text": "Excellent program", "pics": null, "resp": null, "gmap_id": "0x888cd9ecc9306f81:0xf4d9596d34c4d24a"}
