{"user_id": "106842317804947149083", "name": "Keith Grisco", "time": 1623701494948, "rating": 1.0, "text": "This guy is rude as can be, was ok at first .We saw his sign on the side of the road and gave him a cal. He missed first appt.  he finally went and looked where we wanted a fence and then gave me a price. After a couple days I called him to start the process, tell him I wanted to go ahead then he started with the BS. Saying he didn’t know if he had the material, wasn’t sure if he could get it. Said it would be 2-3 weeks which was fine because I didn’t need the fence up until then. He said he needed to meet with us to go over this and that and I said well my wife is in town for just a few days and gave him her number. He said he’d call. She didn’t hear from him so I texted him, he said he’d call. Almost a week later he called. My wife said that was last week, we aren’t in town now. Then he got rude as hell again.", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "111662527613672698920", "name": "Matthew Tucker", "time": 1617037284274, "rating": 1.0, "text": "Company rep was extremely rude on the phone, like I was entirely wasting his time inquiring about material costs. Zero customer relationship skills and I won’t ever consider this guy again.", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "109371914158375814787", "name": "Faith Hope", "time": 1588184017818, "rating": 5.0, "text": "I had a great experience with this company.  I recently moved to the area and was searching for a fence company to replace my fence and gate.  Someone recommended Swearingen so I gave them a call.  They gave me a fair quote and did an excellent job. They were very professional and were out on time and the work was done on schedule.   I have more fence work that will be needed in the future and will be calling them again! Great people quality work and fair price.  Thanks Swearingen Fence and Deck!! I'm very happy with the work you did.", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "110161521773156985529", "name": "Don Harris", "time": 1593614784455, "rating": 5.0, "text": "They just replaced a large portion of our  driveway and sidewalk. They removed the cracked sections, hauled off the debris and replaced the concrete in one day. All the workers were GREAT! They were very polite and even engaged my grandchildren who were watching. Everyone knew what they were doing. Rarely do products or services meet expectations and never do they exceed them. In this case they exceeded ALL my expectations. I would highly recommend this company should you need any remodeling, fence or driveway work. It was a pleasure to do business with them.", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "117510777673596781507", "name": "Bill Lewis", "time": 1603392386906, "rating": 5.0, "text": "Very professional and we have used them for years at different houses I feel very comfortable recommending them to anyone they are the best", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "101344626408826138225", "name": "Austin Taylor", "time": 1579218495593, "rating": 2.0, "text": "I was flexible on appointment time and contractor arrived late for a time he set. I wanted him to quote a deck build and privacy fence. I was looking for options on building the deck and he was visibly frustrated that I just didn't have a set design for him to quote. As an engineer and a business owner I understood that, but thats often part of the process. Then he mentioned he would reuse the existing rotted ledger board on the house. I kept my mouth shut but I was definitely on guard after he said that. Next I wanted him to quote a wooden privacy fence around a pool. We came to an area that required a metal section of fence across my driveway.  He told me it wasn't an option to use anchor bolts on concrete for the posts.  As someone he has a fair amount of experience about anchoring I flat out told him it was if he did it correctly.  Once again he got very irate. Then he told me it would take $7000 to cover the 60' section of driveway.  I pointed out that the metal section across the driveway is the same width as the 20' wide pool I wanted to fence off - it does not require anywhere near 60' of fence to go across a 2-car wide driveway. He got mad again when I told him this - but, I mean it's just so obvious.  He stormed off, saying he and I weren't going to get along and I could find someone else. A frustrating waste of time and certainly did not inspire confidence in me that this contractor was competent. He may in fact be competent, but with people skills like that you might never know for sure. I rarely write reviews but in this case I would definitely exercise great caution if engaging this person in any improvement project.", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "106734240103833548997", "name": "Christopher Smith", "time": 1591809993543, "rating": 5.0, "text": "From the moment I first called for an estimate to continued follow-up, Swearingen Fence has been AMAZING!  Mr Swearingen, the owner, took all the phone calls, and followed-up personally.  When things altered even slightly, he called or texted instantly to keep us up to date.  He and his team have were extremely professional, courteous, and timely.  The work is GORGEOUS.  His fees were very reasonable, and he was honest about everything without us ever feeling pressured about the different products.  Even when our HOA audibled and wanted us to put another gate on, he and his team easily made it happen without concern.  I cannot recommend this company enough!", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "110180233659408151886", "name": "Warren Carr", "time": 1587999527132, "rating": 5.0, "text": "Their attention to detail and making sure everything is right with customers is unsurpassed. Beautiful craftsmanship!", "pics": null, "resp": null, "gmap_id": "0x888dd2a4d607a08f:0xdf39e1dd32557347"}
{"user_id": "116796764845548657061", "name": "Barry Killebrew", "time": 1626288828452, "rating": 5.0, "text": "Great place to work. The office staff are amazing and helpful. The supervisors can be a little gruff but at the end of the day they'll crack open a cold one with you.", "pics": null, "resp": null, "gmap_id": "0x889bcc2b5df2bdf9:0x6d1adbb6febbbbe8"}
{"user_id": "117609701164142176797", "name": "Melissa Sullivan", "time": 1625253400081, "rating": 5.0, "text": "Nice little boat yard. LOTS GOING ON for the size of the yard. Never knew it had so much happening!!", "pics": null, "resp": null, "gmap_id": "0x889bcc2b5df2bdf9:0x6d1adbb6febbbbe8"}
{"user_id": "111371863749076427175", "name": "Ladell Smith", "time": 1490542557818, "rating": 5.0, "text": "Its an awesome job. People are friendly like family we build great quality boats", "pics": null, "resp": null, "gmap_id": "0x889bcc2b5df2bdf9:0x6d1adbb6febbbbe8"}
{"user_id": "116932069401119313329", "name": "John Williams", "time": 1627942783326, "rating": 5.0, "text": "Amazing place", "pics": null, "resp": null, "gmap_id": "0x889bcc2b5df2bdf9:0x6d1adbb6febbbbe8"}
{"user_id": "112324643572775886034", "name": "jennifer letort", "time": 1578902290600, "rating": 1.0, "text": "Dangerous job liers low pay", "pics": null, "resp": null, "gmap_id": "0x889bcc2b5df2bdf9:0x6d1adbb6febbbbe8"}
{"user_id": "103217128201777143465", "name": "Braxton Akridge", "time": 1590435817081, "rating": 5.0, "text": "It's hot", "pics": null, "resp": null, "gmap_id": "0x889bcc2b5df2bdf9:0x6d1adbb6febbbbe8"}
{"user_id": "115231644737374170519", "name": "charles hubbard", "time": 1625434050324, "rating": 5.0, "text": "Great employes that works excellent. No matter what the weather is.", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "115930371276193995100", "name": "James Hudnall", "time": 1607732098412, "rating": 5.0, "text": "This is a very well-run business, from the top down. From the general manager all the way down to the boots on the ground, the repairs are timely, the project management attentive, and the end results continue to impress. These guys consistently raise the bar, in regards to our expectations of shipyard performance.", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "109481457218027913745", "name": "amit kumar", "time": 1590356918423, "rating": 4.0, "text": "Been here with my ship for discharge of Titanium from SA.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPXIbN2mr6Ra05Wqp3MIyWUPiV2vnVoHcRpiD-8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "115176411105556877799", "name": "Jesse Summers", "time": 1606596192619, "rating": 5.0, "text": "Great place to work", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "112482280490380673515", "name": "Stephen Miller", "time": 1539094629099, "rating": 4.0, "text": "Commercial boat repair ... theses guys know what they're doing", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "112413600080097526857", "name": "Brett Hearn", "time": 1597783756767, "rating": 5.0, "text": "GREAT PLACE TO WORK!", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "110633191477227226804", "name": "voobroo297", "time": 1534612065476, "rating": 1.0, "text": "It’s called Blakeley now and the turnover rate is through the roof because of unrealistic expectations", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "106799427604435526783", "name": "Corey Lee", "time": 1527596902558, "rating": 5.0, "text": "Good shipyard to work at.", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "110548471729827637812", "name": "Phillip Griffin", "time": 1500925596613, "rating": 5.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "106367377098067637073", "name": "john bolter", "time": 1514556446474, "rating": 5.0, "text": "Lil dusty", "pics": null, "resp": null, "gmap_id": "0x889a511c71b03bdd:0xcf539a5d1ccb07a6"}
{"user_id": "117879435719519621690", "name": "Michael Hull", "time": 1457179164913, "rating": 5.0, "text": "The very best craftsmanship. Fred it very professional and takes pride in what he does. Margaret and the staff give the best customer service available. Best part is that they stand behind what they do. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88896301cc0f0e3f:0xb35576dd5740ee8e"}
{"user_id": "115475398307250871226", "name": "Randy Arnold", "time": 1545177861221, "rating": 1.0, "text": "They dont do small jobs. Pre paid to have 4 poles driven into river couldnt make it happen.\nWas told it would be couple of weeks. When I called about it they said their contractor had pulled his barge out of the lake and move to Tuscaloosa.I didn’t know they subcontracted their pile driving and had no control over their subcontractors.So after three months I ended up having to get my money back and take an alternate route with somebody else.", "pics": null, "resp": null, "gmap_id": "0x88896301cc0f0e3f:0xb35576dd5740ee8e"}
{"user_id": "105489921722586922521", "name": "Virginia McBurnett", "time": 1490044048552, "rating": 5.0, "text": "Expert work and staff", "pics": null, "resp": null, "gmap_id": "0x88896301cc0f0e3f:0xb35576dd5740ee8e"}
{"user_id": "108772284149788607175", "name": "Gene Barnette", "time": 1617722168178, "rating": 5.0, "text": "I recently contacted TH marine to ask about a screw sleeve for the Yolotek camera pole ,due to mine had broken and these guys are awesome they never fail to come thru for me they got me taken care of .\n\nThanks guys for your support\n\nGene Barnette", "pics": null, "resp": {"time": 1617813763746, "text": "Thank you, Gene! We hope to continue earning your business!"}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "110588853261789456545", "name": "Donald Ferguson", "time": 1607799248440, "rating": 5.0, "text": "My Atlas jack plate relay prematurely failed on my Ranger Bahia 240. It would go up, not down. I contacted customer service, gave then a little info and they immediately sent a new relay with the wiring harness attached. I just installed it myself, 20 minutes, and it works as new. Thank you for your help.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7-GmAu4-HrOQgmGv6_0THMC_7DzihKy6ensIc=w150-h150-k-no-p"]}], "resp": {"time": 1617025406226, "text": "Thank you for being a T-H Marine customer! If there is any other way we can help, please just let us know!"}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "112550338650322257776", "name": "James Johnston", "time": 1616950027040, "rating": 1.0, "text": "Seems like they wanted to make more money they would spend $8 an hour on somebody to answer their phonesIs impossible to get in touch with them", "pics": null, "resp": {"time": 1617025324683, "text": "Hi James. Sorry to read that you had some difficulty reaching us by phone. :( Although we are not always able to predict just how many phone representatives we should have available, we are increasing our capacity to answer questions via social media (@thmarineteam) and our Help Page with email contact form (linked below), so please feel free to contact us anytime using those channels. If you can't reach us by phone, please visit us at www.thmarine.com/help -- from there, you can access a variety of FAQs, tips, and a contact form where we can get you directly connected with the right member of our team.\n\nEither way, we'll do our best to provide you a personalized, typed reply, but you can also provide a call-back number and a good time to reach you if a phone call would be better. Sorry again for the trouble in getting through amid the other calls, but we hope you'll take advantage of one of our other options to get started with helping you."}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "105795810395157555487", "name": "Ersi Bice", "time": 1607374236848, "rating": 1.0, "text": "You guys have made if very difficult to earn my business in the future.  I ordered a tube where i can fit my electrical fish rod tools but to my surprise, the product arrives with no end caps.  All while the product picture has end caps, which is basically false advertisement.  So let me get this straight, your customers are coming to your site to buy an empty tube with no end caps?  I can conveniently drive to home depot and get a random pipe for that.  Or even ask my neighbor.  How about putting it in capital letters on your site  that \"the tube doesn't come with end caps.\"  Then it would be up to the customer to read and do the proper product research.\n\nBut wait there's more.  So i was already super irritated at the lack of logic being used on this one but i refrained from writing a bad review.  Instead, I brushed it off, went on the website, and found I can just order these vynil end caps for $2, plus shipping.  Whatever! Right?  It happens!\n\nBut my disappointment didn't stop there.  I received the package, opened it and only one cap was inside.  Again, the product page is titled \"black vynil caps\" and the first picture is a picture of multiple caps.  So once again, misleading a returning customer that already gave you a second chance.  Where is the logic?  I am certain that you have run into this problem before.  Why is it not fixed.  You risk reputational damage for a few extra bucks.\n\nI just don't understand how your number one priority isn't to make life easier for your customers and delighting them at every step of the sales process....  I am stuck between throwing the tube out and looking elsewhere, or just ordering another stupid end cap and paying shipping FOR THE THIRD TIME", "pics": null, "resp": {"time": 1607389600380, "text": "Hi Ersi. We are very sorry to read about this, but we do want to help you and improve what we're doing, too. Can you please send us this message at thmarine.com/writeus or contact us via Facebook Messenger? That will help us to get a better understanding of what we could do better, along with allowing us to ask some questions about this situation. Sorry again for the trouble, but we hope you'll write us so we can do our best to help."}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "104475234380734993340", "name": "David Waikem", "time": 1602697912379, "rating": 5.0, "text": "I had an issue with a KVD Hydrowave unit, contacted TH Marine and all they asked for was a copy of the receipt. When they received the copy they sent a brand new unit out to me. All done within 10 days, excellent service and now a long term customer for sure!", "pics": null, "resp": {"time": 1617025452160, "text": "Thank you for your feedback! We hope to continue earning your business!"}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "112651471913430368694", "name": "Parker Mott", "time": 1561310476255, "rating": 5.0, "text": "T-H Marine is a one-stop shop marine for all you needs. My favorite product is the Loc-R-Bar... I travel across the country fishing pro tournaments, and their safety devices are the best out there. I never have to worry. I also love the T-H Marine LED trailer lights... they are more affordable than other LED lights and just as good, if not better in a lot of ways. Much easier to install for sure!! Thanks guys! Your customer service is amazing!!!!", "pics": null, "resp": {"time": 1617025652528, "text": "Thank you, Parker! We hope to see some pictures of your lights on social media — we love seeing those products in action, doing what they are supposed to."}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "102958923896554234405", "name": "Stephen Richter", "time": 1563473918732, "rating": 5.0, "text": "T-H Marine is a great company with a product selection that keeps growing and growing. Whether you are looking for the (1) niche product or looking to fully customize your boat, they have you covered! To top things off, T-H Marine has great staff and service. The very few times I have needed to speak with them for questions I had, they were 100% in my book!", "pics": null, "resp": {"time": 1617025532965, "text": "Thank you, Stephen! We are thankful for your business. Tight lines!"}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "106863220702745713910", "name": "Jacob A.", "time": 1563895850112, "rating": 1.0, "text": "Good luck trying to reach them on the phone. Day three now and still haven't been able to speak with anyone.", "pics": null, "resp": {"time": 1563899958168, "text": "Sorry to read of this experience, Jacob, but we do want to help! We do not staff our phone lines over the weekend and we sometimes experience high-volume call times midday during the week, but you can reach us anytime on our website at www.thmarine.com/help -- from there, you can access a variety of FAQs, tips, and a contact form where we can get you directly connected with the right member of our team. You can also contact us via Facebook Messenger to leave us a message. Either way, we'll do our best to provide you a personalized, typed reply, but you can also provide a call-back number and a good time to reach you if a phone call would be better. Sorry again for the trouble in getting through amid the other calls, but we hope you'll take advantage of one of our other options to get started with helping you."}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "103954462547052202359", "name": "Frank Elasavage", "time": 1560977147741, "rating": 5.0, "text": "I've been purchasing from TH Marine now for about a couple years and love their products! I've purchased everything from bow to stern on my bass boat and can tell you first hand,  their products are top notch!! I have everything from the HydroWave, G Force Elminator, Blue Water LED's lighting to an Atlas Jackplate! Their customer service is off the charts when it comes to help as well. If you haven't purchased from TH Marine, I would get give a try! Thet have you covered from bow to stern on all you boating needs.", "pics": null, "resp": {"time": 1617025671383, "text": "Thank you, Frank, for your continued business!"}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "111197893680571543781", "name": "Jamin Gadoury", "time": 1497131530561, "rating": 2.0, "text": "Getting through to this company is a miserable experiece. Getting them to send me a jack plate was an equally miserable experience! Their lack of customer service cost me 4+ weeks on the water! After finding out on the last go around that they hadn't sent the plate a week before hand. I will say they were nice enough to offer for me to pay an additional $300.00 to get my plate over nighted! I am in total disbelief that a company can treat their customers like this! I am praying that their product is more reliable than their service! I am very disappointed in the experience I have had with them. The only reason I gave 2 stars is because the jack plate looks very impressive and I am happy with the product! I pray it never has an issue that I have to contact customer service for!!!!!", "pics": null, "resp": null, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "107312384029325548151", "name": "Bug Tarleton", "time": 1341329645299, "rating": 4.0, "text": "I had a life threatening experience yesterday with a \"hot foot\" that had no stop bolt on it.The throttle broke and the motor was wide-open throttle (W.O.T.) at 75 mph and I had to shut it off with the kill switch.I called the company to let them know that the stop was missing and that is what hyper-extended the other manufacturer part. I first told them that I wasn't going to sue them I just wanted them to know to fix the bolt so it couldn't be removed just adjusted.They never would let me explain what actually happened. They just kept saying they didn't make that part. It is SAD that someone will have to get killed to resolve this. I was just trying to save a family some grief. I called my dealer and my new part was on the way in ten minutes.That is how you do it, T AND H MARINE.Your products are great but your success has blinded you.", "pics": null, "resp": null, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "106937598772640132220", "name": "James W", "time": 1506183894813, "rating": 2.0, "text": "I sell and install marine electronics and trolling motors.  I have never been able to get anyone to call me back with technical info on a product. I have talked to them numerous times at dealer shows and outdoor shows. They are very friendly and seem to know their products very well. Getting them to return a phone call is impossible for either me or my customers.", "pics": null, "resp": {"time": 1506197647015, "text": "We are very sorry to read you have had this kind of experience, James. If you would be so inclined, we would appreciate the chance to talk with you about how we can improve. Please write us at thminfo@thmarine.com and direct the message to Derek. Whether we need to improve our support line somehow, provide more resources online, or something else, we aim to do all that we can. Thank you for letting us know about this and thank you for working with T-H Marine products."}, "gmap_id": "0x88627ab2ae7c2605:0xae27bd21ff2912c2"}
{"user_id": "102612913814853236801", "name": "junk can", "time": 1616775675968, "rating": 5.0, "text": "Having been involved in recreational boating or commercial shipping nearly my whole life of almost 50 years, I can eagerly attest that Nelson Boatyard is a bright spot in the South for commercial and recreational boaters to service their vessels!  The very affordable rates make the location a win to begin with.  The massive capacity of this large and expanding boatyard is another positive, though they graciously made room for me even in the midst of the fallout of Hurricane Sally .  However, perhaps the best aspect of the facility are the brilliant array of professionals associated with it who are able to attend to any matter that one might face.  Though I intended to perform all the work on my boat, I was delighted to find both excellent, generous guidance and reliable, experienced service providers to attend to all my needs that were beyond my own capacity.  I suppose that is to be expected from a business operated by four generations of one family!   I will be gladly returning from Pensacola for routine maintenance every two years!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ58ZoKyLU0TWUS0EaU2yQhUT2W_vfqgKg3LLg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a1a57fd97f7e1:0x4ea54057c0d4d474"}
{"user_id": "103843532489350746612", "name": "John Lanier", "time": 1604681630629, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x889a1a57fd97f7e1:0x4ea54057c0d4d474"}
{"user_id": "115520341515718935052", "name": "Matt White", "time": 1402677205937, "rating": 5.0, "text": "Very nice and fair people! Great Price for good work!", "pics": null, "resp": {"time": 1522107218750, "text": "Thanks!"}, "gmap_id": "0x889a1a57fd97f7e1:0x4ea54057c0d4d474"}
