{"user_id": "101313584638522780555", "name": "Donna Bass", "time": 1620700780061, "rating": 5.0, "text": "Pond Accounting is very friendly and helpful as very fast to get your taxes done. I highly recommend their services.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b240b812d:0x697bd4d9716d2247"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1620149556545, "rating": 5.0, "text": "Andrew is great! Very efficient, knowledgeable and super to work with.  Heres also an animal lover 🐾❤️", "pics": null, "resp": null, "gmap_id": "0x888e8f8b240b812d:0x697bd4d9716d2247"}
{"user_id": "109754335306845664996", "name": "Gary Riner", "time": 1619100479982, "rating": 5.0, "text": "Professional, reasonable, friendly, helpful and excellent service. The very best for us.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b240b812d:0x697bd4d9716d2247"}
{"user_id": "105505418360759958038", "name": "Donald Schauber", "time": 1613622330372, "rating": 5.0, "text": "Andy and his team are professional, polite, and friendly.  Hands down the absolute best!", "pics": null, "resp": null, "gmap_id": "0x888e8f8b240b812d:0x697bd4d9716d2247"}
{"user_id": "110651038645927960907", "name": "Sundee Mahone", "time": 1559664436256, "rating": 5.0, "text": "Pond Accounting has been great in their patience with us and toward us!", "pics": null, "resp": null, "gmap_id": "0x888e8f8b240b812d:0x697bd4d9716d2247"}
{"user_id": "114168157475227500255", "name": "Billy Atchison", "time": 1518833148431, "rating": 5.0, "text": "I highly recommend pond accounting finally someone who works for you and not the government he gets you the most back and is very reasonable with his price so if you're looking to get the biggest refund back go see this guy you will be happy you did!", "pics": null, "resp": null, "gmap_id": "0x888e8f8b240b812d:0x697bd4d9716d2247"}
{"user_id": "113054984052770564835", "name": "Donna Shrewsbury", "time": 1616412075286, "rating": 5.0, "text": "This is a great place to get your income taxes done! We have used them for the last two years and couldn’t be more satisfied! Give them a call!", "pics": null, "resp": null, "gmap_id": "0x88896d1478c8a763:0x7820354247da0dcc"}
{"user_id": "108437561035504098350", "name": "James Lawley", "time": 1581136286000, "rating": 5.0, "text": "I was a walk-in, new customer this week and was treated like a VIP.  I am very pleased with the service provided and will be a customer for life!", "pics": null, "resp": null, "gmap_id": "0x88896d1478c8a763:0x7820354247da0dcc"}
{"user_id": "106546486617887579782", "name": "Jesse Randall", "time": 1524851603835, "rating": 5.0, "text": "We have been using M & M for years,  they do a great job on our taxes. We couldn't be happier with the services that they provide!", "pics": null, "resp": null, "gmap_id": "0x88896d1478c8a763:0x7820354247da0dcc"}
{"user_id": "116425366168189661442", "name": "debbie ash", "time": 1550693424977, "rating": 5.0, "text": "I've been getting my taxes here for the last 5 years. Love this place!!!", "pics": null, "resp": null, "gmap_id": "0x88896d1478c8a763:0x7820354247da0dcc"}
{"user_id": "114111211951053821494", "name": "Shelby Mote", "time": 1468007092066, "rating": 5.0, "text": "Wonderful people to work with!! Very honest and caring. Would definitely recommend them to anyone for tax, payroll, or bookkeeping needs!!", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "100365530848552643938", "name": "Darrin Swan", "time": 1492701874771, "rating": 5.0, "text": "Great experience from a great company.  Thanks for all the help with taxes and payroll.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "104474205535923552810", "name": "kiera meadows", "time": 1480101237998, "rating": 1.0, "text": "would be better if people will answer the phone!", "pics": null, "resp": {"time": 1626383131179, "text": "Thank you for your review.  That was a couple of years before we took over the tax office.  Things are much better now.  There were some health issues with ownership back then."}, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "107807661023494042927", "name": "FL Rowe", "time": 1519200681036, "rating": 4.0, "text": "Good teacher.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "108267357858859074915", "name": "Stephen Franklin", "time": 1626642612730, "rating": 5.0, "text": "Always a pleasure working w/ Bryan Parker and his staff. Even after we relocated over an hour away my wife and I continue to use Bryan for our tax needs. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100952886940019018185", "name": "Dianna Howell", "time": 1573655535164, "rating": 5.0, "text": "Bryan Parker is the best!  His attention to detail was awesome. He takes his time to explain ways to save money and gives great tax advice!  I highly recommend Bryan Parker!!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "117549785040606524293", "name": "Marcus Williams", "time": 1568145767947, "rating": 5.0, "text": "Bryan Parker CPA has provided excellent financial services to our small business. We found him just a few weeks after opening our doors. He has helped with taxes, financial planning, payroll and more. I highly recommend Bryan Parker CPA to anyone looking for accounting and finance help.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100966121221547422448", "name": "Kyle Lubsen", "time": 1551572046199, "rating": 5.0, "text": "Bryan L. Parker CPA and the staff are excellent to work with. They are very knowledgeable and helpful.  They have done our taxes for several years and they are quick and thorough. Bryan is quick to respond to questions and the staff also there if you need anything. As a small business owner it’s good knowing they have lots of experience with businesses and keep current with tax code changes.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "117091208165140612711", "name": "Mike Acton", "time": 1535231361777, "rating": 5.0, "text": "Bryan Parker and his group of employees are simply the best. Bryan is more than just \"the guy that does my taxes\". He is an advisor, a professional, and has become a trusted friend. He was recommended to me by my sister in 2006. Little did I know 12 years later that I would trust him not only with filing my taxes, but also trust him with his advice on decisions I have made with business and family matters. I recommend him because he is honest, trustworthy, and takes a personal interest in taking care of his clients.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "107464967600256228209", "name": "Brandy Hamilton", "time": 1573655343992, "rating": 5.0, "text": "Bryan and his team strive for excellence! Great experience getting my tax return completed! Very knowledgeable and friendly service!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100737971883356402400", "name": "L.E. Marcus", "time": 1573655567282, "rating": 5.0, "text": "What a great company to take the worry and stress out of dealing with the IRS! Very personable exec and staff! Definitely recommend Bryan Parker CPA for all of your tax needs.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109859697862035342207", "name": "Bonnie Sult", "time": 1573655443288, "rating": 5.0, "text": "Brian does a fabulous job for his clients and is very responsive and accurate. He is quite knowledgeable and shares that knowledge openly.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108262374914417768278", "name": "M. Williams", "time": 1562946275945, "rating": 5.0, "text": "Bryan Parker CPA does a great job on our taxes and payroll processing. I highly recommend his firm.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108547963885600221308", "name": "Nancy D. Sam", "time": 1415679352420, "rating": 5.0, "text": "As a newly opened business, we knew it was necessary to properly manage our finances. We didn’t have enough money in the budget to hire a full time accountant, so we had to settle with an accounting service. We worked closely with Bryan Parker and were able to prosper financially from the get go! The company is almost a year old now, and we’ve seen great success. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "110475303051117164810", "name": "Cee Bee", "time": 1551718645233, "rating": 5.0, "text": "Great customer service.  Always patient in explaining things so that you understand new guidelines, laws etc.   Fast turn around time.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "106229067383085316652", "name": "Erick Boggs", "time": 1551859427787, "rating": 5.0, "text": "By far the best experience ever in taking care of our taxes.  BLPCPA is the most thorough and experienced Firm that I have ever dealt with in completing taxes.  The staff is very knowledgeable, helpful and polite.  If you are not using BLPCPA as your Accountant then you are really missing out!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113354890299372002697", "name": "Laura Steele", "time": 1556744990099, "rating": 5.0, "text": "Bryan and his staff were super to work with in getting our taxes done. My husband and I are both independent contractors and Bryan took time to meet with us to let us know how to make the most of business deductions. He also talked to us about when and how to set up a business and save even more on taxes. We will use him again!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "107309774221835934917", "name": "Sandra", "time": 1551115286894, "rating": 4.0, "text": "Very service oriented. Different from what we were used to in Ohio, where they prepared everything right in front of us. Here after they fit us into their busy schedule, and discussed our needs we found out the cost dropped off our tax records then when they were ready came and picked up our paper work.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116543050913163351927", "name": "Earl Hurst", "time": 1556702483130, "rating": 5.0, "text": "Have been using turbo tax for years and never had to much trouble with it until recently. Had BLPCPA go back over my taxes because of some things that didn't look right. They found some things that turbox was doing wrong and redid 2 years of my taxes plus this current year to help me lower my tax bill. Excellent customer service and a quick turnaround time", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "112011319020392854635", "name": "Jason M. Holt", "time": 1412943877997, "rating": 5.0, "text": "Opening a business and planning its future is not that easy; I learned that first hand. Six months ago, I opened a local business in Jefferson County and was excited to be my own boss, but I did not have much knowledge or skills about running a business or creating a business plan. Bryan L. Parker CPA was able to help me create an effective business plan, as well perform bookkeeping. I am now more confident about my business and its future.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "112066157960935318870", "name": "Marilyn Collier", "time": 1556579607005, "rating": 5.0, "text": "We have used Bryan Parker for 10 years and have been very pleased.  We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113257966579415200824", "name": "Alicia Melton", "time": 1553691232489, "rating": 5.0, "text": "We have been so pleased with Bryan Parker CPA.  They are always timely and efficient. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109086288399945301754", "name": "Adam Holmes", "time": 1573655573967, "rating": 5.0, "text": "Bryan and his staff takes the stress away from your tax needs and payroll requirements. Highly recommended !!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116779078548972716644", "name": "Anderson Rodriguez", "time": 1418713240469, "rating": 4.0, "text": "Our business was having problems with our bookkeeping. The person we initially hired set up back big time. Luckily, we got much needed help from Barry Crauswell of Bryan L. Parker CPA, LLC. He was able to get up back on track! It was great to know that he could help get us out of the jam we were in.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103376468985409430160", "name": "Luke Germek", "time": 1556894436935, "rating": 5.0, "text": "Excellent service at a reasonable price. Thanks for all of your hard work!!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "102882648010697328637", "name": "Mike Lynn", "time": 1520618369235, "rating": 5.0, "text": "Mr. Parker is AMAZING!!! He is very knowledgeable, easy to deal with, and best of all superior professionalism at an affordable price!!! I will definitely continue using his services for both my business and personal accounting affairs!!! Thanks Mr. Parker!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "114557499457094539349", "name": "Wes Day", "time": 1541618162848, "rating": 5.0, "text": "Bryan met with me on short notice.  Calm cool and collected, he reviewed my paperwork, charged me a more than fair rate, I thought.\n\nHighly recommended.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "101849667012111574980", "name": "Nisha Patel", "time": 1487092676075, "rating": 5.0, "text": "We have been using Mr. Parker for 13 years now for our business and personal bookkeeping.  He has assembled a great team and they do a fantastic job.  We thank you and hope to continue with many years of partnership.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116309493239551967933", "name": "Christine Long", "time": 1556642560053, "rating": 5.0, "text": "Bryan Parker and his staff, along with his wife Pat, have been consistent, efficient accounting advisors for our family for many years.  Mr. Parker has a wide scope of business experience in many different industries, so is definitely the \"gp-to\" person.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "105922963930691908783", "name": "Matt Brundige", "time": 1487087997630, "rating": 5.0, "text": "The team is so friendly and easy to work with. No question is a dumb question and they go above and beyond to make your tax season and payroll needs a very smooth process!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108568602490915006379", "name": "Pamela Collins", "time": 1480343988184, "rating": 5.0, "text": "Excellent and fast on completing my taxes and more money back then if I had done myself. Great advise on financial planning.  Friendly and professional staff", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103682052198523681843", "name": "Ron Waddell", "time": 1487361109912, "rating": 5.0, "text": "Bryan Parker has been my accountant and financial adviser for over ten years. I find him to be very honest, extremely knowledgeable, dedicated to serving his clients, and easy to do business with. I would highly recommend him and his staff to anyone looking for either an account or financial adviser.\n\nI find it really reassuring to know Bryan is on your side when I receive those irritating letters from the IRS.\n\nRon Waddell\nSterrett, Al", "pics": null, "resp": {"time": 1487420303536, "text": "Thank you for your kind words Ron. We strive to provide the highest level of service to our clients."}, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100236926857041528307", "name": "Lee Dykes", "time": 1556756606029, "rating": 5.0, "text": "No one looks forward to tax season, but Bryan Parker, CPA, and his staff help ease the anxiety of filing the necessary forms on time and with accuracy.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113060076254201156521", "name": "Kurt de klerck", "time": 1487113171767, "rating": 5.0, "text": "Bryan and his team do fantastic work , they are friendly and they always help you out in case you have any questions . I feel lucky to have them as my accountant and would only trust Bryan l Parker and his team with all my business related items .", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "111032031764538312639", "name": "Marjorie Berguson", "time": 1487122416128, "rating": 5.0, "text": "We feel very comfortable to have Bryan Parker do our tax returns.  He is very prompt and efficient.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "118323878804128032506", "name": "Iceeu (Sonshine)", "time": 1497288955272, "rating": 1.0, "text": "I had to give a star to review Mr. Parker. My. Parker is the Accountant for my neighborhood's H.O.A. I was relatively new to the neighborhood just buying my home 2 years prior to investigating the H.O.A. I was unable to get any financial information from the only board member so I went to Mr.Parker.\nHis Secertary was so kind and very helpful and I appreciated that. She told me Mr. Parker was not in the office after returning from an office. I asked her some questions and she went back and forth to the same office with answers to the question's. I them saw a man comes from the office leaving and got on the elevator headed down. I know this today to be Mr.Parker, as she walked past the man was wearing a T-SHIRT advertising his business Bryan L. Parker Accounting. I later sent him emails requesting his presence at our Association meeting, I never received a reply.\nI realize that all of this blame doesn't lie solely at Mr.Parkers feet, it lies equally at his feet and that of our Association President's feet. I received contradictory answers for questions I asked. As a homeowner I and my neighbors pay a fee to Mr. Parker and as an employee he should have been able to answer everyone of my questions and he did not. It is my opinion and the opinion of many of my neighbors that Mr. Parker made no effort to assist us with any information at all at several different requests and times. To us that is shady behavior.", "pics": null, "resp": {"time": 1501619224990, "text": "This post appears to have some misunderstandings. First of all, whoever was seen walking past, if you were told I was not in the office, was not me. We do not have t-shirts advertising our business so I would question if you were even at our office, since you have inaccurate information. Secondly, we are not employees of the HOA, we are contracted by the HOA board to handle certain accounting functions and provide the board with requested reports. Similar to any business, the reports are disseminated from the top (HOA) to those who need to know. Privacy laws are very strict and we try to adhere to them diligently. If you want more access to information of your HOA, I suggest you become a member of the board. As I understand it, several requests have been made for more board participation but thus far there have been no takers. If you become a board member, we would be glad to share appropriate information with you."}, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "102698727483056600869", "name": "Mike Bennighof", "time": 1487182542317, "rating": 5.0, "text": "Highly professional in all aspects.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "115538371609515829629", "name": "Jeremy Thompson", "time": 1424922207155, "rating": 5.0, "text": "He got me a ton more back on my personal taxes than doing it myself online.  Will be back next year for sure!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109139348286972042017", "name": "moms onDmove", "time": 1618317321080, "rating": 5.0, "text": "She is very professional, will explain every single detail you want to know and you'll have the feeling when you leave her office that the work will be done so you dont worry about it. I just wish we could have discovered her office sooner but now we are glad we did.", "pics": null, "resp": {"time": 1619446616875, "text": "We are so glad you discovered our office as well and are pleased with the services we provide.  Thank so much for your kind review."}, "gmap_id": "0x888925d20b4d224f:0x416891306bc029d4"}
{"user_id": "106033958673811959099", "name": "Jennifer Johnson", "time": 1548717020278, "rating": 5.0, "text": "Carla is amazing and gets you the best return possible! Great rates, friendly service, and I got a nice refund! she maximizes all write offs! Highly recommend", "pics": null, "resp": {"time": 1548717440265, "text": "Thank you Jennifer!"}, "gmap_id": "0x888925d20b4d224f:0x416891306bc029d4"}
{"user_id": "109862829200815696911", "name": "Joaquin Guzman", "time": 1532019680558, "rating": 5.0, "text": "Superb and highly professional! Filed all my accounting needs in a quick timely manner. Look forward to continued accounting needs. Thanks for all the hard and proficient work you provide!", "pics": null, "resp": {"time": 1532022001613, "text": "Thanks Joaquin for the wonderful review!"}, "gmap_id": "0x888925d20b4d224f:0x416891306bc029d4"}
{"user_id": "113162129762314605075", "name": "Jeanie Watts", "time": 1550380428495, "rating": 5.0, "text": "Carla is AWESOME! She has been the best with helping with all my tax needs.", "pics": null, "resp": {"time": 1550380816331, "text": "Jeanie so glad I could help you!"}, "gmap_id": "0x888925d20b4d224f:0x416891306bc029d4"}
{"user_id": "107248791327263572124", "name": "Givon Wayne Gilliam", "time": 1510681393089, "rating": 5.0, "text": "Best accounting office in Birmingham.", "pics": null, "resp": {"time": 1548716968739, "text": "Thank you Givon!"}, "gmap_id": "0x888925d20b4d224f:0x416891306bc029d4"}
{"user_id": "101652608513008434812", "name": "Josh McRight", "time": 1580848135468, "rating": 5.0, "text": "Chase and his team have been a great resource for my business. Before using them our books were a mess.  After starting with them I was able to get a lot more clarity around our weekly and monthly numbers.   So if your are looking for a professional with hands on professional attention, give Chase and his team a call !", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "112009274916042904568", "name": "Krystal Morrow", "time": 1580852494462, "rating": 5.0, "text": "I’ve known Chase for 16 years!\n\nIn the 16 years I’ve known him he has proven that he is honest, capable, and knowledgeable in the financial and marketing fields. Chase has a very creative and intelligent mindset along with the hard work ethic to make his visions and ideas come to life!\n\nChase is someone you can trust to take care of you and your business and help you get the Reboot you need!", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "106716473351380067343", "name": "Shawn Mertz", "time": 1583722949192, "rating": 5.0, "text": "Chase has become a valued member of our team!  He has brought a fresh look to our social media strategy whole also cleaning up and managing the books for us.  The difference has been night and day!!!", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "116522054355068383531", "name": "Jamie Kassler", "time": 1580911957590, "rating": 5.0, "text": "I had the pleasure of working with Chase Griffin while he was serving overseas as an organizational leader and mentor. Chase is passionate about efficiency, planning, business integrity and developing the core values behind his projects and teams. Chase is also great about putting his clients’ needs and interests first, while fostering honest relationships and trust - which I think is rare in any business environment. I am excited for Chase’s work through Reboot Analytics and the impact he will make in Huntsville, and beyond.", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "117703304638220401349", "name": "Jeremy Bronaugh", "time": 1580933959152, "rating": 5.0, "text": "Working with Chase has been a real pleasure. He's very gracious and respectful and I'm glad to have him on my team.", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "107692949410263106835", "name": "Zach Scott", "time": 1587761574010, "rating": 5.0, "text": "Amazing people with the highest level of integrity and professionalism. I cannot say enough about level of character or work ethic.", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "103947212596278202380", "name": "Geoffrey Middleton", "time": 1581457921399, "rating": 5.0, "text": "Extremely professional and makes sure things are done right the first time.  A great bookkeeper from start to finish.", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "106983887257235477207", "name": "Allison", "time": 1583788195948, "rating": 5.0, "text": "I've known Chase for several years.  I found him to be organized, knowledgable and above all an honest business man.  I look forward to working with him more in the future.", "pics": null, "resp": null, "gmap_id": "0x88623fbe23294673:0x8cac8cdcb0db43ff"}
{"user_id": "104904665929739847417", "name": "James Chancellor", "time": 1581395567013, "rating": 5.0, "text": "She is a strong Christian who is always looking out for others. Carol is extremely helpful. She knows what questions to ask inorder to help you get the most money back for your taxes. She doesn't treat you as a customer, she treats you as a person. She is always willing to go the extra mile and take her time with you inorder to get the job done correctly. Carol's prices are amazing. She was several hundred dollars cheaper than H&R Block. Not only that you never know who you get when you step into a big box tax service. My family will always choose Carol E. Douglas as our tax needs provider.", "pics": null, "resp": {"time": 1581422828409, "text": "Thanks so much for the review.  Looking forward to next year. God Bless."}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116250714072365762802", "name": "Jeff Welte", "time": 1602618838276, "rating": 5.0, "text": "Our FIRST choice for TAX prep help. Everyone in the office went above an beyond to help s with multi-state filings. It was complicated and they made it sound easy. HUGE Thanks to all!!", "pics": null, "resp": {"time": 1602649945197, "text": "Love new clients .. Appreciate your kindness.  Looking forward to our next visit.  Always Thankful !  God Bless !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "103962485830968019524", "name": "Jerrod Hodges", "time": 1590585499146, "rating": 1.0, "text": "2 out of 2 times disappointed. 1st time dropped off 2 months b4 the april dead line and it wasnt done so opted to do it myself. Then this year had a appointment on march 24th and still not done. And going some wheres else. If u have an appoint shouldnt it be done that day even with the covid19 issue  cause u have a set time??????\n\nUpdated : she used covid19 as a excuse,but hard to used that when my brother gave her his taxes 2 week after mine, his was done the week of the may 11th. So ill be going else where next year", "pics": null, "resp": null, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116354703942683138839", "name": "Pernell Glover", "time": 1529765468917, "rating": 5.0, "text": "Carol and Bridgette are amazing! They made the daunting task of tax filing stress free! It was like talking with new friends and before you know it you’re done! They are very experienced and ask questions you wouldn’t think to ask...and work to file your taxes leaving no stones unturned.They are very friendly, knowledgeable and good at what they do! I highly recommend!", "pics": null, "resp": {"time": 1530104914388, "text": "Love new clients .. Appreciate your kindness.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "101061659276326862279", "name": "Frances Dauster", "time": 1500300655758, "rating": 5.0, "text": "Carol has been doing my taxes since 1995. She has been AMAZING. From my being single, to married, to separated, to divorced, in addition I started a business, and had some overseas stuff going on - every step of the way Carol has been incredible. She goes to seminars, too - continuing ed is so important when it comes to quality work. Carol ROCKS.", "pics": null, "resp": {"time": 1500323799338, "text": "Appreciate your Loyalty.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "108446755128529805122", "name": "GSMO", "time": 1554999450603, "rating": 5.0, "text": "She was awesome! Very knowledgeable and helpful. I highly recommend Carol to anyone looking for tax help or a good accountant!", "pics": null, "resp": {"time": 1573785000582, "text": "Appreciate your kindness.   It was a pleasure. Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "104852750399815053202", "name": "sharkjones261", "time": 1500328394791, "rating": 5.0, "text": "Carol does a meticulous job. Highly recommend her", "pics": null, "resp": {"time": 1500329218647, "text": "Appreciate your Loyalty.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116321459190466358888", "name": "Carol Shipman", "time": 1517448951684, "rating": 5.0, "text": "OUTSTANDING!!! KIND, CONSIDERATE KNOWS HER STUFF AND VERY REASONABLE!", "pics": null, "resp": {"time": 1517532133909, "text": "Thank you for your kindness and loyalty."}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "106386297323170112427", "name": "Carliss Eaton", "time": 1611163298186, "rating": 1.0, "text": "If you need you taxes done, PLEASE STAY AWAY from this lady.", "pics": null, "resp": null, "gmap_id": "0x889bb2eb76956e41:0xce27f085399db154"}
{"user_id": "105845616086942748524", "name": "Jennifer Williams-Artis", "time": 1562258732129, "rating": 1.0, "text": "Scammers!!!!who dont return phone calls Megan or Carrie....they keep updating same properties on Zillow and Trulia to swindle applicants out of $50 application fees for any household members 18 or over and never check anything  while praying on indivduals with HCVP..... dont be fooled go some where else", "pics": null, "resp": null, "gmap_id": "0x889bb2eb76956e41:0xce27f085399db154"}
{"user_id": "104186743685623189138", "name": "Mitchell Pierce", "time": 1551474770645, "rating": 5.0, "text": "They all are just good people", "pics": null, "resp": null, "gmap_id": "0x889bb2eb76956e41:0xce27f085399db154"}
{"user_id": "114218063433372953033", "name": "Tom Bagwell", "time": 1523638566883, "rating": 5.0, "text": "First rate in every way!", "pics": null, "resp": null, "gmap_id": "0x889bb2eb76956e41:0xce27f085399db154"}
{"user_id": "105317824734908614873", "name": "Renee Gundolff", "time": 1461275507179, "rating": 1.0, "text": "Absolutely horrible! I can't get a returned call.", "pics": null, "resp": null, "gmap_id": "0x889bb2eb76956e41:0xce27f085399db154"}
{"user_id": "103587411132535322648", "name": "Tutti Chaney", "time": 1480092085001, "rating": 1.0, "text": "I've lived in sacrament for 2 years never been late and they have the nerve to tell me I haven't been paying rent and put a eviction notice on my door I have proof.", "pics": null, "resp": null, "gmap_id": "0x889bb2eb76956e41:0xce27f085399db154"}
{"user_id": "105597955550207723819", "name": "Rickey Hogan", "time": 1613672625346, "rating": 5.0, "text": "Rosey was very nice and friendly and she knows her business. They have been very helpful. My wife and I just moved here from Georgia and Dunn tax service has been really helpful answering any questions we've had.  Keep up the great work", "pics": null, "resp": null, "gmap_id": "0x8889908cf1b19431:0x687aa807ce6e168f"}
{"user_id": "103231423440687304047", "name": "CATATONICBADGER", "time": 1487022559275, "rating": 5.0, "text": "The folks at Dunn tax service are always very helpful and extremely nice. I would just like to say thank you for the service you provide at very acceptable prices.", "pics": null, "resp": null, "gmap_id": "0x8889908cf1b19431:0x687aa807ce6e168f"}
{"user_id": "100038016686399216908", "name": "Shelia Sorrow", "time": 1550882320930, "rating": 5.0, "text": "They help me every year and my taxes are unique!", "pics": null, "resp": null, "gmap_id": "0x8889908cf1b19431:0x687aa807ce6e168f"}
{"user_id": "109334253550622613230", "name": "Diana Ellis", "time": 1492550830798, "rating": 5.0, "text": "Everyone the is so nice, friendly always ready to help anyway they can.", "pics": null, "resp": null, "gmap_id": "0x8889908cf1b19431:0x687aa807ce6e168f"}
{"user_id": "104571210114955640606", "name": "robbie walker", "time": 1454605326108, "rating": 5.0, "text": "I have been using Barry Thompson with Thompson & McCarty for 15+ years.  I have, in the past, used a few other CPAs but have not found anyone else that surpasses his professional service or genuine compassion and caring for customers like what Barry shows.  He is thorough and patient in his work and very courteous in conducting business. I would not use anyone else and I highly recommend him to anyone. He has always done a great job for me and my family and I definitely want him representing me if ever needed for audit purposes.", "pics": null, "resp": null, "gmap_id": "0x8889cb91514506df:0x35e3a6894cf2988a"}
{"user_id": "110433251264121758441", "name": "Dean Grassi", "time": 1452815098199, "rating": 5.0, "text": "I have used Thompson and McCarty for years. Always professional and courteous! If you ever get audited you want an experienced CPA in your corner! Highly recommended!", "pics": null, "resp": {"time": 1453138027768, "text": "Thanks!"}, "gmap_id": "0x8889cb91514506df:0x35e3a6894cf2988a"}
{"user_id": "112532084045916391797", "name": "James Grigsby", "time": 1452818942808, "rating": 5.0, "text": "Have known Mr.Thompson for over 10 years. He has always been a honest, straight shooter that does excellent work. Highly recommend!", "pics": null, "resp": {"time": 1453138005706, "text": "Thank You!"}, "gmap_id": "0x8889cb91514506df:0x35e3a6894cf2988a"}
{"user_id": "105242906481521637095", "name": "D S", "time": 1521730498213, "rating": 5.0, "text": "They're highly qualified accountants and all round great people. You'll be glad you used them.", "pics": null, "resp": {"time": 1521731581623, "text": "Thank you D S  Appreciate the kind words and the confidence."}, "gmap_id": "0x8889cb91514506df:0x35e3a6894cf2988a"}
{"user_id": "110660855135971582078", "name": "Sandra Kennedy", "time": 1552942950940, "rating": 1.0, "text": "We have begged for Barry to be honest with us. We are still waiting on 2017!!!!!!\nWhy would he lie so much? We call everyday several times a day !!!\nCan't his partners help him if he needs it?\nHELP!!!!!! BARRY!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889cb91514506df:0x35e3a6894cf2988a"}
{"user_id": "115128293354295829091", "name": "Mikaela Hoffman", "time": 1591888465422, "rating": 5.0, "text": "This was my first experience coming here and I am beyond pleased. I had my taxes done at another business and ended up coming here for a second opinion. I am very glad that I did because I saved thousands. I highly recommend Brett Professional from great customer service to good quality work!", "pics": null, "resp": {"time": 1591892187709, "text": "Thank you Mikaela!  We enjoyed working with you as well. We look forward to helping you in the future!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "115477451490149814611", "name": "Tim Defebaugh", "time": 1491331783515, "rating": 5.0, "text": "Brett Professional Services was referred to me for our tax needs in Gulf Shores. We purchased a rental condo there and they are handling all the taxes for us. I could not ask for or receive any better service from anywhere. They are incredibly professional and polite. They pay great attention to their client and do an outstanding job. I can not recommend them enough.\n\nThank you\nTim and Jennifer D.", "pics": null, "resp": {"time": 1602625756016, "text": "Thank you Tim! We have also enjoyed working with you over the years! Thank you for the 5 star review!!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "106933507915872735440", "name": "Martin Middleton", "time": 1582751405121, "rating": 5.0, "text": "Leslie is great! She’s been my go to since 2011.", "pics": null, "resp": {"time": 1602625655802, "text": "Thank you for your business Martin!!  We enjoy working with you and have so since 2010!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "103595945903523464068", "name": "Jim Peeples", "time": 1581455004441, "rating": 5.0, "text": "Very good professional service.", "pics": null, "resp": {"time": 1602625688561, "text": "Thank you for your business Jim! Your support for our business means so much to us, thank you!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "106344673356578017312", "name": "ladonna jones", "time": 1613173599483, "rating": 5.0, "text": "Always been friendly and great. I have been going here for years Ms Earlene is awesome. Most all of my co workers also go here. So tax mart is always who I refer people to when they ask me who I use.", "pics": null, "resp": null, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "111273125447895134815", "name": "lps cloudy", "time": 1615318847687, "rating": 5.0, "text": "Joyce has done my taxes for over 25 years and then I married and she still does. I love how we have to go over and check it all before we sign to send off, which cuts down on simple typos and mistakes. This lady worked on my taxes from home being sick or at work. She goes above and beyond and I could not have asked for a better friend! We love you Joyce. Thank you taxmart!", "pics": null, "resp": {"time": 1615327721271, "text": "Thanks ips cloudy for your post and visiting Tax Mart's site. I agree,  Joyce is a seasoned tax professional and an asset to our organization."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "106711418637317555496", "name": "Kim Reid", "time": 1611407673216, "rating": 5.0, "text": "You can only do your business thru a drop box. No human contact. They clean drop box after ever person, which I think is good. I use Stacy for years and he is very understanding and helpful. Thanks Stacy and Taxmart", "pics": null, "resp": {"time": 1612830175855, "text": "Thanks Kim,  Tax Mart strives to have a Covid- safe  environment. Thanks for your business."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "103759940947054105325", "name": "jackie brown", "time": 1612805655976, "rating": 5.0, "text": "Absolutely love stacy, he's taken care of us for years now.", "pics": null, "resp": {"time": 1612828915105, "text": "I agree Jackie, Stacy is a professional."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "106473144445870658150", "name": "Nancy Steadmon", "time": 1581900599059, "rating": 5.0, "text": "Our family go to place for having our taxes done. Alice is awesome, she has been doing ours for years. Friendly quick and efficient. Go in give info and Wala they are done.  The front desk folks are nice and friendly. We love tax mart", "pics": null, "resp": {"time": 1581957504967, "text": "Thanks for your business"}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "113832256192915439881", "name": "KatrinaC Garcia-Lopez", "time": 1617678230867, "rating": 5.0, "text": "Always awesome!", "pics": null, "resp": null, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "104907948496949106444", "name": "Roland Patterson", "time": 1591984090104, "rating": 1.0, "text": "Hung out to dry!!!\nDon't count on any help from these people. THEY MAKE MISTAKE on my tax return. Caused me to be audited by state. Had ALL RECEIPTS FOR DEDUCTIONS. Now I'm out an extra 2600.00. They say we can't help you. ALL BECAUSE THEY LEFT OFF MY DEDUCTIONS!!!", "pics": null, "resp": {"time": 1594773339570, "text": "Thanks for your reply but with any audit,  state or federal,  proving deductions  when asked is imperative.  Refusing or not complying to provide requested info usually has negative results."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "107796830888216185109", "name": "David Jeffreys", "time": 1615834145348, "rating": 5.0, "text": "Stacey is the best!!", "pics": null, "resp": {"time": 1621090974957, "text": "I agree with you David, Stacy does a great job. Tax Mart appreciates your post and your business."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "107444577975503422029", "name": "Leah Foster", "time": 1581905239192, "rating": 5.0, "text": "Erlene is the best!", "pics": null, "resp": {"time": 1582039325185, "text": "Thanks for your business Leah"}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "103157020833574392019", "name": "Regina Gamel", "time": 1294251897807, "rating": 5.0, "text": "Great place been there the past two years and they did a great job ..I highly recommend Tax mart", "pics": null, "resp": {"time": 1612830613256, "text": "Tax Mart Regina, Tax Mart appreciates your business and your recommendation."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "115513640510914758321", "name": "Jason Stricklin", "time": 1518114986458, "rating": 5.0, "text": "Love Taxmart! Alice is the best!", "pics": null, "resp": {"time": 1612830335138, "text": "I agree Jason, Alice is one of Tax Mart's experienced preparers. Alice always does a great job."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "116925752362484409302", "name": "Anthony Sparks", "time": 1485625729079, "rating": 5.0, "text": "Fast, courteous, and knowledgeable", "pics": null, "resp": {"time": 1612830419213, "text": "I appreciate your kind post Anthony."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "109900657765821270674", "name": "Heather Juron", "time": 1604453942268, "rating": 1.0, "text": "This was our 2nd year filing with this company as they were referred to us. We recently received a letter from state saying there was a mistake in our filings in which we owe more. I have called 5 times and still waiting on someone to call me even after I emailed the letter from state over a month ago. I will never recommend them to anyone or go back to them. Awful customer service and do not care about their customers. You are better off going to H & R Block who pulled someone off the street to do your taxes. Same service.", "pics": null, "resp": null, "gmap_id": "0x88626cb9adbeb059:0xfddb972af18bde90"}
{"user_id": "104782502903015745657", "name": "Stan Shoemaker", "time": 1599234810354, "rating": 1.0, "text": "Do I really have to give a star? Went to see Brenda about getting some past tax issues taken care of, we sat in her office while she supposedly ordered my documents online and said they would take 10-14 days to get here. I waited and waited, then at week 4 I called to see what was going on and also emailed her, she has yet to return my calls or email. It’s obvious now that the documents were never ordered, and it turns out that these could have been gotten online Instantly while I was there. She knew I was in a time crunch yet she could care less about clients or making money, this would have earned her around $1,000. I don’t see the point in wasting mine and her time that day knowing full well she had no intention of handling my case, just lied right to my face.  Needless to say, I have ordered the documents myself and will be going to a different accountant to handle them for me.", "pics": null, "resp": null, "gmap_id": "0x88626cb9adbeb059:0xfddb972af18bde90"}
{"user_id": "102113633129362751499", "name": "Murphree Joy", "time": 1584999383022, "rating": 1.0, "text": "I was a new client with a 4:00 APPOINTMENT.  At 4:30 I had still not been called back.  When I inquired they said Brenda Blevins worked her co-worker’s client in in front of me.   Someone could’ve told me that. Someone could’ve called me and told me to come in a little later. Then they said well there’s a man back here that can wait on you. They could’ve offered that initially. I told them I thought they were very unprofessional, their office was not run very well and that I would take my business elsewhere. Don’t go here!", "pics": null, "resp": null, "gmap_id": "0x88626cb9adbeb059:0xfddb972af18bde90"}
{"user_id": "103023726882824147165", "name": "Lee Madkin", "time": 1607406299795, "rating": 5.0, "text": "Good tax people! Very professional staff!", "pics": null, "resp": null, "gmap_id": "0x88626cb9adbeb059:0xfddb972af18bde90"}
{"user_id": "117642196199695178342", "name": "Bryan Wylie", "time": 1563403370284, "rating": 1.0, "text": "As a previous client of Brenda Blevins for about 2 years, both business and personal, I would not recommend her services.  I experienced late tax filings, rude staff members(some, but not all), and numerous communication errors.  This is likely due to the large staff turnover, which is typically not a good sign.", "pics": null, "resp": null, "gmap_id": "0x88626cb9adbeb059:0xfddb972af18bde90"}
{"user_id": "105176781992980568645", "name": "Joe Fields", "time": 1394930680654, "rating": 5.0, "text": "Mrs. Blevins is by far the most outstanding Tax and Accounting Firm in North Alabama if not the entire State. Have been using this Firm since 2008 and have had a pleasant experience since day one. Definitely a five star organization in my book.", "pics": null, "resp": null, "gmap_id": "0x88626cb9adbeb059:0xfddb972af18bde90"}
{"user_id": "107181829472748152542", "name": "Charles Hansen", "time": 1518037835527, "rating": 5.0, "text": "Best CPA organization around! I highly recommend and trust Bandura CPA for any of your tax needs.  Everything he does is very professional and very timely with prompt responses.  Anthony is very knowledgeable for any type of question you may have.  I have referred my family, friends and co-workers for their services.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "113525368422848772565", "name": "Andy Gagliano", "time": 1466087973733, "rating": 5.0, "text": "I have known Anthony Bandura with Bandura CPA, LLC for many years now, and I highly recommend his services. Anthony has an exceptional knowledge of the tax laws and how those laws apply in the real world. He also has a very strong business intellect as well, and he knows what it takes to make a business profitable no matter the industry or business classification.\nI highly recommend Bandura CPA, LLC for any business owner who needs help with their bookkeeping and tax filings.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1457019754115, "rating": 5.0, "text": "I have worked with Anthony before and everyone I have sent to him has been amazed at the work he does. He gets the work done fast and he is very reasonably priced. his knowledge of quick books is extensive and he has a lot of friends in the IRS so he can help you out if your about to get audited. My firm has Anthony listed in our referral page because we trust our clients to Bandura CPA LLC. Chris Reid,", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "116105108382431027559", "name": "Ken Sawyer", "time": 1521212215754, "rating": 5.0, "text": "We always receive expert advice and prompt service from someone who takes the time to really understand our business, We could not be happier  and highly recommend Bandura CPA!", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "103422800922355968694", "name": "NDT Tech", "time": 1518037921594, "rating": 5.0, "text": "I highly recommend Bandura CPA, LLC for any business owner or individual who needs assistance with their bookkeeping and tax filings.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "109981955826356170249", "name": "Alex Espinosa", "time": 1518711961673, "rating": 5.0, "text": "Very Professional and quick response from them.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "101858859352818477329", "name": "candi campbell", "time": 1523927267987, "rating": 5.0, "text": "Thanks for all you do", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
