{"user_id": "107035388024058210213", "name": "Pamela Kerns", "time": 1621854774162, "rating": 5.0, "text": "If you are looking for one on one training in an encouraging environment this is the place for you!  Train along side of people who encouraged and challenge you to do better and lift more.  Childcare is included and a wonderful option.", "pics": null, "resp": null, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "110316222139261952777", "name": "Katie Brunaugh", "time": 1620839100108, "rating": 5.0, "text": "Awesome Place, Great staff and Trainers! Whether you are a beginner or have been exercising for years, this is the place for you! The support and family dynamic is something I have never experienced in this setting before! I LOVE Burn Boot Camp Madison!!", "pics": null, "resp": null, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "100232057088744215452", "name": "Heather Strawder", "time": 1607035926485, "rating": 5.0, "text": "I’ve been a member since they launched this location here in Madison. If you need some structure to your weekly workout routine, accountability, positivity, uplifting trainers, and challenging workouts that can be modified to meet you at any fitness level, this is the place!! What I love even more is how Burn Boot Camp is always connecting with the community and giving back!! This place is full of inspiration to meet your fitness goals, physically and mentally!! It has truly been a game changer for me, and it really is a family! LOVE LOVE LOVE Burn Madison!!! 💙💙💙", "pics": null, "resp": {"time": 1607196871186, "text": "Thank you!"}, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "109230575424554244362", "name": "Stephanie Balch", "time": 1607635632879, "rating": 5.0, "text": "Not even sure I know where to begin,  but I honestly wish I could rate more than 5 stars! I have been going to BURN Madison since they opened. I look forward to going every day, sometimes twice! The facilities are safe and clean, the workouts are ever changing and each camp can be personally modified by the excellent trainers to accommodate your fitness level. I have met so many great people here. 2020 has been a year, I am glad to have BURN to keep my physical and mental health in check!", "pics": null, "resp": {"time": 1608359748829, "text": "Thank you!"}, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "101087547749374460335", "name": "Jessica Tyler", "time": 1607547655149, "rating": 5.0, "text": "I love working out at Burn! Burn provides high energy workouts for all ability levels. Burn is a special place and you know that from the minute you walk in. Everyone is friendly, supportive, and encouraging. Since starting Burn I have gotten stronger and been able to set a personal record half marathon and 5k time. Burn is more than a gym and I highly recommend you give it a try!", "pics": null, "resp": {"time": 1608359764993, "text": "Thank you!"}, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "103622149711488724261", "name": "Morgan Thompson", "time": 1608079442452, "rating": 5.0, "text": "This place has changed the way I workout. I was never one to like high intensity workouts but burn boot camp has made it fun. To the trainers and the bonds you create with the others is more then I ever expected. I actually enjoy getting up in the morning and going to my workout and I never miss a day off when I’m not at work. The trainers will take time with you to help you reach your goals and genuinely care about helping you reach them. They are great about modifying something to make it work for if you have any injuries or something isn’t working for you. This is more then a gym it’s a family", "pics": null, "resp": {"time": 1608359707332, "text": "Thank you!"}, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "115368122255755413955", "name": "A. Damphouse", "time": 1612871828182, "rating": 5.0, "text": "Excellent...quite challenging.  Awesome trainer (Seth).  Looking forward to the next camp.", "pics": null, "resp": null, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "112702846201676488517", "name": "Maddie Fruehwald", "time": 1607384453839, "rating": 5.0, "text": "The community is very uplifting and encouraging. The trainers take a holistic approach to your fitness journey, and are constantly there to encourage and hold you accountable to obtain your goals.", "pics": null, "resp": {"time": 1607490793898, "text": "Thank you Maddie!"}, "gmap_id": "0x88626781c43fd1e9:0xfc4257dcf000027f"}
{"user_id": "106139554248991936651", "name": "Karla Wright", "time": 1595351564687, "rating": 5.0, "text": "I’ve had a lot of trainers in my past. But Adam has honestly been the best. He caters your meals to suit you. I’ve lost more weight and gained more muscle using his suggestions as I have with any plan, including a physician monitored diet plan. The workouts aren’t easy, but they’re effective. Workouts never get easier, you just get stronger.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "105287993655874360494", "name": "valerie jones", "time": 1595976134756, "rating": 5.0, "text": "Adam is very knowledgeable and passionate about his craft. He has dedicated much time into research, training and education to become a holistic nutritiinal guru who happens to train also. His self made supplements are great and actually help you achieve your goals. He's almost made me give up breads however I won't give him that satisfaction because he'll think he all that😁😁 You will enjoy the short workouts and the comraderie with the others. 530 am is awesome.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "118168684134946676314", "name": "Victoria Williams", "time": 1595200672546, "rating": 5.0, "text": "Adam at Burton Training is amazing. He created a meal and exercise plan that help me get my thyroid under control as well as increase energy. I have multiple chronic conditions and no one has been able to get them under control until I met Adam. Very thankful for his services.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "110025046459727115963", "name": "Healing Waters", "time": 1595602489179, "rating": 5.0, "text": "Burton Training is a place where you will get sound nutritional advice/coaching along with a workout plan tailored to help you achieve your wellness goals.  :)", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "104471590948630174289", "name": "Chancee Fancee Christian", "time": 1567393641430, "rating": 5.0, "text": "I love the head trainer because not only is he trustworthy and honest! He is also knowledgeable, professional and knows his stuff!! I’ve used the fat burner and the detox tea ! The tea is like no other and I felt amazing while drinking it... forever customer!", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "108280479879398791051", "name": "Lauren Fant", "time": 1577401385675, "rating": 5.0, "text": "I participated in the online training program. The program was so easy to use and I loved the length of each workout. The videos helped a lot when I was unsure of how to do a certain move.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "117220048528416134494", "name": "LB Bunting", "time": 1506866262975, "rating": 5.0, "text": "The team at Burton Training are very knowledgeable and really work with you personally to set you on your path to success. Whether it's better eating habits, getting rid of unwanted inches or what helped me; gain strength in my body. With Adams in studio workouts - emails - home training videos--- it's worth every penny. Speaking of pennies, you're not going to be spending the overwhelming prices of a regular trainer. These guys are amazing!!!\n\nGive them a try!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "110363873701129005119", "name": "Kineshia Bolden", "time": 1544750671062, "rating": 5.0, "text": "Intense! yet, satisfying! Adam is very professional and knowledgeable. He not only wanted to help me reach my weight loss goals but change my mindset as well, to begin my journey of a new happy, healthier way of living.", "pics": null, "resp": null, "gmap_id": "0x8889194ea6df3575:0xabbf58ad002bfee2"}
{"user_id": "111360595667985499249", "name": "AB H", "time": 1603637523006, "rating": 1.0, "text": "Pell City Fitness has a very nice facility and Alana is great, but unfortunately the owner of this gym is so unprofessional, arrogant, and sometimes downright rude. They have dropped prices and promoted new pricing because they say they care about the community but the truth is they have lost several members over the last several months due to the owner’s attitude and the price is an attempt to get people back. I wouldn’t go back if the membership was dropped to $50. It’s just not worth dealing with him. Plus he is actively trying to sell the business without any of his customers knowing. The gym is suppose to be a place to mentally decompress and this environment does not do that.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "108182209841654731139", "name": "Jami Shear", "time": 1579301717639, "rating": 5.0, "text": "Getting out of bed and to a 5 am class has never been so easy with the staff and people that work out here. Super caring and friendly coaches and an overall wonderful environment to be in. Plus, sharing a prayer after ever workout is the best way to start your day. I could never say enough nice things about this place. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "113601980884009403557", "name": "Lori Galloway Cochran", "time": 1579377229214, "rating": 5.0, "text": "This place is so awesome!  The Coaches are encouraging, knowledgeable, professional, and genuinely care about each person.   You feel like family from your first class.  I have spent years looking for a gym like this- and I am blessed to have found it right here in my town", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "112578313843758427398", "name": "Holly Bell", "time": 1579384522845, "rating": 5.0, "text": "Love Pell City Fitness!! Joining was the best thing I could have ever done. I have made so many new friends and we are all encouraging each other in our fitness journeys.  We are truly a family!!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "102974151115831169395", "name": "Stephanie Braden", "time": 1579311848461, "rating": 5.0, "text": "If you are looking for a gym that stands above all the other guys, this is the place! To Pell City Fitness, you are not just another “member”. They sincerely care about you and your fitness goals. The coaches are personable and push you to get the very best out of your workout. They truly want to see you hit your goals and hit those goals you never thought was possible. I love the flexibility in class schedules and the fact that they have free childcare! Make your home gym PCF. You will be so glad you did!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "102431306809225511279", "name": "shay pierce", "time": 1579308141525, "rating": 5.0, "text": "Amazing People/FitFam. Clean equipment. Truly a life changing place. Positive atmosphere. Coaches that genuinely bring you into their family. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "108558898543631100751", "name": "Christy Bline", "time": 1579288044515, "rating": 5.0, "text": "PC Fitness is my home away from home!! The staff are great and very knowledgeable, helpful And caring!  They will know you by name not number. Whatever fitness level you are you will fit in!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "116918614897171633945", "name": "Kelly Clark", "time": 1579288011600, "rating": 5.0, "text": "PC Fitness is a family. Scott and his gang are always available to help. If you can’t do something they are going to get you fit to do it. Give them a try!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "118015590510539671435", "name": "Bridget Ham", "time": 1579298331217, "rating": 5.0, "text": "Great place and great people.  I never thought working out could be this fun!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "111970455786397063485", "name": "Christine", "time": 1556913677907, "rating": 5.0, "text": "If you want the best extended family this is where you need to go. Everyone there is very welcoming and will help you if you have problems with the workout with no judgment ever. Come in and say hello you will not be sorry", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "103392536493921317628", "name": "Neil Allman", "time": 1547936328544, "rating": 5.0, "text": "Even if you don't like working out, you'll love this gym. They are just so dang welcoming and good at modifying for beginners. You can do this, no matter what shape you are in.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "110017427534765095447", "name": "paula eiser", "time": 1579287971950, "rating": 5.0, "text": "Amazing program and people..helped me get healthy and fit with amazing support and direction!!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "101117746081410402102", "name": "Jade Martin", "time": 1556908941672, "rating": 5.0, "text": "Awesome gym! Great coaches and a good environment! Everyone is very nice and welcoming!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "105468558060890805552", "name": "Laura Rogers", "time": 1556909524067, "rating": 5.0, "text": "PC Fitness has become my home away from home. Everyone is so helpful and encouraging.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "110141460230043745050", "name": "Lindsey Bone", "time": 1556561563842, "rating": 5.0, "text": "Love the environment, the skilled coaches and the encouragement from all of the great teammates!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "105209763606379655671", "name": "Catherine Salinas", "time": 1562012139880, "rating": 5.0, "text": "Love the owner & it's trainer especially Alana weems", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "104684776848355204871", "name": "Wilson Thomas", "time": 1548625447116, "rating": 5.0, "text": "Great facility with staff that really cares. If you are looking to reach your fitness goals this is the place to go!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "109048716233879236430", "name": "Nathan Seville", "time": 1557003459430, "rating": 5.0, "text": "Great people! Great coaches!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "117043280500091485783", "name": "Stephanie Sawyer", "time": 1547606812168, "rating": 5.0, "text": "Loved the yoga class!", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "111647816791446920826", "name": "Curtis Garrett", "time": 1540600966416, "rating": 5.0, "text": "If you to get in shape, crossfit/boot camp will help.", "pics": null, "resp": null, "gmap_id": "0x888bd7c466daaaab:0xaddfe8e82c81226a"}
{"user_id": "113942332720667085661", "name": "ADAM LAVOIE", "time": 1619558565028, "rating": 5.0, "text": "hhc is a great gym.friendly staff, awesome equipment an its very clean. would def recommend", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "110752391691202586001", "name": "TRISTON B Johnson", "time": 1517425657413, "rating": 5.0, "text": "Love the club love everything about it", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMyGpcw3Z8zKVQ63C635_M4iC3Mic_PN1oD19sh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "115931899540717646050", "name": "Iris Parks", "time": 1603210882333, "rating": 5.0, "text": "I love it wonderful people great place to work out.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "109458883403345948250", "name": "Larry Parker", "time": 1609353892193, "rating": 5.0, "text": "Very friendly staff, good atmosphere as well as weights and machines. A small but good place to workout.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "107699293080696832898", "name": "Kimberly Lewis", "time": 1576179445396, "rating": 5.0, "text": "Awesome gym. Owner & staff are ALWAYS friendly and courteous. If you're looking for a personal trainer you can't go wrong with Michael C!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "113322775243639568441", "name": "margaret couk", "time": 1580153480736, "rating": 5.0, "text": "Quality equipment, clean, friendly and helpful staff. Their Silver Sneakers classes are the best, bar none. They have a wide variety of other classes as well.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "104739353653960808028", "name": "Amanda Nutton", "time": 1583848728628, "rating": 5.0, "text": "Priced them for a local gym, had great prices and was quick responding to my email. I didn’t chose them because I was looking for a gun with tanning option, but if I just wanted to work out, hands down I would have picked them.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "111309208274967791648", "name": "True Patriot 1776", "time": 1536791469374, "rating": 5.0, "text": "Great gym! This place just puts off the feel of a second home. The staff is so friendly and always smiling.   They have great equipment and has great flow. Loved working out here.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "108363821032319171330", "name": "Courtney Ray", "time": 1496756820624, "rating": 5.0, "text": "This gym is great! I never thought I would love going to a gym but I totally do now. They have so many machines and everyone understands that you are there for a reason so you don't feel like you are being judged. They make you feel like family :) talk to Dave he is the best!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "105375081925576024452", "name": "DeAnna Meads", "time": 1598360246048, "rating": 5.0, "text": "Had a great experience!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "104948736981997622877", "name": "John Schilleci", "time": 1563911379555, "rating": 5.0, "text": "Great place to get a work out. Courteous staff", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "111399605952017701133", "name": "커버 마미CoverMommy", "time": 1520518626596, "rating": 5.0, "text": "They are friendly and kind. Most of all, their policy is clear and simple and I like that. Some health centers have bad policy so that once you join them, canceling is very hard maybe impossible.\nAnd also I like clean and cozy bathroom and shower area. Good kids club, well maintained equipments too. Highly recommand!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "112588721467539124345", "name": "Brian Foshee", "time": 1552519083525, "rating": 5.0, "text": "Great gym small town health club feel in the bustling suburbs. Great escape after the workday.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "110329799855152678219", "name": "Barb DiBurro", "time": 1499261828605, "rating": 5.0, "text": "Great gym. Good selection of classes, machines are well maintained and plentiful, it is clean and the staff is Ah-may-zing. Everyone of them has answered questions or made suggestions to help me. Great atmosphere, staff and gym members are extremely supportive", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "116785639291049917782", "name": "Terri Nicole VO", "time": 1530025057527, "rating": 5.0, "text": "I love this gym! The people are terrific, the workouts are killer, the equipment and free weights and ample and well taken care of! Love spin, the boot camp style synergy and trx, Zumba, power pump, kick boxing. I've got to try the yoga class that everyone raves about next.  The owner and staff and sweet and responsive too any need you have. The trainers are wonderful - shout out to Cedric and Amanda who are truly experts in their field. It won't take you long to feel like one of the family!!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "103370322188754609781", "name": "Nicole Collier", "time": 1555624446101, "rating": 5.0, "text": "I highly suggest @helenahealthclub They have $5 enrollments this month. They are 24/7 365 days, have childcare, personal trainers, nutrition consultations, the equipment is always well kept and clean, PLUS amazing classes like HIIT, power pump, spin, zumba and cardio kick.\n\nThe biggest thing for us though is how incredibly friendly everyone is. There is zero pretentiousness.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "110109603965891371856", "name": "Wes Christie", "time": 1548213640107, "rating": 5.0, "text": "Good atmosphere, all the equipment you need. Members and staff are always friendly.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "100804462023277780227", "name": "Clifton J McMillan Sr", "time": 1503432917669, "rating": 5.0, "text": "Clean, family friendly well stocked with machines and free weights!  Staff friendly and helpful.   Content member since their beginning.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "117992218629899763250", "name": "Dustin Strickland", "time": 1548239688718, "rating": 5.0, "text": "Great local workout facility, 24 hour access!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "109144111134507483881", "name": "Mike S", "time": 1545005763889, "rating": 5.0, "text": "Great place to workout.. good equipment", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "116334372791007870857", "name": "Chris Prosser", "time": 1494418224145, "rating": 5.0, "text": "This gym if great. They have all the machines you would want and the staff makes it feel like a family.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "110750046015916385500", "name": "flowbee _89", "time": 1498359975168, "rating": 5.0, "text": "The personal trainers are awesome and helpful. The equipment is really nice.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "109999310986048813256", "name": "Emmanuel Scozzaro", "time": 1444670144609, "rating": 5.0, "text": "Great place!  Cares about your overall fitness!  Totally recommend!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "100191347059806882309", "name": "Diana Owens", "time": 1549240940513, "rating": 5.0, "text": "Great gym with great employees!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "110795215949830258453", "name": "Elizabeth Letson", "time": 1499705999519, "rating": 5.0, "text": "Great gym, very clean lots of equipment and classes and very clean!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "102563052692728744262", "name": "KD Burchfield", "time": 1513338448663, "rating": 5.0, "text": "Family owned, clean and friendly staff. Love their yoga classes!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "111456794768704195930", "name": "Buddha 3g", "time": 1569720616459, "rating": 5.0, "text": "Nice environment.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "109371592272649243655", "name": "Tommy Palladino", "time": 1488845727566, "rating": 5.0, "text": "The best variety of exercise equipment and weights in Helena.", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "105608214908364551831", "name": "Brian McCollum", "time": 1543973908270, "rating": 5.0, "text": "Great Place So Far!", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "114026957131893598606", "name": "Edgar A", "time": 1482949751853, "rating": 5.0, "text": "Clean and Nice", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "101852264883772648501", "name": "Jkline32", "time": 1497041114875, "rating": 4.0, "text": "Good.place", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "104432836073525923595", "name": "Milton Guardado", "time": 1611589944435, "rating": 5.0, "text": "(Translated by Google) Well\n\n(Original)\nBueno", "pics": null, "resp": null, "gmap_id": "0x888926e6fc37c2bf:0x280ba178090500ec"}
{"user_id": "117066165629829383629", "name": "Shannon Magers McNamee", "time": 1610257603108, "rating": 5.0, "text": "I attended the Huntsville Adventure Boot Camp For Women several years ago and loved every minute of it. I stopped attending because of a move to Birmingham. (I’m hoping one day Joe and his family will relocate! :0) ) I never found a great boot camp in Birmingham and ended up joining a gym, but never felt the support and accountability I did while attending HABC. After the pandemic hit, I didn’t feel comfortable going back to the gym and still don’t. Luckily I saw one of Joe’s posts about his online workouts and I signed up right away. I love these online workouts! They are 30 minutes, 4 times a week and so thorough. I feel like I get a great overall workout. Joe takes the time to explain each exercise to make sure you are doing it correctly and gives options for all fitness levels. He also checks in with you to offer support and answer any questions you may have.\nIf you are looking for a fresh, healthy start - contact Joe today. He’s got a program that will be able to help.", "pics": null, "resp": {"time": 1610306511040, "text": "Thank you so much for the awesome review Shannon! I'm very grateful to have the opportunity to work with you again."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "108599686709993985015", "name": "Claire Aiello", "time": 1608647879292, "rating": 5.0, "text": "I love Huntsville Adventure Boot Camp for Women. I've been going for several years, and it's given me a whole new outlook on life, health, and exercise. Joe Martin is positive, upbeat, and has a daily joke for us (we sometimes laugh) - but the important part is, he keeps us motivated and we motivate each other.\n\nIf you don't have your health, you don't have anything. Really! You have to take time for yourself and keep fit.  Or you can't take care of anyone else. Take this time out for yourself -- you are worth it!\n\nAlso, if you're hesitant to join because you might think the class is like a \"military-style\" boot camp, it's not. It is doable and fun.  Every day is different. You'll make some of the best friends, too.  We all support each other -- come join us!", "pics": null, "resp": {"time": 1608830405161, "text": "Thank you so much Claire! I am now going to hire you to do my marketing :) Because you nailed it! Lift each other up, offer encouragement, and move forward together."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "108818624619734204193", "name": "Hillary Dunham", "time": 1608566505307, "rating": 5.0, "text": "Huntsville Adventure Boot Camp is absolutely a breath of fresh air for workout plans. If you want to be surrounding with people who are real, funny, encouraging and kind, this is the best place for you! Joe will always  bring relentless positivity and constantly offer different ways to keep your body moving. No crazy diets, no fads, just simple and effective ways to keep moving without feeling bad about whatever place you are currently in. You will not regret any time spend at Boot Camp with friends and with Joe. It's a great investment in yourself and I'm so glad I made it!", "pics": null, "resp": {"time": 1608583762250, "text": "Thank you so much Hillary! When gingers combine forces amazing things happen :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "111338987302870744932", "name": "Kari Fox", "time": 1608328538636, "rating": 5.0, "text": "Huntsville Adventure Boot Camp is the best! It’s is well suited for any age woman of any fitness level. Joe offers many convenient times, he is great at keeping me motivated and he is loads of fun! I’ve been participating for a year and can definitely tell a difference in my muscle tone and energy level. I highly recommend it!", "pics": null, "resp": {"time": 1608504809609, "text": "Thank you so much Kari, I appreciate you!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "103159867857347548402", "name": "Elizabeth Riggle", "time": 1608416826357, "rating": 5.0, "text": "I came across information on Huntsville Adventure Boot Camp & Joe Martin at a time when I was frustrated and stressed with changes that Covid had created in my life.  I was eating my way through it & not exercising.  I decided to give the program a try.  Great decision!  Joe offers virtual workouts which is great.  He does them live, but also sends you a link, so you can do them at a time that is convenient for you.  You have no excuse not to do the workout.  He designs workouts for all fitness levels.  He demonstrates options for the exercises for beginners to those wanting a challenge.  In the past I would get bored exercising & end up quitting, especially at holiday time until this year.  I started in June & have stuck with it.  Joe is a wonderful coach who truly cares & wants to help you become a healthier & happier you.  He sends several emails a week filled with encouragement & motivation.  If you are struggling let him know & he will work with you.  He is always willing to answer questions about nutrition & exercise.", "pics": null, "resp": {"time": 1608504940358, "text": "What an awesome review Elizabeth, I am blown away! Thank you so much"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "100834179191700654381", "name": "Magen Sanders", "time": 1608722790044, "rating": 5.0, "text": "In the past have been guilty of never sticking with a program or workout. However, with Joe's boot camp I have stayed inspired! Everyday is a different workout that keeps my body from getting too fatigued and my mind alert. The ladies at the classes should also be noted as welcoming and great proof that this is an uplifting community of people who care about health and well being. Thanks Joe!", "pics": null, "resp": {"time": 1608763637774, "text": "Thank you so much Magen! And you nailed it. The ladies in the class are what separates us from other gyms. Stronger together, all are welcome!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "106972882613516874028", "name": "Annie Phillips", "time": 1608650639926, "rating": 5.0, "text": "I have been attending HABC for about a year and a half, and it is one of the best things I have ever done, both for my physical and my mental health. Joe Martin leads us through our exercise with warmth and fun and fellowship. If you can't do a certain exercise the traditional way, he offers alternatives for your needs. I have met so many wonderful women who I call friends, and Joe is a dear friend now too. Do something life-giving for yourself in 2021 and join us!", "pics": null, "resp": {"time": 1608765673327, "text": "The gift that keeps on giving! Like the Jelly of the Month Club :) Thank you so much for the kinds words Annie, it is definitely more than just an exercise class."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "108736200671603949934", "name": "Amy Slamp", "time": 1608403816924, "rating": 5.0, "text": "If you are woman looking for a great place to work out with other women and a fun and inspiring leader, this is the place for you.  Joe Martin makes  doing a workout at 5:30 am something you want to get up for.  I have developed some great friends I would not have gotten to know otherwise, and every day Joe shares a funny \"Dad\" joke so what better way to start your day.", "pics": null, "resp": {"time": 1608504864834, "text": "So grateful you are a part of the HABC Family Amy!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "105506833072240640935", "name": "Patti Blacklock", "time": 1608497660599, "rating": 5.0, "text": "Joe Martin's Huntsville Adventure Book Camp for Women is a great option for women of all fitness levels to get in shape physically and nutritionally. The boot camps are fun and challenging, and Joe, along with my fellow boot camps, offer encouragement and motivation that keeps me working toward my fitness and nutrition goals so that I am as healthy as I can be.", "pics": null, "resp": {"time": 1608546889704, "text": "Thank you, Patti it has been awesome having the opportunity to work with you for so long. Here's to many more years together!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "101655882714579051592", "name": "Donna Van Berkom", "time": 1608327335844, "rating": 5.0, "text": "Joe is an excellent trainer.  He gives various options depending on your workout level.  Exercises are geared towards total body workouts, balance and cardio.   Joe helps you set your goals and meet them.", "pics": null, "resp": {"time": 1608328083437, "text": "Thank you so much for being a part of the Adventure Boot Camp family DVB! I'm so glad I get to work with you again even if we can't meet face to face."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "115997027631458136060", "name": "Joy Wiseman", "time": 1608932552534, "rating": 5.0, "text": "Changing lives one burpee at a time! Seriously the most fun workouts I have ever done! Joe is motivating and the other ladies very supportive. You will not regret joining, even with squats and burpees... 5 more seconds and funny dad jokes!", "pics": null, "resp": {"time": 1608988575797, "text": "Thank you so much Joy! Burpees have been banned by the CDC, so we should be ok going forward :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "104057787777674368067", "name": "Chelsea Bell", "time": 1608671494278, "rating": 5.0, "text": "I’ve lost 50lbs in 7 months following Joe’s program! Huntsville Adventure Bootcamp provides me an effective program, tips/tricks for changing my bad habits and I actually look forward to working out every day.", "pics": null, "resp": {"time": 1608763676170, "text": "So proud you Chelsea! You have done amazing and you continue to get better. Keep up the great work!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "109574431604521674361", "name": "amy burnette", "time": 1581635531447, "rating": 5.0, "text": "I have been going to Huntsville Adventure Boot Camp, for over a year now and by far the best place to workout for women. The atmosphere is so welcoming, supportive, encouraging, motivating, and positive. The workouts are always different, so you never get bored and have something to look forward to each time. Your fitness level doesn't matter, Joe incorporates a way for all to benefit whether your just beginning your journey or needing a challenge. I drive over thirty minutes one way to attend and love every minute of Huntsville Adventure Boot Camp. HABC is not like other gyms, in that it gives you a sense of family. Highly recommend!", "pics": null, "resp": {"time": 1581703784794, "text": "Thank you so much Amy! I'm so proud of how far you've come since you started. You are a rock star!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "115422276682685017689", "name": "Kristine Maness", "time": 1581622109038, "rating": 5.0, "text": "It’s more than a great workout. It’s a great support system. I’ve met some of my closest friends here. Joe is the BEST cheerleader/trainer. He encourages and supports us in everything, both inside and outside of class. Can’t imagine not having HABC as part of my life.", "pics": null, "resp": {"time": 1581622403709, "text": "You just pretty much wrote out my mission statement for me! Thank you so much, I can't imagine HABC without you."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "107587039039447608905", "name": "Wendy Smythe", "time": 1581622854225, "rating": 5.0, "text": "HABC is a great place to workout and make life long friends.  Joe always has a positive and encouraging attitude and philosophy and gladly welcomes all who strive to get healthy and feel better.  Exercises and programs can be adapted to meet individual needs that provide results for everyone who participates.  I highly recommend it.", "pics": null, "resp": {"time": 1581623170087, "text": "Thank you so much Wendy, I really appreciate the kind words! All are welcome at the house of awesome :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "118374438964379111294", "name": "Gay Schill", "time": 1581635151911, "rating": 5.0, "text": "Joe got me moving again!   Great workouts understands limitations and works with you.  I could barely get up off the floor now i am getting stronger day by day and was able to get up today after only a week without so much pain.  So thankful I have found him!", "pics": null, "resp": {"time": 1581703814419, "text": "I'm so thankful you started too! Stronger every day :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "102173437723994350437", "name": "Claudinette Purifoy-Fears", "time": 1608647983012, "rating": 5.0, "text": "One of the best decisions I ever made. The workouts can be modified to accommodate fitness level. Love working out in the company of positive and uplifting women. Going on year 9!", "pics": null, "resp": {"time": 1582022431850, "text": "Thank you Claudinette! I really appreciate your loyalty and commitment after all these years. You are awesome!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "108549798659418755660", "name": "Laura Lynn Hardy", "time": 1581952673011, "rating": 5.0, "text": "Very welcoming atmosphere! Structured workouts that can be varied to your ability and strength level. Joe is a great coach and motivator. I've kicked things up for myself in a way that I would not do on my own at a gym.", "pics": null, "resp": {"time": 1582022156089, "text": "Thank you so much Laura Lynn! Keep up the great work."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "118411765909534547842", "name": "Jess R", "time": 1581643459839, "rating": 5.0, "text": "Just beginning but so far HABC has been great. Great workouts that aren’t daunting, no high pressure to be perfect or already in great shape, customizes each exercise to benefit ladies at all fitness levels, friendly environment. I can feel it working already. Highly recommend.", "pics": null, "resp": {"time": 1581703680491, "text": "Thank you so much Jess, so glad you started coming!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "112410832414597506964", "name": "Leigh Holeman", "time": 1608657871842, "rating": 5.0, "text": "Huntsville Adventure Boot Camp for Women is awesome! Joe is a good leader who really cares about you. The workouts are excellent, and are always new and different - you won't get bored here! Highly recommended.", "pics": null, "resp": {"time": 1581622899777, "text": "Thank you so much No E! So glad you are part of the HABC family."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "116035479853612184934", "name": "Tory Green", "time": 1581620535577, "rating": 5.0, "text": "Huntsville Adventure Boot Camp for Women has been a real game changer for me.  Joe is a patient and kind trainer who actually makes exercise fun.  I have made life-long friends in this class as well.  Sign up!  You won't regret it.", "pics": null, "resp": {"time": 1581622476790, "text": "Thank you so much Tory! Life-long friends and buffness. What more could you ask for? :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "112525496778973923404", "name": "Cairenn Martin", "time": 1581617333675, "rating": 5.0, "text": "Women of all ages can benefit from Adventure Boot Camp.  Joe makes exercising fun! He is also very knowledgeable about physical fitness so his sessions are well balanced for strength and cardio. I highly recommend Huntsville Adventure Boot Camp!", "pics": null, "resp": {"time": 1581622938340, "text": "Thank you so much! I hear the owner's mom is the BEST."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "110394343552721155179", "name": "Ashley Gray", "time": 1581618352005, "rating": 5.0, "text": "HABC is the only exercise program I have stuck with and actually look forward to going to! Joe is the best coach! He offers a variety workouts for all fitness levels, and believe it or not makes the workout FUN! If you enjoy hanging out with a group of women (and one man) who are getting up before the sun or showing up after a long day because they are motivated to just be better, HABC is where you belong!", "pics": null, "resp": {"time": 1581622691617, "text": "You guys make it fun for me! I take it as a huge honor that people take an hour out of their day to spend at HABC. And I hear people there wear the coolest shirts."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "106219269822609752128", "name": "Deborah Holt", "time": 1581916477772, "rating": 5.0, "text": "I absolutely love this exercise program. Joe Martin is an incredible person who truly enjoys helping others with exercise and making the healthier food choices; and his daily jokes are hysterical.", "pics": null, "resp": {"time": 1582022223881, "text": "I am blessed to be able to do what I do for a living. I love it! And thank you for recognizing the hilarity of the jokes, I work really hard on them :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "117819244124679308510", "name": "Laurali Hollister", "time": 1581636131119, "rating": 5.0, "text": "I am a big fan of Joe's bootcamp.  His knowledge keeps you exercising no matter what kind of issue you might have.  You control how strenuous you want to work out and there's lots of laughter, fun and encouragement from your fellow bootcampers.  When I can be consistent I'm in great physical shape.", "pics": null, "resp": {"time": 1581703736984, "text": "So glad to have you back Laurali! You're a big part of making that laughter happen. And not just because you talk to yourself :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "114949366038817817360", "name": "Ashley DeHaye", "time": 1581616640154, "rating": 5.0, "text": "Joe works hard to keep fitness accessible and make workouts not boring. He also genuinely cares about the people he works with and will always go the extra mile to make sure they are successful.", "pics": null, "resp": {"time": 1581623009235, "text": "Thank you Ashley! I really appreciate you being part of the HABC family."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "110845469467122317934", "name": "Wendy Hnetynka", "time": 1581639447651, "rating": 5.0, "text": "Coach Joe Martin is truly committed to the overall fitness and well-being of his boot campers. The atmosphere is always fun, friendly and encouraging. The workout routines are never repetitive. They are designed to encourage consistent participation by keeping you entertained and motivated. Great music, friendships and even a joke of the day!", "pics": null, "resp": {"time": 1556019011075, "text": "Thank you so much for the great review Wendy, you are awesome!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "117112367665913197656", "name": "Elena Aiello", "time": 1450742108915, "rating": 5.0, "text": "Fantastic program! I've been doing this for a year and it's changed my life for the better. It's changed my view on exercise/fitness - which should be fun, not something you dread. Huntsville Adventure Boot Camp is fun - I look forward to going every day. Joe Martin makes it different and challenging. No day is ever the same. He's the best -- and the ladies are wonderful. We all support each other and you do things at your level. If you feel like challenging yourself, go for it. Joe will give you different levels to try for each exercise. He's awesome and very supportive. You will be supported by everyone there.", "pics": null, "resp": {"time": 1581703922159, "text": "Thank you so much! You nailed a lot of the things I hold near and dear to my heart about boot camp. We are family!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "101118086551080305896", "name": "Susan Presley", "time": 1581617913870, "rating": 5.0, "text": "Joe is a great motivator and even starts each class off with a joke. He keeps the classes fun.", "pics": null, "resp": {"time": 1581622862749, "text": "Thank you so much Susan! And the joke is ALWAYS hilarious."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "110256752490703527595", "name": "Mary Ottman - Leadership Speaker & Certified Coach", "time": 1450711550932, "rating": 5.0, "text": "Joe is a fantastic trainer.  I couldn't do one ONE push-up when I started, and he never made me feel like I was \"behind\" the rest of the class.  He is always super supportive and has a wealth of knowledge and ways to modify exercises to your skill level.  Newbies train next to serious exercisers, and everybody feels like they are part of his tribe.  His wife and his mom both come to some of the classes too, and that makes it a cool family vibe.  He plays great music and he is always super positive.  In addition, he lets us know about local exercise events and we have the opportunity to be part of his team, helping the community, i.e. the Liz Hurley 5K.  Everyone is welcome to join in.  Another huge plus is that the ladies in the classes are SO friendly and supportive!! It truly is a tribe of supportive women (and Joe!) who want to be the best versions of themselves! I couldn't recommend this boot camp any higher! It is awesome!!! 💗💕💖💗💕💖", "pics": null, "resp": {"time": 1608583685903, "text": "Thank you so much Mary! It was your hard work that made it happen. Proud to call you my friend!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "110392662328924516416", "name": "Donna Baughn", "time": 1519224071531, "rating": 5.0, "text": "I didn’t know what to expect when I signed up for a month of boot camp. After not exercising for years I was not in any shape to flip tires or push a sled. But that wasn’t what it was like at all. Joe gives me modified versions of the exercise when I need it based on my fitness level. I never feel like I can’t do something but I am amazed daily at how much more I can do since starting boot camp. Best part is that exercise is now part of my daily life and I look forward to boot camp each and every day because each day is different.", "pics": null, "resp": {"time": 1519251792894, "text": "Thank you so much for the great review Donna! I can't imagine having class without you now, you rock star you."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "115966677333752916422", "name": "Marie Ferguson", "time": 1482870205780, "rating": 5.0, "text": "Don't let the words \"Boot Camp\" scare you.  It's fun, challenging, inspiring and just an all around good time.  You will meet an amazing group of women who will do anything to keep you and each other motivated.  They make me laugh every day.  Joe scales the work outs for every level of fitness.  When I first started I couldn't imagine how everyone was doing the exercises and carrying on a conversation, now I'm cutting up as much as anyone.  Probably the most fun you can legally have at 5:30 in the morning.  Give a try, you might just love it!!", "pics": null, "resp": {"time": 1482871441369, "text": "You are a big part of why it is fun and inspirational Marie, so glad you are a part of the boot camp family!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "118136381888216617826", "name": "Erina at Work", "time": 1518799009707, "rating": 5.0, "text": "You will not find a nicer, more dedicated fitness coach than Joe Martin and these boot camp sessions are not only very effective but they are a lot of fun. Joe is truly committed to helping women meet their health and fitness goals but he understands it's important to do it with humor and humility.", "pics": null, "resp": {"time": 1518799855301, "text": "Thank you so much for the great review Erina! It is always fun to work with you."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "109067448334565910535", "name": "Heather Thacker", "time": 1518877716474, "rating": 5.0, "text": "If you want to get stronger, leaner, feel better AND laugh your head off, this boot camp is for you.  Joe Martin is the leader of this crew and is the best in his field.  All ages and sizes were in my classes and everyone loved it!", "pics": null, "resp": {"time": 1519251826281, "text": "Thank you Heather, that is very kind of you!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "100219583641262555463", "name": "Jessica Burton", "time": 1533951127901, "rating": 5.0, "text": "Joe is amazing! He genuinely cares about everyone! His workouts are always different and creative. His jokes are great too!! I definitely would recommend Huntsville Adventure Boot Camp.", "pics": null, "resp": {"time": 1534196306052, "text": "Thank you so much Jessica, so glad you are a part of the HABC family!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "113415849110256525394", "name": "Crystal Hanson", "time": 1518800150655, "rating": 5.0, "text": "I began hoping to complete a month. 18 months later I'm still at it! I've been encouraged, cheered for, welcomed at whatever fitness level I am at. If I'm absent, I'm missed. I've never had more fun getting healthy! I love this program! And Joe is one of a kind!", "pics": null, "resp": {"time": 1518800940671, "text": "Thank you so much Crystal! It has been awesome seeing you continue to improve, actually enjoy exercise, and learn more about music from you :) Keep up the great work!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "101943334699130645277", "name": "Kimberly Widner", "time": 1518804731307, "rating": 5.0, "text": "Best health decision I have ever made! Joe has created an environment that is welcoming, supportive and challenging. I have never enjoyed exercising but Joe makes it fun!", "pics": null, "resp": {"time": 1518818079240, "text": "I'm so thankful for your review Kim! That is my goal in life, to get people enjoying exercise. Thank you for being a part of the HABC family!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "100216875251771606871", "name": "Becky Phillips", "time": 1450710566476, "rating": 5.0, "text": "Best decision Ive made regarding my health! Its a go at your own pace class in a group setting.  Everyone is so encouraging and fun to be around.  Joe Martin is a great instructor, always switching things up and keeps it fresh and always good for a laugh.  Thank you Huntsville Adventure Boot Camp!", "pics": null, "resp": {"time": 1608583715173, "text": "Thank you so much Becky! You have done and continue to do amazing. Grateful to have you as a client!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "118189366750907034564", "name": "Joanne Long", "time": 1482888489309, "rating": 5.0, "text": "Fun, fabulous and uplifting. Getting healthy and making friends at the same time, completely non threatening since it's all women of different ages shapes and sizes, except Joe of course, but he came to the dark side a long time ago and can easily manage to not lose his cool when talking about sweaty female parts!", "pics": null, "resp": {"time": 1482930433833, "text": "Thanks for the great review Joanne! I think..."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "109621393902219197937", "name": "Patty Sykstus", "time": 1581647673102, "rating": 5.0, "text": "Joe is the best!  Very motivating and supportive!", "pics": null, "resp": {"time": 1581703654320, "text": "Thank you so much Patty, you are awesome!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "107480874555347610553", "name": "Functional Chiropractic", "time": 1475529207932, "rating": 5.0, "text": "If you are looking for a great fitness option, then Joe Martin and his team at Adventure Bootcamp is the right place to go.  I have been involved in several of his workouts and know that they are not only effective and fun, but also easy to jump into at every level.  Highly recommend you check out his website or call Joe Martin to get signed up.", "pics": null, "resp": {"time": 1475541000003, "text": "Thank you Dr. Porter, really appreciate the kind words!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "116485941853672606606", "name": "Leigh Anne McMahon", "time": 1450750573203, "rating": 5.0, "text": "HABC offers up an inclusive and safe environment for women on all fitness levels and ages to get up, get moving, get stronger, get results.  Joe's program has made all the difference for me, helping me get leaner and making me a much stronger runner.  He is relentlessly positive and does an excellent job of keeping things fresh and interesting.  You won't meet a better group of women to exercise with and get support from either.  Five stars, without a doubt!", "pics": null, "resp": {"time": 1581623046148, "text": "Thank you so much LA! You're the bee's knees :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "104910356727298346397", "name": "Marie Held", "time": 1581623914254, "rating": 5.0, "text": "Wonderful way to get your daily exercise in.", "pics": null, "resp": {"time": 1581703835954, "text": "Thank you Marie, so glad you are a part of that daily exercise!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "107278880614836259751", "name": "Erina Galloway", "time": 1482869115886, "rating": 5.0, "text": "If you don't like going to the gym (me) and really enjoy being outside (me) this is the boot camp for you. It's fun without losing the challenge of getting in shape. You are driven and pushed but through laughter and motivation, not just from the fearless leader (Joe) but the many amazing people you will encounter.  Do yourself a favor and try it out, you won't regret it!", "pics": null, "resp": {"time": 1482870819423, "text": "Thank you so much for the great review Erina, you are awesome!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "110106373269422474436", "name": "Brianne Oleson", "time": 1581616557671, "rating": 5.0, "text": "Fun and great place to get your workout on!!", "pics": null, "resp": {"time": 1581622314929, "text": "Thank you so much Brianne, so glad you are a part of the boot camp fam!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "105448901571829720051", "name": "Nancy Smith", "time": 1534188765100, "rating": 5.0, "text": "Want to change your way of working out? Come to HABC with Joe Martin! It is a fun and effective workout - just show up, do what Joe says (if you can hear him over the gossip and giggling - LOL) and give it all you got. Wonderful group of ladies and Joe's got jokes!", "pics": null, "resp": {"time": 1534196241760, "text": "The jokes are so hilarious! I can't stress enough how hilarious they are. Thank you so much Nancy, you are a rock star."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "113746974149260798264", "name": "Monica Sanford", "time": 1482874096169, "rating": 5.0, "text": "Joe is amazing!  His classes are fun but you still get a great workout.  If you're sitting in the fence and wonder if you should try HABC...wonder no more.  Just do it!", "pics": null, "resp": {"time": 1482930478126, "text": "Thank you for the 5 start review Monica! And that is great advice for getting started with HABC."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "103137294683006652356", "name": "Vickie Blacklock", "time": 1581623107379, "rating": 5.0, "text": "Get to exercise with old friends and new. Diverse and challenging workouts that are different everyday. Great for mind, body and soul! Thanks Joe!", "pics": null, "resp": {"time": 1482930616408, "text": "Thank you for the 5 star review Vickie!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "103318451183441446788", "name": "Aquita Wherry", "time": 1482869984458, "rating": 5.0, "text": "Great motivator! Work outs are fun whether indoors or out.  Great knowledge and great fun", "pics": null, "resp": {"time": 1482871578489, "text": "Thank you for the great review Aquita!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "105320447905685908498", "name": "Kellie Andrews", "time": 1483027477050, "rating": 5.0, "text": "Joe Martin creates a challenging workout experience with fun and encouragement and new friends. If anything is holding you back from getting healthy, you should give Boot Camp a try. It's a party with friends where you get fit!", "pics": null, "resp": {"time": 1483311097834, "text": "Thank you for the great review Kellie! I really like your description of our classes  too :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "115224027424516184371", "name": "Jade Gann", "time": 1608649821805, "rating": 5.0, "text": "Joe is awesome!!!", "pics": null, "resp": {"time": 1608765718366, "text": "Thank you Jade! Takes awesome to know awesome."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "109078097887907375452", "name": "Sherri Stroud", "time": 1482870081621, "rating": 5.0, "text": "Joining an exercise program can be daunting, joining a \"Boot Camp\" is terrifying...until you find Huntsville Adventure Boot Camp!  Joe Martin is more than a boot camp instructor, he is a personal trainer, nutritionist and a friend to all his clients. He offers a program that suits all fitness levels and all age ranges and somehow manages to be crazy fun!", "pics": null, "resp": {"time": 1482871538955, "text": "Thank you so much Sherri! Exercise doesn't have to be misersable to be effective. Looking forward to more awesome with you in the future!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "114840760876074401818", "name": "Eula Pugh", "time": 1518827949267, "rating": 5.0, "text": "Huntsville Adventure Boot Camp is a great place to get into shape, loose weight and be around encouraging women while you are on your healthy lifestyle journey.", "pics": null, "resp": {"time": 1519251870561, "text": "So proud of how far you have come Eula, you are doing awesome!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "100701538333191032494", "name": "Vicky Mathis", "time": 1450712359362, "rating": 5.0, "text": "Fun and exciting workout that doesn't feel like work at all - until you feel the burn later!!", "pics": null, "resp": {"time": 1608583645387, "text": "Thank you so much for the kind review Vicky!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "103953198854840817912", "name": "Rena Strange", "time": 1450756976533, "rating": 5.0, "text": "Awesome Boot Camp!  Great atmosphere, professional support, fun way to get in shape.", "pics": null, "resp": {"time": 1482930590940, "text": "Thank you so much for the great review Rena!"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "107949656265976062453", "name": "Marcie Lewis", "time": 1581623036387, "rating": 5.0, "text": "I have been doing boot camp for 10 years and I cannot say enough about how much I love it!", "pics": null, "resp": {"time": 1581703869392, "text": "Boot Camp OG! So glad you are still coming after all these years :)"}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "104345889088618500781", "name": "Amanda Pope", "time": 1533956085146, "rating": 5.0, "text": "Such a great way to workout - it is FUN, not work!", "pics": null, "resp": {"time": 1534196280645, "text": "Thank you so much Amanda! Exercise doesn't have to be miserable, so glad you enjoyed the workouts."}, "gmap_id": "0x88621284eba05a13:0x19e1984cf19d793a"}
{"user_id": "115238326989327566811", "name": "Tip T", "time": 1604705781372, "rating": 5.0, "text": "Desiree is the best trainer in Montgomery! She is an expert in nutrition and the science of exercise. The gym is immaculate and they are very professional. Be prepared for a great workout.", "pics": null, "resp": {"time": 1609269031827, "text": "Thank you so much"}, "gmap_id": "0x888c2b142fde61d7:0x85d28c0112d4e207"}
{"user_id": "107837782174965044520", "name": "Chord O'Roy", "time": 1593088337128, "rating": 5.0, "text": "First time working out via video conferencing but I have benefited more than I would at Planet Fitness...thank you Jamie and Desiree for your hard work putting this together", "pics": null, "resp": {"time": 1593107413334, "text": "Thanks for the shout out! We appreciate the support. Your consistency and dedication makes it all worth it! Keep working towards your goal 💪"}, "gmap_id": "0x888c2b142fde61d7:0x85d28c0112d4e207"}
