{"user_id": "105197387679927113060", "name": "Ronna Larson", "time": 1630546090867, "rating": 5.0, "text": "Jordan Streim arrived to our home with such a polite attitude and asked if he may bring in his trainee     (Nikki) with him, which we had no problem with at all. Honestly, we had not planned to make any type of purchase, just thought we were having our water tested. The difference that we saw in the water when tested by Jordan, was tremendous! This team really believes in what they do. We are very happy with the education and our decision to “change our water and change our lives.” Thank you so much for taking the time with us.", "pics": null, "resp": {"time": 1630606698002, "text": "Ronna you will enjoy your water from now on. Thanks for sharing."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107021302125953704719", "name": "Labryth Robbins", "time": 1623095169181, "rating": 5.0, "text": "I just wanted to say that Lewis, our sells man, was just 100% amazing!!! I can’t say enough about him. Then our technician, Doug, has gone above and beyond everything he has done. He’s incredibly sweet, helpful and very knowledgeable. He felt like I could truly trust everything he said and we all know nowadays, that’s hard to find! I hope his supervisor knows what a hard worker he has working for him! He’s just wonderful and I appreciate him a lot!", "pics": null, "resp": {"time": 1623160811856, "text": "Thank you labryth for sharing your experience. We do recognize the hard work of lewis . We have a great team of employees who work hard and care about our customers."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108809740355931065650", "name": "leila vaughn", "time": 1625334779811, "rating": 5.0, "text": "We had such a wonderful experience with Rainsoft recently. Everyone was so kind a knowledgeable! Dan (Dan the water man) came to our home and spent time with us. He went above and beyond explaining the benefits of having an in-home system to my family. One word- Amazing! I feel so much smarter about everything water related after Dan showed us his wonderful experiments. And then the next day we had Richard Burgess and one other gentleman come and install the unit. They were so gracious and efficient! I simply can not of asked for a better experience! Thank you so much for improving my families lives!", "pics": null, "resp": {"time": 1625430856525, "text": "Thank you Leila for the wonderful review. Dan ,richard & Zach will be very pleased."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108243761921913210556", "name": "Michelle Tillman", "time": 1627429825135, "rating": 5.0, "text": "Jordan was very friendly and great at teaching us about how the water softening system works. He was able to set us up with next day install and a time frame that works with our schedule. I would recommend rain soft to anyone looking to improve the water in their home.", "pics": null, "resp": {"time": 1627529863798, "text": "Thank you Michelle for taking the time to review us"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102096109319553701781", "name": "Zachary Cates", "time": 1629566059300, "rating": 5.0, "text": "Jordan came out to our new home and showed us exactly how nasty our water was looking. He practiced excellent professionalism and left us with no questions. Afterwards we had no choice but to get a system installed. We genuinely had a good time and are excited to get our new water system installed!", "pics": null, "resp": {"time": 1629676984122, "text": "Zachary your feedback makes all of us here want to work hard everyday. Jordan is a pleasure to work with ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100267954752044942218", "name": "Lisa Silver", "time": 1621981547738, "rating": 5.0, "text": "I contacted Randy Williams about a water system for my home. He came out and tested my water and I found I definitely wanted the system!  He was able to make the install appointment a few days later.  The guys showed up on time and installed the system with no problems.  I love the water for my skin and hair not to mention no more replacement filters for the fridge.  The price is also a lot more affordable than I had anticipated.  I would recommend Randy and this company to anyone!", "pics": null, "resp": {"time": 1621982269911, "text": "Thank you lisa for sharing your experience. We do appreciate it"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "105795534832895163144", "name": "Chris Davis", "time": 1630450935802, "rating": 5.0, "text": "Very knowledgeable and friendly. I will recommend Marquis to others.", "pics": null, "resp": null, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106417854156690931253", "name": "R Freese", "time": 1619723506660, "rating": 5.0, "text": "Randy and Doug are an amazing team. We recently moved to the area, and knew right away that we had to do something to improve the water in our home. Going with RainSoft of Huntsville was an easy decision to make once Randy explained the products/services offered. Doug was here same day to install. Both are readily available and responsive to any questions we have. You cannot beat their personalized approach to customer service.", "pics": null, "resp": {"time": 1619797309469, "text": "thank you for sharing your experience. we really do appreciate it.your satisfaction is very important to us."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107974416319702813658", "name": "Gregory Wheeler", "time": 1624552081805, "rating": 5.0, "text": "Lewis and the team at RainSoft are great. They came to test my water and the next day the system was installed. Since then I have crystal clear water and no longer need a bottle water service. Defiantly will recommend them to everyone I know!", "pics": null, "resp": {"time": 1624628009806, "text": "Thank you Gregory for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109997461771741680550", "name": "Andy Murray", "time": 1627923644836, "rating": 5.0, "text": "Recently had a in home presentation and Doug Petty was incredible.   He was very thorough, patient, and informative.   If you want your water tested this is the guy to do it.", "pics": null, "resp": {"time": 1627989067890, "text": "Thank you andy for sharing your experience. Doug petty is a great employee who cares about people . He will be delighted with your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "105294933803357245961", "name": "Dean Shroka", "time": 1628901707926, "rating": 5.0, "text": "Marquis is a great person to have sell rainsoft as a company. He’s fun and energetic. Over all a great experience.", "pics": null, "resp": {"time": 1628949185830, "text": "Dean,we appreciate the feedback. Go marquis! We think he’s awesome too."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116344409298523232512", "name": "Victor Williams", "time": 1620173949621, "rating": 5.0, "text": "Jordan was excellent. He was professional, informative, funny, and thorough. The presentation was eye-opening. I enjoyed Jordan and appreciated his passion about providing good clean healthy water. I’m glad we accepted the appointment and look forward to enjoying the services.\n\nVictor & Joyce Williams", "pics": null, "resp": {"time": 1620232524639, "text": "Thank you victor & joyce for sharing your experience. We do appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "114972884223575518225", "name": "Amanda Carlisle", "time": 1620169380494, "rating": 5.0, "text": "We love our RainSoft system and their customer service is exceptional.  Mike Jenkins was our service technician this year for our annual service on our system.  He did a great job and was very professional.   We have had our system for about 5 years and we have never had any issues.   Always excellent service.  Wendy is always friendly and helpful as well!", "pics": null, "resp": {"time": 1620173181927, "text": "Thank you Amanda for sharing your experience. We truly appreciate it"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100973698372826322162", "name": "John Wyatt", "time": 1623686737717, "rating": 5.0, "text": "Recently purchased a RainSoft system consisting of an ECS5, a QRS and an ultrafiner II. The quality of my water that was very hard was almost instantly improved and I can now drink the water from the city. We had the system installed by veteran installer Douglas Kennedy and we couldn't be happier. Douglas installed the system in the garage and had to run pipe to the opposite end of the house under the crawl space. kudos to Douglas", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP20_U909_Tog8JUS73eSqvUUKlNlhwWSOPqrfD=w150-h150-k-no-p"]}], "resp": {"time": 1623690335420, "text": "Thank you John for your review. We do appreciate it"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102071712858847655675", "name": "Richard Winsett", "time": 1623423092666, "rating": 5.0, "text": "Rain Soft is one of the best decisions I have ever made for myself and my family.  The gentleman that came to my home and meet with my family (Lewis) was very professional and had an answer for every question we asked. We are already see the benefits from the new system installed in our home and you have to ask yourself the same question my family did. Are you ready to start living a healthier life?  With what we have at our home we will actually be saving money by have the filter in our home and raising our homes property value. So if you want to see for yourself just contact Lewis at Rain Soft and tell him Richard sent you. Thanks again Lewis", "pics": null, "resp": {"time": 1623512172497, "text": "Thank you richard for taking the time to share your experience! We don’t take your opinion lightly. Enjoy your water."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115107393722762106337", "name": "seth sully", "time": 1627315495787, "rating": 5.0, "text": "I worked for rainsoft for just about a year and it was an amazing experience. Their passion for their customers is beyond excellent. Their commitment to providing the highest quality equipment and service is tremendous. It made me feel like It wasn’t even work, by helping people everyday with providing information about the state of their water and helping them change their lives for the better. Rainsoft is not just a company, they are a family, and they treat everyone from their employees to their customers just like it. I truly believe in this company’s heart for people and water treatment, not only that but for the people both inside and out. Thank you for helping me change lives and for changing mine all for the better.", "pics": null, "resp": {"time": 1627316548543, "text": "Thank you Seth for the kind review. You were a tremendous employee for us . You shared that passion with your co workers and customers. God bless you and your family. We wish you all the best."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112597474062858049892", "name": "Jay Hipp", "time": 1625278993827, "rating": 5.0, "text": "The presentation was well done and packed with great information. The demonstrations were really interesting, I was aware of most of the chemicals in my water, but being able to see it right in my own kitchen made the decision to upgrade my water that much easier.", "pics": null, "resp": {"time": 1625430952191, "text": "Thank you jay for sharing your experience. I know this will be helpful to other who are considering water treatment in their home."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "114432698178227001491", "name": "Zach Ferris", "time": 1625171534262, "rating": 5.0, "text": "Richard Burgess and the Rainsoft team did a great job installing our system in under an hour without leaving a trace! Our water was instantly better! I highly recommend this company!", "pics": null, "resp": {"time": 1625237501731, "text": "Thank you Zach for sharing. We value your opinion."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111513134308012115189", "name": "William Ammons", "time": 1623084336313, "rating": 5.0, "text": "I have to admit, I can't understand why we went so long without a water treatment system for our many homes in the past...but Randy showed us why it was so important to have one.  We had same day installation by the most professional and outstanding person we've ever came across...thank you Doug for installation and the conversation.  This team at RainSoft of Huntsville can't be beat!!!", "pics": null, "resp": {"time": 1623088517699, "text": "Thank you william for sharing your experience. We value your opinion."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112816482091452859536", "name": "Tabitha Haswell", "time": 1628964115980, "rating": 5.0, "text": "Jordan was amazing, and the whole presentation was mind blowing! I can't wait for our install!", "pics": null, "resp": {"time": 1629037079294, "text": "Tabitha your gonna live your water! Thanks for sharing."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "105829807466991207497", "name": "Blaire Honey", "time": 1615996302335, "rating": 5.0, "text": "We had Jordan come see us today and he was wonderful!  We honestly didn't expect anything to come from it. We were adamant we weren't going to buy into anything, but the results were amazing. We definitely came out believing! He did a fantastic job, we definitely recommend! 😊❤", "pics": null, "resp": {"time": 1615995278229, "text": "thank you blaire for sharing your experience with jordan. we appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108869274038983104397", "name": "Dustin Boggs", "time": 1611242156412, "rating": 5.0, "text": "Randy (owner) was more than helpful explaining everything in detail and gave us a great deal on the complete package. Doug (installer) gave us A+ service while installing and showing us in depth how everything worked. Our water now not only tastes better, but literally feels like silk.  The cleaning products from pure selects work amazing as well. We were on the fence about getting a whole home filter/softener for years and can’t believe we didn’t do this sooner. A huge thank you to the Huntsville RainSoft team!!!!!", "pics": null, "resp": {"time": 1611242927208, "text": "Thank you Dustin for the wonderful review. This makes our company proud knowing your happy."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103990381229757366216", "name": "Cindy Storm-Jessett", "time": 1623284940753, "rating": 5.0, "text": "Jordan is VERY informative about the benefits of truly clean water, and what happens when we DON'T have clean water. He's fun, knowledgeable, and respectful. Thank you, Jordan, you are the H2O Rockstar!", "pics": null, "resp": {"time": 1623343870971, "text": "Thank you Cindy for sharing your experience. We do appreciate it . Jordan is a hoot!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104547853636102293238", "name": "John Hoenge", "time": 1625505065654, "rating": 5.0, "text": "Prue Water 💦 from the owner Randy to the technician Richard they where professional, knowledgeable, courteous, from start to finish Randy was Great to deal with he explained the best system for my house which had a real problem with my water 💦 his experience guided us to alleviate our problem and they installed the best purification system for my house 🏘️ I highly recommend Randy and his company to take care of all your water purification needs. #1", "pics": null, "resp": {"time": 1625568928038, "text": "Thank you John for sharing your experience. We value your opinion."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102652097026983725880", "name": "Shawn Eggerling", "time": 1620952581024, "rating": 5.0, "text": "Jordon was extremely knowledgeable and helpful in explaining the problems we have, and how to fix it. I never felt pressured or obligated to spend any money. Just fax and information for us to make a sound decision on our purchase.", "pics": null, "resp": {"time": 1620997851818, "text": "thank you shawn for sharing your experience with jordan. we appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "101080300119715770790", "name": "Steve Holpp", "time": 1615391154421, "rating": 5.0, "text": "Randy and his team are true professionals. We live in a high mineral and chlorine area in a new four month old house and already see scaling. They were very clear and on point with the soft water vs hard water solutions. I highly recommend a RainSoft whole house system. Thank you gentleman.", "pics": null, "resp": {"time": 1615403402192, "text": "thank you steve for sharing your experience.thank you for the recommendation."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108675740255283571085", "name": "Sarah Doan", "time": 1628643503256, "rating": 5.0, "text": "Jordan was great! Very informative and easy to talk with.", "pics": null, "resp": {"time": 1628646133204, "text": "Thank you for your review ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111461515796658293611", "name": "Angie Paule", "time": 1613332508127, "rating": 5.0, "text": "This company is top-notch!  Doug, our sales rep gave an interesting detailed presentation and Clayton, our installer did an incredible job putting the system in.   The system itself is fantastic!  I don't know why we waited so long to get one.  My hair is softer, my clothes are cleaner and my drinking water is crystal clear.  You won't go wrong with this product or company.  Great customer service.", "pics": null, "resp": {"time": 1613405171760, "text": "thank you angie for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111610269754220739888", "name": "Lindsay Leatherman", "time": 1616424009630, "rating": 5.0, "text": "Absolutely the most professional and superb experience with Randy and his team of experts! Thank you for going above and beyond the call of duty and finding solutions to all of our water needs.  We are greatly appreciative!", "pics": null, "resp": {"time": 1616425118491, "text": "Thank you Lindsay for sharing your experience. We are grateful"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117555232018422460667", "name": "ceptie Sinous", "time": 1614270154770, "rating": 5.0, "text": "We just bought our first home and getting this product us the best decision we could have made. Jordan was our sales representative and he was fantastic. He was very professional kind and respectful more people should be like him. If you haven't tried this yet give them a call you will not regret it.", "pics": null, "resp": {"time": 1614348256472, "text": "What a nice review. Thank you"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103051085788038816953", "name": "Cameron Kramer", "time": 1620669438875, "rating": 5.0, "text": "Very professional. We are really happy with the entire process. I would highly recommend the company, product and the process to anyone who cared to ask.", "pics": null, "resp": {"time": 1620742544454, "text": "thank you cameron for sharing your experience. we do appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "101166583327376714039", "name": "Amber Lashae", "time": 1621035822121, "rating": 5.0, "text": "Lewis has been awesome!! He was right on time upbeat, knowledgeable, not pushy at all.I had a small issue on my end after the install and he called me back within 1 minute. He went above and beyond to make sure I was taken care of and even checked back in afterwards to make sure everything was ok. Also Doug did my install he was very polite and fast. These guys have done a great job.", "pics": null, "resp": {"time": 1621128996590, "text": "Thank you amber for your kind review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117535616831698153513", "name": "Shontice Fields", "time": 1618350518342, "rating": 5.0, "text": "I just got my rain soft filter system installed and I absolutely love it. Instantly I could tell the difference and so can my kids. I would highly recommend rain soft to anyone.", "pics": null, "resp": {"time": 1618409238395, "text": "Thank you shontice for sharing. We do appreciate it"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109493650767041743173", "name": "Chivon Keller", "time": 1613608750064, "rating": 5.0, "text": "Jordan came into our house for the test and to explain the difference between what is currently going on with our water and what can be happening. He was very thorough on every aspect of our lives that our water effects. Jordan was a hoot to have in our home and very enthusiastic about his work which makes the experience that much better. All around great at his job!", "pics": null, "resp": {"time": 1613609821478, "text": "That’s awesome! Thank you chivon for the review and 5 star rating. We’re all grateful"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103300239825763958041", "name": "Abbey Whipple", "time": 1613245382656, "rating": 5.0, "text": "Marquis was extremely helpful in teach us the quality of our tap and bottled water. He was able to go into detail and answer whatever questions we had. He was also able to break things down onto a personal level of how their product would help us in the long run. He did an amazing job!!", "pics": null, "resp": {"time": 1613276229462, "text": "Thank you abbey for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113389905325371556935", "name": "Ray Hyde", "time": 1628643513284, "rating": 5.0, "text": "Jordan is very professional and entertaining! The water tests really showed us what kind of stuff we are putting into our bodies!", "pics": null, "resp": {"time": 1628718251319, "text": "Awesome! Glad you enjoyed the test. We appreciate the feed back"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111041502026799610382", "name": "Thomas Crawford", "time": 1613782439285, "rating": 5.0, "text": "Jordan came by to teach us about the quality of our water system after we filled out a coupon for Target that involved having a full water quality inspection through rainsoft.\n\nBy the time Jordan was halfway through his presentation we had already forgotten this journey started because of a target promotion! We couldn't believe how horrible our water quality was in a brand new home and with a brand new water filter we had literally just installed in our fridge. Having Jordan demonstrate the effects our poor water quality had on literally everything in our home and lives was eye opening!\n\nLooking forward to the many benefits to our new water system!", "pics": null, "resp": {"time": 1613783274122, "text": "Thank you Thomas for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100973330927637702805", "name": "Darrell Stroy", "time": 1626135375341, "rating": 5.0, "text": "Jordan was very professional in his presentation of the product.  He also was very courteous.", "pics": null, "resp": {"time": 1626145744051, "text": "Thank you Darrell for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113340400889753888711", "name": "Aaron Mitchell", "time": 1624648031084, "rating": 5.0, "text": "I haven’t had an experience like this in a long time. It is almost unheard of to get anything done “next day”. On top of these guys coming out right away, they were extremely courteous and professional. If more businesses operated like this the world would be a better place. Great product and great customer service.", "pics": null, "resp": {"time": 1624715075622, "text": "Thank you Aaron for your review. We agree with you whole heartedly.I am very proud of our team."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111587500061460867845", "name": "Bob Frankart", "time": 1613796780607, "rating": 5.0, "text": "RainSoft was able to install my water softener on short notice. The installation itself was  completed in a very professional manner. I am quite pleased and recommend them.", "pics": null, "resp": {"time": 1613919515239, "text": "Thank you bob for sharing your experience and your recommendation."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117445375624192194544", "name": "Jennifer Hood", "time": 1616117655065, "rating": 5.0, "text": "Mr. Martin Clayton was nice and friendly. We enjoy the  presentation that Mr. Clayton done. We love the way he show us what was in our water. We thank y’all for showing us what the difference in our water and what y’all Rainsoft  system.", "pics": null, "resp": {"time": 1616182912979, "text": "Thank you Jennifer for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107974541355428387603", "name": "shashin patel", "time": 1611693068149, "rating": 5.0, "text": "we just got RAINSOFT system installed at our home recently and we love the system. Lewis was a great help for us. He understood what we were looking for. We wanted to get the system in 2020 but finally were able to get it in 2021. Lewis made it happen even after 6 month gap. service from the company is also really great, the system was installed same day! One wont see the results right away but its a long term thing for your health and precious hair too.", "pics": null, "resp": {"time": 1611751720276, "text": "Thank you shashin for your review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102652097026983725880", "name": "Shawn Eggerling", "time": 1620952581024, "rating": 5.0, "text": "Jordon was extremely knowledgeable and helpful in explaining the problems we have, and how to fix it. I never felt pressured or obligated to spend any money. Just fax and information for us to make a sound decision on our purchase.", "pics": null, "resp": {"time": 1620997851818, "text": "thank you shawn for sharing your experience with jordan. we appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113166726987203723069", "name": "Dwayne Johnson", "time": 1615232324271, "rating": 2.0, "text": "Rainsoft seems to be a good product. But the financing company they use, Aquafinance, is a bad company. They don't do credit checks so everyone gets the same financing rate even if you would qualify for a lower one. They also open a REVOLVING credit line for their $7000 equipment. So it's going to look like you have a credit card MAXED out for years if you go by their payment plan.\nI got it 2 weeks ago and my score went down 40 points.\nSo if you dont care about your credit score, then just sign up blindly, like I did.\nIf you cant afford $7k water in cash, then you shouldn't be drinking it.\nThe salesman seemed to forget about this.", "pics": null, "resp": {"time": 1615386669766, "text": "Sorry for your experience Dwayne. We try to use finance companies that give the customer the most flexibility. The system is designed to save you more money than it cost thru the years of ownership."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113389905325371556935", "name": "Ray Hyde", "time": 1628643513284, "rating": 5.0, "text": "Jordan is very professional and entertaining! The water tests really showed us what kind of stuff we are putting into our bodies!", "pics": null, "resp": {"time": 1628718251319, "text": "Awesome! Glad you enjoyed the test. We appreciate the feed back"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117535616831698153513", "name": "Shontice Fields", "time": 1618350518342, "rating": 5.0, "text": "I just got my rain soft filter system installed and I absolutely love it. Instantly I could tell the difference and so can my kids. I would highly recommend rain soft to anyone.", "pics": null, "resp": {"time": 1618409238395, "text": "Thank you shontice for sharing. We do appreciate it"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104165008280910211840", "name": "Tana Mcdonald", "time": 1611620397928, "rating": 5.0, "text": "We are really loving our rainsoft system , we had hard water and after just a month of having our new system I don’t think I could ever live again without it!\nLewis, was our sales representative and he is super knowledgeable, was able to answer all of our questions , and has kept in contact with us since the system was installed to see if we are pleased with it, as well as to see if we had any questions.\nIf you’re on the fence with possibly purchasing this system, I say go for it. You won’t regret it and it comes with a lifetime warranty . You can’t beat that !", "pics": null, "resp": {"time": 1611629453062, "text": "Thank you tana for taking the time to share your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104141777597208104411", "name": "Genocyde 2600", "time": 1605711219478, "rating": 5.0, "text": "Jordan was great with his pitch.  He broke it down so the slowest of the slow could understand why having a water filtration system is beneficial for anyone.  I would HIGHLY recommend Rain Soft to anyone curious about filtration or about what’s in their tap water.  My family is very satisfied with the products we purchased and excited that the water tastes great!  Better than bottled water at the tap!", "pics": null, "resp": {"time": 1605733712421, "text": "thank you for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117445375624192194544", "name": "Jennifer Hood", "time": 1616117655065, "rating": 5.0, "text": "Mr. Martin Clayton was nice and friendly. We enjoy the  presentation that Mr. Clayton done. We love the way he show us what was in our water. We thank y’all for showing us what the difference in our water and what y’all Rainsoft  system.", "pics": null, "resp": {"time": 1616182912979, "text": "Thank you Jennifer for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111587500061460867845", "name": "Bob Frankart", "time": 1613796780607, "rating": 5.0, "text": "RainSoft was able to install my water softener on short notice. The installation itself was  completed in a very professional manner. I am quite pleased and recommend them.", "pics": null, "resp": {"time": 1613919515239, "text": "Thank you bob for sharing your experience and your recommendation."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104141777597208104411", "name": "Genocyde 2600", "time": 1605711219478, "rating": 5.0, "text": "Jordan was great with his pitch.  He broke it down so the slowest of the slow could understand why having a water filtration system is beneficial for anyone.  I would HIGHLY recommend Rain Soft to anyone curious about filtration or about what’s in their tap water.  My family is very satisfied with the products we purchased and excited that the water tastes great!  Better than bottled water at the tap!", "pics": null, "resp": {"time": 1605733712421, "text": "thank you for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107876170743204663183", "name": "Kim Marson", "time": 1602819887934, "rating": 5.0, "text": "We just recently got our new RainSoft system and we love it already. We had such hard local water but now my body and hair feel better, dishes are cleaner and our water definitely tastes better.\nThe sales rep that came out was very personable and not at all pushy. The installers were very knowledgeable and considerate as were the people we’ve talked to on the phone through the whole process. If we had any questions they were quick to respond and very helpful.\nTop notch customer service and we love the water!", "pics": null, "resp": {"time": 1602851477914, "text": "Thank you Kim for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107724428089572612569", "name": "cathy davis warren", "time": 1621105609820, "rating": 5.0, "text": "From the person at Home Depot that asked about my water to the person (marquis) who came to my home and the installer it was a wonderful experience ! Everyone was so kind and knowledgeable about rainsoft. I’m so thankful that these special people love their jobs !! Today my system was installed and I’m excited to be on the rainsoft water journey to better water and health !", "pics": null, "resp": {"time": 1621180567552, "text": "Thank you so much Cathy for the wonderful review. I will pass it on to our team.enjoy your water."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113682472398974408414", "name": "Michele Hollatz", "time": 1616672950012, "rating": 5.0, "text": "We purchased a Rainsoft system for our house to help with the hard water.  From the time I contacted Rainsoft, they were very responsive and accommodating to schedule a time to meet with us to discuss our options.  After we made the decision to move forward, we were able to schedule an appointment within a short time frame. The installers spent less than 2 hours setting up the system and did a good job explaining the system.  We could immediately tell the difference in our water and are happy with the system.", "pics": null, "resp": {"time": 1616690626638, "text": "Thank you Michelle for sharing your experience. We value your opinions"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109791400599519571119", "name": "Katie Key", "time": 1614719596572, "rating": 5.0, "text": "Jordan came to us and had a fun science show with our little one and us. We enjoyed it so much and ultimately were sold pretty quick as our eczema prone skin screamed for relief from its winter quarrels. Great customer service so far, and Jordan was so nice, accommodating, and genuine.", "pics": null, "resp": {"time": 1614801642956, "text": "Thank you for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "105760007001858784644", "name": "Cala Poynor", "time": 1620952470593, "rating": 5.0, "text": "Jordan was such a pleasure to work with. Very professional and friendly. Highly recommend Jordan.", "pics": null, "resp": {"time": 1620997890638, "text": "thank you cala for recommending jordan"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109978444638260849339", "name": "Ginger Robinson", "time": 1620663766278, "rating": 5.0, "text": "Doug and Adam installed my rainsoft. They were curtios and professional. The installation was quick and painless. I appreciate everything!", "pics": null, "resp": {"time": 1620664441548, "text": "Thank you ginger for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115904393564526171976", "name": "Pamela Fann", "time": 1617769456919, "rating": 5.0, "text": "Lewis was very knowledgeable and thoroughly explained everything as he demonstrated the RainSoft system and all the benefits. I purchased the whole house system and in just two weeks it has been a life changer!  Thank you Lewis and RainSoft!", "pics": null, "resp": {"time": 1617761379059, "text": "Thank you Pamela for the 5 star rating. We appreciate it"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "105519470393868891675", "name": "Daniel Lawrence", "time": 1616024656237, "rating": 5.0, "text": "Jordan was super knowledgeable, friendly and helpful.We were own away by his presentation and how much our water has been affecting our family. We are very pleased.", "pics": null, "resp": {"time": 1616082953084, "text": "Thank you Daniel for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104053631369563408291", "name": "Steve Drake", "time": 1593256735636, "rating": 5.0, "text": "What a difference a water softener makes!  The team at RainSoft of Huntsville did a great job from our initial contact all the way through installation and follow-up.  While testing our water, Randy provided a thorough explanation as to how their system works to counter issues with water hardness, impurities, and taste.  The installation was scheduled very quickly and  was performed professionally.  Adam, who installed our system, took the time to answer all our questions and to ensure we understood how the system works. My wife, who has drunk bottled water exclusively for years, is now drinking filtered alkaline water from the RainSoft system and prefers its taste to that of the bottled water she's been drinking.  In addition, we've already noticed marked improvement in our hair and skin after showering in the softened water for a few days.  We look forward to years of softened and filtered water and are confident in the installed system given the lifetime warranty provided by RainSoft.", "pics": null, "resp": {"time": 1593367526366, "text": "I am very happy RainSoft is improving your everyday life. Thank you for the wonderful review. Adam will appreciate the feedback , your satisfaction is important to all of our team members"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102626602267961583027", "name": "Nicolette Kolar", "time": 1599763859283, "rating": 5.0, "text": "From my initial call to Rain Soft in speaking with Wendy explaining exactly what I needed to the crew that came out I couldn't ask for more. Richard and his men were professional. Explained how everything worked. They took their time in making sure everything was working properly. I have an irrigation system. They checked the lines to make sure they were not damaged.\nI am very happy with what I now have.\nI would recommend Richard and his crew and the company itself to anyone who wants good quality service and an excellent product", "pics": null, "resp": {"time": 1599781926415, "text": "Thank you Nicolette for your kind review . I know Wendy and richard will be very happy they were able to achieve your satisfaction."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "110210396178492597163", "name": "Justin Lesh", "time": 1613012619546, "rating": 5.0, "text": "Great solution to bad water! Install was fast and easy, the two installers Richard and Clayton did great work. Presentation by Lewis is what sold it all though, super informative and gave a great solution to bad water issues.", "pics": null, "resp": {"time": 1613053974386, "text": "Thank you Justin for recognizing our incredible installers. Lewis as well. It means a lot because they care how you feel and that your happy"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102941367281510260309", "name": "Julian Denney", "time": 1596296065894, "rating": 4.0, "text": "Lewis was fantastic!! He walked us through everything and explained every detail of what he was doing. My wife and I had a lot of questions and he had no problem answering any of them. Very polite and a lot of fun to talk with. As far as the system goes it’s still kind of early on. We are on well water and have had issues with the water smelling like iron and bacteria growing in our dogs water bowl very quickly. I still get a hint of the iron smell right now but no water spots on anything and bacteria hasn’t been an issue since we had our system put in. Lewis has been fantastic after are purchase as well and supported us by answering questions and getting people out to us to make sure everything is working right. As of now I would recommend rainsoft, but like I said we’re still kind of early. As far as the customer service goes it’s 11/10 for sure. The system and the price I recommend but not quite ready to give it 5 stars yet. If the iron smell goes away this will have a 5.", "pics": null, "resp": {"time": 1596300509718, "text": "Thank you mr denney for taking the time to share your experience. Please let us know if the iron smell goes away. If it doesn’t I will send a technician out to get it resolved."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "101668104975710784919", "name": "Joseph Rowser", "time": 1601502500943, "rating": 5.0, "text": "My family loves the rain soft system. The initial takes longer than told, but we can feel the changes so far. Marquis and Terri did an awesome job of customer service and sales and retesting. A little pricey for some but it may be worth it in the long run for our health. To be continued.....", "pics": null, "resp": {"time": 1601558859690, "text": "thank you joseph for taking the time to share your thoughts.we will always be here for you.enjoy your water"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102741451508328251858", "name": "Karlene Nazario", "time": 1595977007081, "rating": 5.0, "text": "Salesman was friendly and well knowledgable in the product- great home presentation. He showed us what we had in our water and between what  the machine offers and the deals, it was hard not to say no. The Rainsoft machine is great to have in your home, especially when you want to protect your family. Customer Service was available when needed and the owner, Randy personally made sure that everything was taken care of and that we were happy with the services.", "pics": null, "resp": {"time": 1595977769325, "text": "Thank you karlene for sharing your experience. We value your opinion greatly."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116801470349696983435", "name": "Cyndi Teague", "time": 1579376261914, "rating": 5.0, "text": "Jordan did a fantastic job! My husband and I were both very pleased with him and his presentation from the minute he walked inside our house. He was polite, very friendly, and professional. It’s apparent that he loves what he does and cares about his customers. Jordan made this whole process fun and exciting! We thoroughly enjoyed every minute of him telling us about our water. He offered us an opportunity for better, cleaner, and healthier water that we just could not refuse! We hope he keeps doing exactly what he’s doing! 110% satisfied!", "pics": null, "resp": {"time": 1579462696613, "text": "Thank you cyndi for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109978444638260849339", "name": "Ginger Robinson", "time": 1620663766278, "rating": 5.0, "text": "Doug and Adam installed my rainsoft. They were curtios and professional. The installation was quick and painless. I appreciate everything!", "pics": null, "resp": {"time": 1620664441548, "text": "Thank you ginger for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113103286643791725397", "name": "Traci Fry", "time": 1601316269508, "rating": 5.0, "text": "I’m loving my new Rain Soft system !!  My saleman Marcus was so polite and knowledgeable! He was great !! The install team was really professional and polite !  Great experience all the way around !!  Satisfied so far !  The life time warranty was what sold me !", "pics": null, "resp": {"time": 1601317642953, "text": "Thank you Traci for your kind review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106027056137696395069", "name": "Jim H.", "time": 1580485261752, "rating": 5.0, "text": "Lewis and Doug are awesome!  Friendly and professional service! Had a whole house system installed and couldn't be happier!  Doug also saved me $$$$ on a tankless water heater I was going to by - a simple adjustment in my shower and now I have hot water!!\n\nAlso got the portable air purification system.  It's been running two days and you can't tell I have two cats!\n\nLove the systems and the service!", "pics": null, "resp": {"time": 1580610763963, "text": "Jim we are very happy you are loving the water and air cleaner. Lewis and doug have passion for what they do . We all care about your experience and appreciate you sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108844888037202762010", "name": "Ambur Love", "time": 1609268552793, "rating": 2.0, "text": "I'm giving them 2 stars based on the water being okay (not as great as the claims). We can tell a difference in taking a shower at our house vs someone else's house. Also, I was upset before about our water system purchase and had left a review and someone called me to attempt to make it right.\nNow for the bad: There were so many false claims during the sales pitch. They are great scammers, so I beg you - please do not trust these people when they come into your house and force you to make a decision about their product that day! Ask as many questions as you can and take the time to read through all the paperwork! It's a good water system, but it is definitely not worth $8000 plus the extra costs they don't tell you about! Here are some lies we were told:\n1. During the sales pitch we were assured we would get the Pure Selects products for life. It was part of the salesman's pitch to show us how much money we'd save because we'd no longer have to buy shampoo, detergent, soap, etc. It was never explained to us that we'd only get 4 vouchers of free product and then after that you have to pay $99 a year for only 10 products from Pure Selects. This was a huge selling point for us, because we thought we were saving some money from the huge purchase. Also, the salesman exaggerated on the quality of the products and water working together. You need more product than what they tell you, and they don't work as good as the claims.\n2. We were never told that we have to get filters replaced every year and some replaced every 2 years, and these filters would cost over $100 each time.\n3. We were told we didn't owe a payment for the first month or so. However, within a few weeks of our purchase we received our first bill that was due within the time frame they said we wouldn't have to pay, and was already accruing interest. They don't talk about the interest rate to you! - Ask about this!!  They say your monthly payment is like $70 or so (can't remember the exact number) that's false. The minimum payment for ours was $96 a month. They avoid talking about interest at all, do not let them get away with that! The financing company charges a daily interest rate, so that adds up!\n4. Our salesman said he'd be back within 30 days of installation to retest our water and make sure we were satisfied with our purchase. False - we never heard from him again. I talked about this in my last review and someone called me and said they would send him out to our house, that never happened either.\nBottom line: Don't trust this company. They lack integrity and will do anything for your money.\n\nUpdate: they give you a Health way air purifier and don't communicate that the filters for that cost $238 yearly.\nAlso, I saw the comment back to this from the company. We gave them the opportunity to correct the issue in the past and they did nothing, they just want to monitor these bad reviews.", "pics": null, "resp": {"time": 1603218320943, "text": "thank you amber for your 2 star review.your opinion does count.i tried to look up your account but its not under amber love. if you will call our office and provide the name the account is under i will certainly try to address your concerns.rainsoft of huntsville has been in huntsville 25 years,we have not been here this long trying to scam people. the product is real and were real people too.i assure you i will do everything in my power to help you.i look forward to hearing from you"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113342998209545907084", "name": "Gary Connor", "time": 1622228228733, "rating": 5.0, "text": "Louis did a terrific job explaining capabilities and benefits. Doug did an awesome job on the install !", "pics": null, "resp": {"time": 1622231134841, "text": "Thank you Gary for your review!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117052029482227614306", "name": "Lori Buckelew", "time": 1579182075784, "rating": 5.0, "text": "Lewis was great! He was very knowledgeable and answered all of our questions and had such a great personality.  If you get Lewis as a technician you are very lucky!  We love our new RainSoft system and wish we had done this years ago.  The change in the water is immediate and fantastic!  The air filtration system is a gem too.  I highly recommend RainSoft and Lewis!!  And Lewis if you are reading this....you were right...the coffee the next morning was drastically better!  Thank you RainSoft!", "pics": null, "resp": {"time": 1579206509321, "text": "Thank you Lori for sharing your experience. We greatly appreciate your feedback."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108409032677921916574", "name": "Joshua Gilliland", "time": 1573182130816, "rating": 5.0, "text": "We got the RainSoft system yesterday and we absolutely love it. We were skeptical at first but when Jordan, the Water Tech., showed us the science behind it, and the benefits of having truly clean water, we were convinced it was a better way to live....with CLEAN water!! The installer, Doug, was mindful that I was sick the day he came to install the system, and told me not to worry about a thing and he would handle it all. They installed it within 2 hours and did a great job getting it done. If you’re considering getting a RainSoft Water Treatment system, please take my advice and do it. It’s a wonderful thing to have clean water throughout the whole house!\nElizabeth", "pics": null, "resp": {"time": 1573230102645, "text": "thank you Elizabeth for your review.i will let jordan and doug know.this review means alot to them and our company."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "118121988895865337754", "name": "Wade Harris", "time": 1596685410003, "rating": 1.0, "text": "First, I will be positive. The drinking water is great! Very satisfying and refreshing, heck that was the whole reason we even had them come out. Responsive team and quick installation. Second, I have an issue with the honesty of the house water filtering systems. During the sales pitch it was stated that the slimy feeling on the skins was the oils not being washed off from the “harsh” water since it is now filtered. Fine sounds great love it. So we bought and start using it and I couldn’t stand the slimy feeling in the shower, might as well pour a bottle of conditioner over me... no thanks. So I call Rainsoft and tell them I’m not satisfied with that and would like to negotiate a deal. The sales rep deferred to the owner. He could care less about making a deal so he says no problem I’ll have a tech come out and move the “conditioner” to the front of the carbon filtering system. Since he wouldn’t even slightly consider making a deal on the purchase, I accepted to try it out. Slimy feeling gone. I’m satisfied... then my wheels start spinning and I start wondering why if the filtering of “harsh” water is why the oils of my skin make my hands/body feel slimy, then why when the conditioner was moved did the slimy feeling go away? If the system is “supposed” to ALWAYS be filtering the harshness then why does the conditioner even matter? But apparently I’m wrong and I’m the only person out of ten years to complain about the “slimy” feeling based off my sales rep. Here is my conclusion that it is “false advertising“ and the whole oil pitch is a hoax and the conditioner is a added fluff. I will get to the bottom of this either by losing or winning I don’t care it’s worth my effort. So if your happy with your slimy feeling system great keep enjoying! If this makes you question the integrity of the system please call and arise your concern to Mr. Williams the owner. I believe it is super wrong to make false claims. There were many other false claims made during the sales deal also... extremely disappointing and $8k... maybe $6k (not sure the drinking water price) wasted.", "pics": null, "resp": {"time": 1596749018911, "text": "Sorry for your trouble my Harris . I didn’t make that up about the skin . If you think about that’s why the oils doesn’t seem to rinse off is because it’s the oils of your skin. Chlorine & hard water is what affects your skin and maybe you have been use to that and just not adjusting  to the soft water. I’m glad you enjoy the other benefits ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106918174306110600365", "name": "Audrey Cobb", "time": 1579276464024, "rating": 5.0, "text": "Jordan is awesome! Our initial test went great, even though we had a bad experience with the south florida sector of this company. He went out of his way to make us feel better about the process and what we were actually getting. After install he even returned on my request to retest it to confirm the water change from what it was before, got water from a friend to compare against. Feeling really good about our purchase, our water and our future service with the company. Thank you Jordan!", "pics": null, "resp": {"time": 1579285863522, "text": "Thank you Audrey for the review and sharing your experience with others.I will be sure to let Jordan know."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112506531235300157250", "name": "Diana Zorzon", "time": 1595885439706, "rating": 5.0, "text": "I don't usually like to leave reviews but I decided it's worth sharing my experience 😊. We were very skeptical about getting our water tested and learning about the hardness of the water, but we were happy we did it when we saw the results🤢. We ended up buying Rainsoft 💧water filtration system for the whole house, the reverse osmosis system for drinking water and as a bonus we got the air purifier. Also, we were given a set of soaps and cleaning products, laundry detergent and 4 vouchers that will last us for at least 5 years. And OMG what a difference it makes! The water is so silky soft. Baths feel like heaven, extra relaxing and comfortable💆‍♀️💆‍♂️. Showers🚿 feel like massages with essential oils. Skin feels well nourished 🥥. Copper stains are gone. Clothes feel cleaner and softer. Dishes don't have any more water stains. The air feels cleaner and pleasant. Also very happy with the installation time and quality. From Doug, to Randy, to Wendy, to all the plumbers who work for Rainsoft right now, everyone is amazing and very accommodating to all our needs. We have had the system for about 2 weeks.", "pics": null, "resp": {"time": 1595890431839, "text": "Thank you Diana for taking the time to share your experience. We all are pleased the system is meeting your expectations."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116466963385820530922", "name": "KIRSTEN Brochmann", "time": 1575042258890, "rating": 5.0, "text": "We bought a home that already had the \"Rain Soft System\" and we are so happy we kept it. Great drinking water and silky soft showers.\nRicky, the Rain Soft technician, was also everything you could hope for,\nfriendly, helpful, knew what he was doing and went out of his way to make sure we understood our water system. Ricky even left us a hand written note with directions and his phone number if we had any problems.", "pics": null, "resp": {"time": 1575085529893, "text": "Thank you for the review. Very fortunate for you .! I will certainly let Rickey know about the review . It means a lot to him."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "110042730749201151331", "name": "Ronald Johnson", "time": 1555266133106, "rating": 5.0, "text": "Fantastic system, Fantastic service. We got two quotes for a water softener system and went with Rainsoft even though it was a bit more expensive. We knew that the cheaper option was an inferior product and we wanted the best system for our home. Having a softener is like having HDTV - you might not think you need it, but once you have it you can’t go back. Laundry is soft, hair is soft, skin is smoother and more comfortable, etc..  The installation team brought everything they needed, did everything quickly and professionally. Even told me not to worry about the garage shelves that needed to be moved. Finally, when I didn’t receive the cleaning products, I talked with Randy and received the complete package in a few days. Outstanding customer service and professionalism from start to finish. Best part, our water is great!", "pics": null, "resp": {"time": 1555341278790, "text": "Thank you Ronald for the kind review. We will provide you with outstanding service ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113224654312088978197", "name": "Kristin Rosin", "time": 1578270791793, "rating": 4.0, "text": "We just ordered our system and are loving it Jordan was nice enough to come back and test the system at all points to make sure that it is functioning just as they said it would. We are so excited for our great new water and the health benefits for our family.\n\n*Update: After 2 weeks\n\nWe are still loving the water system. However we have noticed a few things that weren’t exactly clear before we bought that you might want to know:\n\nA. The soap offered by the sales person was a big selling point. However, the soap is not the best and you will likely have to buy your own anyways.\nB. They tell you that you can make payments for five years and pay it off. However if you make the minimum payment that they pitch to you, it will likely take 11 years to pay off. Also, you will pay double with interest.\nC. You will need more salt for the system to clean itself than initially stated.\nD. The only way to fill the reverse osmosis 5 gallon tank is to literally run good water down your drain. Be prepared to essentially pay for a water leak. I cannot believe that this was the only way to engineer the system.\n\nSo if you can live with the things above, you will like the system. We will update this as we get a few more months in.", "pics": null, "resp": {"time": 1575863968596, "text": "Thank you Kristin for your review . We are grateful for you putting your trust in  us .thank you for the update . The soaps are 100% performance guaranteed. Please call the toll free number on your soap bottle . The customer service there is great .if that doesn’t meet your expectations then please let me know . All reverse osmosis work the same . It takes getting rid of the total dissolved solids to make purified water. This is not a leak it’s the process it takes . On the financing there is no pre payment penalty for early payoff . You can manage the amount of time it will take you to pay the system off . Each home is different . Your satisfaction is very important to us . Please don’t hesitate to allow us to answer your questions or provide assistance."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "101355973809142272966", "name": "Dana Zahm", "time": 1618969137603, "rating": 5.0, "text": "Jordan was a very respectful young man and we are so excited for our new water system to be installed!", "pics": null, "resp": {"time": 1618970126895, "text": "Thank you Dana for your review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100973330927637702805", "name": "Darrell Stroy", "time": 1626135375341, "rating": 5.0, "text": "Jordan was very professional in his presentation of the product.  He also was very courteous.", "pics": null, "resp": {"time": 1626145744051, "text": "Thank you Darrell for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113181490422796443458", "name": "Fred Hedgecock", "time": 1596668000413, "rating": 5.0, "text": "We’ve been extremely pleased with the Rain Soft system. The alkaline water filtration has been the biggest hit, even the kids are drinking more water. Be sure to ask for Lewis, very knowledgeable on the system and took the time to answer all of our questions.", "pics": null, "resp": {"time": 1597090461747, "text": "so glad to hear the kids are drinking more water.thanks for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104520262488167632688", "name": "Barbara Burns", "time": 1580145181818, "rating": 5.0, "text": "Lewis done a wonderful job explaining what's in our water and how it effects us. How it reacts to and with our skin, dishes and laundry. Since our installation I have seen a visible difference in our laundry, dishes and even on our hair and skin. Thank you for sharing with us all the things we can do to improve our health and home with Rain Soft.", "pics": null, "resp": {"time": 1580145366791, "text": "thank you barbara for sharing your experience. we greatly appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115540127788584095646", "name": "Carrie Garner", "time": 1587056071891, "rating": 5.0, "text": "When the installers arrived they were very friendly and professional. The sales person, Randy Williams, was very knowledgeable answering the questions I had as he explained how to operate the unit.  I’m loving my soft water!!  And loving the fact I don’t smell chlorine in my water  anymore!!", "pics": null, "resp": {"time": 1589481555662, "text": "thank you carrie for your feedback ,we really appreciate it.so glad your enjoying your water."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106784021690477379527", "name": "Kay Tompkins", "time": 1603746707762, "rating": 5.0, "text": "We have had our system for over 4 years ...love our system..water taste great..I am a holistic health coach so I know the importance of clean water...this is a super company to do business with ...A+ customer service in all areas ...love Lisa who always responds and follows up and explains ....their service personnel are very professional & friendly....can't say enough ....get you some clean water!!  Judge Pride & Kay Knotts Tompkins", "pics": null, "resp": {"time": 1603747856207, "text": "Thank you for sharing your experience. It means a lot to us."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117329615187967490177", "name": "Sandra Wesson", "time": 1584371164249, "rating": 5.0, "text": "What a difference! Randy was so kind and informative. I had experience with a similar product before I moved to AL so I knew I needed a water system. Randy answered all my questions about RainSoft plus shared about CleanSoft for my washing machine. I took a chance and let me say WOW! I spent the weekend washing boxes full on my Marine son’s clothes and they are all fresh and ‘like-new’ again. No more teen boy grungy odor. Now I can’t wait for my AirMaster filter system to arrive this week. Clean water, Pure cleaning products, clean air...\nRandy represents the epitome of customer-service! The product speaks for itself, but the way Randy handles everything that is thrown at him speaks volumes about the care he puts into all that he does.", "pics": null, "resp": {"time": 1584401863591, "text": "Thank you Sandra for your kind review. I’m so glad the RainSoft products will help you and your family for years to come. Our service team will always be here for you.oh, please thank your son for for me for serving our country."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112594145781751115023", "name": "jeff deane", "time": 1607965479083, "rating": 5.0, "text": "The crew was professional and polite. They installed the water treatment system and reverse osmosis system in a few hours and the quality of water is amazing.  Thanks Randy and team!", "pics": null, "resp": {"time": 1607966532915, "text": "thank you jeff for sharing your experience with us."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116672661784533586590", "name": "ThantosVoid Music", "time": 1604085228267, "rating": 5.0, "text": "The entire Rain Soft staff is amazing.\nTheir one employee, Doug, always has such a big smile and gives you a peace of mind the job will be completed to our satisfaction.", "pics": null, "resp": {"time": 1604088179062, "text": "Thank you for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109591617897371660941", "name": "Vivian Frazier", "time": 1621988192364, "rating": 5.0, "text": "I had no intention of buying this product until i seen what we were drinking we brought it Jordan did a wonderful job presenting this product", "pics": null, "resp": {"time": 1622049087718, "text": "Thank you Vivian for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116801470349696983435", "name": "Cyndi Teague", "time": 1579376261914, "rating": 5.0, "text": "Jordan did a fantastic job! My husband and I were both very pleased with him and his presentation from the minute he walked inside our house. He was polite, very friendly, and professional. It’s apparent that he loves what he does and cares about his customers. Jordan made this whole process fun and exciting! We thoroughly enjoyed every minute of him telling us about our water. He offered us an opportunity for better, cleaner, and healthier water that we just could not refuse! We hope he keeps doing exactly what he’s doing! 110% satisfied!", "pics": null, "resp": {"time": 1579462696613, "text": "Thank you cyndi for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106784021690477379527", "name": "Kay Tompkins", "time": 1603746707762, "rating": 5.0, "text": "We have had our system for over 4 years ...love our system..water taste great..I am a holistic health coach so I know the importance of clean water...this is a super company to do business with ...A+ customer service in all areas ...love Lisa who always responds and follows up and explains ....their service personnel are very professional & friendly....can't say enough ....get you some clean water!!  Judge Pride & Kay Knotts Tompkins", "pics": null, "resp": {"time": 1603747856207, "text": "Thank you for sharing your experience. It means a lot to us."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103509272295552583052", "name": "Deborah King", "time": 1587073881418, "rating": 5.0, "text": "I initially thought I had soft water but was drastically surprised when it was tested. After seeing all the particles in my water, I was convinced I need to get a filter for healthy living. The rain soft rep was very professional, cordial and knowledgeable. I had the unit installed and am waiting for the salts to clear. I am pleased with it thus far.", "pics": null, "resp": {"time": 1589481493741, "text": "thank you deborah for your rating and review,we truely appreciate the feedback"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102096359727536234071", "name": "Cassidy Eastham", "time": 1607130347403, "rating": 5.0, "text": "Seth just came to talk to my boyfriend and I about rain soft and we are super excited to get our system installed tomorrow! He did a fantastic job!", "pics": null, "resp": {"time": 1607190642384, "text": "Your gonna love your clean water . Thank you for taking the time to share"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113814097709731670893", "name": "Marci Baker", "time": 1596747404876, "rating": 5.0, "text": "Lewis was nothing but a gentlemen, very knowledgeable and answered any possible question we could come up with. His presentation even had our toddler entertained. His professionalism was above par and highly recommended. No hidden costs popped up and the install crew backed the same.", "pics": null, "resp": {"time": 1596748623873, "text": "Thank you Marci for the great review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117052029482227614306", "name": "Lori Buckelew", "time": 1579182075784, "rating": 5.0, "text": "Lewis was great! He was very knowledgeable and answered all of our questions and had such a great personality.  If you get Lewis as a technician you are very lucky!  We love our new RainSoft system and wish we had done this years ago.  The change in the water is immediate and fantastic!  The air filtration system is a gem too.  I highly recommend RainSoft and Lewis!!  And Lewis if you are reading this....you were right...the coffee the next morning was drastically better!  Thank you RainSoft!", "pics": null, "resp": {"time": 1579206509321, "text": "Thank you Lori for sharing your experience. We greatly appreciate your feedback."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113103286643791725397", "name": "Traci Fry", "time": 1601316269508, "rating": 5.0, "text": "I’m loving my new Rain Soft system !!  My saleman Marcus was so polite and knowledgeable! He was great !! The install team was really professional and polite !  Great experience all the way around !!  Satisfied so far !  The life time warranty was what sold me !", "pics": null, "resp": {"time": 1601317642953, "text": "Thank you Traci for your kind review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113224654312088978197", "name": "Kristin Rosin", "time": 1578270791793, "rating": 4.0, "text": "We just ordered our system and are loving it Jordan was nice enough to come back and test the system at all points to make sure that it is functioning just as they said it would. We are so excited for our great new water and the health benefits for our family.\n\n*Update: After 2 weeks\n\nWe are still loving the water system. However we have noticed a few things that weren’t exactly clear before we bought that you might want to know:\n\nA. The soap offered by the sales person was a big selling point. However, the soap is not the best and you will likely have to buy your own anyways.\nB. They tell you that you can make payments for five years and pay it off. However if you make the minimum payment that they pitch to you, it will likely take 11 years to pay off. Also, you will pay double with interest.\nC. You will need more salt for the system to clean itself than initially stated.\nD. The only way to fill the reverse osmosis 5 gallon tank is to literally run good water down your drain. Be prepared to essentially pay for a water leak. I cannot believe that this was the only way to engineer the system.\n\nSo if you can live with the things above, you will like the system. We will update this as we get a few more months in.", "pics": null, "resp": {"time": 1575863968596, "text": "Thank you Kristin for your review . We are grateful for you putting your trust in  us .thank you for the update . The soaps are 100% performance guaranteed. Please call the toll free number on your soap bottle . The customer service there is great .if that doesn’t meet your expectations then please let me know . All reverse osmosis work the same . It takes getting rid of the total dissolved solids to make purified water. This is not a leak it’s the process it takes . On the financing there is no pre payment penalty for early payoff . You can manage the amount of time it will take you to pay the system off . Each home is different . Your satisfaction is very important to us . Please don’t hesitate to allow us to answer your questions or provide assistance."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102710287404522798402", "name": "Jason Montgomery", "time": 1601750074202, "rating": 5.0, "text": "Lewis was very detailed and thorough in his presentation. We purchased the RainSoft system a few months ago and have loved it.", "pics": null, "resp": {"time": 1601835339675, "text": "Thank you Jason for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100028742292373378029", "name": "Michael Esteghamat", "time": 1604430839467, "rating": 5.0, "text": "Over all we are very excited about new system, Richards Burgess and Kenny Bannister both of them  are very knowledgeable, friendly to work with and answered all of our concerns, we do fully recommend them with the rain soft of Huntsville company.", "pics": null, "resp": {"time": 1604439517005, "text": "Thank you Michael for recognizing our 2 installers. We are blessed to have them."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "118121988895865337754", "name": "Wade Harris", "time": 1596685410003, "rating": 1.0, "text": "First, I will be positive. The drinking water is great! Very satisfying and refreshing, heck that was the whole reason we even had them come out. Responsive team and quick installation. Second, I have an issue with the honesty of the house water filtering systems. During the sales pitch it was stated that the slimy feeling on the skins was the oils not being washed off from the “harsh” water since it is now filtered. Fine sounds great love it. So we bought and start using it and I couldn’t stand the slimy feeling in the shower, might as well pour a bottle of conditioner over me... no thanks. So I call Rainsoft and tell them I’m not satisfied with that and would like to negotiate a deal. The sales rep deferred to the owner. He could care less about making a deal so he says no problem I’ll have a tech come out and move the “conditioner” to the front of the carbon filtering system. Since he wouldn’t even slightly consider making a deal on the purchase, I accepted to try it out. Slimy feeling gone. I’m satisfied... then my wheels start spinning and I start wondering why if the filtering of “harsh” water is why the oils of my skin make my hands/body feel slimy, then why when the conditioner was moved did the slimy feeling go away? If the system is “supposed” to ALWAYS be filtering the harshness then why does the conditioner even matter? But apparently I’m wrong and I’m the only person out of ten years to complain about the “slimy” feeling based off my sales rep. Here is my conclusion that it is “false advertising“ and the whole oil pitch is a hoax and the conditioner is a added fluff. I will get to the bottom of this either by losing or winning I don’t care it’s worth my effort. So if your happy with your slimy feeling system great keep enjoying! If this makes you question the integrity of the system please call and arise your concern to Mr. Williams the owner. I believe it is super wrong to make false claims. There were many other false claims made during the sales deal also... extremely disappointing and $8k... maybe $6k (not sure the drinking water price) wasted.", "pics": null, "resp": {"time": 1596749018911, "text": "Sorry for your trouble my Harris . I didn’t make that up about the skin . If you think about that’s why the oils doesn’t seem to rinse off is because it’s the oils of your skin. Chlorine & hard water is what affects your skin and maybe you have been use to that and just not adjusting  to the soft water. I’m glad you enjoy the other benefits ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102741451508328251858", "name": "Karlene Nazario", "time": 1595977007081, "rating": 5.0, "text": "Salesman was friendly and well knowledgable in the product- great home presentation. He showed us what we had in our water and between what  the machine offers and the deals, it was hard not to say no. The Rainsoft machine is great to have in your home, especially when you want to protect your family. Customer Service was available when needed and the owner, Randy personally made sure that everything was taken care of and that we were happy with the services.", "pics": null, "resp": {"time": 1595977769325, "text": "Thank you karlene for sharing your experience. We value your opinion greatly."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "114592780698161760334", "name": "Janet Dorning", "time": 1596554375220, "rating": 2.0, "text": "Marquis introduced the products to us in a clear and enjoyable presentation.  He knows the products, presents with no pressure, and makes the process of learning very enjoyable.", "pics": null, "resp": {"time": 1596592143736, "text": "Thank you for your kind review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115540127788584095646", "name": "Carrie Garner", "time": 1587056071891, "rating": 5.0, "text": "When the installers arrived they were very friendly and professional. The sales person, Randy Williams, was very knowledgeable answering the questions I had as he explained how to operate the unit.  I’m loving my soft water!!  And loving the fact I don’t smell chlorine in my water  anymore!!", "pics": null, "resp": {"time": 1589481555662, "text": "thank you carrie for your feedback ,we really appreciate it.so glad your enjoying your water."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103185733529155095497", "name": "Curtis Malinowski", "time": 1597722816525, "rating": 5.0, "text": "Working in a hot manufacturing plant, I drink ice water all day long. I still drink the water at the plant, but the water at home taste a lot better. Also, laundry does't need so much fabric softener now.", "pics": null, "resp": {"time": 1597763742268, "text": "thank you curtis for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106987630672424243365", "name": "Karlene Nazario", "time": 1599676832487, "rating": 5.0, "text": "Thank you for helping us with our account. The machine is great and the salesperson, Lewis, is very product knowledgeable and well presented.", "pics": null, "resp": {"time": 1591301863674, "text": "Thank you for you kind review. Lewis will appreciate it as well as our company.our apologies for the this misunderstanding. we offer financing from finance companies that are in our industry.we have no control over their rates and terms.there are no scare tactics to what we do.if you buy any product of any kind and you finance it there will be an interest rate."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111187940130493894811", "name": "Mary McDaniel", "time": 1612630371193, "rating": 5.0, "text": "Lewis did a great job showing us how bad our current county water was and how the Rainsoft system could change our lives.", "pics": null, "resp": {"time": 1612634922290, "text": "Thank you Mary for your review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116466963385820530922", "name": "KIRSTEN Brochmann", "time": 1575042258890, "rating": 5.0, "text": "We bought a home that already had the \"Rain Soft System\" and we are so happy we kept it. Great drinking water and silky soft showers.\nRicky, the Rain Soft technician, was also everything you could hope for,\nfriendly, helpful, knew what he was doing and went out of his way to make sure we understood our water system. Ricky even left us a hand written note with directions and his phone number if we had any problems.", "pics": null, "resp": {"time": 1575085529893, "text": "Thank you for the review. Very fortunate for you .! I will certainly let Rickey know about the review . It means a lot to him."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117267939319446316431", "name": "Mindy Burgess", "time": 1575942781207, "rating": 5.0, "text": "The difference in the water after having a system installed is amazing. Softer skin, hair and laundry. It is truly awesome! If you’re considering a RainSoft system, take my word for it. Life changing", "pics": null, "resp": {"time": 1575948289079, "text": "Thank you Mindy for sharing your experience with us . Enjoy your water ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "118312505054316091256", "name": "John Traylor", "time": 1589767682645, "rating": 5.0, "text": "Professional sales, top quality and quick installation.  Installers went above and beyond and did a great job.  Most pleased with the product and much improved water.", "pics": null, "resp": {"time": 1589814717005, "text": "thank you john for your review.your satisfaction is very important to us."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106027056137696395069", "name": "Jim H.", "time": 1580485261752, "rating": 5.0, "text": "Lewis and Doug are awesome!  Friendly and professional service! Had a whole house system installed and couldn't be happier!  Doug also saved me $$$$ on a tankless water heater I was going to by - a simple adjustment in my shower and now I have hot water!!\n\nAlso got the portable air purification system.  It's been running two days and you can't tell I have two cats!\n\nLove the systems and the service!", "pics": null, "resp": {"time": 1580610763963, "text": "Jim we are very happy you are loving the water and air cleaner. Lewis and doug have passion for what they do . We all care about your experience and appreciate you sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "110235458847410372328", "name": "jay johnson", "time": 1593183256248, "rating": 5.0, "text": "I just had the EC5 system installed in my home on 6-25-2020. So far from what I can tell, I'm pleased with the unit. I will reply back with an update in a few weeks.", "pics": null, "resp": {"time": 1593187479116, "text": "thank you mr johnson for your review.we will be here for you every step of the way.enjoy your water."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104520262488167632688", "name": "Barbara Burns", "time": 1580145181818, "rating": 5.0, "text": "Lewis done a wonderful job explaining what's in our water and how it effects us. How it reacts to and with our skin, dishes and laundry. Since our installation I have seen a visible difference in our laundry, dishes and even on our hair and skin. Thank you for sharing with us all the things we can do to improve our health and home with Rain Soft.", "pics": null, "resp": {"time": 1580145366791, "text": "thank you barbara for sharing your experience. we greatly appreciate it."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108844888037202762010", "name": "Ambur Love", "time": 1609268552793, "rating": 2.0, "text": "I'm giving them 2 stars based on the water being okay (not as great as the claims). We can tell a difference in taking a shower at our house vs someone else's house. Also, I was upset before about our water system purchase and had left a review and someone called me to attempt to make it right.\nNow for the bad: There were so many false claims during the sales pitch. They are great scammers, so I beg you - please do not trust these people when they come into your house and force you to make a decision about their product that day! Ask as many questions as you can and take the time to read through all the paperwork! It's a good water system, but it is definitely not worth $8000 plus the extra costs they don't tell you about! Here are some lies we were told:\n1. During the sales pitch we were assured we would get the Pure Selects products for life. It was part of the salesman's pitch to show us how much money we'd save because we'd no longer have to buy shampoo, detergent, soap, etc. It was never explained to us that we'd only get 4 vouchers of free product and then after that you have to pay $99 a year for only 10 products from Pure Selects. This was a huge selling point for us, because we thought we were saving some money from the huge purchase. Also, the salesman exaggerated on the quality of the products and water working together. You need more product than what they tell you, and they don't work as good as the claims.\n2. We were never told that we have to get filters replaced every year and some replaced every 2 years, and these filters would cost over $100 each time.\n3. We were told we didn't owe a payment for the first month or so. However, within a few weeks of our purchase we received our first bill that was due within the time frame they said we wouldn't have to pay, and was already accruing interest. They don't talk about the interest rate to you! - Ask about this!!  They say your monthly payment is like $70 or so (can't remember the exact number) that's false. The minimum payment for ours was $96 a month. They avoid talking about interest at all, do not let them get away with that! The financing company charges a daily interest rate, so that adds up!\n4. Our salesman said he'd be back within 30 days of installation to retest our water and make sure we were satisfied with our purchase. False - we never heard from him again. I talked about this in my last review and someone called me and said they would send him out to our house, that never happened either.\nBottom line: Don't trust this company. They lack integrity and will do anything for your money.\n\nUpdate: they give you a Health way air purifier and don't communicate that the filters for that cost $238 yearly.\nAlso, I saw the comment back to this from the company. We gave them the opportunity to correct the issue in the past and they did nothing, they just want to monitor these bad reviews.", "pics": null, "resp": {"time": 1603218320943, "text": "thank you amber for your 2 star review.your opinion does count.i tried to look up your account but its not under amber love. if you will call our office and provide the name the account is under i will certainly try to address your concerns.rainsoft of huntsville has been in huntsville 25 years,we have not been here this long trying to scam people. the product is real and were real people too.i assure you i will do everything in my power to help you.i look forward to hearing from you"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106918174306110600365", "name": "Audrey Cobb", "time": 1579276464024, "rating": 5.0, "text": "Jordan is awesome! Our initial test went great, even though we had a bad experience with the south florida sector of this company. He went out of his way to make us feel better about the process and what we were actually getting. After install he even returned on my request to retest it to confirm the water change from what it was before, got water from a friend to compare against. Feeling really good about our purchase, our water and our future service with the company. Thank you Jordan!", "pics": null, "resp": {"time": 1579285863522, "text": "Thank you Audrey for the review and sharing your experience with others.I will be sure to let Jordan know."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112506531235300157250", "name": "Diana Zorzon", "time": 1595885439706, "rating": 5.0, "text": "I don't usually like to leave reviews but I decided it's worth sharing my experience 😊. We were very skeptical about getting our water tested and learning about the hardness of the water, but we were happy we did it when we saw the results🤢. We ended up buying Rainsoft 💧water filtration system for the whole house, the reverse osmosis system for drinking water and as a bonus we got the air purifier. Also, we were given a set of soaps and cleaning products, laundry detergent and 4 vouchers that will last us for at least 5 years. And OMG what a difference it makes! The water is so silky soft. Baths feel like heaven, extra relaxing and comfortable💆‍♀️💆‍♂️. Showers🚿 feel like massages with essential oils. Skin feels well nourished 🥥. Copper stains are gone. Clothes feel cleaner and softer. Dishes don't have any more water stains. The air feels cleaner and pleasant. Also very happy with the installation time and quality. From Doug, to Randy, to Wendy, to all the plumbers who work for Rainsoft right now, everyone is amazing and very accommodating to all our needs. We have had the system for about 2 weeks.", "pics": null, "resp": {"time": 1595890431839, "text": "Thank you Diana for taking the time to share your experience. We all are pleased the system is meeting your expectations."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108844809509758398773", "name": "C Y", "time": 1571957458913, "rating": 5.0, "text": "This system is unbelievable!! It took me two weeks to stop wondering what chemicals the installer, Doug, put into the system to make my skin feel soft, to accepting the fact that the system REMOVES chemicals that harm just about everything.\n\nClean water is amazing. I hadn’t had a glass of tap water in years! Now, I enjoy it every day. It’s worth every penny. I wish I had bought it sooner.\n\nThe rep, Martin, really believes in the product. He was genuine and honest.", "pics": null, "resp": {"time": 1572008704104, "text": "Thank you CY for the review. I will let Doug and MARTIN know about the review. That means so much to them . They are hard working , honest people trying to do their best."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112457083474621194062", "name": "Josh Cooper", "time": 1585613620567, "rating": 5.0, "text": "So I waited until we had our system about a month so I could give a good honest and thorough review. To start it off, I thought it was a little rude for the lady to call me and tell me it was going to be a 15 minute test and it was not going to be a sales pitch, just for it to last over 2 hours and it was in fact a sales pitch. However, I looked past it because I was genuinely interested in how bad my water was and also that my neighbor at my old house had the system and told me all about it. So, to say the least, I wasn’t that shocked about how dirty my water was because I was expecting it. Our sales rep, I guess you would call him, was Dan Griffin and he is probably one of the most respectful guys you could ask for to come into your home and I don’t have one complaint on him. Dan, keep doing it the way you're doing it! So my wife and I decided to buy it and we honestly couldn’t be happier with it. Richard Burgess and William Skidmore installed our system and was also the most respectful people you could ask for. I don’t know where they find these people but they are very skilled and made it look very professional!\n\nI feel like it’s a great investment for your health and for your families health. We love the way our water tastes, we feel better after showers, our dishes look cleaner, and our food taste better! For all of those interested in these things and can afford it, I would say do it. For the ones asking theirselves if they can afford a $6k system, let me give you the rundown. It’s a 9.9% interest rate which is high but is better than a banks personal loan interest rate which is about 10% at the time I bought it. Its about a $72 monthly payment. If you pay the minimum payment It’ll take you 13 years to pay it off and you will end up paying $10,600 for it and if you pay $194 monthly payment then you will pay it off in 3 years and end up paying $6,980 for it. Which is not bad because like I said it’s $6k to begin with. Another reason I didn’t have a problem paying this much for it is because it’s for life! They will come and move it for you for free one time if you was to buy another house and then they charge you for any move after that, which is reasonable.\n\nOne of the great benefits to this deal is the soaps they supply you with. They supply you with ~about~ 5 year supply of every soap, detergent and cleaner that is in your house so you won’t be buying none of that stuff for the time your paying off the loan. Might I add, the soaps and cleaners are all natural and pure ingredients. When you think about it, you spend quite a bit on shampoo, conditioner, dish soap, dish washer detergent, laundry detergent, body wash, and glass cleaner a month and you won’t have that expense anymore as long as you like it...and we love it so far.\n\nSo to sum it up, we love our system so far and I already recommend it to people. Since we have had it, we have found out a couple people also have it and one has had it for 8 years and still loves it. No doubt it’s a good system and they are not trying to pull one over on you.\n\nHope it helped all that was worried about what I was worried about and made a difference. Good luck!", "pics": null, "resp": {"time": 1589482439045, "text": "thank you josh for all the great information. I will pass this on to dan,richard and will. they really appreciate the feedback. we have great employees here because they believe in the product.the majority of our employees have been here many years. they really care about how you feel before,during and after you invest in the rainsoft system."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116369182799717990669", "name": "Darry Madden", "time": 1586029505432, "rating": 5.0, "text": "Jordan is an awesome water technician. He is very knowledgeable and funny.  His personality alone would have sold us, but the system sells itself.", "pics": null, "resp": {"time": 1589481686337, "text": "we all feel the same way about jordan as you do.thank you for sharing your experience."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116983553491655976940", "name": "Keto Craigs", "time": 1549501052467, "rating": 5.0, "text": "Outstanding service!!!! We did the water demonstration on the weekend to fit our busy schedule and they came and installed it a few hours after giving the go ahead! All in one day! Very quick and professional!!\nThe system has made a world of difference on all of our chrome fixtures and shower glass! We also chose the alkaline water system and LOVE IT!!! We highly recommend RainSoft of Huntsville for anyone looking for a water softening system!", "pics": null, "resp": {"time": 1549502233043, "text": "I am glad the RainSoft system has made a difference for you and your family. Thank you for the recommendation."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103150381454228994865", "name": "James “HeSlamsAJet” Shaltes", "time": 1579979556660, "rating": 5.0, "text": "I’m a cost analyst by profession and a Certified Managerial Accountant (CMA). This product makes very good financial sense. I have had many experiences with high-pressure timeshare sales pitches. Doug was so very pleasant! The presentation lasted a bit longer than I was expecting, but worth every minute. It was a very low pressure marketing presentation because they rely on the in-house demonstration to do the talking. He was very patient and answered all of our questions. He did not use the normal high-pressure sales techniques I was expecting.", "pics": null, "resp": {"time": 1579983531714, "text": "Thank you for sharing your experience. This means a lot to our company and to Doug ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "101952845709664897128", "name": "Jeffrey Breeden", "time": 1598635391458, "rating": 5.0, "text": "Courteous, professional and efficient!  I highly recommend", "pics": null, "resp": {"time": 1598641681910, "text": "thank you jeffrey for your kind review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "108409032677921916574", "name": "Joshua Gilliland", "time": 1573182130816, "rating": 5.0, "text": "We got the RainSoft system yesterday and we absolutely love it. We were skeptical at first but when Jordan, the Water Tech., showed us the science behind it, and the benefits of having truly clean water, we were convinced it was a better way to live....with CLEAN water!! The installer, Doug, was mindful that I was sick the day he came to install the system, and told me not to worry about a thing and he would handle it all. They installed it within 2 hours and did a great job getting it done. If you’re considering getting a RainSoft Water Treatment system, please take my advice and do it. It’s a wonderful thing to have clean water throughout the whole house!\nElizabeth", "pics": null, "resp": {"time": 1573230102645, "text": "thank you Elizabeth for your review.i will let jordan and doug know.this review means alot to them and our company."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102660720999273990660", "name": "Douglas Kennedy", "time": 1576949450385, "rating": 5.0, "text": "Been a member of the rain soft family for nearly 2 decades now. They are amazing people and I look forward to many many more years with them.", "pics": null, "resp": {"time": 1576971169269, "text": "It’s great to hear you have enjoyed Rainsoft water for some long. Thank you for your loyalty."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117329615187967490177", "name": "Sandra Wesson", "time": 1584371164249, "rating": 5.0, "text": "What a difference! Randy was so kind and informative. I had experience with a similar product before I moved to AL so I knew I needed a water system. Randy answered all my questions about RainSoft plus shared about CleanSoft for my washing machine. I took a chance and let me say WOW! I spent the weekend washing boxes full on my Marine son’s clothes and they are all fresh and ‘like-new’ again. No more teen boy grungy odor. Now I can’t wait for my AirMaster filter system to arrive this week. Clean water, Pure cleaning products, clean air...\nRandy represents the epitome of customer-service! The product speaks for itself, but the way Randy handles everything that is thrown at him speaks volumes about the care he puts into all that he does.", "pics": null, "resp": {"time": 1584401863591, "text": "Thank you Sandra for your kind review. I’m so glad the RainSoft products will help you and your family for years to come. Our service team will always be here for you.oh, please thank your son for for me for serving our country."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102433210934037157888", "name": "David Davis", "time": 1578594510200, "rating": 5.0, "text": "Love, love clean water. If I had known earlier what I know now I would have done this much earlier. Fantastic company and smooth install.  If you've gotten the system you know how true what I'm saying is. Soft skin, great hair and clean water for our cooking and drinking. If you're reading this review for information to make a decision, do it. When I read the articles about water issues in the area I am so glad I dont have to worry about any more. Thanks Martin and Randy.", "pics": null, "resp": {"time": 1579012183841, "text": "Thank you mr Davis for sharing your experience with others ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102995152038631710848", "name": "Jesyka Parker", "time": 1562084879534, "rating": 5.0, "text": "We have LOVED having our system installed. It has made such a difference in our day to day life. And the water tastes better then bottled water.\n\nThey also have a wonderful staff and Mr. Williams, the owner, was great to work with and took care of us quickly. Thank you!", "pics": null, "resp": {"time": 1562083085846, "text": "Thank you jesyka for the review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112343490207542663283", "name": "Gustaf Whitt", "time": 1585874865512, "rating": 5.0, "text": "Jordan was very informative. He explained everything so well and showed us exactly what was wrong with our water.\nIt seemed expensive but when explained comparitvely to all the products we buy, it is a great deal and a real health benefits.", "pics": null, "resp": {"time": 1589481978099, "text": "thank you gustaf for your rating and review. jordan will appreciate the kind words as well.having good water is priceless."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109391463005605210081", "name": "Cameron Filyaw", "time": 1576984141962, "rating": 5.0, "text": "Rainsoft has been great for me and everyone in my household. Customer service is great, quick and easy installment for such an amazing product. Couldn’t ask for a better product!", "pics": null, "resp": {"time": 1577059483920, "text": "Thank you Cameron for your kind review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "104434364953595767061", "name": "Paul Holt", "time": 1580143402567, "rating": 1.0, "text": "I ask Randy from Rain Soft to come to my house and give an estimate on installing a water filtration system. He ask for me and my wife both to be present for the water testing. After his spill of testing and telling us how horrible our water was he started his sales pitch on detergents. He offers 5 years of cleaning solutions at 9% interest. I stopped Randy and apologized in case my intentions were miss understood on the phone call. I told Randy we were not interested in the detergents and only was looking for a water filtration system. His response was defensive in he stated, \"your wife already said she wanted to use more environmental friendly detergents.\" The he stated that the money we save buying detergents at the grocery store would pay for the system. He tried to divide me and my wife and our decision. Very horrible customer service. I ask Randy what the system would cost without the detergents to which he replied your wasting your time without getting the detergents. I ask again the cost and he quoted 4599, his words, \"your only saving 500 dollars.\" Randy is a very pushy sales man and thinks he can shame you into buying his 5000 dollar soaps. Randy continued his bad sales pitch when he later called me. I told Randy we were not going to buy his system and that I was not interested in the detergents. He stated I was wasting my time trying to buy a system at Lowes or Home Depot and all of those other systems were \"junk.\" Randy will try and talk to you like you are ignorant and use his hi pressure sales push to try and force his detergents on you. If you want an hour long sales pitch on detergents and how you can cover the cost of the system at 9% interest then this is your man. I do not understand how a salesman thinks it appropriate to talk down to you and expect you to buy his product. I will also be contacting Rain Soft to express my frustration with the local branch.\nLess", "pics": null, "resp": {"time": 1580146189660, "text": "my sincere apologizes for not being able to explain the soap program correctly.I would not intently talk down to you.I wish you nothing but the best in your search to get good water for you and your family."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106126354004231230517", "name": "Michael Gumataotao", "time": 1554937416044, "rating": 5.0, "text": "Randy and team are fantastic!  I've had my system for several years now and from the initial install to the annual maintenance that they do, my system continues to serve me well.  They always remind me when services are due, then send great techs out to do the service who take the time to explain everything they are doing and provide me with the 'what' and 'when' so I will know what items are important to track and the time between filter changes and services.  I would highly recommend not just the system, but the entire Huntsville RainSoft team to all of my friends and associates.  Living in Huntsville/Madison area, the quality of the water was concerning based on all of the horror stories and I'm completely confident that with RainSoft I am drinking quality water that tastes better than any bottled water I've had.", "pics": null, "resp": {"time": 1555022295141, "text": "Thank you Michael for taking the time to share a review . We will always give 100% effort to making you and our customers happy"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102099372441685831239", "name": "jennifer hendrix", "time": 1572364088036, "rating": 5.0, "text": "So far I love my rainsoft system... and the people who installed it where amazing Richard and William have 10 stars if I could give them 20 I would....", "pics": null, "resp": {"time": 1572368990140, "text": "thank you jennifer for your review.i will let richard and will know about the review. it does mean alot to them and our company."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109924048582874929870", "name": "Tonya Galusha", "time": 1581799615994, "rating": 4.0, "text": "Jordan did an awesome job showing us how the system would work and what is really in our water. He is very enthusiastic and informative.", "pics": null, "resp": {"time": 1581803513073, "text": "Thank you tonya for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "110042730749201151331", "name": "Ronald Johnson", "time": 1555266133106, "rating": 5.0, "text": "Fantastic system, Fantastic service. We got two quotes for a water softener system and went with Rainsoft even though it was a bit more expensive. We knew that the cheaper option was an inferior product and we wanted the best system for our home. Having a softener is like having HDTV - you might not think you need it, but once you have it you can’t go back. Laundry is soft, hair is soft, skin is smoother and more comfortable, etc..  The installation team brought everything they needed, did everything quickly and professionally. Even told me not to worry about the garage shelves that needed to be moved. Finally, when I didn’t receive the cleaning products, I talked with Randy and received the complete package in a few days. Outstanding customer service and professionalism from start to finish. Best part, our water is great!", "pics": null, "resp": {"time": 1555341278790, "text": "Thank you Ronald for the kind review. We will provide you with outstanding service ."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103727594251363831873", "name": "Robert Ciccolella", "time": 1605805206063, "rating": 5.0, "text": "Excellent installation and service.", "pics": null, "resp": {"time": 1605872494165, "text": "Thank you Robert for your review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113991366896222945865", "name": "Marilyn Bolyard", "time": 1506701013340, "rating": 5.0, "text": "This is the best investment I have ever made for my home. Absolutely amazing people to deal with from sale, through installation and customer service! Not only does my water taste great, after 3 years I don't have calcium build up or rust anywhere. Makes cleaning so much easier. Thank you Randy and team. Job well done!", "pics": null, "resp": null, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "101381540585147165844", "name": "Laurel Art", "time": 1569090798732, "rating": 5.0, "text": "Jordan is great! Very professional presentation. We look forward to years of Rainsoft. Thank you!", "pics": null, "resp": {"time": 1569109144257, "text": "Thank you mr schoolar for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "118096152458727421219", "name": "Devin Trowbridge", "time": 1559697078401, "rating": 2.0, "text": "Disclaimer: I do not have any RainSoft products and can't recommend the system itself one way or the other.\n\nI did however have one of their salespeople come to my home and do a water test. The test took about 2 hours versus the 1 we were told, and ended with the salesperson storming out, visibly angry with my wife and I for not buying the $8k system on the spot. Apparently we are irresponsible parents for prioritizing bringing our home up to electrical code instead of buying a water filter. He also tried to convince us that it was ridiculous we couldn't afford the monthly payment for 6 years.\n\nOtherwise seemed like a nice product that I'd like one day, but I don't know that I'd buy from here if this is how they treat customers.", "pics": null, "resp": {"time": 1559697929089, "text": "Please accept my apologies for any disrespect to you or your family."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102407275082279807352", "name": "Robin Stafford", "time": 1525522654664, "rating": 5.0, "text": "We love the water system! For 13 years we have battled with my son's exzema, countless amounts of creams and lotions and nothing seemed to help it, but after just a week of having the rain soft system his skin is finally clearing up! Better tasting water, skin and hair feels better, Well worth the money spent for a lifetime! Amazing system and great customer service from the salesman.", "pics": null, "resp": {"time": 1525702148697, "text": "Robin, Thank you for the kind review.I am confident you will get many years of great benefit from the RainSoft system.We will always be here for you."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116198473697266131593", "name": "Linda Heggem", "time": 1547644900964, "rating": 5.0, "text": "This company is upstanding in every way - from the presentation to the installation. We noticed an immediate improvement in our water condition. After three weeks on the system, our daughter developed some allergic skin irritations. When we explained to customer service what was happening, they diagnosed the problem, called corporate for confirmation and any additional input, and resolved the issue within 4 hours by flushing the whole system and changing the type of salt product. Allergic symptoms cleared with the very next usage. This is a company that is interested in the well-being of each customer, and is willing to go above and beyond to ensure satisfaction.", "pics": null, "resp": {"time": 1547651438450, "text": "thank you linda for the review.im so happy your able to enjoy good water"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100793422625381931963", "name": "Diane Rovere", "time": 1536525651053, "rating": 5.0, "text": "We have talked about getting a water filtration system for years and just never did until last week.  RainSoft totally exceeded all of our expectations!  The water is so smooth and tastes great!  My husband immediately noticed a better taste with his morning coffee.  Our skin is so much softer.  We no longer need to use conditioner on our hair.  We can't say enough about how great the water is!  We are a custom home builder and will definitely be referring all of our customers to RainSoft.  Anyone considering getting a water filtration system should definitely call Randy at RainSoft.    -- Mark & Diane Rovere, Action Builders Inc.", "pics": null, "resp": {"time": 1536541432455, "text": "Thank you mark & diane for the review.I know the rainsoft equipment will serve you for years."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107833686313926351460", "name": "Matthew George", "time": 1581799532882, "rating": 5.0, "text": "Jordan was very authentic and great at explaining everything! Jordan is a keeper and will go far beyond the call of duty to help both the Company and the Customers.", "pics": null, "resp": {"time": 1581803466178, "text": "Thank you Matthew for sharing your experience"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112709918212229051702", "name": "Paula Dickerhoff", "time": 1571845096755, "rating": 1.0, "text": "RainSoft got our name through Home Depot. Apparently they are connected, and they cold call you. Not cool. This was a product that there was no way that we were going to buy immediately but would possibly consider in the long term. They try to rope you in by saying you will save money on your cleaning products because they are roped in with another company called Pure Selects. They will sell you $8,000 worth of soaps for in the neighborhood of $350. I do not spend $800 a year on soap, let alone $8000. I doubt I spend $350, we are only two people. They said we would get a $20 Home Depot gift card, which we actually have to fill out a card and mail (and put a stamp on). They try to scare you with cancer and non-alkaline water and the Tennessee River. They test your water and you can see the minerals get solid, oh my..... The man who came to our house was nice and professional but I can see where people could easily feel pressured to purchase something that they do not need. He did not have any literature to leave us except for the \"SOAP SURVEY\", which I thought was odd and suspicious. Their interest rate is 9%, which they gloss over unless you ask them pointedly the question on the interest rate. They just try to tell you the monthly payments which seem reasonable until you do the math. I'm sure the product is good, though WAY overpriced. It just really bothers me that they give you no literature to try and make a decision later and they call you and talk you into them coming for a 30 minute water test. He was here about an hour and a half. They want you to buy it on the spot. It is thousands of dollars.  Also, when I googled this company along with Home Depot, there are law suits that people felt pressured into purchasing the system......I did like the way the water tasted, and it could be in my long term plan to get something like this, but I don't feel they were professional in the way the got into my house and try to scare you about the water in our area.", "pics": null, "resp": {"time": 1571873786544, "text": "Thank you for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111974323940115123188", "name": "Matt Mangum", "time": 1581384811109, "rating": 5.0, "text": "Jordan was a great guy! Enjoyed the presentation, love the product!", "pics": null, "resp": {"time": 1581388429288, "text": "Thank you Matt for sharing"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117281990890440408640", "name": "debbie bainbridge", "time": 1526489796185, "rating": 5.0, "text": "Randy Williams was my sales associate and was extremely professional.\nRichard and Adam were my installers and were excellent.\nThe experience as a whole was excellent, and I would absolutely recommend RainSoft to my friends and family.", "pics": null, "resp": {"time": 1526585598102, "text": "Thank you Debbie for your review. You will enjoy the RainSoft water for years to come!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "107362228154673194920", "name": "Wendy Embrey", "time": 1474397029240, "rating": 5.0, "text": "I love my Rainsoft water softener.  I have been a customer for 21 years and have recently upgraded to the new EC4 unit.  I couldn't be happier.  I love how it makes my skin feel.  I love how it cleans my clothes better!!  Tastes great too!!!", "pics": null, "resp": {"time": 1488293098456, "text": "we appreciate your loyalty to us! we will always be here for you and all of our customers."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112869680600831251400", "name": "Kenneth Hughes", "time": 1474902305333, "rating": 5.0, "text": "Awesome group! They are very professional and knowledgeable of their product. They provided prompt installation and setup and I can verify their post sale support is fantastic! I highly recommend their systems and that you purchase from them directly as apposed to an indirect channel!", "pics": null, "resp": {"time": 1488292923555, "text": "we do appreciate your kind review! we will always give our best effort in making customers happy!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115974991852088455794", "name": "Mike Thomas", "time": 1474558039043, "rating": 5.0, "text": "I love, love the system. My wife's hair is so much more healthy and shiney she can't believe it. I love that that annoying shower door film is gone and of course all of our skin is less dry. The water taste great and is better for us. Should have done this when I first moved here.", "pics": null, "resp": {"time": 1488293001742, "text": "thank you for taking the time to tell us your experience with us!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "102205286366934020783", "name": "Richard Burgess", "time": 1475599472187, "rating": 5.0, "text": "Amazing product, awesome staff, and great customer service. Once you make the commitment of going with a RainSoft whole home system, there is no going back. High quality drinking water, top of the line air purifucation, and the peace of mind in knowing what my family is bathing in and consuming. Would not have it any other way.", "pics": null, "resp": {"time": 1488292813406, "text": "thank you for your review! enjoy your water and airmaster dfs!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "103191816017811685097", "name": "Doug Petty", "time": 1491850236187, "rating": 5.0, "text": "My experience using Rainsoft water has been nothing short of amazing!! It is so incredible to me that something as simple as utilizing clean pure water can have such a huge impact on one's quality of life. For example, no more itchy skin, don't even have to use lotion or hair conditioner, shower walls stay much cleaner, laundry is much cleaner, tea/coffee/food tastes much better. I also got the Alkaline drinking water filter with my package and have noticed my energy levels have increased dramatically, sleeping much better, my pollen allergies have all but disappeared, my acid reflux has gone away, and I've even lost a few pounds. I just feel so much better physically it's like a dream come true. This water has been a huge blessing in my life and I highly recommend it to everyone!!", "pics": null, "resp": {"time": 1589814909883, "text": "thank you doug for your review and rating.your opinion of us is very important."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106027553289759700922", "name": "Jennifer Hill", "time": 1473958684796, "rating": 5.0, "text": "We have had our water purification system for over a year now and I honestly have no idea how we ever lived without it! It's like being at a spa when I'm taking a shower. The water is so soft and pure. My hair is in the best condition it's ever been in and so is my skin! Drinking any other kind of water now makes me cringe because I think of what is NOT getting purified like with my system. I'll have this system for the rest of my life!", "pics": null, "resp": {"time": 1488293180818, "text": "thank you for your review! we will be here for you if ever needed."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "105196480092401543702", "name": "Stuart Clark", "time": 1531676289255, "rating": 5.0, "text": "Martin came over to our house to do a free water test.  I tasted the water that came from the filter he had used on our kitchen sink.  So much better tasting.  I used to drink our water all of the time before.  Didnt taste bad then\nNow I can't drink it anywhere else.  It just taste awful.  And to mention taking a shower feels like luxury.  Thanks so much for the Rain soft crew for everything y'all have done for us. It has made a big difference in our lives.  .", "pics": null, "resp": {"time": 1531683842016, "text": "Thank you Stuart for the kind review! I believe you will enjoy RainSoft for years to come."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106046004185453992244", "name": "kenyata Wiggins", "time": 1561299635632, "rating": 4.0, "text": "Jordan was an awesome salesperson and we plan on purchasing the system soon!", "pics": null, "resp": {"time": 1561311593662, "text": "Thank you Kenyatta for your review. We look forward to providing you and your family good water. I will pass the good words to Jordan."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112581382116213962143", "name": "Fred Crow", "time": 1504914934581, "rating": 5.0, "text": "Fantastic water systems sold by friendly people! I couldn't believe what a difference it made. Highly recommended!", "pics": null, "resp": {"time": 1589814785702, "text": "thank you fred for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111494271215838577979", "name": "Phyllis Jones", "time": 1553115737047, "rating": 5.0, "text": "We are so thrilled with our water filtration system from Rainsoft of Huntsville and wish we had done this years ago!! To have pure water in our home and alkaline water to drink and cook with is better than we could have imagined. Doug Petty has been a real pleasure to work with and we now consider him a friend. He has been professional, kind and very informative!\nWe share our excitement of our pure water with friends and family and because 6 of our referrals also purchased a system for their homes, Rainsoft paid our system off AND even reimbursed us for what we had paid!! Beyond pleased with company! You can't go wrong with Rainsoft of Huntsville.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTDJdeMg_w8zpW-jP7P8Vjo4gYzElieB64Lv2D=w150-h150-k-no-p"]}], "resp": {"time": 1553123535755, "text": "Thank you Phyllis for your kind review. Thank you also for the referrals you have given . I know everyone will enjoy RainSoft for years to come . We will always be here for you"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "109107281949417000084", "name": "S T", "time": 1535620433462, "rating": 5.0, "text": "WOULD USE AGAIN; DEFINITELY RECOMMEND! Randy was quick to return our call and schedule an appointment to discuss products. We've used Rainsoft before, and already knew we needed a whole house water softener and filter for our new house, but wanted best deal. Randy took off ~$1900 for the entire system and installed it the next day! The other guys were overpriced and needed two weeks to get all the parts in. Plus the new Rainsoft system monitors the water quality and regenerates the system as needed. Win; win!", "pics": null, "resp": {"time": 1534084947635, "text": "We’re so glad to have earned your trust in us.we hope to serve you well for years to come"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "113583918273054131601", "name": "Alfred Malone", "time": 1496938452238, "rating": 5.0, "text": "We had the whole water filtration system installed along with the alkalinizing system and the ozone system for our washing machine. The drinking water tastes better than bottle water. The ozone system (without laundry detergent) actually not only cleaned our clothes, but had them smelling really fresh. I would recommend that anybody building a house consider rainsoft it is well worth the money. The staff is awesome and very professional.", "pics": null, "resp": {"time": 1589814850539, "text": "thank you alfred for your review and rating."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "112593418680778032540", "name": "John Cox", "time": 1489256470877, "rating": 5.0, "text": "Awesome system and awesome peo l email! Richard did a great job on the install, and Dan was a fantastic sales rep.", "pics": null, "resp": {"time": 1589814963671, "text": "thank you john for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115149769757803697797", "name": "Charles Clark", "time": 1572715858029, "rating": 1.0, "text": "Absolutely terrible customer service. Technician never showed up to the house, and then was yelled at and called a liar by the customer service rep.", "pics": null, "resp": {"time": 1572822464751, "text": "Charles, my apologies for your experience. Customer service is very important to us. I will look into this and take the appropriate actions."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "118198602273423095430", "name": "Matt Mitchell", "time": 1532821742899, "rating": 5.0, "text": "A few months ago I had the pleasure of having a gentleman named Doug Kennedy come and work on my system. Rainsoft, you should consider it a privilege having that man work for you.", "pics": null, "resp": {"time": 1532832486374, "text": "Thank you for the review. Doug kennedy is an asset to our company."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "111430922116888577354", "name": "Alura G", "time": 1547072104523, "rating": 5.0, "text": "UPDATE: Randy, the owner at Rainsoft of Huntsville reached out to me on the initial review and asked me to call him. I did, and after a brief talk, he agreed to stand by what the salesperson had originally told us, and move the softener for free. The two gentlemen that came out to disconnect and reconnect the system, Doug and his assistant, were very polite and knowledgeable. I sincerely appreciate that Randy stood by the salesperson's word (who I will add is also no longer with the company), because I know that businesses can't just go by what customers claim.\nI think my husband and I have learned a lesson out of this to ALWAYS get promises in writing. Thank you Randy, and the team at Rainsoft for fixing this.\n\nOriginal post:\nAs a longtime customer (5 years now I think?) to one of their \"top of the line\" softeners, they tried to upsell us a newer version when we had a little valve go out on ours. Luckily we got the valve replaced and saved thousands of dollars by resisting an unnecessary sell.\nNow that it's time to move, I called the Huntsville distributor the other day requesting a move and they said it'll be $699 for \"disconnection\"...I told the lady that the man that sold us our softener years ago told us that the product comes with a FREE move that does NOT expire. The rep apparently pulled up our contract on the phone and said that that's not even mentioned in our contract, and even if it were, they only honor one year out moves.\nI messaged this very page a few days ago one more question (if we disconnected the softener ourselves, would the move and reconnection be less since the rep specifically said the fee is for disconnection.\nIt has been a few days and still no answer.\n\nTo sum it up, this company LIES, they are *extremely* pushy sales people and also try to sell unnecessarily to the customer, and their CS on social media is non-existent in my experience. Longtime customers doesn't seem to make a difference to these crooks.", "pics": null, "resp": {"time": 1546483254326, "text": "All customers make a difference to me and the team .im not clear on how you got your valve replaced and saved thousands of dollars.i wish you did have that free move in writing cause we would sure honor it.your numbers just do t add up first of all. We don’t charge $699 to disconnect. We do charge a fair price so that we can maintain a service department and have quality personnel for our customers.i would be more than happy to discuss your situation with you and come up with a plan that’s suitable for you . Just call my office and ask for randy . Thank you for being a valued customer."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115341424443815165799", "name": "Jason Tew", "time": 1570186342242, "rating": 3.0, "text": "Called, and they were very helpful over the phone.", "pics": null, "resp": {"time": 1570189037457, "text": "Thank you Jason for taking the time to give us a review. You are a valued customer."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117956995124790466549", "name": "Samantha Taylor", "time": 1491835179610, "rating": 5.0, "text": "My husband and I had Doug from Rainsoft come to our home and do a \"water demonstration\" for us to show us the quality of our water and what could possibly be improved. We had always assumed that our water was good because it tasted fine. We were wrong! Doug was able to show us every little speck that was in our tap water which turned out to look like tiny pieces of sediment rock. He was fantastic in demonstrating what our water should look like and explained the health benefits associated with the rainsoft system. After his presentation, we were convinced that we definitely wanted their rainsoft system in our home, not only for the two of us but for our dog as well and for our future children one day. What a difference it has made in our lives already! We've only had the filter system for a few days but we have already noticed a significant difference in the cleanliness of our water as well as the overall effect that it has had on the cleanliness of our home (using the new water: our laundry is cleaner, our floors are cleaner, and our bodies are cleaner!). We just LOVE it. Most definitely a worthwhile investment. Doug was so kind and helpful and answered every question that we had. You will not be disappointed with this system!", "pics": null, "resp": {"time": 1589814938973, "text": "thank you samantha for your review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "100837955158521647938", "name": "Barb", "time": 1498160627851, "rating": 5.0, "text": "Richard and Adam installed our new Rainsoft whole house and RO filter.\nCould not have asked for better service.  What outstanding installers!!", "pics": null, "resp": {"time": 1589814810986, "text": "thank you barb for your review"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "115596213634294385948", "name": "Sharon Edwards", "time": 1515779582243, "rating": 5.0, "text": "For over 15 years we enjoyed our Rainsoft whole house water treatment system & our reverse osmosis unit in our home.  When we recently purchased our new home, we knew that we wanted a new Rainsoft system in it because it is the best!  Randy assisted us with determining the type of RO system that was best for us.  Installation was very quick.  Doug installed the RO system the next day & the whole house water conditioning system was installed the day after by Richard  & Adam.   They were all professional, knowledgeable,  personable & polite.  You can't get any better in customer service!  Response time to my calls were VERY quick.  Thank you Randy, Doug, Richard & Adam for your superior service!", "pics": null, "resp": {"time": 1580146234790, "text": "Thank you sharon for sharing your experience for others to view."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "114649051474333469667", "name": "Austin Green", "time": 1533408179082, "rating": 5.0, "text": "Great people to work with  awesome customer service", "pics": null, "resp": {"time": 1533412388757, "text": "Thank you Austin for the kind review!"}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "117430815651264998799", "name": "Goom Goom (Goom49)", "time": 1566681885630, "rating": 5.0, "text": "Had the whole house system for a few years and couldn't live without it now.", "pics": null, "resp": {"time": 1566688927700, "text": "Thank you for your kind review."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "118268456220772566278", "name": "tracy withrow", "time": 1530220851365, "rating": 1.0, "text": "Water tastes great, but install was a nightmare. They were supposed to install it on Sat. They pushed the installation back several times and ended up partially installing it on Sun a week later. He broke our sump pump line,  left a trench in the yard, and said he would be back on Mon. Now it’s Thurs, and nothing was done. It’s raining and our broken sump pump line is pumping water back into our storm shelter through the holes that were drilled into our wall that we had waterproofed a year ago. The nice lady that answered the phone sent the same plumber back out and it took him an hour and a half to make a 40 min trip. Meanwhile I am carrying buckets of water out of the shelter, because when the shelter floods, it floods the office, laundry and bedroom downstairs. Plumber shows up and gives me a hokey story about thinking someone else took care of it. Meanwhile, my husband is talking with the owner, and the owner’s words were ‘ I’m not going to f**king argue with you....”.  Unprofessional. Find another company.", "pics": null, "resp": {"time": 1530394423657, "text": "We are sorry for this experience. We’re also glad we were able to get there as soon as possible and rectify the issue. All of our employees take your concerns seriously .we will always give our best effort to our customers . We hope to earn back your trust in the future."}, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "106333702739105283362", "name": "Veannabrett Ramsey", "time": 1515111590175, "rating": 1.0, "text": "SCAM", "pics": null, "resp": null, "gmap_id": "0x88626b904c6ccfd3:0x5e8eb5ae05b0c887"}
{"user_id": "116135352979615994394", "name": "Jenn Lewis", "time": 1599756858762, "rating": 5.0, "text": "Hardworking group of guys!", "pics": null, "resp": null, "gmap_id": "0x888879a37d2035d3:0xdb43b93c29819401"}
{"user_id": "104841481347701386708", "name": "Brighton Bears1977", "time": 1410379262393, "rating": 5.0, "text": "Very clean & organized & very friendly", "pics": null, "resp": null, "gmap_id": "0x888879a37d2035d3:0xdb43b93c29819401"}
{"user_id": "116580418471607568190", "name": "Roger Head", "time": 1532476439812, "rating": 2.0, "text": "Not a good place to work.", "pics": null, "resp": null, "gmap_id": "0x888879a37d2035d3:0xdb43b93c29819401"}
{"user_id": "105723918005414036959", "name": "Ginger Baldwin", "time": 1624895530480, "rating": 5.0, "text": "Updated 06282021 - still the greatest!!!\nOur delivery guy, Le'Von, is the absolute greatest. He is always friendly and very helpful. My staff and I appreciate being able to have Kentwood water in our office. Keep up the good work!!!", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "104127327158581250254", "name": "Betty Ramos", "time": 1603739821839, "rating": 5.0, "text": "Our delivery guy really is the best. We have no complaints. This is a very convenient service.", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "109621561532351414581", "name": "Alli Flowers", "time": 1604086975218, "rating": 5.0, "text": "Frank has been bringing me water for years. So reliable.", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "109338762932304711684", "name": "L Murr", "time": 1594848594529, "rating": 1.0, "text": "Our delivery guy was awesome.  Customer service is horrible.  Try to cancel your account...IMPOSSIBLE.  their customer serve phone number is a total joke.", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "107579355156920207950", "name": "Lisa Fox", "time": 1614368970778, "rating": 5.0, "text": "Love the products and services", "pics": null, "resp": {"time": 1614465332410, "text": "Hello Valued Customer,\nThank you for the kind words, Lisa! We're so glad to receive the positive feedback.\nKind regards,\nPrescilla S."}, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "112480649930534445766", "name": "Brenda Bryant", "time": 1589833429896, "rating": 5.0, "text": "Great products and great customer service from service center to our delivery guy!", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "104514123654161240436", "name": "Jared Freye", "time": 1548592537401, "rating": 5.0, "text": "So easy to work with and never misses a delivery.", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "115061746098793953411", "name": "Andy Tubertini", "time": 1564505268269, "rating": 1.0, "text": "Water cooler never cooled water. Cooler changed out several times and it never did work, however, we were billed and had to pay.", "pics": null, "resp": null, "gmap_id": "0x889a4c8f3dcb448f:0x9fa72407b022f5f0"}
{"user_id": "101830776166903575991", "name": "Tom Sigg", "time": 1627395167164, "rating": 5.0, "text": "Fast unload load time. Took only an hour.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109959898700032897135", "name": "David Riddle", "time": 1621358621741, "rating": 1.0, "text": "Requested water delivery and received the following email.\n\nYour delivery request has been received. Someone will contact you shortly.\n\nThank you!\nThe Crystal Mountain Water Team\n\n27 days later and no response.", "pics": null, "resp": {"time": 1621434945341, "text": "Hey David,\nThank you for bringing to our attention that we have a problem with that feature on our website!  We would love to have your business please give us a call at 256-922-1114 or H2Oinfo@crystalmtnwater.com"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "113043117462598329929", "name": "R Trev", "time": 1615235631066, "rating": 4.0, "text": "After having many problems with Crystal Springs we signed up with Crystal Mountain and have been very pleased. The purified water tastes nice and customer service is efficient with great southern charm.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "110452765338849326426", "name": "Becca Sadriyev", "time": 1575995982106, "rating": 5.0, "text": "Amazing customer service from this Company. After a disappointing end to service with another company, this one stepped up and has been a blessing to work with. Highly recommended.", "pics": null, "resp": {"time": 1575927765076, "text": "Hey Becca! Please call our office at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "105601092823382899743", "name": "Paul Burns", "time": 1538758922920, "rating": 3.0, "text": "I've had two accounts for many years.  I think it's been around 9 years.  Have one account at work, and had one account at home.  I had to cancel the home account because the delivery schedule changed almost every month.  I would get random deliveries, or not get a delivery at all.  Sometimes my empty bottles would sit outside for a month.  I just couldn't keep storing empties until I hit the delivery lottery.  My work account has been great, though.  And the customer service has been pretty good.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "101818726358864003325", "name": "Mike S", "time": 1575917816880, "rating": 1.0, "text": "Been out of water for a week now. We have called twice and they said they would be out the next day and never show up. Now when you call they go straight to voicemail.", "pics": null, "resp": {"time": 1575921605031, "text": "Hey Mike ! Please give our office a call at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "116291234765140819717", "name": "Georgia Benford", "time": 1565513010104, "rating": 5.0, "text": "Water is like drinking figi and that's great for me so smooth", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "106582216621092552488", "name": "Jon Owings", "time": 1520862963183, "rating": 5.0, "text": "used them for home delivery almost 20 years, rare misdeliveries which are quickly corrected, essentially good service and product.  My experience has been good overall.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109946469646131369499", "name": "Regina League", "time": 1527605505933, "rating": 2.0, "text": "My office has been a customer for over a year now. In the last few months their customer service has declined drastically.  As of today we have waited 1 week for our delivery of distilled water.  Something to make things easier for us, has turned out to be just as difficult has our making a trip to the market for water ourselves. Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "112817813134674707628", "name": "eli williams", "time": 1340876052243, "rating": 2.0, "text": "I am a 53 ft tractor trailer driver and this place is one of the worse getting into.  Do not try to enter from Madison Pike try Governors.  Once inside industrial park, watch for low hanging trees, branches, etc. Bldg 7 is in the very rear. Horrible location for 53ft tractor trailer deliveries.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "115929849669038795983", "name": "I FULLENWIDER", "time": 1554917225316, "rating": 3.0, "text": "Their products are very  expensive", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1602009185481, "rating": 5.0, "text": "Very nice company and good water product options!!!", "pics": null, "resp": null, "gmap_id": "0x8889f8d67e5e64d1:0xaafcb30e05b81aa4"}
{"user_id": "103668623838176466093", "name": "Doug Schroeder", "time": 1544937778461, "rating": 5.0, "text": "Great service and great water!", "pics": null, "resp": null, "gmap_id": "0x8889f8d67e5e64d1:0xaafcb30e05b81aa4"}
{"user_id": "106708779202925730278", "name": "Carolyn Dietrich", "time": 1465479795571, "rating": 5.0, "text": "Jim Durden, who we fondly call \"Water Boy\" is an amazing person to know at Uniquely Water.  I have known him for years and knew that he took care of many businesses around town, so we decided to hire him to install a water filtration system in my real estate office.  All I can say is I wish I had done it years earlier!  Best drink of water EVER!  Jim was professional, informative and efficient.  We will never go anywhere else and are so happy to be able to offer our clients fresh cool water or hot water for tea and hot chocolate.  Thank you Jim Durden of Uniquely Water for everything you do. You are simply the best in town!", "pics": null, "resp": null, "gmap_id": "0x8889f8d67e5e64d1:0xaafcb30e05b81aa4"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1456232979331, "rating": 5.0, "text": "We have UW's filtered water coolers both at our office and home. We will never go back to the 5 gallon jug again! Convenient, eco friendly and tastes great!", "pics": null, "resp": null, "gmap_id": "0x8889f8d67e5e64d1:0xaafcb30e05b81aa4"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1299772446431, "rating": 5.0, "text": "I  used this water service as a reminder to some of Real Estate agencies that i appreciate their referrals to my Home Inspection business and got very favorable results and lots of good water", "pics": null, "resp": null, "gmap_id": "0x8889f8d67e5e64d1:0xaafcb30e05b81aa4"}
{"user_id": "104679082656021647590", "name": "Tina Parker", "time": 1309987941712, "rating": 5.0, "text": "I had it installed at my office and my house, much better than bottled water in taste, price and convenience.  I use it for all my cooking and drinking water.", "pics": null, "resp": null, "gmap_id": "0x8889f8d67e5e64d1:0xaafcb30e05b81aa4"}
{"user_id": "103483677145128407356", "name": "Karen Brian", "time": 1623065805383, "rating": 5.0, "text": "Culligan of Mobile went out of their way to sanitize my house's plumbing system after a water test showed positive for Mycobacterium Avium. They also placed an ultraviolet system on my main water supply. Subsequent tests have come back negative for the bacteria. They are life-savers. I can't thank them enough for all their help and consideration. They are truly professionals and extremely knowledgeable in this area. Kudos to you Culligan!", "pics": null, "resp": null, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "111245482471376884271", "name": "Toya Coverson", "time": 1617909629339, "rating": 5.0, "text": "They have delicious clean tasting water. Excellent customer service and contact free delivery. Just put the bottles by the front door and they replace them. I don't have a lot of strength,  so I opted for the 3 gallon bottles and the bottom feeder dispenser. Very stylish and simple to use", "pics": null, "resp": {"time": 1617913542214, "text": "Hi Toya, thank you so much for taking the time to write a review on Google! I am so happy to hear that you are satisfied with our customer service and our bottled water.  The bottom loader dispensers are awesome because you don't have to lift those heavy bottles! We appreciate your business with us and hope you have a great weekend!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "113050514230884928875", "name": "MJ Chamblin", "time": 1619315663130, "rating": 5.0, "text": "Great price for great tasting water! They were super helpful when I signed up for delivery and always deliver on time.", "pics": null, "resp": null, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "104224417313701508256", "name": "Rupert Ward,Jr.", "time": 1612916759411, "rating": 5.0, "text": "PMS is on point that brings great water throughout my whole home. Investing in Culligan has been the best and thank you for keeping safety 1st....#ALREADY!!", "pics": null, "resp": {"time": 1612969370835, "text": "Hello Rupert! Thank you so much for positive review on Google! We are so pleased to hear that you are happy with our service and that you now have great water in your home! We strive here for great service and the safety of our customers and employees always. We appreciate your business with us and hope you have a great rest of your week!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "108250310435960305660", "name": "Pia Lee", "time": 1605291713672, "rating": 5.0, "text": "Getting great water delivered right to your home is such a great convenience. Getting it from a great company like Culligan is amazing. Customer service is spot on, always friendly, always prompt.  My delivery man is courteous and professional.  We drink a lot of water in our house, Culligan makes is affordable and earth friendly.", "pics": null, "resp": {"time": 1605301651623, "text": "Hi Pia! Thank you so much for taking the time to write this amazing review! I would love to share this on our Facebook page, if that is OK with you.  We truly appreciate you explaining your positive experience with Culligan. Thanks again, and hope you have a fantastic weekend!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "102458240811135885863", "name": "Tosha Capell", "time": 1622735993063, "rating": 1.0, "text": "I called on a Monday and set up new services I was told that by Tuesday no later than Wednesday I would have my bottles. Here it is today is Thursday and I’m being told they are too busy I can leave a message. Well I the message I left was to cancel my order.  Their customer service is horrible.", "pics": null, "resp": null, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "113508620727492456500", "name": "Emily Chinal", "time": 1591727985652, "rating": 5.0, "text": "Googled for home water delivery of spring water. Found them and they deliver to my remote area. Great customer service and auto pay available. Guy delivered on the first as stated. Great tasting spring water. Awesome! Very pleased!", "pics": null, "resp": {"time": 1591801802497, "text": "Hello Emily, thank you so much for rating us on Google! We are so happy to hear that you are enjoying our Spring Water. We appreciate your business with us and hope you have a fantastic week!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "105804319939914547107", "name": "Theron Adams", "time": 1598552553948, "rating": 5.0, "text": "We've been in our house 13 years, and Culligan has been with us from the beginning. Our water is crystal clear and tastes delicious. Stop buying all the plastic bottles and save the planet. Get Culligan.", "pics": null, "resp": {"time": 1598621416323, "text": "Hello Theron, thank you so much for this wonderful review!  We are so pleased to hear that your water tastes delicious, and that you are happy with the quality of water.  Hope you have a fantastic weekend!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "110055103199450282636", "name": "Rick Hurst", "time": 1612887272873, "rating": 5.0, "text": "Excellent service!", "pics": null, "resp": {"time": 1603289841206, "text": "Hi Rick! Thank you so much for rating us 5-stars on Google. We appreciate the positive feedback and hope you have a great rest of your week!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "105249959126602916027", "name": "Janna Perry", "time": 1603220584602, "rating": 5.0, "text": "We have had water delivery for a few years now.  We love the water & have had very few problems over the years, but anytime there has been any issue, the nice people at Culligan have handled it quickly and efficiently.", "pics": null, "resp": {"time": 1584365577841, "text": "Hello Janna, thank you so much for this amazing review! We strive here at Culligan to provide our customers with the best customer experience. Thank you again so much for sharing and have a fantastic day!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "112387893588467423256", "name": "Timothy Toomey", "time": 1575387489961, "rating": 5.0, "text": "Our patients love having Culligan Water in all of our Gulf Coast waiting rooms!", "pics": null, "resp": {"time": 1575390120199, "text": "Hello Timothy! Thank you so much for sharing your experience with Culligan Water. We are so pleased to hear that your patients love our water!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "106133848310704930237", "name": "maryann jeeves", "time": 1580239021683, "rating": 5.0, "text": "Wonderful service! And great products!", "pics": null, "resp": {"time": 1580242995741, "text": "Hello Maryann, thank you so much for taking the time to rate us on Google! We appreciate the kind words and love to hear that you are happy with our service. Have a fantastic day!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "105504624165113383075", "name": "Liss", "time": 1571234881793, "rating": 5.0, "text": "Service is great! The water tastes great and the price is excellent.", "pics": null, "resp": {"time": 1571345988140, "text": "Thank you so much for sharing this review with our dealership! Along with reliable products and quality water, we take pride in providing professional, convenient and friendly service to all customers, so we're happy to hear about your positive experience. Please let us know if there's anything we can help you with in the future. Thanks again.\n\nBest,\n\nTim St. Gelais\nGeneral Manager of Culligan of Mobile\ntim.stgelais@fortwaltonculligan.com\n(850) 664-7771"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "113405731171885723336", "name": "Mel Blue", "time": 1604629992984, "rating": 5.0, "text": "Great service and customer service.", "pics": null, "resp": {"time": 1604676244087, "text": "Hello Mel! Thank you so much for providing us a review and for the kind words.  We love to hear that you are satisfied with our customer service and service work. Here at Culligan, we strive to provide our customers with great customer service and exceptional service work done by our trained technicians.  We appreciate your business with us and hope you have a fantastic weekend!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "101436267141376245566", "name": "Sammie King", "time": 1591902730981, "rating": 5.0, "text": "We love our Culligan Water and our Culligan man!", "pics": null, "resp": {"time": 1591908713344, "text": "Hi Sammie, thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a541a365dd8e3:0x28619b4a914b4417"}
{"user_id": "104042892130954484106", "name": "Shane Glasgow", "time": 1616709558971, "rating": 1.0, "text": "Water was not good, tasted like Dasani. I don't know why Micheal is running a water cartel but hes not good at it.", "pics": null, "resp": null, "gmap_id": "0x8862686b6433445f:0x7e3b9016605911a7"}
{"user_id": "100653707234397515372", "name": "Denise Kivette", "time": 1621479069797, "rating": 5.0, "text": "This water truly tastes fresh and there’s no weird after taste.  It actually has a different mouth feel.  It’s pretty much ruined other bottled water for me.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "101410489960898580370", "name": "Terry Greenslade", "time": 1622994052646, "rating": 5.0, "text": "Good water.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "101439478081742501299", "name": "Ashton Washington", "time": 1594844451300, "rating": 5.0, "text": "Best water I’ve ever had! Crisp, fresh taste especially in the heat on the football field.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "111094355297589863760", "name": "Tonya Long", "time": 1568589830939, "rating": 5.0, "text": "This is the best wayer ever! I love the  taste so much that I don't have to mix my water packets with it I can drink it plain and I never could do that with any other water. I love that is comes from the same county that I  live in and knowing the history behind it. I think that God gave us a little taste of our own living water here on earth. I love it and will not drink anything else as long as I can find or buy directly from the source.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "113669257140689827187", "name": "Derek", "time": 1528767055480, "rating": 5.0, "text": "One of the best tasting water, rivaling Evian and Fiji. I've always loved Fiji water and one of the main reason beyond taste is the label that gives you the PH level. Wish Blue Spring would provide that on the label. Overall Blue Spring water is extremely good and best part is it is local and I love supporting local businesses. Thanks for all you do Blue Spring.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "115405139517177586042", "name": "Lee Dobbs", "time": 1596862553986, "rating": 5.0, "text": "Best water I ever tasted.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "113316342126265443198", "name": "Sharky Haygood", "time": 1572157167654, "rating": 5.0, "text": "This water is the best! I wish it was more where I live.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "114174135681069418915", "name": "Curtis Chappell", "time": 1602092226563, "rating": 5.0, "text": "All natural water", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "111387074712694067739", "name": "Spencer Lacey", "time": 1568132113566, "rating": 5.0, "text": "Velvety smooth.", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
{"user_id": "100366440526055163706", "name": "Linda Nuss", "time": 1557601270345, "rating": 5.0, "text": "Best water ever!!!!", "pics": null, "resp": null, "gmap_id": "0x8889eb92459e6b05:0x50ddd4ceef9126db"}
