{"user_id": "112092392671708903445", "name": "Krista Yeager", "time": 1580930980098, "rating": 5.0, "text": "We love auto-chlor!! Pass 10+ years we have had them they have treated us so great! always on time with maintenance and when we need them. Are service guy is always so friendly and goes above and beyond.\n\nThanks from all of us at Pickett's Family Restaurant.", "pics": null, "resp": {"time": 1581007813071, "text": "Krista, We appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "103700799476745360716", "name": "Shannon Armstrong", "time": 1579237160011, "rating": 5.0, "text": "Jim is wonderful. He knows his stuff. Always answers all the questions I ask. Hope you keep him around as long as you can. He always  keeps are system running.", "pics": null, "resp": {"time": 1579891690382, "text": "Shannon, we appreciate the kind words. Jim and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Jim's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "108706793309532787599", "name": "A.J. Putman", "time": 1579204457369, "rating": 5.0, "text": "Jim is a very hard worker & he is always super friendly every time he comes in! He is definitely an asset to your company . He always checks our equipment & gets us up and running in no time ! Thanks for all your hard work Jim!", "pics": null, "resp": {"time": 1579891671811, "text": "A.J., we appreciate the kind words. Jim and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Jim's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "110211915322997301244", "name": "Blair Yarbrough", "time": 1580496477752, "rating": 5.0, "text": "Mr. Moore always has excellent customer service and knowledge of our dish machine!  My whole staff enjoys when he comes to bring more products and check our machine!", "pics": null, "resp": {"time": 1581007588032, "text": "Blair, we appreciate the kind words. Mr. Moore and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Saturn's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "115938298099411199363", "name": "Courtney Lavenant", "time": 1580489953454, "rating": 5.0, "text": "Saturn comes to our store every week and does a fantastic job!! Even reliable enough when needed help on weekends! Thanks Saturn!", "pics": null, "resp": {"time": 1581007481260, "text": "Courtney, we appreciate the kind words. Saturn and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Saturn's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "107892624184135661827", "name": "Leonard Morris", "time": 1569784686352, "rating": 5.0, "text": "Saturn has been very helpful to us. Always advising us on how to get the most out of our dishwasher. Always pleasant and professional. Glad we have him as our tech. Mgr., Little Diner", "pics": null, "resp": {"time": 1569786805167, "text": "Leonard, we appreciate the kind words. Saturn, the Decatur staff and our entire team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a supportive partner of Auto Chlor System and a fan of Saturn!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "112452911507751606470", "name": "Chelsey Phillips", "time": 1580489941774, "rating": 5.0, "text": "Saturn is always so friendly when he comes in to do his job. We love him at Cajun steamer in Huntsville!", "pics": null, "resp": {"time": 1581007464231, "text": "Chelsey, we appreciate the kind words. Saturn and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Saturn's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "118290553951510519565", "name": "Yoshi Sushi", "time": 1580842478150, "rating": 5.0, "text": "Saturn is a very hardworking man who comes in our restaurant regularly to check the dishwasher. And he always make sure we have everything that we need.", "pics": null, "resp": {"time": 1581007734458, "text": "We appreciate the kind words. Saturn and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Saturns!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "105530386366394283154", "name": "William Kent", "time": 1583350889898, "rating": 5.0, "text": "We are very pleased with AUTO CHLOR  and our service rep Saturn", "pics": null, "resp": {"time": 1583854565795, "text": "We appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "110771144252128519141", "name": "St C.", "time": 1580663867806, "rating": 5.0, "text": "Great service by Mitch. Very dependable and always a great attitude.", "pics": null, "resp": {"time": 1581007706294, "text": "We appreciate the kind words. Mitch and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Mitch's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "102663026739605586914", "name": "Cheryl Kindley", "time": 1580496067279, "rating": 5.0, "text": "The auto-Chlor guys that always get sent to my store are always so amazing", "pics": null, "resp": {"time": 1581007512225, "text": "Cheryl, we appreciate the kind words. Our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "116425171804340026700", "name": "Jess Poteete", "time": 1570229122969, "rating": 5.0, "text": "Saturn takes great care of us! We appreciate having him as our rep!!", "pics": null, "resp": {"time": 1570474069342, "text": "Jess, we appreciate the kind words. Saturn and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Saturn’s!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "113562954411723494934", "name": "Elizabeth Wilson", "time": 1581002897935, "rating": 5.0, "text": "Amazing customer service, they always go above and beyond.", "pics": null, "resp": {"time": 1581007945494, "text": "Elizabeth, We appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "103358366412222270175", "name": "Andy Perry", "time": 1580399793884, "rating": 5.0, "text": "andy from char restaurant.  best service we've ever seen.", "pics": null, "resp": {"time": 1581007377657, "text": "Andy, we appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "106287046915047671004", "name": "Annicka Handley", "time": 1581020801942, "rating": 5.0, "text": "Joey & Chris are fantastic today at Papa Murphys!!", "pics": null, "resp": null, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "111010036721573737511", "name": "andy ching", "time": 1570470816142, "rating": 5.0, "text": "A+ Services!! very friendly and knowledgeable technician.", "pics": null, "resp": {"time": 1570474018308, "text": "Andy, we appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "104488290150425805058", "name": "Tiffany Gill", "time": 1581319817481, "rating": 5.0, "text": "Mitch was awesome came out on Sunday to fix our problem in orderly fashion way", "pics": null, "resp": {"time": 1581534501541, "text": "We appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "108362079552657809605", "name": "Curtis Dunagan", "time": 1581269482944, "rating": 5.0, "text": "Jim does fantastic work.", "pics": null, "resp": {"time": 1581534510377, "text": "We appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "112309646767599632070", "name": "Tyler Ealum", "time": 1581036680352, "rating": 5.0, "text": "Great team with outstanding service!", "pics": null, "resp": null, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "107721557766294707472", "name": "Hangover James", "time": 1580501939669, "rating": 5.0, "text": "Mitch and Chris were awesome!", "pics": null, "resp": {"time": 1581007642400, "text": "James, we appreciate the kind words. Mitch, Chris and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Mitch and Chris's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "104735976679398656424", "name": "Kimberlee Doss", "time": 1580406911674, "rating": 5.0, "text": "Saturn and Chris were amazing!", "pics": null, "resp": {"time": 1580410249325, "text": "Thank you so much for your review Kimberlee!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "108971658774909554551", "name": "destiny Michelle", "time": 1580501896861, "rating": 5.0, "text": "Great job Mitch and Chris!!!", "pics": null, "resp": {"time": 1581007625911, "text": "Destiny, we appreciate the kind words. Mitch, Chris and our entire Decatur team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Mitch and Chris's!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "112801469518269924561", "name": "David Thomas", "time": 1581300299110, "rating": 5.0, "text": "Great people to work with !!!!", "pics": null, "resp": {"time": 1581534505800, "text": "We appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "108261447200154064699", "name": "Valerie Angel", "time": 1574281082479, "rating": 5.0, "text": "GREAT", "pics": null, "resp": {"time": 1576007260665, "text": "Valerie, we appreciate the kind words. Our entire Decatur team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x8862869fc290853f:0x131a3e84b83cb4b6"}
{"user_id": "104949241306341377961", "name": "gary hall", "time": 1580757428882, "rating": 5.0, "text": "Greg Melvin and Tim came to our Pizza Hut in Arab AL. and not only serviced our dish washer but also fixed a small leak that we hadn't even noticed.   They also gave us useful information about their products and put in a service order for another piece of equipment that needed to be replaced without us even having to ask.  If all of our vendors were this helpful I probably wouldn't have also many gray hairs.   Thanks again Greg and Tim.", "pics": null, "resp": {"time": 1581538797976, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102939028460491578019", "name": "Kelsey Mcdavid", "time": 1579544603447, "rating": 5.0, "text": "Greg and Tim are awesome! Very professional and courteous. I would highly recommended this company and these guys will brighten your day! I spoke with Michelle Dillard over the phone and she was very polite and professional as well. An overall great experience.", "pics": null, "resp": {"time": 1579895697461, "text": "Kelsey, We appreciate the kind words. Greg, Tim, Michelle and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg, Michelle and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114920018051702682976", "name": "cynthia phillips", "time": 1578335496995, "rating": 5.0, "text": "This company has provided nothing but great service. It is always a pleasure to see and do business with Robert, he always greets us with great customer service and a bright smile. Thanks for hiring great people like him, it  makes doing business so much easier.", "pics": null, "resp": {"time": 1578330904712, "text": "Cynthia, we appreciate the kind words. Robert and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Robert's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "108046887248125240267", "name": "Maegan Long", "time": 1580328532297, "rating": 5.0, "text": "Greg and Tim are wonderful! Everything at my store has been in such better shape since Greg has been running my route. They do an awesome job and if and problems arise they are immediately fixed. Can’t recommend them enough :)", "pics": null, "resp": {"time": 1581538839057, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111394135513393529283", "name": "Stephanie Braxton", "time": 1581020993185, "rating": 5.0, "text": "Greg was very nice and efficient. He made sure I understood my product and the upkeep of the equipment.\nPleasant Villa Retirement home appreciates you!\nStephanie", "pics": null, "resp": {"time": 1581538766559, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109909229061118779506", "name": "Sandra Upshaw", "time": 1580223255474, "rating": 5.0, "text": "This is a Late Entry. I should have been sent this in. Greg is my all time Favorite. Now you talking about someone is so sweet and always answers his phone no matter how  late when i call him. He always takes care of us.", "pics": null, "resp": {"time": 1581538936178, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114372524364278994634", "name": "Stephanie Clayton", "time": 1578851057842, "rating": 5.0, "text": "With pet boarding sanitizing food and water bowls is very important.  The Auto-Chlor System has been very reliable and does a great job!  Our service tech, Luke, is very pleasant and professional.  Customer service has always been superior.", "pics": null, "resp": {"time": 1579895144079, "text": "Stephanie, we appreciate the kind words. Luke and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Luke's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "117058106756848520683", "name": "Mason Sanders", "time": 1579643090261, "rating": 5.0, "text": "I had the pleasure of meeting Mr Robert North today and he was exceptional. The ultimate professional. Wish I could rate 10 stars.", "pics": null, "resp": {"time": 1579895978001, "text": "Mason, We appreciate the kind words. Robert and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Robert's!  We wish we could get 10 Stars as well!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114888368533817658489", "name": "Super 8 Moody AL", "time": 1579026422257, "rating": 5.0, "text": "THESE GUYS ARE AWESOME!!!! THEY COME WHEN CALLED AND TRY TO HELP WITH ANY ISSUE WE MAY HAVE. SERVICE REP. ALLEN PILKINGTON REALLY TOOK CARE OF OUR NEEDS TODAY. THANKS FROM EVERYONE HERE AT SUPER8 MOODY.", "pics": null, "resp": {"time": 1579895266230, "text": "We appreciate the kind words. Allen and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Allen's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "108688488060017153820", "name": "Tammy Cozzi", "time": 1579891928071, "rating": 5.0, "text": "Excellent service. Greg has taken care of our machine here at Sammys for years and we couldn't be more satisfied. Would recommend him to anyone.", "pics": null, "resp": {"time": 1579896195548, "text": "Tammy, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "103467977320999225107", "name": "Skyla McCray", "time": 1581628137287, "rating": 5.0, "text": "I’m the general manager from Pizza Hut Bessemer, morgan road.  Greg came and got us all fixed up quick fast and in a hurry.  I appreciate the sense of urgency.   Thanks Greg!!!!!! We appreciate it.", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "115515279768674636521", "name": "Stephanie Guthrie", "time": 1581096980163, "rating": 5.0, "text": "Marshall Manor we really enjoy our Auto Chlor dishwasher.  Michelle Dillard is always courteous and professional. Highly recommended", "pics": null, "resp": {"time": 1581538776546, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109987487447946559764", "name": "Johnny Chen", "time": 1580230275835, "rating": 5.0, "text": "Auto chlor is a great company to do business with. Really appreciate their service. Michelle does a wonderful job!!", "pics": null, "resp": {"time": 1581538879044, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "100255731379905704740", "name": "Tracy Marks", "time": 1579118419596, "rating": 5.0, "text": "Greg and Tim were very helpful and informative. Excellent customer service. Highly recommended....", "pics": null, "resp": {"time": 1579895350874, "text": "Tracey, we appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "116263341053330781849", "name": "Melanie Moore", "time": 1579541434853, "rating": 5.0, "text": "Melanie  with Cherokee county nursing home\nGreat company to  work with . Greg and Tim do a fantastic job. Michelle Dillard is outstanding also.", "pics": null, "resp": {"time": 1579895639832, "text": "Melanie, We appreciate the kind words. Greg, Tim, Michelle and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg, Michelle and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "107540569775771608900", "name": "Jennifur C", "time": 1585949313514, "rating": 5.0, "text": "Our rep Joseph Cummings is the best, great and nice guy, and always makes sure we have enough products/chemicals and always makes sure the machine is clean!!", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "116426061982255320432", "name": "brittnie mccoy", "time": 1580486956843, "rating": 5.0, "text": "Alan took great care of us today and made sure we got up and running very quickly. Great job. Thank y’all.", "pics": null, "resp": {"time": 1581538858205, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "101428931395039395890", "name": "Carlton Jones", "time": 1579653887815, "rating": 5.0, "text": "Greg came out quick and fixed our dishmachine and we couldn’t be happier!! Outstanding customer service. We would recommend this company to anyone!", "pics": null, "resp": {"time": 1579896103071, "text": "Carlton, We appreciate the kind words. Greg, and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "103325417531583253937", "name": "Jerriann Wortham", "time": 1579809013272, "rating": 5.0, "text": "I had the pleasure of meeting with Robert North, today when he came and serviced our dishwasher. He was very nice and respectful and answered all the questions we had and made sure all of our questions were answered before he left.", "pics": null, "resp": {"time": 1579896083773, "text": "Jerriann, We appreciate the kind words. Robert and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Robert's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "107267632370222360409", "name": "Brandon Pritts", "time": 1579140796891, "rating": 5.0, "text": "Greg was here quick! Had a minor issue, he came in, had us back up and running in a hurry! Great service!", "pics": null, "resp": {"time": 1579895467626, "text": "Brandon, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109400963080759759368", "name": "Dipika Patel", "time": 1583856839437, "rating": 5.0, "text": "We have been using Auto-Chlor for years at our business, recently we had Beau come in and service our system, he brought us some much needed supplies and made sure the dispensing system was working perfectly before he left. He also talked to us about some new products and convinced us to try them out.  Beau was outstanding at his job and very much appreciated his effort and dedication.  I’m sure if we could particularly request Beau to come in for any future service and supply demand, he’d be on speed dial !!!\nThank you Beau for going above and beyond !!!\nBudgetel, Fairfield Alabama", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "100401512591708289308", "name": "Stacy Morrison", "time": 1580407318672, "rating": 5.0, "text": "Greg is very nice and also helpful. We here at Silverlakes loves when he graces us with his presence.", "pics": null, "resp": {"time": 1581538849447, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109712473821370421801", "name": "Julia Hanniford", "time": 1580758200936, "rating": 5.0, "text": "Greg and Tim serviced our dishwasher and did an amazing job at pizza hut in Arab! Thanks guys!", "pics": null, "resp": {"time": 1581538804079, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105362156203468592734", "name": "Shanen Tolbert", "time": 1583960395280, "rating": 5.0, "text": "This is Shanen, I work at the Refinery! Derrick came and serviced out machines today and did a wonderful job! Thank you guys so much!", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106369491852673174603", "name": "Kelly Hodo", "time": 1579894822998, "rating": 5.0, "text": "Auto Chlor is an outstanding company! We are happy to do business with them! Greg Melvin does a great job! Definitely recommend!", "pics": null, "resp": {"time": 1579896297441, "text": "Kelly, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106022963514509852854", "name": "Andres Jimenez", "time": 1579292566515, "rating": 5.0, "text": "Don Pepe Lee Branch.  Greg and Tim did an amazing  job. My machine needed a pump motor and thetas came right out and fixed ir very quick !! Excelente!", "pics": null, "resp": {"time": 1579895588105, "text": "Andres, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109836153375639180275", "name": "Guadalupe Hernendez", "time": 1580156993070, "rating": 5.0, "text": "Auto chlor is a great  company to do business with. People like Michelle Dillard make everything great!!!😀😃", "pics": null, "resp": {"time": 1580160277169, "text": "Guadalupe, We appreciate the kind words. Michelle and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Michelle's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105851045292613463644", "name": "Angel Reyes", "time": 1580758969532, "rating": 5.0, "text": "Auto Chlor is a wonderful company. Michelle is always courteous and very professional. Highly recommend this company!!", "pics": null, "resp": {"time": 1581538811999, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "116633526295778293576", "name": "Audrey Redding", "time": 1580410514507, "rating": 5.0, "text": "Greg is always amazing when he come to East Gadsden Pizza Hut. He does wonderful work and did and awesome job training the new tech Tim Neve", "pics": null, "resp": {"time": 1581538854782, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "100876768957796803785", "name": "Andres Herrera", "time": 1579628335272, "rating": 5.0, "text": "They have provided us with service for years. Although, these past visits Tim and Greg have provided outstanding service which we greatly appreciate.", "pics": null, "resp": {"time": 1579895896889, "text": "Andres, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111678072586304352174", "name": "Lee Pilleteri", "time": 1579884297055, "rating": 5.0, "text": "Greg Melvin was great, very professional and helpful. Would recommend using him to any restaurant in town!", "pics": null, "resp": {"time": 1579896185676, "text": "Lee, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "118432474743919760768", "name": "Candice Williams", "time": 1579896318986, "rating": 5.0, "text": "I had a pleasure of meeting of branch Robert north who gave us great service as usual was very pleased with his service", "pics": null, "resp": {"time": 1580160455883, "text": "Candice, We appreciate the kind words. Robert and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Robert's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109445876782065238165", "name": "Carlos Huerta", "time": 1579982799061, "rating": 5.0, "text": "Robert North came out today and fixed our dishwasher. He was very professional and knowledgeable. Thank you Auto Chlor for hiring a person like Robert.", "pics": null, "resp": {"time": 1581538920806, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "112635464603007497324", "name": "Lori Lori Lori Lori", "time": 1579127519128, "rating": 5.0, "text": "Robert came to service us today and was really happy to see a familiar face .always great service and is always  there for us.  Great company great man", "pics": null, "resp": {"time": 1579895438311, "text": "Lori, we appreciate the kind words. Robert and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Robert's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "112250382083295924170", "name": "Monica Hidalgo", "time": 1579884093757, "rating": 5.0, "text": "Greg was here today servicing our dish machine and did a great job! Super friendly!", "pics": null, "resp": {"time": 1579896177244, "text": "Monica, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109614497859231039650", "name": "Elizabeth Hernandez", "time": 1581099766168, "rating": 5.0, "text": "Pizza hut in guntersville really appreciates Auto Chlor. Great service!  Michele Dillard continues to do an excellent job.", "pics": null, "resp": {"time": 1581538749760, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "110656929581050150295", "name": "RBG Godkiller", "time": 1580768105104, "rating": 5.0, "text": "At Metro Trussville we love Auto Chlor. These guys are just awesome!  The whole Birmingham team is highly recommended.", "pics": null, "resp": {"time": 1581538821446, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "101952051720650989088", "name": "Erica Malone", "time": 1579639211631, "rating": 5.0, "text": "Greg Melvin & Tim Neve came & serviced our kitchen & are very friendly, well knowledgeable service men & professional did I mention.", "pics": null, "resp": {"time": 1579895929941, "text": "Erica, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109955457504317410025", "name": "Elizabeth Wilson", "time": 1580398586957, "rating": 5.0, "text": "Robert North was a excellent customer specialist today . I would recommend he to anyone!!! Great great great!", "pics": null, "resp": {"time": 1581538845352, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102859088471535987539", "name": "Nicholas Finch", "time": 1580309284595, "rating": 5.0, "text": "These guys do great work and handle their business. Big fan and would always recommend.", "pics": null, "resp": {"time": 1581538904161, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "103710626705815082960", "name": "Patrick Summey", "time": 1580321291300, "rating": 5.0, "text": "Branch Manager Robert North gave us great service today at the Ramada by the Airport! Gret guy!", "pics": null, "resp": {"time": 1581538913204, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105837347908116085021", "name": "Hannah Bradford", "time": 1579893099546, "rating": 5.0, "text": "Allen & Tim do a great job keeping us stocked up and keep us laughing while they do it.", "pics": null, "resp": {"time": 1579896257243, "text": "Hannah, We appreciate the kind words. Allen, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Allen and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102858614352441049142", "name": "Kenyada Tate", "time": 1581628111105, "rating": 5.0, "text": "They are awesome Greg was the best Pizza Hut on Morgan Rd. He is very professional", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "113668683346402128182", "name": "Pauline Stipes", "time": 1580152162985, "rating": 5.0, "text": "We love Auto-Chlor man Mr.Greg,\nCame right out & fixed our machine..\nVery happy with the service and would recommend this company to anybody..", "pics": null, "resp": {"time": 1580160355982, "text": "Pauline, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106076340229708082707", "name": "Dylan Smith", "time": 1580928746744, "rating": 5.0, "text": "Fast, dependable service.\nAlan always takes great care of us at Pizza &Pint.", "pics": null, "resp": {"time": 1581538755636, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106055580751395099124", "name": "Sheryll Griffin", "time": 1580753122472, "rating": 5.0, "text": "Auto-Chloe provides my center excellent service!! Greg and Tim are very helpful and always brighten our day!!", "pics": null, "resp": {"time": 1581538792547, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "113384389886145289708", "name": "Anna Farmer", "time": 1580490862621, "rating": 5.0, "text": "We really enjoy doing business with Auto-Chlor here at The Gridiron in Boaz!!\nGreg and Tim do a great job.", "pics": null, "resp": {"time": 1581538784037, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "116597969829155429742", "name": "cesar pedraza", "time": 1580230104504, "rating": 5.0, "text": "Excellent service from Robert North for auto chlor, always friendly and always responds on service call on a timely manner!", "pics": null, "resp": {"time": 1581538874524, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "117489433868625560764", "name": "Jazmine Johsnon", "time": 1579972055010, "rating": 5.0, "text": "Love Auto-Chlor! Great chat today a very knowledgeable service manager Greg Melvin.", "pics": null, "resp": {"time": 1580160423957, "text": "Jazmine, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "101570901793367919164", "name": "Dennis Melton", "time": 1580216649847, "rating": 5.0, "text": "Pleasure doing business with auto chlorine. Michelle dillard!!! Is absolutely wonderful", "pics": null, "resp": {"time": 1581538925368, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111829624590576505463", "name": "Andrew Kennedy", "time": 1580313364682, "rating": 5.0, "text": "Auto-Chlor Birmingham is a great company to deal with. Service Tech Allen is a great guy, very professional.", "pics": null, "resp": {"time": 1581538907890, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "112317844254635460846", "name": "Be your bro", "time": 1579622813621, "rating": 5.0, "text": "Michelle Dillard does a wonderful job and we appreciate her at western sizzlin!", "pics": null, "resp": {"time": 1579895839387, "text": "We appreciate the kind words. Michelle and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Michelle's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105226411381052487477", "name": "Charles Gartman", "time": 1580308798865, "rating": 5.0, "text": "Top notch service. Would certainly recommend them.", "pics": null, "resp": {"time": 1581538900261, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "112248719782914903386", "name": "Victor Reynoso", "time": 1578854548678, "rating": 5.0, "text": "Los Arcos Arab.  Greg continues to do a great job . We appreciate his service.", "pics": null, "resp": {"time": 1579895175174, "text": "Victor, we appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114091779656826520504", "name": "Cathy Morton", "time": 1578706116937, "rating": 5.0, "text": "Our Auto-chlor dishwasher is amazing , so durable, we are a busy, top restaurant in Blount Co. And run ours 8 to 9 hrs. None stop most days. Beau was friendly,\nlistened to\nTo my guestions. Great company!", "pics": null, "resp": {"time": 1579895092086, "text": "Cathy, we appreciate the kind words. Beau and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Beau's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "103268096416237567594", "name": "Ron Foust", "time": 1579976430835, "rating": 5.0, "text": "Auto Chlor is a great  company to work with. Greg Melvin was a great help!", "pics": null, "resp": {"time": 1580160404301, "text": "Ron, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "100533322221179502968", "name": "Katelyn Douglas", "time": 1579727070752, "rating": 5.0, "text": "Gregg and Tim were here today and they were very nice gentlemen.", "pics": null, "resp": {"time": 1579896050648, "text": "Katelyn, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "108600553511866504748", "name": "Trey Williams", "time": 1579817890918, "rating": 5.0, "text": "Pizza hut in warrior Greg was here today did an outstanding job!", "pics": null, "resp": {"time": 1579896131979, "text": "Trey, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105934358225785385499", "name": "Narcie Smith", "time": 1579644081007, "rating": 5.0, "text": "Here at TLC we really appreciate Greg and Tim and all their hard work!", "pics": null, "resp": {"time": 1579895989510, "text": "Narcie, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "100951512567852745835", "name": "Tia Benjamin", "time": 1580154420922, "rating": 5.0, "text": "Great team Keeps are dishwasher looking good everytime Thanks Luke Team Birmingham/Homewood AL", "pics": null, "resp": {"time": 1580160343981, "text": "Tia, We appreciate the kind words. Luke and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Luke's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111415400343737695251", "name": "Danielle Bartlett", "time": 1583959546506, "rating": 5.0, "text": "This is Shanen with the refinery, Derrick came out to service our machines and did a wonderful job! Thank you guys!", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102688809721314910922", "name": "Miguel Garcia", "time": 1579823095629, "rating": 5.0, "text": "This is Miguel at el molino in Warrior very satisfied with our service Greg great job!", "pics": null, "resp": {"time": 1579896149688, "text": "Miguel, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "117993002315353486180", "name": "Beth Howell", "time": 1579222187842, "rating": 5.0, "text": "Love this company!  Beau took good care of us today!", "pics": null, "resp": {"time": 1579895563419, "text": "Beth, we appreciate the kind words. Beau and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Beau's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106181195040487946796", "name": "Tabatha Turner", "time": 1579622211815, "rating": 5.0, "text": "I am an with western sizzlin in rainbow city and Michelle Dillard is doing a great job!!!  Excellent service!!", "pics": null, "resp": {"time": 1579895817068, "text": "Tabatha, We appreciate the kind words. Michelle and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Michelle's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106096517760329550706", "name": "Jessica Berry", "time": 1580487835091, "rating": 5.0, "text": "Western Sizzlin in Boaz love doing business with Auto Chlor. Greg and Tim take good care of us.", "pics": null, "resp": {"time": 1581538861365, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102996388584804053571", "name": "Michelle Kelly", "time": 1581447252130, "rating": 5.0, "text": "( AUTO-CHLOR) For pass 20 years I have been working here I have never send a great group of men, such as Patrick Pilkington, Robert North and now Allen Pilkington they have always greated us Ladies with a BIG smile. Thanks for the hard work Gentlemen.", "pics": null, "resp": {"time": 1581538723269, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102209000048160437394", "name": "Amy Barfield", "time": 1579717236469, "rating": 5.0, "text": "Greg and tim were here at barfield healthcare filling our chemical. They were friendly and professional. We are satisfied with their work.", "pics": null, "resp": {"time": 1579896038667, "text": "Amy, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111383113117585021322", "name": "OneArmed SG", "time": 1578936442001, "rating": 5.0, "text": "Chestnut station gadsden Greg and tim were very helpful me how to clean floor mats", "pics": null, "resp": {"time": 1579895199329, "text": "Wayne, we appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "115574971031305056868", "name": "Sydney Thompson", "time": 1574013185619, "rating": 5.0, "text": "The customer service is amazing! Greg Melvin is very knowledgeable, and helpful to us!!", "pics": null, "resp": {"time": 1574455064275, "text": "Sydney, we appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "115664506533999229875", "name": "Sherry Hawk", "time": 1580232767056, "rating": 5.0, "text": "Pleasure doing busy with Auto-Chlor. Michelle Dillard was very helpful on the phone.", "pics": null, "resp": {"time": 1581538884220, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114382647825224889468", "name": "Kelly Hall", "time": 1584136122867, "rating": 5.0, "text": "Such a pleasure having Greg Melvin service our restaurant!", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102173491583836978669", "name": "Pamala Lloyd", "time": 1579990288338, "rating": 5.0, "text": "Robert North has always looked out for Pizza Hut I really appreciate what u do!!!!!", "pics": null, "resp": {"time": 1580160397970, "text": "Pamala, We appreciate the kind words. Robert and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Robert's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "112001542458155474266", "name": "Caroline Parrott", "time": 1580764332752, "rating": 5.0, "text": "Our machine broke down at our restaurant at Sweetie’s Place and Greg & Tim came right away and fixed it up for us! Highly recommend", "pics": null, "resp": {"time": 1581538816592, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105474474868326636829", "name": "Victor Olivas", "time": 1580234244672, "rating": 5.0, "text": "Robert North gave me great service today.", "pics": null, "resp": {"time": 1581538891130, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "118228039782139183784", "name": "Courtney Bowling", "time": 1579637488792, "rating": 5.0, "text": "Greg Melvin and Tim Neve are very professional and effiecent. They provide great service while maintaining the dishwasher!", "pics": null, "resp": {"time": 1579895916692, "text": "Courtney, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "100120942095107404472", "name": "Albertville Huddle House", "time": 1579124650326, "rating": 5.0, "text": "Greg and tim were excellent and to the point, stand up guys.", "pics": null, "resp": {"time": 1579895388232, "text": "We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102528980233678493249", "name": "Kelsey Moore", "time": 1584136080233, "rating": 5.0, "text": "Greg was very informative and efficient. Explained the process of his service and was very friendly!", "pics": null, "resp": null, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "117021949457287403758", "name": "Alfonso Martinez", "time": 1580758687398, "rating": 5.0, "text": "Here at Sierra Mexican we love Auto Chlor!! Michelle is absolutely awesome !", "pics": null, "resp": {"time": 1581538807855, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114934019250768310067", "name": "Christy Clifton", "time": 1579030523246, "rating": 5.0, "text": "Craig and Tim came to service are dishwasher they were great", "pics": null, "resp": {"time": 1579895286810, "text": "Christy, we appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "104166109775924205143", "name": "Trey Dawson", "time": 1579893036571, "rating": 5.0, "text": "These guys service my restaurant! Excellent service, always friendly!", "pics": null, "resp": {"time": 1579896228115, "text": "Trey, We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105538735290005721269", "name": "Michael Reagan", "time": 1579531870570, "rating": 5.0, "text": "Techs are always prompt and professional.  Products perform as promised", "pics": null, "resp": {"time": 1579895672902, "text": "Michael, We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105209046981173828809", "name": "The GoldxSaint", "time": 1580489112239, "rating": 5.0, "text": "Auto Chlor is a wonderful company. Pleasure doing business with Greg and Tim!!", "pics": null, "resp": {"time": 1581538866243, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105205987928228405860", "name": "Brittany Crane", "time": 1580324796547, "rating": 5.0, "text": "Here at The Gridiron of Centre, we really appreciate Greg and Auto Chlor.", "pics": null, "resp": {"time": 1581538834252, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "104873836212817148719", "name": "Alejandro Perez", "time": 1579121378446, "rating": 5.0, "text": "Los Arcos in Albertville. Excellent service ,Greg and Rim do a great job!!", "pics": null, "resp": {"time": 1579895377704, "text": "Alejandro, we appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "107177916075952580832", "name": "Raul Torres", "time": 1578941317515, "rating": 5.0, "text": "Allen Pilkington is hard worker with a great attitude", "pics": null, "resp": {"time": 1579895230205, "text": "Raul, we appreciate the kind words. Allen and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Allen's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109842612320676209263", "name": "Martha Pair", "time": 1579561971023, "rating": 5.0, "text": "This is Martha from pizza hut. Greg Melvin is always polite and very professional. Greg Beckham is very professional at his job.", "pics": null, "resp": {"time": 1579895782956, "text": "Martha, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "108318525811426146342", "name": "Mcshay Taylor", "time": 1580229680274, "rating": 5.0, "text": "Boe good servies&respectful", "pics": null, "resp": {"time": 1581538939737, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "112034313564390712726", "name": "Spanglish Tenci", "time": 1578942392897, "rating": 5.0, "text": "I had a problem with my dishwasher at don chicos restaurant at collinsville and as soon as I call for service Greg and Tim came to the rescue and fix it, good service and good job, thank you guys.", "pics": null, "resp": {"time": 1579895241932, "text": "We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111458274549161381977", "name": "Mujtaba Syed", "time": 1579216461844, "rating": 5.0, "text": "Love their service. Using them for two decades.", "pics": null, "resp": {"time": 1579895526606, "text": "Mujtaba, We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "115413229125250207042", "name": "jason Popham", "time": 1579623249231, "rating": 5.0, "text": "Greg and Tim are very professional and do an outstanding job!", "pics": null, "resp": {"time": 1579895873230, "text": "Jason, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "102910265858331021021", "name": "Briseida Gomez-soto", "time": 1579201011860, "rating": 5.0, "text": "Greg and Tim were Very helpful and courteous.", "pics": null, "resp": {"time": 1579895483265, "text": "Briseida, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "114740605143283299140", "name": "Bobby Watts", "time": 1581092493972, "rating": 5.0, "text": "Allen always take care of us at The Gridiron here in Oxford,AL ( Oxford Exchange Blvd )", "pics": null, "resp": {"time": 1581538772478, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "117665059380753875744", "name": "Michele Watson", "time": 1579710621564, "rating": 5.0, "text": "Tim and Greg were fantastic!  Awesome customer service!!", "pics": null, "resp": {"time": 1579896028868, "text": "Michele, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111210812781425293332", "name": "Starrlet Reynolds", "time": 1580062999001, "rating": 5.0, "text": "Thanks for coming to the Italian cafe and if anyone is needing there dishwasher fixed call greg melvin", "pics": null, "resp": {"time": 1580160370705, "text": "Starrlet, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "115388734929093575364", "name": "Danu Gheorghe", "time": 1581167290836, "rating": 5.0, "text": "Great people and great service,definitely recommend!", "pics": null, "resp": {"time": 1581538734615, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "103249197298009248297", "name": "MaryAnna Davis", "time": 1579884031308, "rating": 5.0, "text": "Greg Melvin did a great job!!", "pics": null, "resp": {"time": 1579896167718, "text": "MaryAnna, We appreciate the kind words. Greg and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "103736591105678957733", "name": "Brandy Tarvin", "time": 1580233327184, "rating": 5.0, "text": "Thanks to Greg & Tim for great service!", "pics": null, "resp": {"time": 1581538887778, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "113774431646443537916", "name": "Michael Hicks", "time": 1580933080731, "rating": 5.0, "text": "Great people, good service also!", "pics": null, "resp": {"time": 1581538760830, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "110724199869821699121", "name": "TOMMY WANG", "time": 1579550491501, "rating": 5.0, "text": "We have had Auto-Chlor for over 18 years and anytime we call them for any problem or question they are there for us!! Joey and Luke are the beat", "pics": null, "resp": {"time": 1579895740139, "text": "Tommy, We appreciate the kind words. Joey, Luke and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Joey and Luke's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "106312913471112608060", "name": "kimberly dunbar", "time": 1578683125524, "rating": 5.0, "text": "Greg and Tim are amazing I called and they came right out to fix my leak.", "pics": null, "resp": {"time": 1579895036238, "text": "Kimberly, we appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "105219473942408675358", "name": "Ricci Guess", "time": 1581099944776, "rating": 5.0, "text": "Mrs Michelle is amazing!!! She is always very friendly!!", "pics": null, "resp": {"time": 1581538744386, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "109594501718451962407", "name": "Yolonda Washington", "time": 1580221186122, "rating": 5.0, "text": "Bo did great job", "pics": null, "resp": {"time": 1581538929719, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "115642037631966738908", "name": "John Coleman", "time": 1574018286761, "rating": 5.0, "text": "I don’t know why other dishwashing companies even try.", "pics": null, "resp": {"time": 1574455014152, "text": "John, we appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "108879013342614871266", "name": "Allyson Morales", "time": 1580324715208, "rating": 5.0, "text": "Auto Chlor is great to do business with!", "pics": null, "resp": {"time": 1581538829870, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "113195155252103891670", "name": "Charity Northrup", "time": 1579129116717, "rating": 5.0, "text": "Greg and Tim are awesome!", "pics": null, "resp": {"time": 1579895412220, "text": "Charity, we appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "111620026480780693069", "name": "Brody Jordan", "time": 1579625124100, "rating": 5.0, "text": "Greg and Tim are nice and professional", "pics": null, "resp": {"time": 1579895884132, "text": "Jason, We appreciate the kind words. Greg, Tim and our entire Birmingham team are dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System and a fan of Greg and Tim's!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "117167948810782428590", "name": "Dominic Hancock", "time": 1579896382656, "rating": 5.0, "text": "Always great and professional!!", "pics": null, "resp": {"time": 1580160512165, "text": "Dominin, We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "107790949990297839573", "name": "Andrea J", "time": 1581130974009, "rating": 5.0, "text": "Bo was great", "pics": null, "resp": {"time": 1581538739912, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "116868307801704370246", "name": "Franklin Morrison", "time": 1580748532699, "rating": 5.0, "text": "Beau is great", "pics": null, "resp": {"time": 1581538787979, "text": "We appreciate the kind words. Our entire Birmingham team is dedicated to providing total service and total satisfaction to our customer partners. Thank you for being a customer partner of Auto Chlor System!"}, "gmap_id": "0x88891edf69dfdf77:0x92621ee01ff4001d"}
{"user_id": "108333578004154741399", "name": "Bill Reeves", "time": 1556147316198, "rating": 5.0, "text": "Excellent supply of all the ingredients needed for homebrewing. Joy is very knowledgeable and willing to assist customers techniques and supplies needed to create that special brew.", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
{"user_id": "106145022942389985595", "name": "Michael Taylor", "time": 1566079843847, "rating": 5.0, "text": "Great place everything you need and very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
{"user_id": "109185575505431756183", "name": "Bobby Wiggins", "time": 1550948060288, "rating": 5.0, "text": "Great place to buy all your wine supplies and much more", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
{"user_id": "108999360682059114135", "name": "jimbull34", "time": 1535826704517, "rating": 5.0, "text": "Good selection, good prices, good company. Joy is a fun person to converse with.", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
{"user_id": "101220225630025491109", "name": "Jeff Alford", "time": 1515817510719, "rating": 4.0, "text": "Very nice proprietoress, especially knowledgeable about wine.\n\nDecent bar next door too.", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
{"user_id": "113970437867141882363", "name": "Heathen Customs", "time": 1500023787532, "rating": 5.0, "text": "In the store every few months. Joy is a joy to be around and is more than willing to help with any questions I can come up with. On occasion she had helped me come up with recipes for new batches of Mead and Wine. I will definitely be a returning customer", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
{"user_id": "103996303754481430543", "name": "Nick Pronesti", "time": 1492271881320, "rating": 1.0, "text": "Not open. Just drove an hour to get here. They have not managed their posted hours on Google. FAIL.", "pics": null, "resp": null, "gmap_id": "0x889a118dde98dd79:0x7040bb86f658f744"}
