{"user_id": "101503131806448916116", "name": "Ken Rutledge", "time": 1626460893519, "rating": 5.0, "text": "Good people\nProfessional and unloaded me quickly", "pics": null, "resp": null, "gmap_id": "0x887d49fe8ebfff5d:0xfcfff9ec219197eb"}
{"user_id": "108582657745930615705", "name": "Thomas McGill", "time": 1590078386387, "rating": 5.0, "text": "Nice people and great quality brick.", "pics": null, "resp": null, "gmap_id": "0x887d49fe8ebfff5d:0xfcfff9ec219197eb"}
{"user_id": "108408906301723848908", "name": "Howard Jones", "time": 1588356826027, "rating": 1.0, "text": "I've been waiting to unload my TRL for 5 hours now way under staffed will not ever pick up another load for this place", "pics": null, "resp": null, "gmap_id": "0x887d49fe8ebfff5d:0xfcfff9ec219197eb"}
{"user_id": "112287847975437221083", "name": "John Kolaczek", "time": 1619043180901, "rating": 5.0, "text": "Donnie, Hector and their crew from Altract did a great job painting the interior and exterior of our home! They were very professional and maintained a very positive and pleasant attitude in every aspect of the job. I highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "114479794937898206730", "name": "Alec Durand", "time": 1565528265778, "rating": 5.0, "text": "Lauren Green and I coordinated a painting and roofing job on a commercial building. She is a breeze to work with, did everything she said she would, and the work was phenomenal! Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOYaccIlPh1E8unYb_Ulxf-2pCSKz5udekZ65IX=w150-h150-k-no-p"]}], "resp": {"time": 1566915036112, "text": "Thank you, Alec! Lauren has been doing an outstanding jobs taking care of all her customers needs. Please let her know if there is anything else we can do for you."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "113379196514673025738", "name": "Fred Krischke", "time": 1623252012652, "rating": 5.0, "text": "Very prompt and professional. I was pleased with the work quality adn the price was fair. I'd use them again!", "pics": null, "resp": null, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "111418938944848934437", "name": "Angela Corbett", "time": 1615764721980, "rating": 5.0, "text": "This was a complete modernization of my kitchen.  I was so pleased with how it looked as well as the service from the contractor.   I have used Altract for so many projects and have always been pleased and is why I continue to use them.", "pics": null, "resp": {"time": 1615765450160, "text": "Thanks for the kind words Angela. We appreciate your business. Your kitchen does look great!  We may have done the work but you did an excellent job picking out the colors and the tile also."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "102883856411546276209", "name": "Brooke Gamble", "time": 1570845274530, "rating": 5.0, "text": "Altract did a great job on painting our home!   They met all of our expectations and if something wasn't correct Jordan made sure it was fixed in a timely manner.  We will definitely use them again in the future!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOLfZtpNRkFtRVdeuIiTyPElpDD6R-z0ArF32Ki=w150-h150-k-no-p"]}], "resp": {"time": 1571181455309, "text": "Thank you, Brooke! We looking forward to assisting in anything you may need! Thank you so much for the opportunity to serve you and your family. Have a great Halloween"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "111077159659073905063", "name": "Brian Boackle", "time": 1623947821717, "rating": 1.0, "text": "When it came time to get my house painted, I did my research and found Altract to be highly rated so I gave them a shot.  What a COMPLETE DISAPPOINTMENT!  Bryant Darby came for the initial consultation and was very thorough and detail oriented, so I could only assume the painters would follow suit. Long story short, the painters were absolutely terrible! The crew dripped paint EVERYWHERE.  Inside and outside of my house were covered in drips of white paint.  **UPDATE:  The paint drips were on a brand new deck (less than 2 years old); a new rug (less than 2 years old) and newly installed flowerbeds/rocks less than a month before the paint job.  THIS WAS NOT FROM A PREVIOUS PAINT JOB!!!!   Every time they returned to fix something, they'd leave their mark on something else.  It finally got to the point that I didn't even want them on my property any longer.  The lame attempt they made to clean up after themselves was laughable and I was ready to cut my losses** The house wasn't prepped correctly and I have fresh paint peeling already!   They broke bulbs on my string lights and not only didn't tell me, but didn't bother to clean it up!   This crew was completely lazy and careless.  I'm glad others had a pleasurable experiences with Altract, but I would award zero stars if google would allow.", "pics": null, "resp": {"time": 1623942555535, "text": "Brian, I'm sorry you were unhappy with your painting experience.  The painters did come back to the house to clean off any drips and as we discussed with you onsite many of the drips were from the previous times the house was painted and could not be cleaned.  To my knowledge any drips or spills we were responsible for were cleaned from the house.  If you do have peeling paint from the current job we did for you please remember you have a 3 year warranty that covers any peeling, flaking, or fading. Likely this is not a product of incorrect prep but the conditions in which the paint was applied.  If any moisture gets trapped between the paint and the wood it will peel no matter how well the house was prepped.  This is why we offer the warranty we do.  Please feel free to contact us to schedule any necessary warranty work.  We are happy to fix anything we are responsible for."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "107611241280046320573", "name": "Claire Green", "time": 1618952906735, "rating": 2.0, "text": "Terrible communication. What should have been a straightforward,  2.5 day job turned into a 5 week nightmare. I give 4 stars for the completed work (some pieces were still not replaced as discussed). However, I give the \"supervisor\" 0 stars for communication. No call/no show multiple days, even numerous days when weather was not a factor and they could have completed work. Voicemail box was so full I couldn't leave a message. After our color boards were dropped off, we NEVER saw Donnie again. Not once did he come to the jobsite after saying multiple times that he would, even though his crew (and their equipment) was at my house off and on for a month. What a shame because they came recommended by 2 family friends. Very disappointing...", "pics": null, "resp": null, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "105120802382963784393", "name": "Jesse Harris", "time": 1606768087224, "rating": 5.0, "text": "Donnie and crew did a outstanding job painting the interior of our house. Would use again and recommend them.", "pics": null, "resp": {"time": 1606800117470, "text": "Thanks for the kind words Jesse!  It was a pleasure working with you."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "101378955593412329247", "name": "Sam Warren", "time": 1564089107440, "rating": 5.0, "text": "Altract did a great job painting some rooms in my home! They showed up on time, were very friendly, and didn't leave a mess! Jordan is easy to work with, and honest. I will be using them again!", "pics": null, "resp": {"time": 1565391106138, "text": "Thank you, Sam! Greatly appreciate the opportunity!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "116173584017306027382", "name": "Jenna Brady", "time": 1571066270202, "rating": 5.0, "text": "I highly recommend Altract Co. Jordan Means was easy to work with and provided good paint color recommendations. The prices were reasonable and the work done was impeccable. They finished in the time estimated and didn’t leave until I was completely satisfied. We had Altract Co. paint every room in our house, including ceilings, trim, doors, and walls. They did an outstanding job and our house feels so fresh and new! I would use Altract Co. again for any paint job.", "pics": null, "resp": {"time": 1571181205071, "text": "Thank you, Jenna! We greatly appreciate the opportunity to serve you on your painting needs. If there is anything we can do for you, please do not hesitate to call. Best wishes"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "109625795908644078122", "name": "Tori Quinn", "time": 1563995625717, "rating": 5.0, "text": "Jordan and the guys at Altract are phenomenal at what they do. Their customer service is top notch and their work is impeccable. All my friends that have used their services can't stop raving about how great a job they did. Definitely recommend. They do both inside and outside the house and even help you pick out the color making your life easier. Love love love!", "pics": null, "resp": {"time": 1566914963970, "text": "Thank you for your business, Tori!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "111205339057402325431", "name": "Joshua Snable", "time": 1564683298314, "rating": 5.0, "text": "Jordan and the guys at Altract are top notch. Pricing was very reasonable and the workmanship was impeccable. The Historic Enslen House makeover was no easy task, but Altract did it. Highly recommend!", "pics": null, "resp": {"time": 1565391078355, "text": "Thank you, Josh! You were a great pleasure to work with. Jordan and everyone greatly appreciated the opportunity to work on your home."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "116451171296952717678", "name": "Mark B.", "time": 1564066841799, "rating": 5.0, "text": "Jordan and his team are the best when come to caring about their customer's satisfaction. Recommend them for my projects and others.", "pics": null, "resp": {"time": 1566915062695, "text": "Thank you, Mark! Jordan is one of our best!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "112789703384349632947", "name": "Brad Bradley", "time": 1565387401571, "rating": 5.0, "text": "Fair price. Timely completion. Excellent work. I recommend them without any reservation. Lauren was a pleasure to work with.", "pics": null, "resp": {"time": 1565390940599, "text": "Thank you, brad! Lauren has been killing it and doing an awesome job with all of her homeowners. Thank you so much for giving her and Altract the opportunity to serve you on your painting needs. We look forward to working with you in the future!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "107426084929796286187", "name": "Annabelle Hall", "time": 1571688737795, "rating": 2.0, "text": "The painting crew painted my windows shut! They pretended to remedy the problem but I finally had  to have it remedied  by another company. Cannot recommend them.", "pics": null, "resp": {"time": 1571690446998, "text": "Hi Mrs. Annabelle, I am sorry to hear about your experience. However, I cannot locate your information in our records. I have spoken to all of our estimators and project managers and no one has your name listed in our records or has knowledge of your name. Are you sure Altract Co painted your house? There is a company in Birmingham by the name of Atract Painting, who is not us. If something like this has occurred, we will always take care of it no problem. Please visit our website for our company information so we can get to the bottom of this. Thank you"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "101211663897998044861", "name": "Paige Robinson Briggs", "time": 1563971828072, "rating": 5.0, "text": "Jordan Means is a fabulous asset to Altract. He’s thorough and has high expectations on how work should be done.", "pics": null, "resp": {"time": 1566915172552, "text": "Thank you, Paige!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "105537099135984802255", "name": "Mike Bostick", "time": 1571160231561, "rating": 5.0, "text": "Lauren was a pleasure to deal with.  Her crew was prompt and did a good job of prep and painting two houses for us.", "pics": null, "resp": {"time": 1571181346612, "text": "Thank you, Mike! Lauren has been doing a great job taking care of her homeowners, making sure the job goes smooth and pain free. If there is anything you need, please do not hesitate to call. Take care"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "109411404578475139605", "name": "Jamie White", "time": 1563367316674, "rating": 5.0, "text": "Altract painted my office. The painters were on time and completed the project within the quoted timeframe. I would highly recommend this company.", "pics": null, "resp": {"time": 1566915203125, "text": "Thank you for your business, Jaime! You were a pleasure to work for."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "115886720447889046617", "name": "Linda Smith", "time": 1534071111381, "rating": 5.0, "text": "I contacted a few companies in regards to getting estimates for my parents home. Tony was very professional, not pushy and a great communicator.  They did an outstanding job. Workers were professional and friendly. A very clean job! I would not hesitate to hire them again.  They will always be my go to company for painting jobs. Thanks guys!!", "pics": null, "resp": {"time": 1562939977218, "text": "Linda, it was a great pleasure working with you. Please do not hesitate to call if there is anything we can help with."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "101258243481284499393", "name": "Rory Doyle", "time": 1563982331487, "rating": 5.0, "text": "Altracts atention to details and quality of work stands out. I have no problem referring This company to anyone in our sphere of influence.", "pics": null, "resp": {"time": 1566915103360, "text": "Rory, we greatly appreciate your candor and referrals. It keeps our business running and growing. Thank you so much for your business."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "110500818666655555266", "name": "Casey Bentley", "time": 1563971924830, "rating": 5.0, "text": "Jordan Means and Altract Painting are great resources for ALL your painting needs.", "pics": null, "resp": {"time": 1566915137090, "text": "Thank you, Casey!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "115241158781197888624", "name": "Emily Kinnell", "time": 1566081267447, "rating": 5.0, "text": "Excellent experience with Jordan and his team! Would highly recommend them.", "pics": null, "resp": {"time": 1566914997927, "text": "Thank you, Emily! It was a great pleasure serving you in your painting needs!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "112973676233019122422", "name": "James E", "time": 1525897431634, "rating": 5.0, "text": "I got my exterior trim for my home painted and washed by Altract this spring. The painters were very professional and courteous. They also did an outstanding job. Tony was very professional and always considerate when I needed to speak to him regarding an estimate, scheduling the work, giving me a fair price, etc. He also came by as the painters were finishing up to make sure I was satisfied with the job. I absolutely recommend this company to do any painting you need done. Great group of guys and they even used top notch paint with a guaranteed warranty that was a full YEAR longer than any other company or contractor would offer. I'll definitely use them again in the future.", "pics": null, "resp": {"time": 1562939985467, "text": "Thank you, James!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "102888913225214980447", "name": "Quentin Dunn", "time": 1563973032961, "rating": 5.0, "text": "Jordan makes your home sexy again.", "pics": null, "resp": {"time": 1566915127228, "text": "haha Thank you, Quentin. I am glad Jordan could make your home sexy again"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "104310815458163873627", "name": "Joanna Stockard", "time": 1552748956855, "rating": 4.0, "text": "After a couple of miscommunications this Company went above and beyond to ensure I was satisfied. Jose was a complete professional in handling my project.", "pics": null, "resp": {"time": 1562939947518, "text": "Thank you for everything, Joanna!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "102315012630163601583", "name": "Elizabeth Sanfelippo", "time": 1558538730729, "rating": 5.0, "text": "We hired Altract to paint and replace the ceilings of our exterior porches, paint our exterior staircase, and repair and paint some soffits. Donnie Kuba was wonderful to work with. I had gotten quotes from several companies, and Donnie gave me the most detailed scope and line item pricing as requested. They were extremely reasonable with pricing and did a great job. Donnie made sure all items and details were handled. He was also patient with us as we have HOA mandates that require several quotes.  I highly recommend Donnie and Altract!", "pics": null, "resp": {"time": 1562939931446, "text": "Thank you so much, Elizabeth! Look forward to working with you in the future."}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
{"user_id": "103509765661869836443", "name": "Mark Lilla", "time": 1555338554259, "rating": 5.0, "text": "Highly recommend", "pics": null, "resp": {"time": 1562939936968, "text": "Thank you!"}, "gmap_id": "0x8889166f758133e3:0xb2e24817cff76e0b"}
