{"user_id": "106552122223153641777", "name": "Mark Asperger", "time": 1291683836009, "rating": 2.0, "text": "Health Dept. rating was only 87 and was hung at a height of over 8 feet, making it unreadable to most. The waitress was unfriendly, though the hostess was only distant and indifferent. Food wasn't that bad, though the limited buffet selection didn't justify the nearly $15 price (w/ drink).", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "111683418091292805454", "name": "Melissa Rico", "time": 1456708337713, "rating": 1.0, "text": "We get there at 6pm and no food on buffet plus they are consistently getting busier yet they r slow getn more food out yet the fresh food they are putting out is either over cooked or under done. We asked our waitress for more rolls she gave us a sigh n walked off but she did bring us more they where just half cooked. Yuck nasty doughy rolls. Plus food was on floor with 3 tongs on the floor . this place is the worst buffet I have ever been to. Definitely don't waste ur time or your money avoid this place. KEEP DRIVING!!!!", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "116181236126259581900", "name": "Raheim Thomas", "time": 1344018515454, "rating": 4.0, "text": "The waitress was good. Her name is lisa ask for her. The dishes r horrible.! My plate had collard green stains.! :/ good place though", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "114969313695425920976", "name": "Hamish Barrett", "time": 1479203690268, "rating": 1.0, "text": "Some hard foods that could not be saved with gravy. Manager was a jerk. Waitress was friendly and efficient. Will probably never see this place again.\n\nPermanently closed owing to bankruptcy.", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "103358847341447033739", "name": "Brittany Cheyenne", "time": 1400229188023, "rating": 2.0, "text": "The food was old and picked over and the place was slam packed so idk why there wasn't fresh stuff on the bar. And the bathroom was so nasty I had rather let my toddler use her pull up before I hovered her over the toilet. As soon as I seen the bathrooms I immediately wanted to leave. I will not be going back EVER AGAIN!", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "108909498687360637403", "name": "Ronda Graham", "time": 1382309216248, "rating": 4.0, "text": "Erick Graham the best worker I saw working and everytime I looked up he was working.", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "112818533611716107182", "name": "Mary saunders", "time": 1435623686654, "rating": 3.0, "text": "Was a great experience.Ramon our waiter never stopped always had full cups and friendly faces! Just dont get a go cup after your meal they charge way too much", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "101080815740163609727", "name": "Valencia King", "time": 1433812431517, "rating": 1.0, "text": "It was nasty from the floor to the dishes. The Health score is 85. The dishes was nasty, table, floors, and restroom. The restroom was so awful til, my son didn't want to stand up and pee. The worst it has ever been. I will not recommend this at all to anyone until they clean up there act. The Health score was on the ceiling.", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "110974836463859869474", "name": "Brenda Wilson-Macon", "time": 1416890978470, "rating": 1.0, "text": "The afternoon I visited the food was Old and they were out of everything and waitress came to Our table late and food was not good!", "pics": null, "resp": null, "gmap_id": "0x888903f4bd6ad153:0x468aa7ae2dbe1f38"}
{"user_id": "109692036090398201348", "name": "Ashley Purandare", "time": 1628221010370, "rating": 5.0, "text": "My husband and I ate at Indian Kitchen in the shopping center on the corner of Whitesburg and Airport Rd. In the same place as Ruchi (they moved to south parkway just past Applebee's). Indian kitchen has a buffet everyday from 11-2,. Indian kitchen had a great amount of choices on their buffet. Try them out! I pretty much tried everything and it was all good!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqmaZMKAqNEFtdM97w8zcz0qjaHkc6zKK8TJgf=w150-h150-k-no-p"]}], "resp": {"time": 1628630767491, "text": "Thanks Ashley for your feedback. Glad you liked our buffet. We try to serve fresh food made from locally grown vegetables   and make sure our customers get a good choice in both vegetarian and non vegetarian. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103451376400347515648", "name": "Savanna Gunn", "time": 1626634360187, "rating": 5.0, "text": "I was so sad when Ruchi shut down, but heard the head chef is at Indian Kitchen so I decided to try it. 10/10 recommend it. Service was great, but the food was even better. They offer the lunch buffet on the weekends and everything was hot, fresh, and delicious!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOTeGkpsA99DTjQYt5RTd698yNng0HEjWWQHHpm=w150-h150-k-no-p"]}], "resp": {"time": 1626811018395, "text": "Thanks Savanna for your kind words and giving us such a wonderful rating. We will try to live up to your expectations. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "101867861312224833081", "name": "William Crane", "time": 1628808421975, "rating": 5.0, "text": "Food here phenomenal! Some of the best Indian cuisine i have had in a long time. There hot is no exaggeration , it is HOT . There somsa’s are always a special treat . The staff is always very polite and pleasant , and I look forward to the next time to have the  opportunity to go", "pics": null, "resp": {"time": 1629222903535, "text": "Thanks William for taking the time to write the review and your kind words to describe the food and the service. Hope to see you soon again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103612860800770545051", "name": "Caleb Harvey", "time": 1628474543793, "rating": 1.0, "text": "Worst experience I’ve ever had at a restaurant. I wouldn’t give them another penny of my business in my lifetime nor will my family.\n\nFrom the moment we arrived, the two ladies running the front were extremely rude, and acted as if they didn’t want us there at all. Once we were seated, our drinks were slammed down on our table. 15 minutes passed before we saw them again to place our orders, of which we were given major attitudes.\n\nWe ordered a mango lassie, which was very gritty and was made from some sort of powder. The yogurt tasted rotten, and we told the server about it. She snatched it off our table, and rolled her eyes.\n\nWhile we were here, and the 15 minutes passed by, we saw two other tables get up and walk out without ordering because of the terrible customer service given to them by the “manager”. Please roll back your cameras and watch people walking out after encountering the most rude servers/managers in Huntsville.\n\nThe rice was so dry, we asked for a different entree. Once we got the bill, she refused to take off the drink that cost $3.99 because we took one single sip out of it to find it wasn’t good, and the yogurt was sour. She said “you took a sip so you’re paying for it”. I told her that was ridiculous, that it was rotten, and she rolled her eyes, snatched my debit card from my hand and charged it.\n\nI asked where the manager was, and she said “I’m the manager” and laughed. I truly hope the owners read this review because I have been a very loyal customer to this location, and the chef despite the Ruchi drama. Now I’ve decided to never come back here. If the owners are reading this, please take this seriously and do something about these two because they are running off loyal customers.", "pics": null, "resp": {"time": 1628630268134, "text": "Hi Caleb I appreciate the review and your experience at the restaurant. We spoke to the staff about their behavior and their attitude towards our customers. We gave them a verbal warning regarding their service towards you and your family. Just give us one more chance so that next time you come to the restaurant you can have a good and better experience. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109148561078733715096", "name": "RalphFLA", "time": 1626472573780, "rating": 4.0, "text": "I have never eaten in a real Indian restaurant before--just a couple of small take-out stands in large cities.\n\nThe person with whom I was dining has had experience dining in Indian restaurants so I followed his lead and my own instincts based on what type of food I generally like.\n\nOne of my favorite foods, and one that I do not often get to eat, is lamb. With that in mind, I decided to try the Lamb Tikka Masala. It was served in a metal bowl. There were a great deal of lamb in the mixture (see the photo). There was also a lot of it. I ate about half of the dish and got a take-out box for the remainder to enjoy it later.\n\nIt was a tomato cream sauce with spices harboring a different flavor than I am used to experiencing. It looked like a thick tomato bisque soup and had some tomato flavor but with different spices.\n\nI also had a Naan bread to accompany the dish. It was very much like the pita bread often served in Greek restaurants and had a similar flavor. There were four large slices of bread.\n\nOverall, the meal was very filling.\n\nMy dining companion ordered the Tandoori chicken. It is pieces of chicken with yogurt and spices and cooked in a clay oven. I had one of the chicken pieces and liked it very much. Again, a different spice than I am used to having but it tasted good.\n\nThe chicken was served on a plate that was sizzling when it came out. Obviously, it was very hot and an impressive presentation with the chicken sizzling rapidly.\n\nFor a drink, I ordered Masala Tea. Again, I had never had this tea and ordered it on a whim. It was very good. Strong black tea with milk and spices, probably cinammon and some other spices. It was robust and filling and served hot.\n\nThis restaurant is in the back of a shopping center and can be easy to miss. Until we got close, I did not see the sign although we were looking for it.\n\nThe meal was tasty and the prices were very reasonable. The servings were generous and many adults will have food left over to take home for another meal.\n\nFor those who have not tried Indian cuisine, this would be a good place to start.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6dsTnmwlDgq5lxG1NHW_vXiSY8narQmHiffWE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOT_MuHJ-Q5Tdy1zWssaxlpTxYznq_o_cLMc7dU=w150-h150-k-no-p"]}], "resp": {"time": 1626811951087, "text": "Thanks Ralph for you good review. We were happy that you had a wonderful experience at this restaurant. Thanks once again for recommending this place to other people. We need loyal customers like you so we can improve on the quality and quantity of food. Hoping to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "112134516023113586435", "name": "San", "time": 1614559956690, "rating": 5.0, "text": "Newly opened Indian Kitchen have delicious food, right now they are only doing takeout but owner who is also chef said they will be open for dine in soon.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZ9nn0M6BLmGIub3VUjwL39r3Y53MmAHZyfG23=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4BAq22H_ORqNMbHwa1CvU8jtnhY2eJ802A1mp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgTeLgYV9ycRFQ2tpdExDoehm7dcZE4gK_ZRRz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPihXw1Byd6-cME8OcndzvOKgs--k1bFJmv8Rjf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_wY6ihuHUA6MkZznVpOBwzLN4ESikr5R5z_kk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRlFgPnrxVIBhxFTmN0H6NHuVKzbJKRXLmnIwo=w150-h150-k-no-p"]}], "resp": {"time": 1615229403746, "text": "Thanks Santosh for your feedback. We will try to open the dine in soon. Just waiting as a precautionary measure to open the dine in because of the Covid. Till then you can do takeout and enjoy the food."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "112243721236662436087", "name": "Will Sanders", "time": 1628465283224, "rating": 1.0, "text": "From the moment we walked in, we were treated poorly. It took 15 minutes to even get someone to our table. Several patrons walked out the restaurant due to the lack of service. This should’ve been my first indication. We received our food, the food was ok, but we asked for a few things to be taken off. When the bill came the “manager” said since you “tired the food and drink we can’t take it off”. This makes no sense to me… I swiped my card then she turned the screen and I’m not sure if she tipped her self, or changed the amount. She also forged my signature to be able authorize the purchase. This is not right, and I recommend never eating at this restaurant.", "pics": null, "resp": {"time": 1628630497192, "text": "Thanks Will for your feedback. We spoke to the staff and gave them verbal warnings about their behavior towards our loyal customers. Don't worry they did'nt overcharge you or took off any tips. Please try to come back again and have a good experience at this restaurant. Hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105525458803615027637", "name": "Rebecca Booth", "time": 1623211821280, "rating": 5.0, "text": "All I can say is WOW! I have been to India several times and I can honestly say this is THE MOST Authentic Indian food i have had stateside.  Their fresh ingredients and great prices will definitely have you coming back for more.  Do yourself a favor,  stop and experience the BEST Indian food around. You won't be disappointed!!", "pics": null, "resp": {"time": 1623700927661, "text": "Thank you Rebecca for your kind words and your good review. Hope it guides other people to our restaurant who are craving for good authentic Indian food"}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "107499727408090968108", "name": "grey ish", "time": 1621054594808, "rating": 5.0, "text": "This is one of the best restaurants in the city. Not one of the best Indian cuisine restaurants, of which there are too few. One of the very best, any cuisine, any style.\n\nWe have enjoyed a few very nice Indian restaurants in the area over the years, but they closed down or were sold. We have been craving a place like this and when we saw it was open, we took a chance. Long story short, we we back two days later.\n\nTried a few different entrees, naan, samosas, and a few cauliflower dishes. The Gobi Manchurian is a real treat. And the samosas with the mint chutney/sauce.... I put the leftover sauce on a sandwich.\n\nThis is a bit of a hidden spot but I really hope everyone goes there. They are making amazing food.", "pics": null, "resp": {"time": 1618427668413, "text": "Thank you for the good review and the 5 stars you gave for the restaurant. Hope your review helps us to get more customers so we can serve them good and authentic food.  Hope to see you soon again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "116002136322061448698", "name": "Dr. David Thomas", "time": 1628467809932, "rating": 1.0, "text": "Very rude, I would not recommend. We left without ordering. I will never come here again.", "pics": null, "resp": {"time": 1628714255521, "text": "Hi Dr. David, can you please call us and let us know your bad experience with us. In that way we can take the necessary action against any staff who made your experience a bad one. We hope to see you again and make you our loyal customer."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105521335047088053333", "name": "J. Berger", "time": 1628808066896, "rating": 5.0, "text": "Excellent food. Always delicious and fresh!", "pics": null, "resp": {"time": 1629222969758, "text": "Thanks Ms. Berger for your good review about the food. We have a lot of choices on the menu. Hope you will like it and enjoy. See you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "104474139759000562369", "name": "Jonathan Korbell", "time": 1628871639644, "rating": 1.0, "text": "Unimpressed, unamused, and displeased with the rude staff. The Mango Lassie is powder based, and not fresh. Quite sour on the palate.", "pics": null, "resp": {"time": 1629222834041, "text": "Thanks Jonathan for your feedback. We tried to brief the staff about their behavior. Regarding Mango Lassi we do not use any powder. We make it fresh on order. Maybe you liked it sweet. Next time let us know and we will make it to your order. Thanks and hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109584292791393837695", "name": "Joel Gaddis", "time": 1624746692960, "rating": 5.0, "text": "Amazing food, so much flavor!!! And the dining room is now open!  If you are reading this: close your app and just go here!!!! Seriously, this is some of the best food I have eaten. Definely the best Indian food.  I can say that the lamb vindaloo, coriander chicken, and chicken 65 were delicious.", "pics": null, "resp": {"time": 1625164784175, "text": "Thank you Joel for the amazing review you gave for the restaurant. Hope it guides people to our restaurant who appreciates a good quality of Authentic Indian food."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "108747879160155919984", "name": "Sierra Belle", "time": 1627499707871, "rating": 5.0, "text": "The Butter chicken-spicy was phenomenal! My fiancé got the lamb Roganjosh and really enjoyed that as well. It was our first time trying Indian food and we will definitely be back. Everything we got was amazing down to the Naan and the dessert. 10/10 would recommend. Price wasn’t bad for the portion size either.", "pics": null, "resp": {"time": 1627682682290, "text": "Thanks Sierra for the good review you gave for our restaurant. Glad your first time was a good experience. Hope to see you and your fiance next time."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "102311668675687723900", "name": "Jalen Johnson", "time": 1628465423723, "rating": 1.0, "text": "Would not recommend eating here. The service is horrible.", "pics": null, "resp": {"time": 1628714663399, "text": "Hi Jalen sorry for your bad experience you had  at this restaurant. We have taken the necessary action against the staff. Hope you will have a good experience the next time you dine in. See you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "101055970265859953306", "name": "Sherman Wilcox", "time": 1614826902775, "rating": 5.0, "text": "Excellent food, nice to have a great neighbourhood Indian restaurant", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPUoWHo2WBWagjKSiTqK0M6LvBOhPCoLIX_ZIzl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPX-fE-s0MpOOS7I0E0xsNtk7DyXRBtrc7xw5WB=w150-h150-k-no-p"]}], "resp": {"time": 1615228160100, "text": "Thanks Sherman for the 5 Stars. Its nice to have you Sherman in our Good Customer list."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105264286556309634197", "name": "damintrading trading", "time": 1626569711416, "rating": 1.0, "text": "Worst restaurant ever. I ordered food for the family and everyone got major upset stomach. I called just now to complain and the girl who answered the phone told me that there are lot of diseases out there and it wasn’t them instead of admitting her mistake. Just to know I wasn’t looking for either a compensation or my money back. Just wanted them to acknowledge.  Please order from here if you definitely want diarrhea", "pics": null, "resp": {"time": 1626811515100, "text": "Sorry to hear that you had a bad experience at our restaurant. We take these reviews very seriously. We investigated the case and found out there were so many orders on that day when you ordered but you were the only one whom we learnt had a problem with the food. Maybe it was just a coincidence that you ordered food on that day and we got the blame for it. Anyways give us one more chance and you might give us a good rating next time you visit."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114678771439236343626", "name": "Anthony", "time": 1617231026395, "rating": 4.0, "text": "I have been waiting for some good Indian restaurants to come to Huntsville. The other options don’t meet my expectations by a long shot. Indian kitchen is your best option in Huntsville by far. Much better flavors, slightly larger portions, and better heat levels. The lamb was hit or miss. Some pieces were tender and moist, but most were dry and chewy. Really wish this restaurant would sell papadums. It’s a very common item to find in Indian restaurants so I’m not sure why they don’t have them. Overall a big step up from the other Indian restaurants. Looking forward to trying many other dishes", "pics": null, "resp": {"time": 1618427808782, "text": "Thank you for your feedback. Try our other dishes too from the menu. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "100265178809566164000", "name": "Cameron Blake", "time": 1624595939202, "rating": 5.0, "text": "Super friendly service and amazing food.\n\nThe butter chicken is exceptional and pairs perfectly with the garlic naan.", "pics": null, "resp": {"time": 1625165092561, "text": "Thank you Cameron for the  review. Try other dishes too which are equally good so next time you have a choice to select. Hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109554853328849809248", "name": "battenro", "time": 1620928152963, "rating": 5.0, "text": "If, like myself, you crave authentic Indian curry with all the spice and taste you could ever want than this is the place for you. You can have your curry as mild or as hot as you want and it’ll still be the best in Alabama.", "pics": null, "resp": {"time": 1623700739233, "text": "Thank you very much battenro for your good review. Hope it helps other people who are craving for authentic Indian food. Thanks once again and we will try our best to keep up the good work."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "101066518308205231811", "name": "Yasir Afzal", "time": 1626760502079, "rating": 5.0, "text": "Amazing food. Don't forget to try their buffet from Friday to Sunday.", "pics": null, "resp": {"time": 1626811068507, "text": "Thanks Yasir for the 5 Stars and the good review. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "112048518799893780634", "name": "Angela Keys", "time": 1616887223859, "rating": 5.0, "text": "My husband and love Indian food and this is by far the best we've had in town.  The spice is right, the price is right, and the portions are generous.  My children even love it!", "pics": null, "resp": {"time": 1617163503267, "text": "Thank you for leaving us a rating of your experience at our business. We hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114429590628606961998", "name": "Erik Walsh", "time": 1625979263021, "rating": 5.0, "text": "Really good! Friendly staff. Everything was great!", "pics": null, "resp": {"time": 1626292616499, "text": "Thanks Erik for your wonderful review. We are striving to keep up to the standard and the quality of the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "107565195687720692215", "name": "Brandon Hardiman", "time": 1625874339395, "rating": 1.0, "text": "The reviews sound great but good luck eating at this place. Every time I call to place an order I get a busy signal or hung up on.", "pics": null, "resp": {"time": 1626292736532, "text": "Hey Brandon we apologize about your experience. We just investigated the problem and tried to fix it. You can try to order now and enjoy your favorite Indian food."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103891599538365443925", "name": "Kelsey Ballard", "time": 1624482758824, "rating": 5.0, "text": "Best Indian food in Huntsville! I will miss this place when we move :( Awesome butter chicken, palek paneer, tikka masala, garlic naan!!!! it’s fast, always hot, perfect spice level, and huge portions!", "pics": null, "resp": {"time": 1625165274048, "text": "Thanks for the review Kelsey. Its sad to hear about your moving but till then you can enjoy the amazing food. Hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103286463787828150038", "name": "Lisa GV", "time": 1624765568384, "rating": 5.0, "text": "This is the absolute best Indian food!! We recently moved to North Alabama from Colorado, and I didn't expect to find the most delicious chicken tikka masala, Peshwari naan, and gulab jamun I've ever had right here in Huntsville. The flavor and quality is amazing! This place is well worth the drive for us, and I can't wait to try more items from their large menu. Also, they were open for dinner dine in service tonight (June 26, 2021). I hope more people discover and support this delicious restaurant, as I'd love to see them one day expand and build additional locations in the Madison or Athens areas! :)", "pics": null, "resp": {"time": 1625165184027, "text": "Thank you Lisa for the best review. Its our pleasure serving your family. Hope to see you again soon in the future."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "115468059962084050307", "name": "Watching You", "time": 1627748384957, "rating": 5.0, "text": "Wow what can I say . The cook NO he is not a cook he’s maker of art in Preparing Indian food with class Namaste to the chef  found a new home to eat", "pics": null, "resp": {"time": 1627929606560, "text": "Thanks for your review. Glad you liked our food and made our place your home to eat. You will be always welcome. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "110548127646591728358", "name": "Katie Duncan", "time": 1622233669605, "rating": 5.0, "text": "The best Indian restaurant in Huntsville. Their butter chicken is amazing!", "pics": null, "resp": {"time": 1623701034957, "text": "Thank you Katie for the good review. Hope you try other dishes from the menu. All are amazing made from fresh ingredients and locally shopped."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "104091280627351472944", "name": "Sarah Mayers", "time": 1618187615384, "rating": 5.0, "text": "Best Indian food in huntsville. Get the chicken tikki masala and you won’t regret it 🤌🏼", "pics": null, "resp": {"time": 1618427526042, "text": "Thanks Sarah for your feedback. Hope you try other dishes from our menu. See you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "115136592800815272885", "name": "Dylan Lawson", "time": 1619111609609, "rating": 5.0, "text": "Some of the best spicy food I have ever had, excited about this again and again!", "pics": null, "resp": {"time": 1623701174188, "text": "Thank you Dylan for the good review and we are glad to have you as a regular customer. Hope we keep our good relationship"}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "105366432682695181344", "name": "Tanu Singhal", "time": 1614307206947, "rating": 5.0, "text": "Tried this place and it’s awesome. The owner is very friendly.  The food quality is super good and the quantity is just the perfect amount.  They definitely have my business.  I am very picky when it comes to food and this place meets my expectations! Thx  AJ", "pics": null, "resp": {"time": 1615229526476, "text": "Thanks Tanu for your feedback. And we are glad that we meet your expectations in regards to the food. We try our best to use the local grown fresh ingredients so our customers can get a good taste of the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114959979351838162804", "name": "James", "time": 1614658008862, "rating": 5.0, "text": "Easily the best indian restaurant in huntsville.\n\nPortions for the price is exactly what you would expect.\n\nQuality is consistent. Food is rich in flavor as you would expect from indian food.\n\nThe chief is clearly passionate and it really does come out in his food. Hope this restaurant keeps its consistency and wish them the best. Give this place a try you won't regret it.", "pics": null, "resp": {"time": 1615228010161, "text": "Thanks for your feedback. We will try our best to keep up the consistency of the food. Thanks once again James."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114305506286996643516", "name": "Matthew B.", "time": 1628564575995, "rating": 1.0, "text": "Rude staff, charged for drink we asked to be sent back, PHYSICALLY snatched my card from me so they could charge it without any sense of hospitality. Terrible service. Hope this place burns.", "pics": null, "resp": {"time": 1628714382123, "text": "Hi Matthew sorry for the terrible experience you had from our staff. We have taken the necessary action against the staff and we promise you wont be disappointed the next time you come in."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109894387448692012147", "name": "Yasmin Baria", "time": 1615232380188, "rating": 5.0, "text": "We ordered takeout twice and the food was delicious, great quality & quantity and authentic. A must try.", "pics": null, "resp": {"time": 1616559971483, "text": "Thank you for taking the time to leave your feedback. We hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "103934930776023448710", "name": "Jeremy Lawson", "time": 1615083967311, "rating": 5.0, "text": "Unfreakinbelievable!!! THIS is the place to go for Indian. Loved when Ruchi was there but since they moved, their food hasn't been as good. Not sure what happened but what they lost, Indian Kitchen found. Hoping Ruchi figures it out but until then, Indian Kitchen is the place for us!", "pics": null, "resp": {"time": 1615228103961, "text": "Thanks Jeremy for your feedback. We would like to keep up the good work and make sure customers keep coming back. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "108588572612880142685", "name": "Vanessa Coutinho", "time": 1615296002256, "rating": 5.0, "text": "The best Indian food ever. I would recommend this restaurant as it has quality food with reasonable price also the stuff is super friendly. I had chicken tikka masala, garlic naan, vegetable samosas.", "pics": null, "resp": {"time": 1616559963684, "text": "Thank you for leaving us a rating of your experience at our business.We hope to see you again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109395855166440750812", "name": "Sam Sungg", "time": 1629233213390, "rating": 1.0, "text": "Impudent staff members. Won’t be back.", "pics": null, "resp": null, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "102650922004617323408", "name": "Sean Kruer (Normal Human Person)", "time": 1620082603246, "rating": 5.0, "text": "Very tasty! Great portions, great flavor!", "pics": null, "resp": {"time": 1623701100249, "text": "Thank you Sean for the 5 stars and the good review."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "106552933216372447886", "name": "Nick Rainosek", "time": 1628962482305, "rating": 5.0, "text": "Great food, great service!!", "pics": null, "resp": {"time": 1629222658924, "text": "Thanks Nick for your good review. Hope to see you soon again."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "102524070747235829604", "name": "Annika Rettstadt", "time": 1614650478730, "rating": 5.0, "text": "Indian Kitchen is where it's at!! My boyfriend and I were visiting from out of town and love Indian food, so we decided to order from Indian Kitchen on a whim. We were not disappointed! This is a mom and pop store hidden away in an outlet mall. Please support small and local businesses!\n\nWe ordered two vegetarian entrees: Palak Paneer and Paneer Tikka Masala. We also ordered the Mixed Vegetable Pakora appetizer, and a side of Garlic Naan. I will say that this is a LOT of food for two people since the portions were huge (we have days worth of leftovers) and we were served rice to compliment our meals. All of the food was absolutely delicious, and I look forward to returning to Indian Kitchen very soon.", "pics": null, "resp": {"time": 1615229173841, "text": "Thanks Annika for your feedback. We are glad you and your boyfriend liked the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114957049018370812649", "name": "Taylor Satula", "time": 1614650739661, "rating": 5.0, "text": "Really impressed with the food me and my significant other ordered. We got a spread just to try it out and everything we ordered was delicious.\n\nWe got palak paneer, panner tikka masala, naan, (a boatload of) rice, mixed vegetable pakora, and it came with mint sauce and tamari sauce.\n\nThe paneer was firm with a great mild flavor. You could tell it was made fresh by the firm bouncy texture.\n\nThe spinach and the tikka masala sauces were nice and thick. Just the right amount of good spices talking to each other in the sauce.\n\nNaan had great crispy tips and was also clearly homemade\n\nPakora was KILLER dipped in the mint sauce\n\nI will absolutely be going back to Indian kitchen. It was a little bit hard to find because they don’t have an illuminated sign yet. It has a red curtain draped out front. Staff was very nice and I have nothing but good to say about it,,,,, it was just a really good spot. Glad they’re near my house.", "pics": null, "resp": {"time": 1615229096722, "text": "Thanks Taylor for the feedback. Now with your comparison we know where we stand. We will try our best to give our best in terms of food. See your soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109002625900397804407", "name": "Amy Ragan", "time": 1614565607040, "rating": 5.0, "text": "I was loyal to Ruchi when they were at this location. Tonight my husband and I did a taste taste between the newly-relocated-Ruchi and the newly-opened-Indian Kitchen. We got a medium chicken tikka masala and a garlic naan takeout from both restaurants at the same time.\n\nIndian Kitchen’s curry was thicker and more flavorful, and their chicken looked like it had been nicely charred. Ruchi’s gravy was thin and much more bland, and the chicken was dry and kinda sad looking.\n\nThe rice and naan were pretty comparable for both, but Indian Kitchen’s naan was totally loaded up with garlic so it had more yummy garlic flavor.\n\nWe did not expect this outcome! We just thought it would be fun to compare. But it looks like we will be returning to Indian Kitchen!", "pics": null, "resp": {"time": 1615229294312, "text": "Thanks Amy for your feedback and  for the hardwork you and your husband did to compare the food. We will try to keep up the good work and keep the consistency in terms of the food. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "118215758882543425758", "name": "Lauren Badia", "time": 1618364421370, "rating": 5.0, "text": "Amazing food! We are in love with this place!", "pics": null, "resp": {"time": 1618427603577, "text": "Thanks Lauren for your feedback. We will try our best to meet your expectations and make sure you keep loving this place. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "100393840576742808125", "name": "Oscar Delehoya", "time": 1628467895430, "rating": 1.0, "text": "DO NOT EAT HERE!!!", "pics": null, "resp": {"time": 1628714480400, "text": "Hi Oscar can you please elaborate the bad experience you had dining here. So we can take the necessary action against whoever did it to you or your family. Hope to see you again soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "115677236025395872822", "name": "Andrew Kelley", "time": 1626650426142, "rating": 5.0, "text": "Best Indian food in Huntsville", "pics": null, "resp": {"time": 1626811151682, "text": "Thanks Andrew for the good review you gave us. It  really helps us and motivates us to keep the 5 stars which you rated us. Hope to see you soon."}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "109818532959708356034", "name": "Michael Smith", "time": 1620351314016, "rating": 5.0, "text": "Amazing", "pics": null, "resp": {"time": 1623701062455, "text": "Thank you Michael for the 5 stars"}, "gmap_id": "0x886213df0aec9af3:0xa18aa34dd11220a4"}
{"user_id": "114684261816161048519", "name": "Dreama Guzman", "time": 1557067258869, "rating": 5.0, "text": "Good food friendly service", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "110999184464178404716", "name": "Bud Cook", "time": 1545272231252, "rating": 1.0, "text": "Call before you go.  The website says it’s open at specific hours each day and it is not followed.  Not even close!  We spoke to the store manager", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "109413527040660335824", "name": "John Brent", "time": 1552309606355, "rating": 5.0, "text": "Great people good food love it", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "105286370803620266774", "name": "Amy Johnson", "time": 1563383140740, "rating": 3.0, "text": "Great pizza", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "115483142062213679391", "name": "Angi DVS", "time": 1513694137309, "rating": 5.0, "text": "No problems whatsoever", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "100749967708940291766", "name": "WILL TO FLY HIGH", "time": 1510148605943, "rating": 5.0, "text": "Good breakfast foods", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "111576995426176152519", "name": "John Brent", "time": 1559572400669, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "105125668907194407451", "name": "Terri Broadhead", "time": 1521159613948, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "111721073408195783844", "name": "Shannon Sullivan", "time": 1471443149441, "rating": 5.0, "text": "That good was very good. But the best thing about this Ryan's was the waitress... She always very polite and respectful. Our table stayed clear of empty plates and out glasses stayed full. We will be visiting this Ryan's again the next time we are in that area. Thanks", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "100263699076521816874", "name": "Lillian B.", "time": 1462844850158, "rating": 5.0, "text": "I came with a party of 18. I called in advance and our room was ready when we arrived. The servers immediately began preparing our drink orders. They were so nice and hard working. Everyone received refills as well as hot fresh rolls. The food was AMAZING it was seasoned so well. Everything was great and my family really enjoyed themselves.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "110799676008753170218", "name": "Elizabeth Teresa Castellanos", "time": 1476743591671, "rating": 5.0, "text": "For an all you can eat buffet it was pretty good, but last week we noticed it was closed. There was a sign to the employees that their services were no longer needed. Yesterday we saw a sign saying CLOSED DUE TO BANKRUPTCY and that deliveries would no longer be accepted. 😐 Now we need another good buffet place.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "100083640685466102513", "name": "Amber Jones", "time": 1437699238478, "rating": 1.0, "text": "My family and I had a horrible experience as we were dining. There was mashed potatoes on the plates at the bar. The food it's self was very bland. They are in need of a new cook. The waitress was very nice, and assisted my family very well as we dined. I would not go here if you are looking for a good meal.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "101240209008876164124", "name": "Joseph Preite", "time": 1452395069493, "rating": 5.0, "text": "We got there an hour before closing and expected old food or even cold food. But it was some of the best food I've had in awhile. We loved everything.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "115288435044001547072", "name": "Linda Zamecnik", "time": 1435098393867, "rating": 1.0, "text": "This was the worst meal ever. Most food was empty. No roasted chicken for me.  Hardly any meat choices.  Lunches are better than their dinners.  Definitely should not cost more for dinner.  Many people grumbling at the food bar.  Lettuce was full of cores and bad lettuce.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "112728691397888337844", "name": "Sheryl Payne", "time": 1471182830021, "rating": 5.0, "text": "Visited twice and both times were for breakfast. Great wait staff and a clean, full, hot bar. Definitely coming back.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "104010588147813289822", "name": "Zach Rutledge", "time": 1472255342368, "rating": 2.0, "text": "Just a big bag of OK. Kind of expensive and the food quality isn't great. I guess if you want maximum quantity and don't mind subpar flavor, it's alright. Servers are super pleasant, though.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "116249204898671194226", "name": "Annette Ryan", "time": 1465052581707, "rating": 4.0, "text": "Great dining experience. ...food was delicious. .Mgmt. was very  frendly and accommodating.   Will definitely come back.!!", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "116856633958681148995", "name": "Gary Cummings", "time": 1475239044242, "rating": 4.0, "text": "Was clean and the food was good they have something for everyone. I gave 4 stars because there was not much sea food there and this place is close to the beach", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "101934462852885018586", "name": "becky kinder", "time": 1466557024544, "rating": 5.0, "text": "Great food, excelllent service.  Banana pudding, just like Momma's.   Lots of smiles, hussling, but no disgruntled people....", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "114414600932584803256", "name": "Ricky Dolihite", "time": 1468351575899, "rating": 1.0, "text": "Chicken was raw. Ribs also raw. Over charged. Nasty restrooms blood and poo on walls in stalls. Floors wet and smell bad in front of server station. Had to give one star to post this.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "103826727594824254788", "name": "Lelann Thompson", "time": 1453908727013, "rating": 4.0, "text": "The food is great but not much variety", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "107642858597611819793", "name": "Sheila McClain", "time": 1390767733268, "rating": 4.0, "text": "Every time I go to this Ryan's location there is some kind of major issue.  I notice the changes they are attempting to make to better the experience.  My family and I went there again last night after saying we will never be back.  And this time the food was good, it seemed like maybe it has changed management again.  I think for the better this time.  The employees didn't seem as rowdy and it was just a more pleasant place to be.  The only issue I experienced was; the cashier asked us what we would like to drink. My daughter (who has a medical issue) said root beer, as I told her no due to the caffeine (diet restriction), the cashier jumped in and stated that Barq's Root Beer is Decaff.  Going against my better judgement I allowed her to get the Root Beer thinking maybe I was wrong.  As we sat down, I pulled out the phone and researched and low and behold, Barq's is known for being caffeinated.  If I would not have caught this my daughter could be in the hospital right now.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "114966595868417476737", "name": "Riah Clark", "time": 1465216781286, "rating": 4.0, "text": "Nice place friendly service. Food is average.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "114484688218337537273", "name": "Jessica Solis", "time": 1468459527244, "rating": 4.0, "text": "Good good priced well", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "114313750846943645148", "name": "Daniel Reid", "time": 1375580950462, "rating": 3.0, "text": "Kitchen was trashed had no silverware & no bust boys i guess no cleaned tables not enough staff but had a good selection for the price", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "111509399921881652750", "name": "Adam Phelps (Spacce)", "time": 1412538592591, "rating": 2.0, "text": "Did not have much , like advertised. Not much variety for  a buffet.", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "118340667370067231101", "name": "Warren F", "time": 1492935834040, "rating": 4.0, "text": "Ryan's is like a poor man's golden corral. They went downhill for a long time but it's getting better", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "101518112729813673462", "name": "Charlotte Wright", "time": 1480731709537, "rating": 1.0, "text": "It closes down didn't know one tell me that was awful", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "103032530229489891101", "name": "Ken Woolard", "time": 1489850295734, "rating": 1.0, "text": "This Ryans location is now closed", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "113677945344242851576", "name": "Chances Thompson", "time": 1436281837437, "rating": 3.0, "text": "Ok if hungry", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "101247662390957109119", "name": "Timothy Strain", "time": 1476235917496, "rating": 2.0, "text": "I was working here but now they closed the doors no more Ryan's", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "112540579818054763646", "name": "Pankaj Jaiswal", "time": 1467156367235, "rating": 1.0, "text": "Worst canned food in the state of Alabama", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "104956864445020846135", "name": "jessie mcdougald", "time": 1488598993483, "rating": 4.0, "text": "Nice place", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "113754331200897217153", "name": "Erica Brown", "time": 1437013767527, "rating": 5.0, "text": "The Food!!", "pics": null, "resp": null, "gmap_id": "0x889a0e312e65639b:0x9b4e3a930ed0e60f"}
{"user_id": "104486767857464805173", "name": "cindy Wilkinson", "time": 1392548341855, "rating": 2.0, "text": "Over priced food do your self a faver go next door get the best bbq it is better grate food & grate service", "pics": null, "resp": null, "gmap_id": "0x888cce76cca7e127:0x3c8d5f3eb3531183"}
{"user_id": "102620118257522845964", "name": "Kelly Ashley", "time": 1430697166464, "rating": 5.0, "text": "We ate here recently and it was fabulous! All the food was hot and fresh and we had a great waitress who always ensured our drinks were full and plates were taken away almost as soon as we finished them. We will definitely be going back!", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "104845322245039494563", "name": "Paul Heany", "time": 1462209173991, "rating": 4.0, "text": "I believe this place is closed now.  But when it was open, I went there, just about two times.  But that's only so low because I had a low image of this place on my mind.  But then, I decided to go back with my wife.  And I was completely surprised; this place was a good place to eat.  It's a shame that they are closed now.", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "105610000570844454472", "name": "Tony Nguyen", "time": 1376442410505, "rating": 1.0, "text": "I felt obligated to write this review. I made a big mistake of going to Ryan's , because it was raining and it's near by the hotel. From the outside, the place looks decent, once I was inside, I found out it was a buffet restaurant. I dare to call it the worst buffet in ....America,  truth is this is the first buffet that I ate in Alabama state. The food selection is limited but also looks about 3 days olds, and they all look  and taste terrible. It looks like the food  was cooked by some clumsy person who is still learning how to cook.", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "107721468875857217530", "name": "Chessplay9", "time": 1451677398247, "rating": 1.0, "text": "I would not feed my dog at this place. What little food they had looked like it had been put out 2 days ago. The salad was brown and wilted. The bathrooms were like going in a portapoty. The staff was lazy, they never came to the table to refill anything. If you want to be deathly sick with a parasite THIS IS THE PLACE FOR YOU. I will say this, the last time I ate there was over a year ago and have never been back. I have been meaning to write a review ever since. So unless it has changed, (and from the looks of the place out side it hasn't)the Heath department needs to shut this place down, and put something there that is a benefit to Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "106267966208859743140", "name": "Belinda Mustafa", "time": 1436112542796, "rating": 1.0, "text": "This restaurant was so nasty\nI don't think I have ever been in a restaurant so dirty. I do not recommend going there.I will never go back.", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "112141294273097456824", "name": "deandre holman", "time": 1410996673572, "rating": 5.0, "text": "I love ryans buffet is good the deserts is good I like there bread pudding", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "111681024888549547102", "name": "Sands Jax", "time": 1381160180017, "rating": 1.0, "text": "When I was a kid this place was awesome.  Good food, good waitresses.  I went last year and it was horrid.  I had hoped it had improved and last night I again went to Ryan's and I must say it was the worst yet.  Read the other reviews and you will see that it has been this way consistently over many years.  Don't go here unless you want to be disappointed.  So point by point.  Sweet girl checked us in at the front.  She doesn't listen very well though.  Next we went to seat ourselves and it wasn't busy enough for the waitress to give us our drinks and then NEVER come back.  Food: most was old and crusty.  Seriously who wants hunk of turkey dried to perfection under the heat lamps.  No one wants to eat that!  Taco area...crust of dried gunk over the top of the meat and refried beans.  Fries?  overly salted.  Salad?  Nasty....old disgusting....just gross.  Blue Ribbon Ribs?  Laughable...over cooked.  Ice cream machine looks like it has been broken for a while.  Shrimp?  Extremely tiny inside of a big casing of batter.  Trip to the bathroom?  Shoes stick to the floor and bathroom nasty.  Every thing was GROSS.  How is this place still open.  They need a new manager!", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "113503847521455181359", "name": "Lavonica Butler", "time": 1439834283614, "rating": 1.0, "text": "My family and I were traveling through AL and decided to stop here.  THIS PLACE WAS BEYOND DISGUSTING!!! We were a party of 9 could not find a clean table for all of us to sit together.  Finally got a waitress to clean off a table went to get our food, most of the food was on the counter, mixed together, burning to the bottom of the pans.  Then went to get silver wear some of the utensils had food stuck on it. Then when some of us returned to get more no plates were ready most of the food was gone from the buffet and then the dessert area had all the toppings mixed together all over the counter and floor.  After all of that went to the restroom, toilets were filled with....and not flushed then there was no soap so that means the employees were not washing their hands before going back to work.  As God as my witness I will never ever ever visit Ryan's again....", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "107970046534086110933", "name": "Olivia Narciso", "time": 1396390107390, "rating": 3.0, "text": "(Translated by Google) Very rich\n\n(Original)\nMuy rico", "pics": null, "resp": null, "gmap_id": "0x8886020d585998d5:0x1e5135236487ad8f"}
{"user_id": "109671991912421884742", "name": "213 productions", "time": 1472361840499, "rating": 4.0, "text": "A nice variety of food. Good sushi and friendly staff", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAS7gT5yGJ4yQvepO9bns10A6PlZIah9uWT1iY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "111993682849083346502", "name": "Connie Young", "time": 1503706699903, "rating": 5.0, "text": "My experience has been very delight. The personalities of personal were plesant. Atmosphere good,  food great, I have eating there several occasions will be venture there again I would recommend people to eat there. Facilities clean, staff clean as well. My rate is a 10.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "113292664879411466594", "name": "Mary Ragsdale", "time": 1477102752557, "rating": 3.0, "text": "Food was okay for what they had. And the sushi bar isn't all that. Didn't have much sushi and what they had of it look like it had been sitting since the day before. The fish on the sushi was really dried out. Went during dinner hours on a Friday so you would have thought food would have been fresh and the buffet would have been full. Left with a bad impression. Not good being it was our first time there and will definitely be the last. Especially since we drove over an hour to find something new and different. Different it was though.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "114323690326646595576", "name": "Alline Hanson", "time": 1515651891580, "rating": 5.0, "text": "Great menu with variety. Easy ambience so you can relax and at your own pace. Loved the variety of sea food!", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "113722932962902794108", "name": "James Moore", "time": 1486268579513, "rating": 1.0, "text": "Waitress never once came to check our drinks, employees small (3-4) y.o. children running loose! They must run a daycare in back. $30 for two buffets, speaking of which, one of them overflowed and water was spilling out onto the floor. Once we paid, cashier never made eye contact or said anything. I guess Anniston will accept anything calling itself Asian cuisine.   Not going back.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "114891024554258741437", "name": "Randy Cortez", "time": 1490294221698, "rating": 5.0, "text": "Very exceptional food. They have a wide variety of different foods to choose from. I especially love the seafood. The staff are very friendly too. They also have a lot of seating.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "117039371375903600945", "name": "Sheila Gorman", "time": 1505929318862, "rating": 2.0, "text": "The last time I went, there were flies everywhere and no precautions were being taken to get rid of them or keep them off the food!  I actually told one of the Hispanic workers that there were two dead flies in the broccoli salad spoon and he laughed and walked off.  I did see another worker come over and remove the tub, but honestly, they could have just took it in the back and removed the spoon, added a new spoon and set it back out for consumption. NASTY! I loved their sushi but after that, I won't be back.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "114270975857372090044", "name": "Teresa Robinson", "time": 1496754828068, "rating": 5.0, "text": "A lot of selection and sushi was wonderful. Prices are pretty good too. Busy but not too crowded.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "108657055066447479778", "name": "Megan Trescott", "time": 1511657459584, "rating": 3.0, "text": "My husband and I went there around 6pm. The food has less options. It's better when you go during lunch, more options and fresh food.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "118197457095937860012", "name": "Winaki VP", "time": 1498762739488, "rating": 4.0, "text": "Food was great, no big batches, so it stayed fresh. Service was ok. Not too many friendly smiles, and did not offer drink refill, but picked up empty plates fast.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107200294737522840488", "name": "Michelle Wilson", "time": 1508156961487, "rating": 3.0, "text": "Not a great selection for the price. Lunch on a Friday was almost $10 and that didnt include the drink. Wait staff was sitting at a table eating their lunch at the same time we were eating. The food was good but not great.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "116157439766372872536", "name": "Reagan Carroll Mehta", "time": 1499652566037, "rating": 4.0, "text": "If I could rate the food and service separately, I definitely would. The food has always been wonderful, especially the hibachi, but the waitresses are rude and never seem to provide drink refills. Every time I've eaten there, they sit at their own booth and watch what appears to be Netflix on their phones with earbuds in. Food is great, prices are unbeatable, but service is a no-go.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "118012073466152564265", "name": "Ernest Thurston", "time": 1499744478391, "rating": 4.0, "text": "A quiet family buffet with a good variety of Asian and American food. A lot of seafood choices, even frog legs.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "108493069735299477149", "name": "Susan Reeves", "time": 1499213944063, "rating": 5.0, "text": "It was a great lunch date with my mother-in-law,  she & I both love the food & environment", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "101222898635399836437", "name": "Valarie Schuette", "time": 1500093128671, "rating": 2.0, "text": "Food was sparse and the only good item was the honey chicken...Thats was good...Other than that just not to my taste.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "104841911902765026618", "name": "angela bivines", "time": 1511824862912, "rating": 5.0, "text": "One of the best hibachi restaurants I've ever been to. Fiid was excelkent and service was superb", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "111916120875421569149", "name": "Barbara Shaidnagle", "time": 1486045085546, "rating": 1.0, "text": "we went in about 2:15 pm.  Most of the food was there except for the french fries and I asked twice for them.  Finally they brought out maybe a dozen fries.  No one ever came by to ask about the service or to give us more water.  But we had enough to eat.  We did not leave a tip.  I noted that the receipt had \"suggested gratuity\"  bwahhhhhahahaha....none.  We may try this again at a different hour but not holding my breath...", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "115254904669163239750", "name": "Adam Gieger", "time": 1513101273796, "rating": 5.0, "text": "Me and my family love to eat there and they have great food", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "115070501348656829806", "name": "Tara M", "time": 1482723522242, "rating": 2.0, "text": "This place is unprofessional. I had to request all my food that I wanted on the buffet because they didn't want to put food out. They also conversated loudly in the middle of the restaurant as if they were at home and not in a professional environment. The food was okay. I will not be coming back.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "103404660172046001676", "name": "Lance Nichols", "time": 1485715545832, "rating": 4.0, "text": "Always good food and moderately priced. Love the sushi.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "108193746655432847304", "name": "Kimiko Ware", "time": 1504733638768, "rating": 3.0, "text": "Price has gone up, slow service,  but food is good and it is all you can eat.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "100953119478382117550", "name": "no bull shitz", "time": 1489077848680, "rating": 5.0, "text": "I Always get good food and good service when i eat here", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107432194222035713339", "name": "ckret woodruff", "time": 1466266485425, "rating": 5.0, "text": "Loved it .💙 i really did like the food it was well cooked the only thing i didnt like is the ranch but other than that they get 5 stars from me.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "112922803733327290271", "name": "Tracy Whitaker", "time": 1502641509122, "rating": 4.0, "text": "The food is delicious! The employees have no personality at all.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "117661725435730433273", "name": "Hank Hayden", "time": 1494955305589, "rating": 4.0, "text": "Plenty of items. Great hibachi grill and sushi", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "104056637826390995106", "name": "Calvin Duke", "time": 1501270087976, "rating": 5.0, "text": "I love this place the stuff in the shells is epic good", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "112792390012456005314", "name": "Austin Criner", "time": 1498428639576, "rating": 4.0, "text": "3 people, 2 sodas and a water. $40 total for the 3 Lunch buffets and drinks. Staff not personable but I'm just there for the coconut shrimp. 😀", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107887856702260660903", "name": "KB Rider", "time": 1482504262751, "rating": 5.0, "text": "OMG the best buffet of Asian food ever.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "110266113037549269415", "name": "Tracy Chandler", "time": 1496707706803, "rating": 4.0, "text": "Very good food and very good price", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "101124698351024198310", "name": "Fishing and bushcrafting with Chris", "time": 1508174120922, "rating": 5.0, "text": "They are open again with new management. Better food since new management tooken over.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "114467663764568487238", "name": "TheBragg Gaming", "time": 1488919775601, "rating": 3.0, "text": "Sometimes the food is good amd sometimes not so good. It seems as though the staffs don't like working as a team and not very friendly.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "118097554501320015090", "name": "Ken Richardson", "time": 1497640331265, "rating": 4.0, "text": "Good parking, convenient and good food", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "111883642290302924368", "name": "Tamera Hill", "time": 1494296694416, "rating": 4.0, "text": "Good food. Good service", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "103843708327614796382", "name": "William Bohannon", "time": 1500400971717, "rating": 4.0, "text": "Friendly staff.  Good food with nice selections.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "111441156780524377535", "name": "Melinda G", "time": 1479759626438, "rating": 5.0, "text": "Good food and great atmosphere", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "109399413394878310992", "name": "david nation", "time": 1493251410043, "rating": 4.0, "text": "Great selection of Chinese food. Grill is a plus.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "106993254669707487831", "name": "Michelle Riggs", "time": 1503704970927, "rating": 5.0, "text": "Delicious and great variety", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "113567169490953687112", "name": "Jeff Doby", "time": 1498407955486, "rating": 5.0, "text": "Best Chinese buffet left in this area", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107462922590031814248", "name": "Christian Leach", "time": 1483530154848, "rating": 3.0, "text": "Pretty standard Chinese buffet.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "106315894645601881987", "name": "Brenda Renee Batey", "time": 1511496836575, "rating": 2.0, "text": "Terrible,buffet had hardly nothing on it an the food was cold or had been sitting so long it was awful,dirty worse place.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107010911038982813590", "name": "Paul Haynie", "time": 1499968961269, "rating": 1.0, "text": "Food was horrible today. Service was even words", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "114149232632797290845", "name": "D C", "time": 1479768175386, "rating": 5.0, "text": "The best in Alabama for me at this time,", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107757320534897012452", "name": "David Gilmore", "time": 1508224986967, "rating": 5.0, "text": "Nice atmosphere, very clean", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "100141393239486406261", "name": "Joann Mayne", "time": 1507175462663, "rating": 1.0, "text": "Shut down, but food became poor quality before that.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "105589744528434950687", "name": "Stacie McGee", "time": 1502518551555, "rating": 1.0, "text": "Nasty. Rude. Horrible", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "104500776298412262686", "name": "C.Eric. Holcomb", "time": 1501844737240, "rating": 5.0, "text": "Good place to eat", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "105651958735581321300", "name": "Valarie S", "time": 1500608656520, "rating": 4.0, "text": "Honey chicken", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "118345203078517521603", "name": "judy free", "time": 1499791726463, "rating": 5.0, "text": "Food good.variety of foods", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "107834449310644123823", "name": "MG L", "time": 1499639527789, "rating": 3.0, "text": "Items on buffet stay basically the same", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "113522230852406728112", "name": "Rebecca Sargent", "time": 1498957363666, "rating": 1.0, "text": "Not impressed.... mold on silverware............", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "103760286217018886988", "name": "Keith Holcomb", "time": 1497670069735, "rating": 3.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "117427536231143846091", "name": "Dannia Kayrell Gutierrez Rubio", "time": 1495491985644, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "103849822095674963456", "name": "Matthew Brown", "time": 1511308478146, "rating": 5.0, "text": "I'm loving it", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "116804716005697797291", "name": "Charles Dillon", "time": 1491240397042, "rating": 5.0, "text": "Great food", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "103211045108225384943", "name": "Kerrin GhostDragon", "time": 1490269123929, "rating": 4.0, "text": "Great food.", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "103194965496498169553", "name": "Matthew Shook", "time": 1483021673984, "rating": 5.0, "text": "Great Food", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "102497877424218034654", "name": "Darian Lopez", "time": 1499466876766, "rating": 2.0, "text": "Horrible waitresses", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "113992394639662325247", "name": "MackVin", "time": 1485708994462, "rating": 1.0, "text": "Food for homeless 🤔🖓🖓🖓", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "104765099597893668691", "name": "Jana Gallahar", "time": 1509836928767, "rating": 1.0, "text": "Sucks has no flavor to the food and it doesn't have much to choose from I will never go there again. Waste of money", "pics": null, "resp": null, "gmap_id": "0x888bb3dfb17e3dab:0x9880cbb59376fb93"}
{"user_id": "105712095484590569895", "name": "Dani", "time": 1568958964280, "rating": 1.0, "text": "Bugs in my salad.\n\nBeware, you may get some extra protein in your food.. No telling how many gnats I ingested. They clearly don’t wash their food. I was shocked and never ate at Burke dining hall after this. Burke dining is disgusting. I wouldn’t be surprised if they have rats back there. Some of the workers UA hire need to be fired. They focus too much on football and not enough on their student’s health. What a shame. I wish I could post a picture because I do have a picture of it. Several dead gnats in my salad.\n\nUpdate: I was able to add a picture.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "110211274420912375731", "name": "Mary Beth Prondzinski", "time": 1571490917941, "rating": 3.0, "text": "Better than Lakeside!  Lovely cucumber infused water and Moroccan Chick pea soup.  *Note: this was last week's review.  They must have fired the cook because this week's faire was dreadful!", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "115781471874196116073", "name": "Gwendolyn Turner (Ginney)", "time": 1577236911436, "rating": 4.0, "text": "Clean friendly in order enjoyed", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "103697138077734813547", "name": "Brian Umble", "time": 1569657684001, "rating": 5.0, "text": "Daughter bought me lunch...at least she thinks she did. Absolutely loved it.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "109411422830335964456", "name": "Dalton Kulick", "time": 1543340690808, "rating": 3.0, "text": "It is often that the food is very good but it seems to be quite hit and miss. Half the time, drink machines aren't working, stuff isn't stocked, just simple things that are human errors. It is a good place to go, just expect frustrations at small things that shouldn't be misdone.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "114811907047369402005", "name": "Mark Smith", "time": 1559538889934, "rating": 5.0, "text": "Best in tha world pray my son get a free ride roll tide", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "114728503361415127993", "name": "Amanda Dykes", "time": 1559787500067, "rating": 5.0, "text": "For a school dining hall, it's really good and the employees are so great.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "105108058615276142988", "name": "Kismette G", "time": 1561855366531, "rating": 5.0, "text": "Excellent service and staff... and great food!", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "103857433614098597155", "name": "Rodney Lucio", "time": 1562722515198, "rating": 4.0, "text": "Pretty nice for an older dorm.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "116592203472359079427", "name": "Minnie Hooks", "time": 1548600522764, "rating": 5.0, "text": "Burke Dining Hall was great,enjoyed everything especially visiting my daughter. Dedasha Hooks", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "109117053607759091222", "name": "Rebekah Flowers", "time": 1499438285564, "rating": 5.0, "text": "I like this dining hall the most because it has a good salad bar and is usually less busy I've noticed.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "107678900419473707046", "name": "John Stabler", "time": 1519415385540, "rating": 3.0, "text": "Nice people and food was good if mediocre.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "113207094917108353346", "name": "Ron Swanson", "time": 1537445927290, "rating": 2.0, "text": "Meat is passable. Has a horrendous teeny bopper music soundtrack playing during all hours of operation. I commend the staff for working through this no matter how demoralizing that sonic garbage is. I would prefer to have my breakfast in silence.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "104706236253609484814", "name": "Kevin sellers", "time": 1534360707628, "rating": 5.0, "text": "Great salad bar, and many choices buffet style.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "103158034733124959869", "name": "Zach Weske", "time": 1518394376622, "rating": 5.0, "text": "Some of the best dining hall food on campus", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "100136534939047115474", "name": "Steve Wonder", "time": 1550087679446, "rating": 2.0, "text": "Food ok most workers looked as if they would rather be anywhere then there. No active supervision seen", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "117469499852448404012", "name": "Helena Johnson", "time": 1556740807587, "rating": 5.0, "text": "Food was good and fresh", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "110981142416337045618", "name": "Tonmoy Ghosh", "time": 1526216736502, "rating": 5.0, "text": "healthy food. large number of food collection.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "101413366718412423851", "name": "David Tidwell", "time": 1582310999387, "rating": 3.0, "text": "Food was a little dry", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "106226248649652165456", "name": "Priscilla Vincent", "time": 1558836789281, "rating": 5.0, "text": "Loved it.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "109254379459917273781", "name": "Maytreecia Harriell", "time": 1554318615834, "rating": 3.0, "text": "Nice facility...", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "103270281875973630747", "name": "Hunter Standridge", "time": 1530231723344, "rating": 4.0, "text": "Burke is my favorite of the dining halls.", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "105192147486022586066", "name": "Jackson Stellhorn", "time": 1540617446218, "rating": 5.0, "text": "2nd and 26", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "114311405011532436175", "name": "Wanza Wilson", "time": 1527084798609, "rating": 5.0, "text": "Great employees", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "117022401735539133364", "name": "Rickey Giddeon", "time": 1488492889224, "rating": 4.0, "text": "It's ok", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "111322020117892115564", "name": "Kyle Nadler", "time": 1447378767080, "rating": 2.0, "text": "at least it's not lakeside", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "104010032384461413477", "name": "rl caj (rl)", "time": 1429449644600, "rating": 4.0, "text": "WRONG HOURS ON HERE!!\n\nBurke\nSaturday     11:30 AM - 7:30 PM\nSunday       11:30 AM - 7:30 PM\nMonday       7:00 AM - 8:30 PM\nTuesday      7:00 AM - 8:30 PM\nWednesday 7:00 AM - 8:30 PM\nThursday     7:00 AM - 8:30 PM\nFriday          7:00 AM - 8:30 PM", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
{"user_id": "105761113625952976479", "name": "Nicolás Martorell", "time": 1550599265148, "rating": 3.0, "text": "(Translated by Google) I could have more variety\n\n(Original)\nPodria tener mas variedad", "pics": null, "resp": null, "gmap_id": "0x8886029ea799bc73:0x81f2a3359ee95354"}
