{"user_id": "110587710441011347388", "name": "Rassan Tarabein", "time": 1630531548935, "rating": 1.0, "text": "THIS IS THE MOST DESPICABLE SCAMMERS I EVER SAW IN MY LIFE !\nWe bought new Buick Encore from Chris Meyer in 2018 (now Tamron Buick Daphne). Yesterday it didn’t start, and we had it towed a guy from Tamron Buick service department (named Shay) called and claimed that the issue was a dead battery ask him for an authorization to replace it for $165 plus tax. It was stunning to hear this as the battery was replaced just last month from O'Reilly auto, who kindly accepted to replace the battery. Shay called back upset asking to authorize $50 charge to “spray the brand-new battery with sealant” to prevent it from corrosion and breaking down again. miss Becky at O'Reilly auto called and told me that Shay was a liar as she tested the old battery (which Shay claimed to be broker and wanted to replace). Shay ended up charging the amount of the battery anyhow.\nShay seems to be trained to scam as his boss, Kyle shamelessly stood by the scam and endorsed it.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "109531451077823168946", "name": "Queen Lewis", "time": 1629223054623, "rating": 1.0, "text": "I took my car in today needingServiceI was denied service being that another dealer  putting a battery in my car so they Responded  IT  couldn't be looked at it even after me telling disclosing I purchased my car from there, so I'm stuck not knowing What's going on with my car not to mention its a hybrid. It's very hard to find someone to check it VERY RUDE AND UNPROFESSIONAL SERVICE MAN!!  No customer service whatsoever  I WILL DEFINITELY TELL MY FAMILY AND FRIENDS TO NOT DO BUSINESS THERE ...SIGNED A DISGUSTED customer", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "115038595119831151371", "name": "Margie Cochran", "time": 1616205010537, "rating": 5.0, "text": "It was the most rewarding car purchase we have ever experienced. Absolutely no pressure and the fastest car purchase also.  Antonio the finance manager was friendly made our signing was a great experience.  He explained everything you would have thought some had given you your car the experience was absolutely fantastic.  Our salesperson was the best\nAlyssa Penne she never once pressured us.  Alyssa made sure we knew where the restrooms and their free cold water bottles was located.  The transition with Alyssa was very enjoyable.  Alyssa made you so comfortable you would thought she was your sister or best friend\nAlyssa greeted us with a huge smile ( so genuine).  Alyssa is a hometown girl and after you meet her and leave a little piece of her heart , kindness, and warmth stays with your soul. We will tell everyone to go to. CHRIS MYERS in Daphne and ask for Alyssa and you will leave with the car you want with NO STRESS.  When you leave with your car it will hit you and you will tell yourself we got the car we wanted and did not leave CHRIS MYERS stressed BUT relaxed and you will tell yourself that was the best calming experience we have ever had. SO GO TO CHRIS MYERS AND ASK FOR ALYSSA and she will do the rest.  Oh yeah one more thing she loves her GRANDPA. Her heart and soul shines through at the thought of her GRANDPA.❤❤  Margie and Larry Cochran.  Head to CHRIS MYERS in Daphne see Alyssa.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "100595374571299240919", "name": "Stephani Brock", "time": 1618973634508, "rating": 5.0, "text": "Absolutely pleased and just fantastic experience Brian Hanson is a great non pressure salesman.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "115633419578442808250", "name": "R1900", "time": 1606077006067, "rating": 1.0, "text": "Most of the 5 stars are from family and friends. Go look up youtube videos on CHRIS MYERS BUICK GMC. Just saw a video where Bryant, or whatever the manager/salespersons name is, threatened the customer how he will not make it home. Watch out for Tony Soprano there, fellas!", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "113146021585685043090", "name": "Mike & Kathy Estes", "time": 1610080276030, "rating": 4.0, "text": "Good place to look for a car or truck ,work's real hard to put you in a car.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "105782758694983535779", "name": "Steven Shelp", "time": 1606800646828, "rating": 1.0, "text": "Deleted my review... great business practices......now you’re really sharing your true colors", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "105639054243090130814", "name": "Tami Harris", "time": 1598658774047, "rating": 5.0, "text": "I am a repeat client with Chris Myers.\nAlways happy the way the buying process is handled.\nAnd feel appreciated for being a customer", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "102186563576294763438", "name": "Dakota Clevenger", "time": 1585163991644, "rating": 5.0, "text": "I cannot thank Chris Myers Service department enough for their professionalism.  Kyle and Shay did an outstanding job!  I will always use the service department at Chris Myers Automall.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "110753885346641291413", "name": "Elizabeth Anne Sclater", "time": 1575177497088, "rating": 2.0, "text": "I question the ethics of this company regarding their service department operations. Their web site lists a certain price for one of the routine maintenances ... only as I was dropping off my keys was I told that “oh, the web site is wrong, there are other things we do at that mileage ...” and the final bill was more than double what the web site indicates.\n\nI have no reason to believe that the *quality* of the work is lacking, but that change-up between web price and final invoice leaves me terribly skeptical. At best it’s a lack of attention to honest detail in their advertising; at worst, a blatant bait/switch. Friendly people, but I do not trust them.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "115853470607710304132", "name": "Hornaday quickfire", "time": 1588481768106, "rating": 5.0, "text": "I've always had good customer service here.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "105247781336453053469", "name": "Jesse Hoffmann", "time": 1599335906458, "rating": 1.0, "text": "Total scam of a dealership. If you don't believe it, you'll see for yourself. *Don't buy here*", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "110878888795343627397", "name": "Teresa McCardle", "time": 1590600212851, "rating": 5.0, "text": "This is an awesome dealership with outstanding customer service!!", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "111336792867861944387", "name": "Mr. B D", "time": 1567601394739, "rating": 4.0, "text": "I cannot speak on the dealership itself as this is for the service department. They took care of a problem that my local dealership refused to acknowledge existed. Under warranty. I will recommend their services.", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
{"user_id": "108204103761593100627", "name": "Ben Cason", "time": 1601268049658, "rating": 5.0, "text": "Great place to buy a car", "pics": null, "resp": null, "gmap_id": "0x889a432fea5a1821:0x88d2d8ec001e2cc6"}
