{"user_id": "110326021796232120349", "name": "Danielle Morrison", "time": 1620143736006, "rating": 5.0, "text": "Foxcrete did a wonderful job from start to finish. We did a quick quote online and then decided we wanted to do something a little more detailed. I called and spoke with Blake and he walked me through all of the options. I then worked with Debra on scheduling. Debra also met me at a nearby home to show me a past job they had done to make sure I was 100% happy with the colors and style we picked out. Debra also came to our home for the color consultation. Everything was very smooth. Team arrived to form the patio and then a few days later Blake and team arrived to pour the concrete. He double checked with me and my husband every step of the way to make sure it was what we wanted. It turned out amazing and I wish we would have hired them sooner. We are already enjoying our patio so much and would absolutely recommend their services to others. Priced well, great communication, and great execution! Thank you, Foxcrete!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMixxPM9uKrl6I6ohBhb8pRDydSo7WzIshvQpbd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6r7Vx8khrqxA-D02JIaFLw78KXXvuA9geaK3u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPP7Gsby0wCazoNmE5RSe7A8AcFdQjVFblhEa_i=w150-h150-k-no-p"]}], "resp": {"time": 1620144544858, "text": "Thank you so much for taking time out of your day to write  this detailed review!\n\nWe enjoyed working with you and we are also thrilled with the results!\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109948715155159454899", "name": "David and Diana George", "time": 1629242939753, "rating": 5.0, "text": "Fantastic experience from the first phone call all the way through completion of the job.  They poured a concrete patio in our backyard.  Great quality at a fair price.  The crew was professional, friendly, and cleaned up the site when finished.  If you are in need of a patio, sidewalk, driveway, or any other concrete project, I highly recommend checking them out.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "114989331436533396605", "name": "Andrea Osika", "time": 1622157014366, "rating": 5.0, "text": "Very happy customer!! From the user friendly website to the professional installation of patio. Blake and his team provided excellent craftsmanship and superior knowledge throughout the process.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110358103911201668366", "name": "Zachary Dinkins", "time": 1617919452186, "rating": 5.0, "text": "Blake and his guys finished my entire driveway in just one day. Everything from removing the old driveway to getting the new one perfect. They stuck around to clean up everything and paid attention to all the details. Every person I talked to with this company has been very nice and professional, and very responsive.  I never had a single question go unanswered during my business with Foxcrete. I definitely recommend Foxcrete to anyone looking for a company who specializes in this type of work.", "pics": null, "resp": {"time": 1618709098292, "text": "Thank you taking time out of your life to write us this review! It means so much to us! Thank you again!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "115080663092061095518", "name": "Brent Bailey", "time": 1622243869011, "rating": 5.0, "text": "Foxcrete poured and finished a patio behind my pool.  It was a technically difficult job due to access and slope.  They did a great job. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116630994050966924919", "name": "Lynn Chavarry", "time": 1604697613231, "rating": 5.0, "text": "Professional, friendly, and trustworthy. Great work ethic and beautiful job on my floors ... I consider it art! I highly recommend Foxcrete.", "pics": null, "resp": {"time": 1604699401990, "text": "We have had so much fun working with you both! I am incredibly thankful you chose our company to install this custom flooring for you guys! Customers like you and Maurice are few and far between, and makes me want to do more of these style jobs! Who knows what the future holds!\n\nAgain, thank you so much!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110031074550921898559", "name": "John Eichner", "time": 1592866294519, "rating": 5.0, "text": "Foxcrete is one of the best.  They just finished a job for a concrete pad for a swimspa and our experience with them was amazing.  They are very professional and the work is top notch.   Josh was extremely responsive and great to work with.  I HIGHLY recommend this company!", "pics": null, "resp": {"time": 1592914204709, "text": "Thank you for the opportunity. It was a pleasure working on your project."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "106644215430394359765", "name": "Carrol Basham", "time": 1586464292855, "rating": 5.0, "text": "Foxcrete is AWESOME!  They came out and poured a back patio for us. All of the guys were super nice and friendly. And the concrete work is the best I've ever seen. They went above and beyond for us. They encountered a couple surprises when digging out the area, but worked through them and were super reasonable.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "104853320201209049413", "name": "linda Ziglar", "time": 1591019610640, "rating": 5.0, "text": "Foxcrete was recommended by a neighbor and when we saw the quality of work they did, we didn't bother to look elsewhere. Our patio is more than our greatest expectations! Josh and his crew did an amazing job!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110071034869608249605", "name": "Andy Marr", "time": 1581001883258, "rating": 5.0, "text": "Foxcrete construction was one of the easiest, most professional and downright fastest companies my wife and I have ever worked with, and we have done a Ton of home alterations and improvements.\n\nFirst of all, Josh is the guy to work with. He is professional, knows his craft, and came out to our house often. We wanted to put in a curved edge patio and he came out and measured the land, staked out the space and figured out what would work best. Our schedules didn't align at first but we made it work once we figured out a workable timeline. He came back a few more times and we discussed color of the concrete, size, dimensions, drainage, and a bunch of other details. He was patient and hear do us out, and you could tell he was excited about the project.\n\nWhen the crew showed up they were fast, professional, and methodical. They know their craft. They worked from 6am to 7pm some days, going over the details, re-laying sod, cleaning up spills or little messes (nothing major just normal stuff from the construction), and generally just making the backyard look good again.\n\nAnd the finished product is exactly what we wanted! Josh kept telling us to trust him, he had a plan, he was going to pour some creativity into our project and we wouldn't be disappointed. And he was right! Our once ugly backyard patio space now looks like something out of a magazine! The form is beautiful, it makes our yard flow, and it is just a fantastic job. I HIGHLY recommend these guys. They'll give you what you're looking for and their highlights and creative choices will only improve on your original idea! Great company, great employees, great final product! Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109357755128379619500", "name": "David Johnson", "time": 1597203867221, "rating": 5.0, "text": "All the guys were very professional and very happy with the final product. Would highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "102944685546955656084", "name": "Bruce Streeter", "time": 1565908322693, "rating": 5.0, "text": "Foxcrete is highly recommended.\nCalled for a survey Saturday afternoon expecting a response later in the week. Received a call that same afternoon and had a survey scheduled early into the next week.\nJosh was fantastic walking me through all my options and listening to my requirements. Received a quote meeting my specs in short order.\nInstallation is complete and could not be happier. Everyone on the crew starting with Blake and Scott to each and every helper, were courteous and caring for needs and my yard. They worked quickly and efficiently but most importantly left with me satisfied. My back patio and driveway extension could not have turned out better. The mess was minimal and where there was any issue, it was taken care of before the crew was finished.\nI cannot thank Blake and Josh enough for the commitment to excellence they provided on my project.", "pics": null, "resp": {"time": 1566611761423, "text": "Thanks for allowing us the opportunity to serve you Bruce! This is a fantastic review! We greatly appreciate the time you took to write this! Hope you are enjoying your patio!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112931702073710870203", "name": "Kimberly Griffin", "time": 1580339110560, "rating": 5.0, "text": "We are one of the contractors that pumps concrete for Foxcrete. Very professional group of men and women. Their eye for detail and design skill should rank with the best of concrete contractors. I like to joke with them that their work should be required to have a warning label. If for any reason it needed to be demolished another contractor will never assume it built with that much integrity, even on simple projects. Their use of metal and custom concrete mix design far exceeds the code in our area.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113237987449126181411", "name": "cary pt", "time": 1588695934004, "rating": 5.0, "text": "Blake and his crew are top notch. They do great work on time and on price. I would definitely use Foxcrete again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110574801703724082241", "name": "CoolbeansXVI (CoolbeansXVI)", "time": 1580159771838, "rating": 5.0, "text": "I've worked with Foxcrete for almost a year now. Never have I worked for a company that cares so much about not only their clients, but their employees as well. I'm very proud to work along side such genuinely good people every day. I can't wait to see what the future holds for everyone here at Foxcrete. #FoxcreteFTW!", "pics": null, "resp": {"time": 1580329890475, "text": "I have always thought, you can tell a lot about a company by the way they treat their employees! The fact you went out of your way to drop a kind word, means the world to us! We are proud to have you and appreciate all you have done for us!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109466660462207695104", "name": "Stevie Cordts", "time": 1559177935136, "rating": 5.0, "text": "We loved working with Foxcrete! From the moment we contacted them to the finished product they were professional, on time (!), reasonably priced and just awesome. We are so happy with the work they did!", "pics": null, "resp": {"time": 1559185824311, "text": "Thank you guys for trusting us with such an important upgrade! You guys were hassle free to work with and we truly appreciate that! I know you guys will enjoy the new space!\nHappy Summer,\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110494911923862327583", "name": "Larry S.", "time": 1511912343947, "rating": 5.0, "text": "Blake, Tommie and crew did an outstanding job.  From the first meeting to understand what we were wanting to wrapping up and explaining the upkeep they were nothing but a pleasure to work with.  We had a patio, seating walls and concrete fire pit.   Exceeds all expectations!  The area is awesome...can’t wait to use the firepit.  Thanks again!!", "pics": null, "resp": {"time": 1511969278251, "text": "Larry, thank you for allowing us to showcase our artistic ability at your families property! We had a great time working with you all and the hospitality you shown our crew was second to none!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109414030024803932595", "name": "Clay Thompson", "time": 1492660833715, "rating": 5.0, "text": "I exclusively use Blake at Foxcrete Designs for all of our decorative concrete pool decks. Blake surpasses my expectations when I throw any type of custom and very challenging concrete work. Everything we do is completely one off and they make it look so easy. I would not turn to anyone else for all of my concrete needs. Best in the business and class act guy. If you are looking for the best concrete contractor in your area then these are the guys. Thanks Blake.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116980684199466851467", "name": "Carol Frey", "time": 1522554489649, "rating": 5.0, "text": "I can't say enough about Foxcrete Designs and the fantastic job on my patio extension.  Blake was great to work with from beginning to completion.  Blake and his crew were professional and respectful, very neat from beginning to end, and their attention to detail was impressive.  I now have a beautifully finished patio which exceeded all my expectations.  Thank you, Blake.  Job well done!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111080865692754184169", "name": "Ellen Belcher", "time": 1563292811537, "rating": 5.0, "text": "Foxcrete Construction Group is one of the best companies I’ve worked with. They were professional, worked efficiently and did what they said they would do. We couldn’t be happier with our new driveway!", "pics": null, "resp": {"time": 1563293602073, "text": "Thank you for taking time out to write this! It is so very much appreciated! Online reviews are the new word of mouth, so we are honored you would vouch for us like this! Hope you guys are having a great summer!\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113897357965276120311", "name": "Chat Rierdan", "time": 1571452404784, "rating": 5.0, "text": "Foxcrete is one of the best companies I have ever worked for. They not only showed me how to finish concrete but how to do it the right way.....If that makes any sense.", "pics": null, "resp": {"time": 1571457327259, "text": "Thanks for the kind words Mason, we wish you the best in your new endeavor and thank you for your time spent with us!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109794773887708670231", "name": "Elizabeth Butts", "time": 1515969559565, "rating": 5.0, "text": "The Foxcrete team is amazing! We have built many homes and by far they provided the best concrete service we have ever experienced. They are very professional offering a wide range of creative services. Our carport and workshop areas are really nice and our stamped interior floor and porch floor is going to be beautiful!", "pics": null, "resp": {"time": 1519434406943, "text": "Thank you Mrs. Butts! You both were amazing to work with and look forward to more projects in the future!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "115620912767554848164", "name": "Warren Wood", "time": 1563754711772, "rating": 5.0, "text": "Anyone looking for a concrete contracting company should not hesitate to contact Foxcrete Construction Group. They are an exceptional concrete contracting company that most definitely puts the customer first. They went way out of their way to ensure they had a satisfied customer with our project and believe me, we were not an easy customer to please. They had to continuously answer questions and listen to our concerns but did so with nothing but professionalism. They take pride in their work and have been very professional throughout the entire process!\n\nWe went with the stamped concrete design with colors to blend well with our brick. We were unsure of the colors and how they would look next to the brick on our house, but with their experience and knowledge they were able to give us what we wanted. The colors are as close to perfect as you can get!\n\nWe've never known anyone personally that had a stamped concrete patio or have ever viewed a stamped concrete patio of this design, other than in pictures, so fully understanding the process and the amount of work it takes to build a patio, such as this, was beyond our full comprehension. It takes a lot of work, skill and somewhat of an artistic eye along with exceptional pride to produce a nice product. Foxcrete did just that!\n\nThe patio is designed with the appeal of a paver patio, but without stones that will move. The brick lined edge comes down the side walls of the patio giving it a realistic appearance of brick pavers. The colors are a mixture of browns and tans, with the brick edge being a darker color than the inner area of the patio giving it a distinct framed look. We love this design and the colors!\n\nThank you, Josh and Foxcrete Construction Group, for doing such a fantastic job on this patio! The final product proves that you care and take extreme pride in the work you do!  It's a beautiful patio that I'm sure we will enjoy for many years to come!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111401497113558733899", "name": "Sharon DeWitt", "time": 1374171909527, "rating": 5.0, "text": "Foxcrete Designs is the place to call for all of your concrete design needs.  Blake did an overlay for us and did a fabulous job!!!!  He called and kept in touch during the entire process.  He is so easy to work with and he does what he says he will do. We love our porches and he is now going to do a stain on our garage floor. Great experience!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112450691688181935071", "name": "Chris Wilson", "time": 1617040590385, "rating": 5.0, "text": "These gentlemen are true craftsmen.", "pics": null, "resp": {"time": 1618709125644, "text": "Thank you for the kind words!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111043966621077885846", "name": "Juan Gastaliturri", "time": 1505842379221, "rating": 5.0, "text": "Before selecting Blake as the concrete contractor for my project, I interviewed and received bids from four other contractors. In the end, Blake earned my business for some very important reasons. He was completely upfront with the details and expectations of the job. He has a talent and a critical eye for details which he demonstrated through his diligence and hard work. He was very profesional, explained everything, showed up when he said, did an amazing job and we couldn't be happier with the finished product. I made the right choice with Blake and will absolutely recommend him for your project.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "108882500101616455609", "name": "Kim Myers", "time": 1519432956281, "rating": 5.0, "text": "They did a wonderful job and we're able to do all work without someone at the house! He even came back and put grass back around the new concrete!  Best price by far", "pics": null, "resp": {"time": 1519434296684, "text": "Thanks for the kind words!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "118158979068460049119", "name": "IthinkIfellupthestairs", "time": 1519689670625, "rating": 5.0, "text": "I had to have my driveway completely replaced and Foxcrete did a fantastic job. They were here in a timely manner. I would recommend them for all your concrete work. If I ever need any work done again they are who I will call.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113600908368801381175", "name": "Kristin Bourgeois", "time": 1525202983173, "rating": 5.0, "text": "I am flattered by the honesty and integrity this company stands for. They are always doing the best job they can with a smile on their face! Great people!", "pics": null, "resp": {"time": 1525211760781, "text": "With over 30 years experience we have always strived to be honest and have integrity. We greatly appreciate the review"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "101480190180397054178", "name": "Robert Baus", "time": 1334245610740, "rating": 5.0, "text": "We were very impressed with Blake and the work he did for us.  We thought we knew what we wanted and Blake made up a sample and showed it to us.  Turned out we wanted something different.  Blake made suggestions and patiently worked with us step by step and we were thrilled with the finished results.  Blake is a true professional and customer service and satisfaction are top priorities with him.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "100903750800562166454", "name": "dukhunter1972", "time": 1538851941693, "rating": 5.0, "text": "Wow, I have to say we are super impressed and happy with the way our pool deck turned out recently. It looks fantastic. Our pool concrete and Kool Deck coating was performed by another company about 8 years ago and the Kool Deck began separating from the concrete recently. Blake and Josh came out to  look at it, determined the issues, and developed a plan to repair it.  I can hardly tell where the concrete issues were before and anyone that sees it now would never know there had been an issue. They did a great job not only repairing it but also blending it into the existing decking and color. Their professionalism and attention to detail is incredible. Customer service is their number one goal and in the business world today, that is truly hard to find. Give Foxcrete a call for your next project, you’ll be glad you did.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "107317983663779951558", "name": "robert darnell", "time": 1498446179324, "rating": 5.0, "text": "Blake was very professional and did a great job on our sunroom conversion. He did great making the color match our floors throughout the rest of the house. It's amazing.  He always answered  or returned our phone calls/texts/emails and was always on time. He also finished our project on time even with weather delays by working extra. I can't say enough good things about the quality of work and overall great experience we had.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111760661708465695530", "name": "Marianne Cash", "time": 1521493269958, "rating": 5.0, "text": "I just called Foxcrete about coming out to repair a botched job at my home by a non-professional. The owner was so helpful that he gave me advise that saved me from $5,000-$8,000. He even went so far as to suggest the color of paint I need to make this project look decent. He offered to refer me to someone else who could work me in sooner than May if I did not want to follow through with his suggestions. He spent lots of time on the phone asking specific questions and was extremely knowledgeable about every single issue I had.\nHe did not make one cent from this phone call but was willing to offer many solutions to help us.\nIf I was not moving, I would hire them to re-do this entire project.\nI am extremely grateful for this company!", "pics": null, "resp": {"time": 1521508938212, "text": "Thank you so much for taking your time out to write this! This was completely unexpected!\nI tell folks this all the time! Advice is always free!\n\nHope my suggestion brings some comfort to your situation!\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "103915776161982385455", "name": "Louanda Gerard Henderson", "time": 1525142264753, "rating": 1.0, "text": "Called this am for a quote on concrete staining in my 2600 Sq ft home.  Wife answered and advised they could come today, but we wouldn't be home, so then advised they would come on Sunday after \"Church\". Husband called back not even an hour later asking if my home was new or existing construction.  I advised existing, and explained to him my wood laminate had been damaged and we just received money from insurance company. He then told me that they are very picky about the jobs they take on and that they don't like to do existing construction because of the damage THEY could cause to cabinets, or walls. He advised me we would be too much trouble.  Kept saying how picky they are with taking on jobs...could it be that we are black and THAT'S the REAL reason?  Why didn't the Wife tell me this initially?  Guess we'll take our 15,000.00 elsewhere. Very bad customer service.", "pics": null, "resp": {"time": 1525197116958, "text": "My wife is strictly office only and I handle the estimates. Our company at this time is not set up to do acid stains or dyes on interior Jobs unless they are new construction or remolding jobs. I apologize if I did not convey myself clearly.  We at Foxcrete take pride in giving great customer service and quality service.\nSincerely Scott Henning"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "101839177245416871854", "name": "Sherilyn Donnelly", "time": 1506724717707, "rating": 5.0, "text": "Blake and his crew at Foxcrete rock!! He did our entire house and front and back porches. It is all beautiful!! See photos for the super awesome design they did in the foyer!", "pics": null, "resp": {"time": 1506718776610, "text": "You guys are the real MVP! Thank you for choosing us and allowing us to be creative!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113093372699382236259", "name": "Brenda McCollum", "time": 1511815237580, "rating": 5.0, "text": "From design, to construction, through completion, Foxcrete did an outstanding job extending our patio. We enjoy it every day as it's a great place to entertain friends and  family, or just for the  quiet solitude it provides.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116758151994776345942", "name": "Sommer Lowry", "time": 1525204588536, "rating": 5.0, "text": "Remodeling can be a very stressful time, so it makes all the difference in the world when companies and there staff provide outstanding service, and that is exactly what I received from Debra and Scott Henning, not only did they ease my frustrations, but they went above and beyond their call of duty to make sure I had all materials needed to complete my project. I would highly recommend Foxcrete to ANYONE, ANYWHERE in the world, they were truly amazing.", "pics": null, "resp": {"time": 1525211368003, "text": "Thanks Sommer for the review we really strive to provide quality work and customer service"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109410456131692593649", "name": "Josh Williams", "time": 1534194918085, "rating": 5.0, "text": "Super efficient and flexible to work with. They catered to our wants and come up with an very creative idea that was amazing.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "107847295712547705318", "name": "Curtis Zimmerman", "time": 1596027843389, "rating": 3.0, "text": "Looking foward to getting things done.", "pics": null, "resp": {"time": 1596022949212, "text": "We look forward to working with you as well Mr. Zimmerman."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "100299094162343896671", "name": "Al Simmons", "time": 1520126799599, "rating": 5.0, "text": "I had a massive root problem that destroyed my driveway. Blake and crew removed the old driveway, dug out the problem roots and poured a really nice and strong new driveway that even the neighbor kids like to play on. Thanks Blake for the great work.", "pics": null, "resp": {"time": 1520298104189, "text": "Thanks Al! Glad to see it’s getting some good service from the kiddies!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "104605792411016688366", "name": "Michael McKown", "time": 1560789391239, "rating": 5.0, "text": "Foxcrete Construction is an outstanding concrete contracting company that takes great pride in their work, provide a exceptional quality product at a fair and reasonable price. I would highly recommend them for any concrete specialty work.", "pics": null, "resp": {"time": 1560851929348, "text": "Thank you Michael it was a pleasure working on your po project."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "105086086227572104599", "name": "Mary Hempfleng", "time": 1478555346516, "rating": 5.0, "text": "Thank you FOXCRETE DESIGNS! I would highly suggest Foxcrete to anyone looking to get straight forward high quality concrete work.\nWe knew we wanted stained concrete floors prior to the start of our build however by the time it came to do floors there were SEVERAL issues with the concrete; footprints, broken out concrete, gouge marks, stains from red clay & cedar.  Our builder, Eric Craig Custom Homes (Fantastic builder/excellent experience) hired another company to score & stain the floors.  My husband & I stopped by the house during the scoring process from the first company and immediately stopped work & started brainstorming with our builder about other flooring options.  Eric had Blake from Foxcrete Designs come out & take a look at our \"complex concrete job\" & give us his professional opinion on the outcome of moving forward with stain/scored.  Blake walked us through the issue spots & his remedies for those areas & gave us his opinion on what the final outcome would look like; nervously we took a chance & so glad we did!  My floors look amazing, truly beautiful!  Blake/Foxcrete are a very professional service that take pride in their work.", "pics": null, "resp": {"time": 1478564483557, "text": "Thank you for the kind words! This floor was a true challenge for us! I couldn't be happier with the results!\nProfessionally yours,\nBlake Henning"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116824118935125335094", "name": "Amber Dubuisson", "time": 1534194815651, "rating": 5.0, "text": "Me and josh used these professionally concrete guys and were very pleased with the quality.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111736768042110522293", "name": "Hannah Franklin", "time": 1399644852909, "rating": 5.0, "text": "I love They're work. They did a great job for my family's patio. The woodcrete look is just fantastic. My grandparents also received an acid satin that they are very happy with. Blake is a very busy person and very good hearted. He gives his best 100% everytime despite hardly ever getting a day off. He is a full time fire fighter and running His business Foxcrete full time. But all that aside he does great work! 👍 highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109656374695271117030", "name": "Tim Kearns", "time": 1494954793658, "rating": 5.0, "text": "Blake is outstanding. Extremely professional, very fair, excellent work.  The only concrete professional in the area that provides quality work. Highly recommended!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112706835139296307982", "name": "Don Grice", "time": 1517531709536, "rating": 5.0, "text": "Foxcrete restored our floors and porches and exceeded our expectations in the process! Blake and his teams work was done both professional and well.", "pics": null, "resp": {"time": 1517532802751, "text": "We appreciate the kind words! It truly is a team effort for a great project. From great homeowners to the installation crew!  🙌🏻🙌🏻"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "104119586913542149421", "name": "Lauren Ellis", "time": 1525204486403, "rating": 5.0, "text": "Foxcrete is nothing but professional and does top quality work. The customer service is unbeatable and I would recommend them to all!", "pics": null, "resp": {"time": 1525211508703, "text": "Thanks for taking time out of your busy schedule to write us a review. It’s always a great pleasure working with great customers"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110799152472443180845", "name": "Skotty Smith", "time": 1540130739452, "rating": 5.0, "text": "Good people", "pics": null, "resp": {"time": 1540155034611, "text": "Thank you for the 5 star we greatly appreciate it."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
