{"user_id": "108351957672070451415", "name": "Remain Nameless", "time": 1625696759826, "rating": 5.0, "text": "Ward.... you were a little hard on the Beaver. The worst place in Oxford is on the south side of Hwy 78 East. The BEST place is A&B and they are located on the north side of 78 just east of Hutch Touch. I'm in retail sales in the trailer industry myself and A & B Trailers is my go to source for information, parts, and trailers. If  I have a question about ANYTHING in regards to dragging a wagon... A&B Trailers.. Knowledge level? I'll put it this way; theres not anything they can't  cover on your trailer.  I promise, they will never lead you wrong. These guys are not pencil pushers that have sit behind a desk all of their lives. They are blue collar, hard working, hands on, highly experienced fabricators and they know their stuff. If you want to spend half of your retirement on junk just to have it fall apart in a few months, then go across the street and shop with Ward. Now if you want an extremely well built, solid piece of equipment at a reasonable price  from an excellent company that stands behind their product AND appreciates their customers?... Welcome home family!! You are in the right place. A&B Trailers. You won't find better people anywhere and let me just add this in there.... these cats are Perfectionists. I know. I have worked side by side with them in a fab shop and I am a perfectionist also, but these jokers....well they take it to a whole nother other level. I will take an oath to say, \"They do things at A&B with a whole bunch of heart and a truck load of pride. It's done once, done right, and that's the product they will provide you every single time. I highly recommend A&B Trailers for all of your parts, accessories,  tires, wheels, batteries, or even if you are looking to upgrade with a brand new piece of pride attached to your vehicle.. Come on down to A&B. I'm sure glad I stopped here. Received a solid product and made two friends for life. Where else can you get service like that? A&B Trailers. Ask for Andy or Barney. NO need in referencing my review. They'll know who sent ya when you call them by their names 🤣", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "104375517629357760498", "name": "Helen White", "time": 1610829596860, "rating": 2.0, "text": "I orginally posted a 5 star for this company. But after the delivery of building I purchased, very disappointing experience.  The delivery driver charged an additional $100 for the height and still wasn't at the height for the charge. We had to redo all blocks because it wasn't level or supported correctly. Was basically told not responseable for third party, I didn't purchase it from third party purchased from this business.", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "106890390879591004809", "name": "Fred Luhn", "time": 1601319542310, "rating": 5.0, "text": "Always a great experience here. Guys there are always helpful and pleasant to work with.", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "107259342179334744693", "name": "Yansi Taboada", "time": 1627338239356, "rating": 5.0, "text": "Truly amazing", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "100765945374256710859", "name": "Ian Hutchins", "time": 1598540567529, "rating": 5.0, "text": "Always been a good experience and the staff has always been nice!", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "114101882504774297237", "name": "Jack Witteveen", "time": 1597183177282, "rating": 5.0, "text": "to those of you who have posted a negative comment, tell the whole story so that we all can understand!! thank you", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "117344392039055704868", "name": "Wesley Elkins", "time": 1563376276116, "rating": 1.0, "text": "Rude staff and we're no help I wouldn't stop here if I were you", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
{"user_id": "113574574772820989533", "name": "MIKE Armstrong", "time": 1367849753885, "rating": 5.0, "text": "Gentleman & scholar, fun to play with & loved his music", "pics": null, "resp": null, "gmap_id": "0x888bb1986beb8101:0x586c73bb92afd432"}
