{"user_id": "105111037758477811714", "name": "Alvin Irizarry", "time": 1583346363947, "rating": 5.0, "text": "I rarely write reviews. However, their amazing display of professionalism and quality can't go unnoticed. From day one, Brad treated our shelter needs with utmost diligence. After we talked on the phone, he came to our house a few days later with several shelter designs, and plans for us to choose the best shelter and location in our garage. After a few weeks, his team came to our house and the custom shelter was perfectly installed. We couldn't be happier with results. BTW, they also have a military discount.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMs6M4_HPTixTyBsRr89yZzffIAEjIJ8M5xDz4Y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2-3S1u95oDUGfXDgsoebX9GGAaa9Z_Vs1wZJ0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "118331065614932328886", "name": "Laura Wainscott", "time": 1582660559907, "rating": 5.0, "text": "After a very bad storm in our area I decided  the only way we’d feel and actually be safe, in the next bad storm, would be to buy a shelter. After some research we decided to go with Storm Guard Shelters. The product is super solid, the install was flawless and quite impressive and the price was very reasonable. We are so happy to have an easily accessible shelter in our garage and I now have much less anxiety about storms that come our way.", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "115493851499107891293", "name": "Roger Tate", "time": 1582664409244, "rating": 5.0, "text": "We love our shelter! From the engineering to the installation,  it is a 1st class product and their customer service is outstanding! Highly recommend this company!\nRoger Tate", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "108073441304720211653", "name": "Amy Brazier", "time": 1576185234853, "rating": 5.0, "text": "Food was great, nice atmosphere. They made me banana pudding because I visited on my birthday and it was delicious! !", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "117023880974539626724", "name": "Patrick Walton", "time": 1582740426429, "rating": 5.0, "text": "I have purchased from this company before and have been well satisfied with their prompt delivery and service team that installed my unit.  My family feels well protected by the product this company provides.", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "101954592203863368138", "name": "Mike Terry", "time": 1582654501664, "rating": 5.0, "text": "Quality product that gives piece of mind during severe weather. Extremely pleased with our Storm Guard safe room.", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "114690648346859353600", "name": "Sarah Fisher", "time": 1488420058249, "rating": 5.0, "text": "We absolutely love our new 4x6 storm shelter! Brad was a pleasure to work with. He was able to answer all our questions and was able to install our shelter quickly. Very professional, outstanding product! We are extremely pleased!! We recommend Storm Guard shelters to all our family and friends!", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
{"user_id": "105445962945952282006", "name": "Anne Adamek", "time": 1582895112595, "rating": 5.0, "text": "Brad and his installers delivered good service and a great product at a lower price than other companies in the area.", "pics": null, "resp": null, "gmap_id": "0x886212f000000001:0xb8a161ba8bca8dd3"}
