{"user_id": "117654515076987398610", "name": "Haley Coltharp", "time": 1627397205834, "rating": 5.0, "text": "Great experience with Riaan inspecting our house. HIGHLY RECOMMEND!! Professional and timely.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112344829251245289863", "name": "Connie Pugh", "time": 1629128067490, "rating": 5.0, "text": "Thank you for your SERVICE. I will follow up as suggested before doing any further testing.\nYour services were Excellently provided, and beyond HELPFUL!!!\n\"Your quality of services and professional qualities are extremely hard to find these days!!!\"\nThank you. Connie Pugh", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103456969172649054439", "name": "Lori Nettleingham", "time": 1618267427556, "rating": 5.0, "text": "One of the most detailed and thorough home inspections I have ever had done. The report was completed within hours of inspection being done. Pictures helped to explain potential issues. Very easy to understand.  Excellent job. Would not hesitate to use again.", "pics": null, "resp": {"time": 1619435041330, "text": "Thank you so very much! It was a pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104334990006671570595", "name": "Melanie Shong Helm", "time": 1619376483950, "rating": 5.0, "text": "Quality, thoroughness, exceptional use of technology and expertise on inspecting new roof for leaks, water intrusions and thermal imaging as well as new construction. I called and the very next day he was out to my home. He spent over 3.5 hours looking at every concern I had. He was not biased either toward me or toward the original contractor- he was honest - based on knowledge and skill. I would not hesitate to recommend or use his services again!!", "pics": null, "resp": {"time": 1619434976787, "text": "Thank you so very much for taking the time to review us! We really appreciate it and it was a pleasure working with you!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112051721162388191003", "name": "Charise Barlow", "time": 1621278950419, "rating": 5.0, "text": "Hired this company to do a pre-purchase inspection after a recommendation from a colleague. Scheduling the inspection was easy to do. The site was clear and easy to understand. Super professional and delivered a fantastically detailed report same day. 10 out of 10 would highly recommend.", "pics": null, "resp": {"time": 1624754522095, "text": "Thank you so very much for taking the time to share your experience. It is greatly appreciated and we wish you all the very best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102687400650900743745", "name": "David McCune", "time": 1619633822853, "rating": 5.0, "text": "Great experience with Home Boss/Riann. Showed up on time. He was very thorough in his inspection.  The report was emailed to me within an hour after the inspection was finished. I will now be able to make an informed decision as to whether to buy this house and feel confident in my decision.", "pics": null, "resp": {"time": 1619785162185, "text": "Thank you so very much Mr.McCune for taking the time to leave us a review. We really appreciate it and it was a pleasure conducting your inspection. Wishing you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "110396343362163884057", "name": "vicky Harris", "time": 1624163367417, "rating": 5.0, "text": "Riaan answered all my questions quickly and thoroughly.  Excellent service!", "pics": null, "resp": {"time": 1624754219744, "text": "Thank you so very much for taking the time to review our service. It was pleasure doing your inspection and we wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117994935870514988181", "name": "Gabriel De Moske", "time": 1628622342597, "rating": 5.0, "text": "Highly recommended on all aspects of service. Had a short closing date and was able to schedule an inspection quickly on the company's online scheduler. Inspection was very thorough, the inspector allowed us to be present, and went over the report in-person, which not all inspectors will do. This allowed me to look at the flagged issues with the inspector present instead of trying to find the locations myself or just looking at a photo. Inspector advised me that an extra service I had paid for in advance was not necessary and refunded the extra charge.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115277465908155636079", "name": "Jefferson P Mostellar", "time": 1624051547104, "rating": 5.0, "text": "Riaan was Awesome! He was very thorough and professional. Would use again and highly recommend!", "pics": null, "resp": {"time": 1624754276352, "text": "Mr.Mostellar. Thank you so much for taking the time to share your experience. I is greatly appreciated. We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115283524921437738210", "name": "Randolph Young", "time": 1627505325476, "rating": 5.0, "text": "He is by far the most thorough, paying attention to every detail. If buying a home or even selling, you can’t go wrong using Home Boss.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104002021948195748732", "name": "Kent Sumrall", "time": 1618341637404, "rating": 5.0, "text": "Riaan was great. Communication was clear, service was courteous, inspection was thorough and final report was a huge asset during the home sale transaction. He also took the time to verbally explain the issues in lay language.  Highly recommend him.", "pics": null, "resp": {"time": 1619435018882, "text": "Thank you so very much! It was pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101802334317426087366", "name": "Ben Kaminsky", "time": 1615740333864, "rating": 5.0, "text": "This was my first time using Home Boss for a home inspection. They were competitively priced and offered a very thorough inspection with a great detailed report the same day. They were on time and worked efficiently to complete the inspection in a tight time window. I particularly liked the use of a moisture meter and laser thermometer to accurately measure moisture levels and temperatures of various systems and points around the house. They throughly inspected the attic and even walked the entire roof. All points of concern and interest were clearly documented with pictures and verbiage to ensure clarity. All major systems were also accurately measured and assessed with pictures and ages provided. Very impressed and I would highly recommend!", "pics": null, "resp": {"time": 1615745263671, "text": "Thank you very much Mr.Kaminsky. Great appreciate the review and it was a pleasure conducting your inspection"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103840872481049601733", "name": "brian entrekin", "time": 1619444231945, "rating": 5.0, "text": "Riaan did an excellent job with our home inspection.  I would highly recommend using him for your home inspection.  It was a thorough inspection and helpful for us to make a home purchase decision.\n\nBrian", "pics": null, "resp": {"time": 1619492325106, "text": "Thank you so much! It was a pleasure doing your inspection and I wish you all the best"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116896122260044283748", "name": "Amanda Webb", "time": 1620147812835, "rating": 5.0, "text": "Riaan came out and did an inspection on a property we are buying. He was extremely thorough and provided a detailed description with an amazingly fast turn around!! HIGHLY RECOMMEND!!", "pics": null, "resp": {"time": 1620148493991, "text": "Thank you so very much Mrs.Webb. We greatly appreciate that you took the time to leave us a review! We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117780807445193071023", "name": "Ron Jaster", "time": 1617098154876, "rating": 5.0, "text": "Home Boss report was exceptionally detail with pictures of every minor issue as well so that I can fix each item.  He was thorough and excessible to answer all my questions.  Highly recommended.", "pics": null, "resp": {"time": 1617157601254, "text": "Thank you so very much! It was a pleasure conducting your inspection and we wish you all the success going forward!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115651896604835717124", "name": "Connor Hubbard", "time": 1626875029372, "rating": 5.0, "text": "Riaan is my go to for home inspections. I've used him for two different homes now and working with him is extremely pleasant. He is great at communicating, he does high quality work, he is very affordable, and all and all just a quality hard working guy. If you need a home inspection in the Mobile County area, Riaan is the man for the job.", "pics": null, "resp": {"time": 1626875712889, "text": "Connor! Thank you Sir! I’ve enjoyed working with you! I wish you all the best going forward!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101287226958044403653", "name": "Kristen Sarowski", "time": 1627393982935, "rating": 5.0, "text": "Riaan was prompt and efficient. He was very friendly and explained everything he was doing and all of his findings and made sure I understood everything. His report was delivered the same day, as promised, and his prices were very reasonable. I absolutely recommend him and will use him again, if I need another home inspection.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112277397755465418932", "name": "Chris Fuchs", "time": 1622911182678, "rating": 5.0, "text": "Riaan did a fantastic job inspecting our new house! He really took his time and went above and beyond. Highly recommend!", "pics": null, "resp": {"time": 1624754358305, "text": "Mr.Fuchs. Thank you for taking the time to share your experience. It is greatly appreciated and we wish you and Mrs.Fuchs the very best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112213484904213333323", "name": "Joseph Cormier", "time": 1625624860655, "rating": 5.0, "text": "Top-notch service, extremely thorough inspection and a report of his findings was submitted to me almost immediately upon finishing the inspection. Given price, service and dependability I would very highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102217406576994318074", "name": "Virginia M. O'Brien", "time": 1615815973305, "rating": 5.0, "text": "Riaan with Home Boss was extremely thorough and excellent to work with. He stayed well after business hours to go over every inch of the house we were looking to purchase. He was very helpful and knowledgeable and I would recommend him to everybody", "pics": null, "resp": {"time": 1616434649881, "text": "Thank you so very much! It was a pleasure doing your inspection and we wish you all the best for the future."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103759072201698711268", "name": "Danielle Deak", "time": 1617477991935, "rating": 5.0, "text": "Riaan did a very thorough job.  He really took the time to explain his findings.  Would definitely use again.", "pics": null, "resp": {"time": 1617478651901, "text": "Thank you covert much! It was a pleasure doing your inspection and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "107479134737157309021", "name": "Steve Chumney", "time": 1624705709730, "rating": 5.0, "text": "Riaan’s inspection was top notch, thorough and the best I’ve ever seen. He answered every question with sincerity, passion and very professional at all times. I’ll definitely will be using Riaan again for future businesses.", "pics": null, "resp": {"time": 1624754070885, "text": "Mr.Chumney. Thank you so much for taking the time to share your experience. It is greatly appreciated. We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104758390435307751300", "name": "Kelly Smithson", "time": 1619789622478, "rating": 5.0, "text": "Provided very extensive and informative report for our home inspection. Would definitely use again!", "pics": null, "resp": {"time": 1619955884105, "text": "Thank you so very much! It was a pleasure conducting your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "108503384766192151644", "name": "M Hof", "time": 1616174149135, "rating": 5.0, "text": "First rate inspection.  Very thorough.  Shared results of inspection  on site then emailed a copy of the report.  very satisfied.  Mr. du Plessis was on time and took the time to do a proper job then shard with us the results", "pics": null, "resp": {"time": 1616434609640, "text": "Thank you so very much! It was a pleasure conducting your inspection and we wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "108472381069353244772", "name": "Racheal Harold", "time": 1604697156002, "rating": 5.0, "text": "Home Boss did a very thorough job of inspecting the property I was looking into buying. Took lots of pictures and made sure to have all the details written down. Was available for any questions about the inspection. I have had multiple friends who bought a house and said their inspection wasn’t as thorough or good. So I am 100% satisfied and would suggest any of my friends to use Home Boss.", "pics": null, "resp": {"time": 1604697876037, "text": "Mrs. Harold, we thank you so much for taking the time in reviewing our service and it was a pleasure doing your inspection. We wish you and your family everything of the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111853673525320494827", "name": "Jonathan Threlkeld", "time": 1625178294550, "rating": 5.0, "text": "Riaan was fantastic! Very thorough and professional. He took his time to explain everything to us and made sure we were informed in every step of the process. Would definitely use his services again in the future and I highly recommend him to anyone needing an inspection.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104992527825631061711", "name": "Danny Hilburn", "time": 1616619132656, "rating": 5.0, "text": "Riaan did an amazing job for us.  He was incredibly thorough and his report gave us the opportunity to have several items repaired prior to closing.  The repairs were well more than the cost of the inspection, so the value provided was fantastic.  I would absolutely work with Riaan again and will be referring him to my friends moving into town this summer.  Thanks!", "pics": null, "resp": {"time": 1617023647927, "text": "Thank you so very much Mr.Hilburn! It was pleasure doing your inspection and we wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104678443301418133901", "name": "Gary Burgess", "time": 1620238563489, "rating": 5.0, "text": "I have used Riaan twice for prepurchase home inspections. He is an excellent, thorough and professional home inspector. He has saved me thousands of dollars through his analysis of existing and potential problems. His reports are very concise and were recieved the same day. I recommend his services highly.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111081687777941772334", "name": "Samuel Barber", "time": 1626096037117, "rating": 5.0, "text": "Riaan was timely, professional, and personable. He takes the time to show you every detail you may be concerned about when purchasing a home. I highly recommend his services, he is easy to work with and I feel confident about the inspection he performed. He is honest, will give you an educated assessment of the property, and won't hold anything back at the expense of the seller. If you get his services, he will do his job. 10/10 without a doubt.", "pics": null, "resp": {"time": 1626105258659, "text": "Thank you so very much for taking the time to review our service. We really appreciate it and it was great working with you! We wish you and your family all the very best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "107272448528027030355", "name": "Finaldy Gmail", "time": 1624766828542, "rating": 4.0, "text": "Diligent work. True professionals. Will use them again.", "pics": null, "resp": {"time": 1620925743164, "text": "Thank you so very much! It was a pleasure doing your inspections."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114972571366280989215", "name": "Evan Jones", "time": 1620395052283, "rating": 5.0, "text": "Wish I could give more stars.....  Mr Riann Duplesis did a very detailed inspection on home i was gonna purchase, sadly I back out because of the deficiencies he found. He saved me a ton problems and I would recommend any and everyone for Home Boss services... current looking for another home to purchase and I will request Mr. Riann again for my inspection", "pics": null, "resp": {"time": 1620431146180, "text": "Thank you so very much for taking the time to review our services. It was pleasure doing your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116949229397206104118", "name": "donald best", "time": 1610511602362, "rating": 5.0, "text": "We used Home Boss of Mobile County recently twice after recent property investments. The inspector, Riaan was prompt, professional and by far the most thorough inspector I have come across. He was able to crawl into a very tight crawl space and located a very serious structure issue we had no idea was there. I just can't say enough about this company. 100 stars!", "pics": null, "resp": {"time": 1610513287425, "text": "Thank you so very much. It was a pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101412146789069549962", "name": "Sushil Monteiro-Pai", "time": 1614714808249, "rating": 5.0, "text": "Inspected a home I am buying. Did an awesome job, very meticulous and spent a good 4 hours for approx 2100 sq feet. Very sattisfied.", "pics": null, "resp": {"time": 1619435061633, "text": "Thank you so very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "108263086365924883837", "name": "LeAnne Bolton", "time": 1608388733259, "rating": 5.0, "text": "They provide prompt,  professional service. I’m a first time home buyer and Riann made the home inspection process a breeze. He took the time to explain everything to me and provided a very thorough written report (within an hour or so of the actual inspection). 10/10 recommend", "pics": null, "resp": {"time": 1608413665514, "text": "Thank you so very much for taking the time to write a review. We really appreciate it and it was a pleasure doing your inspection. We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103765356306928833416", "name": "Caryn Lott", "time": 1613329471448, "rating": 5.0, "text": "We had a great experience with Home Boss, very detailed and quick to get us our report. Highly recommend!!", "pics": null, "resp": {"time": 1613390960716, "text": "Thank you so very much Mrs.Lott for taking the time to leave us a review. It is greatly appreciated and it was a pleasure doing your inspection! We wish you and and Mr.Lott all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "110766541720874916556", "name": "Ali Raza", "time": 1612530399825, "rating": 5.0, "text": "Very thorough inspection of commercial property  and detailed report.  Highly recommend!", "pics": null, "resp": {"time": 1612539622085, "text": "Thank you Mr.Raza. It was a pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115530814440838385482", "name": "mike b", "time": 1608236281827, "rating": 5.0, "text": "Riaan was awesome! He was punctual, friendly, communicative and very thorough. I would 100% recommend him for any home inspections needs!", "pics": null, "resp": {"time": 1608243846165, "text": "Thank you for taking the time in reviewing our service. It was our pleasure doing your inspection and I really enjoyed our conversation in the attic😎. Congratulations on a great Home."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "113616867725975797873", "name": "Brittany Schroeder", "time": 1601744720980, "rating": 5.0, "text": "Riann was incredibly helpful and professional. I had him do a home inspection for a home I am purchasing and he not only provided a thorough inspection at a good price, but also provided pictures and was available to answer any questions I had on spot whenever I called him. I then asked for a reinspection after a hurricane hit during the buying process and he was able to do that for an even more reasonable price and was incredibly thorough and helpful then as well. I had a great experience that felt personal and thoughtful and would recommend him to anyone in need.", "pics": null, "resp": {"time": 1601750589834, "text": "Brittany, thank you very much for taking the time to write a review. It is very much appreciated. We wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101681086516563263545", "name": "Stephanie James", "time": 1603304029272, "rating": 5.0, "text": "I experienced Great Customer Service from Home Boss Inspection, from the time that I made my initial request to the final report. Riaan was the inspector on site, he answered all of my questions. Very kind, thorough and polite! Would absolutely recommend!", "pics": null, "resp": {"time": 1603537905215, "text": "Thank you so very much Mrs.James for your kind words! We appreciate you taking the time to leave us a review! I love your house!!  It’s awesome!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114287050619161625191", "name": "Fran Haas", "time": 1608819311268, "rating": 5.0, "text": "I am extremely happy with the home inspection that was completed by Riaan at Home Boss. The inspection was very thorough and informative. Highly recommend Riaan for your home inspection needs.", "pics": null, "resp": {"time": 1608903745728, "text": "Thank you so very much Fran! It was a pleasure doing your home inspection and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "100605816895313515138", "name": "Reed Rogers", "time": 1604876316531, "rating": 5.0, "text": "Riaan was very detailed in his inspection and his reports look exceptional.  They are easy to read and they come in the same day as the inspection.  Riaan is very professional and knowledgeable!  Excellent job!", "pics": null, "resp": {"time": 1604883574605, "text": "Thank you Mr. Rogers for taking the time leaving us a review. We appreciate it very much and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "100913622620102850146", "name": "Andrea Birchfield", "time": 1603052169558, "rating": 5.0, "text": "Riann was extremely through and highly professional with my home inspection. Answered all my questions. Would definitely recommend.", "pics": null, "resp": {"time": 1603049253199, "text": "Thank you so much Andrea . It was a pleasure doing your inspection and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111473811047584456867", "name": "Jody Cantey", "time": 1607567975817, "rating": 5.0, "text": "Riaan did a great job on our pre-purchase full home inspection. He spent hours in and out of the home giving us excellent information and confidence in our purchase!", "pics": null, "resp": {"time": 1607570102272, "text": "Thank you so very much for taking the time to write a review and we really appreciate it! Congratulations on a beautiful home and welcome to Alabama!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116365040613347993132", "name": "Deborah Tolbert", "time": 1601399415161, "rating": 5.0, "text": "Riaan is great to work with!  He provided a thorough and detailed report which we were looking for prior to renovating a home. Would highly recommend!", "pics": null, "resp": {"time": 1601400841811, "text": "Thank you so very much Deborah. It was a pleasure meeting you and I enjoyed working with you!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104611758935171263773", "name": "Seth Thomas", "time": 1596209651981, "rating": 5.0, "text": "Riaan was incredible! Was very prompt with updates and paid attention to details when inspecting my new home! Even went out for a follow up with the seller to show him what needed to be done. I will definitely use Home Boss in the future.", "pics": null, "resp": {"time": 1596214076613, "text": "Mr. Thomas thank you so very much for taking the time to leave a review! It was a pleasure doing your inspection and I love your new home! Congratulations!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111273631407967715128", "name": "Stephanie Manley", "time": 1595269248562, "rating": 5.0, "text": "Thank you Home Boss! Very, very thorough! If you want a quick inspection, this is not them. They take their time! The inspector even got on the roof and it was a 3 story home!!! So very impressed. Highly,highly recommend!!! Riaan is the best inspector there is!", "pics": null, "resp": {"time": 1595269934866, "text": "Thank you very much Mrs.Manley. Congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111962756695886699805", "name": "Courtney du Plessis", "time": 1595003905872, "rating": 5.0, "text": "Very professional and courteous.  Referred to other homeowners because the service  is top notch. Very thorough inspection and got the report same day. Highly recommend!", "pics": null, "resp": {"time": 1595013504702, "text": "Thank you very much for taking the time to write a review about your experience. Congratulations on your new home!!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "100779633776935103803", "name": "Mimi M", "time": 1603043312656, "rating": 5.0, "text": "Riaan was very responsive, very thorough and extremely helpful. HomeBoss came highly recommended by numerous people since we are new to the Eastern Shore area. We are very happy wi5 the results and 100% will recommend.", "pics": null, "resp": {"time": 1603049162824, "text": "Thank you so very much for taking the time to write a review. We appreciate it very much. It was a pleasure doing your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "107060435635694768926", "name": "stephanie powe", "time": 1591794685960, "rating": 5.0, "text": "I was very pleased with the details of my extremely thorough pre-purchase report. Both pictures and descriptions of potential issues were outlined throughout a very organized and easy to follow outline of each part of the home. Working on a tight timeline, I was elated to have my appointment and report delivered in such a timely manner. Excellent value for the work done. I can see Riaan's attention to even the smallest details. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104383841895248377437", "name": "Ryan McClaren", "time": 1595268573871, "rating": 5.0, "text": "This is my 3rd inspection with Home Boss of Mobile County. The inspector Riann(sp) is the most thorough and professional I have ever experienced and I use to be in real estate, so I have across many. There is nobody out there that does an inspection like they do. If you want to be sure you are making the correct investment, call them! Thank you so much Home Boss!!!", "pics": null, "resp": {"time": 1595269903020, "text": "Thank you so much! it was a pleasure doing your inspections!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116009501799102424753", "name": "Tate Marcinkowski", "time": 1593011273441, "rating": 5.0, "text": "The Home Boss team was amazing. They are incredibly knowledgeable and thorough. Just want you want when buying a new home.\nThank you Home Boss team,\nTate", "pics": null, "resp": {"time": 1593014959177, "text": "Thank you so much! It was our pleasure doing your inspection. We appreciate you taking the time and leaving us review!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "109630336829377150644", "name": "nrbnab", "time": 1614641206646, "rating": 5.0, "text": "On time and very thorough.", "pics": null, "resp": {"time": 1619955991296, "text": "Thank you so very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117301069661084503569", "name": "reacticorn life", "time": 1606765522100, "rating": 5.0, "text": "Very detailed. Awesome service", "pics": null, "resp": {"time": 1606777052375, "text": "Thank you so very much for taking the time leaving us a review. We really do appreciate it and it was a pleasure doing your inspection. Good luck with all your future endeavors."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "109224734086100434095", "name": "James West", "time": 1590977152967, "rating": 5.0, "text": "We have purchased two homes, this is our third and this is the most thorough inspection that we've had. Professional, was able to do the inspection within 72 hours, because we were behind in our planning. Thank you Home Boss!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102387425628427595998", "name": "Jimmie Newton", "time": 1596746411784, "rating": 5.0, "text": "Riaan is the ultimate professional! He is extremely thorough, on time and is the expert in home inspections and testing!", "pics": null, "resp": {"time": 1596758649486, "text": "We appreciate you taking the time out of your day to leave us a review. We appreciate you very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117816267794968952552", "name": "Barkley Gannon", "time": 1596550164228, "rating": 5.0, "text": "When it comes to home inspectinos, I highly reccomend Home Boss. Riaan is as professional as they come. His first priority is the care of the client.", "pics": null, "resp": {"time": 1596552256704, "text": "Thank you very much for taking the time to leave a review! We appreciate it very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102799636767441709335", "name": "Jeff Unfried", "time": 1617022353221, "rating": 5.0, "text": "Very timely and thorough", "pics": null, "resp": {"time": 1617023594503, "text": "Thank you Mr.Unfired. It was a pleasure doing your inspection. We wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116878066850820362353", "name": "Conyers Coupland", "time": 1594659488009, "rating": 5.0, "text": "Great detail and value. Recommend highly.", "pics": null, "resp": {"time": 1594663151757, "text": "Thank you so much. It was a pleasure doing your inspection. Congrats on a beautiful home"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "105269068346298469232", "name": "Warren Alexander", "time": 1597938559544, "rating": 5.0, "text": "riann was very proffesional and was very complete on his inspection!!!", "pics": null, "resp": {"time": 1598659674074, "text": "Thank you very much for taking the time to review us! It was a pleasure doing your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103432763156738430983", "name": "Brian Nichols", "time": 1574718726443, "rating": 5.0, "text": "Riaan is very thorough Home Inspector.  One of the best in the business. I highly recommend him. Very courteous and very professional.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "105171329057125211691", "name": "Nader Salibi", "time": 1574827240029, "rating": 5.0, "text": "Riaan is extremely professional and has excellent work ethics. Very punctual and prompt. Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103116957147123624100", "name": "Leigh Hill", "time": 1589210039109, "rating": 5.0, "text": "Riann was very thorough and answered all of my questions. I had the report the same day.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114253017092932881957", "name": "Ricky Armond", "time": 1589417867256, "rating": 5.0, "text": "Riian is very thorough and very professional and very down to earth highly recommend.", "pics": null, "resp": {"time": 1589421837436, "text": "Thank you so very much. It was a pleasure doing your inspection. Thank you for taking the time to write a review. It means a lot"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114098075710437789329", "name": "Heather", "time": 1574958858038, "rating": 5.0, "text": "Riaan was very nice. He seems to know his stuff and is informative. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102455454359048849912", "name": "Brent Nichols", "time": 1574719571638, "rating": 5.0, "text": "Would give 6 stars if I could.. Great Inspector", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103625352959212237292", "name": "Carol Eppes", "time": 1574954676966, "rating": 5.0, "text": "These guys are top notch! I would not use anyone else!!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104457668696561184301", "name": "Angela Jones", "time": 1587329708321, "rating": 5.0, "text": "Excellent communication and thorough inspection!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112349721231394061036", "name": "A Moore", "time": 1574720886109, "rating": 5.0, "text": "Highly recommend.... the accent is to die for...", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115255835515989417821", "name": "Smooth Home Sales", "time": 1554301260799, "rating": 5.0, "text": "Excellent inspection Service, Highly Recommended", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "118216436091841939329", "name": "Rebecca Reibling", "time": 1594308931896, "rating": 5.0, "text": "Great Job", "pics": null, "resp": {"time": 1594315095702, "text": "Thank you so very much for taking the time to review our business!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104860846401461641263", "name": "Popi Bear (PopiShop)", "time": 1551628083457, "rating": 5.0, "text": "Bout average", "pics": null, "resp": null, "gmap_id": "0x888912d623b571e7:0x8a7162143945de31"}
{"user_id": "107127727231377505165", "name": "James Shivers", "time": 1532466069445, "rating": 5.0, "text": "Super nice guy, excellent service, and very knowledgeable.  Kent walked me around during the home inspection and showed me exactly what he was looking for and why it was important, for a first time home buyer that was very beneficial.  Full report was provided to me the very next day with everything we went over. Very pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x888924095c16d943:0xcc5b31d642ded947"}
{"user_id": "104818768450478360464", "name": "Minela Rivera", "time": 1556911387230, "rating": 5.0, "text": "Kent is super nice, knowledgeable, works quickly and thoroughly and is competitive with pricing. I would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888924095c16d943:0xcc5b31d642ded947"}
{"user_id": "101918243766517396422", "name": "Alex Illas", "time": 1607861439705, "rating": 5.0, "text": "We used Alliance to inspect a home we wanted to purchase.  The whole team was kind, professional, thorough, and punctual.  Their reports were timely and easy to comprehend.   Extremely satisfied with Alliance.", "pics": null, "resp": {"time": 1607035437134, "text": "Thanks so much for your feedback Alex! Let us know if we can do anything else for you!"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "110236983598064080915", "name": "Stephean Grimes", "time": 1613509762459, "rating": 5.0, "text": "I have used Alliance for three inspections. Their team is very thorough with every aspect in the inspection process, and quick to deliver the full report.", "pics": null, "resp": {"time": 1607018962852, "text": "Hi Stephean,\nWe appreciate you and look forward to working with you in the future!  We appreciate you choosing AIS for your 3 inspections we have performed for you and an Air Quality Test.  Thank you very much for the kind 5 star review! Take care and stay safe!"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "106370402314901171701", "name": "William Tompkins", "time": 1557107477444, "rating": 5.0, "text": "The father and son team of home inspectors at Alliance Inspection Services (AIS) were very thorough and comprehensive in their inspection of the older home we are considering buying.   They took their time in explaining their findings and did so in a way that was clear and relatively easy to understand.  This was very important to us since neither my wife, nor I, are very knowledgeable about home appliances, electrical equipment, plumbing, heating, cooling systems, etc.    I would wholeheartedly recommend AIS to my friends and  family in need of a home inspection.  Outstanding !!  Thanks AIS.", "pics": null, "resp": {"time": 1557237380095, "text": "Thanks so much Mr. Tompkins!"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "105091915341715248329", "name": "Patty Bailey", "time": 1588867707847, "rating": 5.0, "text": "I love using Alliance! They are prompt, professional and perform a great inspection!", "pics": null, "resp": {"time": 1591117177084, "text": "Thank you so much Patty! We enjoy working with you as well and appreciate your business ethics.  You do care."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "101493358219150503723", "name": "Garrett Fine", "time": 1544474414452, "rating": 5.0, "text": "This is the 3rd home the Mears team has inspected for me. They have done a fantastic job in all 3 inspections! The reports are thorough with great photos so it is easy to understand and communicate any items found. They are prompt, friendly, and professional. Highly reccomended!", "pics": null, "resp": {"time": 1544475502887, "text": "Mr. Fine thank you for the positive review!  We appreciate you taking time to let us know. We are here for you if you need us.  Happy Holidays to you and your family! Bridget Mears"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "114601732710259288924", "name": "Donna Taylor", "time": 1475695606361, "rating": 5.0, "text": "I have referred Steve and Bridgette to numerous clients that need a thorough home inspection (They inspected mine too).  They have always been in constant contact with me - even on Sunday!  I recommend Steve and Bridgette to anyone who is looking for a home inspection which is detailed and precise!  I also like the fact that they provide a Home Warranty of 18 months for the price of 12, and the Recall Check they provide.  You just can't go wrong having them on your side!", "pics": null, "resp": {"time": 1591117674275, "text": "Donna we thank you for the review and also working with your clients.  We hope you are doing well and staying safe."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "105706691395861902143", "name": "Jack Keeling", "time": 1520090021052, "rating": 5.0, "text": "Very professional and courteous in explaining what they were doing and what it meant. They did a very thorough job of checking everything. They were very nice people.", "pics": null, "resp": {"time": 1532965105606, "text": "Thank you Mr. Keeling!  We appreciate you.  Let us know if we can be of further service in the future."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "102632414601158435958", "name": "Good Citizen (Good Citizen)", "time": 1556643074780, "rating": 2.0, "text": "Inspection report was good, process was fast and price was fair.\nHowever, they sell your phone number and you get calls day and night from security companies claiming to be partners with alliance.", "pics": null, "resp": {"time": 1556650720052, "text": "Thank you for the positive comment about our inspection, feedback is valuable to us. We apologize about the calls you are receiving and assure you we do not sell your information.  However, we do offer a free concierge service with vendors we represent that you may have opted in on. Please feel free to call us at 251-382-1653 so that we can assist removing you from this service."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
