{"user_id": "111703197667157199794", "name": "Harley Frizzell", "time": 1614884132546, "rating": 5.0, "text": "My wife and I have been with Baldo-Downs for a few years now. I can't say enough about how wonderful they are. Any questions or concerns they are always there to answer them. Always, and I do mean always, giving us their best. I would recommend anyone to call and see what they can offer you. Hand's down the best insurance company.", "pics": null, "resp": {"time": 1614984583526, "text": "Thank you for the review and the encouraging words Harley!"}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
{"user_id": "118130772403356816870", "name": "Kristen Hudson", "time": 1614812164186, "rating": 5.0, "text": "They are very nice and very helpful. They found me the best insurance price for my vehicles. I would recommend anyone to them. Love the customer service.", "pics": null, "resp": {"time": 1614984525342, "text": "Thank you for the review and the kind words Kristen!"}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
{"user_id": "114821115192912238448", "name": "Stephanie Aiello", "time": 1621708876274, "rating": 5.0, "text": "I am new to Alabama and needed coverage for my apartment and my vehicle.  Having Nationwide coverage in Michigan, I know how quickly policy changes can be made, how the agents respond to my economic challenges by presenting multiple coverage plans, and how they accommodate the individual needs of each family member,, I knew I wanted Nationwide when I moved here.\n\nAfter reading reviews, I reached out to Baldo-Downs. Deisy responded to my inquiry within minutes.   She walked me through rental coverage options and by the close of business, I had my insurance in place.   I was able to do this all over phone calls and emails.  Next came vehicle coverage.  Deisy found comparable coverage to what I had previously and she made sure I met all state required insurance mandates.  Deisy worked to capture all available discounts applicable to my coverage.\n\nI truly appreciate everything this agency did to make my transition to Alabama seamless and worry-free.  I know I am protected in and out of my new home.  I would highly recommend Deisy Barrientos and the Baldo-Downs agency for all your insurance needs!", "pics": null, "resp": {"time": 1621742467444, "text": "Wow Stephanie! Thank you for this detailed review! We are so humbled knowing that we were able to help meet your needs! Welcome to Alabama and we look forward to working with you. We consider it a privilege to be your insurance agency!"}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
{"user_id": "116798622285264565751", "name": "David Devine", "time": 1615393670561, "rating": 5.0, "text": "Switching to Baldo-Downs insurance is one the best decisions I’ve made in a long time. I wish I had done it sooner. After using USAA for decades I thought I was getting a good deal. I am now saving a VERY substantial amount of money on home & auto insurance. So nice to have someone local that I can speak to. Highly recommend!", "pics": null, "resp": {"time": 1615418559897, "text": "David, thank you for the recommendation and the kind words!  We are humbled."}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
{"user_id": "107944729748652126276", "name": "Kristi Eiland", "time": 1488596455958, "rating": 5.0, "text": "Stephen took plenty of time researching my policies.  When he had something better (coverage and price), he told me.  When he didn't, he was honest even though it meant no getting my business.  Much respect for his integrity! Sometimes price isn't the MOST important thing.", "pics": null, "resp": {"time": 1520453990710, "text": "Kristi, We are glad Stephen was able to help. Thank you for your kind words!"}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
{"user_id": "115143996063557152765", "name": "LP", "time": 1516898615316, "rating": 5.0, "text": "Anytime I have to call Nationwide they are always professional and courteous.  You can tell they really care about their clients, they answer any questions you have and are so knowledgeable, they will get you the policy that best suites your needs.", "pics": null, "resp": {"time": 1520532575750, "text": "Thank You"}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
{"user_id": "103429866581467313465", "name": "Josh Cannon", "time": 1577821765722, "rating": 5.0, "text": "Steven Baldo Downs can help you with all your insurance needs", "pics": null, "resp": {"time": 1577810087345, "text": "Thank you for the positive feedback Josh!"}, "gmap_id": "0x88860282f0100541:0xe47f757c238870a4"}
