{"user_id": "108941120184840811138", "name": "Matt Lipscomb", "time": 1539904998406, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888a3bbbbb208f35:0xa4d315059c49a251"}
{"user_id": "108941120184840811138", "name": "Matt Lipscomb", "time": 1539904998406, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888a3bbbbb208f35:0xa4d315059c49a251"}
{"user_id": "108941120184840811138", "name": "Matt Lipscomb", "time": 1539904998406, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888a3bbbbb208f35:0xa4d315059c49a251"}
{"user_id": "108941120184840811138", "name": "Matt Lipscomb", "time": 1539904998406, "rating": 5.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x888a3bbbbb208f35:0xa4d315059c49a251"}
{"user_id": "112677121025512497495", "name": "Bangkok Bistro", "time": 1622755450174, "rating": 5.0, "text": "Tony really helpful and hand on person. Highly recommend.", "pics": null, "resp": {"time": 1622758438601, "text": "I appreciate that Bobby!  I know you'll do great in your new Fort Walton Beach location"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "103519831638153215913", "name": "Milissa Guitterez", "time": 1619624193133, "rating": 5.0, "text": "Eric’s review program has made it simple and easy for our customers to leave reviews! There’s no doubt that it’s had an impact on our business. He’s always responsive and very willing to help. Definitely recommend!", "pics": null, "resp": {"time": 1619733229779, "text": "Thanks Milissa! You've been awesome to work with, especially knowing that your alkaline water systems are helping people stay healthy in these crazy times. I love my machine! Online reviews are a powerful way to let others know that they can be confident in working with you. If any readers are curious, check out her website here; https://peakalkalinity.com/\n~Eric"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "102785594376043986331", "name": "Scott Burris", "time": 1619374502384, "rating": 5.0, "text": "We started using Bizcore to reduce costs for merchant services and credit processing. What we like, is the straight forward invoicing and no hidden fees. We also like being able to speak to a person if we need assistance. Their service is automated and links with your management software. We can process nearly all card types and its even easier to assimilate with accounting than our bank was.", "pics": null, "resp": {"time": 1622758543543, "text": "Thank you for the great review Scott!   I appreciate you trusting us with your Merchant Services!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "109080953615787131309", "name": "Mike Lash", "time": 1619111885333, "rating": 5.0, "text": "Tony has been an absolute pleasure to work with for the the last 9 months. Having a truly local merchant services company has proved invaluable as Tony has come to the rescue on a few occasions.\n\nThe best recommendation I can give is this: you will never have to worry about BizCore doing everything they can to make sure your business succeed.", "pics": null, "resp": {"time": 1622758633533, "text": "Thank you for the outstanding review Mike!   I enjoy working with you with your Clover POS device and your credit card processing.    Always ready to help!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "117920043352164893379", "name": "Kenny Robinson", "time": 1563463326680, "rating": 5.0, "text": "Tony is awesome to work with. Leaves no questions unanswered and goes above and beyond to make sure all your needs are met. Highly recommend anyone needing payment services to reach out to him!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "110019748774043348791", "name": "Tami Roberts", "time": 1555114189514, "rating": 5.0, "text": "I’m loving my experience with Automated Reputation Management. It’s super simple to use the system and my client reviews have increased dramatically in quantity and quality.\n\nMore importantly and unexpectedly, my search ranking on Google increased 79% from the month before I started using ARM.\n\nWe received two calls directly from Google search this week. Both of these NEW clients said they called due to the reviews they read about us online. It’s business we would have missed without ARM services.\n\nOur past business has been generated through mostly referrals, but we are excited about this new source of online leads. Our reviews make it easy to convert the new online leads to appointments and clients.\n\nARM made us realize how convenient it is for us to request and for our clients to post reviews online... and how happy our clients are to give the reviews!!\n\nThank you ARM for all your help and personal attention to every detail!! It’s appreciated.", "pics": null, "resp": {"time": 1555347649478, "text": "Tami, that is awesome news! Thank you for the thorough review of Automated Reputation Management and especially how it's converting prospects to clients, that's what it's all about. I'm looking forward to seeing this develop as a marketing tool for your growing real estate agency.\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "116547465294106503410", "name": "Montina Sottile", "time": 1575398779798, "rating": 5.0, "text": "Tony is awesome! He was here during our opening to help us understand everything and solve any problems or questions we had. Thank you so much Tony", "pics": null, "resp": {"time": 1575412037616, "text": "Thank you so much Tina.    You are all great to work with and i'm happy I could be of assistance!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "112404285694021576514", "name": "Johnnessa Evans", "time": 1568319318411, "rating": 5.0, "text": "AWESOME  experience.     Tony was very informative  About the  Device where I didn't have many questions to answer because he covered  It all. He also left a lasting impression to where if I had any future questions that I would be able to reach him.", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "100113673598733232010", "name": "RoyandSusan Forson", "time": 1568913354954, "rating": 5.0, "text": "We have been working with Automated Reputation Management for several months and are very pleased with their service and support.  We are seeing a large increase in reviews and new business as a result.  Highly recommend!", "pics": null, "resp": {"time": 1569006548128, "text": "Roy and Susan, thank you so much for the review! It's truly a pleasure to partner with people like yourself that are providing such a unique and needed service. The vacation home rental market will never be the same!\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "107041601933875458969", "name": "「ナンス」AKUMA", "time": 1567633742412, "rating": 5.0, "text": "Wonderful service. Kind and thorough, never lets us get confused with any information. I highly recommend and value the service provided. :)", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "118030623919142172563", "name": "Whitney Aragon", "time": 1554836960528, "rating": 5.0, "text": "He has made our experience with owning our own company amazing and smooth sailing. Couldn’t ask for a better more down to earth person to help us with our Point of sale. Thank you so much Tony.", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "101194059108980779380", "name": "Abbey Trammell", "time": 1563747235991, "rating": 5.0, "text": "Tony did a great job getting our shop set up with a new Clover POS system. Simple instructions and super easy to use. Tony is the best!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "102141041187393819299", "name": "Tony Wilcox", "time": 1555086395369, "rating": 5.0, "text": "Eric’s product is amazing!!   I was struggling to have my customers find time or remember to leave me a review and I am in a competitive field.  With Eric’s solution, I am able to instantly text or email a client while I am at their location and immediately have them in the right place.   It has doubled my number of reviews in the first month since using the product.  If you want or need reviews, you need this.", "pics": null, "resp": {"time": 1555089326140, "text": "Thanks, Tony! It's awesome watching how automating your reputation management is helping people discover your solution-oriented merchant services and Clover POS systems. I'm looking forward to watching your business grow with online reputation management and customer reviews.\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "100078668070409840862", "name": "Landon Rogers", "time": 1554339975789, "rating": 5.0, "text": "Wilcox Payments is a phenomenal business! Able to answer any and all questions you have at any time. Super competitive rates that are over the top combined with customer service! Would highly recommend to anyone looking for payment services!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "109054441141332541516", "name": "loretta macdonald", "time": 1554835434157, "rating": 5.0, "text": "Tony is truly amazing!!! He has overcome every hurdle thrown at him while setting up the 2 Cellar Doors. He has been there for us night and day to solve any issue that came our way. We love our system and will recommend it and him whenever possible. Thank you so much, Tony!!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "107048709029141770047", "name": "Matt Waters", "time": 1563465085834, "rating": 5.0, "text": "Tony has made our experience with point of sale really convenient. He is very knowledgeable with what was best for our business. Highly Recommended.  Thanks", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "101315486683087592458", "name": "Soo Horobin", "time": 1561044649322, "rating": 5.0, "text": "Great service and great tool for your business. Eric knows what he is doing and has helped me grow my business with reviews online and has made the process simple and easy for me and my clients to use!", "pics": null, "resp": {"time": 1561070505563, "text": "Thanks, Soo! I'm looking forward to seeing you kill it with review marketing! Never has reputation management been more important to business success and growth.\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "115736778503290938614", "name": "Marcus Semmes", "time": 1560370228211, "rating": 5.0, "text": "Eric was very responsive to questions and concerns. All work was completed professionally and delivered when promised. I would highly recommend based on my experience.", "pics": null, "resp": {"time": 1560555489071, "text": "Marc, it's been awesome watching your review count grow as well as your online reputation. Thanks for being such an awesome client!\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "100483215777761889299", "name": "Patrick Rock", "time": 1580859410911, "rating": 5.0, "text": "The clover card machine is the best one i have used since running a card machine simple to use tony walked me thro all the steps of operating it and has answered any questions so far that i had for him i highly recommend tony for anything that has to do with the clover card machine", "pics": null, "resp": {"time": 1580861602514, "text": "Thanks so much Patrick!  You guys are great to work with!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "115299424368207558443", "name": "Jeffrey Conner", "time": 1558021478847, "rating": 5.0, "text": "Eric has been great to work with. Extremely on top of it and as a small business owner myself he really provides a great tool. Thanks for your help!", "pics": null, "resp": {"time": 1559306497478, "text": "Jeffrey, thanks for the kind words. We're off to a great start!\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "106690790819936036234", "name": "Tiffany Roberts", "time": 1555528021806, "rating": 5.0, "text": "Tony was exceptional with the knowledge of the terminals that he can provide “FOR FREE.” He was able to quickly assess our business and decide which terminal would be best for us! Highly recommend giving him a call if you need credit card machine services!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "108180128830725313564", "name": "Lynn Gill", "time": 1553790427044, "rating": 5.0, "text": "I am so glad to find a hands on professional to handle my business credit card processing needs and from my first contact with Tony Wilcox I noticed a difference in his knowledge and willingness to share and take time to ask all the right questions.  We had changed services 3 times in 6 months and were about to give up on finding a real person to navigate us through the quagmire of mail back of prior terminals.  Thanks to Tony we are set up on new equipment that is easy to operate and dependable with a web page that is easy to use and gives us access to information that was not accessible with the other merchant services we tried in the past. Truly happy with the service and give a 5 star rating.", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "101638440287366895816", "name": "Bryant MacKellar", "time": 1555601116512, "rating": 5.0, "text": "Tony is a true professional.  He likes to get to know his clients and the needs they have.  He is not just selling a product, he is selling an experience.  I recommend him to any business that takes credit cards.", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "111541932139868139964", "name": "Lew Thomas", "time": 1555612023131, "rating": 5.0, "text": "Wilcox Payments came to our professional group and gave us some options on taking payments for location type work. Tony was very knowledgable, informative and honed in on each individuals needs. Thank you so much for coming by and educating on the different methods of payments!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "103808359531444044061", "name": "Forrest During", "time": 1555619201213, "rating": 5.0, "text": "Tony Wilcox at Wilcox Payments has the best interest in his clients. He is honest and professional. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "106271567456441300300", "name": "Dominique Roberts", "time": 1553550883267, "rating": 5.0, "text": "Wilcox Payments is so professional and always available when needed.  Equipment looks amazing and easy to use!  I highly recommend Tony!!!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "100335089175545958166", "name": "Janet Baker", "time": 1576197934581, "rating": 5.0, "text": "Eric is very knowledgeable and delivers information in an easy to understand way.  I can’t wait to see what he’s up to next!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "100035376305859920827", "name": "Milissa Guitterrez", "time": 1575038686146, "rating": 5.0, "text": "Most would agree that (awesome) reviews can greatly impact a consumer’s decision to do business with a particular company, but how do you make it an easy experience for the client? This program does just that. Within a very short period of time, we’ve seen a very favorable increase in the quantity of reviews posted on both Google and Facebook. Makes it easier on the staff as well. We used to politely ask that clients leave a review, but some didn’t know how to navigate the technology challenges in doing so. That issue is now negligible. It’s a win-win for all!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "114776738804274840118", "name": "Craig Boggs", "time": 1553794887344, "rating": 5.0, "text": "The business world is full of merchant services \"gray noise\" and frankly I was sick of it. I needed a real payment processing solution from a company that isn't just trying to sell me what they have , but one that could look at my situation and provide what I needed to manage credit card processing in a way and at a cost that was right for all of my businesses.\nI have found that with Wilcox Payments! Tony Wilcox not only knows his stuff, but was able to explain why he was suggesting the specific Clover POS systems that were required to meet my business needs but he also  brought to light some features I didn't even know I needed until he explained them to me.\nWow, what a difference! Thanks Tony, I'm looking forward to expanding my businesses with you and your services.", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "118104855265002206037", "name": "Hollie MacKellar", "time": 1559843481670, "rating": 5.0, "text": "Eric was very helpful and knowledgeable about the functionality of both Facebook and Google as well as how it relates to our business. We appreciate his expertise and tenacity when approaching a problem or challenge!", "pics": null, "resp": {"time": 1560020093980, "text": "Thank you Hollie! It's great to have awesome clients like you and your team of people helping others with your local knowledge!\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "114543895619260197141", "name": "ERachel", "time": 1560538255355, "rating": 5.0, "text": "Very knowledgeable! What are you waiting for? Call Eric today and change your business. #socialwordofmouth", "pics": null, "resp": {"time": 1560555440601, "text": "Elizabeth, thank you for your kind words! You and Dee Dee are going to kill it!\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "112888445502191300812", "name": "VP4L", "time": 1580145217896, "rating": 5.0, "text": "Tony has gone far above and beyond our expectations. He has always been available to answer questions and assist with issues.", "pics": null, "resp": {"time": 1580174816364, "text": "Thank you so much Sondra!  You are all great to work with!!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "104255077783553864153", "name": "Kevin Spath", "time": 1554929197869, "rating": 5.0, "text": "Tony is the best! He is the go-to payment solution expert! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "111475673385244427851", "name": "Maegan Maloney", "time": 1555605545352, "rating": 5.0, "text": "Efficiency and professionalism!! Very knowledgeable and WANTS to help YOUR business succeed! Bravo!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "117261532173700374073", "name": "Robin Johns", "time": 1555943969021, "rating": 5.0, "text": "Tony is very helpful and knows what he is talking about. Would highly recommend Wilcox Payments for your business!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "108870158311274763192", "name": "Billy Howard", "time": 1589814856487, "rating": 5.0, "text": "Very professional and knowledgeable.", "pics": null, "resp": {"time": 1589850462614, "text": "Thanks Billy!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "104390544709911709010", "name": "Marilynn Clark", "time": 1556819447772, "rating": 5.0, "text": "Eric has patiently taught me the use of online marketing, and has followed up with me when I have questions", "pics": null, "resp": {"time": 1559306415443, "text": "Marilynn, thank you for the review! Let me know if there is anything I can do to help you.\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "103957484320005256091", "name": "Tina Burdine", "time": 1555946480774, "rating": 5.0, "text": "Easy to use and great way to encourage reviews on your business pages", "pics": null, "resp": {"time": 1556018511663, "text": "Thanks Tina, it's a pleasure working with your commercial cleaning, residential cleaning and floor and tile cleaning company. I appreciate you letting others know about the service!\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "108956492838397783134", "name": "Joshua Hembree", "time": 1574368890277, "rating": 5.0, "text": "BizCore is a MUST for anyone in business that deals with the public. The fact is that most people use reviews to help decide whether to hire a company and so it is crucial to partner with this company to make sure your business stays on top!", "pics": null, "resp": {"time": 1565887741441, "text": "Joshua, thank you so much! Recommendations from outstanding companies like Hembree Heating & Air Conditioning mean so much to me.\n#SocialWordOfMouth"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "117999487488498791674", "name": "fabrice saidi", "time": 1592935971421, "rating": 5.0, "text": "You guys are awesome!!!", "pics": null, "resp": null, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "107047068613994571735", "name": "Johnny Dunning", "time": 1566782153420, "rating": 5.0, "text": "Looks good", "pics": null, "resp": {"time": 1570637221937, "text": "Thanks Johhny!"}, "gmap_id": "0x889a8a2f47a87689:0x6e00ce01fc25532a"}
{"user_id": "101833826889313334840", "name": "Shannon Stanley", "time": 1567481240101, "rating": 1.0, "text": "Kept jerking me around on my overpayment of my overpayment. Kept hanging up on me or telling me it would take 4-8 weeks in which case it took longer. Now with the holiday we ll see when I get it now that someone has finally gotten back to me.", "pics": null, "resp": null, "gmap_id": "0x888cf15449d377ef:0xec871668b1a6e9a2"}
{"user_id": "108561346918324403744", "name": "N Wright", "time": 1526184937136, "rating": 5.0, "text": "Awesome payment center", "pics": null, "resp": null, "gmap_id": "0x888cf15449d377ef:0xec871668b1a6e9a2"}
{"user_id": "101512618782864281669", "name": "adam kim", "time": 1602902327192, "rating": 5.0, "text": "Great group of people to work with from both a technical and personal standpoint", "pics": null, "resp": null, "gmap_id": "0x88626f984b7d5981:0x803e64dcdc6e0dbd"}
{"user_id": "108365763151767114311", "name": "Katie Calhoun", "time": 1565191266737, "rating": 5.0, "text": "I loved working with Edge Web Consulting.  Erin is very knowledge on many topics that were helpful to me for use in promoting my jewelry business. She is always willing to take the extra steps to be of assistance in any way possible for the success of your company.   I highly recommend their services.", "pics": null, "resp": {"time": 1565201299978, "text": "Thank you so much, Katie!  I enjoyed learning more about your business and look forward to seeing it grow!"}, "gmap_id": "0x888921dc61e48f2f:0xf5e7acbffe8b4c85"}
{"user_id": "108496818278999082603", "name": "Mac Mac", "time": 1540070837786, "rating": 5.0, "text": "(Translated by Google) Very well\n\n(Original)\nMuy bien", "pics": null, "resp": null, "gmap_id": "0x888921dc61e48f2f:0xf5e7acbffe8b4c85"}
{"user_id": "113020080852922579671", "name": "Amberleah La C", "time": 1617469475781, "rating": 1.0, "text": "Terrible management and even worse supervisors. A very high turnover rate, and there's no wonder why. So much drama, gossip and cliques in this place. Best decision I ever made leaving this place. Also, thanks for not showing up to the phone interview with unemployment, I got roughly 7k to hang out at the beach all summer. 😁", "pics": null, "resp": null, "gmap_id": "0x889a4d0cd77bd521:0x7124064e7a18620c"}
{"user_id": "112616200254408532319", "name": "kandie watson", "time": 1538605304886, "rating": 4.0, "text": "Cool", "pics": null, "resp": null, "gmap_id": "0x889a4d0cd77bd521:0x7124064e7a18620c"}
{"user_id": "103735783277197374127", "name": "Roderick Alexander", "time": 1534141372748, "rating": 5.0, "text": "Yes", "pics": null, "resp": null, "gmap_id": "0x889a4d0cd77bd521:0x7124064e7a18620c"}
{"user_id": "106844494893626799523", "name": "V May", "time": 1626322589344, "rating": 5.0, "text": "Katherine did an amazing job.  She was very attentive and gave thorough feedback and advice. To be such a short amount of time I didn’t feel rushed at all and every question I had she answered. I left the meeting feeling more equipped and empowered then I did before. I would recommend these services to any entrepreneur.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100985415665885626265", "name": "LaTisha Tubbs", "time": 1626237796842, "rating": 5.0, "text": "You only have a 15 minute call but within those 15 minutes my advisor answered all the questions I had as well as setting up future appointments once a week for any other I needs I have. Gave more than enough resources. I would definitely encourage people that are looking to become a entrepreneur to register with this company for all your needs. Did I mention its free!!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108371908882339659226", "name": "Chandria McCurdy", "time": 1626809774094, "rating": 5.0, "text": "I spoke with Katherine for the first time today & she was very knowledgeable on any questions I asked. Also, she was able to listen to my business plan and provide effective feedback. I am looking forward to our next phone call.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117538087045924848317", "name": "Cosey Capital LLC", "time": 1626808851835, "rating": 5.0, "text": "We just had our first call with Katherine Zobre of ASBDC and she is AMAZING! In just 15 minutes she was able to answer all of our questions regarding funding, marketing, creating our customer profile and more. What really impressed us was how thorough her follow-up communication is. She sent several resources via email that has placed us on the right path and given us more confidence as a new small business in AL. Definitely a 10/10 experience.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111694910971323238240", "name": "Joell Regal", "time": 1625754831071, "rating": 5.0, "text": "So far, my experience with ASBDC has been phenomenal! They are very thorough, and show a genuine interest in my business and my GROWTH! I'm so thankful to be able to utilize their services.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109974830121945172065", "name": "Shandah", "time": 1623283259347, "rating": 5.0, "text": "Katherine gets to the point and remains helpful and informative. I am thankful for this journey that we are about to embark on, and I am especially thankful for her enthusiasm and motivation. I am already excited, but she has encouraged me even more.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109037184200606486544", "name": "Kala Brown", "time": 1622998668048, "rating": 5.0, "text": "Katherine, thanks so much for a great experience! I enjoyed our call, the information you gave was precise and extremely helpful! I’m so looking forward to continuing to work and grow with you! Thanks ASBDC!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103650169539800694095", "name": "Paden Crowder", "time": 1620960975175, "rating": 5.0, "text": "I have had a great experience with ASBDC. Katherine, is truly passionate about helping other people and their business reach their full potential. I have met with Katherine several times and her genuine desire is something that cannot be faked.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112965653760409775999", "name": "Vickie Hill", "time": 1619823085397, "rating": 5.0, "text": "Kathrine was the best, she answered all my questions and gave me the information that I needed to get on the right track. She broke everything down in to step by step manageable goals. I look forward to continuing my relationship with her through the expansion of my business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109022400506004919374", "name": "Dominique Ingram", "time": 1620914659011, "rating": 5.0, "text": "Katherine Zobre is amazing! I was impressed on the first phone call! She is a great listener and she followed up with me via e-mail after our session with detailed information and resources! I'm excited about my Journey with Ms. Zobre!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112462637144775405307", "name": "Krystal Bowie", "time": 1619119125832, "rating": 5.0, "text": "I'm so excited to be working with AL SBDC to get my business of the ground. I knew from my first meeting with Katherine that I would be able to succeed this time around. She is helping be confident in what I am building.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114693699989517839226", "name": "Carneil Wilson", "time": 1619285451332, "rating": 5.0, "text": "I am excited and happy to work with ASBDC.  So far Katherine has been great! I look forward to growing and creating a successful business with her help.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101681243189359830940", "name": "Tonya Griffin", "time": 1614892303414, "rating": 5.0, "text": "Wonderful staff!  Quick response time after my initial request for assistance.  Was assigned a Coach within 1 to 2 days of my request.  Coach Katherine is AWESOME!!  Friendly, knowledgable and helpful.  The SBDC Is a great resource for anyone that is looking for assistance with growing their business and is looking for guidance towards the right direction.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106815704827390065977", "name": "Thomas Coiner", "time": 1613618894226, "rating": 5.0, "text": "After the first one-on-one meeting, I immediately understood the value Alabama SBDC brings to the table for small businesses in Alabama. What exactly do you get? It's simple, fully customized support through an incredibly structured and professional experience. You have questions? They either have the answers, or will help you find them. Katherine Zobre is the best!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105204358853051416357", "name": "Brandon Gray", "time": 1611337471860, "rating": 5.0, "text": "Katherine is amazing! Awesome source of information and will work very hard for you. Encourage anyone with a business to take advantage of these FREE resources. They really want to see you succeed!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112624278158624958887", "name": "Keyunna Moody", "time": 1617156002406, "rating": 5.0, "text": "Katherine Zobre instantly got on the phone and started asking my aspirations and future goals. I can tell that she’s really willing and wanting to help build my brand and I am ready.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106708620237881186292", "name": "Brenda Jones", "time": 1617154451668, "rating": 5.0, "text": "Katherine Zobre is amazing!  She's a great listener,  very helpful and she has given me some excellent ideas!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115516258032654905592", "name": "Jaded Me", "time": 1598383902274, "rating": 5.0, "text": "We are starting a new online clothing boutique and we were accompanied by Katherine Zobre. She was very helpful and well equipped with valuable information to help get our business up and running. Since our 15 minute phone call, she has been very attentive to us and our needs by offering links, requesting feedback to doing what she advised us to do, as well as offering her time again for another phone call. We are very excited for our journey with our business and this was such a great experience. It has helped us prepare and get just that much closer to our goals and success.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113358471372122100087", "name": "nehemiah edison", "time": 1604334717179, "rating": 5.0, "text": "Katherine of the Small Business Development Center took time out to help and said if I ever needed help, send her messages and she’ll help. I love that someone is taking time to help someone so young like me to chase my dreams and change them into a reality. Thanks so much for helping me. Everyone starting a business should look for an advisor who won’t mind helping you no matter what and that is exactly what I have found.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "118091467482662166548", "name": "Latoya Sanders", "time": 1610598838091, "rating": 5.0, "text": "Today was my first phone interview with ASBDC counselor Katherine. She was very helpful and was able to point me in the right direction immediately. I'm excited about progressing my business with her advice and looking forward to the next meeting!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109805436112633471268", "name": "TUTR Team", "time": 1613407073667, "rating": 5.0, "text": "This service to early entrepreneurs is amazing. TAKE ADVANTAGE TODAY! Katherine Zobre specifically is kind, understanding, and very helpful.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101931614563113828826", "name": "MiMi Wilder", "time": 1602540273224, "rating": 5.0, "text": "So far, I have only had one phone conversation with Katherine Zobre, but her guidance has been invaluable. She has given me great advice and the needed steps to get my business off the ground. I appreciated her patience with my many questions and her in-depth responses were exactly what I needed. I am super excited about this partnership.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109770837285608593304", "name": "Ashley Terry", "time": 1617212068236, "rating": 5.0, "text": "Very helpful, and I would recommend this program to any one who needs help starting a business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104657527575093948739", "name": "Susan Cornelius", "time": 1598488790796, "rating": 5.0, "text": "Very excited to talk with my personal representative.  Katherine was very knowledgeable and thorough.   Very encouraging and motivating.  She was able to answer my questions and give me direction.  She promptly followed up with recap of our meeting.  I anticipate her services to be very helpful in assisting my small business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100623667939664696212", "name": "Sybrynia Watts", "time": 1610657816827, "rating": 5.0, "text": "I am so excited about this business relationship with the SBDC and it's Coaches.  They offer a wealth of services, information, and a live support team at no cost.  Truly a blessing to small business owners like myself!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111107904180874186840", "name": "Marc Goldsmith", "time": 1611803014215, "rating": 5.0, "text": "Amazing assistance to help grow your business, I speak with Katherine and she truly cares and give cutting edge advice. Highly recommended for entrepreneur's seeking growth!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112266691873025166856", "name": "Michael Plumley", "time": 1598306914584, "rating": 5.0, "text": "I was given SBDC from 58inc and I am so glad they did. They make you feel very important and that you and your business matters. Katherine Zobre is very knowledgeable and professional. She listened to everything I said and typed as I talked to her and then sent me everything I said to approve it. I would recommend SBDC to anyone getting started with a business they are amazing.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115779831004785541081", "name": "LEVELS CEO", "time": 1612960831190, "rating": 5.0, "text": "Thank you Katherine for being a great business resource and mentor for me!  The services this business provides helps no matter where you are in your business journey, as long as you are willing to do the work!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110383436241994909463", "name": "Jamal Commander", "time": 1609985520462, "rating": 5.0, "text": "I have had the pleasure of working with Katherine Zobre so far and it has been amazing. She has given valuable information and aided in the startup of our business so far. The ASBDC has a great model and I am a huge advocate and will definitely share with friends.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103145855419034974945", "name": "Kierstan Lee", "time": 1608252863575, "rating": 5.0, "text": "Katherine Zobre is the absolute best at what she does. She is very professional and extremely responsive. I look forward to our future conversations.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109369576739329420495", "name": "Halei Moss", "time": 1598529964532, "rating": 5.0, "text": "Ms.Zobre was so helpful with everything I needed. She explained each step and what those steps meant. I gained a better understanding of what I need to do and she made me even more excited to get my business started! I will definitely talk with her more along my journey of getting my business started.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107348651752831083307", "name": "ML Stewart", "time": 1604340110859, "rating": 5.0, "text": "I recently had my first phone business review with Katherine Zobre. She was able to answer all of my many questions, as well as provide me with guidance and information on how to proceed on my first business venture. I’m still a bit nervous, but knowing that I have someone as knowledgeable Katherine to speak with puts my mind at ease.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105486027068244592933", "name": "Selena Rodgers Dickerson", "time": 1599235302228, "rating": 5.0, "text": "Working with Ms. Zobre helped me feel like I have support. I knew SBDC had some resources, but after a short, one-on-one conversation with her, I learned of so many things that I had been struggling with understanding were within reach and available through the SBDC. I feel relieved.\n\nS. R. Dickerson, President\nSARCOR, LLC", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112335072265204077576", "name": "Jacob Kilgore", "time": 1599083295869, "rating": 5.0, "text": "Very appreciate of Katherine Zobre. She answered many questions I had and was eager to learn more about my upcoming business plans in order to assist me in any way possible. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114362848565905943182", "name": "Tanesha Williams", "time": 1608144697305, "rating": 5.0, "text": "Katherine Zobre took the time to answer ALL of my questions. Her guidance was step by step and very much appreciated!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108794769249433402216", "name": "Carla Blake", "time": 1598448879460, "rating": 5.0, "text": "ASBDC is offering me the ability to develop as a business owner and reach my potential. We are growing jobs!!!! The mentorship I am receiving has paid off exponentially in a short manner of time. Katherine Zobre is my mentor and she is knowledgeable, warm, and engaging. An invaluable resource in a challenging economy.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111008811254862798959", "name": "Tiesha Gresham", "time": 1602857887848, "rating": 5.0, "text": "My experience working with ASBDCN and Katherine Zobre has been amazing. I was able to speak with her one on one and create an outline of where my business is and where it is going. The information that was provided to me will be very instrumental in taking my business to the next level. I am so excited and can not wait until our next meeting!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110203370210973461811", "name": "Dana Payne", "time": 1602278552104, "rating": 5.0, "text": "Katherine Zobre is passionate about what she does and it reflects when she advises and assists you in establishing and meeting your business venture goals. She guides you every step of the way and if there is an area she cannot personally assist with then she has the name and number of someone that can. She’s an excellent advisor and cares about you achieving a successful business. Always there to hold your hand along the path to creating a business that aids in growing Alabama’s economy. Thanks SBDC!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112597591197345690965", "name": "Michelle Aldridge", "time": 1600904337886, "rating": 5.0, "text": "Speaking with an advisor really eased my mind about taking the leap to go into business  for myself. They were very knowledgeable and answered all my questions. I feel they really care that I succeed in my endeavor.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100563794591828852667", "name": "Nick Tyler", "time": 1602610544803, "rating": 5.0, "text": "Extremely professional. Love how they take the time to make sure you are informed and comfortable with business. I will continue to go back with them as my business grows.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103752886922655130583", "name": "Dennis Echoles", "time": 1603316127454, "rating": 5.0, "text": "The communication I have been afforded the opportunity to be involved with has been very valuable. My conversation with Katherine Zobre was an awesome and rewarding experience.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102327323909291707065", "name": "Jarkeshia McGahee", "time": 1605290694328, "rating": 5.0, "text": "Katherine was very prompt and helpful. She is helping me to get everything in order for my business. Thanks!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "118232973818332244173", "name": "wei li", "time": 1603331882209, "rating": 5.0, "text": "I had first consulting session today. It's brief but constructive. I'm looking forward to the next meeting.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117343697733274548875", "name": "Sarita Colvin", "time": 1602723906909, "rating": 5.0, "text": "I have been working with ASBDC for the past two weeks; Business Planning 101 and individual consults. I have been pleased with the professionalism and the information provided. Ms. Zobre has been very knowledgeable with the information I've needed and I am looking forward to continued collaboration with her.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101610144769610565689", "name": "Raquel T Green", "time": 1582475302155, "rating": 5.0, "text": "Katherine Zobre is an amazing business advisor. In just one brief 30-minute call she provided the most thorough compilation of support and expertise She is very personable and knowledgeable. Guiding me towards the next steps in gaining complete success with my business endeavors. Showing me my strengths and weaknesses, and even better the resources to both use them and improve them. Her passion for my idea as well as my success is remarkable. She is a coach, cheerleader, and mentor all-in-one!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100593504616965812515", "name": "Jaz S", "time": 1591894340046, "rating": 5.0, "text": "I am working with Katherine Zobre and I am thoroughly enjoying the services that I am receiving from her. She is transparent, honest and I can tell that she wants me to have all essential components to make my business as successful as possible. I look forward to the growth of my company with her assistance! I’d highly recommend her for additional assistance and business needs.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109413757704682677123", "name": "Claudine Land", "time": 1602809962068, "rating": 5.0, "text": "Katherine is a consummate professional. She took the time to listen to my business needs and generated information for my business growth and development.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108779211823362864830", "name": "Ingadi Flower Farm", "time": 1604592384103, "rating": 5.0, "text": "Great help!  Katherine Zobre is an outstanding resource for starting a new venture.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107650527076798932057", "name": "ranilda lipsey", "time": 1598283597664, "rating": 5.0, "text": "It was a pleasure to speak with my representative at ASBDC. She was very knowledgeable and gave me the boost of motivation I needed after hitting a temporary wall. I can't wait to get back on track!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113937363645765324509", "name": "YOGI DADA", "time": 1596831385259, "rating": 5.0, "text": "I am ALREADY in love with the ASBDCN! I reached out just last week and received two phones call since then confirming what I need and how to move forward. Katherine Zobre...I am already in awe! I have GREAT expectations I will not be the same as I proceed through this program.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109093736821013538731", "name": "Leah Pogwizd", "time": 1594578236309, "rating": 5.0, "text": "I am starting to work with Katherine Zobre, who is helping me start my new business. She is friendly, professional, and thorough. It is an amazing resource - and totally free! I look forward to working with ASBDC to develop as an entrepreneur.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113599490898515550813", "name": "Russ McLeod", "time": 1567104920943, "rating": 5.0, "text": "Katherine was extremely friendly and very approachable in our conversation. The entire time,  I felt as if I was speaking with a friend that was looking out for my best interest. I asked for her background and it was jaw dropping the experience she has and the life she has lived. I was truly amazed to speck to someone at her caliber. Thank you for making the first steps of my new journey so awesome.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107356288238717079164", "name": "Adrian Latham", "time": 1603981430086, "rating": 5.0, "text": "I have started working with Katherine and she is friendly yet very professional. She took time to listen and really assist with all my questions. I’m looking forward to our next meeting.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103986132661777618610", "name": "Stephanie Hicks", "time": 1583429018181, "rating": 5.0, "text": "Katherine is an awesome mentor. I feel like she is an encyclopedia on business. Although I have a B.S. in HR and M.S. in Management, I am receiving some topnotched advisement and more importantly encouragement. This new entrepreneur is extremely grateful.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102232602287241733401", "name": "MICHAEL HOLMES", "time": 1597323329087, "rating": 1.0, "text": "The sba might help white people. If you are a foundational black American  they are not going to help you nor communicate with you. SBA only collect black businesses information for EOC purpose.They will not help you get anything tangible for you business if you are black.\n\nMr . Jerry Ellison is the only person that will call you back and actually help you. He is a great man and is never to busy to help unlike the others at sba.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106681301927380835413", "name": "Jeremy Hoggle", "time": 1586526959114, "rating": 5.0, "text": "I've had one meeting so far and wow!  The advisor was extremely helpful and very knowledgeable.  I will be scheduling more meetings as time allows.  I highly recommend contacting the Alabama SBDC Network.  You will not regret it.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104455880800363945995", "name": "D. Gulledge", "time": 1583196664839, "rating": 5.0, "text": "Still early in the process, here, but Katherine with ASBDC has been exceptionally resourceful and timely in her responses. As intimidating as it seems to start a business, she conducted our first phone call with professionalism and nonjudgmental listening where she later provided many key insights for me to take advantage of. I feel like I have lots of homework to do, however, another advantage was that she made it clear that you're never too early or too late in the process to make progress towards your business and financial goals.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113637077907048987937", "name": "Pamela Foster", "time": 1592162258511, "rating": 5.0, "text": "I had a very in-depth consultation session over a short period of time in order to assist me in planning and moving forward with my business.  Excellent consultation!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115816393707704005616", "name": "Tatiana Thomas", "time": 1593523585360, "rating": 5.0, "text": "Ms. Zobre was amicable and very helpful in the advising call. I will definitely continue to use this service in the future.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106861456167858054945", "name": "MGLC Selma (McRae-Gaines)", "time": 1594244412642, "rating": 5.0, "text": "I had a very good call with Katherine Zobre at Alabama SBDC Network and received some very helpful advice for our small non-profit going forward. I look forward to continuing the conversation.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103777757213318779110", "name": "Jevon Lewis", "time": 1579722906730, "rating": 5.0, "text": "Katherine Zobre has been true to her words and has really been on point sharing valuable information for starting a business. I feel like I'm behind trying to catch up to her. Very much appreciated.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101641971033697567281", "name": "Wes Hurst", "time": 1584036193461, "rating": 5.0, "text": "Katherine Zobre was extremely helpful with understand how the format of create a business goes and the willingness to help make sure I succeed with my business.  If you are not using this service whether you know what you are doing or not, you are missing out on many resources and all kind of knowledge from them.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108730393893461746891", "name": "Hannah Gils", "time": 1592423830840, "rating": 5.0, "text": "Katherine with ASBDCN is very helpful! She's connecting me to the right resources, while answering my small business questions.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111161303869644090319", "name": "Elizabeth Wynn", "time": 1579404387790, "rating": 5.0, "text": "I'm beginning my journey on opening Black Warrior Apothecary in the very near future. I am a handcrafted business which can be complex. Katherine Zobre is my advisor and she has done an amazing job in the short time I have worked with her. Katherine gave me a ton of insight on marketing, price point,  business planning, taxes and the proper licenses my business needs. The team at ASBDC has done an amazing job and I look forward to working with them in the future.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109918575815977543785", "name": "Corey L. Hartman, MD, FAAD", "time": 1585851752556, "rating": 5.0, "text": "So informative and helpful. A fantastic resource for any business owner. I highly recommend Katherine Zobre in particular.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108609361953506960291", "name": "Autumn Sanders", "time": 1585247589542, "rating": 5.0, "text": "I had a great conversation with Katherine about actionable steps we can take to meet our goals. I will definitely keep in touch and recommend their services to entrepreneurs at any stage in the game.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107640443567279733512", "name": "Bruce Williams", "time": 1595829579576, "rating": 5.0, "text": "I had a great experience working with Katherine Zobre. I look forward to working with her in the future.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109852605733526720353", "name": "Daniel Hallmark", "time": 1586533571030, "rating": 5.0, "text": "The ASBDC was exceptionally helpful in getting my new IT Consulting business started.  I am a new business owner, self-employed, with no prior background in business operations.  Katherine @ the ASBDC took time to find out where I was at, my goals and plans, and provided customized advice to help me reach my objectives.  She answered all of my questions and also provided a checklist of items to consider to ensure that all of my bases were covered.\n\nI really liked that the service was not only comprehensive but also personal. The interviews followed a structured process to make sure nothing slipped through the cracks, but the output of the program was\na set of recommendations tailored to my individual business needs.  Katherine was also extremely easy to talk with, which was great considering I was a bit nervous about starting my first business.\n\nI highly recommend any new or prospective business owners to check out the resources that ASBDC has to offer!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101833510547668896082", "name": "Shawn Blackburn", "time": 1563911382803, "rating": 4.0, "text": "Outstanding help and support.  I was all over the place with my new business startup.  The Network was able to refocus my attention on details and prioritization.  They offered a suite of tools that were simple and easy to understand.  Their guidance is a must have if you plan to be successful over the long-term.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103836568790275101165", "name": "Jay Coleman", "time": 1594254083551, "rating": 5.0, "text": "1st initial impression is, SIMPLY AMAZING! Look forwarding to this journey with ASBDC...", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112435593777272781939", "name": "Lynn Minor", "time": 1586041633440, "rating": 5.0, "text": "Being a fairly new business I am gaining great knowledge of on how to not only operate but being successful", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104276913531549502237", "name": "Swyft Ryde", "time": 1581533986658, "rating": 5.0, "text": "Incredible consulting services and extremely flexible working with our schedules! Katherine at ASBDC was very thorough in reviewing our business information to date and working with us to navigate to the next stage of development.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102366087835120814041", "name": "Rachel Robinson", "time": 1580819338983, "rating": 5.0, "text": "Katherine is awesome and was quickly able to determine the steps I need to take towards making my business(s) better and put me in the right direction. I'm excited for what's to come!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115867315255986995682", "name": "Jack Towns", "time": 1584592068566, "rating": 5.0, "text": "ASBDC is quick to jump at the opportunity to help you with piles of material and information for to you get started, keep going or finish strong. Im in the process of starting my own business and I was sorta lost and wasn't sure where to begin, a friend told me about ASBDC and I shot them an email and we had a great phone call interview. Still in the beginning stage so I will keep  you posted on how it goes", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112708424519704145194", "name": "Shay Gray", "time": 1562772152395, "rating": 5.0, "text": "Katherine Zobre is the best Business Advisor. She has given me so many resources and information that I did not know existed. She is very knowledgeable and very detailed with her information. I am blessed to have Katherine as my business advisor!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114020892503821518213", "name": "Michael Kortman", "time": 1570127980741, "rating": 5.0, "text": "Just had my initial consultation with Katherine Zobre of the Alabama Small Business Development Council.  She was very knowledgeable about operating a small business and helped me greatly in determining my next moves to make my business work better.  I wish I had found this resource a year ago!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112455101997884773446", "name": "Alycia Levels- Moore", "time": 1582507820975, "rating": 5.0, "text": "Super helpful and amazing place to get resources to get you started on your way. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111228505569680201161", "name": "Mark Rubino", "time": 1586549871008, "rating": 5.0, "text": "Katherine Zobre was extremely helpful and reassuring in guiding us through the PPP and EIDL programs this afternoon. Many thanks to Katherine and the ASBDC team!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "103206676951010694997", "name": "Bonnie Nicks", "time": 1556883484397, "rating": 5.0, "text": "My advisor has been prompt, well-informed, and encouraging. Equally important she has worked to insure that I stay on track and has not allowed me to fall between the cracks. She checks in on my progress in a timely fashion.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "116148025896802047455", "name": "Kristin Boyd", "time": 1580325698031, "rating": 5.0, "text": "Katherine Zobre has been very helpful. She has given me useful, objective, and constructive advice that is helping me get my business established.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100285372841567090130", "name": "Péricles Augusto", "time": 1580012636415, "rating": 5.0, "text": "Great experience, they tried very hard to reach me, gave me all the information I needed and pointed me in the direction regarding to specific topics.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117864358445488838715", "name": "Travelodge Tuscaloosa", "time": 1587991836314, "rating": 5.0, "text": "They are very knowledgeable and willing to help. I got answers and information that helped me complete the application process.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110082236950105964983", "name": "DJ ALLEN", "time": 1586284331413, "rating": 5.0, "text": "Very good resource. Katherine was very helpful and encouraging.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109544417929018353918", "name": "HILLUT91", "time": 1579727014061, "rating": 5.0, "text": "Wow!  What a wealth of information coming out of my first call.  If you've ever thought about starting a business, give these folks a shout and hold on.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101438430989112218770", "name": "TheBuzzsaw16", "time": 1598647777494, "rating": 5.0, "text": "Katherine called me right on time and listen to my concerns about my small business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110561432111611562879", "name": "Joel Kervin", "time": 1556908090966, "rating": 5.0, "text": "Truly an amazing resource! If you are thinking about starting your own business, ask for their help FIRST! Extremely knowledgeable and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110071311114313594074", "name": "Denise Trayvick", "time": 1546000285500, "rating": 5.0, "text": "Katherine Zobre is awesome.  I had so many questions.  She took the time to listen and answer them all.  She also sent me the information to get me on the right path.  I highly recommend Alabama Small Business Development Center Network", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117284190608121841222", "name": "Ted Price", "time": 1556812183466, "rating": 5.0, "text": "Jerry Ellison has been such a big help.  The ability to get straight answers in a timely fashion is valuable, especially for a small business.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110944869426538145139", "name": "Jeremy Huckaby", "time": 1559792478395, "rating": 5.0, "text": "Alabama SBDC is an incredible organization with which to work. I know this from personal experience and interacting with their great personnel. They have had an amazing impact on Sprayroq's export business and continue to support export opportunity pursuits for our business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "109022181226044282661", "name": "Erick Bloomfield", "time": 1556819601294, "rating": 5.0, "text": "Mr. Washington with the SBDC, at the USA campus office, was awesome. He answered all of our questions and supplied us with with contacts to get our first brick and mortar shop up and running. If you need help and don't know where to start. Make an appointment with the SBDC. And it's free. They really do help you get started.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNwac27lf69B8SvkwDeMz63yiiUk5tKY7Bs-eIk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "117312708642364826162", "name": "Mica Angelita", "time": 1572190867831, "rating": 5.0, "text": "My consultant was very dedicated to me and managed to meet all my needs, definitley 10/10.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "104556893682209892229", "name": "Stephanie Foley", "time": 1556666241981, "rating": 5.0, "text": "They are amazing and so helpful! They care and want to help you succeed by answering all of your questions and giving you invaluable resources!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "106460908893806201249", "name": "Joanna Lemmon", "time": 1559854006132, "rating": 5.0, "text": "Katherine has been so helpful and I am so excited about her being a resource for me to start a new business here in Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111531135119080229604", "name": "Author LaMonique Mac", "time": 1562138298060, "rating": 5.0, "text": "Kathryn, my free business coach is insightful and helpful. Thank goodness for her knowledge and guidance.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "107732671517580603955", "name": "Tyler McGovern", "time": 1562769902834, "rating": 5.0, "text": "Incredible wealth of knowledge. They help you get the exact resources you need.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102854627994233485090", "name": "Tumbleweed54", "time": 1544063066200, "rating": 5.0, "text": "Opening a business can be a complicated and stressful process. Ms. Zobre is very prompt, knowledgeable, and understanding in making this process a lot easier. We feel very fortunate to have this professional and ASBDC assist us in achieving our goal.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105440550461069986891", "name": "Najah Bell", "time": 1548819469084, "rating": 5.0, "text": "ASBDC will change the way you run your business. Extremely informative and a great support system.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "114175021614551675201", "name": "Trevin Fluker", "time": 1546455964073, "rating": 5.0, "text": "Katherine Zobre is a great adviser who helped me move past having an idea to actually focusing on tangible steps to starting my business.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "110744671922039398780", "name": "Anastasia Peinitz", "time": 1546971134158, "rating": 5.0, "text": "Soon after my registration with ASBDC I noticed the care and proffessionalism. An appointment was made right away and communications began.\nKatherine Zobre took a lot of time, listened to all my questions, and took notes. She is also super friendly. I look forward to go through this process with her. I think it is awesome to get this kind of help.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115628836284122924200", "name": "Caleb Collins", "time": 1548865779611, "rating": 5.0, "text": "The sbdc has been great so far in helping me start up my new innovational technology business. They have helped me in ways of guidance and information as well as directing me to other resources to help me progress.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "105163813052378773488", "name": "Yanna Johnson", "time": 1568213483221, "rating": 5.0, "text": "Love the services!! Katherine is awesome to work with", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "101205988053872501502", "name": "Rain Blankenship", "time": 1586463044910, "rating": 5.0, "text": "Very caring and professional treatment.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "113322271588901623582", "name": "Teresa Carter", "time": 1536862214029, "rating": 5.0, "text": "Ms. Zobre was great she helped me with everything I asked.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "115421129537424134302", "name": "CAK Medical", "time": 1581707439551, "rating": 4.0, "text": "Very informative and detailed.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "112785193878266302448", "name": "Amy Wright", "time": 1585107041394, "rating": 5.0, "text": "So much valuable information!!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "111756501185496215651", "name": "Dawen Li", "time": 1560872778373, "rating": 5.0, "text": "Very good service on small business", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "100022798303028756996", "name": "Robert Armstrong", "time": 1548881048615, "rating": 5.0, "text": "Awesome group of people to work with!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "116101873367470334259", "name": "Susie Lawley", "time": 1585676639135, "rating": 5.0, "text": "Most helpful!!", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "102121591222429332324", "name": "Dustin Doss", "time": 1556852145929, "rating": 5.0, "text": "Dedicated and professional.", "pics": null, "resp": null, "gmap_id": "0x888602986d0f8c7b:0xd3d264d71006d63"}
{"user_id": "108267357858859074915", "name": "Stephen Franklin", "time": 1626642612730, "rating": 5.0, "text": "Always a pleasure working w/ Bryan Parker and his staff. Even after we relocated over an hour away my wife and I continue to use Bryan for our tax needs. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100952886940019018185", "name": "Dianna Howell", "time": 1573655535164, "rating": 5.0, "text": "Bryan Parker is the best!  His attention to detail was awesome. He takes his time to explain ways to save money and gives great tax advice!  I highly recommend Bryan Parker!!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "117549785040606524293", "name": "Marcus Williams", "time": 1568145767947, "rating": 5.0, "text": "Bryan Parker CPA has provided excellent financial services to our small business. We found him just a few weeks after opening our doors. He has helped with taxes, financial planning, payroll and more. I highly recommend Bryan Parker CPA to anyone looking for accounting and finance help.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100966121221547422448", "name": "Kyle Lubsen", "time": 1551572046199, "rating": 5.0, "text": "Bryan L. Parker CPA and the staff are excellent to work with. They are very knowledgeable and helpful.  They have done our taxes for several years and they are quick and thorough. Bryan is quick to respond to questions and the staff also there if you need anything. As a small business owner it’s good knowing they have lots of experience with businesses and keep current with tax code changes.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "117091208165140612711", "name": "Mike Acton", "time": 1535231361777, "rating": 5.0, "text": "Bryan Parker and his group of employees are simply the best. Bryan is more than just \"the guy that does my taxes\". He is an advisor, a professional, and has become a trusted friend. He was recommended to me by my sister in 2006. Little did I know 12 years later that I would trust him not only with filing my taxes, but also trust him with his advice on decisions I have made with business and family matters. I recommend him because he is honest, trustworthy, and takes a personal interest in taking care of his clients.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "107464967600256228209", "name": "Brandy Hamilton", "time": 1573655343992, "rating": 5.0, "text": "Bryan and his team strive for excellence! Great experience getting my tax return completed! Very knowledgeable and friendly service!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100737971883356402400", "name": "L.E. Marcus", "time": 1573655567282, "rating": 5.0, "text": "What a great company to take the worry and stress out of dealing with the IRS! Very personable exec and staff! Definitely recommend Bryan Parker CPA for all of your tax needs.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109859697862035342207", "name": "Bonnie Sult", "time": 1573655443288, "rating": 5.0, "text": "Brian does a fabulous job for his clients and is very responsive and accurate. He is quite knowledgeable and shares that knowledge openly.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108262374914417768278", "name": "M. Williams", "time": 1562946275945, "rating": 5.0, "text": "Bryan Parker CPA does a great job on our taxes and payroll processing. I highly recommend his firm.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108547963885600221308", "name": "Nancy D. Sam", "time": 1415679352420, "rating": 5.0, "text": "As a newly opened business, we knew it was necessary to properly manage our finances. We didn’t have enough money in the budget to hire a full time accountant, so we had to settle with an accounting service. We worked closely with Bryan Parker and were able to prosper financially from the get go! The company is almost a year old now, and we’ve seen great success. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "110475303051117164810", "name": "Cee Bee", "time": 1551718645233, "rating": 5.0, "text": "Great customer service.  Always patient in explaining things so that you understand new guidelines, laws etc.   Fast turn around time.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "106229067383085316652", "name": "Erick Boggs", "time": 1551859427787, "rating": 5.0, "text": "By far the best experience ever in taking care of our taxes.  BLPCPA is the most thorough and experienced Firm that I have ever dealt with in completing taxes.  The staff is very knowledgeable, helpful and polite.  If you are not using BLPCPA as your Accountant then you are really missing out!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113354890299372002697", "name": "Laura Steele", "time": 1556744990099, "rating": 5.0, "text": "Bryan and his staff were super to work with in getting our taxes done. My husband and I are both independent contractors and Bryan took time to meet with us to let us know how to make the most of business deductions. He also talked to us about when and how to set up a business and save even more on taxes. We will use him again!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "107309774221835934917", "name": "Sandra", "time": 1551115286894, "rating": 4.0, "text": "Very service oriented. Different from what we were used to in Ohio, where they prepared everything right in front of us. Here after they fit us into their busy schedule, and discussed our needs we found out the cost dropped off our tax records then when they were ready came and picked up our paper work.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116543050913163351927", "name": "Earl Hurst", "time": 1556702483130, "rating": 5.0, "text": "Have been using turbo tax for years and never had to much trouble with it until recently. Had BLPCPA go back over my taxes because of some things that didn't look right. They found some things that turbox was doing wrong and redid 2 years of my taxes plus this current year to help me lower my tax bill. Excellent customer service and a quick turnaround time", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "112011319020392854635", "name": "Jason M. Holt", "time": 1412943877997, "rating": 5.0, "text": "Opening a business and planning its future is not that easy; I learned that first hand. Six months ago, I opened a local business in Jefferson County and was excited to be my own boss, but I did not have much knowledge or skills about running a business or creating a business plan. Bryan L. Parker CPA was able to help me create an effective business plan, as well perform bookkeeping. I am now more confident about my business and its future.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "112066157960935318870", "name": "Marilyn Collier", "time": 1556579607005, "rating": 5.0, "text": "We have used Bryan Parker for 10 years and have been very pleased.  We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113257966579415200824", "name": "Alicia Melton", "time": 1553691232489, "rating": 5.0, "text": "We have been so pleased with Bryan Parker CPA.  They are always timely and efficient. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109086288399945301754", "name": "Adam Holmes", "time": 1573655573967, "rating": 5.0, "text": "Bryan and his staff takes the stress away from your tax needs and payroll requirements. Highly recommended !!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116779078548972716644", "name": "Anderson Rodriguez", "time": 1418713240469, "rating": 4.0, "text": "Our business was having problems with our bookkeeping. The person we initially hired set up back big time. Luckily, we got much needed help from Barry Crauswell of Bryan L. Parker CPA, LLC. He was able to get up back on track! It was great to know that he could help get us out of the jam we were in.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103376468985409430160", "name": "Luke Germek", "time": 1556894436935, "rating": 5.0, "text": "Excellent service at a reasonable price. Thanks for all of your hard work!!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "102882648010697328637", "name": "Mike Lynn", "time": 1520618369235, "rating": 5.0, "text": "Mr. Parker is AMAZING!!! He is very knowledgeable, easy to deal with, and best of all superior professionalism at an affordable price!!! I will definitely continue using his services for both my business and personal accounting affairs!!! Thanks Mr. Parker!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "114557499457094539349", "name": "Wes Day", "time": 1541618162848, "rating": 5.0, "text": "Bryan met with me on short notice.  Calm cool and collected, he reviewed my paperwork, charged me a more than fair rate, I thought.\n\nHighly recommended.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "101849667012111574980", "name": "Nisha Patel", "time": 1487092676075, "rating": 5.0, "text": "We have been using Mr. Parker for 13 years now for our business and personal bookkeeping.  He has assembled a great team and they do a fantastic job.  We thank you and hope to continue with many years of partnership.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116309493239551967933", "name": "Christine Long", "time": 1556642560053, "rating": 5.0, "text": "Bryan Parker and his staff, along with his wife Pat, have been consistent, efficient accounting advisors for our family for many years.  Mr. Parker has a wide scope of business experience in many different industries, so is definitely the \"gp-to\" person.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "105922963930691908783", "name": "Matt Brundige", "time": 1487087997630, "rating": 5.0, "text": "The team is so friendly and easy to work with. No question is a dumb question and they go above and beyond to make your tax season and payroll needs a very smooth process!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108568602490915006379", "name": "Pamela Collins", "time": 1480343988184, "rating": 5.0, "text": "Excellent and fast on completing my taxes and more money back then if I had done myself. Great advise on financial planning.  Friendly and professional staff", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103682052198523681843", "name": "Ron Waddell", "time": 1487361109912, "rating": 5.0, "text": "Bryan Parker has been my accountant and financial adviser for over ten years. I find him to be very honest, extremely knowledgeable, dedicated to serving his clients, and easy to do business with. I would highly recommend him and his staff to anyone looking for either an account or financial adviser.\n\nI find it really reassuring to know Bryan is on your side when I receive those irritating letters from the IRS.\n\nRon Waddell\nSterrett, Al", "pics": null, "resp": {"time": 1487420303536, "text": "Thank you for your kind words Ron. We strive to provide the highest level of service to our clients."}, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100236926857041528307", "name": "Lee Dykes", "time": 1556756606029, "rating": 5.0, "text": "No one looks forward to tax season, but Bryan Parker, CPA, and his staff help ease the anxiety of filing the necessary forms on time and with accuracy.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113060076254201156521", "name": "Kurt de klerck", "time": 1487113171767, "rating": 5.0, "text": "Bryan and his team do fantastic work , they are friendly and they always help you out in case you have any questions . I feel lucky to have them as my accountant and would only trust Bryan l Parker and his team with all my business related items .", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "111032031764538312639", "name": "Marjorie Berguson", "time": 1487122416128, "rating": 5.0, "text": "We feel very comfortable to have Bryan Parker do our tax returns.  He is very prompt and efficient.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "118323878804128032506", "name": "Iceeu (Sonshine)", "time": 1497288955272, "rating": 1.0, "text": "I had to give a star to review Mr. Parker. My. Parker is the Accountant for my neighborhood's H.O.A. I was relatively new to the neighborhood just buying my home 2 years prior to investigating the H.O.A. I was unable to get any financial information from the only board member so I went to Mr.Parker.\nHis Secertary was so kind and very helpful and I appreciated that. She told me Mr. Parker was not in the office after returning from an office. I asked her some questions and she went back and forth to the same office with answers to the question's. I them saw a man comes from the office leaving and got on the elevator headed down. I know this today to be Mr.Parker, as she walked past the man was wearing a T-SHIRT advertising his business Bryan L. Parker Accounting. I later sent him emails requesting his presence at our Association meeting, I never received a reply.\nI realize that all of this blame doesn't lie solely at Mr.Parkers feet, it lies equally at his feet and that of our Association President's feet. I received contradictory answers for questions I asked. As a homeowner I and my neighbors pay a fee to Mr. Parker and as an employee he should have been able to answer everyone of my questions and he did not. It is my opinion and the opinion of many of my neighbors that Mr. Parker made no effort to assist us with any information at all at several different requests and times. To us that is shady behavior.", "pics": null, "resp": {"time": 1501619224990, "text": "This post appears to have some misunderstandings. First of all, whoever was seen walking past, if you were told I was not in the office, was not me. We do not have t-shirts advertising our business so I would question if you were even at our office, since you have inaccurate information. Secondly, we are not employees of the HOA, we are contracted by the HOA board to handle certain accounting functions and provide the board with requested reports. Similar to any business, the reports are disseminated from the top (HOA) to those who need to know. Privacy laws are very strict and we try to adhere to them diligently. If you want more access to information of your HOA, I suggest you become a member of the board. As I understand it, several requests have been made for more board participation but thus far there have been no takers. If you become a board member, we would be glad to share appropriate information with you."}, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "102698727483056600869", "name": "Mike Bennighof", "time": 1487182542317, "rating": 5.0, "text": "Highly professional in all aspects.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "115538371609515829629", "name": "Jeremy Thompson", "time": 1424922207155, "rating": 5.0, "text": "He got me a ton more back on my personal taxes than doing it myself online.  Will be back next year for sure!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103743159169962355484", "name": "Sonny Adkison", "time": 1620303441318, "rating": 5.0, "text": "I have relied on The Faircloth Group for approximately 7 years for both business and personal and highly recommend their service.  Nathan and his team have worked closely with us in tax planning, bookkeeping and just overall business planning.  The emails/newsletter keeps us informed of tax changes and deadlines which is a great tool that other firms did not offer us.  They are never too busy to answer a question or email.  Thank you Nathan and your amazing staff for all your hard work and the extra time you take with your clients.", "pics": null, "resp": {"time": 1620306714024, "text": "Thank you so much for the kind words Sonny! We truly enjoy working with great business owners like you and feel very fortunate that we have been able to work with you and your family for so many years."}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "113952655681141985545", "name": "Carlie Fletcher", "time": 1617120205775, "rating": 5.0, "text": "The Faircloth Group has been amazing to work with. As a newer company we were lost when it came to preparing our taxes and doing our bookkeeping. We started off by trying to do things ourselves and realized that we were unable to keep up with that aspect. When we contacted The Faircloth Group they were very friendly and helped us to understand the process. They were able to go back and catch our books up for the entire year and we set up an ongoing agreement to keep everything up to date, taking those tasks off our plates. It was such a relief to find such a great team to handle our bookkeeping, business and personal taxes.", "pics": null, "resp": {"time": 1617122684050, "text": "Thank you, Carlie, for your positive feedback! We're passionate about helping local business owners navigate and understand the accounting process. We're fortunate to work with great business owners like you! Your success is our success:)"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "114162516679868835461", "name": "Joe Kitchens", "time": 1616850653240, "rating": 5.0, "text": "The Faircloth Group is a locally owned accounting firm that does a great job for our company.  They give us the attention we want, give us good advise and work with us in all our accounting needs.  Always professional results and a friendly and helpful staff.  We feel fortunate to be a client for many years with them.", "pics": null, "resp": {"time": 1617022383503, "text": "Thank you so much Mr. Joe! We value your feedback and we're very privileged to have you as a long time customer!"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "101476004303545041779", "name": "My Name", "time": 1617231771361, "rating": 5.0, "text": "After having a bad experience with a past accountant I had asked around for a referral to a good local company, and they came highly recommended. I am so glad that I chose this company as they have been super professional, fast and really know their craft. I cannot wait for me and my company to have more years to come.", "pics": null, "resp": {"time": 1617290975593, "text": "Thanks so much for sharing your experience with us! We're so glad we were able to help you feel comfortable in your transition. We realize that you have choices when it comes to accounting services and appreciate the opportunity to assist you and your business!"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "107173286763322652116", "name": "patrick mcnorton", "time": 1616701891638, "rating": 1.0, "text": "Don't take there word for it if it doesn't sound right look the tax law up yourself. All I have to say either they don't know the laws very well or they will try to make you pay for things that is not necessary.", "pics": null, "resp": {"time": 1616707236258, "text": "Hi Patrick, thank you for your feedback. We're sorry that you were dissatisfied with your experience and that our services were not a fit for your request. Thank you for considering our firm for your tax preparation, all the best to you."}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "117025556550825667477", "name": "James Counselman", "time": 1617222172178, "rating": 5.0, "text": "Great people!", "pics": null, "resp": {"time": 1617290525463, "text": "Great customer:) Thanks James! We always enjoy working with you and your family!"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "113741834839615393076", "name": "Shachar Shiber", "time": 1608562360857, "rating": 5.0, "text": "Dale Carnegie has changed my life! Nancy was an amazing teacher. Shes patient and kind and helped us believe in ourselves. I came in shy and scared and graduated with confidence and new friends. This course taught me how to not only deal with my professional life but also my home life. I recommend everyone take this course at least once in their lifetime. Absolutely worth it!!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "113870824415207379817", "name": "Chandler Nelson", "time": 1621612777435, "rating": 5.0, "text": "Thankful for your guidance Nancy!! The passion you exemplify is contagious, hope all of my crew is able to take your course!!!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "118314973579671143904", "name": "Jennifer Hamilton", "time": 1610737219684, "rating": 5.0, "text": "10/10 would highly recommend. Nancy Covert never disappoints. I've taken a couple of her courses now, and they are always informative, entertaining, relatable, and fun. She and her staff always go the extra mile to make sure that you know they are there for you, and that you get something out of the class. It never fails that you walk away learning more than you thought you would.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "104818660577799623972", "name": "Mtf Entertainment", "time": 1624019134841, "rating": 5.0, "text": "Great program that has built my confidence and set me up for success.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "102765217876677917260", "name": "Kevin Kiel", "time": 1610921097035, "rating": 5.0, "text": "Dale Carnegie trainers Nancy and Robert were great. They were very encouraging and helpful throughout this class. I will recommend to others.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "115110704831473590050", "name": "Denice Durr", "time": 1608667836300, "rating": 5.0, "text": "It was one of the best training courses I have ever taken. Nancy is a Awesome instructor who brings something extra to every class.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "117892604705103435108", "name": "Phyllis Handwerg", "time": 1608570040261, "rating": 5.0, "text": "this is a great course!  the instructors are awesome! highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "100252414452275724917", "name": "Natalie Hamilton", "time": 1579701577135, "rating": 5.0, "text": "The Dale Carnegie Immersion Seminar was a completely different experience from other training courses I've taken. The curriculum pushed me outside my comfort zone, helped me gain more confidence as a leader, and taught me many valuable skills I will use in both my professional and personal life. Nancy Covert is a fantastic teacher and coach. It is obvious that she is passionate about what she does, and the energy she brings to class is infectious.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "118246539006829895601", "name": "Jeffrey Norris", "time": 1579643790139, "rating": 5.0, "text": "I think everyone should take this training class.  Nancy did an amazing job getting everyone involved.  It is worth your time!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "107849052162575103120", "name": "Emily Hook", "time": 1542637765410, "rating": 5.0, "text": "I was initially reluctant to take time out of my hectic schedule and away from my family in order to attend this class, but I'm so glad that I did!  The class was extremely beneficial and I thoroughly enjoyed it!  Nancy Covert is an excellent instructor and she made the class so much fun.  My classmates and I bonded and I feel that our friendships will continue long after the class is over.  Well worth the time!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "115355142930959326478", "name": "Dana Green", "time": 1579700715613, "rating": 5.0, "text": "There is no way I would have ever thought I'd make as huge a transformation as I did in three days of Nancy's Immersion Seminar. I learned so much about myself, vulnerability, listening, and appreciation. This was a total out-of-your-comfort-zone experience that I will never forget. I learned such great tools and strategies to further define and develop my leadership skills, confidence, and people skills. I can't thank Nancy and the Dale Carnegie team enough for the practical experience, tools, and patience. What a great time. I now have 20 new friends I never would have known, too.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106059571374377611919", "name": "Adam Campbell", "time": 1580312839410, "rating": 5.0, "text": "Great class with awesome content. It will certainly take you out of your comfort zone but will build confidence in speaking to a group as well as deepen your leadership skills.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "118051096626982420305", "name": "Sean Shea", "time": 1557770334013, "rating": 5.0, "text": "The High Impact Presentations course was a great experience for my personal and professional growth. I didn't realize how much fun I was going to have. Also, I really got to know the folks in the class while I was there. I highly recommend the team at Dale Carnegie in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "113253360010188875664", "name": "Josh Benton", "time": 1569436628658, "rating": 5.0, "text": "Nancy Covert did a wonderful job training us! It was a great class and I am thankful for all that Dale Carnegie had to offer. I learned so much and plan to work to use Dale Carnegie's principals daily.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "109649613777083227228", "name": "Jeremy Prickett", "time": 1549849161324, "rating": 5.0, "text": "I attended the Dale Carnegie Immersion Seminar in December 2018 and it was well worth it!  This is not your average seminar.  You will learn and grow if you're willing to invest your time and effort.  It was an excellent return on investment of 3 days for me.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "107591346255485881822", "name": "Immanuel Ramsey", "time": 1565297226452, "rating": 5.0, "text": "This is my second time taking this course.  It's very helpful and gives you many ways to becoming a better person at work and at home.  Nancy is awesome and keeps you motivated and laughing!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "112642268958405015129", "name": "Scott Copeland", "time": 1579709223871, "rating": 5.0, "text": "Nancy presented a great course and i am glad that I attended. She made training fun!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103868727538556481142", "name": "Family Account", "time": 1421941399394, "rating": 5.0, "text": "The Dale Carnegie course was a wonderful experience.  It helped me in the areas I needed work with most in building confidence and becoming more comfortable speaking to groups.  One on one chatting with classmates was also beneficial.  I could see my growth each week and Pam and Wells were amazing at giving me encouragement and helpful instructions.  I also met some great people in my class and we became a very close knit group.  We encouraged each other and built relationships.  Pam Wilkes did an amazing job of keeping us up beat and ready to learn with her energy and teaching style, and we couldn't have asked for a better coach than Wells Cooner.\n\nThis course was a great experience and well worth the time!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "113602912295684789064", "name": "Chad Moore", "time": 1575925627195, "rating": 5.0, "text": "The Immersion Seminar is a great way to expand your comfort zone while learning time-tested principles in dealing with other people.  Kudos to Nancy and the team in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "116831878062604482753", "name": "Jennifer Fowlkes", "time": 1434399124706, "rating": 5.0, "text": "Having recently completed the Dale Carnegie Presentation Effectiveness Course, led by Nancy Covert, I can definitively say my experience was a success!  The tools we were given and the instruction on details that can change your command of a room and the engagement of your audience during your presentation went above my expectation.  The confidence building we received both verbally and visually definitely changed my approach to presentations.  Thank you all for instilling in me a greater level of who I can be as a presenter/trainer.  I will remember to be \"memorable, knowledgeable and energetic!\"", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "114591780974390719445", "name": "Fran Allen", "time": 1494944747318, "rating": 5.0, "text": "This is a high energy  fast paced way of changing your views and demeanor in how you interact with co-workers in the work place. You learn the principles that guide you through any circumstance you may imagine to arise at work or in personal life and with practice through the class they become part of you.  Upon leaving you will have grown confident and armed with methods that you will easily ply with in your work and personnel environment.\n\nNancy Covert my instructor I was privileged to have was a delight of energy and empowerment for me and my class mates and I will say that she made this a most memorable experience.\n\nI recommend Dale Carnegie to everyone!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "105033367314757774153", "name": "Cody Brezinski", "time": 1523650073547, "rating": 5.0, "text": "I have completed two courses:  Skills for Success and Leadership Training for Managers.  Both courses are designed to make you evaluate yourself honestly and thoroughly, and this creates near-instant and significant results.  The skills learned in both will positively impact and improve your life personally and professionally for as long as you utilize them.  Nancy is an incredible coach and mentor, and this training is truly life-changing!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "110041064657581898558", "name": "Jeffery Jones", "time": 1573574078712, "rating": 5.0, "text": "Nancy, John and Robert did a great job running the training sessions.  Very informative and helpful!!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "104776460596962336584", "name": "Chris Ellsworth", "time": 1552321215362, "rating": 5.0, "text": "Excellent class! Nancy, John, and Robert were amazing, and coached me based on my individual needs. I will definitely be attending more Dale Carnegie training in the future.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106133522965233772857", "name": "Kaila Barrington", "time": 1493666233983, "rating": 5.0, "text": "High Impact Presentations through Dale Carnegie training in Birmingham can be described in one word: impactful. Having already been a strong presenter, I was wondering if I would see growth at the end of the course. I was challenged and was able to see the growth from day one to day two. The trainers, Nancy and Robert, and fellow participants created a safe space to learn and have fun.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111041717261230071108", "name": "Kelly King", "time": 1526995579546, "rating": 5.0, "text": "Hands down the best training course I've ever attended. Nancy, John and Robert are incredibly knowledgeable and talented at teaching presentation skills. They have taken my confidence and public speaking to a much higher level.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106346446105546651144", "name": "Johnny Davis", "time": 1431042461059, "rating": 5.0, "text": "Nancy is a great teacher and was always very energetic. She made the material very easy to understand and applicable to every day life. The class itself has really transformed my outlook on my career and has made me approach difficult situations with a different attitude. Thanks to Nancy and her team and I would definitely recommend to anyone looking to make some changes in life and work.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103181867606877797978", "name": "Collins Cunningham", "time": 1449495558765, "rating": 5.0, "text": "Dale Carnegie Sales Training is an excellent way to groom your sales skills to a completely new level. Nancy teaches you how to approach a sale, the process to close the sale, and everything that happens in between. She does a great job interacting with the class, and gets you to excel with your techniques and style. The techniques that are taught in this class are second to none. This class is extremely beneficial, and will not only make you more professional in sales, but more confident as well.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "115746969587444410021", "name": "Michelle Butler", "time": 1576850925653, "rating": 5.0, "text": "John, Nancy and Robert were great.  I really enjoyed the program!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "110981812306848769995", "name": "BJ Cowen", "time": 1575917197189, "rating": 5.0, "text": "Nancy was Great!  I just finished the Business Immersion Seminar and can't say enough great things about it.  Looking forward to other opportunities and future trainings.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103841867865544066555", "name": "SHERRI BROWN", "time": 1499089068316, "rating": 5.0, "text": "Wow!! What can I say??! I had no idea what I was getting into with joining this High Impact Presentations course! This experience exceeded every one of my expectations. I learned so many things, met some great people, and also some great instructors! I encourage everyone to be apart of this course! It will change your entire view on presenting, and your life!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101139781621529613813", "name": "J Cavin", "time": 1527261662688, "rating": 5.0, "text": "I thoroughly enjoyed the Dale Carnegie 8-week Skills for Success class hosted by Nancy.  She did a great job of keeping the class interesting and useful, and provided great practical examples of putting the techniques into practice.  I would highly recommend this class to anyone looking to develop or pollish skills related to interacting with other people, time and stress management, and public speaking.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103657151696359939446", "name": "Clint Gray", "time": 1554864163163, "rating": 5.0, "text": "This is some very good training. it will help you in all areas of  your life very good Teacher Nancy Covert  will make you feel right at home .", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106241287612049393354", "name": "Standard Heating", "time": 1521667650265, "rating": 5.0, "text": "Just finished the High Impact Presentations and it was awesome! Nancy and her team did a great job and we all learned a lot.  I highly recommend taking that class to improve speaking in front of a group and practicing your technique.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "102361991994983099652", "name": "Tony King", "time": 1527101024794, "rating": 5.0, "text": "Amazing!  A wonderful, challenging experience.   Nancy, John, and Robert worked so hard to make sure that my own personal presentations can be better.  A group environment that's amazingly individual.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "109998193141453907603", "name": "Monica Lang", "time": 1435696912817, "rating": 5.0, "text": "My team had such a wonderful experience with Nancy and her team! We had a small group in the presentations course and we all came out of the class with a ton of knowledge. If you're looking to boost your presentation skills when presenting internally or externally to clients, Dale Carnegie is the way to go.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106655651952345847191", "name": "Michael DiRenzo", "time": 1447093343052, "rating": 5.0, "text": "I have taken four Dale Carnegie Training courses with Nancy and her team in Birmingham/Huntsville.  The classes are interactive and present the opportunity to practice applying the skills..  The skills your learn in each of these courses can be applied immediately within work and life.   I highly recommend these classes to individuals who are looking to develop oneself both inside and outside of work.\n\n\"Take a chance!  All of life is a chance.  The man who goes farthest is generally the one who is willing to do and dare\" - Dale Carnegie", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "100372200634343794736", "name": "dan blackman", "time": 1523904645749, "rating": 5.0, "text": "Fantastic training course needed by all managers. Overall concept is providing you with a playbook to deal with people and the delivery by Pam Wilkes could not have been better. Very energetic and engaging.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "112527612420630116702", "name": "Davis Smith", "time": 1542639546496, "rating": 5.0, "text": "Worth every penny! Taking this course has helped change the way I look at business, public speaking, and stress management. Nancy Is FANTASTIC!!!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106889981134538251429", "name": "Stanley Parrish Jr.", "time": 1409799048607, "rating": 5.0, "text": "If you want to grow professionally and personally, You need the Dale Carnegie Training. It made me come out of my comfort zone and taught me how to talk and relate to people. You will also learn how to improve relationships and manage stress. Robert Daniel is a great trainer!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "117426162716357028874", "name": "John Taylor", "time": 1498952691403, "rating": 5.0, "text": "Nancy was our instructor and she was absolutely fantastic. Her instructional method was great and kept our group engaged throughout the entire series. The results of the training are already showing inside our company. I would highly recommend The Dale Carnegie series and more specifically, Nancy Covert!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "112112964541509839341", "name": "Jamie Broadhead", "time": 1497016876537, "rating": 5.0, "text": "I recently attended the High Impact Presentation training from Dale Carnegie, and was amazed at the growth I saw in myself over the training days! The trainers Nancy, John, & Robert were so great! Their coaching was spot on and breadth of knowledge and experience absolutely showed. I would strongly encourage anyone looking to develop and grow in this area to attend this training.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111681002867197483267", "name": "Jimy George", "time": 1492118137940, "rating": 5.0, "text": "The experience is worth the money! Nancy is great at presenting you with ideas and tools to enhance your leadership efforts - I thoroughly enjoyed the \"Leadership Training for Managers\" course I just completed and would highly recommend any one with (or aspiring to have) direct reports to take it... The other students in the class are the added bonus that contribute so many real life examples and experiences in crafting your own problem solving skills and leadership style. Don't think twice, sign up", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "102559413039601370280", "name": "Jodi Alcock", "time": 1462205299044, "rating": 5.0, "text": "I had the pleasure of taking the High Impact Presentations Course this past week.  To say I was apprehensive going in is an understatement.  I was nervous and self conscious!  By the end of the 2-Day training, I was a confident, enthusiastic, polished public speaker.  The change was miraculous.  I saw it in myself.  I watched the transformation in my classmates.  This course is IMPACTFUL!  My trainers, Nancy Covert and Robert Daniel, were tremendous.  Their feedback was spot on.  If you'd like to become a more impactful public speaker, I highly recommend taking High Impact Presentations.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "100451594438458856932", "name": "Janet Dozier", "time": 1396276425239, "rating": 5.0, "text": "The Dale Carnegie Course gives you an overview on how to deal with not only difficult people in the workplace -- it also shows you how to communicate and deal with any one you come in contact with every day.  The course also shows you how to deal with stress and worry.  The trainers provide a very engaging, hands-on course -- you are not just there having someone talk to you.   The course gives you an opportunity to get you out of your comfort zone. I wish I had taken this course several years ago when I was in a management position.  I believe any one from high school/college age to upper management / executive would benefit from this course because it touches on several different areas.  I also must add that Robert Daniel is an excellent trainer!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "109572785516974684902", "name": "Scott Hadaway", "time": 1568817155070, "rating": 5.0, "text": "Great people and great class. You will leave with some very useful tools for your professional and person life.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "116072454931875926896", "name": "Henry Gerard", "time": 1534956110612, "rating": 5.0, "text": "Excellent class!  The training provided by Nancy and her team is outstanding.  I highly recommend this class to anybody who desires to enhance their presentation skills.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "114871744616279754802", "name": "Ishmael Woodruff", "time": 1448411592511, "rating": 5.0, "text": "This was a great experience and I encourage everyone to take these classes. Nancy was a wonderful instructor. Her energy and positivity really helped me break out of my comfort zone. I thoroughly enjoyed the class.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101037193083139131191", "name": "TJ Pruitt", "time": 1451929129185, "rating": 5.0, "text": "High Impact Presentations course was hands down the best external training that I have ever taken. The facilitators have done a great job creating this program and it was highly effective.\n\nI highly recommend this location  for any training if you are looking to improve professionally. Well worth the money!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106318563429484454878", "name": "Lauren Albright", "time": 1447792157604, "rating": 5.0, "text": "What a great class!  Our instructor Nancy Covert is full of energy which makes it a very entertaining class.  You will learn leadership tools that can be applied to your personal or professional lives.  Highly recommend offering this class to your employees.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "104953683938174439270", "name": "George Mantis (G-Man)", "time": 1497570337494, "rating": 5.0, "text": "The High Impact Presentations course was excellent; probably the best ever provided by an employer.  I consider myself a skilled and experienced presenter and I still learned quite a bit. I appreciated the interactive nature of the course, and how much content was packed into so little time (two days, which flew by). Also, the instructors were friendly, very knowledgeable, and added to the enjoyment of the course.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "118243170975152381973", "name": "Anna Kathryn Gresham", "time": 1568838243641, "rating": 5.0, "text": "I was hesitant about the Dale Carnegie class at first but it was phenomenal. I learned a lot from the course coaches and the other members of the group and will be able to use the skills I learned to be a better leader and more effective communicator!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111206774597377848011", "name": "David Free", "time": 1523640617655, "rating": 5.0, "text": "I went through the Dale Carnegie Immersion Seminar.  I learned so much, but my biggest take away was to simply be myself!  Pam and Jessica were incredible!  Great training class!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "104361582326162532892", "name": "Kelli McCullough", "time": 1442343075530, "rating": 5.0, "text": "I had a great experience with the Highly Impactful Presentations course. I can't believe how much better prepared I feel for presentations after a two day course. I would recommend it to anyone looking to refine their presentation techniques. Nancy and Robert are great!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "107636767631687910167", "name": "Svtedge10", "time": 1396270574762, "rating": 5.0, "text": "Going into this program i didn't know what to expect. I entered with an open mind and a willingness to grow and learn. As I started the first class I quickly found out that this is a course to help yourself grow and become more aware of people's feelings and have an understanding of how to approach people. Every week I found myself growing and learning different techniques on how to deal with stress, anger, work habits and also on how to defuse a potential argument. I highly recommend this course because it opened up my eyes to the benefits of becoming a better person of society. I never seen myself being comfortable getting up in front of a group and talking but the techniques used makes it simple and easy to accomplish. So i leave you with this, If you are trying to become a better person and don't know where to start..........Here is your answer.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "112929528593984578710", "name": "Gary Freed", "time": 1343155978336, "rating": 5.0, "text": "Dale Carnegie Training, and specifically Nancy Covert of Dale Carnegie Training of Birmingham, changed the trajectory of my career as a CPA and management consultant. From the two courses I took, I learned and then polished my sales skills and obtained the knowledge to become a better manager. As a result of putting the Dale Carnegie approach into my business and personal life, I achieved my financial goals early and retired before the age of 55. I heartily recommend the Dale Carnegie Training program to anyone who is serious about making a change in their business and personal lives.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "107417257096819004757", "name": "Brent Fratesi", "time": 1491100229059, "rating": 5.0, "text": "I recently took the Dale Carnegie class. I would highly reccomend this class to anyone that wishes they could improve their human relations skills, regardless of occupation. Nancy was a fantastic instructor & also met a lot of great people during the classes.  If you are willing to put in the work, you will be pleased with the results.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "105073418352292822120", "name": "Melissa Wiggins", "time": 1526939013781, "rating": 5.0, "text": "Two words - Game Changer!!!! As an executive director, it's imperative that I give presentations with lasting impressions - thank you, Dale Carnegie, Hoover for making this a reality! So much respect and gratitude!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "114948202205009550230", "name": "Annslee Hillyer", "time": 1557250189676, "rating": 5.0, "text": "Nancy is the best of the best! I just finished my first Dale Carnegie immersion class and have already recommended it to multiple people.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "116379289732106799009", "name": "Chad Skelton", "time": 1443620276765, "rating": 5.0, "text": "I thoroughly enjoyed this class.  It taught all of us so much about stepping out of our comfort zone to learn new methods to leadership.  I feel like I personally struggled with self-confidence and learned about myself, that a lack of self-confidence and underestimating oneself, is not only a hindrance to oneself as a leader but also to the team as a whole.  I feel that this seminar opened our group up to learn more about each other, and to better understand each persons make up, making them who they are.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111755521433004626404", "name": "Cameron Mullens", "time": 1557330345648, "rating": 5.0, "text": "This was such a fun and interactive course! I was pushed out of my comfort zone and really learned a lot!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "104290438578596695823", "name": "Kenny Gunter", "time": 1493668220361, "rating": 5.0, "text": "Nancy and her team are incredible!! Amazing results in two days! Great group and no pressure atmosphere. They will push you beyond your own comfort zone to achieve phenomenal results! Would give them a higher rating if Possible!! They kilt it!! Little inside humor! Hope to work with them again in the future!! Take this class!! You will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "115403937972770285281", "name": "David Kirkland", "time": 1566835394237, "rating": 5.0, "text": "I recently attended the High Impact Presentation training. I was more than impressed with the quality of the trainers, the training itself and learned a great deal that I am sure will benefit myself and my company for years to come.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "113785756667334647236", "name": "Jeremy Blackburn", "time": 1408377950007, "rating": 5.0, "text": "Great program for professionals needing to master the art of presenting.  They will expand your normal comfort zone and give you guidance on how to present in a professional, competent manner.  I would recommend for an inexperienced presenter or an experienced presenter who simply wants to get better.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103921189487433229113", "name": "Ad Wa", "time": 1419094802689, "rating": 5.0, "text": "The Dale Carnegie Training courses are fantastic!! If you want to improve your public speaking, communication skills or build self confidence in becoming a successful more effective leader I highly recommend looking into one of the many courses they offer. I had the pleasure of having Nancy Covert as my instructor; Each of my fellow classmates had different goals they wanted to accomplish by taking the course, and throughout she guided each student towards their own personal goals of achievement. You will get what you put into the training, if your are opened minded, willing to learn, and able to step outside your comfort zone your results will be remarkable. I was able to take what we learned and studied each week and apply it to real life business interactions and situations; the results were astounding. Dale Carnegie is respected name in the business world, and graduating from one of the many training courses will give you the tools needed to grow yourself both professionally and personally. You will not regret taking one of the courses. Trust me, I don't!!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "107834286064564466463", "name": "Mark Burch", "time": 1533746598042, "rating": 5.0, "text": "The course was very hands on and engaging!!  I learned a lot of skills that we overlook on a daily basis as sales professionals.  Nancy, the instructor, is excellent at her job.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101083625889338104922", "name": "Sankar Renganathan", "time": 1416253310526, "rating": 4.0, "text": "I recently attended the Dale Carnegie training course on \"How to communicate with Diplomacy & Tact\" here in Birmingham. Good learning experience! Learned some new principles. Nancy and her team is very professional and nice to interact with. I would recommend this training to other businesses.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "108929543481357695641", "name": "French Forbes", "time": 1396912305412, "rating": 5.0, "text": "Nancy, Robert and John made for an excellent experience with the \"High Impact Presentation.\" I was somewhat apprehensive before jumping into this one but I have to say it met and exceeded my expectations. This is a must for anyone wanting to transform their career!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101469969021288439780", "name": "Brooke W", "time": 1427398454755, "rating": 5.0, "text": "Most courses purely instruct you on speaking but this course gets you up and let's you practice with real time feedback.  The speed of improvement was shocking.  Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106636457372421916195", "name": "JESSICA NICOLE REEL", "time": 1535571674278, "rating": 5.0, "text": "Nancy does an outstanding job in the Leadership Training for Managers Course. We send all of our Management through this program. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "114077518655654009936", "name": "Jay Swanner", "time": 1446818871657, "rating": 5.0, "text": "I got so much out of the High Impact Presentations course.  It provided me with real-time coaching that is going to serve me well going forward anytime I have to make a presentation.  I now feel much more comfortable in a variety of situations and its all thanks to all the wonderful people at Dale Carnegie Training Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103897285220105025554", "name": "PAULA TAYLOR", "time": 1390233072081, "rating": 5.0, "text": "EXCELLENT AND VERY EFFECTIVE TRAINING!!!  The training I received proved to be very valuable on the job, and it actually enhanced my speaking techniques at church.  I highly recommend this course for secular and christian speaking engagements/presentations.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "105379336047079096231", "name": "Chris Brasfield", "time": 1464104321775, "rating": 5.0, "text": "I would recommend the course to anyone.  If you will implement what you learn the course is priceless.  You can only come away a better person!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "115999392647526617243", "name": "Thomas Arnold", "time": 1396225998426, "rating": 5.0, "text": "This training was exceptionally. Mr. Robert Daniel is rated in the top 6 trainers in North America, and it certainly shows in his execution of the training. This was an experience I will remember and treasure for the rest of my life.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101826065171777722933", "name": "Terri Lee", "time": 1499457403774, "rating": 5.0, "text": "The test of any good training is results. I feel that I received results that will benefit not only my employer but also my family and myself.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111984430794062673573", "name": "James Bottom", "time": 1433160017438, "rating": 5.0, "text": "Total Life Change Experience!!!! The best instuctors I have ever had the Joy of Learning from. Step Up your life and your Profession Impact and Take a Class @ This location!!! I could write for days, but I will spare you the read. Just Do It!!!!!!!\n\nJames B.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "117388896662032434609", "name": "Di ketries", "time": 1448123935871, "rating": 5.0, "text": "Knowledge you apply every day in your personal and professional life and only makes you a better person/professional.\nYou see results from first session.  100% recommended!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106969898829667374816", "name": "Andy Bennett", "time": 1426540627217, "rating": 5.0, "text": "This Dale Carnegie training team is by far one of the best organizations I have worked with. I have had the pleasure of working with Nancy and her team multiple times. Each and every training I attended has been well organized and very relevant to my career. I have learned valuable tools and skills that have had a positive impact on my professional career as well as my relationships with coworkers and customers. I truly value the lessons learned and relationships built as a result of participating and working with Nancy's team.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "105614859178607661179", "name": "Barry McQueen", "time": 1478553512186, "rating": 5.0, "text": "Great experience. Trainer ( Nancy Covert), was very professional & made the class fun & enjoyable. Highly recommend this for all businesses.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "117498874385030044798", "name": "C Carey", "time": 1489415012970, "rating": 5.0, "text": "I had a great experience I was able to interact and meet employees from different locations. The methods of working together in groups was excellent and a great learning experience.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "103123542917650964785", "name": "Ryan Simons", "time": 1523485143608, "rating": 5.0, "text": "These courses will benefit anyone, truly a life changing experience.  Opens up your eyes and mind to a whole new world of opportunities.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111834090460145949790", "name": "Wells Cooner", "time": 1397064179178, "rating": 5.0, "text": "Have you ever been told that your presentations need some pop; or, that you are very monotoned when you speak? Do you get weak in the knees when you get up in front of people to speak?  If you take the Dale Carnegie High Impact Presentation training class taught by Nancy Covert and Robert Daniel, you will never have those problems again.  I recently attended their two day class and it was amazing.  During the class, Nancy and Robert helped me understand my strengths and challenges when giving presentations .  They then showed me ways to overcome my challenges.  With just in time coaching and one-on-one reviews of my presentations throughout the class, I learned to be a better presenter. Every member of the class went thru a transformation in their presentation skills. I would recommend this class hands down.  I don't think you will find a better class with such amazing results anywhere.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "108452313533777927529", "name": "Jennifer Jacobs", "time": 1393623946887, "rating": 5.0, "text": "I attended the training not knowing what to expect and graduated the Dale Carnegie Immersion Seminar wondering how I have made it 14 years in business without it.  It taught many different topics, including public speaking, concise messaging, human relations and dealing with stress.  There were also MANY, MANY principles that seem pretty common sense at first glance, but are actually really difficult to master.  I learned SO much in 3 short days and have already put a lot of what I learned into action, with positive feedback!  Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "102534019827547176080", "name": "DERAND JONES", "time": 1445545907628, "rating": 5.0, "text": "The training class was terrific. Very informative and thought provoking. It was a great opportunity to connect with my classmates.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "112086235343802576334", "name": "Tara Kay Roseberry", "time": 1470329143454, "rating": 5.0, "text": "Pam Wilkes was a great instructor.  Class was action packed and easy to follow.  Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "109525546703705952308", "name": "Hunter Davis", "time": 1491840929929, "rating": 5.0, "text": "This Program was a great way to not only see other employees, but to learn many great skills to apply in the work place. I really enjoyed the training and the instructor Nancy was a phenomenal teacher.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "105051986093321169959", "name": "Laura Skrzypinski", "time": 1497573383344, "rating": 4.0, "text": "This class was great! Not only were the instructors energetic, knowledgeable, and motivating but the class itself was fun. I learned so much!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "118183769624488310370", "name": "Amy Price", "time": 1432657769306, "rating": 5.0, "text": "The 3 Day Immersion Seminar was great! I learned principles I can use not only in business but in my personal life to better communicate with others.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111498241878758386025", "name": "David O", "time": 1431973402623, "rating": 5.0, "text": "I've taken two Dale Carengie courses, and both were great experiences.  I'd recommend them to anyone who wants to take their professional life to the next level.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "113954078187030507560", "name": "Vickie Garner", "time": 1478811643436, "rating": 5.0, "text": "I highly recommend any manager taking this course.  It is very informative and working with the groups helps improve your confidence.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "114053805839671163191", "name": "Candace Smith", "time": 1439821297938, "rating": 5.0, "text": "I had a great experience and received lots of feedback about how I can wow my audiences at work! Highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "106286483621451308662", "name": "Misty Reeves", "time": 1570809077643, "rating": 5.0, "text": "Not only did this class confirm things I already knew about myself but it also gave me the tools to recognize them and change those bad habits.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101440283586743081900", "name": "John Teta", "time": 1408591213525, "rating": 5.0, "text": "Excellent experience.  I highly recommend the course to anyone who wants to have more influence in their organization.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101343800818823286186", "name": "Chris Ratley", "time": 1407354505446, "rating": 5.0, "text": "Great atmosphere and great instructors.  Pam and Nancy were awesome.\n\nThanks again.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "101493429770700976173", "name": "Kameswara nara", "time": 1437273849115, "rating": 5.0, "text": "Excellent course and well taught!!!!\n\nKudos to Nancy for her innovative teaching methodologies. Thanks again Dale Carnegie.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "108381803309982428282", "name": "Tina Luker", "time": 1524682710018, "rating": 5.0, "text": "Great overall experience!  Met a lot of new people and we became very close through our interactions.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "108555235462029452526", "name": "George Brockman", "time": 1380018460744, "rating": 5.0, "text": "Great class and well executed by the professional trainer.  The material is terrific but its the delivery that multiplies the value", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "109234705663671305319", "name": "Kim Jacobs", "time": 1506942719450, "rating": 5.0, "text": "Enjoyed the way Nancy kept it fresh !!  I learned valuable skill sets. #madinstructorskills", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111454838187685659414", "name": "Clay Conner", "time": 1414686864354, "rating": 5.0, "text": "Dale Carnegie High Impact Presentations was both challenging and rewarding, I'm confident I'll be using lessons learned from this training in many future successes.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "102074096275054575209", "name": "tammy graham", "time": 1490633550046, "rating": 5.0, "text": "I recently completed the Dale Carnegie Communication Class and found the discussions, reading material and in-class exercises to be very helpful in discovering how to better handle situations at work, how to handle stress in general and how to face my fear of speaking to strangers.  Great class!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "113194153813483345971", "name": "Beth McCoun", "time": 1541617041385, "rating": 5.0, "text": "Excellent class, wonderful life principles, highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "102246862882854381128", "name": "Dan Stephens", "time": 1520881066565, "rating": 5.0, "text": "Nancy does a great job facilitating the process!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "104974058799209483517", "name": "Christopher D Thompson", "time": 1563970428780, "rating": 5.0, "text": "An amazing, if some times uncomfortable, experience.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "111898696222231535270", "name": "Emily Coe", "time": 1513032553146, "rating": 5.0, "text": "Very rewarding experience.", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "110874513619547290613", "name": "Jeff Loosier", "time": 1448205556657, "rating": 5.0, "text": "Great class great instructor!", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "112416098535898391981", "name": "Geoff Belcher", "time": 1541461265559, "rating": 5.0, "text": "1st class training", "pics": null, "resp": null, "gmap_id": "0x8889226a4d26324f:0x94a15275373be026"}
{"user_id": "118018654334462756140", "name": "Samantha Bullinger", "time": 1530121096842, "rating": 5.0, "text": "James is very knowledgeable and an excellent writer", "pics": null, "resp": null, "gmap_id": "0x88926c23d6eda1bf:0x8d1286bd0e70c091"}
{"user_id": "105826764256867057801", "name": "Kinsley Welch", "time": 1595189467286, "rating": 4.0, "text": "The place is usually immaculate, but probably due to Covid, it is becoming overgrown.", "pics": null, "resp": null, "gmap_id": "0x889bb2af24ade363:0xa60d365c04bbde79"}
{"user_id": "100555984916108741470", "name": "Eddie Greene", "time": 1601492751831, "rating": 5.0, "text": "Great place to work.", "pics": null, "resp": null, "gmap_id": "0x889bb2af24ade363:0xa60d365c04bbde79"}
{"user_id": "115844723611799281468", "name": "Brian Rodgers", "time": 1598379805550, "rating": 5.0, "text": "Great Place! Wonderful helpful folks!", "pics": null, "resp": null, "gmap_id": "0x8862841ff76171e1:0xa02be62790ba7730"}
{"user_id": "111269667391537825431", "name": "Roy Champion", "time": 1568128793421, "rating": 5.0, "text": "This place is great I did the business 101 class it made a huge difference in my business.", "pics": null, "resp": null, "gmap_id": "0x8862841ff76171e1:0xa02be62790ba7730"}
{"user_id": "101741848465377948864", "name": "Kelly Dutton", "time": 1538593069188, "rating": 5.0, "text": "I LoVe our Entrepreneurial Center! This is such an amazing place right here in the heart of Decatur, AL!  I have several friends who work for the ECenter and many who rent space for their personal business within the ECenter. This is the place for people to be Encouraged, Enthused and Empowered as Entrepreneurs. You will not regret taking the Business 101 Course as a small business owner, someone just getting started or even just wanting to learn the basics. Larry Waye, Director of Business Development and Education, is phenomenal. I highly recommend getting to know what all the Decatur-Morgan County Entrepreneurial Center has to offer.", "pics": null, "resp": null, "gmap_id": "0x8862841ff76171e1:0xa02be62790ba7730"}
{"user_id": "102583580895302657154", "name": "Ashley Billings", "time": 1476292591381, "rating": 4.0, "text": "Nice size for meetings.", "pics": null, "resp": null, "gmap_id": "0x8862841ff76171e1:0xa02be62790ba7730"}
{"user_id": "115444471372129589958", "name": "Dawn Cangelosi", "time": 1613426069265, "rating": 5.0, "text": "Very clean place, very nice people.   Super helpful if you need anything.", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "100551156799633855901", "name": "Skyler Carter", "time": 1610854933872, "rating": 5.0, "text": "Nice people. Offered to fix a mistake at no charge. Mistake was based on  my confusion however they contacted me via email before shipping to make sure we were on the same page. Now that’s service. You don’t see that anymore. I’ll get back after my installation.", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "107286316491670477422", "name": "Daniel Draffen", "time": 1608128749510, "rating": 5.0, "text": "One of the best places to work in the Tennessee Valley area!", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "114147583930210838429", "name": "Marshelle Lyons", "time": 1568859410058, "rating": 5.0, "text": "Because of the first time home buyers classes taught by Miss Loretta they are awesome and then the credit class they were 3 awesome classes with plenty of informative information that will help anyone who was wanting to buy a home and who was needing to increase their credit score.", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "104979668608951156955", "name": "Danny Turner", "time": 1558874169129, "rating": 5.0, "text": "I am the parking lot security guard during the morning/early afternoon. They treat me well.", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "103074115993115249230", "name": "Baller Jordan123", "time": 1563598291824, "rating": 5.0, "text": "Really cool place to visit", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "111687344743007239364", "name": "Helen Bunn", "time": 1552311046596, "rating": 2.0, "text": "Regarding my own personal experience as a security professional, please be mindful of fully ingrained and possessive personnel on RSA. The company itself supports the contract vs. the employee.", "pics": null, "resp": null, "gmap_id": "0x88626cea37639e9b:0x1e234b51c9ccc8b1"}
{"user_id": "106347299451349924707", "name": "Leon Edwards", "time": 1551545564341, "rating": 5.0, "text": "Great contact company to work for. Defense work contact support for local programs and Arsenal offices.", "pics": null, "resp": null, "gmap_id": "0x88626ebecd427547:0xe8506e05e3d4c8c9"}
{"user_id": "101017738387242438890", "name": "Brian Moore (Armyballer)", "time": 1535138593970, "rating": 5.0, "text": "Great place to have a company office meeting if a large conf room is needed.   Seats at least 150 folks and they always have great refreshments.", "pics": null, "resp": null, "gmap_id": "0x88626ebecd427547:0xe8506e05e3d4c8c9"}
{"user_id": "104640174176815515749", "name": "John Andrews", "time": 1547747783084, "rating": 5.0, "text": "nice small business, good service, good facilities", "pics": null, "resp": null, "gmap_id": "0x88626ebecd427547:0xe8506e05e3d4c8c9"}
{"user_id": "105734037768932705438", "name": "Rita Turner", "time": 1533749884508, "rating": 4.0, "text": "Great place to work and have meetings.", "pics": null, "resp": null, "gmap_id": "0x88626ebecd427547:0xe8506e05e3d4c8c9"}
{"user_id": "113311719726002515422", "name": "Kelly Joiner", "time": 1521570894732, "rating": 5.0, "text": "Great place to work!", "pics": null, "resp": null, "gmap_id": "0x88626ebecd427547:0xe8506e05e3d4c8c9"}
{"user_id": "107364717867735427538", "name": "Derrick Mcbride", "time": 1611432925827, "rating": 5.0, "text": "5 Star s rated outstanding Google maps online business and Google maps and Google photos and Google media and Google photos Shared Listed Nationwide Worldwide 💯 in Google News for I am. Listed Nationwide Worldwide 💯 True Story Rank 1 st in America", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "117591677003918640608", "name": "Qwazy Symbiote", "time": 1609219307538, "rating": 2.0, "text": "It is a good way to share experiences and help give people an idea of wether or not they want to visit or  use a particular business or place. However their ratings system does not really work and is actually quite inaccurate even misleading based on many of the reviews.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "110286946582232714070", "name": "Lawrence Krug", "time": 1608676994064, "rating": 1.0, "text": "Sadly, Google Maps is toying with their reviews of restaurants. As a result, the ratings are corrupt and useless. Every place has four stars - unlikely.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "106844670401626728329", "name": "Lil Joe", "time": 1601672958631, "rating": 1.0, "text": "Latey Google maps has been taking me out of the way and not just a little bit out of my way but miles out of my way in the town of Weatherford Texas I am a delivery driver so this is an inconvenience.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "113520115723468203754", "name": "Carl Knuckles", "time": 1592331961166, "rating": 3.0, "text": "I use this app all the time and I like its updates but sometimes it freezes or just completely stops working and for the most part it finds the destination but a trucker edition or add on would be a much greater value. I can’t take every shortcut or every road through a business area. Thanks in advance", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "104766954244886264040", "name": "Robert Bentley Motors Inc.", "time": 1519901303550, "rating": 5.0, "text": "We used YP for 10 years and paid $7500 a year. Jangles offered their services which was several additional services for over half price. We gave them a shot and are very satisfied & are happy to recommend Jangles .\nJangles designed my business Digital & Print Business Cards. Designed a Custom Logo. Built Us A Website as well established us on over 5 of the mist popular Social Media Sites. They also added our business on all the search engines so that when potential customers search for our business field we pull up as 1 of the 1st you see. Our Business Base increased 2 fold.", "pics": null, "resp": {"time": 1519912620651, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "109401182227832868027", "name": "Elite Contruction", "time": 1519901541281, "rating": 5.0, "text": "Great Service. Set our Business Up With The Right Plan 6 Months Ago Because Our Customer Base has Tripled..Thanks Jangles😀!", "pics": null, "resp": {"time": 1519912614207, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103242430163154685411", "name": "AIDEN STEELE", "time": 1597851939554, "rating": 5.0, "text": "I \"search(ed) google maps\".", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "105494166040366244057", "name": "Jenn Kessler", "time": 1519901670088, "rating": 5.0, "text": "Great Advertising Business ! really helped our business!", "pics": null, "resp": {"time": 1519912607477, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "101687853376771324341", "name": "King Washington", "time": 1582413599721, "rating": 5.0, "text": "I love the experience!", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "109111478111229768649", "name": "Christy Moore", "time": 1625206851145, "rating": 5.0, "text": "Advertising", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103551636969995835381", "name": "Arthur Coleman", "time": 1565356435119, "rating": 5.0, "text": "Great customer service 👍", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "100235552833826430929", "name": "Melanie Brumfield", "time": 1518495727747, "rating": 5.0, "text": "Great Advertising Biz!", "pics": null, "resp": {"time": 1518495888487, "text": "Thank You For Your Feedback."}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "115735826387409390323", "name": "National Championship Photography", "time": 1536547624283, "rating": 5.0, "text": "👍👍", "pics": null, "resp": {"time": 1537469942857, "text": "Thank You For Your Feedback."}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "101697680773448469621", "name": "El Erby", "time": 1624499411336, "rating": 5.0, "text": "Informative meeting", "pics": null, "resp": null, "gmap_id": "0x888e816ef0803c1d:0x33bf87c7345ff111"}
{"user_id": "111724864696762019427", "name": "Carl Jernigan", "time": 1581169736769, "rating": 5.0, "text": "Neat and clean!", "pics": null, "resp": null, "gmap_id": "0x888e816ef0803c1d:0x33bf87c7345ff111"}
{"user_id": "115105152264847189150", "name": "xXHazey DayzXx", "time": 1625341756995, "rating": 3.0, "text": "I work next door to them and I just wanna know why they be lining the trailers up on the road at night", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "108125349282931549518", "name": "Roderick Pettway", "time": 1612836816366, "rating": 5.0, "text": "I wasn't there I was at educational student drives next door. 😆", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "100617569699951753017", "name": "Percy Cox", "time": 1623153618703, "rating": 4.0, "text": "Great services", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "113739274813249758254", "name": "Kemberly Kelley", "time": 1599761423916, "rating": 5.0, "text": "Good staff", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "108205389441697590064", "name": "Marvin Pitts", "time": 1596039742564, "rating": 4.0, "text": "Could use a bigger yard!", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "107444618266340945874", "name": "Jeffery Boyer", "time": 1559465798258, "rating": 3.0, "text": "Work near there.", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "114347874627369076690", "name": "Vernon Hines", "time": 1561399235049, "rating": 5.0, "text": "Job", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "114454944142670814805", "name": "Earl Adams", "time": 1535743365600, "rating": 3.0, "text": "They lost my package and I had to return a see days later to pick it up.", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "116819619362937320712", "name": "scott ward", "time": 1472021620694, "rating": 5.0, "text": "Always in and out quick", "pics": null, "resp": null, "gmap_id": "0x889a4bab328f89a3:0x53b75929ba184908"}
{"user_id": "100953464999891370121", "name": "David Gibson", "time": 1611241065031, "rating": 5.0, "text": "Super smart group of people.  Excellent work ethic and commitment to their customers.", "pics": null, "resp": null, "gmap_id": "0x88891bd0096a42d1:0x98f3e8574d50cccc"}
{"user_id": "110999969810066144131", "name": "Kyle McKinley", "time": 1575919898215, "rating": 5.0, "text": "My company has been fortunate enough to work with Fast Slow Motion on several occasions and they've been nothing but excellent. They take time to understand each situation and provide the best solution possible. I highly recommend their services to anyone needing Salesforce assistance.", "pics": null, "resp": null, "gmap_id": "0x88891bd0096a42d1:0x98f3e8574d50cccc"}
{"user_id": "104122743274703043189", "name": "Ronnie Butler", "time": 1535870006713, "rating": 5.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x88891bd0096a42d1:0x98f3e8574d50cccc"}
{"user_id": "103350191571697816316", "name": "David Santos", "time": 1615504247003, "rating": 5.0, "text": "What can I say, well to start with, I was not ready for the change to a New Company because I have been with Xerox for over 25 + Years. I have always been treated very well from them so, NO I did not want to change. After a while of thinking about it SEVERAL MONTHS and my Son hammering me with the RJ YOUNG name, I did it. I purchased a machine from RJ YOUNG.\nAt first I was skeptical and to be honest I really didn't want to give it a chance (The Machine), but I did and after several months and barely using the machine I starting coming more around it and using it a little more & more. Then I began to really like it because it really printed so nice and pretty fast. It only took me  8 to 10 months to like it but you have to understand I WAS A XEROX Man and I thought there was NOTHING out there but Xerox. The Xerox machine has ALWAYS  performed outstanding and the SERVICE was the best, I was spoiled from that. However, I found out that there was more out there than XEROX! I found out that RJ YOUNG was REAL and believe me they have made a believer out of me. The Service that I thought would not compare to XEROX, has showed me they are just as good and if not BETTER. I never thought I would say that but it is so true. I can not believe how fast the Service Technicians reply to the service calls. They are always polite, and get me back up and running in a very quickly manner. They have such good personalities and a smile! As for the Ladies at the Home Office, Oh My How can you NOT like them. They are AMAZING. They always tell me they will have my supplies on the way or a Technician asap. IT IS JUST SO HARD TO PUT IN WORDS what RJ Young has done for my business. This is a very caring company and to be honest I am so glad that I have some of their product and that I was introduced to the World outside of XEROX. RICO machines have made my life SO MUCH Better and I am so happy that I have changed. If you are not a part of RJ YOUNG, you are probably missing out on good PEOPLE and Great Machines.\nDavid Santos,\nSantos Printing Co.", "pics": null, "resp": {"time": 1615567331024, "text": "Thank you so much for your feedback, David! We truly appreciate it."}, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "107060019385402490294", "name": "SBNABN Nelson", "time": 1596815182481, "rating": 5.0, "text": "RJ Young was very helpful! They were very knowledgeable and worked quick to help deliver and service our devices! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104972628291985606322", "name": "Tom Sommerville", "time": 1596541843874, "rating": 5.0, "text": "Great Company, top quality products, service and support. More that a Copier Company, They sell Technology, gear. and the Latest Security Camera;s Printers from desktop to Print Shop.\nAV installations, Managed Print and Network Services. Full line of PPE.", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "111391196337052808128", "name": "Chris Smith", "time": 1578669178257, "rating": 5.0, "text": "Great place with great people!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104420937470922492672", "name": "Sarah Kuykendall", "time": 1537234260415, "rating": 5.0, "text": "Best place to buy a printer and the service is amazing!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104122743274703043189", "name": "Ronnie Butler", "time": 1537250043970, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "103807881521583055200", "name": "Amanda Larson", "time": 1508098824051, "rating": 5.0, "text": "Great place !", "pics": null, "resp": null, "gmap_id": "0x888916615e2106c3:0xf53c2424bb81b880"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1577985922560, "rating": 5.0, "text": "Its nice to have a advertising partner that helpful, knowledgeable and provides quality work.", "pics": null, "resp": null, "gmap_id": "0x888923b58aefc3f9:0x681b7ea9055cee17"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1549510162548, "rating": 5.0, "text": "Helping out", "pics": null, "resp": null, "gmap_id": "0x888923b58aefc3f9:0x681b7ea9055cee17"}
{"user_id": "113526768067311606514", "name": "David Williamson", "time": 1602593832493, "rating": 1.0, "text": "Way over priced for the service they provided.  Suppose to help write contract but don't do nothing realy.", "pics": null, "resp": null, "gmap_id": "0x88626944825730bb:0x78ac24e1f61cd6f6"}
{"user_id": "115508867016190110542", "name": "Leigh Christian", "time": 1518278485905, "rating": 5.0, "text": "Bid Designs is an amazing group of talented professionals that make the government contracting world seem easy.  They are organized, dependable, creative and innovative, and always help you submit a compliant and most often WINNING proposal.  Their staff is easy to work with and are truly experts in each of their respective areas.  I love the integrity and ethics of Bid Designs and it is truly set forth by its founder and CEO Brent Paris. They support the community in numerous ways and I appreciate their devotion to small businesses. I love working with them and recommend them with the highest recommendation!", "pics": null, "resp": null, "gmap_id": "0x88626944825730bb:0x78ac24e1f61cd6f6"}
{"user_id": "100785997841923158869", "name": "Paul Bull", "time": 1534279852245, "rating": 5.0, "text": "Worked with them as a vendor as well as my company utilizing them in the past on a joint effort, amazingly talented staff, wonderful personalities, and some of the hardest workers I've seen.  Recommend them to all and believe they are a perfect fit for any company.", "pics": null, "resp": null, "gmap_id": "0x88626944825730bb:0x78ac24e1f61cd6f6"}
{"user_id": "116679822786399874364", "name": "ROD’s Random Reviews #DUKE", "time": 1517628316234, "rating": 5.0, "text": "Great company!!", "pics": null, "resp": null, "gmap_id": "0x88626944825730bb:0x78ac24e1f61cd6f6"}
{"user_id": "116980063646314267174", "name": "Jason Helton", "time": 1520309278748, "rating": 5.0, "text": "Excellent service and value. Big coffee people.", "pics": null, "resp": null, "gmap_id": "0x886242a78a0e6a5d:0xdcec489d0432a3cb"}
{"user_id": "102939784217058979984", "name": "John Mark “Mark” Hester", "time": 1502818899438, "rating": 5.0, "text": "This is not a business", "pics": null, "resp": null, "gmap_id": "0x886242a78a0e6a5d:0xdcec489d0432a3cb"}
{"user_id": "111733011235887161347", "name": "Arlando Marsh", "time": 1568082358997, "rating": 5.0, "text": "One of the best jobs I have performed. It grew me as an individual and help further my sales experience as well as knowledge. Jacori was so helpful in making sure I learned the business and ropes. He was always available and wants all of his employees to grow equally.", "pics": null, "resp": null, "gmap_id": "0x889292425b7901a5:0x7af3c8c21504e44f"}
{"user_id": "115190335243293446046", "name": "Nino brown", "time": 1567526219036, "rating": 5.0, "text": "Jacori is an awesome man first of all , this job is very fun and very business job , you get to dress up and look good everyday and make sales ! This job is a career , you control your destiny here . I can’t wait to see where I’ll be in a couple months here at this job !!!", "pics": null, "resp": null, "gmap_id": "0x889292425b7901a5:0x7af3c8c21504e44f"}
{"user_id": "116034933543279482406", "name": "Megan Pitts", "time": 1572016015881, "rating": 5.0, "text": "Very business oriented and professional. They allow people the opportunity to become a successful business owner or business partner.", "pics": null, "resp": null, "gmap_id": "0x889292425b7901a5:0x7af3c8c21504e44f"}
{"user_id": "115273062779998303421", "name": "Tykia", "time": 1567095564620, "rating": 1.0, "text": "I don’t even want to give the one star. He’s horrible! Also, he’s a liar and I would never do business with him again. Jacori is a disgrace! I feel bad for his employees.", "pics": null, "resp": null, "gmap_id": "0x889292425b7901a5:0x7af3c8c21504e44f"}
{"user_id": "102690310281700293729", "name": "Quintrell Anderson", "time": 1553886238954, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x889292425b7901a5:0x7af3c8c21504e44f"}
{"user_id": "105146497269145785989", "name": "Godfrey Vaughn", "time": 1606589683626, "rating": 5.0, "text": "Shaw Technology has been a great partner when it come to our Internet solution.  We have a 17,000 square foot building and we have used the proposed solution for about 3 years now.  I would recommend Shaw Tech for any commercial solution.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "100621269578363798278", "name": "Health Star", "time": 1596629160792, "rating": 5.0, "text": "Been doing business with the Brad Shaw and his team for years. Awesome people who are 100% committed to their clients.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "117302602031996986661", "name": "Kat Travis", "time": 1594216552148, "rating": 5.0, "text": "Best IT company hands down!! Channing Allen is very knowledgeable and patient.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "113246321056613466121", "name": "Tonya Locke", "time": 1562869559306, "rating": 5.0, "text": "Very helpful and an absolutely loveable staff. They have gotten us out of some pretty substantial situations and even some very minuscule situations. I would recommend 100 times.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "117182298530662596043", "name": "Ann Marie", "time": 1557334605411, "rating": 1.0, "text": "Terrible company. Management of this company aren’t good people they’re just money hungry and selfish. I’d give 0 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "109402575936866019377", "name": "Austin Lowman", "time": 1562869638495, "rating": 5.0, "text": "Staff are hard working and responsible. Fair prices for great service.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "104801217029580070430", "name": "Gale Masters", "time": 1435265988171, "rating": 5.0, "text": "Everyone at Wilson Shaw IT is very professional, and they are by far the best technology firm in Alabama. I would never work with another company again. Check them out if you ever need those types of services. They are all a real pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "105151040942013092136", "name": "Ryan Moore", "time": 1559653169959, "rating": 5.0, "text": "Very good people fast response love the staff", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "110350741286136686233", "name": "Scooter Leonard", "time": 1450405589481, "rating": 5.0, "text": "Wilson Shaw understands the current needs of its customers and is proactive in helping them reach their technology goals. They are excellent at evaluating your current systems and offering options for enhancements and improvement. They are focus on increasing our productivity and reducing our costs. I would highly recommend them to do the same for your company.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "104423773960235981332", "name": "Kyle Houghton", "time": 1439475061992, "rating": 5.0, "text": "I would highly recommend Wilson Shaw IT. They were able to help me out when I needed them.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "104375803916668101288", "name": "steve pauley", "time": 1504049860152, "rating": 1.0, "text": "Not very good at install or customer service. When they installed our Internet Eq they forgot to run the cable from the Eq  to the outside of the house to meet the cable company. Turned in to a mess to gert it run in and looks terrible. Also they wont come back to maintain the Eq after numerous phone calls. NOT RECOMMENDED for RESIDENTIAL service.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "111708904232464567394", "name": "Joel Miller", "time": 1453323766932, "rating": 5.0, "text": "The staff members from Wilson Shaw IT are fantastic and their follow through is even better. They took their time to explain everything to me and followed up the next week to make sure everything was still working well for us.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "102100310405850145287", "name": "Margaret Peters", "time": 1443617456071, "rating": 5.0, "text": "I have used services from Wilson Shaw IT for ten years. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "101653080087434584979", "name": "Teresa", "time": 1562169978923, "rating": 1.0, "text": "Brand new server. Up and down, up and down. Technicians are useless.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "108480587395293393681", "name": "Lawrence Daniel", "time": 1529586674430, "rating": 5.0, "text": "Great MSP.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "114691210921890979715", "name": "Vicky Lee", "time": 1515756860161, "rating": 5.0, "text": "Outstanding", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
