{"user_id": "107350048044747569717", "name": "Laura Morello", "time": 1627583048915, "rating": 5.0, "text": "If you are a business owner this is the best place to be and go.\nGreat way to show your business around", "pics": null, "resp": null, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "117214346142957208826", "name": "MARIA EUGENIA LUCIANI", "time": 1624841911153, "rating": 5.0, "text": "The best networking that you can find in United States.  The best people. Amazing.", "pics": null, "resp": null, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "106351876093377895142", "name": "Ramón Castro", "time": 1624761535871, "rating": 5.0, "text": "Let’s make bussines in a different way.", "pics": null, "resp": null, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "107136516999365510998", "name": "Daniela Kosan", "time": 1624762197097, "rating": 5.0, "text": "Let’s Connect Show is the BEST Networking Event occurring in Houston, Miami and Orlando! You make connections, leads, and friends! Become part of this online and offline experience visiting @letsconnectshow!!", "pics": null, "resp": null, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "104423702408487975275", "name": "Eduardo Meinhardt", "time": 1624835490108, "rating": 5.0, "text": "(Translated by Google) Participating in Let's Connect Show has been an incredible experience. The ability to meet new people and establish effective business alliances is invaluable for every entrepreneur. Thanks to Ramón and Daniela for making it possible!\n\n(Original)\nParticipar en Let's Connect Show ha sido una experiencia increíble. La posibilidad de conocer gente nueva y establecer alianzas de negocios efectivas es invaluable para todo empresario. Gracias a Ramón y Daniela por hacerlo posible!", "pics": null, "resp": null, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "102003080604353546037", "name": "merlis rojas", "time": 1624830374570, "rating": 5.0, "text": "(Translated by Google) The best experience having worked with you, is a networking full of positive energy, hardworking people, passionate entrepreneurs with their entrepreneurship, Daniela and Ramón super professionals, the whole team, the show is the best, going to let's connect is an experience that we must live again and again 🌹🌷\n\n(Original)\nLa mejor experiencia haber trabajado con ustedes, es un networking lleno de energía positiva, gente trabajadora, emprendedores apasionados con su emprendimiento, Daniela y Ramón súper profesionales, todo el equipo, el show son lo mejor, ir a let’s connect es una experiencia que debemos vivir una y otra vez 🌹🌷", "pics": null, "resp": {"time": 1628785903504, "text": "Merlis gracias por tu comentario. Con gusto te esperamos en nuestros eventos de Networking. Gracias nuevamente"}, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "104511732001229320284", "name": "Carla Bermudez", "time": 1624830104532, "rating": 5.0, "text": "(Translated by Google) I have been a participant in this Networking since Dec 2020… but I have known Ramon Castro since its inception… and I have seen him grow and help many ventures, I am happy to be one of Let’s Connect…. And together with Daniela… they make the dynamic duo !!!!!\n\n(Original)\nSoy participante de este Networking desde Dic 2020… pero conozco a Ramon Castro desde sus inicios … y Lo he visto crecer y ayudar a muchos emprendimientos, estoy feliz de ser uno más de Let’s Connect…. Y junto a Daniela… hacen el dúo dinámico!!!!!", "pics": null, "resp": {"time": 1628785871292, "text": "Gracias Carla por el valioso apoyo! jaja sí, nos han dicho que somos el dúo dinámico. Un gran abrazo"}, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "111949451448238322281", "name": "Gertrudis del Carmen Borjas Acosta", "time": 1624829931086, "rating": 5.0, "text": "(Translated by Google) Good afternoon. @Ramon Castro @Daniela Kosan my loves, Yesterday happened to be unprecedented Networking, Congratulations, that magic that you transmit as a team, the quality of the show, the pleasant atmosphere, every day I fall in love more, I simply feel that the moment is blessed, happy to be in this team and I ask God to continue helping and guiding us so that we all continue together in this growth. CONGRATULATIONS EXCELLENT SHOW. May God allow us to continue growing together. Thank you very much for being part of our history. Blessed day. (BY CULTURE BREAD HAUS)\n\n(Original)\nBuenas tardes. @⁨Ramon Castro⁩  @⁨Daniela Kosan⁩  mis amores,  El dia de ayer paso a ser Networking sin precedentes, Felicidades,  esa magia que trasmiten ustedes como equipo, la calidad del show,  el ambiente tan agradable, cada dia me enamoro mas, sencillamente siento que el momento es  bendecido, Feliz de estar en este equipo y pido a Dios nos sjga ayudando y guiando para que sigamos todos juntos en este crecimiento. FELICIDADES EXCELENTE SHOW. Que Dios nos permita continuar juntos creciendo. Muchas gracias por formar parte de nuestra historia. Bendecido dia. (BY CULTURE BREAD HAUS)", "pics": null, "resp": {"time": 1628785836741, "text": "Hola Gertrudis Muchísimas gracias por tu comentario. Somos afortunados de contar contigo"}, "gmap_id": "0x8641211674f876eb:0xc82146614b2d86ac"}
{"user_id": "105188784171790256933", "name": "becca mahoney", "time": 1613922592101, "rating": 1.0, "text": "Never received a call back", "pics": null, "resp": null, "gmap_id": "0x888c46e8f0557871:0xd641f59ea8f42b1"}
{"user_id": "108211738781939546016", "name": "Ezekiel Worst", "time": 1592623880171, "rating": 5.0, "text": "Shout out to these guys! They’re very knowledgeable and are always willing to help me with any issue I come across. And, if they don’t know the answer, they can easily find out and get back with you quickly. I’d definitely recommend their services!", "pics": null, "resp": null, "gmap_id": "0x888c46e8f0557871:0xd641f59ea8f42b1"}
{"user_id": "110300241282993675816", "name": "Tommy Lawrence", "time": 1474919134766, "rating": 5.0, "text": "Excellent, professional, and fast service! Knowledgeable, friendly, courteous, and helpful staff! Lowest prices of all their competitors. Services include cell phone and tablet repair (including screen replacement), PC and MAC repair, data recovery and migration, Website design, graphic design, printing and binding,, networking, phone and security systems, and photo restoration. Great location; in the Historic District in downtown Tallassee.", "pics": null, "resp": null, "gmap_id": "0x888c46e8f0557871:0xd641f59ea8f42b1"}
{"user_id": "112160728932164480160", "name": "Jamie Rathbone", "time": 1502054049370, "rating": 5.0, "text": "Great place for a repair. Super freindly service. Very professional and personal.", "pics": null, "resp": null, "gmap_id": "0x888c46e8f0557871:0xd641f59ea8f42b1"}
{"user_id": "105253834227455901062", "name": "Jacob Mullins", "time": 1609905096601, "rating": 1.0, "text": "Moved into an apartment that forces us to use this provider. Wifi signal is janky at best, we're not getting the speeds we're paying for, and our internet goes out almost every hour. The most I got out of their office was \"we'll send someone out when we can\"\nNo time frame or anything. We have jobs so we can't plan to be home whenever you feel like showing up.\nI'd rather use a company I know but this stupid apartment complex forced this one on us and it's been a nightmare so far", "pics": null, "resp": {"time": 1609947575989, "text": "Hey Jacob, we are sad to hear about your negative experience. If you haven't done so already, please send us an email with your contact information and details about the problem to support@wavefly.com.  We will be sure to respond promptly and begin working towards a resolution. We understand connection issues can be frustrating to go through and deal with.\n\nWe look forward to the opportunity to resolve this for you."}, "gmap_id": "0x889a417966626f27:0x3bf3c98c026fe94b"}
{"user_id": "108966673714946735770", "name": "Joshua Holmes", "time": 1597515799790, "rating": 5.0, "text": "This group knows their stuff, simple as that.  Amazing support, rapid response and service has been fantastic.  Everyone is very friendly and oddly enough in this day and age, actually do what they say they will do.", "pics": null, "resp": null, "gmap_id": "0x889a417966626f27:0x3bf3c98c026fe94b"}
{"user_id": "111891251842921399330", "name": "Charles Wheeler", "time": 1619730496094, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x889a417966626f27:0x3bf3c98c026fe94b"}
{"user_id": "109561471823013824819", "name": "Blake Svoboda", "time": 1502474112140, "rating": 5.0, "text": "Great group of professionals that treat their clients like family.", "pics": null, "resp": null, "gmap_id": "0x889a417966626f27:0x3bf3c98c026fe94b"}
{"user_id": "105101721443551281223", "name": "Ashley Dortch", "time": 1576714166149, "rating": 5.0, "text": "Good helpful people", "pics": null, "resp": null, "gmap_id": "0x889a417966626f27:0x3bf3c98c026fe94b"}
{"user_id": "111701860438436778563", "name": "michael raffield (Mike)", "time": 1517496357803, "rating": 1.0, "text": "This company made a deal with me and we agreed to get an enclosed trailer I was suppose to buy as soon as they had the title the next day and  the next day I asked if it was still going to happen they said yes and then when I was suppose to get it they said they changed there mind not good business ppl at all don't recommend them to anyone", "pics": null, "resp": {"time": 1552486073258, "text": "Hi Michael, we are not in the trailer business, so I am not sure how you can judge our entire company and all the great people who work here based on some deal our executive team is not even aware of."}, "gmap_id": "0x889a417966626f27:0x3bf3c98c026fe94b"}
{"user_id": "107364717867735427538", "name": "Derrick Mcbride", "time": 1611432925827, "rating": 5.0, "text": "5 Star s rated outstanding Google maps online business and Google maps and Google photos and Google media and Google photos Shared Listed Nationwide Worldwide 💯 in Google News for I am. Listed Nationwide Worldwide 💯 True Story Rank 1 st in America", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "117591677003918640608", "name": "Qwazy Symbiote", "time": 1609219307538, "rating": 2.0, "text": "It is a good way to share experiences and help give people an idea of wether or not they want to visit or  use a particular business or place. However their ratings system does not really work and is actually quite inaccurate even misleading based on many of the reviews.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "110286946582232714070", "name": "Lawrence Krug", "time": 1608676994064, "rating": 1.0, "text": "Sadly, Google Maps is toying with their reviews of restaurants. As a result, the ratings are corrupt and useless. Every place has four stars - unlikely.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "106844670401626728329", "name": "Lil Joe", "time": 1601672958631, "rating": 1.0, "text": "Latey Google maps has been taking me out of the way and not just a little bit out of my way but miles out of my way in the town of Weatherford Texas I am a delivery driver so this is an inconvenience.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "113520115723468203754", "name": "Carl Knuckles", "time": 1592331961166, "rating": 3.0, "text": "I use this app all the time and I like its updates but sometimes it freezes or just completely stops working and for the most part it finds the destination but a trucker edition or add on would be a much greater value. I can’t take every shortcut or every road through a business area. Thanks in advance", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "104766954244886264040", "name": "Robert Bentley Motors Inc.", "time": 1519901303550, "rating": 5.0, "text": "We used YP for 10 years and paid $7500 a year. Jangles offered their services which was several additional services for over half price. We gave them a shot and are very satisfied & are happy to recommend Jangles .\nJangles designed my business Digital & Print Business Cards. Designed a Custom Logo. Built Us A Website as well established us on over 5 of the mist popular Social Media Sites. They also added our business on all the search engines so that when potential customers search for our business field we pull up as 1 of the 1st you see. Our Business Base increased 2 fold.", "pics": null, "resp": {"time": 1519912620651, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "109401182227832868027", "name": "Elite Contruction", "time": 1519901541281, "rating": 5.0, "text": "Great Service. Set our Business Up With The Right Plan 6 Months Ago Because Our Customer Base has Tripled..Thanks Jangles😀!", "pics": null, "resp": {"time": 1519912614207, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103242430163154685411", "name": "AIDEN STEELE", "time": 1597851939554, "rating": 5.0, "text": "I \"search(ed) google maps\".", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "105494166040366244057", "name": "Jenn Kessler", "time": 1519901670088, "rating": 5.0, "text": "Great Advertising Business ! really helped our business!", "pics": null, "resp": {"time": 1519912607477, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "101687853376771324341", "name": "King Washington", "time": 1582413599721, "rating": 5.0, "text": "I love the experience!", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "109111478111229768649", "name": "Christy Moore", "time": 1625206851145, "rating": 5.0, "text": "Advertising", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103551636969995835381", "name": "Arthur Coleman", "time": 1565356435119, "rating": 5.0, "text": "Great customer service 👍", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "100235552833826430929", "name": "Melanie Brumfield", "time": 1518495727747, "rating": 5.0, "text": "Great Advertising Biz!", "pics": null, "resp": {"time": 1518495888487, "text": "Thank You For Your Feedback."}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "115735826387409390323", "name": "National Championship Photography", "time": 1536547624283, "rating": 5.0, "text": "👍👍", "pics": null, "resp": {"time": 1537469942857, "text": "Thank You For Your Feedback."}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103626821680274237415", "name": "Tim Eum", "time": 1618425573779, "rating": 4.0, "text": "ProTek repaired my laptop completely in just one day and was even able to retrieve my old data. The laptop even worked faster after the fix and they were very friendly. They do charge for their professionalism as it cost $300 for that one day service to replace the operating system.", "pics": null, "resp": {"time": 1618431946124, "text": "Thank you for the kind words! We appreciate you giving us the opportunity to recover all the data from your failed hard drive. The new solid state drive should have you running at optimal performance!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113313827543372049979", "name": "Austin Miller", "time": 1498239935989, "rating": 4.0, "text": "I brought my laptop here for a screen replacement, I thought the price for my new screen was pretty expensive but then again it was my very first screen replacement. I rated this a 4 star because when I came to pick my laptop up they gave me someone else's charger so I sent my mother to swap it out for the correct charger not to mention how far we lived for the place. So when my mother went up there while I was working she brought it to me and it was the wrong persons charger again, luckily it fit my laptop so I just kept it and didn't go back up there. Because it was just to much gas waisted. But the repair was quick and only took 3 days and they also called me and emailed me when it was time to pick it up. But it is a good repair place in my opinion.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMek9Je3mB58SU_Omvko4DXiZ1lb6Nj8-qJb29H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106597259801070366412", "name": "Jonathan Jackson (BlackJackUSA)", "time": 1621431966317, "rating": 5.0, "text": "They're good people. They could have lied to me to get more money, obviously they didn't. One mistake was made, that cost me another 42 mile round trip. Besides that very human mistake I do highly recommend them.", "pics": null, "resp": {"time": 1621873692658, "text": "Appreciate the feedback Jonathan Jackson (BlackJackUSA), our goal is to be transparent with our services so that customers can make informed decisions. We are all human so mistakes can happen but the goal is to always be better in the next opportunity than the last!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115482778724027209278", "name": "Robert Smith", "time": 1618348679831, "rating": 5.0, "text": "I just left this place with my daughters laptop. Semester is winding down and laptop crapped out. They got the needed part fast. The place is a nice clean facility with comfortable sitting area. Professional employees. Exceeded my expectations.", "pics": null, "resp": {"time": 1619712150922, "text": "Hello Robert Smith, we appreciate you taking the time to leave us a review and rating. We are happy that we were able to exceed your expectations and get you back up and running quickly."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "118311509462041117839", "name": "Jason Willis", "time": 1610164240772, "rating": 1.0, "text": "Called about getting my phone fixed,Said they could do it no problem for $80.00. Drove 45 miles to their store was told it'd be $300.00 just for parts.  Found another place that fixed it for $85.00 in 45 minutes. I hate being lied to to get business.\nEdit for reply:\nMy wife called Tuesday 1/5/21 and told whoever answered the phone, after telling them my issue (power button on my Samsung Galaxy S10 plus fell off). She was told that it wouldn't be a problem and no appointment needed that it'd be $79.00. As I mentioned before I live 45 miles away, I had to leave work early to make sure I had ample time to get there and to get service.\nYes, you are correct,  there was not a record or service ticket made because the guy there looked at my phone said that I'd have to leave it and that the parts would be $300.00 because the board would have to be changed out that the button was all one unit. I value my time and money as much as everyone else and I left without your service. Yes, I do feel like the initial phone call was a bait and switch just to get someone in the store. You know that $19.99 oil change costs $500 because you need tires,wipers, injector cleaning and \"blinker fluid\". It's just strange that my wife was told one thing and I was told another. I called another shop  told them exactly what was wrong, they said same thing. No problem, no appointment needed.  Took phone, they looked at it and the fixed it for the amount quoted.\nFunny thing that one shop said one thing and the other one did it.", "pics": null, "resp": {"time": 1610116073880, "text": "Jason, I cannot find a repair ticket or record of your name, are you sure you have the right place? If so, I would like to reach out to you to find out what happened, as we do not give bogus pricing to obtain business. Mistakes do happen and if this indeed did happen, I'd love the chance to make it right!\n\nWe have a proven track record of being transparent throughout our entire repair process and we pride ourselves on having some of the best pricing in the industry. I especially appreciate this review because it gives me a chance to explain our repair process.\n\nBefore I start, i'd like to point out one thing, there is a giant discrepancy between $80.00 and $300.00. The only phone parts that cost this much are some of the Genuine Samsung Display Assemblies. If another shop was able to resolve this for $85.00, it was a small part repair, like a charging port or proxy sensor, for example. (If parts were needed.) My point is, our prices would have been comparable.\n\nWhen a customer calls in to obtain a price on a particular repair we do our best to go over the details of the problem or issue they are experiencing. If we are confident we know the solution to the issue at hand, we then will give you a price or at least a ballpark figure, so they know what to expect. If we are unsure what the solution is to the issue, we will ask you to bring the device in to be diagnosed, before giving you a price on the repair.\n\nThe Process.\n\n1. Once you come into our office, we go over the details of the issue you are experiencing with your device. We will then go over repair solutions or inform you that it will need further diagnostics to obtain the solution to the issue.\n\n2. We then obtain all your contact information and create you a ticket. We may at this time give you a price on the repair. Below are a couple normal situations.\n\n*Lets go over a couple examples, an iPhone 8, the screen is damaged, everything else on the device is working as intended (we verify this,) we give you a price on the display assembly replacement and an ETA for expected completion.\n\n*Now, lets say its a Gaming Computer, it is randomly turning off or blue screening. We will not know what the issue is without diagnosing all the hardware. In this situation, we will inform you that we will need to perform additional diagnostics to know what it will take to repair this device.\n\n3. Once we have obtained the device, we then will start the diagnostics or repair in the order that it came in. We have other repairs in front of new repairs. Your device will go into the queue and will be worked on when its ticket is next. There are two exceptions to this. Most phone screen repairs, if we have the parts on hand (which we do for all iPhones and some Samsungs,) are completed in an hour or less. (Time will vary depending on the particular repair.) The other exception is, we offer a rush service, this service is paid at the time of when you drop off the device. This is paid to have the device worked on immediately, otherwise tickets are worked on in the order they are received.\n\n4. Once the repair or diagnosis is completed, we then will email, text, and/or call you, to go over any final or further details.\n\n5. Pick up your device and pay for the repairs. Once a repair is completed you can come by and pick up your device at your convenience. We also offer payment options, you can pay in person with cash or card, or you can pay your invoice through our online portal.\n\n**One quick notes, due to COVID-19, we are not allowing our customers to wait on repairs in the lobby. They must either drop them off, wait in the their car, or outside of the building.\n\nJason, thank you for allowing us to go over this process with you and potential customers that may be reading this. Feel free to reach out to me, Clint Silver, owner at ProTek. I would love to know what happened and would love the opportunity to make it right. Thank you and as always, thanks for choosing ProTek!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "103138436098082055199", "name": "Zachary Maresh", "time": 1618691516063, "rating": 5.0, "text": "Dropped off computer for hard drive swap to ssd. Quick dropoff, good price. I use my computer for business, so a quick turnaround is crucial.", "pics": null, "resp": {"time": 1619711936804, "text": "Thanks Zachary Maresh for taking the time to leave us a review and rating! Glad to hear we were able to get your task completed quickly. We hope that you will use our services again in the future should you need us!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115524215039448349591", "name": "Linda Hames", "time": 1621881229838, "rating": 5.0, "text": "Professional, efficient, fair prices and repairs were completed quickly. I would definitely recommend them for any electronics needs.", "pics": null, "resp": {"time": 1624295133644, "text": "We appreciate the feedback Linda Hames, and are happy we were able to be able to fulfill your electronics needs."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116623139620284692083", "name": "David Shelly", "time": 1611857632371, "rating": 5.0, "text": "Quickly ran diagnostics to determine / confirm issues and offered several options to repair that I could select from, based on the age of the computer.  Great communications throughout the repair process.  I'll use them again in the future.", "pics": null, "resp": {"time": 1612387321325, "text": "Thanks for the feedback and review David Shelly. Glad we were able to provide you options to repair your device. We try to always provide the best options so customers can make educated decisions."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101671310226336448212", "name": "julie lewter", "time": 1621638120793, "rating": 5.0, "text": "Super courteous  staff who know how to get the job done right in a short time. Thanks Protek !", "pics": null, "resp": {"time": 1621873474611, "text": "Thank you Julie Lewter for the review and rating! Glad to hear the job turn around time was quick!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113570401959797925203", "name": "Andrea Harrison", "time": 1612382307937, "rating": 5.0, "text": "They were great!  They did the work quickly and kept me informed.  The laptop works great now.", "pics": null, "resp": {"time": 1612387058819, "text": "Thanks for taking the time to leave us a review and feedback Andrea Harrison! Glad to know you were pleased with the service provided. We hope you will contact us again should you need assistance in the future!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117769601472738997669", "name": "Anthony Krones", "time": 1599883084574, "rating": 5.0, "text": "These guys are great. I am a former computer engineer, but due to an acquired disability, no longer have the dexterity to fix my own machines, but I can recognize good work; these guys do excellent work. They even went as far as to let me know when fixing my laptop would be more costly than replacing it after exhausting all avenues to repair it. They even told me how I can do my own data recovery to save me money. With all of that, I was charged only the $50 diagnosis fee. These folks are amazing and I cannot recommend them enough to trust with your computer repair needs.", "pics": null, "resp": {"time": 1602517876034, "text": "Hello Anthony Krones, thanks for the review, the recommendation, and vote of confidence! We look forward to the next opportunity to assist you."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100016986023297776388", "name": "Raymond Porter", "time": 1611008823388, "rating": 5.0, "text": "I was very impressed with the professionalism displayed by the staff. I was pleased by the responsibilities of ProTek, they fix my computer in a timely manner. I was very pleased.", "pics": null, "resp": {"time": 1611080113430, "text": "Thank you Raymond Porter for taking the time to provide us feedback! Glad your experience with us was professional and the repairs didn't have you out of action for to long. Feel free to contact us again if we may be of assistance to you!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101173814948521816965", "name": "Jonnie Brown", "time": 1612990000217, "rating": 5.0, "text": "Clint and his team are always on the go whenever I needed something done! Awesome customer service and I’m always happy about anything  he and his team do for me.", "pics": null, "resp": {"time": 1614107927647, "text": "Thank you Jonnie Brown for the review and feedback!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102613392380696442232", "name": "David Payne", "time": 1601931938848, "rating": 5.0, "text": "My old computer screen went out and I wasn't able to log in and download files to an external drive. Had to buy a new computer. ProTek was able to transfer my files fro a reasonable price. Took a day or 2 longer due to Covid related backlog, but I will definitely use these guys if I need computer repairs again! Highly recommend!!!", "pics": null, "resp": {"time": 1602517741787, "text": "Hello David Payne, thanks for the review. We have added staff to better serve and try to keep repair turnaround reasonable."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113611524497609575759", "name": "Maurice Greer", "time": 1613581152300, "rating": 5.0, "text": "Have used them a number of times. Professional, excellent communication throughout each service work, reasonable prices, thorough, great results.", "pics": null, "resp": {"time": 1614107893356, "text": "Thank you Maurice Greer for the review and rating!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "110303863944027453296", "name": "Shelley Miller", "time": 1604960667176, "rating": 5.0, "text": "Had a hard drive crash, so the first place I thought of was ProTek. They were able to recover all of my data, and safely install it on another hard drive. Very friendly & professional. I would gladly recommend Clint and his team to others.", "pics": null, "resp": {"time": 1605647408839, "text": "Thank you Shelley Miller for taking the time to leave us a review and feedback. Glad we were able to help you!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106664826905571764130", "name": "Michele Brashear", "time": 1611668312161, "rating": 5.0, "text": "My computer had become increasingly slow and was experiencing frequent crashings (stuck on restart, non-responsive, blue-screen, etc.)  The knowledgeable techs at ProTex diagnosed that my hard drive needed replaced.  They recommend replacing with a SSD. I went from 1TB to 250 MB but they assured me that I had only used a very small (5%) portion of my storage so it would be fine. I got my computer back later that same week and it’s working great! I’ve been told that I may have paid a little much for the HD but I am certain the labor was the largest part of my cost.", "pics": null, "resp": {"time": 1611770350408, "text": "Thanks for the review Michele! We try to carry every size and type of hard drive and solid state drive in stock. There is always the option of providing your own drive, we just cannot warranty it. When purchasing a drive from us, we warranty it for 2-3 years depending on type of drive. This means, if the drive fails, we will replace it, install Windows, and move your data free of charge. This is why you can expect to pay more for our solid state or hard drives. Thank you again for your business!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101340978928021390953", "name": "Mack Wood", "time": 1616006861732, "rating": 5.0, "text": "Quick, easy, and kept me updated throughout the repair process.", "pics": null, "resp": {"time": 1617646817676, "text": "Thanks for the Review Mack, glad to hear the process was quick and easy for you, we always try to get customers devices back to them quickly."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111398200166097645422", "name": "Simply Imperfect", "time": 1602737257089, "rating": 4.0, "text": "Gave 4 stars because it took awhile (over a week) to get the part in... but other than that they were very friendly, and my computer is still working properly. Great job guys!!!!", "pics": null, "resp": {"time": 1602782895571, "text": "Thank you for taking time to review us! Unfortunately due to COVID-19, we have been experiencing delays in shipping from many of our suppliers and carriers. We apologize that the repair took longer than expected and if you ever have any issues with your device, just give us a call, we are happy to help!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "103270534760646914774", "name": "Micheal Pepper", "time": 1619723675511, "rating": 5.0, "text": "Great prices and top notch work.", "pics": null, "resp": {"time": 1619712207160, "text": "Appreciate the review Micheal Pepper!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104141777597208104411", "name": "Genocyde 2600", "time": 1593124731789, "rating": 5.0, "text": "They had the part ordered for my device and the device repaired two days after dropping it off.  Very courteous and friendly.  The representative was great and I WILL be a repeat customer!  Thank you so much!\n\n-James E", "pics": null, "resp": {"time": 1602518773915, "text": "Hello, thanks for the review and giving us the opportunity to assist you. We look forward to assisting you in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112892069939538190087", "name": "B Ackert", "time": 1619458263077, "rating": 5.0, "text": "Excellent experience all around.", "pics": null, "resp": {"time": 1619711753324, "text": "Thank you B Ackert for the review and rating. We hope you will give us the chance to assist you again in the future should you need our services."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101956665473956987796", "name": "Stela Pierce", "time": 1602342246764, "rating": 5.0, "text": "Great service and very professional staff. I have used them already twice to repair a laptop and a phone. Highly recommend them!", "pics": null, "resp": {"time": 1602517487355, "text": "Thank you Stela Pierce for the review and reccomendation!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "110556259182882900855", "name": "Dan Naran", "time": 1603746358777, "rating": 5.0, "text": "Staff were very courteous and diagnostics were done as promised. I would’ve love to have them do the repairs but laptop was old and not worth the repairs.", "pics": null, "resp": {"time": 1603983887770, "text": "Thank you for the review, we try to be upfront about anticipated cost and value of repairs."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "118053299706169141982", "name": "Chris Farrow", "time": 1611858665149, "rating": 5.0, "text": "Friendly staff. Highly recommended if you need PC support", "pics": null, "resp": {"time": 1612387140669, "text": "Appreciate the feedback Chris Farrow, let us know if you need help with another PC issue or if we can be of assistance in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "105818579744704590432", "name": "Mickey West", "time": 1609632035705, "rating": 5.0, "text": "ProTek fixed two of my laptops. I appreciate the phone call before repairs were made.", "pics": null, "resp": {"time": 1608061980087, "text": "Thank you for leaving us a review."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100718962679982987342", "name": "Robert Oliver", "time": 1617896741608, "rating": 5.0, "text": "ProTek was very helpful and solved our problem. They are professional in every way.", "pics": null, "resp": {"time": 1619712278848, "text": "Thank you Robert Oliver for the rating and review. Glad to hear we were able to fully resolve the problem."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101566852914845518006", "name": "Brent Maley", "time": 1587754180959, "rating": 5.0, "text": "They are fast, friendly,  and knowledgeable folks. Brought my iPhone back to life after a VERY bad fall. Price was great! Highly recommend you speak to them for any phone repairs.", "pics": null, "resp": {"time": 1620231511791, "text": "Thanks for the review Brent Maley! Hope you and your iPhone are doing well."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113220709205558964060", "name": "george ball jr", "time": 1607267827967, "rating": 5.0, "text": "Great service and provided great value in guidance and work quality", "pics": null, "resp": {"time": 1607626716027, "text": "Thank you George Ball Jr for taking the time to give us feedback on the service and value you received. If you need assistance in the future let us know!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112817323255824334136", "name": "Denver Doll", "time": 1597113790833, "rating": 5.0, "text": "My gaming desktop quit working and initially I took it elsewhere because it was the only HP authorized repair business in the area. Big mistake! I contacted ProTek after that fiasco and even though it was after hours, even though they're so busy right now that it probably would've been a week before they could get to my machine, Clint took the time to walk me through diagnosing the problem.\n\nHe was able to narrow down the issue in a matter of minutes, when the other place wasted over a week and my money. I am so impressed by ProTek's professionalism and customer service that I cannot say enough good things about them. Highly recommend!", "pics": null, "resp": {"time": 1602518030892, "text": "Hello Denver Doll, thanks for the review. Hope you got your pc back running and thanks for the recommendation."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113252319678935189090", "name": "Tiaja Fletcher", "time": 1608062317159, "rating": 5.0, "text": "The service was friendly, professional and quick response with diagnostic results.", "pics": null, "resp": {"time": 1608134156406, "text": "Thank you for the review Tiaja Fletcher, we know how important our devices are so we try to get you back running quickly."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "103087705380637277153", "name": "chase walker", "time": 1604060908464, "rating": 5.0, "text": "They where able to help me with my laptop, and they did a good job at it, thank you.", "pics": null, "resp": {"time": 1604070091800, "text": "Thank you Chase for the feedback, we look forward to assisting you again should you need us in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111134920450099324898", "name": "Cory Clayton", "time": 1579737585822, "rating": 5.0, "text": "Had to fly out on a work trip on Monday afternoon, and as luck would have it the day before that my dog somehow got my phone and used it as a chew toy in my backyard. Went to ProTek at noon on Monday and they had my phone fixed and ready to go Within 30 minutes. Wow. Fast. Thorough. Reliable! Highly recommend them for any of your IT needs.", "pics": null, "resp": {"time": 1620245930936, "text": "Thanks for the review Cory Clayton, hope you will use us again should our services be needed!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117521606322305172906", "name": "Michael Bryant Ryder", "time": 1608505529447, "rating": 5.0, "text": "Awesome service.  My first choice for repairs.", "pics": null, "resp": {"time": 1611080459198, "text": "We very much appreciate you Michael Bryant for taking time out of your day to day to leave us a review and rating. We hope to hold the spot of your first choice for future repairs should they be needed."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113170910374322163898", "name": "Courtland Byrd", "time": 1586795591100, "rating": 1.0, "text": "I want to start by saying that after comparing tech repair companies I chose ProTek because of their great reviews. I debated leaving this review because I know how harmful bad reviews can be to a small business. Unfortunately, my experience with ProTek was so disappointing I felt obligated to share.\nWhen replacing my screen ProTek compromised the integrity of my water resistant IPhone XS causing it to be hyper sensitive to moisture. This resulted in my phone being corroded by light water exposure only 3days after the iPhone repair. ProTek then refused to refund me the 200$ for the faulty screen replacement which essentially destroyed my 1000$ phone. Let me be clear that my IPhone had been exposed to water on previous occasions to the screen replacement with no issues. ProTek even assured me that there was no water damage prior to the screen replacement. I had expected to have a better experience with ProTek because I had confidence in their customer reviews. Sadly, I have to say I was dissatisfied with their services. At the very least I hope others will take my experience with ProTek into consideration and proceed with caution in regards to ProTek’s remarkable ineptitude with apple products.", "pics": null, "resp": {"time": 1589823914117, "text": "I am very disappointed by this review, i'll explain why. Unfortunately for phones, we are in the warmer months and people like to be on the water and when you're on the water, these type of things will happen. I want to start off by saying that we repair and/or recover data from thousands of water damage devices. When you first brought the iPhone in for a screen replacement it was because you left the iPhone in the rain and it ruined the screen. (We informed the customer that the screen was the only thing damaged by the rain.) We replaced the screen and put a new screen seal on it, (as we do with all repairs.) The phone then came back with standing water inside the device, this amount of water is concurrent with other phones we see that have been submerged into water. The customer asked for a warranty on the screen, unfortunately we cannot warranty water or physical damage. (Simply putting a new screen on this iPhone would not resolve the issue, given the current condition.) In a case like this, with standing water inside the device, we would need to let the water dry (we have tools to speed this process up.) After the water has dried, it will leave corrosion behind, which will need to be cleaned. We would then remove the logic board from the iPhone housing, clean it with our Sonic Cleaner, and then test the device for further component damage. We then would replace the components needed to repair the device. More than likely we could have saved this customers phone, had the customer let us complete the water damage assessment on this device.\n\nPlease remember that iPhone's are not water proof, they are water resistant, and each iPhone has its own water resistance rating. We have seen water damage happen in pretty much every way, from being in your pocket and sweating, to being on the bathroom counter while taking a shower, and to drops in the ocean. Each iPhone handles each exposure differently, because in each exposure, the conditions are different. If you are going to be around water, buy a water proof bag, put your phone into the bag and use it from the outside the bag, only to remove it if you need to make a phone call. This will drastically minimize the chance of water damage. I hope this reply has answered any questions as to how we handle water damaged phones here at ProTek. If you have any questions, concerns, or just want some friendly advice, feel free to contact us at your convenience!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106268087011808976957", "name": "Ron Davis", "time": 1585255810757, "rating": 5.0, "text": "Repaired a Mac laptop for me. Repair was done properly and in a reasonable amount of time. Rates are very fair and much cheaper than the Apple Store. They even mailed the laptop back to me. I will definitely be using this business again.", "pics": null, "resp": {"time": 1620244034698, "text": "Thank you for the review and rating Ron Davis, we hope you will use us again should you need us in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "108650853455625322699", "name": "Rene Baisden", "time": 1576170883539, "rating": 5.0, "text": "My experience with ProTek was awesome! My Mac is almost 10 years old and they were able to save all my information and install new software. The cost was reasonable. They even held on to my laptop for a few weeks due to me being out of town at no charge. I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117488595093844540592", "name": "Heather Hill", "time": 1597088488269, "rating": 2.0, "text": "The guys were nice but everytime they said we would receive a call we would wait for that day for them to call never here from them and ended up calling them the next day. Our problem was never fixed but it was due to me needing to buy new parts. They did keep my hard drive and say they would try to get stuff from it on a usb, that was 3 weeks ago and we have heard nothing from them. The price was bad and the guys were great when you talked to them but the communication could be A LOT better.", "pics": null, "resp": {"time": 1602518610191, "text": "Hello Heather Hill, thank you for leaving us a review of your experience. First we do apologize for dropping the ball regarding communication which is unacceptable. We have updated our communication by sending text messages, email, and a phone call when we have an update."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102888683607154127305", "name": "Ed Hayes", "time": 1601996805693, "rating": 5.0, "text": "Had an unusual problem with the display hinge on my laptop. ProTek was able to repair the problem, including a couple of cracks in the case, in a couple of days at a reasonable cost.", "pics": null, "resp": {"time": 1602517545529, "text": "Hello Ed Hayes, thanks for the review."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117069188009706239406", "name": "Teresa Mueller", "time": 1608058206918, "rating": 5.0, "text": "Excellent customer service with product\nknowledge & professionalism!!", "pics": null, "resp": {"time": 1608061833930, "text": "Thank you very much Teresa Mueller for taking the time to leave us a review. We look forward to assisting you in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117033907820508070999", "name": "Ronnie Shepherd", "time": 1585324433135, "rating": 5.0, "text": "I have taken two different laptop (DELL) and (Toshiba) computers to ProTek to have the hard drives replaced,  anti-virus installed, and Microsoft Office downloaded. Those gentlemen were very courteous and professional and explained everything they did for those laptops in great detail. I would recommend them to family, friends and co-workers.", "pics": null, "resp": {"time": 1620243793811, "text": "Thanks for the review and rating Ronnie Shepherd!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109015077776898739160", "name": "Tri-State Clinic", "time": 1588341291440, "rating": 5.0, "text": "Saved my computer and recovered all my data!! In a short amount of time, we were up and running again!!  Highly recommend! Very knowledgeable and efficient. Thank you!", "pics": null, "resp": {"time": 1620231391687, "text": "Thanks for the review and rating, glad we were able to assist you!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116929398176055506070", "name": "Kelsey Marielle", "time": 1589930820472, "rating": 5.0, "text": "I have been going here for years every time I need a phone screen repaired. I am very clumsy, so I have gotten a good number of screens repaired. Always a friendly staff and have never had an complications! Highly recommend :)", "pics": null, "resp": {"time": 1602519374594, "text": "Hello Kelsey Marielle, thanks for the review and recommendation!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "108942607890681543513", "name": "Deborah pellem", "time": 1594151611512, "rating": 5.0, "text": "They are  very affordable and they are very professional. They always do  a great job,  they have fixed several laptops for me and I've always been satisfied.", "pics": null, "resp": {"time": 1602518717865, "text": "Hello Deborah Pellem, thank you for trusting us with your laptops for repair and service. We look forward to building on the satisfaction we have provided."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117377238703260489463", "name": "Mimi Shady Walnut", "time": 1588536654474, "rating": 5.0, "text": "My laptop stopped working, so I called ProTek and thankfully they were open. When initially speaking with the tech he advised me of the precautions that were being taken by the business to ensure safety during the COVID-19 pandemic for them and the customers.  This included the lobby and while working on my laptop.  When I entered the business, I noticed that they were taking all the CDC guidelines for COVID-19 very seriously and it made me feel more secure with the process.  The tech was very professional and knowledgeable.  The problem was diagnosed quickly and he carefully explained all the options I had to consider.  In the end, I decided to purchase a refurbished laptop from them and transfer the data. The price on the refurbished laptop was fair and I am glad to be back up and running. I would recommend them to anyone.\nThank you ProTek. 👍", "pics": null, "resp": {"time": 1619712616158, "text": "Thank you for the rating and review Mimi Shady Walnut! Glad to hear we have your recommendation!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106754178660627858128", "name": "gary robertson", "time": 1616800258175, "rating": 5.0, "text": "They did what they said they would do and did it well.", "pics": null, "resp": {"time": 1617646879439, "text": "Appreciate the review Gary, glad to hear things went according to plan."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106286784442846180843", "name": "Shaun Glasgow", "time": 1578852678000, "rating": 5.0, "text": "Great customer service.  Worked with me to provide an estimate on a laptop repair that had to be provided to the extended warranty company.  Repair completed in a timely manner and correctly.  Recommended.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102916881263408211746", "name": "Tracy Gamble", "time": 1587667686686, "rating": 5.0, "text": "Professional and competent service from first contact. Communication was above expectation. Would not hesitate to use them again if there is a need.", "pics": null, "resp": {"time": 1620231593447, "text": "Thanks for the review Tracy Gamble, we hope to exceed your expectations again should you need us in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109998366114965406139", "name": "John Justice", "time": 1579991323577, "rating": 5.0, "text": "ProTek resurrected a dead Alienware laptop.  One new battery and solid state drive and it's up and running.  The restoration of services is proving relatively painless - it connected right up with my wireless and hooked up to the Internet with no problem.  Great job, guys.", "pics": null, "resp": {"time": 1620245696586, "text": "Thanks for the review John Justice, glad to hear we were able to to get you back up and running. Our goal is make repairs as easy and cost effective as possible."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "107336917753872798248", "name": "David Andrew", "time": 1591981228588, "rating": 5.0, "text": "Fast, friendly service. The guys were upfront about the process and where my device was at each step.", "pics": null, "resp": {"time": 1602518872784, "text": "Hello David Andrew, thank you for the review. We try to be upfront and transparent about services and are glad you were able to see that."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117334095660654071057", "name": "Star Squad", "time": 1578764508420, "rating": 5.0, "text": "I had an external hard drive with major failure happen recently. It had well over 400gb of photos and was my whole business. It was recovered by 95% which was more than I anticipated and I received such kind and great help. Would recommend these guys to anyone!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115868252111275638515", "name": "BeBe's Jamz", "time": 1579278842245, "rating": 5.0, "text": "I've had many laptops and Protek has been my \"go-to\" for many years when it comes to solving computer issues and fixing any hardware repairs. They are always responsible, reasonable and right on-time. I would suggest to anyone who has a computer that's too big to handle yourself......go to Protek! Powering Up Better Solutions!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109823030038511199112", "name": "Linda Jones", "time": 1572752536868, "rating": 5.0, "text": "I was afraid that my lap top had been infected with malware.  ProTek completely wiped my hard drive and reloaded the current iOS.  They were able to save my data, scan it for anything that shouldn't be there and then reload it.  The laptop works great now. Great job!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112931083734946659355", "name": "B. K. Cobb", "time": 1572477424789, "rating": 5.0, "text": "Phone screen replaced quickly; working as expected.  Price was reasonable.  Had to wait over a weekend for the screen to be ordered, but it was an old phone, so no worries.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111774979486998771745", "name": "Ty Fincher", "time": 1584102683165, "rating": 5.0, "text": "For data recovery, they email an html file so that you can see the directories and files that they were able to salvage. Nice folks too.", "pics": null, "resp": {"time": 1620244116366, "text": "Thanks for the review and rating Ty Fincher. We like using the html file list so customers can have a preview of the data before paying."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "110892129449468462146", "name": "BILLY STEELE", "time": 1587042421670, "rating": 5.0, "text": "Outstanding customer service and reasonable prices!  Great company!", "pics": null, "resp": {"time": 1620231617837, "text": "Thanks for the rating and review! Hope you are doing well."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106020008431228531804", "name": "Omar Williams", "time": 1568187790532, "rating": 4.0, "text": "They had great service and very professional. Sadly my drive couldn't be saved but I do like the fact that being that my data was not recovered I was not charged. Keep up the good work.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101250276575730465076", "name": "Fighter Teacher", "time": 1571319252829, "rating": 5.0, "text": "I brought in a CNC Laser Etcher purchased from an overseas supplier which I could not get to communicate with my laptop.  Sean listened to my issues and corrected the problem in less than 24 hours for the quoted price.  Very well done.  I use the etcher in my home/hobby business and its functioning is very important.  ProTek keeps my laptops and related systems in top shape.  Thank you Mr. Sean and ProTek.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116167708574563590014", "name": "John Marlar", "time": 1564163454877, "rating": 5.0, "text": "I have a galaxy s8 and screens are 269.99 from the Samsung store they charged me 289 and some change very reasonable it took them 2 days but they were ordering the screen. The people there are friendly and are there to help you. Would recommend to anyone needing to fix a phone screen.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115382075645363018497", "name": "LeAnn Volesky", "time": 1582928444143, "rating": 5.0, "text": "We recently moved to Huntsville and realized upon arriving that our computer would not start.  ProTek was quick and efficient and we were up and running in no time.", "pics": null, "resp": {"time": 1620244185622, "text": "Thanks for the rating and review LeAnn Volesky, glad to hear we got you back up and running quickly!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "107867782106741826115", "name": "Jean Snowbarger", "time": 1558802303430, "rating": 5.0, "text": "Had an external hard drive with several years of family pictures..   The hard drive was toast.  I am very happy that ProTek retrieved my data.  I had a friend who is a computer whiz (somewhat) - and after she couldn't retrieve the data, she suggested ProTek.  Got all my pictures back and the hard drive is out the door...   Put all the precious pictures are back to be viewed!  Thanks to PROTEK.  They did everything they said they'd do in a timely manner.", "pics": null, "resp": {"time": 1559921064414, "text": "Hello Jean Snowbarger, thanks for the review! We are also happy that we were able to assist you in retrieving all of your precious pictures."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106227165393255100422", "name": "John Phillip", "time": 1576260655477, "rating": 5.0, "text": "I found myself with a \"Outlook\" e-mail software problem that was beyond my ability to solve.  The ProTek folks helped me resolve that problem but also found a deficiency in my PC's hard drive.  ProTek was able to replace the hard drive and transfer all of my data to the new drive.  If I had lost all of that data, I would have been in bad shape.  ProTek also set me up with a back-up program which gives me a lot of security for the future.\nGo ProTek.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104261722532739768791", "name": "Mike Hovis", "time": 1583545699597, "rating": 5.0, "text": "I was very impressed with Protek. I needed a battery replacement for my Surface Pro 4. I had watched videos and knew there was no way I wanted to tackle the replacement myself. So, I started looking and found Protek. They did exactly what they said they would do. The repair was done on time and the price was fair. I really appreciate the professionalism, reliability, and value I found at Protek.", "pics": null, "resp": {"time": 1620231721151, "text": "We appreciate you giving us the opportunity to provide a service for you Mike Hovis and the review."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113710491676069833599", "name": "Bill Crane", "time": 1583860952245, "rating": 5.0, "text": "Excellent, fast service and honest assessment of products. Highly recommend", "pics": null, "resp": {"time": 1620231740615, "text": "Thanks for the review Bill Crane!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106046004185453992244", "name": "kenyata Wiggins", "time": 1579535341810, "rating": 5.0, "text": "Explained everything thoroughly,  stayed in contact throughout my service regarding status, options and cost. Professional and I will be a repeat customer.", "pics": null, "resp": {"time": 1620246219912, "text": "Glad to hear you were happy with service Kenyata Wiggins, we hope you will look us up should our service be needed in the future!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101153007840339185672", "name": "Sarah Helms", "time": 1585426014514, "rating": 5.0, "text": "I took my corruped micro SD card into ProTek because I had numerous pictures from Hawaii on the card.  They retreaved all of the pictures and I was pleased with the service.", "pics": null, "resp": {"time": 1620243674365, "text": "Thanks for the review and rating Sarah Helms, glad to see we were ale to recover your pictures."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "108161840318526811594", "name": "Shanika Ogburn", "time": 1607111885306, "rating": 5.0, "text": "Professional, friendly and informative.", "pics": null, "resp": {"time": 1607112819607, "text": "Thank you for your review, glad to hear you found your time with us to be professional and informative!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106657832996421994007", "name": "Angela Hunt", "time": 1579707936155, "rating": 5.0, "text": "Great customer service very Friendly and knowledgeable with extremely quick turnaround. Highly recommend!", "pics": null, "resp": {"time": 1620246135687, "text": "Appreciate the review and rating Angela Hunt, glad to hear we were able to get you back running quickly!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104921617832292994753", "name": "Diane Tremble-ball", "time": 1576338840766, "rating": 5.0, "text": "Up front about costs. Appreciated that there would be no charge if data could not be retrieved from my phone.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111116554864317501748", "name": "Adi Dutia", "time": 1565718135669, "rating": 5.0, "text": "My 8 year old  PC needed BIOS and Windows 10 upgrade. It was completely dead.  Pro Tek  quickly and professionally handled the job. PC is now running like new. In last 2 months I have not encountered any OS related issues. I would recommend Pro Tek.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117135311118487058904", "name": "Ed Santiago", "time": 1576290816478, "rating": 5.0, "text": "Outstanding Service and customer service.  Professional staff and really affordable prices.  I strongly recommend them", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112429891697897289019", "name": "Jennifer Whitley", "time": 1579055672565, "rating": 5.0, "text": "Very nice. They fixed my tablet quickly and at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "105282267169919896396", "name": "Joe Bama", "time": 1569597238316, "rating": 5.0, "text": "First class services data recovery and consulting. Very professional Mr Silver is very knowledgeable in his field", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117363612684346754141", "name": "Rafal Czykier", "time": 1585328694666, "rating": 5.0, "text": "Great customer service and they were able to retrieve my list data. Would use them again!", "pics": null, "resp": {"time": 1620243737514, "text": "Glad to hear we were able to retrieve your needed data!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114307377901848248162", "name": "David Rodgers", "time": 1565794363122, "rating": 5.0, "text": "Failed battery replacement for iPad due to hardware failure. Did not charge me and only small fee to attempt data recovery.  Very prompt service as well. I’ll definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101013706076887115712", "name": "Trixieandchimchim", "time": 1576166106120, "rating": 5.0, "text": "They are super nice very reasonable and quick at repairing!  They have my future business!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115306052524447976918", "name": "Michelle Payne", "time": 1574656117739, "rating": 5.0, "text": "Very friendly and knowledgeable! They had my laptop fixed in no time and the price was very fair. 💞", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112805801865503610538", "name": "Eddie Campos", "time": 1555939674590, "rating": 5.0, "text": "Great pricing, and they were very accommodating on times for pickup and drop off. However, I would say that organization should be improved  to avoid confusions during pickup. Overall, I would recommend them to anyone in need of data recovery.", "pics": null, "resp": {"time": 1555964348761, "text": "Eddie, thanks for taking the time to review us! We will review our customer pickup process and see how we can improve. The last thing we want is confusion when customers are picking up their devices!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "103411931385090437155", "name": "CHRISTOPHER TOLMAN", "time": 1543429520837, "rating": 5.0, "text": "Very helpful and friendly staff.  Price was lowest I found in the area and service was quick. Professional on every level and exceptional technical knowledge.  Already planning on using their services in the future.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100585425077048353016", "name": "Stacey Turner Wellness", "time": 1565799883974, "rating": 5.0, "text": "I would recommend Protek as they were able to fix my MacBook and they had a quick turn around. I run my own business so it was important for me to get it fixed fast..", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117641232444776634905", "name": "Mike Smith", "time": 1591992494077, "rating": 5.0, "text": "Fast services computer was better than new", "pics": null, "resp": {"time": 1602518809883, "text": "Hello Mike Smith, glad to hear you were happy about the computer!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "110641669392135347150", "name": "Stephen Collins", "time": 1551216711201, "rating": 5.0, "text": "The screen on my I pad was shattered. I thought I would try to fix it myself and that was a mistake. I had the screen removed but in the process damaged the cable for the home button. I brought it in to ProTek an was greeted by Clint. He was very polite and explained the damage I had already done and wasn’t sure if it was fixable. He explained how much everything would cost and told me It should be ready the next day. They had it ready to pick up in under 24 hours and Clint also got my home button fixed. Couldn’t ask for anything more!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104436055659351736403", "name": "Pam King", "time": 1576168440466, "rating": 5.0, "text": "Great Place, the employees were very helpful.  I will use them again for sure !!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "107624123889650622889", "name": "Jeanette Jones", "time": 1555626000444, "rating": 5.0, "text": "Great group.  They kept me informed on everything they were doing and I had my pc back in a couple of days.  They were very professional at all times.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100512865428840768977", "name": "Nathan Adamek", "time": 1579017866048, "rating": 5.0, "text": "ProTek is where its at! Forget about Geek Squad or anywhere else, the team at ProTek will get you covered for a great price! The team there is very knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101373063614602922561", "name": "Adenike Adeoye", "time": 1605917923117, "rating": 5.0, "text": "Great service.", "pics": null, "resp": {"time": 1607112618649, "text": "Thanks for the review, glad that you found our service of value."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101174864254446519662", "name": "Bill Heard", "time": 1569426680498, "rating": 5.0, "text": "Fixed it right the first time. Good communication during process.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102151371215683649766", "name": "Joshua Barnett", "time": 1567611716849, "rating": 4.0, "text": "ProTek was able to repair my laptop within a relatively short span of time. There were a couple hiccups when picking up my laptop (the left-side USB ports were still not working), but this was swiftly corrected upon informing them. I will return if an electronic is damaged in the future.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116595893558156321285", "name": "Colin White", "time": 1551024337042, "rating": 5.0, "text": "Quick turnaround and they only charged me a simple fee for fixing my stupid error. Timely updates and helpful support. Would go again!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102818898517004137756", "name": "shepsign", "time": 1559314462311, "rating": 5.0, "text": "Pro Tek is wonderful! Great recovery support! Will continue to use them for all our computer needs!!", "pics": null, "resp": {"time": 1559920953081, "text": "Hello shepsign, glad to see we earned a 5 star review from you! We love being able to give people a second chance with what is precious!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106798819255176711181", "name": "Scott Duncan", "time": 1566396717084, "rating": 4.0, "text": "It seemed it would be almost as expensive to retrieve my data as get the machine fixed overall, so I did the latter. They did a good job and got it done reasonably quickly given that they had to get a while new motherboard for the machine.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111490188975577502739", "name": "whitney mcclain", "time": 1552152393612, "rating": 2.0, "text": "I had a tablet's screen replaced by them and sent them a message on facebook about the screen continuing to turn off. They read the message and never replied. I don't see how I go from having a cracked screen to the tablet shutting off every few minutes..it never did this until I got the screen replaced", "pics": null, "resp": {"time": 1555647720777, "text": "Whitney, sorry we missed your Facebook message! We do our best to stay on top of all social media messages. We have reached out to you as we warranty all of our work. We would love the opportunity to take care of your device! Feel free to email, call, or stop by at your convenience. We look forward to seeing you!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104401770081654003381", "name": "Elise", "time": 1565555315535, "rating": 5.0, "text": "Grateful to ProTech because they recovered all my precious pictures going back many years that were on my fried external hard drive.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114431741382280290393", "name": "Derek Mitchell", "time": 1565637412233, "rating": 5.0, "text": "ProTek was very professional and very timely, and I would heartily recommend them to anyone with any sort of IT issues!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115534486330760107751", "name": "Tami Jacobsen", "time": 1566310878386, "rating": 5.0, "text": "Happy with the service.  Computer is back to working like new.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101823926564751072657", "name": "Deshonna Ford", "time": 1572460858267, "rating": 5.0, "text": "Very professional and quick turn around service.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115373050455291058481", "name": "Anthony Dudley", "time": 1548516922981, "rating": 5.0, "text": "I truly appreciate the honesty of Protek. The technician found a loose connection and brought that to my attention. Most places would have ordered unnecessary parts and charge me some outrageous price.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114239191097930841404", "name": "Scott Haas", "time": 1585498052183, "rating": 5.0, "text": "Very quick and thorough courteous service!", "pics": null, "resp": {"time": 1620243538633, "text": "Thanks for the rating and review Scott Hass, we hope you will use us again should you need us in the future."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104742047223481595447", "name": "philip calogero", "time": 1513622510191, "rating": 5.0, "text": "Don't waste your time going anywhere else.  The customer service was awesome, they were fast, great price, and most of all fixed my phone!  The needed repair was pretty straight forward, but I'd been to 2 other places including the manufacturer's store and no one else had even attempted to fix it.  I won't go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106821695029703609022", "name": "AW. T. Fuller", "time": 1574355890703, "rating": 5.0, "text": "Timely work, efficient staff and work as promised.\nSmall parking lot.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101963564285319184821", "name": "Sara Schultz", "time": 1528223787791, "rating": 5.0, "text": "If you’re having problems with any of your devices, Protek is the place to go. The staff are incredibly friendly and knowledgeable and got my computer back to tip top shape and didn't charge any astronomical fees. If I have any issues in the future I’ll definitely be back!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114283880572324442213", "name": "Gina Linville", "time": 1575573382390, "rating": 5.0, "text": "Very knowledgeable and good customer service.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106906495422936524582", "name": "Allen Davis", "time": 1484143130433, "rating": 5.0, "text": "Best Cell phone service I have found. They have fixed everything that I have taken to them and at reasonable prices. Don't give up on your phone until you have given them a chance. As examples they fixed my charging port, replaced the broken back cover, re flashed the operating system and even cleaned the front cover and Otter box screen before handing it back to me.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109871356208956820524", "name": "Louis Cleare", "time": 1526410586466, "rating": 5.0, "text": "Definitely a five star experience! Great service! They worked well with me even though I had a few hiccups on my part and kept me updated throughout the process! And, fixed my computer in time to catch my flight! Will definitely be going back! Thanks a mill guys!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114132254138604845962", "name": "Jacob Brown", "time": 1555603366209, "rating": 5.0, "text": "Great pricing and honest work! I’d recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114140486851959938009", "name": "Bick Whitener", "time": 1556113787489, "rating": 5.0, "text": "Good work at reasonable prices and this team offers alternatives when discussing the solution to your personal computer issues. Definitely my pc hardware servicer of choice.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "105104883167327649747", "name": "R.L. Scott", "time": 1406485041692, "rating": 5.0, "text": "ProTek has been great to our family.  We're rough on computers and ProTek has been able to help fix our problems quickly every time.  No matter what the issue is, ProTek has been able to help us out and their price is always reasonable.  We would highly recommend ProTek for all or you computing needs!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102683728964701392234", "name": "Daniel Cheek", "time": 1493177619121, "rating": 5.0, "text": "I was having an issue with my laptop not powering on. I took my laptop in to the guys at ProTek and the were able to diagnose the problem in a matter of minutes. They ordered the part and got me fixed up and everything is running good. I will be coming back too see these guys for any future needs.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100021134149264786944", "name": "John Whitehead", "time": 1548780166089, "rating": 5.0, "text": "Couldn't be happier with the service. I dropped my iPhone 7plus and cracked the screen. Within 15 minutes, the ProTek team had my screen replaced and I was out the door. Great job ProTek!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104279588109221973339", "name": "Denise Walker", "time": 1467580897160, "rating": 1.0, "text": "Kept my desktop for almost 2 weeks told me it was fine and nothing was wrong with it. as soon as I got home with it was was having  the exact same problem. They also tested a hard drive and told me it was also good. Ended up taking it else ware and and the other business fixed it in 3 days and told me that the hard drive in question was bad and unrecoverable. I will not recommend these guys for desktop repair.", "pics": null, "resp": {"time": 1469476483958, "text": "Denise we are sorry that you had such a bad experience with us. Upon bringing in your computer, you brought us two hard drives. We performed diagnostics on both hard drives and they both passed our diagnostics. Both hard drives where able to view and/or move files that where located on the drives. We installed the hard drives and installed your operating system as asked. We would like to offer you data recovery on your hard drive, this is complementary and will be at no charge. If you have any questions or need further support, please contact us @ 256-489-2904. Thanks!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100014952178026105271", "name": "Donna Deneefe", "time": 1572450517642, "rating": 5.0, "text": "Excellent service and very professional.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "105592207425559468122", "name": "Colson Jordan", "time": 1466826570066, "rating": 5.0, "text": "I walked in at 6:45 on a Friday night when they closed at 7. I just asked the man to see if he could see what was wrong but instead he insists on fixing it. Not only does he fix my charging problem but fixes my screen, battery, and charging port all at a discount because I had to wait. When I got there 15 minutes before they close. These people make you feel like a priority and while beating the price of their competitors. I gave them a 5/5 but they deserve a 10/5 man excellent experience!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113087112224123251731", "name": "Maria Gramlick", "time": 1540925927115, "rating": 5.0, "text": "very few businesses goes above and beyond to take care of customers, at ProTek we found professional service and friendly,  caring personnel. I highly recommend ProTek for your computer repair.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106908660406371077737", "name": "John Thornton", "time": 1525449481386, "rating": 5.0, "text": "Incredible customer service and good pricing. They are extremely willing to work with any repair schedule and are able to fix even the newest phones shortly after release.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101232294392213216267", "name": "Yogesh Patel", "time": 1512432930380, "rating": 5.0, "text": "Best I mac Repair people in town. Mr. Clint Silver Is very genius Guy. I took my I mac in to the guys at ProTek and the were able to diagnose the problem in a matter of minutes. They Fix my I mac within a day.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116611238585114731114", "name": "Wesley Mathis", "time": 1517854597399, "rating": 5.0, "text": "Worked with me to get my desktop diagnosed. Very reasonable pricing given all the work they had to put in just to diagnose it then installed the replacement part for free. Ill be coming here every time from now on.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100272930836116534997", "name": "Lew Pierce", "time": 1583329652387, "rating": 4.0, "text": "On time and done correctly!", "pics": null, "resp": {"time": 1620231653690, "text": "We appreciate your feedback and rating Lew Pierce!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "101555596053173842693", "name": "li-nola lemari", "time": 1513736198614, "rating": 5.0, "text": "Had a great experiences with the employees. I brought in my IPhone 6s cause I thought the Port for charging needs to be fix. Came back couple hours later found out that there were just pile of dirt on the phone’s charging port. So they clean it without any charge. So I went ahead and tell them to replace my phone screen cause it was little crack. It took them 10 minutes to fix it. Great and cheap place to bring your phones to get it fix.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "103493860787025023778", "name": "Jim Yokem", "time": 1468445174987, "rating": 5.0, "text": "Excellent experience. My tech was friendly and very knowledgeable.Thought my Iphone was done for, but Keenan got my phone up and going and I couldn't be more pleased.\nThanks", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "110751576556871814113", "name": "Larry Sadler", "time": 1555621009074, "rating": 5.0, "text": "Great service, good price and they stay true to there word, I  would recommend them over the others.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106734197976530556730", "name": "Vincent Colletti", "time": 1468359905415, "rating": 5.0, "text": "These guys cleaned my charging port before fixing it (and realized it was just dirty, not broken) so charged me nothing. They are honest and know what they are doing -- only took two minutes!  Take your devices here... Thanks, Pro Tek.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "108910592668251314492", "name": "Malaz Alexius", "time": 1493177704673, "rating": 5.0, "text": "Brought my Alienware laptop in due to having some problems with it holding a charge when not plugged in. They were able to identify the issue (the battery was starting to go bad along with the charging port connection being loose over the years of plugging and unplugging). My laptop got fixed with a reasonable turnaround time and haven't had any issues since.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115600470216004505457", "name": "Donna Scott", "time": 1539815362799, "rating": 4.0, "text": "Timely turn around on repairs. We have taken all of our devices, phones, ipad and computers over the years and service is good.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114069188893496371379", "name": "Christopher Campbell", "time": 1444502810284, "rating": 5.0, "text": "ProTek was able to help me solve an issue I did not know could be resolved.  I came in with a broken phone and they were able to run diagnostics to figure out the issue to my problem on the spot.  I couldn't have asked for better service - fast, effective and reasonably priced.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114577869336596150173", "name": "James Dardón", "time": 1341101237211, "rating": 5.0, "text": "Took a laptop there after it had some water damage.  Clint had it repaired and I was able to pick it up the next day.  He was very professional and I felt that he was very honest!  I highly recommend him.  I hope I do not have any more computer issues, but if I do, I know where I will be going to get it fixed!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114381915642174536658", "name": "Queen Isaac", "time": 1540247419503, "rating": 1.0, "text": "These guys have NO IDEA what they are doing... they took something minor, made it major as if I didn't know they had MESSED UP... If you don't know what you are doing then say so... DUMB NERDS.", "pics": null, "resp": {"time": 1540284322887, "text": "I am sorry that you had a less than perfect experience. Could you provide more detail? I cannot find any variation of your name in our system. Are you sure the device was serviced with us? We have not had any issues that would result in a review like this and I would really like to know why it was not resolved. Customer satisfaction is above all else. Our goal is make sure that you as a customer, get a quality repair, at a fair price, and that you leave with a smile on your face. If we fell short of this, I will make it right. Please contact me, Clint Silver, the owner. Call me at the office anytime."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100058643864025140064", "name": "Tom Brannon", "time": 1537194175525, "rating": 5.0, "text": "I dropped of a very old laptop computer that I used oveseas in Afghanistan and in the Middle Ease.  It has not worked for several years.  Wanted it resuscitated to use in a craftfair.  The system did not recognize USB ports or a network.  I explained this to Clint and Sean.  They quoted me a very reasonable price and repaired my system.  It is rare that people do what they say.  ProTek is one company that does.  They are honest, thorough and very fair with pricing.  Well done.  Tom Brannon///", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111890923153859360529", "name": "David Grimes", "time": 1469731739729, "rating": 5.0, "text": "Quick service and excellent work.  Quite a bit cheaper than Apple Retailers.  Also guaranteed their work for a year.\n\nReplaced broken IPAD Air screen\n\nI agree.  I would give then 10 stars out of 5", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106627516507435284484", "name": "William Hinely", "time": 1560786152198, "rating": 4.0, "text": "Ownership here actually seems to care about customer satisfaction and followup.. A rarity these days..", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115314087779684068426", "name": "Sheila Newsome", "time": 1579828223636, "rating": 5.0, "text": "Protek is great!!!! They do amazing work and they are very affordable!!!!!!!", "pics": null, "resp": {"time": 1620245763712, "text": "Thanks for the rating and review Sheila Newsome, hope your doing well!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "107163622722643815979", "name": "Definitely not Cyndri the Meme Queen", "time": 1475045088812, "rating": 5.0, "text": "Absolutely amazing! They were very knowledgeable about what was wrong and the gentleman there fixed the problems that another company had messed up in no time!\n\nCertainly coming back for all future computer needs!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111853073144176935283", "name": "Steven Northover", "time": 1578843416773, "rating": 5.0, "text": "ProTek solved my problem at a good price.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106317642995754637614", "name": "Linda Muzquiz", "time": 1446157753713, "rating": 5.0, "text": "Very satisfied customer! The ProTek staff helped when my all-in-one started making strange noises. They trouble-shot the problem, made the necessary repairs, and repaired it for me. They did this while keeping me appraised of the situation and getting my approval before making any repairs. While they had it, they removed all the viruses and made sure all was in tip top shape for me! I'm very grateful for ProTek, their professionalism and expertise will ensure I return when ever I need their services.  Thanks!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112416281596246759463", "name": "Aaron Werth", "time": 1428698905508, "rating": 5.0, "text": "Great prices! Fast service and they were able to get the data off my computer even after GeekSquad couldn't!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109133256948550956225", "name": "Roy Long", "time": 1540553894086, "rating": 5.0, "text": "I broke the glass screen on my Samsung tablèt.  ProTekfixed ìt professioñally, effectively and I will take all my electronaĺ communicatiomal needs.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104640990463227319598", "name": "Cavana Faithwalker", "time": 1562169108478, "rating": 5.0, "text": "Ok this is my 2nd review (4th July week 2019) . ProTek is on fleek.  They are even more awesome than the first time I went here.  To my review below I have to add 'attention to detail.'  Ha! A resume builder for sure, right?  I love getting updates by email and text, receipts by the aforementioned.  I missed all this running around busy treading water... they called me left a message... Some other reviews said they are very inexpensive.  If they doubled rates I'd probably still go here... shhh, our secret.\nVery professional, knowledgeable, communicative, friendly. Called me with updates on ordered parts. Right now my new go-to guys. Exceedingly happy with them.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113488180752670838797", "name": "Lisa Linville", "time": 1577039769129, "rating": 5.0, "text": "Fast, friendly service.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106962768048517405804", "name": "Wade Chatam", "time": 1405807875128, "rating": 5.0, "text": "They've replaced cracked screens on my Android phone and iPad. They typically have same-day service, and they were very friendly. I would definitely go there again for computer or gadget repairs.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "105529531375905191367", "name": "Stephen Cushman", "time": 1442176823535, "rating": 5.0, "text": "Prompt, reliable work at a reasonable rate. They warranty their work and provide accurate and honest feedback. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106715888522489825166", "name": "Renee Johnson", "time": 1556208942052, "rating": 5.0, "text": "Great customer service and prompt with repairing!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116502005059657737092", "name": "Tamika Brown", "time": 1406045672179, "rating": 5.0, "text": "The technicians new their craft. They have fixed more than one of my computers. The prices are very reasonable and they work in a timely manner. I would recommend them.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111750164973301894639", "name": "Jason McDaniel", "time": 1507204133721, "rating": 5.0, "text": "Quality work and reasonable prices. They stay quite busy but turnaround time is fast.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "108721571456155202929", "name": "Patricia Bondor", "time": 1405947274307, "rating": 5.0, "text": "EVERY time I've used ProTek they have been outstanding! I cannot recommend them highly enough!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102763208901451175463", "name": "Stephen Pittman", "time": 1532228740973, "rating": 5.0, "text": "I cant say thank you enough to protek. They were extremely helpful my when laptop wouldnt turn on. They ordered the part i need in alomst no time at all and when that didnt fix the problem with me trying to install it they took it back and had it fixed in less than 24 no questions asked! I had given up after weeks of trying trying to figure it out myself. And no patronizing me for messing it up! And it didnt cost me an arm and a leg! I would never take my devices else where! They will take care of you and never let you down. Thank you protek!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111034384047879029053", "name": "kamryn locke", "time": 1573089999300, "rating": 5.0, "text": "simple, quick, professional and reasonably priced", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109929702893442399036", "name": "Karen Tolles", "time": 1441224990246, "rating": 5.0, "text": "I was referred to ProTek by another company and Tyler went above and beyond the call of duty to help me with my son's cell phone.  I will be doing more business with them in the future and I will be referring everyone I know to them.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "100800629418196089783", "name": "Michael St. Peter", "time": 1363807828033, "rating": 5.0, "text": "My Toshiba laptop crashed, and I thought I was going to have to buy a new one.  Clint and his team at Pro Tek  discovered the problem, recovered all of my valuable data off the hard drive, and had the computer back to me in a timely fashion.  The charges were very reasonable and saved me a lot of money compared to buying a new laptop.  I highly recommend Pro Tek.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111305134837305978087", "name": "Carl Steele", "time": 1444411514087, "rating": 5.0, "text": "I randomly googled \"iPhone repair\" and this was the top hit. It turned out to be the best option. I don't get many tech repairs, but this now my go to spot.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "105669549240024124372", "name": "Matthew Durkovich", "time": 1523999589194, "rating": 5.0, "text": "Top notch company - super fast results!  My M.2 SSD work hard drive crashed, and after my own IT dep't couldn't fix it, I took it in and it was ALL recovered!  Losing data is very stressful, and these guys were very good at explaining everything.  They returned my call promptly, reminded me that they close at 7pm and were not trying to rush me into seeing them the next day, and offered to assess my hard drive w/out charging me.  In about 5 minutes he came back and said it was all there, and then explained the difference between the $150 cost, and the $300 cost.  basically if I wanted 40GB of files in one folder, it was $150.  if I wanted it to look like it did (folder structure) before the crash, it woudl take more time and therefore $300.  Best extra $150 I have ever spent!  They found info from several previous users, which I'm sure my IT dep't will be thrilled with, lol.  They were great to communicate with, no suprises, met all my expectations, and delivered.  I will go back to them ANY time I need something recovered (or break my phone - didn't even know they fixed phones).  Thanks ProTek!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111988559402578675500", "name": "Gerald Marotta", "time": 1451330205070, "rating": 5.0, "text": "These guys replaced cracked screens on my wife's Samsung smartphone and on my 8\" tablet.  Both not \"the usual\" screen replacements.  On the tablet, they tracked down the glass replacement and ordered it from China.  No other local technicians would go through that much trouble.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112793364191185664223", "name": "Scott Dickinson", "time": 1436747326988, "rating": 5.0, "text": "Ever get that sick feeling in your stomach when you've messed something up? That was me. I had taken apart my laptop because of excessive dust on the fan and the put it back together incorrectly. Seeing an ad for a national company in Huntsville that did computer repair I took it there. 3 weeks later and I get a call that says they can't fix it locally and need to send it off, $75 please.\n\nDiscouraged, I collect my laptop and buy a new one. But then I realize I need documents that were stored locally on the old laptop. So searching the internet, I find ProTek. I call and they tell me they can recover my  data.\n\nSo I bring my old laptop and then they say, hey, can we try and fix it? Sure, I say. One week later, they've fixed my laptop, and it's up and running for less then what I paid for a new laptop!\n\nFantastic work! So before you take it to a national place, give the local guys at ProTek a chance to fix your laptop! You won't regret it !", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114228528434503805015", "name": "Chad Adams", "time": 1493067204291, "rating": 5.0, "text": "Good prices and skilled techs. Solved my issue very promptly.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104688021130834362764", "name": "Valencia Cain Battle", "time": 1554979832678, "rating": 4.0, "text": "Good people that knows how to service.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106007966231879213426", "name": "william woods", "time": 1493635360066, "rating": 4.0, "text": "Took my wifes laptop in for repair, they fixed the on/off button. Brought it home and it worked 2 hrs and it wouldn't charge. Had to take it back in and come to find out they said the charge port was\"loose\"...lol. Fixed that now the headphone jack doesn't work. Guess it's \"loose\" too..lol. Everything was perfect before they got  it. Just a quick update, The same day i posted this Clint called me and was very eager to repair the laptop. I took it back in and he repaired the laptop himself. I am very satisfied now and would not hesitate taking anything to them again.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "111790973524994395803", "name": "Andy Scott", "time": 1427408514055, "rating": 5.0, "text": "Very professional, fast, and reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109271549182366534198", "name": "Brian Ham", "time": 1405723528195, "rating": 5.0, "text": "These guys are very good, quick and precise with phone repairs and very knowledgeable and honest as well.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "115977666183159630217", "name": "Jacob van Akin", "time": 1331310357078, "rating": 5.0, "text": "Computer wouldn't boot, Clint found and fixed the problem, got it working like brand new again. Nice guy, good prices.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "109958127130543341375", "name": "Dave", "time": 1548517332435, "rating": 5.0, "text": "Excellent customer service, quick turnaround.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117648943083341388802", "name": "Brandon Dixon", "time": 1347225323945, "rating": 5.0, "text": "Great service, Clint works to get the best price on parts and does a great job fixing the problem. I would HIGHLY recommend Pro Tek.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113891000742642908711", "name": "Kevin Mcghaw", "time": 1444433287143, "rating": 5.0, "text": "Tyler was a great technician.  He helped us out a lot. He replaced my iPhone screen same day.\n--KJ McGhaw", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "107079917667617868336", "name": "Ron Burgundy", "time": 1442272302704, "rating": 5.0, "text": "Awesome store and a man of his word. Great service, great speed, great knowledge", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113868009142476012607", "name": "Daniel Tubbs", "time": 1500508983085, "rating": 5.0, "text": "I like the owner. He's a cool, very professional guy.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "104422311962173514948", "name": "Patrice Majewski", "time": 1444853702422, "rating": 5.0, "text": "Came in for the first time to get a Samsung Galaxy 4 camera repaired and a new battery for my HTC 1 Max. Tyler was very friendly, professional and knowledgable. He discussed the prices for parts/labor, and it was very affordable. Would suggest to others for any electronic repairs.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106778725497323409004", "name": "West Madison Veterinary Hospital and Pet Resort", "time": 1426800590098, "rating": 4.0, "text": "We have been working with Protek for almost 3 years. The company's employees are very friendly, accommodating and quick to answer any questions we may have. They are also very knowledgeable and well rounded when it comes to electronic care. Sometimes the emergency response time can be a bit longer than anticipated, but they are a small company and it is understandable in most instances. Protek's prices are highly competitive with other companies in the area. Thank you Protek for taking care of us!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113834699179948224171", "name": "Alex White (ThatAlexWhite)", "time": 1405950774178, "rating": 5.0, "text": "These guys have repaired two of my phone screens. Their prices are more than fair, and their work is flawless and fast!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "112338559575724411653", "name": "Vicki Hargrave", "time": 1406410810475, "rating": 5.0, "text": "After having trouble with my computer and Protek repairing it, I still had problems but Protek repaired it at no cost even after my warranty had expired.  I would recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "116890015472450843814", "name": "Lloyd Newman", "time": 1567012648790, "rating": 5.0, "text": "Courteous, knowledgeable service!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "114511972135718904968", "name": "Yarp Yarp", "time": 1522444189881, "rating": 5.0, "text": "So much better then geeksquad", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106562259216624605234", "name": "Chelsea Pickett", "time": 1559693468747, "rating": 5.0, "text": "They were unable to fix the SIM card error on my phone but they were very upfront about the costs so I knew what I was getting into if the phone was unfixable (the error likely had something to do with me dropping my phone into the bathtub!).", "pics": null, "resp": {"time": 1559920864007, "text": "Hello Chelsea Pickett, thanks so much for the review! We always try to be upfront about estimates on repair cost and results."}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "113434142754857681779", "name": "Wanda Fry", "time": 1406511823032, "rating": 5.0, "text": "The technician was wonderful, the service excellent, pricing very competitive......this place gets 5 STARS PLUS FROM ME!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "110501738295177259169", "name": "Amber Bunch", "time": 1506662100641, "rating": 5.0, "text": "Fixed my S5 really quickly", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117247823716051677765", "name": "donhn Nelson", "time": 1565827756054, "rating": 5.0, "text": "Delivered on time and performed as expected", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106449023782023627789", "name": "Paul Leo", "time": 1582827522345, "rating": 5.0, "text": "computer was ready when promised", "pics": null, "resp": {"time": 1620244356926, "text": "Thanks for the rating and review Paul Leo, we always try to get customers devices back to them as soon as possible!"}, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "117556637897184064423", "name": "Michael Mcclellan", "time": 1515950052000, "rating": 5.0, "text": "Nice people, helpful and resourceful", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "118368793799730572856", "name": "Emily Stephenson", "time": 1501436449527, "rating": 5.0, "text": "These gentlemen were extremely accommodating to my needs as a customer, and they fixed my phone in a matter of minutes. They did an excellent job, and I would highly recommend them to anyone needing phone repair.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "108179446484399390958", "name": "James Alex", "time": 1479520973422, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "106545509417643021918", "name": "Lindsey Hohn", "time": 1481831259310, "rating": 5.0, "text": "Fixed my phone with no problem!!!! Great experience!!!!! Highly recommend!!!!!", "pics": null, "resp": null, "gmap_id": "0x886268c27f02ac7b:0xf37cf7fc81bd790a"}
{"user_id": "102635338841794438587", "name": "B.J Killings", "time": 1582173049807, "rating": 4.0, "text": "He has a really good set up a lot of fish bait and live minnows you can't find them very often anymore reasonable prices and he's really nice", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "117236004234624846336", "name": "Debra Sue Loyd", "time": 1573959043655, "rating": 5.0, "text": "Small yet adequately stocked. Lots of bait, minnow, crickets, shiners worms... helpful and informative about the area.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "101526434571332780606", "name": "Gail Ezekiel", "time": 1590429823728, "rating": 1.0, "text": "Tony was rude. No signs showing where you could park.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "113090035060383097827", "name": "Julia Sibley", "time": 1602713432237, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "108445037632021071950", "name": "Nicole Maddox", "time": 1533940206420, "rating": 5.0, "text": "Great place. MR. Tony is is also great a fixing computers! He has helped me many times!", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "109830509533651058572", "name": "Grant Marcum", "time": 1572449855693, "rating": 5.0, "text": "Always great bait and tackle!", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "102638095437407082841", "name": "Brad Godwin", "time": 1549231693980, "rating": 5.0, "text": "Best place in gantt to get your bait", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "109832686344583413524", "name": "Jessica Byrd", "time": 1571518248134, "rating": 4.0, "text": "High quality worms.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "103023398907095825812", "name": "Ronnie Grissett", "time": 1563745555137, "rating": 4.0, "text": "Place for good bait..", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "110921894698890164272", "name": "T Moser", "time": 1555976793343, "rating": 5.0, "text": "Good friendly service.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "109344253013659175383", "name": "Rochele Turner", "time": 1511326098121, "rating": 5.0, "text": "My family owns it", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
