{"user_id": "113324093654138982602", "name": "Mark Acker", "time": 1628543536430, "rating": 4.0, "text": "Eli and his crew were excellent to work with as well as Bill and his expertise. We had a few bumps in the beginning but the sign of a good company (in my opinion) is how they address any issues while leaving everyone more than satisfied. Job well done!", "pics": null, "resp": null, "gmap_id": "0x889a43f217dd7cf9:0xf3785a56a3bde213"}
{"user_id": "112169472035051733994", "name": "Stone Interiors Alabama", "time": 1562181105957, "rating": 5.0, "text": "Everyone we've worked with has been incredibly knowledgeable and professional. Truly a must-see for anyone looking for home design inspiration.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6Z1GRIKRNRan_tZ4IrEx5t_Js6-GCGAfiIFgA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMBJkI5KLUT2RwzWuo653EJMF6HxwwvTkzXTUN4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNyjgMQ-aI_a3MyBJQbrCPguGJ-4NiiQg4kdKgl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a43f217dd7cf9:0xf3785a56a3bde213"}
{"user_id": "109339524910335298568", "name": "Bill Hart", "time": 1628256285027, "rating": 5.0, "text": "Great cabinet options, beautiful Gallery!", "pics": null, "resp": null, "gmap_id": "0x889a43f217dd7cf9:0xf3785a56a3bde213"}
{"user_id": "109819065910185540589", "name": "Daniel b Ryland", "time": 1623282184785, "rating": 4.0, "text": "Looks good", "pics": null, "resp": null, "gmap_id": "0x889a43f217dd7cf9:0xf3785a56a3bde213"}
{"user_id": "108467284251340432647", "name": "Troy Bookout", "time": 1576254563963, "rating": 5.0, "text": "Great place. Tim was very informative.   Lots of varying products.", "pics": null, "resp": null, "gmap_id": "0x889a43f217dd7cf9:0xf3785a56a3bde213"}
{"user_id": "113874736853994386666", "name": "BRIAN ARMSTRONG", "time": 1568944159421, "rating": 5.0, "text": "Very nice show room. Ask for Kara!", "pics": null, "resp": null, "gmap_id": "0x889a43f217dd7cf9:0xf3785a56a3bde213"}
{"user_id": "115948221091947785112", "name": "Tom Treece", "time": 1585671296452, "rating": 5.0, "text": "Our company asked Christy's to do a job for us.  Christy's exceeded ALL our expectations.  They did an excellent job, did it promptly, and cleaned up.  We are fortunate to have such a high quality flooring company in Hazel Green.  We recommend Christy's to everyone and will call them for all future flooring work we have.  Thank you to Christy and her staff!", "pics": null, "resp": null, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "110735182034586184954", "name": "Kristin Wilt", "time": 1582644882946, "rating": 5.0, "text": "Amazing customer service! I went in for the first time last Friday and Christy was SO helpful and so friendly. She answered all of my questions before I even knew how to ask them! Looking forward to working with them! Highly recommend if you are looking for someone that knows their stuff and is just so down to earth.", "pics": null, "resp": null, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "112126223798197805728", "name": "Tricia Darty", "time": 1523047146302, "rating": 5.0, "text": "Bought flooring from Christy's Flooring today. Great prices and quality. Excellent customer service. Would highly recommend this.business!", "pics": null, "resp": {"time": 1560975836594, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "102400344311052120254", "name": "Coach Pat", "time": 1530054715529, "rating": 5.0, "text": "By far the best in the business. She treats you like family and she's much more knowledgeable than others in this field. I won't buy anywhere else.", "pics": null, "resp": {"time": 1560975809910, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "106180981586482005134", "name": "lars lars", "time": 1554695746769, "rating": 4.0, "text": "Good folks to talk to and get flooring options and ideas.  Reasonably priced flooring", "pics": null, "resp": {"time": 1554838362793, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "101224781344780065704", "name": "Melissa Pogue", "time": 1532541183470, "rating": 5.0, "text": "Great customer service!  Christy is great to work with.  She has a great selection, eager to help, and is generous to her community!  Buy local!", "pics": null, "resp": {"time": 1560975794354, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "116786502049201602745", "name": "Greg Duke", "time": 1498184531880, "rating": 5.0, "text": "We have used Christy thrice now for carpet and vinyl. She does great business and employs excellent installers. Can't beat the quality and price!", "pics": null, "resp": {"time": 1560975847612, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "104384950711824293984", "name": "Terrie Quick", "time": 1485270735527, "rating": 5.0, "text": "Really nice flooring and extra good people... give them a call or go check out what this store has to offer!", "pics": null, "resp": {"time": 1560975860176, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "113153876885184886339", "name": "Ray Roland", "time": 1563755253003, "rating": 5.0, "text": "Best place to buy flooring", "pics": null, "resp": null, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "107271517859449854400", "name": "EVERYTHING CHILDERS", "time": 1556047117552, "rating": 5.0, "text": "Nice", "pics": null, "resp": {"time": 1560975742390, "text": "Thank You"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "106147665331139143639", "name": "Ken Maddox", "time": 1543341099939, "rating": 5.0, "text": "👍👍", "pics": null, "resp": {"time": 1560975758399, "text": "Thank you"}, "gmap_id": "0x8862463a49dd2c45:0xc09f927f9ce26943"}
{"user_id": "107667774277810944570", "name": "Dustin Shannon", "time": 1573796898740, "rating": 4.0, "text": "Robin Evans is a great person and knows all types of cabinetry. She made me feel welcome and the service was flawless. I did choose to buy Cabinets else where due to I needed cabinets sooner rather than later.", "pics": null, "resp": null, "gmap_id": "0x886214b3c100ff11:0x1863458fe2279f33"}
{"user_id": "107451092853362278859", "name": "Brenda Barnes", "time": 1599418776129, "rating": 5.0, "text": "Very nice cabinets and take the time to work with you", "pics": null, "resp": null, "gmap_id": "0x889a621c8c0f47c9:0x34740ae232204f8a"}
{"user_id": "106097205868590150548", "name": "Wayne Lewis", "time": 1561474565284, "rating": 1.0, "text": "Was not help for", "pics": null, "resp": null, "gmap_id": "0x889a621c8c0f47c9:0x34740ae232204f8a"}
{"user_id": "115847838105166143071", "name": "John Briscoe", "time": 1613592359186, "rating": 5.0, "text": "Purchased tile and plumbing from Pro-Source outstanding experience. Scottie English was sales person she made it flow smooth and easy like purchased should.", "pics": null, "resp": null, "gmap_id": "0x88626518e2344e1f:0xad1f66142fd6ae3"}
{"user_id": "104572127393221014078", "name": "Proud Parent", "time": 1601432536202, "rating": 5.0, "text": "I bought cabinets from ProSource at the end of August. The date of install would be Sept 1st - 5th. I am still waiting on Sept 25th for the cabinets to arrive. No date can be given... I have told them I am waiting to sell the house and the cabinets are costing me the mortgage. How long will I have to wait? No one can tell me. I have several interested buyers in the home right now. This company does not care about you or your project.\n\n***UPDATE SEPT 29TH***\nI had the pleasure to work with Trent a ProSource employee. He was great to find the answers for me that I did not have. I had the company delivering the cabinets calling me providing me updates directly. As a customer if I could go through ProSource myself I would. I appreciate the follow through.", "pics": null, "resp": {"time": 1601049127750, "text": "Hello,\nThank you for taking the time to leave us a review. Client and member satisfaction is our top priority and we’re happy we were able to get in contact with you to discuss finding a resolution. We appreciate your feedback and communication with the showroom as well as your patience and understanding."}, "gmap_id": "0x88626518e2344e1f:0xad1f66142fd6ae3"}
{"user_id": "107212337553056573441", "name": "Brad McClellan", "time": 1603738098742, "rating": 5.0, "text": "Large selection. Not pushy salespeople. Knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88626518e2344e1f:0xad1f66142fd6ae3"}
{"user_id": "101724120657508604841", "name": "Nick Kcin", "time": 1618698486952, "rating": 1.0, "text": "No good, would not recommend. I was sold on the panel flooring we have being pulled up to repair the areas were gaps were located, this wasn't done. All the crew did was squirt glue into the gaps and jam them forward to join them. This resulted in not all the gaps being fixed, and the ones glued a few of them have mounds of dried glue sticking out.  The flooring that was placed was fine, but the 1/4 round wasn't painted/stained on the cut ends, the transitions were nailed in (which is fine) leaving  sharp nail heads sticking up which would easily cut a foot. I guess this job would have been ok if it was cheap but it was not.", "pics": null, "resp": {"time": 1619991132379, "text": "We're sorry to hear this. We know that our team went out and tried to fix your older flooring but put in new flooring that you loved. Please give us a call and we can help you out, thanks!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "115909813805842053388", "name": "Beth Eddings", "time": 1579795795104, "rating": 5.0, "text": "I cannot share enough good things about our experiences with Hill's. The quality of their work is wonderful and they stand behind it. We purchased some beautiful tile from them in 2016 transforming our kitchen and bath, and then in 2018 returned to purchase all new bedroom carpet before our daughter was born. Each time we've been presented with affordable options that are still of high quality and any time someone we know is looking for flooring I recommend Hill's in Hueytown. They offer all the same products as flooring places in Birmingham but at a fraction of the price due to being a small family shop.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP6plsnL2MBk9j1lnayZf3BQyb0JYEe1UzZRjdK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4pd3cExhhMfIVa8hzL9RxV2Q2LGRG8Ua6Q2Zl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhEyth0WtMPEpt4vOpZe8KLMXCqgK6RhqCE8dl=w150-h150-k-no-p"]}], "resp": {"time": 1579801051252, "text": "Thank you so much for your lovely review, Beth! Come see us anytime and we're so pleased you're happy!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "103611507111797857431", "name": "Debbie Kleist", "time": 1615165893630, "rating": 5.0, "text": "I highly recommend Hill's Carpet and Floor Coverings. The technicians arrived exactly when they told me they would, were experienced and efficient in their work and finished flooring my entire house in 2 days. They were neat and courteous as they worked. My floor looks beautiful and the price was reasonable. If you need flooring work in Hueytown, Hill's is the company to call.", "pics": null, "resp": {"time": 1615317257450, "text": "Thank you so much, Mrs.Kleist! Come back and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "107612078775520848674", "name": "Greg Marlin", "time": 1620927031680, "rating": 5.0, "text": "I've been using Mr. Hill since the early '90's. Prices are always reasonable, products are great, & installs always go well. I would highly recommend!!", "pics": null, "resp": {"time": 1620928435893, "text": "Thanks so much for your review!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "101765987170228550966", "name": "Diane C", "time": 1620857837829, "rating": 1.0, "text": "I had a terrible experience and would not recommend or use them again. A 1 day installation turned into 5 visits to my home, they have not corrected everything they messed up, and they destroyed all the door frames. They tell you they've have been in business for a long time, but the owners are not the same, and neither is the quality of work.", "pics": null, "resp": {"time": 1621549762181, "text": "We have been patient in our reply and have decided it is time to respond since you will not take our repeated calls. We understand your frustration with the initial installation of your flooring which resulted in our decision to terminate the original contractor. Obviously we were frustrated as well and we spoke with you at length over the phone about this. The errors he made have been corrected.  You called again with concern that the carpet was not fastened correctly in one area and, though after inspecting we determined there wasn't a problem, we still agreed to have a contractor come and re-stretch it in an effort to resolve your concern.  We disagree that \"they destroyed all the door frames\".  Yes, there was some slight damage done to some of the door frames but they were far from being \"destroyed\".  Your salesman offered to repaint those areas himself but you declined.  We have gone as far as discounting your invoice three times in an effort to appease you.  We have a two year labor warranty and we stand behind it.  The quality of work performed by subsequent contractors to correct the errors of the first was excellent.  Hill's Carpet & Floor Coverings has been in business at our main location since 1986.  The original owner sold the business to his nephew some 9 years ago and the original owner remains active in the business.  We are proud of our history of serving the greater Birmingham area by offering quality products, competitive prices, and professional installation.  We're proud of and humbled by so many positive reviews on line.  We recognize that the original installation fell short of the last standard and we have tried diligently to work with you to resolve your remaining issue."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "104152490812992711519", "name": "Kelly Finnegan", "time": 1583971964168, "rating": 5.0, "text": "We chose to go with Hill’s over a box store like Home Depot or Lowes and we are so glad we did. They were so incredibly helpful throughout the whole process. They let us take home several samples until we found the right one. They explained the different types of carpets and the benefits of each one. Mr Hill personally came out and measured and quoted the room. Installers were right on time and worked quickly and did such a wonderful job. We love our carpet and plan to use Hill’s in the future when we redo our kitchen flooring.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMXlxBjultxUS-3o2DixTf50hi9nC2MXS3VKrKk=w150-h150-k-no-p"]}], "resp": {"time": 1583976092635, "text": "Wow! Thank you so much for your honest review! We really do take pride in doing our best to bring beauty to your home without the hassle. Remember us and come back to see us anytime! Thanks again!!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "108978733634757155129", "name": "Maria Holmes", "time": 1602725658143, "rating": 2.0, "text": "FYI LONG REVIEW: I originally contacted Hill's back in Aug to refinish our hardwood floors. Very pleasant experience with Clark with setting up my consultation. Cullen came out and did the consultation with me and my husband. It went well, and the price was very reasonable. He advised me that he would email me the proposal and to call him when we were ready.\n\nI waited for the email but never received it. However, I still called a week later and let him know we were ready to schedule but that I still haven't received the proposal email. I didn't feel comfortable calling to pay my deposit over the phone without a proposal. He wasn't at the office when I called but was going to call once he got settled. When he finally called, I wasn't available but I still didn't get a proposal email.\n\nSo I waited before calling back. Then Clark called and left a msg asking if my consultation went well and if I was ready to schedule. At that time I was not because I wanted the proposal on paper with the amount I was quoted. Never heard back.\n\nSo I called again Monday, 10/12 and spoke with a gentleman about scheduling (yes I was still willing to use this company because the price I was quoted was the best). He got my name and address and tried to look up an invoice or proposal and guess what, there was none!! He asked who did my consultation and I told him Cullen. He said he would get him to call me. Days later, I'm still waiting on my call.\n\nThe other 2 companies I've contacted this week have been very responsive and gotten me proposals within the same day of the consultation. I'd rather pay the extra $ for great customer service and communication.", "pics": null, "resp": {"time": 1602795297698, "text": "Ms. Holmes, your experience with our company is very regrettable.  We strive to establish a meaningful relationship with all our customers resulting in a satisfying experience throughout the purchasing process.  It is unfortunate that in your case we failed to do that and we apologize.  Having been in business in the greater Birmingham area since 1987 we're very humbled and gratified by the excellent rankings we have on social media on Facebook, Google, and the Better Business Bureau.  We appreciate your candidness and again, apologize for not exceeding your expectations.  Your review is a reminder of the importance of delivering a satisfying experience for each and every potential customer every day."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "114211389125518569156", "name": "S", "time": 1600716591991, "rating": 5.0, "text": "After years of contemplation I finally decided to get my floors redone. I went with the Mohawk LVP and am thoroughly pleased with the installation and customer service received from Hill's Carpet and Flooring (Helena). I am pretty particular about everything, and Cullen (sales) was very patient with my indecisiveness and worked with me on figuring out what would make me happy. The install crew was prompt, super efficient, and extremely professional.  They exceeded my expectations, especially with cleaning up, and returning things to their original place. If you want good old fashioned customer service then you should definitely check them out!", "pics": null, "resp": {"time": 1600720283702, "text": "Thank you so much for your awesome review and for being such an awesome customer! Come and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "100427760477639652845", "name": "Chris Jennings", "time": 1585614258092, "rating": 5.0, "text": "Excellent customer service from the estimate appointment till the completion of the job. Great prices and excellent workers. Very pleased.", "pics": null, "resp": {"time": 1588438845675, "text": "Thank you so much for your review!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "113690369261329542299", "name": "Lanea Head", "time": 1626654048358, "rating": 5.0, "text": "👍", "pics": null, "resp": {"time": 1626713306661, "text": "Thanks for the review!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "108557876078336111425", "name": "Emmanuel Lewis", "time": 1575593753879, "rating": 5.0, "text": "These guys are fantastic. 👌 Just had my floors put in! Nice easy and to the point. No B.S. and the free estimate and consultation was just what I needed with my busy schedule. A++", "pics": null, "resp": {"time": 1575931658033, "text": "Thanks for the review Mr. Lewis!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "107846925040834145442", "name": "Candie L Walton", "time": 1568074191892, "rating": 5.0, "text": "Great Company! Bill has been good to work with concerning my flooring issues.  Guys came out and did a superb job installing my new carpet.  I will definitely go back to Hill's Carpet and Flooring with all my flooring needs", "pics": null, "resp": {"time": 1568076927338, "text": "Thank you so much for your business and for such a great review! It was a pleasure working with you! 😃"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "118130945719269653841", "name": "Prince Homebuilders inc", "time": 1501378069942, "rating": 5.0, "text": "Great work on all of our homes.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-20WSgKBtmNajMRqLLUj615aM7kKiTiYUvkg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQfG8HENIGWCjW1EHmmdnCX5jl7OI4N-OqdVg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPsdpnJPubiQ0_mC1r-M6icQsn532HaV8pp12g=w150-h150-k-no-p"]}], "resp": {"time": 1555352678626, "text": "Thank you for the awesome rating! We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "116404737303652503120", "name": "Kathy Andrews", "time": 1559915480332, "rating": 5.0, "text": "Hill's recently installed Milliken carpet on our stairs and master bedroom closets.  They also installed Harris wood flooring in our upstairs bonus room. Their installation crews are professionals, doing a great job. Thank you so much! I definitely recommend them.", "pics": null, "resp": {"time": 1559921114335, "text": "Thank you so much Mrs. Andrews! We always look forward to doing our best and we truly appreciate your business! Thanks again and come see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "101218801385641254555", "name": "Katherine A. Higgins", "time": 1557169316686, "rating": 5.0, "text": "Hill's Carpet & Flooring has a beautiful showroom full of a large variety of tile, luxury vinyl, and carpet.  Their staff is helpful and knowledgeable.  I recommend Hill's Carpet & Flooring.", "pics": null, "resp": {"time": 1557173149514, "text": "Thank you so much, Katherine! We hope to see you back again soon!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "111251483691155354022", "name": "jennifer hill", "time": 1567814861546, "rating": 5.0, "text": "Bill makes sure everything is done exactly like the customers want . Would recommend Hill's carpet to anyone.", "pics": null, "resp": {"time": 1567816184784, "text": "Thank you so much for your review! It's so good to hear! And as always we sure do appreciate your business."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "114075508103934587162", "name": "Dean Ethridge", "time": 1487981992919, "rating": 5.0, "text": "These guys have great flooring products not found in most area flooring stores.  From lower priced to higher end, you'll find something that looks great in your home. Very happy with our new floor!", "pics": null, "resp": {"time": 1555352695711, "text": "Thank you for the awesome rating! We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "115124280332197152666", "name": "Kyle W.", "time": 1499295597274, "rating": 5.0, "text": "Scott & his crew did a fantastic job pulling old carpet and refinishing old hardwoods. He later replaced my  parquet flooring and seamlessly matched the remainder of the house.  Would highly recommend!", "pics": null, "resp": {"time": 1555352684905, "text": "Thank you for the awesome rating! We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "112766756259032719716", "name": "Christie Armstrong", "time": 1567892738623, "rating": 5.0, "text": "great people, great customer service.  I recommend Hill's for your flooring needs.", "pics": null, "resp": {"time": 1567894020140, "text": "Thank you so much Christie! As always we sure do appreciate your business!! Thank you!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "110945175042342373363", "name": "greg pennington", "time": 1599827085826, "rating": 5.0, "text": "Great local flooring company", "pics": null, "resp": {"time": 1599835811960, "text": "Thanks Greg! Come back and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "112067903751004246254", "name": "Scott Suell", "time": 1464458997850, "rating": 5.0, "text": "Dont know what happened on the last post but I could not be more satisfied!  Very professional and clean cut. Give em a try. You won't be sorry.\nThere's a reason they've been around so long. Thanks", "pics": null, "resp": {"time": 1555362376758, "text": "👍"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "117839155201107161329", "name": "Darrell Garrett", "time": 1559930952655, "rating": 5.0, "text": "Very professional and the guys went out there way to help me on issues that I had overlooked in the bid process. The job was complete in the correct time frame and looks amazing.", "pics": null, "resp": {"time": 1559931784325, "text": "Thank you so much, Darrell! It was an absolute pleasure. Come back and see us anytime!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "110184859492440163283", "name": "choppy praytor", "time": 1550859949299, "rating": 4.0, "text": "If u need flooring. They got a great choices", "pics": null, "resp": {"time": 1550936277654, "text": "Thank you for the nice rating. We've recently expanded our showroom in Hueytown, more than doubling the original size. This gives us the opportunity to display a lot more product lines which greatly expands choices."}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "106914497909440150309", "name": "Bill Green", "time": 1600013977158, "rating": 5.0, "text": "Great place!", "pics": null, "resp": {"time": 1600023641907, "text": "Thanks for the review Mr.Green!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "106446869546044400267", "name": "frank sebert", "time": 1458261043103, "rating": 1.0, "text": "Please do yourself and choose wisely before using Hill's, I used the Helena store and can not and would not use or recommend any Hill's seeing how they all the same owner and installers.\nI will tell you about my experience, The carpet is nice and seems to be installed well, this is not where the problem is and if you enjoy paying someone to rub paint off your walls and base boards then tell you\" well that just happens\" then you have found your place. My wife and I spent over an hour sweeping dusting and vacuuming after the installers left angry and in a hurry, when i told them I expected them to vacuum and clean what mess they made during the install, just got in the van and left?!\nI will tell you the salesman did at least get me a whole pint of paint so I could repaint what HILL'S CARPET should have taken care of, there wasn't even an offer to say \"hey how bout we at least knock of $20.00 or $25.00 for your time and trouble.\" Granted by what it would have taken to make this right it isn't a major deal, but do you really want to spend your hard earned money and have to clean up and paint a house you just cleaned and painted? Then be disrespected and talked down to in your own home? Please make a better choice than I did. There are many carpet stores in the area and I know most will appreciate your business,\nI can tell you for a fact unforunately that HILL'S CARPET will not.", "pics": null, "resp": {"time": 1555352888513, "text": "We're sorry for the bad service at the time but you may call us at our office anytime. Also thank you for rating honestly. We've recently expanded our showroom in Helena to display a lot more product lines which greatly expands choices and our crews are amazing! Come back and give us another chance to wow you! Thanks!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "100829791550852605265", "name": "rlmccullough", "time": 1596745526643, "rating": 5.0, "text": "They have flooring.", "pics": null, "resp": {"time": 1596749364329, "text": "Thanks for the five star review!!!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "104294954143446612344", "name": "Pedr0 Ram0s", "time": 1612884927960, "rating": 4.0, "text": "(Translated by Google) Okay everyone\n\n(Original)\nMuy bien todos", "pics": null, "resp": {"time": 1613407427890, "text": "thank you!"}, "gmap_id": "0x8888e658d00c7947:0x63e1001fc3410b5c"}
{"user_id": "108452318216825960510", "name": "Chris F", "time": 1613760104075, "rating": 5.0, "text": "Friendly people in good service.And they  always have what I need", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111629201481998458747", "name": "BJ Lawrence", "time": 1598628466675, "rating": 4.0, "text": "Very friendly, helpful, needed a board cut in two to haul and they cut with no charge.  Price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "110637748586957343285", "name": "Deborah Perry", "time": 1598722770036, "rating": 5.0, "text": "Great service . Prices very reasonable . Courtious staff.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "104508036459440389575", "name": "Patrick Erb", "time": 1577991419001, "rating": 5.0, "text": "They have really stepped up their game. Increased inventory a new-look on the interior with expanded products", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111189521876633652396", "name": "Sandi Stephenson", "time": 1552754928754, "rating": 3.0, "text": "The young boy help in us was really clueless about everything we asked and the guy at the register was rude like he didnt want to be there. Other than that it was ok.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "112552503212451880129", "name": "Danny Roberts", "time": 1540833581289, "rating": 5.0, "text": "If you need building materials and appliances at low prices check here first you will be back if you go anywhere else", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "102199070504581052250", "name": "Rodney Walker", "time": 1543781892163, "rating": 5.0, "text": "They have anything and everything you could want for home repair", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "106311822894182759034", "name": "Rodney Hopkins", "time": 1544925279169, "rating": 4.0, "text": "Good prices.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "113614425762119662166", "name": "onh pgfi", "time": 1610292115433, "rating": 5.0, "text": "Top notch wood work", "pics": null, "resp": null, "gmap_id": "0x888bfd624c9c6e5b:0x101e5551cad1ce66"}
{"user_id": "107429595978774481795", "name": "Leona Neill", "time": 1603780825935, "rating": 3.0, "text": "The place was definitely awesome.", "pics": null, "resp": null, "gmap_id": "0x888bfd624c9c6e5b:0x101e5551cad1ce66"}
{"user_id": "105217585834747210278", "name": "Kathy Pressley", "time": 1551844308086, "rating": 5.0, "text": "So talented!! Beautiful work and always takes time with customers! Definitely the place to go for beautiful cabinets and other woodworking pieces!!", "pics": null, "resp": null, "gmap_id": "0x888bfd624c9c6e5b:0x101e5551cad1ce66"}
{"user_id": "100611900425398886517", "name": "kim dkyoder5@yahoo.com", "time": 1568936642673, "rating": 5.0, "text": "Awesome workmanship! Great quality made custom cabinets", "pics": null, "resp": null, "gmap_id": "0x888bfd624c9c6e5b:0x101e5551cad1ce66"}
{"user_id": "105674566553969628934", "name": "Deirdre Gunn", "time": 1549668833133, "rating": 5.0, "text": "They are now working on a third piece of furniture for me. They are very honest, and do fantastic work!", "pics": null, "resp": null, "gmap_id": "0x888bfd624c9c6e5b:0x101e5551cad1ce66"}
{"user_id": "114503189470419906549", "name": "Carrie Rutledge", "time": 1555912407313, "rating": 5.0, "text": "Building a kitchen island and got great hardware at great prices!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOy4TmMW0RN1iJJTNX8_ed2tKPkV8_K7FRo4VKG=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628505249e61cf:0x9cbd4d41ec73f417"}
{"user_id": "105523427918582111108", "name": "Harold Burkett", "time": 1526522292242, "rating": 5.0, "text": "Brand new place that just opened. They carry a lot of higher end cabinet products and still cheaper than big box stores.", "pics": null, "resp": null, "gmap_id": "0x88628505249e61cf:0x9cbd4d41ec73f417"}
{"user_id": "102617453289178397822", "name": "MATTHEW TOLLER", "time": 1525875929388, "rating": 5.0, "text": "If you want the best quality and best service for all your cabinet hardware this should be your first stop", "pics": null, "resp": null, "gmap_id": "0x88628505249e61cf:0x9cbd4d41ec73f417"}
{"user_id": "106015993468339647334", "name": "Alabama Lucey", "time": 1625605787997, "rating": 4.0, "text": "We have done business here before and once again the employees were OUTSTANDING!  They even took us in the back to show us their kitchen flooring so we could have a better feel for what it would look like   Another place you have got to at least check out if you're in the market for flooring.  But they have other items also like tile for backsplashes.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOa7J9q9oz_cwGElMUoYY5WxI9giAtdNTRxc2Iz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpSqPk_GjNgJQm85iQTEty-JLP3O0GYNujC6Gt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCOmTUjh--5JyhRJ_HbT1LB1svllE8vDMBkFmS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx5M67YE5CKkUOIhgZKtHxJ4tj8ijCsGC4C2nV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMl_Aa1YoxxouFmdH61XXvRfqw_AAx-YUp5TW1x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLC59Evt1ECCI1aRnZyBlQ6b6hQmtL7GMGO3zt=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "102365181481903847186", "name": "Jordan Smith", "time": 1624489603446, "rating": 5.0, "text": "Blake was amazing! I wasn’t having much luck getting ANY responses (email, phone, etc) from other local flooring stores but Blake kept in touch and worked with us on getting us the BEST price and made the process SO easy!!!!! Will recommend to everyone I know, & be using them for all future needs!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108623454228907601944", "name": "Tracy Sedlack", "time": 1596936751352, "rating": 5.0, "text": "Needed a quick install to sell a house. Customer service was outstanding. Jim worked with me and helped find me a great deal on new flooring. Installed two days later and looks great. Can't thank Jim and the installers enough for the great service and help picking a great looking carpet for the whole house.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMpKyVmjjTRGL2BhgHTVdPCxGj_2qApomVQ0grX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPOgkyelpS4ASD8Cb2SJN0EFShjkMJU9x0sD3k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2cfp-PhD6aMVQj5vj6xMjqmXcdElZAi8xv1oU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109587481776307648339", "name": "Ashley Carson", "time": 1617127251867, "rating": 5.0, "text": "Most definitely a one stop shop!!! I am so very happy we chose American Flooring, Cabinet, and Granite to take care of all our needs in building our new home. My husband an I finally built our dream house this year;  we were treated like family from all the staff and installers from start to finish.  We did LVP flooring throughout it is absolutely gorgeous. They helped us pick out the perfect tile and accent pieces for our walk-in shower. The solid wood cabinets were just fantastic they went perfect with the quartzite we chose for the kitchen an master bath, it makes my heart beat fast, it's so beautiful. They have a large selection from all over he world, slabs I have never seen before anywhere.                                        I want to thank everyone there for making our experience a little less painful, anytime you build a house things come up and we were very pleased how they worked with us on our scheduling.  I highly recommend American Flooring, Cabinet, and Granite to all my family and friends. We are so very happy!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101412820628372191874", "name": "Melanie Lobel", "time": 1616004968202, "rating": 5.0, "text": "First visit to American Carpet and had the best experience picking out carpet. Johnny Marino was such a professional and assisted me with making great selections at a terrific price. They were able to meet my installation requirements immediately. The quality and service was so remarkable that I went back 2 days later and purchased gorgeous marble for my fireplace surround. What a pleasure doing business with American Carpet and Flooring. Definitely ask for Johnny. Great guy.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106852215908119072573", "name": "Tazman Reid.", "time": 1625695887269, "rating": 5.0, "text": "The sales lady was fantastic, she pretty much took care of everything over the phone, I went to the store and was out of there in 10 min.\nA 10 for Marisa !", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114570039299034401076", "name": "Gerald Drakeford", "time": 1614206391101, "rating": 5.0, "text": "Mr. Don Williams always has a warm smile and greeting each time we visit the store. Johnny facilitated our flooring and granite orders and was great to work with as well!\n\nWe had hardwood floors as well as granite countertops installed.  Glynn and his crew did a great job on the flooring. They were on time each day and were very attentive to details during the installation.\n\nLikewise, the guys that installed our granite countertops were top shelf as well, detail oriented, and very professional.\n\nWould definitely recommend American Carpets and Flooring!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106947545531976446298", "name": "Kishina Brown", "time": 1609199926737, "rating": 1.0, "text": "I was looking for purchasing new flooring for the rest of my house. I walked in with a large piece of carpet in hand to see what would look good with my new carpet. As I entered I was not greeted. I noticed three men in a corner talking and I walked close by and again never greeted. So I will not ever step foot in this store again.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101554162029775948900", "name": "James Sessions", "time": 1598480748262, "rating": 5.0, "text": "My wife and I decided to totally remodel our master bathroom which was a big deal for us.  After making visits to several stores and getting conflicting advice on what we could and should not do. We were so confused but knew how we wanted the new bathroom to look.   I suggested that we stop by American Flooring which we decided to be the last stop before leaving Mobile and head to Baldwin County or even Pensacola. American Flooring should have been our first stop.  We met Johnny Marino and shared with him what we wanted to see in our new and updated bathroom project.  He took our the contractor's proposal along with many pictures that my wife had gotten off the internet, how we wanted our new bathroom to look.  He provided us with expert advice.  He took the time to tell us what we needed.  He was more than a salesman... I considered him an expert in flooring.  We are so excited, we cannot wait until the job is completed.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105366377189058722485", "name": "Burchfield lc", "time": 1599342220206, "rating": 5.0, "text": "Great service from picking out flooring to the install! Highly recommend! They are a locally owned company with fantastic prices, I will be back next time!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111979773792994848010", "name": "Sandra Mikul", "time": 1594921337563, "rating": 5.0, "text": "Beautiful installation! Michael and Cliff were pleasant, efficient and we love the final product.  Glad we decided on new counters! Also, Robert gave us good advice on choosing colors while we were looking at the large inventory.  Thanks", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103804285607193038083", "name": "Daniel Garrido", "time": 1578984122599, "rating": 5.0, "text": "Amazing store to buy from, great people and service. Definitely recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN7-Ai_AbaCI-9EEmMmP-6-3R9zPf56mPGfyB2a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111964048522762970615", "name": "Ashley La Bounty", "time": 1597380561659, "rating": 5.0, "text": "Our experiences has been amazing!!! The quality flooring and staff is amazing. Had the pleasure of working with the owner himself and he make us feel right at home every time.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107245293847523842491", "name": "Quintin Wilder", "time": 1606336925435, "rating": 5.0, "text": "I only deliver packages to them but every time I go they always helping someone with a great attitude.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110002926730751455212", "name": "Stanley Self", "time": 1597330236110, "rating": 5.0, "text": "Great. Carpet and pad.  Wonderful flooring.   Installers were very friendly and respectful.  Salesman was very friendly and helpful.  Very satisfied.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117031730763445449523", "name": "Theresa Seibert", "time": 1590596225290, "rating": 5.0, "text": "American Flooring and Granite has impeccable customer service very knowledgeable on all the products.  I love the fact that they use a 15 year sealer on all the natural stones. They have a large selection to choose from. My counter tops are beautiful!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "118277219069483773175", "name": "Richard Moore", "time": 1575942723017, "rating": 1.0, "text": "NEVER AGAIN!\nThis level of incompetence is unfathomable. My installer calls me up to verify directions, ten minutes later one of the employees calls me to tell me \"We can't sell you this flooring\" ( That the salesman practically begged us to pay for weeks earlier) Half my house is on my porch and in my yard at this point. They had their third \"problem\" reported two days earlier but didn't bother to call the people who had bought any of it. The sales man was an absolute joke. I don't know whos brother-in-law he is but that is the ONLY way he could keep his job!\nThe Installers....were AWESOME! (Sub contracted).\nThis is only part of the issues I had....all I can say is,\nAmerican Flooring will NEVER get another dime from me.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101370247566958826845", "name": "Jesse Brewer", "time": 1502760071136, "rating": 5.0, "text": "We did a major  2 1/2 bathroom remodel at our home and American Flooring Cabinets & Granite did a great job! It was a pleasure working with  Jennifer who helped us pick out our porcelain tile and exotic granite.  It did not stop there she took the time to pick out the paint color that would compliment the exotic granite and porcelain tile.  The  selection of porcelain tile and granite options we viewed that day at American Flooring Cabinets & Granite was  top quality.  The workers did a top notch job.  At the completion of the job, Jennifer came out and looked over everything and made sure we were satisfied with everything.  All of our questions were answered.  Our future flooring projects will definitely be handled through American Flooring.", "pics": null, "resp": {"time": 1502807432418, "text": "Thank you, Jesse! Glad we could serve you!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115407434266322970944", "name": "Donna Dicken", "time": 1573583095201, "rating": 5.0, "text": "My husband and I are very please with the whole experience from buying our flooring to the two gentleman who put it in. They did a fantastic job. We LOVE our new floor. We recommend American Flooring, Cabinets & Granite and will use again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100871770003133492545", "name": "Steven Duquette", "time": 1506094777655, "rating": 5.0, "text": "I had a great experience at AFC&G from the minute I walked through the door until the minute the job was completed.  Don and Jennifer were so helpful throughout the entire process and what a selection of materials they have in the storeroom to choose from.  My granite counter tops and custom designed shower turned out like a showroom display.  Many thanks to Roland who did the design and installation.  Every measurement and cut he made was with laser precision.  I highly recommend you visit the showroom to see what they carry and talk with their very knowledgeable sales reps.", "pics": null, "resp": {"time": 1506095564974, "text": "Thank you Mr. Duquette! We loved the finished product and are glad to have you as a loyal customer! If you need anything at all, you know who to call."}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117510542557733207554", "name": "jay trammell", "time": 1559960940685, "rating": 1.0, "text": "Stay away from this place. Salesman that helped me was great. Owner is crazy to work with I was giving quote and come in to store and he changed it. Very low to do. Obviously does not care about business . This 5k plus Job was going to be a 12k plus job when done so business is not his priority. Other stores did honor their quotes.  Check your options as they lost me and a lot more business because of this guy. Pathetic customer relations .", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116634315422112267553", "name": "Forest Dixon`", "time": 1519424301693, "rating": 5.0, "text": "American Flooring, Cabinets & Granite is the best place to go if you're interested in perusing some remodeling a home. We just had some new carpet installed in our house and couldn't be more pleased with the outcome! Mr. Don Williams is personable, yet professional. He gave us a fair up-front price as soon as we gave him our measurements. Ms. Jessica also helped us and she was a pleasure to work with as well. Even the installers were professional, quick and did a wonderful job. We are planning on remodeling our bathrooms with new cabinets, granite counter-tops and porcelain tile, so we know exactly where to go for our next project!", "pics": null, "resp": {"time": 1520862170784, "text": "Thank you, Forest! We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111231804867099643802", "name": "Maggie Ainsworth", "time": 1562606126956, "rating": 5.0, "text": "American Carpet did an AMAZING job on my new vinyl flooring!!! Workers were professional, punctual, and friendly. I would highly recommend them to anyone interested in new floors. Will definitely use them again!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106482303702287774593", "name": "Mike Doggett", "time": 1502749320110, "rating": 5.0, "text": "Great Selection!! This store has a TON of products. Jennifer was our salesperson and guided us every step of the way. We looked at engineered wood and solid wood flooring, but ended up getting a beautiful tile that looks exactly like a wood floor. Guests are shocked when they find out it's tile. We also got a backsplash and granite for our bar and it looks amazing. We will be going back when we get ready for cabinets.  I would recommend this company to anyone looking upgrade their home. They had a amazing selection of vinyl plank and vinyl tile that would be perfect for a bigger family on a budget.", "pics": null, "resp": {"time": 1505741762879, "text": "Thank you, Mike! Great doing business with you!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106054624322724094989", "name": "HM M", "time": 1576021878267, "rating": 1.0, "text": "I walked in and was not greeted. I walked up to two people at desks and they didn't seem interested and couldn't seem to help even though I had a tile in my hand. They called another guy. I asked him about finding a similar size to my vintage tile because Lowe's only had 4x4. He said it would have to be measured and hesitated. He said he would see if he could find a tape measure. He came back and measured and said 4.25x4.25 and that was custom. He said I would have to buy a box but wasn't positive he knew how many tiles that was. He did a bunch of stuff on a calculator until he quoted me 100 tiles for $62. I needed 14 so I told him I would check back after searching. He told me he had the same problem when he did his bathroom. He said okay and maybe I would find an open box somewhere. I walked into Home Depot and 4.25x4.25 is a standard size. I bought 14 tiles for $2.46. I'm not sure what to say about that. I will let you come up with your own conclusions.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108630299565623962172", "name": "Lynn Sigouin", "time": 1520610762148, "rating": 5.0, "text": "Thank you once again for another beautiful and professional installation. Our stairs look like the center piece of our new home thanks to our wonderful Irene who gave us great customer service and always followed up with calls, Jonathon and Stephen who installed with perfection for detail and so,so polite and so talented.\nAnd for the kind, sweet voice on the other end greeting me this morning,  Jessica who assisted all my needs.\nGreat team you have, Don...Jay, I am sorry to have missed you my friend but we couldn't be more pleased .\nBlessings to all,\nThank you again,\nRay and Lynn Sigouin (Principe)", "pics": null, "resp": {"time": 1520862146281, "text": "Thank you so much, Lynn!! We are so thankful for your business. Please let us know if you need anything else in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108057886593171219422", "name": "Belinda Hall", "time": 1599083189436, "rating": 1.0, "text": "I came to this store for cabinets.  It is going on 2 months. The are not hung. The parts of the cabinets they just ordered without ever coming to my home for any type of measurements are under my carport blocking so I can't park my car. I have called repeatedly,  people have been rude, hung up on, talked down, and still no progress!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117787036663477905789", "name": "Nina Propst", "time": 1562852054807, "rating": 5.0, "text": "We are very satisfied with our new carpet and with the service we received.  We recommend checking them out for all of your flooring and countertops first...it will save you lots of time and stress!  Special thanks to Don Williams.  We will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113328340343186174231", "name": "Mendy Nilsson", "time": 1475770457823, "rating": 5.0, "text": "Shannon Williams is fantastic. He listened to my needs and showed me lots of options giving the pros and cons of each type of floor. That allowed me to choose the best floor for my needs and WOW I'm so thrilled with my luxury vinyl plank flooring. So beautiful and so easy to clean it makes cleaning house fun. Thank you Shannon and American!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113970014622307309182", "name": "LeBarbara Stinson", "time": 1506745563941, "rating": 5.0, "text": "I had the opportunity to have my Luxury Vinyl Plank floors installed by Mr. Glenn Smith. He had his team members with him. They were the kindest men. They worked hard and didn't half step on anything! They are funny and welcoming. I would recommend them anytime. I thoroughly enjoyed them. They were professional and operated on total and complete excellence!", "pics": null, "resp": {"time": 1506950838480, "text": "Thank you, LeBarbara!! We will let Glenn know he did a great job. We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111416900792223991488", "name": "Susan Allen", "time": 1590878893482, "rating": 5.0, "text": "Very informative, professional, and helpful!\n\nThanks Don Williams.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101100780463141592614", "name": "Lisa McGhee", "time": 1513869536331, "rating": 5.0, "text": "I want to say that I won a contest with American Carpets. My prize was 250$ off any area rug in the show room. I went in yesterday to pick out my rug, and was greeted by the owner Mr. Don.. I never expected to have the experience I had with the owner and or any of the showroom employee's they were all so nice and helpful. The owner was there to help me the whole time and made it very memorable he is a very great guy.. I would never hesitate about sending someone in to get any flooring these people treated me with the up most respect and dignity as if I was a paying customer and I'll never forget that... Thanks again to all the people at American Carpets.. y'all are the best... Thanks again Mr. Don glad to have met you...", "pics": null, "resp": {"time": 1513948177848, "text": "Thank you, Lisa! It was our pleasure!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114561379651249873993", "name": "Mr. Curtis", "time": 1506004714295, "rating": 5.0, "text": "In the past I've remodeled homes for a living, but was never in the position to actually come out of pocket and select carpets, etc.\nIt turns out making the right choice is lots harder than you think! With the fierce competition now days, it's easy to be told what you want to hear, given prices that you can't judge properly, and ultimately, run around in circles ending with products that are NOT to your satisfaction.\nThese issues do not arise with American Flooring (the Mobile location is the one I've become acquainted with). The woman who answered my calls, Jessica, was absolutely wonderful to speak with, and the sales person she brought me to the table with, Shane, was both professional, and compassionate.\nSuffice it to say I will be returning very soon!", "pics": null, "resp": {"time": 1506005641756, "text": "Thanks you, Mr. Curtis!! We look forward to hearing from you soon, and in the meantime if you have any questions at all, you know who to call!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103818978067295149003", "name": "t h", "time": 1505054545999, "rating": 5.0, "text": "I have recently completed a kitchen renovation and love the outcome. Don helped me select the perfect quartzite countertop for the new island, we purchased luxury vinyl plank for the new floors plus found a beautiful new rug too. Thank you so much for all of your assistance! I am pleased and feel I got a great deal and great service at American Flooring. I would highly recommend them to all of my family and friends.", "pics": null, "resp": {"time": 1505741724783, "text": "Thank you!! We loved the way your kitchen turned out. Looking forward to doing business with you again in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109170999786149336161", "name": "candes ritter", "time": 1528755297028, "rating": 5.0, "text": "I’ve had several rooms carpeted and have always received excellent service, prices and installments.  Absolutely...... this is your first stop if you need flooring!", "pics": null, "resp": {"time": 1529938086003, "text": "Thank you, Candes! We really appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110647611947034005455", "name": "Gary Stiegler", "time": 1540443305316, "rating": 1.0, "text": "My wife came in with a sample and the info for the flooring which had been purchased at AC.  Johnny,  the salesman immediately let her know without looking around that they didn't carry the item.  She proceeded to look around the store on her own, no one asking if she needed help, but after 20 minutes, found the exact piece of flooring!  Found Johnny, and he gave her a price of almost $200 for a 12 piece box of vinyl flooring.  Thanks, but NO THANKS American Carpets!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105141951524097154911", "name": "Sally Faucheaux", "time": 1471873045321, "rating": 5.0, "text": "Thank you Jennifer ..... She  was my floor and cabinet specialist..... And thank you for all your expertise,   Also want to thank every one else at  American flooring this is not  the. first time that they have done work for me.  I was very pleased in the past,   It has been some years ago I am changing now because I don't want carpet anymore I want to change to ceramic....great job then, and I am sure they will do a awesome job this time as well, after all   I came back for more ;)", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113660126408283553855", "name": "Rachel Jenkins", "time": 1509468604976, "rating": 5.0, "text": "Jennifer Vaughan is amazing to work with.   She saw my vision and brought it to life.  She also prepared me for the installation experience by explaining it honestly and in depth.   I will never use anyone else in the future except her.   American Flooring needs to hold on to her.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "106479852329186106783", "name": "Sharon Thompson", "time": 1507040325676, "rating": 5.0, "text": "I am a mortgage lender in the Mobile and Baldwin county areas and have referred more clients than I can count to the Mobile and Gulf Shores locations over the years. Whatever your home needs may be, American Flooring is well rounded with an amazing selection of products, and a wonderful team of sales reps and installers. Be sure you follow them on Facebook, they do lots of giveaways and sales you don't want to miss! If you want to call before you go in and actually schedule ahead, ask for Jessica and she'll make sure someone is there to greet you and meet whatever needs you have!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117040202545697376479", "name": "Jessica Bates", "time": 1513098225059, "rating": 1.0, "text": "I'm only giving one star because the material itself was great. The guy that did our template for our countertops measured wrong and only half of my notch was able to be done. The installers flooded my bathroom because the water wasn't off when they took the pipes apart. They knocked several holes in my walls and left without mentioning any of them. After a SIX HOUR install, I still had no water to my sinks and only half of the kitchen done. My stuff wet and laying everywhere and holes in walls in every room they worked in.", "pics": null, "resp": {"time": 1513099726486, "text": "Thank you for taking the time to let us know about the situation. We are reaching out to the installation crew and will make this right for you, whatever it may take. We apologize for any inconvenience this may have caused.\n\nUpdate: Thank you for allowing us to fix all of the issues. We appreciate your business!!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116401465991465306335", "name": "Leslile Reddick", "time": 1423752030323, "rating": 1.0, "text": "I used American Carpets to install my granite, carpet and laminate flooring in my kitchen.  This was done in August 2013.  My carpet separated between rooms and along the kitchen and living room and nails are sticking up.  My under counter sink is loose.  I have been trying to have this fixed for months now with no resolution at all.  Chris in installation has been out to my house twice to \"look\" at it with promises of it being fixed.  Nothing has been done.  I feel that the work that was done was unprofessional and cheap.  I spent a lot of money on this and would expect it to last longer than a year and if not, at least for it to be fixed in a timely manner.  I will never refer anybody to American Carpets as my experience has been very dissatisfying.  I have never written a review before, much less a negative one, but I felt I had to because I have been getting the run around for months.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "112051624005515480683", "name": "Steve Baker", "time": 1493588377767, "rating": 5.0, "text": "Very friendly folks. Not only did I get a great job on my ceramic flooring​, I think that this business has a lot of Christian people and that is why it is doing so good. Chris and his son that laid my flooring did a great job. Shane the salesman also knows his job. A plus to this business.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108856669990873646097", "name": "Lacy Hilliard", "time": 1501614043493, "rating": 5.0, "text": "Craig Crawford and his crew did excellent on the installation of vinyl flooring. They were personable, well mannered and addressed my concerns immediately . This is the crew you need for your installation! Showroom time was quick and precise with my needs.", "pics": null, "resp": {"time": 1502807682245, "text": "Thank you, Lacy! We've let Craig know how great of a job he did. We look forward to doing business with you in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107646176517346174831", "name": "Kem Hall", "time": 1495299730107, "rating": 5.0, "text": "I googled wood floorings and came up with this store. For years I thought they only sold carpet.  I found a vast amount of everything needed for a home; granite, cabinets, wood flooring, tile, rugs, vinyl plank, you name it and its here.  This is a ONE STOP SHOP. Employees are welcoming, helpful and knowledgeable to help with everything. They have good deals too.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101853443802132720285", "name": "Kyla Gaston", "time": 1518029527616, "rating": 5.0, "text": "I GOT THE OPPORTUNITY TO WORK WITH JENNIFER V. AND JAN R.  - OH MY GOODNESS THEY ARE A TERRIFIC TEAM. I HAD AN ISSUE WITH MY FLOOR WHEN MY HOME WAS BUILT DUE TO THE WRONG DOOR BEING PLACED IN THE HOME, MY WOOD FLOORING HAD TO COME UP DUE TO WATER DAMAGE AND I HAD TO REPLACE IT WITH ANOTHER PRODUCT. JENNIFER AND JAN SAW HOW UPSET I WAS AND WAS ABLE TO MAKE FEEL BETTER AND REASSURED ME THE SECTION OF MY FLOOR WOULD LOOK FABULOUS. I AM SO HAPPY WITH THE TILE AND MOSIAC ACCENT TILE FOR THE FLOOR AREA, IT LOOKS LIKE THE HOME WAS ORGINALLY BUILT THAT WAY. I CAN NOT SAY ENOUGH FOR JENNIFER AND JAN TWO WONDERFUL LADIES AND THEY ARE GREAT AT THEIR JOBS.", "pics": null, "resp": {"time": 1520862213675, "text": "Thank you for your business, Kyla!!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107643177770399754051", "name": "Ethel Moore", "time": 1460319740957, "rating": 5.0, "text": "My husband and I received a warm welcome upon entering the storefront and we were treated wonderfully! I explained to Shannon,  our sales rep,  what I wanted and he took us right to it!  It felt as if we were old friends.  I was never pressured to purchase anything which is a PLUS.  I cannot count the many times that I left a place due to the pressure to buy something that I'm really not looking for.  We also met the 'big man in charge' -as I affectionately refer to him.  You know,  the 'open 8 to 8 so don't be late' gentleman.  Lol.  Very warm and professional.  The carpet they installed looks AMAZING!  It's exactly what I wanted at the price I wanted! I will DEFINITELY recommend American Flooring and Cabinets. Ask for Shannon,  HE IS A GEM!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107707794170294401374", "name": "Lynn Zimmerman", "time": 1497716097916, "rating": 1.0, "text": "We had Johnny also five years ago and are sorry we went there. We asked for the best pad that they had and also wanted quality carpet and were told that we had ordered it. Now we have \"humps\" in our carpet from stretching and we have to replace it soon. They tiled our foyer, hall and kitchen and while we love the tile they are uneven and chipped. Afterwards they fixed some but in order to make it right they would have had to redo most of it.  For $6,000+ we just expected better.  Make sure that you know what you are getting is right and the quality that you expect. We went to the Mobile store to have our work done.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110867929909355066555", "name": "AllDone3", "time": 1502979966395, "rating": 5.0, "text": "Not only did they sell me on buying material from them instead of the competitors in the are, they educated me on WHY was more durable or waterproof than another and explained the difference in the products that I was interested in.\n\n\"People buy from people, not companies.\"\n\nThese people took fantastic care of me and my home.", "pics": null, "resp": {"time": 1503061999030, "text": "Thank you, Aldon! We look forward to doing more business with you in the future!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115722297709588678394", "name": "Katie Azevedo", "time": 1549474581896, "rating": 5.0, "text": "We love our new carpet! The prices were reasonable and everything was done quickly and professionally.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "110594986656957890844", "name": "Mallory Howard", "time": 1562361944716, "rating": 1.0, "text": "So, my impression was great when I left the store but quickly changed. Salesmen were very helpful. Acted eager to help us get our remodel done. They showed me a countertop that they had in stock. It was ok, but not exactly when I was looking for but they insisted it looked great. I again, said no, I’ll keep looking. Kept looking and found the one, the countertop that would look the best. Left the store with the salesman’s card to call back with measurements. My husband called them 2 hours later to get a quote. Salesman tried selling him the countertop they had in stock but was not what I looking for. My husband told him no, she wants the other. He quoted him a price. Then called back and DOUBLED the the first quote because they’d have to order it. Seems they were eager to help sell what they had in stock, but be darned to sell what they’d have to order. We won’t be making a purchase from this store. Our business will go else where.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "111823440820378354845", "name": "Scotti Bee", "time": 1544726827548, "rating": 5.0, "text": "Great place. Everyone I worked with was fantastic. Great attitudes, wonderful customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "103199519475517768154", "name": "Apple Henderson", "time": 1504216358877, "rating": 1.0, "text": "Well..well well, what can I say??  I sought help and met a man named Johnny at American.  We were needing granite and flooring.  He showed us a couple of choices and suggested we go to the warehouse in Loxley to pick granite and took our info and said  let him know what we decide on and we'll get a quote.  Needless to say he lost our info and forgot who we were.  We contacted him and reminded him of the quote.  He was to get with us on several occasions and did not!!  The lady who answered my call was aware of my frustration and got a owner/manager to take my call.  Got another we'll get you the answer and call you spill again.  We are not from here and should have believed reviews...SOOOO grateful to have been referred to HARD ROCK GRANITE....they are professional, personable,  thorough, quick and they treat you like family. If quality everything choose HARD ROCK they will be honest and get you a better deal too!!!!!", "pics": null, "resp": {"time": 1504219425037, "text": "April,\n\nI am so sorry to hear about your unfortunate experience. We really appreciate your feedback, and hope that in the future you give us the chance to make it right."}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100418002630902400509", "name": "Logan Crouch", "time": 1475035900830, "rating": 1.0, "text": "I came in with a friend and Johnny Marino was our salesmen. I have never had a worse experience. He was introduced to us as 'the man who knew it best' and that he had 'been in the business for 43 years'. However, he was not polite, seemed to talk over us as we explained our needs, treated us as if we had no idea what we wanted, and overall was completely unprofessional: not only to us, but for other customers who were in the store. We were shown one product, and after the purchase, were shown a completely different colored product; then were argued to repeatedly that it was the light causing the color difference.\n\nThe business had a wide selection of products, and I'm sure with another salesman we would have had a better experience. But this particular transaction just left a bad taste in my mouth.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "114089316454675169832", "name": "Joshua Carper", "time": 1582784525996, "rating": 1.0, "text": "Dont shop here they are crooks!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117391671372413098311", "name": "Victoria Wilson", "time": 1561134408013, "rating": 1.0, "text": "Advertised \"Open 8 to 8\". Arrived about 5:40 unaware of new store hours. Came to buy flooring for 3 rooms. Salesman took me to the back to look at sheet vinyl rolls and remnants. Told me to browse while he figured out how much I needed from the measurements that I provided. I thought he was taking a little too long. Went to look for him and discovered that everyone had left and locked the doors. That's when I saw a sheet of white paper on the front door with new store hours 8-6. I HAD A PANIC ATTACK! Called my sister. She called Mobile Police Dept. MPD came. A woman in another vehicle then arrived and told him how to get me out. I left a note on the salesman's desk with my name and phone number and what had happened. I picked up my floor plan and measurements and left. NO ONE EVEN CALLED TO APOLOGIZE.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100870931229571003310", "name": "Michael A", "time": 1457630008683, "rating": 5.0, "text": "Service was excellent. Shane Gros was very helpful. Definitely the place to shop. Can't go wrong. Thank you Shane for all your help!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115666149050338080865", "name": "Todd Burley", "time": 1429800439217, "rating": 5.0, "text": "Visited this place on April 2nd to shop for new carpeting for our new house in Semmes. After we shopped around at several stores we found this place the most useful because of their helpful staff, affordable prices and financing. We ended up buying 1500 sq ft of carpet and had it installed last week, my wife loves the carpet and I love being able to get out of bed barefoot. We are very happy with American Flooring and would recommend them to anyone who needs a good deal on carpet", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117025975305460744902", "name": "Cyndi Booth", "time": 1460990865568, "rating": 5.0, "text": "I love, love, love my new kitchen granite countertops. They look great with the new cabinets recently installed by American Flooring, Cabinets , and Granite . I had the tile floors installed in a few rooms about 6 months ago. Everything is coming together and looking beautiful! Next is the bathroom shower and countertops and a bedroom needs hardwood flooring and........American Flooring, Cabinets, & Granite \"Your One Stop Shop\" for all of your remodeling needs!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "109266193797410791492", "name": "John rohman", "time": 1521160462034, "rating": 5.0, "text": "They have a beautiful showroom and staff was very helpful it was a great experience no stress,ill be back", "pics": null, "resp": {"time": 1521207459266, "text": "Thanks, John! We are looking forward to it!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "117076347066617113149", "name": "Danny Woodard", "time": 1500739486402, "rating": 1.0, "text": "Attended the event they had last week where they said they were giving away prizes. I was told by a young lady there the drawings wouldn't be until late that evening and that I had to buy something to get a ticket. I then decided to buy a bottle of cleaner and was told that wasn't enough value for a ticket into the drawing. Clearly a bait and switch tactic to get people in their expensive store. Buyers Beware!", "pics": null, "resp": {"time": 1501006940255, "text": "No purchase was necessary to enter the contest or win. In fact, 4 out of 5 of our big prize winners didn't shop with us that day. We did not find this customer in our database of transactions that day. We appreciate all of our customers who came in for our 45th anniversary customer appreciation day event and hope to continue being your one stop shop!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "112977216569026173651", "name": "Diane james", "time": 1502988783377, "rating": 5.0, "text": "LOVE my new rugs! Will definitely be doing business with y'all in the future!", "pics": null, "resp": {"time": 1503062016602, "text": "Looking forward to it! Thanks!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100618850160735047178", "name": "Norma Beachman", "time": 1506864146747, "rating": 5.0, "text": "We got everything we asked for .the company is number 5 you\nAnd their employment Ronald STEGMEIER is So Good At his Job\niWould Give Him A 10\nHe made Sure the Job was done Right And worked untill it was Finished\nOn A Saturday we would Recommend your Company and  Employee\nRonald STEGMEIER to anyone.\nRobert and Norma BEACHMAN", "pics": null, "resp": {"time": 1506950932066, "text": "Thank you, Norma!! We appreciate your business and I believe you meant Roland? We will let Roland know of his stellar job!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "104093080593887491080", "name": "val hansen", "time": 1501517000703, "rating": 1.0, "text": "When you place an order for 14 boxes for laminate flooring and get 3 boxes you think maybe it was just 1 mistake.  When you also place an order for ceramic tile for the facing of your fireplace at the same time you ordered the laminate flooring and you get 3/4 of it you start to wonder about this store that's been in business for so long. When you place an order for 3 boxes of ceramic tile for the inside of your fireplace at that very same time and you get 1 box because they FORGOT to order 3 and  you have PAID for it ALL!!!!  I am wondering WTH is THEIR problem!!!!  I took back the 1 box of ceramic tile since I didn't like it,  it didn't match, got a refund, pkd up the 3 boxes of flooring and tried to give me the other 2 boxes of ceramic tile I had gotten a refund on?????  Yes, I know had for me to believe too!!  Finally got all of my flooring. Had to reorder more fireplace facing tiles, pd for it, was told it was ordered as I was in the store and would be in that Friday, it came in the next Tuesday!!!! Found out it was NOT ordered until the day AFTER I ordered it!!!!  BTW, I finally went to LOWES, and got the rest of the ceramic tile I needed for the inside of my fireplace that they had IN STOCK!!  All this going on as my contractor was doing what he could with what we had!!!  Needless to say HE was not very happy and will be writing a review also on this store.  I live 18 miles 1 way from this Mobile store.  I made a trip 6 days in a row.  My sales person was Shane Williams.  I would NEVER recommend this store to anyone and will tell everyone I know of my experience.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "115158994240707227703", "name": "J H", "time": 1393281602049, "rating": 1.0, "text": "Misleading sales. If they make a mistake you are stuck with it...no returns! I tell everyone not to shop here. Salesman called me \"sweetie\" when he refused to correct his mistake..how demeaning. Similar incident with an acquaintance of mine, so must not be a rare occurrence.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "107762932826141481779", "name": "Leigh Stewart", "time": 1509484574891, "rating": 5.0, "text": "Don has always help us in anyway that he can.  If I ever had a problem,  Don take care of it himself. We have been with him for many, many years.", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "118414276853890684407", "name": "Hannah Saenz", "time": 1447170793676, "rating": 5.0, "text": "This is most definitely a one stop shop, bought my counter tops, cabinets and flooring here. The prices were very affordable and I highly recommend this place to everyone!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "101758304990908887038", "name": "Jonathan Cunningham", "time": 1539007918594, "rating": 5.0, "text": "Good place friendly service", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "113681901621026223863", "name": "Jason Pyon", "time": 1517948519847, "rating": 5.0, "text": "Great people, great floors!", "pics": null, "resp": {"time": 1520862227750, "text": "Thank you, Jason!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105090492168884359582", "name": "jessie james", "time": 1600095598542, "rating": 5.0, "text": "Awesome Customer Service!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "100447168247335546352", "name": "Tiffany Middleton", "time": 1516397427585, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1516407373391, "text": "Thank you, Tiffany. We appreciate your business!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "105897648709098992834", "name": "Kyle Patterson", "time": 1509545845019, "rating": 5.0, "text": "Very good experience", "pics": null, "resp": {"time": 1509547905471, "text": "Thanks, Kyle! Who was your sales rep?"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "108730415867708162165", "name": "Michael Farrier", "time": 1517445406499, "rating": 4.0, "text": "Helpful", "pics": null, "resp": {"time": 1520862242977, "text": "Thank you, Michael!"}, "gmap_id": "0x889a4da0cbf6290f:0xb4968962c4a1cee9"}
{"user_id": "116304123264346053058", "name": "Joshua Southard", "time": 1613134842882, "rating": 5.0, "text": "They are very nice and extremely helpful to the extent of looking at pictures of the wall color and getting a good match for the floor and not clash. They have everything you need to get a floor done with real hardwood, laminate hardwood, vinyl and tile carpets and rugs. If u can walk on it THEY will have it. I'm still waiting on the free home estimate and I will update this post after with pictures.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMoNDUz1nUwQ3clPi7Ms8eA1or37X9T7mmjgGa4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNrR14rt5OBblvzCaG8AnP6Nx0p74ThsgWqcY4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMt37P91ft1XcOSoqdngMR_WVNKqjIvkuVDRHK4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPmoio3E6HGanV6zgzyFHWmDOyZ23eSVMWh1hP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVYU_ojO2WiFbdy8fmwewbqmYBF11fTFv05A1H=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116917318814881034780", "name": "Traci Reed", "time": 1618606757888, "rating": 5.0, "text": "What a wonderful experience today at this establishment working with Kim! It was so refreshing to work with her and Dinah!! And we got Everything we wanted and needed. We love All we picked out!! Can’t wait to see it all in our New Forever Home!!!!", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "107629545306958167693", "name": "Mike Measels", "time": 1608559238516, "rating": 5.0, "text": "Shane and David did great. They were committed to and take great pride in their job. They were punctual every day and if they were going to be a little late would notify us. They have the process of refinishing floors down to a science and a lot of hard work.  They were also courteous and friendly.  We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105287292938466275483", "name": "Merri Bass", "time": 1619228954789, "rating": 5.0, "text": "Staff is the best!! Helpful and very knowledgeable about all things flooring.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "110191424794442440645", "name": "Steven Stovall", "time": 1610211978182, "rating": 5.0, "text": "Very nice and willing to answer all your questions Good people", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "110690283404264893827", "name": "Jacques Cockrell", "time": 1600868952658, "rating": 5.0, "text": "Great experience. Very professional and knowledgeable. Nice selections and great attitudes.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105605293847708323016", "name": "Balinda Adams", "time": 1496180859701, "rating": 5.0, "text": "This place has just the right amount of a variety of flooring without making you overwhelmed. The young guy at the desk was very nice and attentive to us when we came in. Shane went out of his way to make sure my parents found everything they were looking for. He even gave them a sample of wood to take home to see if it matched the staircase. He also gave them a quote that was much cheaper than the other flooring store we had went to. He was honest and very upfront. If you go by, ask for Shane and he will take great care of you and even help with design questions.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116341789387237960125", "name": "Adam Baker", "time": 1496176180003, "rating": 5.0, "text": "We were pleasantly surprised when we walked in the door! Not only did everyone greet us but several were busy with other customers yet they made sure we were taken care of. We told Vicki what we wanted and she read my mind and presented several options. We will not only mention them to our friends we will shop with them again very soon. Thank you for your hospitality and commitment to making sure we got what we wanted, in the budget we had to work with and all installed in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "109741078409095936113", "name": "T W", "time": 1509557415869, "rating": 5.0, "text": "Update to a review with only 1 star rating several months ago from De W. As the customer who wrote it, we made an effort to update the rating but could not seem to do so. However, please know that all concerns with the installer were addressed and done so professionally. In reality the concern was simply a breakdown in communication. No one is perfect and they did what was right and corrected our concerns. Ryan was excellent and prides himself on taking care of the customer. Please omit the rating from your decision process on where to buy your flooring. They truly deserve a full 5 star rating.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102835260080024832829", "name": "Vicky Brown", "time": 1495749793814, "rating": 5.0, "text": "Very Helpful and Knowledgeable Staff.\nGreat Selection to choose from... well\nlaid out showroom.  I would Recommend\nto others.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "102435517894712712524", "name": "Judy Croft", "time": 1496023792475, "rating": 5.0, "text": "Our overall experience was outstanding, from the selection to the service. Thank you for your design advice, it really helped us make the right selection for our project. I would recommend to everyone. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "114202475013389505625", "name": "De W.", "time": 1495725608505, "rating": 1.0, "text": "They promise you ethical treatment, integrity & flawless service. Don't believe it.\nOnce carpet was selected - salesman assured quality professional installers in a timely manner.\nThe installer arrived late; talking highly of himself and did not reply or respond when asked questions. Once carpet installed, we inspected job. Carpet had high strips where Sean's were like the carpet was doubled at the seam. I pointed it out to installer (Terry), and he pulled on it saying it won't come loose. I said I wasn't worried about it coming loose but the seam was obviously thick.\nHe ignored my concern. A week later I called back and spoke to sales person who came our days later to look at it. It took another week to get a call back where salesman asked for a convenient time for installer to come back. I gave him 2-days and timetable around my work schedule. Salesman said he would call installer and get back with me on day & time. I was assured installer would be back to repair on one of the days I provided but he would call back to confirm.\nOn the day installer was suppose to be here for repair I received a call from installer saying he was calling to set up the appointment. What?! You were were suppose to be here....\nI called the store and I got excuses from the lady sales person saying the installer was trying to call me.\nDon't bother calling these people..they don't know what they're doing and they are not customer service conscious. I won't be using them again.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "106807615328526239216", "name": "J Bin8148", "time": 1565017455588, "rating": 1.0, "text": "Price I was quoted for materials changed drastically after work was done. I was told those were the in stock prices. Had no choice but to pay I was never contacted saying the quote was going to be different. Stay away", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116220530764713666634", "name": "Catrina J", "time": 1536353196536, "rating": 1.0, "text": "No customer service. My husband and I visit the store this morning looking to purchase some flooring. When we entered, no one greeted us or said one word to us while we were there. We looked around and nothing. Waited near the desk, nothing. We left! If you are with a customer or busy, all it takes is 10 seconds to say \"Hello! welcome! We will be with you shortly\"\nWe spent our money elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "106169342884188317776", "name": "Lillian Black", "time": 1566244678583, "rating": 5.0, "text": "Very happy with experience from sales to fantastic installers. Price exactly what estimate was.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105161777829111765850", "name": "Mark G.", "time": 1495766006608, "rating": 5.0, "text": "We bought our flooring from Alabama Custom Flooring  and Design and couldn't ask for a better experience.  The service was beyond my expectations.  I highly recommend them for all you flooring needs.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "115050475612973215501", "name": "Jared Toone", "time": 1485363215715, "rating": 5.0, "text": "Great selection and pricing. Order came in quickly and all went well.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "104703748919011224951", "name": "michael joseph", "time": 1519008355255, "rating": 5.0, "text": "easy experience. helpful/knowledgeable sales person", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "101529749488321458616", "name": "Michelle Hockersmith", "time": 1470497843147, "rating": 5.0, "text": "Thank you to Ryan for the excellent service.   I highly recommend Alabama Custom Flooring & Design for all your flooring needs.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "112513230607243614302", "name": "Stan D", "time": 1529441783316, "rating": 2.0, "text": "They quote cheap prices by the foot, and then over measure by nearly 20%...be careful with this place.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "116084288399862673075", "name": "Dana Lee", "time": 1495762361900, "rating": 5.0, "text": "Great place to find flooring.", "pics": null, "resp": null, "gmap_id": "0x88628a63126bfe57:0x9447fbe40b350d14"}
{"user_id": "105212769982257353663", "name": "Eugene Jackson", "time": 1617916278456, "rating": 5.0, "text": "I work here, beautiful  cabinets,  will do a great job. If you come to us give them my name. Eugene Jackson as your referral", "pics": null, "resp": null, "gmap_id": "0x888923f379d0ff79:0x56604d84bc32fce2"}
{"user_id": "108825826686182009213", "name": "Evan Henegar", "time": 1542117519647, "rating": 1.0, "text": "Installed incorrect and broken cabinets. When trying to get warranty work on defects due to having no quality control it took months for them to schedule. When first contacted about having them come and fix issue they didn’t return my call for over a month. Very poor work and service I would not recommend using. Please avoid!", "pics": null, "resp": null, "gmap_id": "0x888923f379d0ff79:0x56604d84bc32fce2"}
{"user_id": "113270823344095095423", "name": "Cethy “C Lee” Lee", "time": 1605830256463, "rating": 5.0, "text": "Alabama Cabinet Company is amazing! I love my new kitchen. Jacob Pollard was super helpful when I was choosing my cabinet style, color, hardware, and countertops. And all of the employees who came to measure and install the new cabinets were friendly, courteous, and professional. I highly recommend this company!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVr9JGpD54yroropEWhepRcA0Sgmp9trW3vvml=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMU9YUG26nFH88ZKyhSEONbpgWQ6dR656IIlJSE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnR3CcG2GejzaDZAYS9AIu4LqxLTZhYz7sK7_Z=w150-h150-k-no-p"]}], "resp": {"time": 1610378657997, "text": "Thank you for the review.  We hope you enjoy your new kitchens and bathroom!  The project is beautiful!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "102415813508295670010", "name": "Lindsey Lee", "time": 1567000145173, "rating": 5.0, "text": "I had a wonderful experience with Alabama Cabinet Company. The cabinets are high quality and look great. The staff is wonderful to assist with design questions. They were top notch all the way through the design, ordering, and installation process. I highly recommend using this company for a new build or remodel project. I am so pleased with these cabinets from both a functionality perspective. Thank you, Jacob, Steve and the rest of the team for making this such a great experience for us. We love our new kitchen!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNGVpPhd_SryAnn1CxSTSVDyqxDXq0rWb9sHr4m=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-528S8gTEogdYPAyslLB_aCYAgWz08Lrhdy6E=w150-h150-k-no-p"]}], "resp": {"time": 1610379879622, "text": "Mrs. Lee.  We appreciate your business and are thankful that you chose our company to help with your project.  Thank you!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "115727309733004886587", "name": "Ronnie Adkins", "time": 1623179272796, "rating": 5.0, "text": "Man these folks and very professional at what they do. They are real professional and easy to talk too. I give them 5 stars . God bless this place. 🙏", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "110421623644602922609", "name": "Leslie Price", "time": 1617821165149, "rating": 5.0, "text": "As a project manager, I have worked with this company on several large projects and we have been so pleased with the communication, scheduling, and time management of each project. Great cabinet options to choose from, and honest feedback on what would be best to use. I would (and DO!) recommend Alabama Cabinet to anyone looking for cabinets.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "117271694362027849992", "name": "Kasey Fain", "time": 1614880948019, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!! We are going on FIVE MONTHS and our project still isn’t complete. My husband and I built our home and our entire project was held up for several weeks because of cabinets. Communication is awful. The guy we have been dealing with takes days if not weeks to respond to any emails or phone calls. The wrong color was ordered for our pulls even though we confirmed THREE times on what colors we wanted. And on top of that they didn’t even order the entire amount of pulls we needed so we still have cabinets with no pulls. We have mismatched pulls in our master bathroom because, again, they failed to order the correct color or number of pulls. But my biggest complaint is that they installed our cabinets for the wrong size oven so we then had to return the oven we already had ready to be installed and buy a bigger one which ended up costing us $5,000 to fix their mistake. We have a vanity cabinet in our master bath that is the WRONG COLOR and instead of fixing it themselves they dropped off a can of spray paint for us to fix it. The fact that they are willing to let a customer fix their mistake is beyond me. We even recommended this company to other people (before all of the mistakes) and after talking to our friends we find out that their cabinets were messed up as well! I’ve never had such terrible customer service in all of my life.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1622556590024, "rating": 4.0, "text": "Very good prices. Not very convenient location and the showroom is jumbled and not well organized. Products are good and service is good.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "117648143058434061879", "name": "John Gill", "time": 1575038730591, "rating": 5.0, "text": "Very good to work with during design and installation. the quality of cabinet is much better than big box home improvement stores at a competitive price. Of the subs used for my new house they were one of the best.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNxlUBb5UY1If7wrwfggu12UKtDhq3tBVzsQx9w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNlM-HAclnakgJp_flvHj859FAfMYQITtj_duVh=w150-h150-k-no-p"]}], "resp": {"time": 1610380088884, "text": "Mr. Gill, we appreciate your business and Review of our company. Thank you!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "117871628945639664773", "name": "Deb Kornegay", "time": 1592328710435, "rating": 5.0, "text": "Alabama Cabinets did a fabulous job helping us upgrade our 40 year old kitchen.  All of the workmen were a delight to have in our home.  You will not go wrong if you chose this company!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNFXMUvRhiGQtR7WKGPIaSp6eA7sGC6heByVjCn=w150-h150-k-no-p"]}], "resp": {"time": 1610379807572, "text": "Thank you for the review!  We enjoyed working on this unique project in such a beautiful setting."}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "107956813238923149160", "name": "Sherrie Wilson", "time": 1610749664187, "rating": 5.0, "text": "Janice was the best. She worked very hard for us. I will do business with her again.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "112762895975102495582", "name": "Cari Callison", "time": 1590157954945, "rating": 5.0, "text": "We had a great overall experience with the design and install on our beautiful custom kitchen and bathroom cabinets. Chris was very responsive and attentive to our requests and questions. 100% recommend.", "pics": null, "resp": {"time": 1610061773707, "text": "Mr. Callison.  Thank you for the kind review.  We are glad you enjoyed the experience and we are grateful for your business."}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "113139042487783680318", "name": "Anne Carlton Reebals", "time": 1575924291412, "rating": 5.0, "text": "Alabama Cabinet Co. made our kitchen renovation easier than we could have imagined. Jacob was incredibly helpful, and he was patient as we went back and forth on decisions. We are extremely pleased with how everything turned out! The cabinets are beautiful and of the highest quality! I will recommend these guys to everyone I know pursuing home reno projects. Thank you, thank you for being wonderful to work with and delivering beautiful products for our kitchen.", "pics": null, "resp": {"time": 1610380051385, "text": "Mrs. Reebals, thank you very much for the review.  Your carport to kitchen conversion was a great project to be a part of.  We appreciate your business!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "101727010685447059653", "name": "Ty Lowe", "time": 1597423237856, "rating": 2.0, "text": "They took over a month to create a simple drawer and then i asked them to leave the old drawer so I can use as a reference, they failed to do that. I probably won't use them again. I would rather drive a little further and use someone else who wouldn't take as long and can follow simple instructions.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "101780604396302213265", "name": "Greco C.", "time": 1605623670998, "rating": 5.0, "text": "Chris did a great job and was very knowledgeable.", "pics": null, "resp": {"time": 1610379899622, "text": "We appreciate your business and review!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "101617654440547550266", "name": "Amanda Klein", "time": 1578151936890, "rating": 5.0, "text": "My husband and I renovated our kitchen this fall and have nothing but GREAT things to say about Jacob and Alabama Cabinet Company. We purchased a fixer-upper 7 years ago, and have been slowly renovating it since, and from pricing/communication/professionalism/quality Alabama Cabinet Co. has been the *best* vendor we have worked with throughout our entire home renovation. My husband and I both have demanding jobs where scheduling is often somewhat complicated, and Jacob was so great with communication/scheduling, their contractors were ALWAYS on time and there when they said they would be. They made the entire process very easy. The finished product is absolutely beautiful. We are so thankful to have worked with Jacob and ACC for our kitchen renovation, and will be using them again in the future. If you are looking for cabinets/countertops, we wholeheartedly recommend Alabama Cabinet Co.", "pics": null, "resp": {"time": 1610061714361, "text": "Amanda.  Thank you for the kind words.  We hope you are enjoying your kitchen!  We appreciate your business!!!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "100202594862642101073", "name": "Joey Tichenor", "time": 1550606188475, "rating": 5.0, "text": "I was very pleased with my experience with Alabama Cabinet Company. I ordered new countertops and they were delivered in a reasonable time frame and installed quickly. The whole process went great. I would say the showroom could use some cleaning and organization.", "pics": null, "resp": {"time": 1610380229882, "text": "Mr. Tichenor, thank you for the review.  We appreciate your business!!!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "115620806264614479890", "name": "Cicily A. Gray", "time": 1553878419994, "rating": 5.0, "text": "Janice is absolutely awesome!!!! She helped me out of a tough spot after terminating a contract with the company who had originally purchased cabinets to install in my home.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "109544053108517361083", "name": "Mark Mcauley", "time": 1582148336821, "rating": 5.0, "text": "Great service as always.", "pics": null, "resp": {"time": 1610379975912, "text": "Thank you!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "111393536847146957341", "name": "John LaGrone", "time": 1552330204573, "rating": 3.0, "text": "Affordable Decks this place is Great", "pics": null, "resp": {"time": 1610380168929, "text": "We do not sell decks or decking material."}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "110308946955666040021", "name": "Heiress", "time": 1574874893049, "rating": 1.0, "text": "Absolutely horrible.", "pics": null, "resp": null, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "109139793178177567618", "name": "Thomas Richardson", "time": 1467300248101, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1610380335064, "text": "Thank you for the review!"}, "gmap_id": "0x88891c125255103b:0x62675b2987e0b8d"}
{"user_id": "100414169933567131280", "name": "Larry Johnson", "time": 1624659499108, "rating": 5.0, "text": "We lucked out with this company. Scott worked us into their very busy schedule, and very friendly, and efficient. The guys laid 400 square feet of floor tile. And did an excellent job. Would definitely recommend .", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "103359442376434767709", "name": "Debbie Dunaway", "time": 1626059910425, "rating": 5.0, "text": "Great selection to help design interior and exterior of your new home or renovation.", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "116016416882301762546", "name": "Mark Boackle", "time": 1596567992978, "rating": 5.0, "text": "Fantastic selection and design ability combined with superior service.", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "109672052241549120893", "name": "david hudson", "time": 1549401319340, "rating": 5.0, "text": "Usually find what you need there. Helpful people.", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "112777757555996048354", "name": "Noeli Moreno", "time": 1508683480299, "rating": 5.0, "text": "Good stuf for your home", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "101057045220604916739", "name": "Crystal Cooley", "time": 1542231698637, "rating": 5.0, "text": "Beautiful stuff", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "108529508708919738107", "name": "Johnny Winters", "time": 1557922082664, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x888c0b8695acbdbb:0x7a5593ec44fa62fa"}
{"user_id": "105212769982257353663", "name": "Eugene Jackson", "time": 1614216883783, "rating": 5.0, "text": "The are good at getting  you parts to refurbish your home, get new counter tops", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "109480736730039669433", "name": "Shawnee Welch", "time": 1551722404113, "rating": 5.0, "text": "Very friendly And helpful. I love coming here.", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "105104958887542682920", "name": "William Brown", "time": 1526591488772, "rating": 5.0, "text": "Little hard to find, but well worth it.", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "100610871757241851813", "name": "Jan Pauls", "time": 1553024879710, "rating": 5.0, "text": "Friendly, great prices.", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "117476614441222271636", "name": "Trevis Nash", "time": 1561648001038, "rating": 5.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "104691504731213721995", "name": "Mike Lane", "time": 1535395131795, "rating": 5.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "107489432546715863437", "name": "Rachel Sosa", "time": 1553822455289, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88891ee06bf20491:0x43aa5b5caece760a"}
{"user_id": "101757597760785330471", "name": "jane k", "time": 1621266540116, "rating": 5.0, "text": "Excellent service & professional staff - great quality and selection.  Aly was helpful and offered  exceptional customer service.", "pics": null, "resp": {"time": 1621608071612, "text": "Hi Jane,\nThanks so much for the feedback. We're thrilled to hear you were met with excellent customer service. We value your feedback and always look forward to new projects. Take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "107178518131004092694", "name": "Brandy Lassiter", "time": 1602098098535, "rating": 4.0, "text": "I absolutely adore this place everyone is very friendly very proactive to your needs and the manager awesome great personality all the way down to the person that load your vehicle superb service. Great products at a affordable price check them out.", "pics": null, "resp": {"time": 1602263584027, "text": "Hi Brandy,\nThanks for taking the time to leave a review. We're happy to hear you have great experiences at our showroom. We value your feedback and hope to have you in the store again soon. Stop by and see us anytime, take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "103408315786742721066", "name": "Daphne Tyson", "time": 1587497408858, "rating": 5.0, "text": "Excellent customer service. We are doing a bathroom remodel and needed shower hardware right away. Chris Uhle and Robert Benton were able to help us get the products we needed and I was able to do everything by phone and email which is so comforting considering our current health crisis. I will definitely use this company for our upcoming renovations!", "pics": null, "resp": {"time": 1587744401632, "text": "Hi Daphne,\nThanks for the review. We're happy to hear working alongside our showroom team on your bath remodel was a great experience. We appreciate your feedback and will definitely pass it on. Come back and see us anytime, take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "109339524910335298568", "name": "Bill Hart", "time": 1619047759832, "rating": 5.0, "text": "Great place, helpful people", "pics": null, "resp": {"time": 1619193510787, "text": "Hi Bill,\nThanks for taking the time to leave a review. We're happy to hear you have great experiences at our showroom. We value your feedback and hope to have you in the store again soon. Stop by and see us anytime, take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "118051288075841025805", "name": "michelle dickens", "time": 1565639419601, "rating": 5.0, "text": "Excellent customer service. Good selection of products. Very pleased with my purchase. They even shipped the tile for me.", "pics": null, "resp": {"time": 1565967073929, "text": "Hi Michelle,\nThanks for taking the time to leave a review. We're so happy to hear you enjoy visiting our showroom and working with our team. We appreciate your feedback and hope to have you in the store again soon. Come back and see us anytime, take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "112389886032612330392", "name": "Kelly Pennell", "time": 1553650654256, "rating": 3.0, "text": "I give Scott 5 stars for great service, but overall Pro Source gets 3 stars for communication. Was told our tile would arrive in 5 days, but it's now day 15. I understand that they can't control delivery, but they should contact their customers to let them know about changes.", "pics": null, "resp": {"time": 1553875298578, "text": "Hi Kelly,\nThanks so much for taking the time to leave a review. Reviews are integral to our continuous growth as a showroom and client and member satisfaction are our top priority. We are disappointed to hear about the problem with the delivery of your tile from the supplier and apologize for any inconvenience."}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "103642412368845748335", "name": "richard chambers", "time": 1568989791229, "rating": 5.0, "text": "Premier service - they recently went out of their way to help ship an order when it did not arrive on time and helped to save our project timeline. Great company, I highly recommend you giving then a call or stopping by and asking for Allan.", "pics": null, "resp": {"time": 1569254723572, "text": "Hi Richard,\nThank you for taking the time to leave a review. We're so pleased to hear you enjoyed working with our showroom team and received fantastic service. We appreciate your feedback and can't wait to have you in the store again soon. Take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "107647055040877218769", "name": "Carolyn Hasser", "time": 1560798082044, "rating": 5.0, "text": "The people there were so helpful and had exactly what I wanted. They helped me with ideas and concepts. The prices were in line with what is available out there.", "pics": null, "resp": {"time": 1561137945383, "text": "Hi Carolyn,\nThanks for the review. We're so happy to hear you enjoyed working with our showroom team. We truly appreciate your feedback and hope to have you in the store again soon. Take care!"}, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "104123382483517885619", "name": "John Doss", "time": 1365692941738, "rating": 5.0, "text": "This place is awesome they have a huge show room with a very wide variety of selections. The Price is is wonderful, and Aly is an Amazing sales lady she has more knowledge of products, installation techniques, and designs than most flooring contractors I have met. be sure and go by and visit ProSource you'll be impressed like we were. PS I'm a contractor not a store employee.", "pics": null, "resp": null, "gmap_id": "0x889a4d001e58bc15:0x74867f26c26bd6e1"}
{"user_id": "100614351892959277109", "name": "Lucas Gambino", "time": 1616943308033, "rating": 5.0, "text": "We hired this company to remodel our kitchen. We did not have much knowledge about these types of projects, so we really needed someone who could provide us with insight and direction. This company was everything we could have asked for. They provided a step-by-step instructions on how to think about our remodel project, and offered continuous support and great ideas along the way. We never felt like we were asking too many questions. They were extremely easy to work with. We receive personal attention from the owner and his wife. And even better than the service perhaps was the great price.  We receive tremendous value and would hire them over and over again. After having looked around before hiring them, I feel confident that there is no other kitchen remodel company in the state that is even close on service, price or quality.", "pics": null, "resp": null, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "115773609517933847607", "name": "Aaron Waters", "time": 1619795068752, "rating": 5.0, "text": "I have purchased appliances from European Kitchens of Alabama twice and would not hesitate to purchase again.  Loay and May are tremendous to deal with and have always put our needs above theirs.  I cannot say enough good things about them.", "pics": null, "resp": null, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "115403229510293909478", "name": "Misty Fontenot", "time": 1598621948829, "rating": 5.0, "text": "We love Loay and his amazing showroom and products. When we renovated a historic home in Highland Park, we went to visit him for our entire suite of kitchen appliances. I found the stove of my dreams (a Bertazzoni) that he had in the back and gave us an amazing deal on it - and on everything. My spouse is an Architect and works with him a lot because he’s awesome and so is the business!", "pics": null, "resp": null, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "103868470619748563661", "name": "Rachel Petry", "time": 1567801548966, "rating": 5.0, "text": "Great experience! We just bought our appliances for our kitchen - I shopped online and this place is competitive! Plus amazing service and hospitality! Great selection and beautiful kitchens!", "pics": null, "resp": {"time": 1568046545091, "text": "Thanks Rachel! Glad you found appliances that worked for you with your taste and aesthetics. Don't hesitate to reach out if we can do anything else for you. -Loay A., Principle"}, "gmap_id": "0x88891bba11dee7db:0xcff8856ed11b5705"}
{"user_id": "108837936620002335712", "name": "Dan S", "time": 1620491461415, "rating": 5.0, "text": "Great place for your bathroom remod", "pics": null, "resp": {"time": 1620654603826, "text": "Thank you for your kind review!"}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "108438315419328056852", "name": "Ann Stafford", "time": 1605112750413, "rating": 5.0, "text": "\"Thanks to Billy, Wade and their crew for tracking down a perfect match for my 20+ year old countertop when we changed from a slide in range top to a drop-in cooktop. Other businesses wouldn’t even try! It looks like it has been there always. I could not be happier!\"", "pics": null, "resp": {"time": 1612448473275, "text": "Thank you for your valuable feedback!  We are pleased to hear you had such a successful, pleasant experience with your countertop remodel.  We hope you enjoy it for many years to come!"}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "108666075920899171511", "name": "James Weston", "time": 1612373512662, "rating": 5.0, "text": "Very knowledgeable and helpful.", "pics": null, "resp": {"time": 1612448215608, "text": "Thank you for your valuable feedback!"}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "101358674874222943373", "name": "Jo Sandelin", "time": 1554511930158, "rating": 5.0, "text": "My experience with Kitchen and Bath Center has been exceptional. They stand behind their work. They are a true, honest business!", "pics": null, "resp": {"time": 1554729598642, "text": "Thank you for taking time to post such a nice review.  We enjoy helping our customers meet their design goals and look forward to working with you on any future endeavors!"}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "116376498923163551082", "name": "Christina Morgan", "time": 1554606512274, "rating": 5.0, "text": "Great selection! The staff is always friendly and available to you for any questions.", "pics": null, "resp": {"time": 1554729489874, "text": "Thank you for selecting Kitchen & Bath Center!  We look forward to working with you on any future projects."}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "115871835122998128328", "name": "Sabrina Corbin", "time": 1554607693209, "rating": 5.0, "text": "Very pleased with my experience! Everyone was so kind and helpful.", "pics": null, "resp": {"time": 1554729323887, "text": "Thank you for your allowing our team to serve you!"}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "108368470538355511571", "name": "Clinton Mills", "time": 1515516002089, "rating": 1.0, "text": "The woman was beyond rude toward my 85 year old grandmother whom was being more than easy to deal with.   It was sad.  Do not go here", "pics": null, "resp": null, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "112803458552650653881", "name": "candace anderson", "time": 1554651207300, "rating": 5.0, "text": "The staff was super friendly and helpful! I couldn’t have asked for a better experience at kitchen and bath center!", "pics": null, "resp": {"time": 1554729105859, "text": "Thank you for taking the time to post a review.  We strive to exceed our customer's expectations."}, "gmap_id": "0x889bb3c761f668db:0x5c32238027133327"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1624394784776, "rating": 4.0, "text": "Really like the store. Lots of options to choose from. Nicole was very responsive on the cabinet design and got the order submitted when completed in a timely manner. I would recommend.", "pics": null, "resp": {"time": 1624634423147, "text": "Hi Jennifer,\nThank you for the review. We're happy to hear you were pleased with your visit to the showroom. We value your feedback and look forward to your next visit. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115417472708461661662", "name": "Keith Quackenbush", "time": 1513117216757, "rating": 5.0, "text": "I walked in the showroom and was blown away by the selection.  After I walked in I was sooooo impressed by the service.\n\nWhat I will say is that this place is not 'cheap'... if you want 'cheap' 99 cent tile or carpet... go somewhere that sells cheap stuff.\n\nBUT! If you want builders grade, or really cool stuff at great low prices.... then they are well worth a visit! Ober 50,000 sample in a gorgous well lit showroom.\n\nBEST flooring, plumbing and cabinet showroom I have ever seen.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMAsWSQnpvqEinG4_-7BHSc9cf5dOYUiBbYhpvD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmQZUSVAiQmcYljVS6jqUbdDHg9JcSPXPNR8ik=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN67Z3MablSXoD3I4kLQPqT1l98dd4m8C-mgaFJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmqyXDZdlBASCRICrGo0YPK9RatM3okVnmGt3q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6-ttGcLCF0vBO0eO5WV4ZgvwrPX6Mx6n65tU2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPusxLNsi46rtmKB6uA0WP4pD65fL2-pi2FPjvO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMl89PSXSMdzD_Ud4LVchgmWK3gwM-AmuOf-CRr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7BLhQj-iNhkFnlIO0gNROJstBQ5JrR1gNK8Ha=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIeHtVFofEiKPeUr-ILATQkrZTgaw_BWIEMYas=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106499389525534900811", "name": "Seghers Pickard", "time": 1612396533032, "rating": 5.0, "text": "Overabundance of choices! Jeff was a great help, plus he has a really good eye for color. I was able to pick out carpet, luxury vinyl plank, kitchen cabinets, tile backsplash and grout, and countertops. So many choices of such beautiful products. Can't say enough about this one-stop-shopping hidden gem in Pelham!", "pics": null, "resp": {"time": 1612539594693, "text": "Hi Seghers,\nThanks so much for the feedback, We really appreciate you taking the time to leave a review! We pride ourselves on having the best quality materials with plenty of choices and are thrilled to hear you enjoyed working alongside Jeff. Come back anytime!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "118411282663125310378", "name": "Henry Strevy", "time": 1614081970485, "rating": 5.0, "text": "They have the best and they are very nice and polite", "pics": null, "resp": {"time": 1614353852498, "text": "Hi Henry,\nThanks for the review. We're happy to hear your visit to the showroom was a success and our team was able to be of service. We value your feedback and always look forward to new projects. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "108654884351566354484", "name": "Ben", "time": 1590168050094, "rating": 5.0, "text": "ProSource has been so easy to work with. They give great advice and don't rush like the more well known franchises and big box stores. I will use them again when I do my next renovation.", "pics": null, "resp": {"time": 1590758905997, "text": "Hi Ben,\nThanks for the review. We're elated to hear you enjoy working with our showroom and that the process was easy going. We appreciate your feedback and always look forward to new projects. Come back and see us anytime, take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "113203519863552748548", "name": "Jeff Pierce", "time": 1573190690391, "rating": 5.0, "text": "So happy we found this place! Prices and quality were outstanding but the help we received from Christoper, one of the family members that own it, was invaluable. Although they do a lot of business with pro contractors, Christopher took the time to help us (DIYers) select cabinets, a soaker tub and fixtures. We highly recommend ProSource! Jeff", "pics": null, "resp": {"time": 1573225419868, "text": "Hi Jeff,\nThanks for taking the time to leave a review. We're so pleased to hear you enjoyed utilizing our showroom and working alongside Christopher. We appreciate your awesome review and look forward to your next project!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102189620606858087351", "name": "George Sadowski", "time": 1527180524179, "rating": 5.0, "text": "If you have not shopped at pro source then you need to. The selection by far is the best in the Birmingham area the store room is beautiful as well as the selections of products. I must say the staff is excellent. I highly recommend that you stop in even if you are not building or remodeling and once you do, you will go home with ideas so that you will want to remodel.", "pics": null, "resp": {"time": 1527255292961, "text": "Hi George, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience and hope to see you again soon. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "104377946049587942150", "name": "Barbara Klein", "time": 1524774646911, "rating": 5.0, "text": "I had the opportunity of consulting, with Chris at Pro Source.  He was very patient, friendly and a good listener, of what products I was interested in. I had a kitchen flood that affected three rooms, with flooring needing tile/ carpeting, as well as, . backsplash tile. He had a wealth of knowledge, of all their materials and shared advice on my possible interests.  I was given many samples to take home to see\nthe colors, with my lighting and existing colors I was trying to coordinate together. I would highly recommend Pro Source materials  and Chris making my remodeling a good experience.", "pics": null, "resp": {"time": 1525881173963, "text": "Hi Barbara, thank you for taking the time to leave your feedback. We are pleased to hear that you had a great experience and will pass along your kind words to Chris."}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102114088470396655242", "name": "Mitch Jones", "time": 1527179963301, "rating": 5.0, "text": "We needed to remodel a rental property and had gotten several quotes from different people before going to ProSource.  ProSource had the BEST prices AND they were the most eager to help us find what we needed within our budget.  Christopher and his staff are FANTASTIC!! Great showroom too, highly recommend them!", "pics": null, "resp": {"time": 1527255264402, "text": "Hi Mitch, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience and will pass along your kind words to Christopher. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "111284215726827876082", "name": "Brenda Lynn", "time": 1533404830865, "rating": 5.0, "text": "ProSource is a fabulous place to work. The Pancners are great people to work for and with. The other employees are great, too. It is a happy place to work and shop.", "pics": null, "resp": {"time": 1533837926223, "text": "Hi Brenda, thank you for taking the time to provide your feedback!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115384948953016513077", "name": "Tim Johnston", "time": 1506462599700, "rating": 5.0, "text": "Hands down the best,cleanest, well lit showroom in the Greater Birmingham area... Great selection of flooring, cabinets countertops and K&B!  The service is excellent and the staff is friendly and knowledgeable and really cares about getting you the look you want!", "pics": null, "resp": {"time": 1507219260743, "text": "Hi Tim, thank you so much for the positive review! We are glad that we can offer such a large selection to our customers. Come back on the next project!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115918866966240008698", "name": "Joy Cannon", "time": 1534078930079, "rating": 5.0, "text": "Jessica and Christopher were so friendly, helpful and patient.  They made the daunting task of choosing from so many products easier and fun!", "pics": null, "resp": {"time": 1534527562677, "text": "Hi Joy, thank you for taking the time to provide your feedback! We are pleased to hear that you had a positive experience and will pass along your kind words to Jessica and Christopher! Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "104832565774838115634", "name": "Sue Smith", "time": 1510867749351, "rating": 5.0, "text": "Pro Source in Pelham has an outstanding selection & the staff is top notch.  Special hat tip to Cody Barrett, my account manager.  He has had the patience of a saint & couldn't be more helpful!  Can't say enough good things about this Pro Source.", "pics": null, "resp": {"time": 1511815607049, "text": "Hi Sue, thank you so much for the positive. Review we are so happy that we could help you with your project needs. See you on the next one!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "103807881521583055200", "name": "Amanda Larson", "time": 1513902296158, "rating": 5.0, "text": "This place is wonderful.  Everyone who works here is so helpful.  ProSource is perfect for all your flooring needs.", "pics": null, "resp": {"time": 1513005364215, "text": "Hi Amanda, thank you so much for the 5-star rating. We really appreciate it. See you again soon!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "110433268411200516916", "name": "Matt Lewandowski", "time": 1506469633402, "rating": 5.0, "text": "Employees were knowledgeable and helped us through our project, specifically Mr.Chris Pancner. We have a home in Fairhope and had our product shipped to their other location in Pensacola. I was able to pick up the material, which was wrapped perfectly. The warehouse guys were friendly and made sure I had everything I needed as well. Will be sending all I can to you guys, thank you so much!", "pics": null, "resp": {"time": 1507219295786, "text": "Hi Matt, thank you so much for the positive review. We will make sure to pass on the compliments to the rest of the showroom - they will be thrilled! See you again soon."}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "118064429393032855273", "name": "Kate Victory", "time": 1512669624877, "rating": 5.0, "text": "Beautiful showroom with tons of selections! Instead of searching all over town, I was able to get the majority of my material here!", "pics": null, "resp": {"time": 1513005391361, "text": "Hi Kate, thank you so much for the positive review. We appreciate the feedback and look forward to working on our next project together!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "117244924662295034674", "name": "george pancner", "time": 1501701572077, "rating": 5.0, "text": "Beautiful showroom, knowledgeable staff, 40,000 selections and lowest prices in town.", "pics": null, "resp": {"time": 1501862536788, "text": "Hi George, thank you so much for positive review. We are happy that we can offer a wide range of products at low wholesale prices. Hope to see you soon!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106348363915782145772", "name": "Taylor Reed", "time": 1527192632370, "rating": 5.0, "text": "They have a beautiful showroom with lots of options and a helpful staff to answer all of your questions.", "pics": null, "resp": {"time": 1527255320066, "text": "Hi Taylor, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106738619137973725477", "name": "Jessica Richardson", "time": 1506462484468, "rating": 5.0, "text": "Awesome selection, tons of choices, and super helpful staff!", "pics": null, "resp": {"time": 1507219232918, "text": "Hi Jessica, so good to hear that we could help with your project. Thanks for the positive review and hope to see you again!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102833056806295618753", "name": "Teresa MacDonald", "time": 1596229413275, "rating": 5.0, "text": "I love my new countertops! Thank you so much to everyone at Executive Granite for making this such a great experience🙂🙂", "pics": null, "resp": null, "gmap_id": "0x889a0fff27197b9f:0x6f5ea7293cdad61"}
{"user_id": "110857015520018782513", "name": "Sylvia Elizabeth", "time": 1576780658483, "rating": 5.0, "text": "These people at this company are all wonderful!", "pics": null, "resp": null, "gmap_id": "0x889a0fff27197b9f:0x6f5ea7293cdad61"}
{"user_id": "103557045848986014589", "name": "Sherri House", "time": 1530805743072, "rating": 5.0, "text": "These guys are amazing. They do great work and their customer service is outstanding!", "pics": null, "resp": null, "gmap_id": "0x889a0fff27197b9f:0x6f5ea7293cdad61"}
{"user_id": "108346923478261534226", "name": "David Pham", "time": 1615587289188, "rating": 5.0, "text": "The price is extremely good here and the helpers are great.  The price is softer than homedepot and low.  I will come back", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP6fYvwMAksYKUwAJlrSCy7_WzTQrCKEWYns-hi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNEWmbtT1fR_3d7BIAk72TzPjY_1HH1Mgf3LoLz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOtyJ11-MHhLLXyyX9iyow5Cb0ZK43FbQZFPuEQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM59avxTYJMKHLrWQQzT4Nj8814_qXjdftQgLaG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZeu9ydDGF_Zy2tcZvH-oyTvo5egXnH78QQ_QF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6riJbFX4EXynAH7vl_qNIuoiswqWz7TXz3D3l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOjw5isgqJQArFw0-pihOynn4zzwhuVprcNG2GA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWFSYNYD7hdOXANQtYSel5952-e5rbWKj5sLbM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCZm7rMA3FZf4atMi_J4LA8jGycOB8tIpAE5tF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdLeJWZFrDQS0YiAc0kkB39V6TE1q198x2Uaw0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPoM7sc2Xey-yQiN5J0uclqFFY7gyx3h1FsVbQ6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKfX9c-DD71B4i5Jv9T2kSBltrLRnkGOFv1daS=w150-h150-k-no-p"]}], "resp": {"time": 1615908899906, "text": "Thank you, David. The lumber market is challenging right now. We do our best to keep our prices competitive, our product in stock and our service levels high. Thank you for your kind words. We appreciate your review and your business."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "106093423228486844049", "name": "William Bowden Jr", "time": 1615904495676, "rating": 5.0, "text": "Always a wonderful experience with this Company. Lowest prices, always stocked, great customer service.", "pics": null, "resp": {"time": 1615908785755, "text": "Thank you for the kind review. It's definitely been a challenging year for lumberyards (and our customers)! We appreciate your kind words and your business. Please let us know if there's anything we can do to service you even better."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "103233651683445890451", "name": "Wood Kirk Works", "time": 1601070570106, "rating": 3.0, "text": "Even though the staff seemed knowledgeable about the products offered here, the vibe of this business is pretentious to say the least. I came in with my girlfriend and her son. We came within 6 ft of several middle-aged employees and weren't greeted once. I had to approach the counter and ask for what I needed (which they didn't have) then I was left to my own devices finding anything else useful in the store. This could have been tolerable if it weren't for the same employees greeting other customers with warm, inviting hellos and good wishes.", "pics": null, "resp": {"time": 1601671160351, "text": "We apologize that you did not feel seen and appreciated in our store. We pride ourselves on customer service, whether its to contractors who come in every day or first time shoppers. We are fully open to the public and value our customers equally. We failed to demonstrate that. We hope you'll give us another opportunity to earn your business."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "112524381562508807213", "name": "Jabaria Dent", "time": 1616799348859, "rating": 4.0, "text": "Good customer service. And their wood prices beat Lowe's", "pics": null, "resp": {"time": 1618326131069, "text": "Thank you for this review. We hope this helps new customers know that, while we are not a global corporation like Lowe's, our prices are  very often lower than the big box stores."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "107931230024836741481", "name": "A T", "time": 1598359183319, "rating": 1.0, "text": "I ordered fence pickets from them, paid over phone, and had delivered a week later no problem. I call back a few days later to ask if I can get a few more and am told they haven't had any in weeks and I must be confused about who I got them from. I call back the next day and am told there's 30 left but they don't take payments over the phone. It sounds to me like the employees each have their own rules they go by 🙄", "pics": null, "resp": {"time": 1598366268488, "text": "Hi. We apologize for our poor communication. We should have done a better job explaining the fence board situation. The market for fence boards is extremely turbulent right now. We are accustomed to having a ready supply in stock and ordinarily we would be happy to take an order over the phone and hold the inventory. However, because fence boards are in such high demand and we haven't been able to source them with the dependability of the pre-COVID days, we are discouraging our staff from reserving them, because the last thing we want is a customer to pay for a product, expect it, and we not have it in stock when they are ready for delivery."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "100715195038164185128", "name": "Andrew O'Dell", "time": 1608779245588, "rating": 5.0, "text": "Good lumber at a good price, knowledgeable and very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "107823734177246061917", "name": "Manuela Smith", "time": 1614714770985, "rating": 3.0, "text": "Was disappointed by employees knowledge and selling me the wrong tool to fit the screws I bought there.", "pics": null, "resp": {"time": 1614784325875, "text": "Hi Manuela. We remember you coming in yesterday. We apologize for disappointing you. It's often difficult to discern the size of a screw or bolt from a cell phone image. We suggested a product that would work on a range of bolt sizes, but unfortunately we didn't guess right. Thank you for your business and again we are sorry we weren't able to help you select the right product the first time."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "108158918265526376923", "name": "Ray Keene", "time": 1618323857094, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": {"time": 1618325788645, "text": "Thank you for the kind words, Mr. Keene. We appreciate your business."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "103315866228837292055", "name": "Priscilla Young", "time": 1607978232964, "rating": 5.0, "text": "Friendly environment, eager to assist, fast service.", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "113851407910140641782", "name": "Michelle Morgan", "time": 1573785817058, "rating": 5.0, "text": "We have been remodeling our home and I have been looking for a front door for about 2 months now with no luck and very little enthusiasm to sell me a door.  I happen to stumble across Mobile Lumber and Yvette was a breath of fresh air when it came to picking out the perfect front door.  She was very knowledgeable, nice, fast and her follow through was great.  Within 24 hours she had my pricing and order placed for me, even saved me a trip back to West Mobile by handling everything over the phone.  Excellent customer service, I only wish we would had checked Mobile Lumber out at the beginning of our remodel adventure.\n\nThanks so much Yvette,\n\nMichelle Morgan", "pics": null, "resp": {"time": 1575666940762, "text": "Thank you so much for your kind words and for taking the time to give us this review. We appreciate it and so does Yvette. If there's anything else we can help you with in the future, please let us know."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "105954273677471257466", "name": "Heather w", "time": 1596555157116, "rating": 1.0, "text": "Went there a couple of Saturdays ago to look at front doors. Complete waste of time. We were not greeted when walking in, no one came over to assist us, or acknowledged us when we left. Not much selection out on the floor for what we were looking for and no customer service was offered.", "pics": null, "resp": {"time": 1598363710999, "text": "Hi Heather. We pride ourselves on our customer service, which is one factor that differentiates us from the big box stores. We failed to provide that experience to you and we apologize. Our team is very knowledgeable in exterior door options and we regret that we aren't able to help you select the perfect door for your home. We appreciate you coming in and hope you'll give us another chance."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "117830931896165221327", "name": "2SSRS 5th Gen", "time": 1609166574734, "rating": 4.0, "text": "Prices are kinda high. But they also aren't MASKHOLES.", "pics": null, "resp": {"time": 1611759853792, "text": "Thank you for the review. We agree, lumber prices are on the high side right now, but that's across the industry. Lumber is a commodity and prices fluctuate daily (sometimes hourly) depending on the market. We value our reputation for pricing our building materials extremely competitively. It's part of what has kept us around since 1975."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "101539777611793326877", "name": "OBrien Holcombe", "time": 1547827670244, "rating": 4.0, "text": "This place has been here for decades and at least 4 of those decades I have used them for many project needs. Good folks, wonderful environment and the men in the yard do not get enough praise. So here is to you gentlemen for doing such an outstanding job day in and day out.", "pics": null, "resp": {"time": 1547830796310, "text": "Brien, we certainly appreciate your support and patronage over the past 4 decades! We will pass this praise along to our guys in the yard. If we can do anything to make your experience even better, please don't hesitate to let us know."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "105812719345824943807", "name": "Josh Lee", "time": 1610523659395, "rating": 5.0, "text": "Friendly and speedy", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "104650166633173224679", "name": "N Vasko", "time": 1585943741332, "rating": 1.0, "text": "Watch out, they do not always accept returns on some items and they will not give you a heads up", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "113536626796489248141", "name": "Stephen Williams", "time": 1503008269642, "rating": 5.0, "text": "Great for any project.  Excellent contractor services as well.  Can usually fill a large order in a small amount of time.  Quality products, friendly staff and competitive pricing.  Delivery available.", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "104226944575453480630", "name": "Bernard Jackson Jr", "time": 1600963809939, "rating": 5.0, "text": "Always prompt service at Mobile Lumber .", "pics": null, "resp": {"time": 1601671451224, "text": "Thank you for the kind words. Some days are busier than others, but we understand the value of our customers' time and try to get you what you need efficiently so you can keep your jobs moving."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "114344371290066086386", "name": "Conner Jung", "time": 1548592392098, "rating": 5.0, "text": "My preferred place to buy my lumber and materials. The workers here can break down piece by piece on what you will need for anything you are building. The workers here go above and beyond for first time builders and professional builders. Would go here over Lowes or Home Depot in a heartbeat!", "pics": null, "resp": {"time": 1551192420650, "text": "Thank you for your kind review, Conner. We appreciate you and your business!"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "114344371290066086386", "name": "Conner Jung", "time": 1548592392098, "rating": 5.0, "text": "My preferred place to buy my lumber and materials. The workers here can break down piece by piece on what you will need for anything you are building. The workers here go above and beyond for first time builders and professional builders. Would go here over Lowes or Home Depot in a heartbeat!", "pics": null, "resp": {"time": 1551192420650, "text": "Thank you for your kind review, Conner. We appreciate you and your business!"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "117074958580553631958", "name": "Mike Price", "time": 1544210346879, "rating": 5.0, "text": "This is the best hardware store in Mobile.  Much more a home town store.  They treat you like a person not a number.", "pics": null, "resp": {"time": 1547830884725, "text": "Mike, thank you for the kind words and for your patronage. We appreciate you!"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "116089426368726814618", "name": "Lee Roberts", "time": 1554394124862, "rating": 5.0, "text": "Love mobile always have what i need at a great price. And awesome service been using them since it was staceys hardware.", "pics": null, "resp": {"time": 1567001399184, "text": "Lee, we appreciate your patronage and support after all these years!  Customers like you are the reason we've been able to to stick around and serve our community for 40+ years."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "112453770636574146676", "name": "Sara Brunson", "time": 1554296444966, "rating": 5.0, "text": "ML is a great place for all your building needs. The staff is Amazing.", "pics": null, "resp": {"time": 1554386884838, "text": "Thank you, Sara. We agree! ;)"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "116984742721714556307", "name": "Alvin Nelson", "time": 1554307940287, "rating": 5.0, "text": "Local business ready to help.  They are busy so give yourself some time.", "pics": null, "resp": {"time": 1554386852831, "text": "Your review put a smile on our faces today! You're right-- we do get busy when the weather gets as pretty as it's been this week, but we do our best to get our customers in and out as quickly as we can. Thank you for your kind words and patience."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "106188284164482777175", "name": "Ronnie Cliburn", "time": 1539794391830, "rating": 4.0, "text": "The folks there are really friendly and helpful. They don't have the amount of different stuff the Lowe's and home Depot have, but I would rather go there and check first for what I need.", "pics": null, "resp": {"time": 1551193246534, "text": "Thank you for the review, Ronnie. Let us know what you're looking for and we'll always be happy to help you find it, even if it's through another vendor, or we can often order it from our warehouse. See you soon!"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "113811168226354326175", "name": "Detroit Q", "time": 1534818397458, "rating": 1.0, "text": "Some of the worst customer service I have ever experienced. I had never been to this place so I was unsure if customers were allowed to walk through the warehouse. Naturally I ask the clerk at the desk or at least tried to ask and when I say this guy gave the impression that he us too busy to deal with me. The guy wouldn't even stop typing or even give me the common decency of looking at me when he responded. At first I was thinking maybe I was asking to much due to me being a vet and being so use to people at least looking at you to acknowledge your existence but when he proceeded to continue typing and responding with very short answers I knew then it wasn't me. Everyone is entitled to a bad day and I get that but you work in the customer service industry for God sakes. A little hospitality would go a long way. I guess it's on to the next lumber yard.", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "113935054441013653355", "name": "Paul Miller", "time": 1534276415679, "rating": 5.0, "text": "I shopped around and ended up doing my business here.  Well priced and very helpful", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "115613921391370797168", "name": "Eric Linsley", "time": 1517680660460, "rating": 5.0, "text": "Great service. Best trim moulding prices in town!", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "105538156527274798387", "name": "Mark James", "time": 1531948203152, "rating": 5.0, "text": "Good place to get all your buildings needs", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "106807522042792707927", "name": "Katherine Winslow Austill", "time": 1467771695634, "rating": 1.0, "text": "The items I purchased were not available & what was available was not 1st quality.\n\nNone of the items offered for pick-up were straight & defect free.\n\nI had to be very firm in my demand for a full refund.\n\nThe experience took over 1.5 hours to:\n1) place the order\n2) have the order hand written\n3) pay for the order\n4) drive around to pick up the order\n5) walk inside and inform of the poor quality and insufficient quantity\n6) walk back out to pick up to show inside sales the poor quality and insufficient quantity\n7) walk back inside to ask - then demand a refund\n8) wait while the entire order was again hand written and wait for my refund\n\nA complete waste of time.\n1.5 hours to accomplish nothing.", "pics": null, "resp": {"time": 1468249930853, "text": "Hi Katherine. We hate hearing that you had such a bad experience at our store! We are trying to track down your transaction to figure out what happened so it won't happen in the future. Providing an excellent customer service experience is very important to us! Would you be willing to talk to our store manager Lee to help us understand what happened? You can reach him at 661-8000. Again, we are sorry for any inconvenience we caused you."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "111255396583886078486", "name": "Denise Keaton", "time": 1389218971408, "rating": 5.0, "text": "Don't go anywhere else to pay high dollar for bad wood.  Come to Mobile Lumber and get the good stuff from people who care.", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "105994050331829418711", "name": "Sam Walters", "time": 1516061574588, "rating": 5.0, "text": "Great prices, nice people that work there.", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1526147849154, "rating": 5.0, "text": "Lennor is great to work with in Commercial Sales", "pics": null, "resp": {"time": 1551193347602, "text": "We think so too! Thank you for your review and your business, Mark!"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "109385372099975720060", "name": "Ronnie Wilson", "time": 1489682474535, "rating": 1.0, "text": "OUTRAGOUS PRICING ON A PLAIN OLE #2 10' 1X4' PINE 2.50SOMETHING EACH ARE YOU KIDDING?? REDICULOUS", "pics": null, "resp": {"time": 1489757947834, "text": "Hi Ronnie. We pride ourselves on offering competitive pricing on our building materials. We'll be happy to match our competitors' pricing on this item if you find it for lower."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1528560823759, "rating": 5.0, "text": "Better quality than Lowes", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "117358378778702261778", "name": "James Callaway", "time": 1551191612490, "rating": 5.0, "text": "Very helpful great staff !!!", "pics": null, "resp": {"time": 1551192373045, "text": "Thank you for your kind review. We appreciate your support!"}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "104912082747803358691", "name": "Kel Moy", "time": 1589464106777, "rating": 5.0, "text": "Some deals here", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "113790079837504377365", "name": "Johan Arcenal", "time": 1607809980299, "rating": 4.0, "text": "Cheap", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1510069241676, "rating": 1.0, "text": "This company has a track record for never having the right lumber delivered at the right time. Time = money. As I'm watching the framing company wait for Mobile Lumber to bring the materials to Dauphin Island as I type this, I'm wondering why it's Tuesday and they've wasted all our time. You should fire your lumber salesman...", "pics": null, "resp": null, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "103456758956559211620", "name": "William J Fulford", "time": 1551193901671, "rating": 4.0, "text": "They getting better", "pics": null, "resp": {"time": 1554388775676, "text": "Thank you for noticing!  We've implemented some new practices in our yard to increase efficiencies for our customers. Our goal is to be always improving."}, "gmap_id": "0x889a4b529e62870d:0x857cc660bf28b7be"}
{"user_id": "101513151186798138867", "name": "Deirdre Taylor", "time": 1622688512722, "rating": 3.0, "text": "I only go to home Depot if Lowe's doesn't have what I need, and that's rare. I always have a problem picking up orders. You can't just call in to have it brought to you by curbside because they claim to be too busy to get your information. When you go in, if the order is not in that little closet behind them, they'll just tell you it's not there rather than to go to the back and get it. I order a lot and never have a problem with Lowe's. It took an act of congress to finally get my complete order from Home Depot. One young lady, Kia went out of her way to help me and it wasn't even her department. Thanks to her I have everything. I only shop here when I absolutely have no choice.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104964551689477447064", "name": "Anithea M", "time": 1612635352740, "rating": 5.0, "text": "Got in and got out! Found what I wanted on the app!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPEJJ19L9HY6S3BHuCEDa7leYXYOhx0EhmbABvc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111996270626342312335", "name": "Liz R", "time": 1622766599420, "rating": 5.0, "text": "Everything seems to be easy to locate. If you are using The Home Depot app most of their inventory counts are accurate or up-to-date for products on shelf", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114499768142150027895", "name": "Silvery Nova", "time": 1615510726435, "rating": 1.0, "text": "The first problem is the delivery service company that Home Depot uses for direct deliveries,Central Transport. My 1st initial delivery date changed three time before it was actually attempted to be delivered on March 3rd. On March 3rd the shipment came on a long bed truck with a pallet dolly. My shipment is a pallet of 33 boxes of porcelain tile., plus 7 additional boxes they put on the same pallet. The right side of the pallet was coming apart due to the immense weight of the tile . The driver could not move the pallet down the truck. He was not going to be able to pull it up the small slope on my driveway. What on earth were they even thinking?They needed a fork lift. I called Home Depot and they got the Transport company on the line while I was on hold. I ended up being told the transport company needed to take care of this and they would contact me in 24 to 48 hours. Which they never did. I had to call them. On 3/5 Friday I called central transport and they told me the shipment would be delivered on Monday between 11 and 12. They never showed. I checked the shipment tracking and found that they changed it to Tuesday 3/9! I got no call, text, or phone call.So Tuesday 3/9 I message them to find out eta. They said the drivers hadn't left yet and to keep checking they will update me. That never happened. So I wait and wait and I get a call from Home Depot letting me know the tile has arrived at THE STORE. I was never told anything about this.They will be delivering the tile on Monday 3/15....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101221607261505326604", "name": "Benny Woods", "time": 1523533187461, "rating": 5.0, "text": "Really nice store they have just about anything you're looking for tools paint Lumber home appliances shingles sheetrock power tools tool boxes cement ceiling fans lawn mowers", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9qFYleXfGd8KsqAHKPFKBrpyGVTFE3PKy7jts=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcIGMGhvMzavg-KCdLgIa_5JylqQpyzmiuugjw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOFgEh8h0T-OdPoH9Dlk1k4dEAGlgWxHqtAtQI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMRjZ7grMLRGCv0Is4S8Rii6CmSagRRvz5m7Cy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110877374690689930464", "name": "Carolyn Ann Pitts", "time": 1618192368761, "rating": 5.0, "text": "GREAT SALE PRICE ON OUR DISHWASHER WE GOT WELL THEY ORDERED IT AND WE WILL GET IT ON APRIL 23. SALES ASSOCIATE WAS VERY SWEET AND VERY HELPFUL. THANKS FOR SUCH A GREAT SALE", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113417706957439140552", "name": "Cynthia James", "time": 1617413205829, "rating": 5.0, "text": "Online order pickup inside store was super easy. Total transaction was about 3 min. I even had someone ask me if I needed something. Unfortunately that night I was only browsing  but Thanks to the lady working in the appliances department for actually engaging.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111659223413567054206", "name": "Tiffany Reed", "time": 1620603244557, "rating": 4.0, "text": "Love home depot.. They had alot of stuff at decent prices and the employees were really friendly and helpful. They now have self checkout so checkout was a breeze too. It wasnt crowded and displays made things very easy to find on my own.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113432997716455065250", "name": "Sandra Cauley", "time": 1621983538747, "rating": 1.0, "text": "I went in the garden center and told girl at registry, that  I wanted 2 medium bags of Miracle-Gro potting soil, and help getting it n putting it in car.  No help came, then she told me go in back pick it up.  Finally realized she charged me for garden soil, I ask her to give me potting soil and charge me for the difference.  She said she couldn't, I had go customer service.  I told her I wasn't able, that why I parked out in front garden center and ask for help.  I told her I would eat the loss and never come there again.\n\nI don't like be hard get long with, but it was her mistake, why should I have go customer service, when I have trouble walking that distance.  I will use Lowes from now on.\n\nI'm a 100% Service Connected Disable Veteran.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113865377088864607035", "name": "K'Cee Ortiz", "time": 1616266636351, "rating": 4.0, "text": "Came just to check out the garden center/plants selection. Very minimal, but prices are decent. If looking for a larger selection of flowering, herbs, or trees go to Lowe's. Home Depot's tropical plant section is good however.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116088088101848650793", "name": "Kathryn Brakefield", "time": 1623539227378, "rating": 5.0, "text": "Clean ..well stocked..great customer service. Prefer Home Depot Mobile AL.  worth the drive from MS.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111949167487821334289", "name": "Michelle Williamson", "time": 1618344948983, "rating": 5.0, "text": "Great service as always! Purchased a small metal gate for my flower bed to keep the dog out but didn't realize the poles that stake into the ground were missing. They found them straight away when I went back and made it stree free", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100307314560605388116", "name": "Zash", "time": 1622489800680, "rating": 2.0, "text": "Needed some rope but it was locked up behind glass. Could not find an employee to help. Asked the Paint Dept person to call us some assistance. Waited 10 more minutes but no one came. Hunted down someone again but they didnt know the combination to the lock that was gaurding the rope. Was in the store 30mins just for 10ft of rope!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116484690062615838964", "name": "melissa renee", "time": 1619300009804, "rating": 3.0, "text": "The lady who sold us a washer and dryer was very nice no problems at all. I have a problem with the fact that they were supposed to be delivered at my house on April 21st. It got delayed so they moved the delivery date to Today ( April 24th ) but I never got any notification so I called and they told me that they don’t deliver to my area on saturdays, only Wednesdays and they don’t deliver when the weather is rainy. It’s been SUNNY all day. No bad weather AT ALL. Now the delivery date has been moved to May 12th. I will be giving birth in May so that’s really annoying 🙄 I ordered my washer and dryer on MARCH 3RD!!!  I hope the warehouse manager makes this right.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104240201754965289589", "name": "Jessie", "time": 1608187758221, "rating": 3.0, "text": "Went to buy an appliance that I saw online. Called the this particular store literally on my way over there. Young lady told me that indeed they had the sale item which I was inquiring about. I get to the store and spoke with someone worker in appliances I ask him again to verify of what I wanted. He walks back and confirms my injury. Rung me up just to realize he mentioned through conversation of the appliance he thought I was asking of. Which I corrected him and pointed out and literally touched again the same appliances that I wanted. Apparently some way some how after all this confusion. They magically had sold out. So my thinking leads me to believe the person I spoke to on the phone didn't bother to check or maybe something with system either way wasted my time and here's the kicker the way the guy tried to put it was like I could go to another home depot after I already paid. Luckily my bank released this debit transaction. Poor poor salesmanship and somewhere along the line communication is lacking. I hope I can revisit this location in the future without this issue.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117727525725400636738", "name": "Brent Jennings", "time": 1614037891713, "rating": 5.0, "text": "Great place to get your gardening supplies early picked up some tomato plants today I was surprised they already had them available", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115961453894344222231", "name": "Stanley Pettway", "time": 1611766885361, "rating": 5.0, "text": "“There’s something bout this Home Depot that keeps me coming back for more... it’s just NEAT for a home supply store. Peace.”", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110345849221491784161", "name": "byron wilmoth", "time": 1598928417542, "rating": 5.0, "text": "Used the online order and drive up to pick up option.  Ordering was very easy and so was payment.  Pick up was very clear and easy.  The whole process was clear and easy.  The young lady who brought out the order was superb!  So friendly and a breath of fresh air!  I actually feel bad because I lost the receipt and cannot remember her name so I could go back and submit a survey to help her employer see her worth.  If I get back there and she is there, I will make it a point to find out her name and then submit a survey for her.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109676816278255837627", "name": "Andrew Clark", "time": 1615316713646, "rating": 5.0, "text": "Nice customer service support. I love the garden center this time of year.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111994225692975806241", "name": "Mollie Newsome", "time": 1614431962599, "rating": 2.0, "text": "Aside from the staff of the paint store Home Depot could be better. The price is could be better and products should be easier to find.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112557907033870184990", "name": "Shianne Mitchem", "time": 1616525098218, "rating": 5.0, "text": "Love the garden center. If I could I would buy it all and bring it home.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102186728581377564199", "name": "William Mincey", "time": 1614990819561, "rating": 4.0, "text": "I'm a Lowes shopper myself but they had what I needed w knowledgeable staff that where eager to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105227513662855236040", "name": "Lisa Watkins", "time": 1606356715106, "rating": 5.0, "text": "We went at a perfect time when the store wasn't crowded. The team members were very pleasant and helped us select and load 2\"x6\"x8' deck boards. We shop at this store frequently.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110924236981351568400", "name": "Robert Jackson", "time": 1614645278739, "rating": 4.0, "text": "Always decently helpful staff and prices aren't to high unless your looking at lumber but that's not really their fault at the moment.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112076761294574915517", "name": "Titus Young", "time": 1622421005992, "rating": 1.0, "text": "Costumer service was horrible. I waited 30 minutes literally just to get a screw", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110612619121097252708", "name": "Katherine Riley", "time": 1612560858290, "rating": 1.0, "text": "The woman working in the kitchen dept. at the store on Schillinger Rd. was no help. I called to ask about my cabinet order, and she couldn't find it, couldn't find me in the system, and insisted I must be wrong. Later I found out my order had been there. She sounded very stressed out and somewhat rude. Oh well, it's Christmas time, and maybe she has a psycho family like I do, who have ruined another Christmas. It's ok honey, breathe, and hope they get what they deserve next year.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111509877702176760147", "name": "Joseph Fletcher", "time": 1597471794369, "rating": 5.0, "text": "HD is awesome. I bought a lawnmower with the app after shopping the store a prior visit. Curbside pick up was so easy. Their app is so much better than Lowe's. So many up to date items to make your house better vs Lowe's. Even the in store checkouts are very digital and up to date. Was a die hard Lowe's guy but visit here, it'll make you switch.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109401105095606555056", "name": "Kaitlin Hairston", "time": 1614361697517, "rating": 5.0, "text": "Always a good experience there. Good customer servicealready has items looking for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102644633938724459704", "name": "Thomas Long", "time": 1607914071145, "rating": 5.0, "text": "I shop this store often mainly because of a very helpful Associate Layden. He is very accommodating, friendly and helpful. This store should model every Associate after him! Thanks for your help!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106463529330046753090", "name": "Felix Gonzales", "time": 1623544075566, "rating": 3.0, "text": "Clean and nice ppl", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117618862829477315462", "name": "The Hulkster", "time": 1605802729623, "rating": 2.0, "text": "For the most part they have what you need just keep in mind do not rely on finding help ..to find what you need you literally have to look through several aisles to find anyone that works there. I also had to deal with one employee who had a very smart aleck attitude I almost told her just walk away it was that bad. Sometimes the clearance item priced stuff is phenomenal sometimes it's not a deal at all. The return warranty is a huge problem they want to make you pay a checkout fee for a broken item even if it comes back as broken and needs to be replaced they still want you to pay $35 diagnostics fee this is totally wrong on every level. I actually purchased a pressure washer could not get it to work they sent it off come back and said there was nothing wrong with it I said let's go to the garden center let's hook it up to hose and let's find out ..so finally they agreed after I insisted guess what it didn't work they still wanted $35. The extended warranty is 100% a joke it's just a way to steal money.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112594286035553588652", "name": "Cassandra Moultrie", "time": 1611326190945, "rating": 4.0, "text": "I went in to pay a bill. I was in and out. Cashier friendly and professional great attitude for dealing with the public.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104371656142578105016", "name": "John Curry", "time": 1617280599374, "rating": 5.0, "text": "So much better than lowe's for me", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103953237477058203326", "name": "SShaw6174", "time": 1615834206842, "rating": 2.0, "text": "People here want to draw a check not work. I much prefer Lowes in tilmans corner than this home Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107926670848471184896", "name": "Lel Dale", "time": 1596330984107, "rating": 5.0, "text": "I returned to this store hoping to find a freezer, & I did! Just the one I was shopping for. Ms Kendra went above & beyond to make sure it was delivered @ pickup. Thank U Ms Kendra & the other young lady who assisted U. U both r Store Gems! I hope The Home Depot thinks so to..stay safe while U serve. U r appreciated!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117281273727611378939", "name": "STEPHEN DAVIS", "time": 1618047057577, "rating": 4.0, "text": "Received very friendly  service in appliances from zjulie", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110827696071847299630", "name": "Chris Lang", "time": 1611255969820, "rating": 5.0, "text": "Store is clean and well stocked.  The staff is friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1596914302458, "rating": 4.0, "text": "I use this store a lot for my home improvement.  I love the garden section.  I bought beautiful Hibiscus plants for $6 and they bloom so beautiful they are the envy of the neighborhood.  The paint department staff is so friendly, knowledgeable, and helpful, I try to get all my paint there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118139140107495633477", "name": "Doctor Plagus", "time": 1596914302458, "rating": 4.0, "text": "I use this store a lot for my home improvement.  I love the garden section.  I bought beautiful Hibiscus plants for $6 and they bloom so beautiful they are the envy of the neighborhood.  The paint department staff is so friendly, knowledgeable, and helpful, I try to get all my paint there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111795258364355802064", "name": "Retros 4Life 79Boxing", "time": 1616490208934, "rating": 2.0, "text": "I had the worst Home Depot experience I've ever had in  30yrs of shopping at home depot. I came into the establishment and requested an automatic wheel chair due to injuries and the employee took forever to get the chair to me just to stop talk on his phone and seen me standing in pain but chose to help other customers instead of getting the chair to me 1st.  I changed my mind and ordered the products online to get delivered to my residence but Home Depot decided to ship my items to a store over 10 miles away from my home causing a real inconvenience.  I see why i started  shopping at their competitor majority of the time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110827696071847299630", "name": "Chris Lang", "time": 1611255969820, "rating": 5.0, "text": "Store is clean and well stocked.  The staff is friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107351363159104575026", "name": "JOKER Morris", "time": 1619239217138, "rating": 4.0, "text": "Had to buy a new stove. Wife blew up the old one.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102924211152045663679", "name": "Rimmy Bullock", "time": 1600702763210, "rating": 4.0, "text": "The staff is helpful, the selection is normal great, my only problem is all of the broken pots that you have to go though to find a good one. If something is broken, it should be removed form the shelves. I visited 2 days in a row to check to see if they put out new stock for something I wanted, but both times it was the same broken planters and pots.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116611600076308804343", "name": "Greta Hamilton", "time": 1587822445334, "rating": 5.0, "text": "Home Depot you Rock!!!  Excellent customer service, efficient, friendly and helpful employees. I had a bad encounter last night at Lowe's. I wanted a simple Storm door and could not find anyone in the store to assist me with the purchase. Could not even get the manager to the department to assist.  So I came to Home Depot this morning, was treated professionally and efficiently.  The employee came to me and asked if I needed help, I didn't have to go looking for him.  Thank you so much.  I will certainly be back.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114860446333793707617", "name": "Diane Tipton", "time": 1618168804546, "rating": 5.0, "text": "Bought a washer and dryer . Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113064211600259048958", "name": "Antoinette Harmon", "time": 1614111055363, "rating": 5.0, "text": "Got some plants they had some Awesome choices..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105884525324402918161", "name": "Randy Blocker", "time": 1612841948397, "rating": 5.0, "text": "Very well laid out with good stock on hand!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108898997234304606957", "name": "april ehlers", "time": 1609591883159, "rating": 2.0, "text": "The service was Horrible at this location.  I have always loved shopping Home Depot and I understand being short staffed but the employees here were just awful!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102579838281592558281", "name": "Lee Nichols", "time": 1618940324248, "rating": 5.0, "text": "Always good service and products.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110194388613042963994", "name": "B Tech Builds", "time": 1600552392531, "rating": 5.0, "text": "Great customer service looking to buy a shed. Staff was prompt knowledgeable and very helpful during the process highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117189553308850442003", "name": "SABINA SABINA", "time": 1616835432183, "rating": 5.0, "text": "I love their curbside pickup", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115456278350109820792", "name": "Rodney Moody", "time": 1609293739310, "rating": 4.0, "text": "Clean and made great efforts to be Covid safe.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115386481373515200688", "name": "Lauren Young", "time": 1596064139441, "rating": 5.0, "text": "I ordered some washing machine hoses online, got a text they were ready for curbside pickup In about 30 min, texted that I was there & the sweetest, friendliest young lady named Christy brought it out to me in about 5 min!  Great, efficient service which is extremely rare in these trying times. Very refreshing, highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114157172180809207070", "name": "Sam Kennedy", "time": 1606330707137, "rating": 5.0, "text": "The store pickup women was very nice to me and complemented me on my hair.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106621008810962547918", "name": "Chip Perry", "time": 1617832857072, "rating": 4.0, "text": "I was disappointed @ Montlimar location, but the Schillinger Home Depot had the stuff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106617504231334806529", "name": "Jessy Monic", "time": 1609452418595, "rating": 1.0, "text": "This place sucks. Verry bad service and no help at all. Got hung up on when I TRYED to call and when I went there they were very rude.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100065732828233375248", "name": "Radar Rider", "time": 1592956483096, "rating": 4.0, "text": "This Home Depot has gotten much better-ish ever since they got rid of the last manager they had!  This location had gone to the dogs for the longest time but here in recent years it has improved a whole lot.  It still has a ways to go.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116134951286012151131", "name": "Steve Coyle", "time": 1598482683737, "rating": 5.0, "text": "Enjoyable if possible, just wish they actually had the things I have looked for. Example the not common rough in toilets.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100546824989251464246", "name": "Shelley Griffin", "time": 1621111893478, "rating": 4.0, "text": "Clean store but they have a lack of help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111265612337732970314", "name": "Keith Doucet", "time": 1599165875530, "rating": 4.0, "text": "Everything was good with the store, however the department CSR's were useless.  I had to wait 20 minutes to get a board cut.  Everyone of the CSR's told me that they would be right back and never returned.\nIf the use of cellular devices were stopped maybe Services would be better", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117860242357012411926", "name": "jjnjayo pineapple", "time": 1590523923399, "rating": 5.0, "text": "Store nice and clean. Needed to buy lawn mower. Found a employee so very nice he went got us a cart loaded the mower took us up to register came outside and loaded the mower into our car.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103595037780557042809", "name": "SimbaJKU", "time": 1617384449641, "rating": 5.0, "text": "Home Depot's staff was very helpful", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNfi7gxbsAitYBeCSdYjtMjNcG2Qd__OgAMKBX3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113013160645688772622", "name": "Jerry Persons", "time": 1613440508915, "rating": 5.0, "text": "Awesome Carhartt clothing and Milwaukee  clothing .....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108701034558117160854", "name": "James Stafford", "time": 1622409281284, "rating": 5.0, "text": "Always helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114327080915237958501", "name": "NotAFish", "time": 1614968704552, "rating": 5.0, "text": "They got tools! Did you know?", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102168329092414812708", "name": "louis jackson", "time": 1595021033784, "rating": 5.0, "text": "MS. Kristy and MS. Tee Tee is awesome the best customer service I ever seen in a hardware store if the don't know what your talking about they will find the right people to help you I'm a contractor and when I walk into this home depot and I see them I fill at home awesome just awesome", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115354375494675470886", "name": "Joel Minto", "time": 1614210348281, "rating": 5.0, "text": "Best in store and curbside pickup.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105490118152553275568", "name": "Joe Behr", "time": 1597422030124, "rating": 5.0, "text": "Needed help and the associate I first encountered quickly had specialist provide the information I needed. He even got the items!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111643441117496498538", "name": "Cindy Gardner", "time": 1597528885984, "rating": 5.0, "text": "Akways clean and neat when I go. Friendly and courteous staff. They always go put of their way to answer any of your questions. Competive pricing. 👍❤👍❤👍❤", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107071635484914978441", "name": "Ken Welch", "time": 1613527669748, "rating": 3.0, "text": "Did not find the light bulbs I needed, no associate around so I gave up.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103918012464024930224", "name": "Larry Foots", "time": 1608227208130, "rating": 5.0, "text": "Associates in Hardware were very helpful and also at the register", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106112085429468681128", "name": "Rosemarie. Frei Parker", "time": 1594921244569, "rating": 5.0, "text": "Excellent service found what I wanted ask for advice. I am thankful for the good advice everybody wore masks sanitize stations were available by the entrance Thank You Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104431425225249246689", "name": "JC Gottlieb", "time": 1587582892793, "rating": 5.0, "text": "A tall slender young man that works for maybe ,Home Depot inventory distribution (he did not wear HD uniform) but he helped my husband load 18 bags (60lbs each) without hesitation or question. I wish I would have caught his name. Thank you so much for your time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111864449617436778643", "name": "Tony Seybert", "time": 1593725326402, "rating": 2.0, "text": "Don't order anything on line , waited over 2 months for appliance to be delivered. I was put off twice on delivery. Then was told 11:30 to 3:30 ,  received at 6:00. I called sorry airfreight when 1st delivery was canceled, they said I can cancel my order. I told them not after waiting so long .home Depot won't get my business after all that. THEY took my money soon as I ordered , not prior to delivery. Same with carpet , made two payments prior to having it installed .", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113908218853598947922", "name": "Donnie Moody", "time": 1603481261358, "rating": 1.0, "text": "I shop this store at least 3times a day today I go in there and see a faucet for 14.88 and bring it to the counter and they say it is 31.00 still I go back there take a picture and show them it says 14.88 and they tell me it’s not on sale yet so my thing is change it in the computer before it is set out this is false advertisement so basically I didn’t get the faucet cause they wouldn’t sell it to me for what is advertising on the sign", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113335470443819553870", "name": "Dywane Butler", "time": 1616904343320, "rating": 5.0, "text": "Has a lot of electrical supplies to keep my business going", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109106462902134413040", "name": "Terry Finney", "time": 1619555156180, "rating": 5.0, "text": "Great costumer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110479653611652853125", "name": "John Diaz", "time": 1621912384722, "rating": 5.0, "text": "Grabbed some gloves and a light.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102737879936977616150", "name": "Terry Rhea", "time": 1600631312069, "rating": 1.0, "text": "Nobody  around to help three or four was huddle up talking then if you walk over there they walk off. I like the one over here on\nOff cottage hill", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113423784249485348146", "name": "David Rodgers", "time": 1593179941271, "rating": 2.0, "text": "Went to three different stores. They were out of stock at all three. Ended up at Lowe's...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103477708376233613854", "name": "C Sells", "time": 1582217374838, "rating": 5.0, "text": "Too good...great selection and value backed by a great return policy.\nSometimes items look different when they're home, but, easy returns makes a house a home!\nIf only we could leave with what's on the list!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102374112252966416030", "name": "PamelaAnn Taylor", "time": 1606451775035, "rating": 4.0, "text": "Always as usual helpful when you need them", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105826764256867057801", "name": "Kinsley Welch", "time": 1590088050189, "rating": 4.0, "text": "Always super clean and good products. Thankfully, I am someone who knows what they need, because they really don't have enough people to help customers who really need it. But, overall, I like it.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1550941408521, "rating": 1.0, "text": "Very friendly employees. I don't like having to show my ID. EVERYTIME when I pay using a gift card. Just remember before  buying a gift card  for  love  ones.To much a hassle We will not be given our time  or money to them any more. Lowe's here we come,", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOn_MjhMYOXT0ZjVptNIO3XWwqrn7B-EFhp5KpJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102747989441964599317", "name": "Theresa G", "time": 1617718392556, "rating": 4.0, "text": "Excellent customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111402836039010547905", "name": "Linda Y", "time": 1616843471248, "rating": 4.0, "text": "Mmmmm", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109780329442563034978", "name": "Barbara Tilley", "time": 1591734593962, "rating": 5.0, "text": "Great store for almost all home needs.  Very helpful sales people also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102992686994987587204", "name": "Virgil Ladner", "time": 1592605006973, "rating": 1.0, "text": "I ask three people were a item was in the garden center an they looked at me an said I don't know. They worked in the garden section. I will not go back nor would I recommend people go there!!!! Lowe's is the place to go!!!!! Just my opinion..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103245741622740626221", "name": "Janna Brown", "time": 1574202027588, "rating": 5.0, "text": "Went in the Schillinger store lost as all get out,  and this precious gentleman that already had his vest off fixing to go home stopped me to offer his help. Mike manager of Millworks and Lumber you were so sweet and so kind to stay and make sure I got what I needed, even if it wasn't your dept. Thank you so kindly for making a difference!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104124984774329340690", "name": "Amin Shabanpour", "time": 1612242868287, "rating": 5.0, "text": "Best place for home shopping", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116354866446786710157", "name": "susan vinson", "time": 1590953797519, "rating": 4.0, "text": "Like everyone else the stock is down, but all the employees were wearing masks and were courteous.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109270296971069209461", "name": "Christopher Burnette", "time": 1616986451550, "rating": 5.0, "text": "Great place to go", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109771806148985985893", "name": "Stephen Richardson", "time": 1620295398283, "rating": 2.0, "text": "Have to look for help when you need it", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107565643189478262943", "name": "Asad Khan", "time": 1593655530732, "rating": 5.0, "text": "Everything I was looking for, they had in stock... Sales Associate was very helpful...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103196309004711384357", "name": "leah turner", "time": 1583897490207, "rating": 5.0, "text": "Darla in kitchen designs is the best kitchen and cabinet specialist that my company has ever dealt with. I hope they appreciate her.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116040791578042911230", "name": "Doressa Cobb", "time": 1575554418286, "rating": 5.0, "text": "The lady in the kitchen area was the most helpful I've ever seen in any store! Every store needs employees like her!!!! We were looking for knobs for cabinets and she was enthusiastic to help and have great info!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109372626033386545378", "name": "Teresa Morris", "time": 1598916732429, "rating": 5.0, "text": "My new shopping hardware store!!! No more shopping at Lowes for me.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108993363167133101343", "name": "Guy Miller", "time": 1610504183961, "rating": 5.0, "text": "Caught 300 count  Christmas lights on sale for $1.99. What a bargain", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112793287501862981803", "name": "Rita Richardson", "time": 1621396220756, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107472912101270201813", "name": "Agnes Jones", "time": 1578493524252, "rating": 5.0, "text": "Had the best check out cashier in the garden section. She made the trip a pleasure. Knowledgeable,  pleasant and efficient.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108455570912774566110", "name": "Alfred Murphy", "time": 1600023084851, "rating": 5.0, "text": "Gentleman in flooring was great in explaining options for my broken ceramic tile.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117801262450584330062", "name": "James Duke", "time": 1575734554019, "rating": 5.0, "text": "I took my daughter to do one of the free kids' Saturday projects. The space was well organized, and the associates very friendly. We will definitely try another.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113262204891381948054", "name": "Tom Blythe", "time": 1602118843569, "rating": 5.0, "text": "Excellent 2 ladies at customer service!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116246583955022535300", "name": "Mary Cherry", "time": 1599069197372, "rating": 5.0, "text": "Good place. Friendly people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107160046004323485651", "name": "zach “ZacTurf-n-Sports” coffman", "time": 1619360462138, "rating": 5.0, "text": "Good leadership", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100482056128454942502", "name": "wes Coy", "time": 1617490979405, "rating": 5.0, "text": "Somebody said DeWalt", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110887497829573828168", "name": "pops296", "time": 1591042216478, "rating": 5.0, "text": "Great assistance and products. Very helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100947592268508277791", "name": "Hussain Alyousif", "time": 1590778047960, "rating": 1.0, "text": "Waited more than 15 min for help, and no one showed up. I asked 2 employees and they redirected me somewhere else. I ended up going to Walmart.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110680805187940007538", "name": "Mark Fikes", "time": 1620084636657, "rating": 5.0, "text": "Had everything wife needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100335350050962386824", "name": "Evon Parker", "time": 1616353655600, "rating": 5.0, "text": "Always got what you went to get", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113235848553027168355", "name": "Magdalena Peter", "time": 1615738165392, "rating": 3.0, "text": "They need a bigger variety on flowers", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105313906455636915776", "name": "Jasmine", "time": 1600401823862, "rating": 1.0, "text": "They are very neglectful with their in-home setups. You have to wait weeks before they can make the actual appointment then they do not work with you when they themselves have to reschedule due to the technician having to cancel. Mind you that this technician lives nearly 3 hrs away.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107296948444531258748", "name": "Don the time Lord", "time": 1596740397553, "rating": 4.0, "text": "It's good but they need to water the plants more because some of them look like they're wilting", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103654833316857499698", "name": "Mary Lou Sims", "time": 1583796302211, "rating": 5.0, "text": "I LOVE  HOME DEPOT ..BOUGHT HANGING BASKET  THERE SO PRETTY.GREAT VARIETY...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103681730939090798553", "name": "Ronald “BIGDADDY” Scott", "time": 1580097658196, "rating": 1.0, "text": "Home depot is a place nearly impossible to get help. Do your research on your own for any projects. If you depend on the staff, you will most likely be misled. That's after you stand around waiting for help to come that never does. You have to hunt them down. Short of help almost 100% of the times I have shopped there. When I go there it's because they have what I need when nobody else nearby does. But I dont ask for information because they just dont know. Instead I carry my phone and Google in store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101670471549315133738", "name": "commonsense forreal", "time": 1604764492840, "rating": 1.0, "text": "Do not buy anything from this home depot, their customer service,  is horrible,  they lie, when assuring they will return your call. If you pay for a job to be done there is no follow up to see if their horrible subcontractors have completed the job, and no one at the home depot is reasonable when its not completed. They get your money up front and you get the run around, October 15th I ordered doors and paid to have them installed, not only was the installation price more than advertised, its Nov 7th and I have the doors sitting in my living room floor, not installed,  but they took my money, so I warn you dont do business with home depot, I wont again.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116496315807220319912", "name": "Justin Kline", "time": 1583613019901, "rating": 5.0, "text": "Walked in, asked someone a question, they told be the exact aisle, hit self checkout and was out in about 5 mins.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105333932048428469220", "name": "Christie Hamilton", "time": 1593872459273, "rating": 2.0, "text": "I went in for 2things a blind and a cordless drill. I waited in the blind department for 45 minutes, they called 6 times for an associate, but no one ever came to help me or another couple. Then I went over to the drills, the man started to help me, another couple walked up claimed they were first, so he turned around said just look over there and walked off. I left in frustration.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111879236121876895579", "name": "Terri Langan", "time": 1599004867439, "rating": 5.0, "text": "Couldn’t live without HOME DEPOT! One of us is there every other day of the week!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102202494217631608643", "name": "Marcia Bean", "time": 1598899617694, "rating": 5.0, "text": "Picked up cinder blocks Just what I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110535086056325761505", "name": "BeachNutty Brad", "time": 1584211150997, "rating": 3.0, "text": "I have always came to Home Depot for the service they provide.  I will be driving past Home Depot to drive to Lowe's from now on.  Home Depot has got rid of the registers and I had to scan all of my cart while the young lady stood over me to make sure I wasn't stealing anything.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105256378627230408426", "name": "Benny Manzanilla", "time": 1606268601365, "rating": 3.0, "text": "Not enough help the one that do have a very inexperienced", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110905842917720201327", "name": "Timothy Roy Whitley", "time": 1617737214073, "rating": 5.0, "text": "Got some spring plants", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116802486122278737370", "name": "Glenn Jones", "time": 1572128026868, "rating": 5.0, "text": "It helps if you find whatever you're looking for on their website first. The website will list where the items are in the store. Then it's easy to get in and get out.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106350035214090702422", "name": "Juanita Wallace", "time": 1592679998305, "rating": 5.0, "text": "I had excellent service enjoy shopping there", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104439982470146582938", "name": "Randall Cowart", "time": 1597549490421, "rating": 5.0, "text": "Home Drpot is great and the people work their are great.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112868761892738040259", "name": "kaoskat13", "time": 1581277558776, "rating": 1.0, "text": "Went into the store to purchase plexiglass. They did not have the size we needed. We found a girl and asked if it could be cut there. She said no. Which was fine. We asked if there was anywhere she was aware of that we could take it to be cut. She then informs us that oh no! There is nowhere that is allowed to cut them it is much too dangerous and risky. We went down the street to Lowe's. There we found this amazing hero who was willing to risk the impossible and cut our precious plexiglass while looking completely bored and half alseep.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117669765747809049382", "name": "Brandon Jackson", "time": 1583105029950, "rating": 5.0, "text": "I prefer this location to the one across from the festival center, but both are great.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100903083161674057350", "name": "Roberto Gonzalez", "time": 1604021222169, "rating": 2.0, "text": "There is not anyone to assist you.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115153288896045035979", "name": "Danny's Place", "time": 1577958443186, "rating": 5.0, "text": "Love Home Depot, just going in there makes me want to build something, and the staff is very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114412420420786425296", "name": "Meloney Ashworth", "time": 1578532150739, "rating": 5.0, "text": "This is also a very clean, well kept store and the employees are friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101825549814721229373", "name": "Antonio Miller", "time": 1605370698648, "rating": 3.0, "text": "Ok if I can find help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110472418809137016247", "name": "Margo Bickham", "time": 1579734951963, "rating": 5.0, "text": "Rxcellent home decor place! Prices were great too", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112944501230177249342", "name": "Alex Brotze", "time": 1609242028512, "rating": 5.0, "text": "Friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118170524364501248435", "name": "Dawg 69 (Dawg)", "time": 1599561965299, "rating": 4.0, "text": "Just like every other store right now with the pandemic low on inventory", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113109074032161929495", "name": "Duane Clark", "time": 1592069601470, "rating": 3.0, "text": "I like home depot but this location does not have a very good garden center.  Very poor selection of flowers.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105971734849142686941", "name": "RMK III", "time": 1579617359427, "rating": 1.0, "text": "went for a specific item. spoke to an employee there who said they'd get someone from that department.\nthey went down one aisle and stopped to talk to another employee for about eight minutes or so before I asked her if she had gotten someone to help me.\nshe said she was going to do that now and left.\ntwenty minutes later I left because I got tired of waiting.\non the way out I saw her again at the customer service desk just jabber-jawing with one of the managers.\nas I passed by them I said, \"I'm going to Lowe's. maybe I can get some help there.\" at which point the woman who said she'd get help tried apologizing and said she'd forgotten.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115547925685606397372", "name": "Chuck Cross", "time": 1578689762951, "rating": 5.0, "text": "Super nice clerks..\nGood selection of goods", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108835989467940756066", "name": "Robyn Curry", "time": 1577994952755, "rating": 5.0, "text": "**EDIT**\nSince the freezer mishap below the management staff (namely Dave) has gone above and beyond to make things right by me. I feel like The Home Depot has redeemed themselves and they have earned my business once again.\n\nI ordered an upright freezer to be delivered to my home. I missed three days of work for no-show deliveries and countless hours on the phone trying to get a freezer delivered and all I got in return was excuses and finger pointing. I had three managers from the West Mobile location involved in this situation (Dave, Cameron, and Jonathan) as well as the customer service help line. They were all aware of the fiasco that had occurred with this delivery yet when I asked what could be done no solution was offered. After a month of no freezer from the Home Depot I cancelled the order and bought one from Lowe’s. I had it the very next day. The Home Depot was always my go-to home improvement store but in light of the lack of customer service in this particular situation I think I’ll reconsider that.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110902223554959623010", "name": "Osborne Roberts", "time": 1608733297909, "rating": 4.0, "text": "Not as good as Lowes", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105252361242923707111", "name": "Matthew Hayes", "time": 1597324233539, "rating": 2.0, "text": "Seen several employees standing around chatting until I needed help finding something then there was nobody to be found", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113956031498285402458", "name": "Eric “A” Pettway", "time": 1594693828877, "rating": 1.0, "text": "Not enforcing social distancing and not enforcing the mandatory mask wearing!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106302319587767151087", "name": "Rebecca Gainer", "time": 1576246392411, "rating": 1.0, "text": "DO NOT PURCHASE FROM THESE PEOPLE!!! THRY DO NOT DELIVER THE APPLIANCE YOU BOUGHT FROM THEM, NOT ONLY DO THEY not come on delivery date scheduled, they dont even let u no they aren't coming, THEY DO NOT RESCHEDULE ANOTHER LATER DELIVERY DATE..HAVE BEEN O  HOLD 1 HOUR WAITING ON SOMEONE TO ANSWER MY CALL..*** AM GOING TO THE HOME DEPOT FOR MY MONEY I PAID THEM FOR WASHING MACHINE I PURCHASED, THEN I'LL GO LOWES, WHERE I SHOULD HAVE GONE IN 1ST PLACE...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108034574595445164107", "name": "William Tackett", "time": 1604890613800, "rating": 5.0, "text": "I took that photo!!! Want to buy that refrigerator.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113035088980259270503", "name": "Peggy A", "time": 1602016473983, "rating": 4.0, "text": "They were busy closing off many aisles to stock and start putting up their holiday decorations 🤦‍♀️ However there were lots of staff to assist and I got what what I needed and was on my way out the door", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100293719502051322470", "name": "Myra Pierotich", "time": 1595365023909, "rating": 3.0, "text": "People never want to wait they don't want to help you lousy I don't like their plumber", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106819463579724545994", "name": "Kenny Tran", "time": 1581567787168, "rating": 5.0, "text": "Customer Service is always the best! Check their sales", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113549760866928539881", "name": "Dylan Daughety", "time": 1542318253937, "rating": 3.0, "text": "Home Depot has everything you could want from pipe tape to air conditioning filters. Generally convenient for any projects you may be working on because of the helpful staff willing to teach anyone a few things on how these projects work. You can also buy gardening supplies, laundry machines, and much more in this one store. Truly the star of capitalism.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106302319587767151087", "name": "Rebecca Gainer", "time": 1576246392411, "rating": 1.0, "text": "DO NOT PURCHASE FROM THESE PEOPLE!!! THRY DO NOT DELIVER THE APPLIANCE YOU BOUGHT FROM THEM, NOT ONLY DO THEY not come on delivery date scheduled, they dont even let u no they aren't coming, THEY DO NOT RESCHEDULE ANOTHER LATER DELIVERY DATE..HAVE BEEN O  HOLD 1 HOUR WAITING ON SOMEONE TO ANSWER MY CALL..*** AM GOING TO THE HOME DEPOT FOR MY MONEY I PAID THEM FOR WASHING MACHINE I PURCHASED, THEN I'LL GO LOWES, WHERE I SHOULD HAVE GONE IN 1ST PLACE...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113956031498285402458", "name": "Eric “A” Pettway", "time": 1594693828877, "rating": 1.0, "text": "Not enforcing social distancing and not enforcing the mandatory mask wearing!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101654060967829356649", "name": "Bearofkratos", "time": 1579045590504, "rating": 4.0, "text": "Better then it use to be ,they seem to have nee knowledgable staff in the departments I have needed things in. As far as asking someone about things they dont know...they do still act like it is or isnt something they have without finding out. Hope this is fixed soon", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106819100192874622856", "name": "Ultreya Park", "time": 1550715134969, "rating": 4.0, "text": "Love to drive by the garden center just to see the flowers and plants and brighten my day. Nice that it is so accessible and laid out well. Helpful people. Convenient to group with other errands or on an outing to eat out. Located between Kohl's/Cracker Barrell/movie theater, and Wal-Mart/Burke's Outlet/Rue21. NEED to clean more! Hire people who like to clean.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100293719502051322470", "name": "Myra Pierotich", "time": 1595365023909, "rating": 3.0, "text": "People never want to wait they don't want to help you lousy I don't like their plumber", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106865234073238981165", "name": "Isabelle Delannoy", "time": 1590271832798, "rating": 5.0, "text": "Good prices and people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110902223554959623010", "name": "Osborne Roberts", "time": 1608733297909, "rating": 4.0, "text": "Not as good as Lowes", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108827484100317662019", "name": "Bo Betzler", "time": 1606596174047, "rating": 2.0, "text": "Not much interaction or help from the employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111435636794123727691", "name": "JEFFRY Howard", "time": 1594399261406, "rating": 5.0, "text": "Always a great experience for contractors.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118407322366229731303", "name": "K Bradley", "time": 1604912127029, "rating": 4.0, "text": "Gr8 shopping experience  !!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112055864570295101136", "name": "Veronica Saucier", "time": 1581540199725, "rating": 4.0, "text": "Good just had to exchange some items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108827484100317662019", "name": "Bo Betzler", "time": 1606596174047, "rating": 2.0, "text": "Not much interaction or help from the employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103699326359330609546", "name": "John Waldron", "time": 1578508321960, "rating": 5.0, "text": "Always a great visit when you need something.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107608434828489518959", "name": "Jennifer Emley", "time": 1594860733296, "rating": 1.0, "text": "Horrible! We went in to get filters for the refrigerator and we had to get someone to page for help and still no one came.  There was someone else waiting before we got back there and no one had come to help him either.  We left and went to Lowe's, so did the other guy that was wanting to purchase a refrigerator, freezer  and a washer and dryer.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113640002932594804979", "name": "Kenneth Woodward", "time": 1574014255325, "rating": 1.0, "text": "No one in the store can help you find anything even when you know what you need. Went to customer service and they pages someone 3 times and couldn’t get a return call. Finally called another employee which did not want to come and asked the other employee to call the first person they paged. I hate when I’m a bother to a company. Left and went to Lowe’s.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100259382616853418311", "name": "Reginaldo Garcia", "time": 1553002359581, "rating": 5.0, "text": "Frequent shoppers at Home Depot.  Gale is my \"Go To\" staff person for assistance. He is  characteristically welcoming, friendly, knowledgeable, efficient, and helpful. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104942844188293985048", "name": "J Johnson Law", "time": 1604817671196, "rating": 4.0, "text": "Good shopping experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100840300821011101286", "name": "Mama Hall's Kitchen", "time": 1596392633178, "rating": 4.0, "text": "Very helpful employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102140288297413302535", "name": "Mz Monique", "time": 1563324163205, "rating": 1.0, "text": "What I don't  appreciate is when a customer ask for assistance after waiting 20 to 25 minutes later and still no one comes.I think that's unacceptable they will not have to worry about me spending my money there ever!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110093615715967242121", "name": "bridget", "time": 1611450648100, "rating": 4.0, "text": "Lots of home improvement items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108249047282101500379", "name": "Shaun Steffensen", "time": 1519340673124, "rating": 1.0, "text": "If you order appliances from somewhere, do yourself a favor and not order from Home Depot. First, the people who are selling the appliances do not know much about them. I was told that for installation of my microwave, I needed an outlet in the wall that it was being installed on. Great. I'm good. WRONG!!! The outlet had to be above the microwave.... Something that would have been nice to know, but they could not communicate that properly.\nThen, the delivery/installation people had no idea what they were doing. They were more of a delivery company, not an installation professional. They could not install my gas range. They damaged my microwave. So, really, they weren't even a good delivery company. Home Depot just subs out delivery to the cheapest company....and you can see the quality when your damaged items arrive!\nAnd I pray for you if you have ANY problems with your delivery or installation!!!\nCount on a couple of things: 1) You will spend hours on the phone getting to talk to the right person. Once you think that you have the right person, they will tell you they have to check on something and they will have to call you back. OR, the right person is \"on lunch\" and they will call you back. After giving them ample time for \"lunch\" (3 hours) when you call them back, you will be told that they were \"off today\" but they will return your call in the morning.\nBasically, it's a game of ping-pong and it takes days to get simple questions answered because, obviously, no one who works there wants to actually do anything.\nI can't believe I dropped over $7K in there and they can't even answer a simple question!!!!\nBuyer beware!!! Shop at Lowe's!!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116306875088218071030", "name": "jesse wilkins", "time": 1600145764861, "rating": 2.0, "text": "Terrible layout and not a very good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105950966549735259266", "name": "Annett Bosarge", "time": 1560905879732, "rating": 2.0, "text": "Need more help on the floor...if you need something get ready to fine it your self..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111620370464856936162", "name": "Tommy Gardner", "time": 1590449263610, "rating": 2.0, "text": "Don't carry the vent hood parts in store and the ones you do are on the opposite sides of the store.all the employees could tell you was they probably online 😂", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103157777360308114523", "name": "John Ghegan", "time": 1500265857945, "rating": 3.0, "text": "The employees are always friendly and  knowledgeable. I have a credit card with them and today might be my last visit . I went to buy some 2x4x16s and some 4a4s.  The prices on those items were 4 dollars above average. I went to Lowe's and saved 78 dollars on the same exact same lumber.\nThere should not be such a price gap...", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117487217502503390968", "name": "Paul Bacon (Bacon's Pub)", "time": 1578519794250, "rating": 4.0, "text": "Store is clean, friendly employees, coffee is always fresh.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114172462849939682010", "name": "Dan Depuy", "time": 1504293389774, "rating": 3.0, "text": "Bought 8 bags of river rock. I loaded it on the cart and loaded it in my truck. Was disappointed that no one helped. Yet I saw people standing. This is not my normal experience with Home Depot. Usually everyone is eager to help. Hopefully this is a one time event.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101060113010857986385", "name": "Melissa F Gibson", "time": 1555613232244, "rating": 5.0, "text": "MOST excellent customer service on contractors side the 2 morning ladies make me smile even when I don't have anything to smile about", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116969073931554268197", "name": "Michael McCarthy", "time": 1600031820300, "rating": 5.0, "text": "Remodeling project, needed several items found everything.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104809727798572497929", "name": "daniel Burdette", "time": 1608316310664, "rating": 5.0, "text": "Friendly and helping", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100485981822101815118", "name": "Ken Todd", "time": 1594109355356, "rating": 4.0, "text": "No delays at checkout.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112468064019371032056", "name": "Matthew Sando", "time": 1595356410479, "rating": 4.0, "text": "Great customer service..", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109064380289511496126", "name": "David savoy", "time": 1553107670362, "rating": 5.0, "text": "I'd rather go to Home Depot over \"big blue\" because customer service is better and the store layout makes it easy to find what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109649978467882785856", "name": "Sam Tate", "time": 1553020791367, "rating": 5.0, "text": "This is one of my favorite places to shop fast friendly service and they don't have a problem with helping you.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107091869637018185297", "name": "Rickie Peters", "time": 1600714734063, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105519853751389110616", "name": "Walter Stearman", "time": 1546099688890, "rating": 4.0, "text": "I would much rather use the Home Depot than Lowe's any day the people that work at Lowe's are rude the people that work at Home Depot or Awesome every one of them that I've ever talked to has been very courteous and very friendly and like always you get better deals at Home Depot then you would at Lowe's I called in to get a quote on some roofing material it took me 3 hours to get a quote that I did not even get don't go to Lowe's", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113690954212440982225", "name": "Debbie Fikes", "time": 1609790396569, "rating": 5.0, "text": "Had everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104503932638541959944", "name": "Matt DeBlaey", "time": 1533205235889, "rating": 4.0, "text": "I needed some assistance finding something. I've had to search for help before but today it seemed like they were everywhere. Great customer service. Home Depot Alston seems to have what I need over the other stores lately. Even though I am closer to another, I just drive here because they have what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101315351200690673747", "name": "Tom Thornton", "time": 1528228298030, "rating": 5.0, "text": "Nicest Home Depot I have been too. Mike the store manager was great and very helpful. Didn’t push me off to someone else and helped me load my new grill as well! Thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103676840226204440483", "name": "Jane Roberts", "time": 1603124347014, "rating": 5.0, "text": "Fast, efficient service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101662871063598781943", "name": "Angel Kerney", "time": 1553480248319, "rating": 5.0, "text": "Great service....lady in the paint dept. was patient with us & also learned a little while we waited just before closing😜", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108111676498132264084", "name": "susie pierce", "time": 1544927163076, "rating": 5.0, "text": "Had a very pleasant experience. They were  prompt with my order.\nI will continue to shop at Home Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115863217564989131875", "name": "J Jackson", "time": 1529781137064, "rating": 3.0, "text": "Went looking for a trimmer. Surprised to find refurbished trimmers at a fraction of the cost of a new one! And I could purchase a replacement warranty from the store also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106815759251078947569", "name": "Michael Peaden", "time": 1534287905011, "rating": 5.0, "text": "I'm here everyday , sometimes twice. Just wish they would hire some knowledgeable ppl. It's definitely a do it yourself place .", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108346923478261534226", "name": "David Pham", "time": 1615587774812, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103666264481733099065", "name": "Laura Kinsey", "time": 1513367264069, "rating": 5.0, "text": "I have been so amazed at the quality of service at this Home Depot store. There are plenty of helpful and knowledgeable staff ready to help you. I drive out of my way to shop at this store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116249679342655818500", "name": "Robert Harrison", "time": 1590507985761, "rating": 5.0, "text": "Great place to shop.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107552663340007368137", "name": "Debbie Phil", "time": 1583426262878, "rating": 4.0, "text": "Good selection of tools and home items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101539777611793326877", "name": "OBrien Holcombe", "time": 1520525312049, "rating": 5.0, "text": "I prefer this big box store. I work in multiple states in different counties and cities and h.d. is where ever I go. So I stay consistent with quality.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111192683215328183471", "name": "Jon Mullen", "time": 1513539794028, "rating": 4.0, "text": "Lovey was VERY helpful and a pleasure to deal with. The only reason it wasn't 5 stars was the unavailability of the appliance we wanted when we wanted it. Overall it was a very enjoyable experience.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1580338537540, "rating": 5.0, "text": "Very helpful staff and good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102203631523731829562", "name": "Kimberly Bates", "time": 1535897686923, "rating": 5.0, "text": "I appreciate that home depot has Saturday morning kids workshops.  My little guy loved it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0gU05yWc39rqXOBrVmAgaWkXOtaW-zta1Rolk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102120332704426358467", "name": "Tracy Kelton", "time": 1555975223167, "rating": 4.0, "text": "A little difficult to locate help in the store,  but overall very clean with helpful staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107207837763775911766", "name": "rebecca strickland", "time": 1584259708985, "rating": 3.0, "text": "If you ask where something is they literally have to look on the app to see.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100196848760287918014", "name": "Frank Karwoski", "time": 1595791973099, "rating": 4.0, "text": "Same consistent service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101871889054132280278", "name": "Rick Taylor", "time": 1617146238426, "rating": 4.0, "text": "No service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101079947091563059672", "name": "Timothy Cherry", "time": 1617491247130, "rating": 5.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115260004251416110175", "name": "Sharon Naman", "time": 1520214432454, "rating": 5.0, "text": "Always enjoy going to Home Depot. Everyone was kind and very helpful. Thanks for all of your help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116809699803642081953", "name": "Melissa Nicely", "time": 1617568292353, "rating": 5.0, "text": "Needed a ladder", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113455325428195403159", "name": "James J", "time": 1547353784149, "rating": 3.0, "text": "Good luck finding someone to answer a question. Better prices though.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107207837763775911766", "name": "rebecca strickland", "time": 1584259708985, "rating": 3.0, "text": "If you ask where something is they literally have to look on the app to see.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101079947091563059672", "name": "Timothy Cherry", "time": 1617491247130, "rating": 5.0, "text": "A+", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108132685035891926959", "name": "Lee Will", "time": 1600172715672, "rating": 5.0, "text": "👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110216665266841559589", "name": "Ms Q", "time": 1557258866065, "rating": 1.0, "text": "I've tried to order ceiling tiles from this location since April 5th. It is now May 7th and they are still not in. First batch was broken. That's ok but 3 weeks later still nothing.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116809699803642081953", "name": "Melissa Nicely", "time": 1617568292353, "rating": 5.0, "text": "Needed a ladder", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1580338537540, "rating": 5.0, "text": "Very helpful staff and good selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102873848574055058950", "name": "BRIAN JOHNSON", "time": 1533935555673, "rating": 1.0, "text": "The black girl in the garden department has this “I hate my job... I hate my life.... and I hate you...” look on her face. In her voice and in her posture. I felt bad about asking her how much the pine straw was...... as if I was not allowed to speak in her presence or as if I bothered her while she was out in space because it was slow. I just wanted to get my pine straw and leave before she started open fire on me for asking her to do something so bizarre as giving me a quote.\nIt’s people like her that worry me....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100698451629668427992", "name": "Kitty Cat", "time": 1537376429001, "rating": 5.0, "text": "The employee's are helpful!👍\nThey have a lot of awesome halloween decorations!!! They have really anything you need for remodeling, air conditioners, decorations and ect.\n😸😸", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102675416392399376892", "name": "Nelson Dorgan", "time": 1546205721193, "rating": 5.0, "text": "Pleasant. At least 10 people ask if i needed help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111064563693576657675", "name": "Cary Campbell", "time": 1593448495731, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116251679599506463513", "name": "Robbin Hilbert", "time": 1551640546895, "rating": 4.0, "text": "Nice and helpful employees, have a lot of veggie, flowers, and herb  plants. A lot of home improvement supply's.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118046956968089073055", "name": "Roger Clark", "time": 1579209266002, "rating": 1.0, "text": "You need to fire everyone in your Appliance Department, nobody knows what they're doing", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114972890779130776757", "name": "Tony Harrison", "time": 1488085209212, "rating": 4.0, "text": "I love shopping at The Home Depot. I find that it's much cheaper than Lowe's. Very friendly employees but they are in need of hiring more employees bad.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117252104033640038881", "name": "Tolley Smith", "time": 1570660136997, "rating": 5.0, "text": "Always perfect go in get what I need and leave", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103836949348301591948", "name": "Almightycorn", "time": 1582941881293, "rating": 4.0, "text": "Always my top choice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114712778326107866835", "name": "Doris Martin", "time": 1549552943298, "rating": 4.0, "text": "Friendly staff, items easy to find, good prices", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111064563693576657675", "name": "Cary Campbell", "time": 1593448495731, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103151469593971789226", "name": "Paul Manning", "time": 1577740628869, "rating": 5.0, "text": "Came home with everything , i went after kayla in flooring, helped me  ,very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100779295001455203355", "name": "deanna lanier", "time": 1582504822927, "rating": 1.0, "text": "The people that work here just walk around,  aimlessly!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114786495704776052318", "name": "Courtney Wolfe", "time": 1523188586168, "rating": 5.0, "text": "Came here on Thursday evening to purchase a dryer. Bien help us & if I could give that man 5 stars of his own I would. He was nice, helpful & knowledgeable (I ask questions) We also found a disherwasher in the mark down area after he had rung up the dyer but Bien didn't mind he got us hooked up with that as well. Every time  I've been there Home Depot employees are friendly & patient. Please keep it up guy!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100698451629668427992", "name": "Kitty Cat", "time": 1537376429001, "rating": 5.0, "text": "The employee's are helpful!👍\nThey have a lot of awesome halloween decorations!!! They have really anything you need for remodeling, air conditioners, decorations and ect.\n😸😸", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100882311540374764492", "name": "Prince G.", "time": 1555533773327, "rating": 1.0, "text": "Sucked no one knows nothing from nothing dont you work there for a reason or just for a paycheck", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100399574085670850453", "name": "Mark L Tate", "time": 1553370758535, "rating": 5.0, "text": "Always find what I need and then some.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105820758827869839747", "name": "Rich", "time": 1530563568949, "rating": 4.0, "text": "People were helpful in finding light fixture, receptacle and wall hangers.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112860769336469642587", "name": "Roy Davis", "time": 1530668711903, "rating": 5.0, "text": "Customer service was excellent.  That helped me find things I had no idea of their location.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105478552768494572814", "name": "Dennestons world", "time": 1549062010110, "rating": 5.0, "text": "Great store for the DIY projects and how to manuals as well.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114308510732916219398", "name": "georgia hacker", "time": 1518642099569, "rating": 2.0, "text": "I am handicapped.  Bought 5 bags of mulch . cashier called someone to load it for me. Finally after I realized no one was coming had to struggle & load it by myself.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109028418160116453852", "name": "Julius Dixon", "time": 1513454008429, "rating": 5.0, "text": "Wonderful experience people friendly helpful all your work is a really good people love to smile and greet you keep up the good work", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101987044554609727582", "name": "Dr L", "time": 1532743095070, "rating": 5.0, "text": "Great helpful service tell them what you want to do and the give you ways to do it good prices and selections", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105368106133542353135", "name": "Howard Strum", "time": 1594216220578, "rating": 1.0, "text": "Never has what I need.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111141955990335730291", "name": "Tommie Williams", "time": 1597981026588, "rating": 4.0, "text": "Good location", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115111173974195082665", "name": "Robbie May", "time": 1526675683654, "rating": 5.0, "text": "Shopping for a large window AC. Service  Desk personnel were extremely helpful in helping us get the correct unit and loaded it Into our Truck. 22000 but LG for $619.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118428536883982090004", "name": "Victory Reliable Services, LLC", "time": 1523038269144, "rating": 4.0, "text": "Excellent Pro Desk service, the best in the region in a good 60 + mls radius beat any other HD in this department, the dynamic duo Marcia and Elizabeth will go the extra mile to find materials for any project, for hurricane preparedness questions and needs ask for Melinda. The store is well organized and seems like they don't move stuff around a whole lot like at any other HD. The rest of the staff in the other departments (plumbing, electrical, etc.) are outstanding too, they're very helpful, with good knowledge, courteous and eager to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102808662761612941757", "name": "Steven", "time": 1535315470552, "rating": 4.0, "text": "Can always find stuff to buy. Just not always what I'm going for.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111986029497490221900", "name": "Eguene Walker", "time": 1583123775136, "rating": 2.0, "text": "There's never anyone there to answer your questions", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107678998529995131834", "name": "Rebecca Jett", "time": 1553812209551, "rating": 4.0, "text": "Helpful staff and well stocked with what you need, when you need it!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106961822857426341956", "name": "William Sutherland", "time": 1593810290585, "rating": 5.0, "text": "They have everything I need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102875121437485715461", "name": "Trish Morley", "time": 1543793360299, "rating": 5.0, "text": "Great place for our home. Always in there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107351436513139773109", "name": "DARK 2.0", "time": 1528948172825, "rating": 5.0, "text": "Bought my stove from there lovely experience good customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100543828475427551472", "name": "Joe T", "time": 1552009877849, "rating": 5.0, "text": "Found just what I needed.  Good price.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106581561356093837246", "name": "Holli Basch", "time": 1608589016098, "rating": 4.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116096364600953090374", "name": "Len Wells", "time": 1495726577652, "rating": 1.0, "text": "No one answers the phone.\nMost employees know very little about what is in the store where it is at or if there is any in stock.\nThe internet tells you they have a product but it is not there when you go to get it and no one will answer the phone so you can find out if others before you drive up there.\nNo real sales or discounts in the store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106802828426796673277", "name": "Megan Crane", "time": 1426167213242, "rating": 5.0, "text": "Bridget the Customer Service supervisor is amazing. She spent over an hour trying to get a online order sorted out for me. She never acted annoyed or upset. Always a smile on her face. She is wonderful!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110271316640344862500", "name": "Jessie Sanders", "time": 1512410686379, "rating": 5.0, "text": "L wonderful experience went back to the paint department they tell me where everything I needed to go get what I'll it was on help me find the paint I needed and it was the right kind", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100550476030937518508", "name": "Lacey Paquin", "time": 1514066099176, "rating": 1.0, "text": "I ordered $1,600 worth of appliances on black Friday to furnish my investment property. I scheduled them to be delivered on Friday, 12/22, and I was told the delivery time frame would be from 2pm-6pm. I planned accordingly and the my appliances were never delivered! No CALL or anything. It took me 4 different phone calls to reach an actual person. The delivery people could not be reached. I waited at the property until 10pm. I went to the store the next day and spoke with the manager, and apparently I was the 3rd customer complaining of no delivery and no notification. The store could not reach the delivery service because they were closed, and would not re-open again until that Tuesday after Christmas. I was told they \"might\" start calling customers then to attempt to re-schedule deliveries. I found this to be completely unprofessional and unacceptable. I cancelled my order and was refunded my money. I am showing my rental Wednesday and it will be empty. Home Depot has hurt my business.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114623470391982426972", "name": "Jamie Pierkowski Ishmael", "time": 1551351614910, "rating": 5.0, "text": "Everyone is so nice and helpful there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109348560891921236241", "name": "Manda McGuff", "time": 1482338530957, "rating": 5.0, "text": "Unfortunately I had been shopping with lowes. It had been on more than occasions than not a terrible experience. I decided to try Home Depot in my recent purchase of a bathtub. Within the first 5 minutes of being inside the store I was greeted by 4 associates. All of which were very welcoming and friendly none of which I have ever experienced at lowes. They pointed me in the direction I needed to go. Upon my arrival of the bath tub isles another associate was there eager and ready to assist me. He opened the merchandise and checked for defects and everything to my satisfaction. None of which I have ever experienced at lowes. Even on the way to check out associates asked if there was anything more they could do to help. Overall my experience at Home Depot was outstanding. I work in customer service and a lot of places lack in that department. Job well done!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102411274432499355628", "name": "P Thomas (PCFROG)", "time": 1584147284227, "rating": 4.0, "text": "Paint department has Friday nights off.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117866553938772280874", "name": "Hummingbird Verses", "time": 1593812204951, "rating": 1.0, "text": "Was never there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114159913113927283524", "name": "Aaron Cowden", "time": 1511023353751, "rating": 1.0, "text": "The ladies at the registers are great but there is no stadf for assistance, and theyre not too knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101621782740978021423", "name": "Al Sauls", "time": 1503526818910, "rating": 5.0, "text": "While at Home Depot a male associate named Leyland and a female associate named Tonja were very helpful to me and my wife in selecting a dish washer and ceiling fan for our home and rental house. They made sure that we got the best price and the discounts that were available to us.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108463844422818951198", "name": "Emilio Valdez", "time": 1503169869533, "rating": 5.0, "text": "Great help. Lowe's lost over $600 on flooring because the manager didn't have time to come help my wife so she came to home depot were we got a better selection and cheaper.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104163262876088875250", "name": "Carolina Alday", "time": 1519947847514, "rating": 5.0, "text": "The employees were very knowledgeable and helped me with everything I needed to get.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111201889428627324697", "name": "Erika", "time": 1503277339795, "rating": 5.0, "text": "Store manager Michael was incredibly helpful in finding exactly what I needed for my vent cover project!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109921743136263194457", "name": "MH M", "time": 1482099982071, "rating": 5.0, "text": "Landon did a great job of helping me find what I needed to finish my project.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105401966393512449430", "name": "joseph morris", "time": 1533039140418, "rating": 4.0, "text": "Better than the one on Montlemar Dr. Better stocked.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101009946016441361608", "name": "Terry And pipe pipe.", "time": 1605624497017, "rating": 2.0, "text": "Not happy", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104343322407975601358", "name": "Sean Steelreath", "time": 1522457503216, "rating": 5.0, "text": "Professional staff, Extremely clean shitters what more can u ask for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107080001725918330267", "name": "Samantha Barton", "time": 1561739546064, "rating": 4.0, "text": "Stopped shopping there when they discontinued the military discount. Cancelled my credit card too", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106132977503775641982", "name": "Frank Davis", "time": 1546614097007, "rating": 5.0, "text": "Home debot, like Lowes, gives military discounts up to $50.00 towards their more pricey items which is a help.  10% across the board but its a start.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111141955990335730291", "name": "Tommie Williams", "time": 1597981026588, "rating": 4.0, "text": "Good location", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106132977503775641982", "name": "Frank Davis", "time": 1546614097007, "rating": 5.0, "text": "Home debot, like Lowes, gives military discounts up to $50.00 towards their more pricey items which is a help.  10% across the board but its a start.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110128508212684208422", "name": "Mike Anderson", "time": 1535539930383, "rating": 5.0, "text": "They have everything you need,for any Project you you have to tackle. Tools and more, Great Prices Too.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118428096489468065193", "name": "Clausell Huff", "time": 1593794561331, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108721048350671908512", "name": "Richard Long", "time": 1596139727767, "rating": 4.0, "text": "Bought what I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102734014262906328928", "name": "Wesley Packer", "time": 1595389227430, "rating": 3.0, "text": "They a little pricey", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117866553938772280874", "name": "Hummingbird Verses", "time": 1593812204951, "rating": 1.0, "text": "Was never there.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101009946016441361608", "name": "Terry And pipe pipe.", "time": 1605624497017, "rating": 2.0, "text": "Not happy", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104712438291178280495", "name": "Luke Hildreth", "time": 1546892330264, "rating": 4.0, "text": "Great but need more register open", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101582180480024203533", "name": "Shawn Hinderman", "time": 1592523214489, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104639630769269065496", "name": "Herminio Flecha", "time": 1546227014771, "rating": 3.0, "text": "Unless you know what you are looking for, dont ask the store clerks. You can rarely find any store associate to help. Associates are not familiar with the store's products.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108721048350671908512", "name": "Richard Long", "time": 1596139727767, "rating": 4.0, "text": "Bought what I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105323128250421231146", "name": "James Prowell", "time": 1606960761032, "rating": 1.0, "text": "No help!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101541602566671242619", "name": "Justin Hobbs", "time": 1427279967050, "rating": 4.0, "text": "Friendly staff. I visit this location daily, they are always helpful. They usually have what I need also.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107298757813376665622", "name": "Knowledge Gulley", "time": 1583278024519, "rating": 5.0, "text": "Friendly and Very Helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102734014262906328928", "name": "Wesley Packer", "time": 1595389227430, "rating": 3.0, "text": "They a little pricey", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111653794026138916581", "name": "jan kennedy", "time": 1392747126223, "rating": 1.0, "text": "Don't go for special order blinds. The associate  could't even tell me the name of the display model so I could order it. She said it might be outdated.. She also said she would research and get back to me but I got the impression she never would.. what a waste of time.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102068549540202716710", "name": "Chris Adams", "time": 1582330743229, "rating": 4.0, "text": "David help was awesome", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106574148164203850254", "name": "Paul Roberts", "time": 1518384873646, "rating": 5.0, "text": "Employees were helpful. Had several walk up and ask if we needed assistance", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103039852126736852093", "name": "T Denton", "time": 1532176110924, "rating": 4.0, "text": "Good appliances. Slow service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102700113626857969621", "name": "Rick Robinson", "time": 1550615632442, "rating": 4.0, "text": "Good selection of home improvement items", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112672335846397238901", "name": "Jay Becks", "time": 1533845781965, "rating": 5.0, "text": "Great lumber amd huge selection of products", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100307342772303780445", "name": "MILO BROWN", "time": 1365712029861, "rating": 2.0, "text": "I spent 35 minutes in the power tool department. I went to customer service to ask for assistance and the lady said she would help. I asked her a question and she simply turned to  another employee  and asked him. He responded that the item i was looking for was\"by the ladder\" and just walked away. The item was not by the ladder. This is the worse customer assistance I have ever seen. Twice in two weeks. I will never spend another penny at this crap hole. Lowes will continue to get my currency. HD SUX!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105210760005763006698", "name": "Mike Jones", "time": 1581647471216, "rating": 5.0, "text": "Great for home improvement", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101582180480024203533", "name": "Shawn Hinderman", "time": 1592523214489, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116190989415552930293", "name": "Mathew Kasper", "time": 1556637176548, "rating": 3.0, "text": "Very clean store. My cart was taken by someone while shopping. Not a great tool selection. Lots of items were out of stock. Customer service needs improvement.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108698198049461626156", "name": "Bruce Jones", "time": 1533337067315, "rating": 1.0, "text": "Awful place to shop. I went in there today to buy anchor bolts. Everything was in disarray. Very unorganized. I had to go fight airport blvd traffic and go to Lowe's", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116303520436914352827", "name": "James Stallworth", "time": 1548865184040, "rating": 5.0, "text": "Great store and helpful employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111593104390973544180", "name": "Ana Thema", "time": 1543282063682, "rating": 3.0, "text": "I found what I needed with the help of 4 different enployees", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111218838315913634196", "name": "Brian Cobb", "time": 1549582592134, "rating": 5.0, "text": "I got lost and couldn't find something immediately and had to ask a store clerk for help. So all in all nothing was missing from this visit compared to every other Home Depot visit I've had throughout my life.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100047080999638277350", "name": "Robert Thomas", "time": 1590321425089, "rating": 5.0, "text": "Good selections", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113222393143509711869", "name": "Faye Sheffield", "time": 1578090941722, "rating": 3.0, "text": "Customer service not great!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109887666982652873039", "name": "LC, CE, & DG Mitchell", "time": 1526951552920, "rating": 5.0, "text": "Was looking for an item that looked like it was sold out and one of the associate saw that it has just came in on a big shipment. He found the item and brought it to me.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117182453788562777316", "name": "Amy Toler", "time": 1553799058631, "rating": 1.0, "text": "Associates were rude and had no knowledge of the products they are supposed to be selling. I will not shop at Home Depot again.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116947039998168789506", "name": "Matthew Rhodes", "time": 1464883431720, "rating": 3.0, "text": "They always seem to have less than Lowe's. Their tools seem to be a better value though.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112574890016378356322", "name": "Samaria Moore", "time": 1537118883404, "rating": 4.0, "text": "Friendly people who were available to help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104941670521887577832", "name": "ashley howell", "time": 1543788734360, "rating": 1.0, "text": "Salesperson in tools was very rude to my husband. Will not be returning to this store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109466651452253254805", "name": "Charles Holland", "time": 1524264361756, "rating": 5.0, "text": "I've always liked Home Depot. Can't complain about this location so far!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105265525173498214949", "name": "Philip English", "time": 1545803350838, "rating": 2.0, "text": "Who can help me find what I'm looking for and know about the product?????", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110443859125230193711", "name": "Mark Moose", "time": 1553091456594, "rating": 5.0, "text": "People were nice and helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113641364958886547898", "name": "Louie Guertin", "time": 1530528229735, "rating": 5.0, "text": "Friendly curious staff. Helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104190293445325183239", "name": "GHOST AMERICAN BEDOO", "time": 1583776282154, "rating": 5.0, "text": "Zero N95 masks available.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110850431431222582388", "name": "Marie Lange", "time": 1548541339429, "rating": 5.0, "text": "But I bought a pitchfork and some lime time to turn my mulch pile", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109255002131882591689", "name": "JoAnn Rolin", "time": 1595443739502, "rating": 5.0, "text": "Found what I was looking for", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105857503108963277455", "name": "Mildred Braun", "time": 1578546555404, "rating": 5.0, "text": "Has everything ineed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116903518238209213835", "name": "Robert Howell", "time": 1544579283345, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116873093007762223478", "name": "Arild Warholm", "time": 1549498672714, "rating": 4.0, "text": "Found what I was looking for.👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112206044726385431454", "name": "Jeffery", "time": 1607224111355, "rating": 4.0, "text": "Same", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108848425929892270304", "name": "Dena Amison-Middleton", "time": 1573334706701, "rating": 4.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115874532383571328778", "name": "Harold Thomas", "time": 1544061476078, "rating": 4.0, "text": "Love the place.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110890729795807530632", "name": "Anthony Welborn", "time": 1577916556837, "rating": 4.0, "text": "Many things on sale", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115482212534389928686", "name": "william smith", "time": 1539640619833, "rating": 2.0, "text": "I had to ask several people where I could find a PRESSURE WASHER,they all sent me to an aisle that has smokers,grills,and PRESSURE COOKERS!!!!°°°", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115170416762104050335", "name": "Charles Brooks", "time": 1539446425427, "rating": 5.0, "text": "Always a good experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117632984121279447948", "name": "Jason Hodges", "time": 1576187092747, "rating": 5.0, "text": "Always awesome!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108274439345624128512", "name": "Joe Williams", "time": 1549334964923, "rating": 1.0, "text": "Not good try to get some help in the blind department on one came to help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1545737474556, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100242437977343106929", "name": "Bob Phillips", "time": 1555280840082, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117062338824095554856", "name": "United Public Radio", "time": 1545748041066, "rating": 3.0, "text": "Could have been better", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100930665885371488074", "name": "Tim Brazell", "time": 1533501819943, "rating": 5.0, "text": "Very good service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100547465487374394620", "name": "TJ Averett", "time": 1578868225056, "rating": 3.0, "text": "No vegetable seeds", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112337751910822875937", "name": "Cantare Alabanzas al nombre del Señor", "time": 1529430292980, "rating": 4.0, "text": "Good customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106837932504973756211", "name": "tim shewmake", "time": 1542483289202, "rating": 4.0, "text": "No one to help you", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112581671648541211232", "name": "Take Flight", "time": 1532576552443, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104716775472412256539", "name": "Michael Thomas", "time": 1553023313416, "rating": 5.0, "text": "Great product", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103866852895116876040", "name": "Darlene Wolfe", "time": 1546546649259, "rating": 5.0, "text": "Helpful staff, always.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117321159902698272338", "name": "Osborne Roberts", "time": 1545624385134, "rating": 5.0, "text": "Great tools, compatible prices,", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110268379310929563933", "name": "Amber Hight", "time": 1539475838417, "rating": 5.0, "text": "Nice vist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1545576579366, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113390643922318265845", "name": "Gary Walker", "time": 1532348350154, "rating": 3.0, "text": "Good layout", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110053686816649363124", "name": "Liz Ming", "time": 1549227649207, "rating": 1.0, "text": "Can't find help", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104782360706800629617", "name": "Lula Porter", "time": 1524518489431, "rating": 3.0, "text": "Seemed s little shorthanded today. It took the man with the forklift a half hour to get my fridge to the door.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108060180123467399396", "name": "deep south Diesel cowboy", "time": 1535264948837, "rating": 4.0, "text": "I go here for most of my construction needs", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114228943109386201276", "name": "Kevin May", "time": 1556334861974, "rating": 4.0, "text": "Like it cool stuff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105594355121661133492", "name": "Grand Bay City Girl", "time": 1546222679287, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106100745204828030801", "name": "Terry Manzy", "time": 1547472030369, "rating": 5.0, "text": "Have everything that you need from garden to home projects", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106087890297713426628", "name": "Nathan Hunt", "time": 1549731639961, "rating": 4.0, "text": "Need more plumbing parts", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117397604931476613301", "name": "joshua Atkins", "time": 1537667395087, "rating": 4.0, "text": "People were nice, and helpful....", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107362106692827508163", "name": "CHARLES MILLER", "time": 1528506774718, "rating": 5.0, "text": "Refigerator install went great", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112899706162875837839", "name": "Tony Lamm", "time": 1531145168331, "rating": 5.0, "text": "Lots of helpful people.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578672405889, "rating": 5.0, "text": "Its Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113269812323775880863", "name": "emily william", "time": 1556590852620, "rating": 5.0, "text": "Very helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106853288376372087970", "name": "Lisa Normand Davis", "time": 1507572069597, "rating": 5.0, "text": "great service in the paint department", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104269007091832175479", "name": "angela galey", "time": 1550333638649, "rating": 5.0, "text": "Great service and pricing", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113106490236201095403", "name": "William Howard", "time": 1540684734640, "rating": 5.0, "text": "Top notch staff.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103079965585645537801", "name": "sam weaver", "time": 1545945402665, "rating": 4.0, "text": "Great company except lumber is way to expensive.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102797642289151965412", "name": "Brian Nichols", "time": 1561073879360, "rating": 1.0, "text": "The last couple of times I have been in the store only the self checkout was opened. I walk down to the lumber to checkout. Home Depot doesn’t give me a pay check to check myself out. You need to open a line by the self checkout so people have the option instead of walking to the far end of the store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1532399086164, "rating": 4.0, "text": "It's a Home Depot what else is there to say.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111787553837186657344", "name": "Teresa Drinkard Fountain", "time": 1546309758056, "rating": 5.0, "text": "Great Store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100453880335418413398", "name": "Marcus Richburg", "time": 1579461754003, "rating": 4.0, "text": "Yep", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109748683603278994757", "name": "Dallas Hill", "time": 1536836658283, "rating": 5.0, "text": "Very kind and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115502613150956707891", "name": "Alan Scull", "time": 1532191978409, "rating": 5.0, "text": "What ever you need for lawn care", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110049684847264274895", "name": "Debra Colbert", "time": 1523295295403, "rating": 5.0, "text": "Helpful customer service lady", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109016241603667420070", "name": "Brian Meehan", "time": 1548421914496, "rating": 5.0, "text": "Knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107650588747151602258", "name": "JJ fnaf fan", "time": 1541534088351, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117542981899968452725", "name": "Joyce Cody", "time": 1540585751655, "rating": 5.0, "text": "We t right to the items I needed.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118210152394321726686", "name": "Wendy Tulo", "time": 1549950490869, "rating": 5.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101318036086236581776", "name": "E. Sully", "time": 1535825274178, "rating": 4.0, "text": "Just your generic retail home goods store.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103335531352260760995", "name": "Ricky Carroll", "time": 1546930284191, "rating": 3.0, "text": "Get what you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "114477386696750613101", "name": "Brandi Tanner", "time": 1549918356327, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105294570695074613785", "name": "Chris White", "time": 1533910525773, "rating": 5.0, "text": "Great experience", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106217902403167589198", "name": "Thomas Beck", "time": 1532399086164, "rating": 4.0, "text": "It's a Home Depot what else is there to say.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104716775472412256539", "name": "Michael Thomas", "time": 1553023313416, "rating": 5.0, "text": "Great product", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116873093007762223478", "name": "Arild Warholm", "time": 1549498672714, "rating": 4.0, "text": "Found what I was looking for.👍", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109748683603278994757", "name": "Dallas Hill", "time": 1536836658283, "rating": 5.0, "text": "Very kind and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112933951290228808603", "name": "Danny West", "time": 1514352386758, "rating": 5.0, "text": "They have any and everything you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113427939733542005542", "name": "Daniel Fisher", "time": 1499533853348, "rating": 4.0, "text": "Very helpful staff", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118382350873268670028", "name": "Ringo Yokley Herron", "time": 1498518425460, "rating": 5.0, "text": "Very helpful and nice", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103598246280809129346", "name": "Vanessa Duncan", "time": 1523823144676, "rating": 5.0, "text": "Great  services!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111787553837186657344", "name": "Teresa Drinkard Fountain", "time": 1546309758056, "rating": 5.0, "text": "Great Store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112160926469257350294", "name": "Warren Horton", "time": 1546099894719, "rating": 5.0, "text": "Love the place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117445325195087096515", "name": "David Carmichael", "time": 1550955400946, "rating": 5.0, "text": "Had what I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111636796631495585000", "name": "Christopher Dyess", "time": 1534298428218, "rating": 3.0, "text": "People seemed racist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100141225573243559931", "name": "L Ray Lindsey", "time": 1532439633048, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111619120493344955303", "name": "Vic Shaw", "time": 1532400332952, "rating": 1.0, "text": "Not well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112160926469257350294", "name": "Warren Horton", "time": 1546099894719, "rating": 5.0, "text": "Love the place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "101564131232142485875", "name": "Mary Richards", "time": 1535228240191, "rating": 5.0, "text": "Just like shopping there!!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109643419634187383259", "name": "My Life As Chloe", "time": 1546577342991, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116748242871006362723", "name": "Robert Midkiff", "time": 1529796251278, "rating": 1.0, "text": "Rude", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106513086567276043097", "name": "Penny Stanley", "time": 1544492855316, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111219870614421211194", "name": "James Jernigan", "time": 1525224892714, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107821293953100160371", "name": "Sarah Byrd", "time": 1521798082034, "rating": 5.0, "text": "Works are helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113411391146293806536", "name": "Joshua Jones", "time": 1552806791715, "rating": 5.0, "text": "Excellent people", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112953364779408892927", "name": "Jonathan New", "time": 1533402122757, "rating": 2.0, "text": "Understaffed long waits", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112179491491546437655", "name": "Ronnie Weitzel", "time": 1532838523411, "rating": 5.0, "text": "My favorite place", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109388152793463937790", "name": "Property Care & Maintenance", "time": 1533008299049, "rating": 4.0, "text": "They need more people on the sales floor. People that know where stuff is located.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104945454251529264389", "name": "faze tfue", "time": 1535472642975, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "105994050331829418711", "name": "Sam Walters", "time": 1523561219072, "rating": 5.0, "text": "Great place to shop.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115255871671499388824", "name": "Jesse Brown", "time": 1552224288344, "rating": 4.0, "text": "Love this store!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110044359295103851372", "name": "kurt jahnke", "time": 1548359261010, "rating": 5.0, "text": "Has stuff that Lowe's does not, expanded selection", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108661298482255468236", "name": "Jadera Dees", "time": 1524002799533, "rating": 5.0, "text": "Great expression", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111636796631495585000", "name": "Christopher Dyess", "time": 1534298428218, "rating": 3.0, "text": "People seemed racist", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112953364779408892927", "name": "Jonathan New", "time": 1533402122757, "rating": 2.0, "text": "Understaffed long waits", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1468368059281, "rating": 5.0, "text": "Good deals on appliances", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118384910440020869366", "name": "Christopher Poppe", "time": 1462933063408, "rating": 5.0, "text": "I always shop there first.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109218804703885207004", "name": "lisa schreiner", "time": 1545576579366, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578672405889, "rating": 5.0, "text": "Its Home Depot", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "103335531352260760995", "name": "Ricky Carroll", "time": 1546930284191, "rating": 3.0, "text": "Get what you need", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111619120493344955303", "name": "Vic Shaw", "time": 1532400332952, "rating": 1.0, "text": "Not well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "115745958481609162017", "name": "Metrulla Barnes", "time": 1504209905384, "rating": 5.0, "text": "the help was great", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "112816232795255375614", "name": "gary sullins", "time": 1500237706255, "rating": 5.0, "text": "Outstanding store", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102440875410451859175", "name": "Payton Kynaston", "time": 1507503354656, "rating": 5.0, "text": "Supercalafragliskexpaldse", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108945194261768282669", "name": "Matt Lake", "time": 1500750576372, "rating": 5.0, "text": "The service was excellent. In and out.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109381823413606686871", "name": "rajesh kumar", "time": 1508887825416, "rating": 4.0, "text": "Staff is ready to help.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116234031405072124643", "name": "Billie DeView", "time": 1498273229770, "rating": 1.0, "text": "Horrible", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108927482445964255884", "name": "Allen Oshea", "time": 1476315659677, "rating": 1.0, "text": "Employees no help.  They could care less if the store sells anything.  I know why it's empty when I go there.    How does it stay in business?", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "100255249060710133965", "name": "Richard Hedd", "time": 1499020597671, "rating": 5.0, "text": "Friendly staff.clean.well stocked", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106954212289885996471", "name": "Glenda Baker", "time": 1497115826354, "rating": 4.0, "text": "The sales associates were very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "107964153372610662737", "name": "Mark J.", "time": 1464872941664, "rating": 4.0, "text": "Not as large as the one off Airport but still nice.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "118384910440020869366", "name": "Christopher Poppe", "time": 1462933063408, "rating": 5.0, "text": "I always shop there first.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "113884600727340099984", "name": "Jackie MacFarland", "time": 1460168934867, "rating": 5.0, "text": "Plants, tools, hardware and wood.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104533618842092768416", "name": "Jody Poirier", "time": 1459822003251, "rating": 5.0, "text": "Awesome!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "104745061944419122913", "name": "Rafael M", "time": 1463043054287, "rating": 1.0, "text": "Is so hot inside,  the weather is cooler outside than inside", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1468368059281, "rating": 5.0, "text": "Good deals on appliances", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111381875140223825276", "name": "Nathaniel “Ryan” Bowman", "time": 1456681512008, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110901525459269813605", "name": "[Oofer Inks Studios]", "time": 1428498328613, "rating": 5.0, "text": "they have cub cadet lawnmowers", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109769136615044453869", "name": "Mey Wallace", "time": 1428253432777, "rating": 5.0, "text": "Customer service here is awesome!", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "108266776301678367967", "name": "Stephen Jones", "time": 1623983724847, "rating": 5.0, "text": "Pickup from service desk was quick and convenient. Kim was very helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "116669912350548994227", "name": "Juan Guzman", "time": 1576283274788, "rating": 1.0, "text": "(Translated by Google) There was no paint gun worth 59.00 dollars, there was only the excibition\n\n(Original)\nNo había una pistola de pintar que vale 59.00 dollar,solo estaba el de excibicion", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "117056651426739289546", "name": "Armando Martinez", "time": 1579194549074, "rating": 5.0, "text": "(Translated by Google) Very good\n\n(Original)\nMuy bueno", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "109450057972225739486", "name": "Ricardo Peralta", "time": 1535122057594, "rating": 4.0, "text": "(Translated by Google) It has everything\n\n(Original)\nTiene de todo", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "110908456014146666611", "name": "Gilda Fernández", "time": 1553912972469, "rating": 5.0, "text": "(Translated by Google) Excellent, I like it very much.\n\n(Original)\nExcelente, me gusta mucho.", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "111070221025675338365", "name": "Yahaira Michel Jimenez Piña", "time": 1519426681648, "rating": 5.0, "text": "(Translated by Google) Under construction 😉😉😉\n\n(Original)\nEn construcción  😉😉😉", "pics": null, "resp": null, "gmap_id": "0x889bb240162a2a6b:0xb64868f9b73224ba"}
{"user_id": "102716280212113736785", "name": "Monica Mingo", "time": 1620257961393, "rating": 5.0, "text": "Absolutely WONDERFUL people!!!!! I ran out of a Mohawk product that I was in desperate need of and they were so receptive and helpful.  I am so happy I found them and will be my goto from now on.  Thanks guys!  I appreciate all of you!", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "104704781604894648495", "name": "Billy Shook", "time": 1615573791791, "rating": 5.0, "text": "Great people, great work, great prices!", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "105826764256867057801", "name": "Kinsley Welch", "time": 1598371609635, "rating": 5.0, "text": "Excellent work, and extremely helpful. They even loaded up the tops for us with great attitudes", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "109317240742147941339", "name": "Kenneth Moody", "time": 1608649768332, "rating": 5.0, "text": "Go to in Mobile for cabinet supplies and countertops. Bring cash", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "113582584192772476062", "name": "Henry Nelson", "time": 1597072842461, "rating": 2.0, "text": "I ordered my Bar tops over 9 months ago. I’m just now getting my order and it’s still wrong.  4 months ago they said my tops were in when I get there it’s was the wrong top and the measurements were off. I’m a small business and my customer is mad at me because I can’t finish a project that should have only taken 1 week. I will never go back!", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "106142880485623025610", "name": "BENTWIG HUSTLEWIND", "time": 1594910651282, "rating": 5.0, "text": "Only place around for professionals to order countertops, cabinets & hardware. My father has been ordering from them for years.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "117358378778702261778", "name": "James Callaway", "time": 1560033450751, "rating": 5.0, "text": "Great friendly staff very helpful on my countertop needs.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "105210968363412949872", "name": "Alan Cook", "time": 1533009948151, "rating": 1.0, "text": "I carried measurements for kitchen and bathroom vanity countertops to the store the day we ordered. When we installed them, the depth on the bathroom vanities were 3 inches short. When I called them about it, the guy said they gave me standard depth (Even though I gave him the measurements of the cabinets). He said I would have to pay for the correct ones. I asked to speak to the manager and he said he would have to call me back. That was almost 2 weeks ago and I haven't heard back from them yet. We cut 3 inches off of the cabinets and drawers to keep from dealing with them anymore. Don't waste your time. If there is a problem, it'll definitely be your fault.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "115974237401500344395", "name": "Smilin' Joe Apparel", "time": 1498785418078, "rating": 3.0, "text": "If it's hardware related, they either have or will get it pretty quick, but double verify what you are receiving is what you ordered!", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "106856736535424608449", "name": "April Waller", "time": 1485440877973, "rating": 5.0, "text": "I bought my kitchen cabinet handle and they were very nice and the price was Great! Half the price of lowes or Hone Depot.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "115875118771563846019", "name": "Erin Baldwin", "time": 1323497275989, "rating": 5.0, "text": "Good assortment of cabinet hardware for really good prices. Family owned and operated. This place will take care of you!", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "103945743370275520911", "name": "Larry Miller", "time": 1599571734577, "rating": 5.0, "text": "They help people", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "117669634381077475014", "name": "easton lane", "time": 1550521130125, "rating": 5.0, "text": "Great people to do business with.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "106642410026714509587", "name": "Wanda Handerson", "time": 1542385743920, "rating": 3.0, "text": "I ordered 3 things and each thing had a problem.  They fixed the problems but it cost me time and money.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "101145973499016017352", "name": "Oksana Alabama USA", "time": 1488429255809, "rating": 4.0, "text": "we ordered several formica counter tops there, they did make my husband mad, because the order was forgotten.", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "100442546196168351618", "name": "ROSHANNA1975", "time": 1554838353373, "rating": 5.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x889bb26aaef9b591:0xb718d12de75453c4"}
{"user_id": "100453742074267234398", "name": "Clay Edwards", "time": 1604421764517, "rating": 5.0, "text": "The place to call for all types of custom cabinetry.", "pics": null, "resp": null, "gmap_id": "0x88928a571348d46d:0x156ee13e8f214b11"}
