{"user_id": "112125085598487496275", "name": "Crystal Parker", "time": 1609539155847, "rating": 4.0, "text": "When you come to get your car serviced, ask for Devon or Jeremy. They were the friendliest and most helpful when I brought my vehicle to be serviced. I had just bought my vehicle and had many questions. They were knowledgeable and incredibly patient when they answered them.", "pics": null, "resp": {"time": 1609768225005, "text": "Crystal, thank you for the kind words. We love hearing that our customers are happy with their experience at Bentley Cadillac! We appreciate your business and value you as a customer."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "114907750971241643355", "name": "Valerie Stafford", "time": 1606238159785, "rating": 5.0, "text": "I love Devon in the service department. She is focused on making sure the customer is greatly taken care of.", "pics": null, "resp": {"time": 1606239274947, "text": "Thank you so much for the review, Valerie!  Please don’t hesitate to let us know when we can help in the future.  We value your business!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "112958204152948864911", "name": "Damien Williams", "time": 1596892107270, "rating": 4.0, "text": "Checked my dash cam and the almost 4 hours I was at the dealership explained everything I needed to know. Car didn't get worked on until 2 hours into my wait. Had to wait 20 minutes after requesting an update after a couple hours of waiting. Not even a sorry for the wait or a discount.\n\nUpdate: Talked to Alex over the phone and his apology seemed genuine and sincere. He went above and beyond to make it right.", "pics": null, "resp": {"time": 1596204426687, "text": "Very sorry for your experience. Your wait time was much longer than anticipated, so we are refunding you the alignment charges. We appreciate your business very much!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "112628237254668730086", "name": "Austin Park", "time": 1558568550313, "rating": 5.0, "text": "Aggressive pricing! One day I'll be able to afford a Cadillac, but I've consistently heard positive testimonies about them from people I've met who have bought a Cadillac there.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO7mDwBOvz2VXVrAYHvG2hUnw66u7LB--58NhO3=w150-h150-k-no-p"]}], "resp": {"time": 1558721740220, "text": "Hello, we set high expectations for ourselves so it’s gratifying to hear you had a great experience with us. We do hope we can be of assistance in the future. Take care!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "106481998148573432259", "name": "Susanne Pugh", "time": 1576772205027, "rating": 5.0, "text": "I'm a transplant from Florida, so finding a Cadillac dealership in The Shoals area, with excellent service, is very important to me. Well I found that in Bentley Cadillac! My service advisor, Russell, was kind, courteous and very knowledgeable on the type of service my CTS would need, and making friends was an added bonus. Thank you!", "pics": null, "resp": {"time": 1577107130666, "text": "Thanks! We always want to hear back from our clients and we're glad you had such a positive experience with us! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "111895778637111633375", "name": "Doris Vandiver", "time": 1507089140638, "rating": 5.0, "text": "I am always pleased the way I am treated in the service department. Everyone is friendly and speaks in a kind voice. Devon is busy but is generally interested in me and how I am doing. I love how she takes care of me and my Cadillac. This service department is one of the best. Thanks for the team work!", "pics": null, "resp": {"time": 1507294523319, "text": "Doris, thank you for the review and the kind words. We will pass your praise along to Devon. We value your business."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "118063916927509440517", "name": "Doris Garner", "time": 1569203976221, "rating": 5.0, "text": "Always Great Service!\nCecil takes such good care of us!\nThank you!", "pics": null, "resp": {"time": 1569252251999, "text": "We're glad everything was completed quickly and to your satisfaction! Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "116384025694609976566", "name": "Monday nights", "time": 1578603582457, "rating": 5.0, "text": "Russell made me feel at home very and highly satisfied", "pics": null, "resp": {"time": 1582563610460, "text": "Thank you so much for the review!  Please don’t hesitate to let us know when we can help in the future.  We value your business!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "109649115375046312380", "name": "webster graham", "time": 1548191752748, "rating": 5.0, "text": "Bobby warden was extreamly helpful form start to finish, I came in and he sat down with me and ordered the vehicle exactly how I wanted it. Kept me informed the whole time it was being built and when it arrived set up a delivery time for me to pick it up. He went over everything at the delivery and made sure I was comfortable with all the features before I left. Overall exceptional expierence with Bobby and the entire Bentley Cadillac dealership.", "pics": null, "resp": {"time": 1548347058160, "text": "Hi, your wonderful feedback and rating mean a lot to us. Until the next time we meet, take care!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "110022853779212296241", "name": "Willodean Davis", "time": 1540141344263, "rating": 5.0, "text": "Great, Great Great .in everything they do.  Randy Gray and Devon Cox was wonderful helping me on such a bad day..Thank everyone at Bentley.", "pics": null, "resp": {"time": 1540218154355, "text": "Hi Willodean! We're glad to hear we were able to make your day a better one. Please let us know if there is anything we can do for you."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "100683141056222561673", "name": "Jack McGowan", "time": 1546192862193, "rating": 4.0, "text": "Professional atmosphere\nCourtesy was awesome\nService absolutely spot on\nCost was not out of line with competition", "pics": null, "resp": {"time": 1546440235776, "text": "Hi there, thank you so much for your positive comments about Bentley Cadillac of Florence! We sincerely thank you for the positive review, and look forward to seeing you again soon!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "105883079283690421483", "name": "DeWayne Crumly", "time": 1553173746039, "rating": 3.0, "text": "I understand up selling, but i felt like i was being pushed to buy services i did not want. Normally i deal with Devon but she was not there at this service.", "pics": null, "resp": {"time": 1553181777115, "text": "Very sorry for your experience. Devon should be able to assist you again in the future. Thank you very much for your business."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "115533688312062734808", "name": "Roy Stevens", "time": 1503413494622, "rating": 5.0, "text": "Everyone was extremely nice and was willing to, and did, find the vehicle I wanted.  Thanks to everyone who worked on this.", "pics": null, "resp": {"time": 1503610027873, "text": "Roy, Thank you for the kind words. We are happy you were pleased. We value your business, and look forward to serving your family in the years to come."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "104188823549734959198", "name": "Judith Rickard", "time": 1510089737189, "rating": 5.0, "text": "I took my Cadillac SRX in for a repair. Once again, Cecil Staggs was amazing.  He kept me posted on the progress of my car and was very helpful in getting it repaired in a timely manner    I appreciate the wonderful service I always get at Bentley Cadillac\n\nJudith Rickard", "pics": null, "resp": {"time": 1510243388815, "text": "Ms. Rickard,\nThank you for the review, and for your business. We will make sure Cecil hears about your praise, and we look forward to serving you in the years to come. Be well!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "112105111800768597581", "name": "John Swack", "time": 1553614361661, "rating": 5.0, "text": "arrived for schedualed appt. met with Cecil (who is always exceptionally helpful with any question or service ) service was timely and complete with wash off and cecil had a quote for tires and alignment ready for us when service completel. All done while we waited for a very resonable wait time.", "pics": null, "resp": {"time": 1553624737438, "text": "John, we're glad everything was completed quickly and to your satisfaction! Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "105459109211102592899", "name": "Jermaine Washington", "time": 1563388807721, "rating": 5.0, "text": "From the my Saleman Bryon to the Service Dept Devon great service! 💯💯", "pics": null, "resp": {"time": 1563457373730, "text": "Hi, your wonderful feedback and rating mean a lot to us. We always strive to provide top quality service to every guest, and are pleased to hear that you enjoyed your experience here at Bentley Cadillac of Florence!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "106807532095294132433", "name": "Stacy Holt (Stacy)", "time": 1528212074242, "rating": 5.0, "text": "Super impressed with service dept.  Awesome customer service and such a   hassle free experience.", "pics": null, "resp": {"time": 1519826402174, "text": "Hi Stacy Holt, we are very happy to have provided you with such a positive experience!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "110453519716658125763", "name": "James Stout", "time": 1560118925904, "rating": 1.0, "text": "I had a horrible experience with this dealership I haven't bought a vehicle, it was with having my car repaired 1996 Cadillac Seville STS they might be a great dealership buying a vehicle", "pics": null, "resp": {"time": 1560170108861, "text": "Very sorry for your experience. We appreciate the opportunity to earn your business."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "113412540576454804100", "name": "Regina Cole", "time": 1506164581416, "rating": 5.0, "text": "Bently is amazing, so is Devin , she is a keeper , truly the best place around, I had a wonderful experience.", "pics": null, "resp": {"time": 1506363621601, "text": "Regina, thanks so much! We are happy you were pleased."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "106488118625239075569", "name": "Gail Stanford", "time": 1558797770438, "rating": 5.0, "text": "I just purchased a new vehicle from Bentley Cadillac and would highly recommend Sheness Bates if you are looking for a new car or truck.  She's the \"Best\" along with their group of service technicians and service manager, Mike.  A special thanks to Cecil Staggs who always does a great job in Serivce and Chris Staggs, General Manager.  Great group of people!", "pics": null, "resp": {"time": 1505309926323, "text": "Hi Gail Stanford, thank you for taking the time to leave a review for us at Bentley Cadillac of Florence. We're happy we could meet your expectations! Thank you again for leaving us this response!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "105282267169919896396", "name": "Joe Bama", "time": 1513717566025, "rating": 4.0, "text": "Took care of our needs quickly and met our timeline. Thanks you", "pics": null, "resp": {"time": 1514383466022, "text": "Thank you Joe!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "110510495960758858249", "name": "Sheneta Smith", "time": 1530577780839, "rating": 5.0, "text": "Wonderful job as always with the Service Department. Thanks Devon!", "pics": null, "resp": {"time": 1519826425608, "text": "Sheneta Smith, we're glad you had such a wonderful experience with us!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "115016023257151849120", "name": "Freida Eubank", "time": 1504911577864, "rating": 4.0, "text": "Bentley service took care to replace radio/HVAC touch screen and even washed & vacuumed my car.  Cecil Staggs & Devon Cox took care of my car.", "pics": null, "resp": {"time": 1505309883099, "text": "Freida,  Thank you for the review.  We'll try to give you a 5-star experience next time!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "107181353969175470618", "name": "Cecil Staggs", "time": 1541357688189, "rating": 5.0, "text": "I would never even think of purchasing or having my service done anywhere else!", "pics": null, "resp": {"time": 1541789027114, "text": "Hi Cecil. Congratulations on your purchase. Have a great weekend!"}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "109958952310672591198", "name": "Deirdre King", "time": 1540149030531, "rating": 5.0, "text": "Very pleased.", "pics": null, "resp": {"time": 1540218204083, "text": "Awesome! Thank you Deirdre."}, "gmap_id": "0x887d49c60a4df265:0xd63aeddce5f22d1e"}
{"user_id": "105792702324704137604", "name": "Diane Andrews", "time": 1614121064479, "rating": 5.0, "text": "I purchased my car there, and I have all my services done there. They are awesome.", "pics": null, "resp": null, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "108640086051477551674", "name": "Phil Walker", "time": 1611164439834, "rating": 5.0, "text": "Jonathan\n\n,IS  THE BEST SERVICE REP,I  HAVE EVER HAD THE PLEASURE  OF MEETING, HE ALWAYS  GOES OUT OF HIS WAY TO INSURE THE BEST QUALITY  OF  SERVISE .He ordered a major part for my truck,ordered it without me knowing,called me ,He installed the part ,no charge, a recall part ,thank you very  much for your professional job.phil", "pics": null, "resp": {"time": 1611938680501, "text": "We are blessed to have Jonathan in service!!! His customer service is second to none, he does an incredible job of taking care of our guest the way Mr. Cannon expects them to be taken care of. Thanks for your business.\n\nCurt Ballard\nExecutive Manager"}, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "102820840509289826920", "name": "Dave Hall", "time": 1626472325855, "rating": 4.0, "text": "Great place, friendly staff", "pics": null, "resp": null, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "110578737640513185903", "name": "Belinda Roden", "time": 1537609258092, "rating": 5.0, "text": "Anyone that needs a vehicle go see Jim Fincher. He did a awesome job helping us get the SUV we wanted. We will definitely be seeing him again😊", "pics": null, "resp": null, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "103627065213460273520", "name": "Shawn Putman", "time": 1516382235777, "rating": 5.0, "text": "In and out fast! Pro job for less than you pay at a Walmart. It's a no brainer!\nA++", "pics": null, "resp": null, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "100911423049516720859", "name": "becky parsons", "time": 1556029867497, "rating": 5.0, "text": "Great service and Josh is always Ex.", "pics": null, "resp": null, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "107975784296348893490", "name": "Patricia Vargas", "time": 1614543630158, "rating": 5.0, "text": "(Translated by Google) Everything very beautiful\n\n(Original)\nMuy bonito todo", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBV2GCMiJ7CeCmB-k7b9dw9y7c0DKNKZ56LWS5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888604188313b6d:0x8820092d50394ddf"}
{"user_id": "101185805027146238939", "name": "Nikki Levene", "time": 1621974633961, "rating": 5.0, "text": "We shopped around to find a good deal on a safe, reliable vehicle for our teenage daughter, whose previous used car turned out to be a lemon. JC Wilson was amazing to deal with and was able to get us in the car she absolutely loves at a price we could afford. Joe Bullard really takes the time to find out your needs and goes above and beyond for their customers!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRYK5UsvcGy2LPHqKmprYTRt4jUFmF9G1b-5_7=w150-h150-k-no-p"]}], "resp": {"time": 1621978810167, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113728263446516062872", "name": "Genie Claiborne", "time": 1626796559893, "rating": 5.0, "text": "Tori and Thomas were so helpful and made the process of buying my vehicle so easy and hassle free. All of the staff were very welcoming. I will purchase here again!", "pics": null, "resp": {"time": 1626800176335, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100227744430289648905", "name": "Johnny Moore", "time": 1616780225367, "rating": 5.0, "text": "I had a great experience at Joe Bullard Cadillac. They met all of my needs in purchasing a car. They worked hard and answered all my questions. They made sure that my 2017 Nissan Maxima Platinum was up to their standards   before they would release it and that means a lot. Haley McGraw The internet sales manager did everything she could to make sure i was updated and informed on all aspects of the sale . She is top notch and very helpful. Alan Carlisle was also helpful and took great care of me. Ill definitely choose Joe Bullard when i purchase my next car. Thanks again to Haley,Alan and the whole Joe Bullard Cadillac team .", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlZjf3tUI54bwAefBGktKkEHEzVWkP8T30Vz6K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPjVOJbI0FL3i1iXZF3C_wlZN1bLJ_oHrL0vdg=w150-h150-k-no-p"]}], "resp": {"time": 1616783969956, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109894326174698505720", "name": "Brittney E", "time": 1626386482960, "rating": 1.0, "text": "I took my Escalade to the service dept to get work done on it. They miss diagnosed it and I paid over $500.00 for repair. I had my truck 2 days before it started doing the same thing again. I called to let them know and got the vehicle back over to them. They had my truck a little over a week and claim it was not doing anything for them and that it was old codes showing up. Well since I have had my vehicle back it once again started doing the same thing showing up the same codes. I decided to take it to another dealership and to my surprise the codes that they told me was old was not old they just cleared them instead of fixing my truck. I'm very upset because they repeatedly lied to me over and over. I will not recommend the service dept at all. They just played around with my truck and I called to let Myla know that it was doing the same thing again and that I took it to another dealership and they showed me how codes had been cleared and showed me the history codes. She stated Christian the service manager would call me but he never did.", "pics": null, "resp": {"time": 1626471123166, "text": "Thank you for taking the time to leave us a review. I am very sorry your experience wasn’t what you’d hoped. I have reached out to management to let them know about your recent experience. Someone will be in contact soon."}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114399938829542968998", "name": "Angela Johnson", "time": 1624953519786, "rating": 5.0, "text": "My car buying experience at Joe Bullard was awesome because of salesperson Rodney Lofton.  Rodney worked hard to locate the exact Cadillac that I requested.  He was also very professional, knowledgeable, courteous, and thoughtful. Furthermore, he even personally delivered my car to my home.  Before leaving me with my new car, he explained again how to use the features in the car.  In closing, it is obvious that Rodney enjoys selling cars and making his customers happy.", "pics": null, "resp": {"time": 1624941817687, "text": "Thank you for your rating! We hope to see you back soon. We appreciate your business and thank you for choosing to be a part of the Joe Bullard family of customers!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105359357651743639662", "name": "Carrie Wood", "time": 1620819191728, "rating": 5.0, "text": "My car buying experience at Joe Bullard Cadillac was one of the fastest, most efficient buying processes I've ever experienced.  I was contacted within minutes by Haley in charge of Internet sales.  She listened, answered my questions, and set up my test drive.  My salesperson, Rodney, then took over and went above and beyond to get the buying process moving quickly.  The finance manager found the best finance deal for my needs, and Rodney finished up the deal by ensuring my used car looked brand new.  Thank you Joe Bullard Cadillac!", "pics": null, "resp": {"time": 1620823129564, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111278781898265291722", "name": "Marie Debose", "time": 1617923166245, "rating": 5.0, "text": "My husband and I purchased a 2021 Cadillac with JC as our salesman. He was very kind and knowledgeable but what I appreciate even more is that he was not pushy, as many car salesman tend to be. Roosevelt and Thomas helped out with the paperwork and they were very kind and informative in making sure we would get the best price. I highly recommend this location!", "pics": null, "resp": {"time": 1617928694392, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107613188176727664500", "name": "Danielle Starling", "time": 1625362861811, "rating": 5.0, "text": "My experience at Joe Bullard Cadillac was excellent!! Rodney Lofton was great and he made the process quick and easy .. I will definitely shop here again and recommend it to my family and friends ..", "pics": null, "resp": {"time": 1625366683395, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112556576071655774957", "name": "Michael Heflin", "time": 1621986407491, "rating": 5.0, "text": "Michael Sewell was very detailed in explaining all the options on the car I purchased. The whole staff at Joe Bullard was very professional. I would buy from them again and recommend Michael to anyone.", "pics": null, "resp": {"time": 1621989687138, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117942383550218137592", "name": "Louise", "time": 1616350283174, "rating": 5.0, "text": "We have been dealing with Joe Bullard for 7 years now and have found them to be pleasant and helpful every time.  We have had everything from body work, leasing, engine repairs, purchasing vehicles to oil changes and I have never been disappointed.  Joe Bullard is our go-to dealership, without a doubt.", "pics": null, "resp": {"time": 1616355500082, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101565039457829407424", "name": "Timika Clay", "time": 1618010118397, "rating": 5.0, "text": "If you’re looking to buy a vehicle, get with Roosevelt Harris and Rodney Lofton because they will take care of all your needs. Very professional and customer satisfaction is rated #1. Everyone at Joe Bullard should take notes from them because they are held to the highest of standards. Great job and we look forward to purchasing from you all again.", "pics": null, "resp": {"time": 1618014923672, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113040261238664131005", "name": "Antoine Stallworth", "time": 1622043622742, "rating": 5.0, "text": "I've enjoyed my experience at Joe Bullard Cadillac Alan Carlisle was my sales person and he really helped me make my experience easy and convenient. Looking forward to doing business with them in the future.", "pics": null, "resp": {"time": 1622047101578, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107541375759627448166", "name": "Cindyhopkins Cindylou", "time": 1620789034455, "rating": 3.0, "text": "Went in for oil change/tire rotation.. left with greasy finger/hand prints inside my car.  On the roof, sun visor, Inside door.\nPrice of everything had increased but was not told that until time to pay.\nWebsite where I scheduled appt still gave old price.\nNot very good service provided by a supposedly upper class dealership!", "pics": null, "resp": {"time": 1620858236573, "text": "Cindy, I am sorry to hear that your recent service experience with us was not up to the Joe Bullard standard. I have informed the service manager and general manager of your feedback. One of them will be reaching out to speak with you. Again, I apologize for the service you experienced. Thank you for your feedback.\n\nHaley H.\nMarketing/PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114039471355828260628", "name": "Meredith Folger Amon", "time": 1616712694574, "rating": 5.0, "text": "My sales associate, Mr. Michael Sewell, as well as the entire staff and owner of Joe Bullard Cadillac were exceptional to work with. They went above and beyond to exceed my expectations with brilliant attention to detail, courtesy and professionalism.  Excellence across the board!", "pics": null, "resp": {"time": 1616715685188, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113396947579900009111", "name": "Joi Miles", "time": 1623442505601, "rating": 5.0, "text": "I had been putting off buying a new car for months because I was concerned about being hassled and having to haggle. After many internet services, thankfully, Haley connected me with Allen “A. J. “ Jones. That connection turned out to be a blessing. A. J. was very knowledgeable, courteous, positive and patient as we worked on finding my new car. He made sure that I had just what wanted and needed. I love my new XT6! A huge THANK YOU goes out to A.J. and the entire team who made my new vehicle purchase enjoyable, stress-free, and fast.", "pics": null, "resp": {"time": 1623447684091, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104683741362136906722", "name": "Tate Smith", "time": 1612059215955, "rating": 5.0, "text": "I recently purchased a new truck from Joe Bullard Chevrolet. I worked with Zach Bell. He made the entire process great. The truck I bought was still in transit, so they put me in a brand new truck to drive while I waited for mine to be delivered. Zach was nice enough to deliver it all the way to MS. If you’re looking to buy a vehicle, I would highly recommend Zach Bell.", "pics": null, "resp": {"time": 1612063496266, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117684235782543563860", "name": "Joslyn Greer", "time": 1618269272654, "rating": 2.0, "text": "I called to get information on a new Escalade. The only information I got was Lizzy is the Internet Manager here at Joe Bullard. That’s all she could tell me. She couldn’t tell me when one was coming in or what she had available. I understand they are in high demand but I thought the “internet manager” would have some information available. Thanks anyway", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106651221544743029768", "name": "Roseanne Jones", "time": 1610370531097, "rating": 5.0, "text": "This was probably the easiest and smoothest vehicle buying experiences ever! Our salesman, Sam Ross, had everything ready to view including car fax. We were out of there in about an hour (including detailing time). My son is so happy with his first truck!", "pics": null, "resp": {"time": 1610375223824, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112454256158640628801", "name": "Ken Coale", "time": 1611445007684, "rating": 5.0, "text": "Enjoyed our sales experience at Joe Bullard. Alan and Thomas did all they could to get us in and out in a reasonable amt. of time.  Good product and good people. Spent plenty of time with us on making the right purchase. No hassle      purchase.", "pics": null, "resp": {"time": 1611447907322, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107174706555172137353", "name": "Angela Bush", "time": 1609610370603, "rating": 5.0, "text": "This was absolutely the best car buying experience I’ve ever had!! Excellent customer service from my salesperson, Cindy Woods! Roosevelt and Thomas also went over and beyond to make sure  the price was right and I was satisfied.", "pics": null, "resp": {"time": 1609612121743, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117510984505583718151", "name": "Olivia Bishop-Cairns", "time": 1608168482093, "rating": 5.0, "text": "Fantastic car buying experience at Joe Bullard Cadillac. Our salesman Michael Sewell was extremely helpful, made us feel at ease and comfortable buying a new vehicle. Experience from beginning was excellent even letting us take car home for weekend to test drive, offering deals thanks to business membership and overall after sales follow up ensuring we were completely satisfied. Would recommend buying from Joe Bullard and Michael and will definitely buy from Joe Bullard Cadillac again. Thank you again for a great experience.", "pics": null, "resp": {"time": 1608172343742, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102798764483394873849", "name": "Deana Pickrell", "time": 1610463969201, "rating": 5.0, "text": "I went in to look at a used ATS but left with a brand new Cadillac CT4! I was upside down and Rodney and the Joe Bullard team came up with a plan that would work for me and got me in a brand new car, which I have never had before. I am very appreciative to them and would definitely recommend using them if you are looking for a new car. Glad this FL girl drove to Alabama on a whim!", "pics": null, "resp": {"time": 1610468850197, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102052512237615631659", "name": "Liz Haffner", "time": 1612143862061, "rating": 5.0, "text": "Joe Bullard is incredible.  Michael Sewell assisted us in buying out F150.  The nicest people there all so kind and welcoming made the car buying process simple and painless! Highly recommend.", "pics": null, "resp": {"time": 1612146283142, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116273372955689155141", "name": "Nona Odum", "time": 1623588065215, "rating": 4.0, "text": "AJ was top notch in making the buying experience so easy!!", "pics": null, "resp": {"time": 1623591788046, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108228982298791458141", "name": "Michael Paradis", "time": 1576030994264, "rating": 5.0, "text": "Thank you Joe Bullard. The tribute to our military active duty, retired and former military veterans that you've shown is evidence of your patriotism and respect for the military as a whole. I know that everyone on the I-65 freeway and passing by your business appreciates you and all your employees.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP2gFwifZd9LxLh9pCDj_nBTf0kBwtdPdZhxDKb=w150-h150-k-no-p"]}], "resp": {"time": 1576082150846, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104200560997683496041", "name": "Terry Benson", "time": 1612115184702, "rating": 5.0, "text": "The simplest and most pain free new vehicle purchase I have ever had.  Sam, Angela, and Drew went above and beyond to put the deal together and had everything put together for a quick completion to our transaction when we arrived at the dealership.  If you want a great buying experience, visit the team at Joe Bullard Chevrolet!!!", "pics": null, "resp": {"time": 1612117529836, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112970359649282863841", "name": "Steven Foster", "time": 1606941853250, "rating": 5.0, "text": "Purchased my wife 2020 Cadillac CT5 from Joe Bullard Cadillac.  In 30 years of car buying I have not been more satisfied with the car buying experience than now.  Allen “AJ” Jones is one of the nicest, knowledgeable, and easiest going gentlemen I’ve dealt with buying anything.  AJ and Roosevelt and top notch individuals.  A pleasure doing business with them.  I will recommend them and buy from them again.\n\nThank you all for making my wife and myself feel so welcome.", "pics": null, "resp": {"time": 1606948575636, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104332801598215276076", "name": "Nicholas Williams", "time": 1614954325721, "rating": 1.0, "text": "I purchased a vehicle from this dealership in Jan 2021. I came from out of state to pick up the vehicle and when I arrived found out there was an issue with the vehicle. After waiting for a while we worked out  a fixed for the issues and the dealer said they would send a check to me for the repairs. It took almost two weeks for them to finally send the check to me.  Now over a month after I purchased the vehicle I get a message from my county tag office saying that the dealership didn't pay the Tag fe and I will have to come in and pay it.  If a dealer is not going to pay these fees, they need to let people know so your not waiting until the temporary tags run out.", "pics": null, "resp": {"time": 1614955915611, "text": "Nicholas, I am very sorry to hear that we weren’t able to provide you with the best experience possible. I have passed this information on to the General Manager and he will be reaching out to you. We appreciate your feedback and can only improve because of it!\n\nHaley H.\nMarketing/PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113184427049048034979", "name": "glenn jackson", "time": 1608947121156, "rating": 5.0, "text": "If you thinking of buying a new car or looking for the best price in town contact Lee Carter at joe Bullard Chevrolet. He was my salesman when I bought a new Trax 12/21/2020 He answered all our questions, that tells me he knows his stuff, he actually enjoyed finding us many discounts and helping us to get a lower monthly payment. I highly recommend Lee and Joe Bullard, my brother bought his force car from Joe Bullard back in 1957", "pics": null, "resp": {"time": 1608949323283, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117304959096889730230", "name": "Cortina Smith", "time": 1596625795068, "rating": 5.0, "text": "From the moment I contacted the team at Joe Bullard,  they were excellent. The whole team worked together, without unnecessary pressure, to ensure my concerns, questions and needs were met. The atmosphere in their sales room is far different than any I have ever experienced anywhere else. From the moment I walked in, I was at peace and my salesman,  Michael Sewell, was excellent. He served me with a smile and the heart of Christ. I purchased my Corolla from Joe Bullard and I look forward to a long relationship with this team and I would and have already, recommended them to others. The commercials are point on about the Joe Bullard Team, they are great!", "pics": null, "resp": {"time": 1596630411956, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100550366499914031127", "name": "Paula Lame", "time": 1616709682015, "rating": 1.0, "text": "I tried to stop in today. The front desk girl was so into her tablet she didn’t acknowledge me. I said hello but her headphones were in so she didn’t hear me. It wasn’t a great experience. I would think that the front desk receptionist would at least look up and speak to me. I left.", "pics": null, "resp": {"time": 1616774504106, "text": "Paula, I am so sorry to hear about your recent experience. This is not the experience we want any of our customers to have. We would like to gather more information about your experience so we can address the issue and ensure it does not happen again. Please reach out to our E-Commerce Director, Casey Wright, at 251-378-4360. With your feedback we can only improve our processes and ensure the best customer experience possible.\n\nThank you,\n\nHaley H.\nMarketing/PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109973456375008369385", "name": "Melanie Thornton", "time": 1602676078640, "rating": 5.0, "text": "I purchased my  2020 Suburban from Joe Bullard Chevrolet in Mobile, Alabama, my sales agent was Terry Cleveland, the process started off a little slow, we played phone tag for some days, but my overall experience with this dealership was Great, Terry did  everything possible to make us feel comfortable while at the dealership. Everyone at the dealership was very nice.\n\nI’m very happy with my purchase and the treatment I received during my time a Joe Bullard Chevrolet.\n\nMelly Mel", "pics": null, "resp": {"time": 1602678505788, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112522425800536684279", "name": "Felesia Kennedy", "time": 1602281181749, "rating": 5.0, "text": "Well, what can I say about my experience at Joe Bullard. It was AMAZING!!!! No stress, no fuss, no muss. Alex was very kind and knowledgeable about my vehicle. Everyone I came in contact with was pleasant .  I would definitely recommend Alex / Joe Bullard  for anyone's next car purchasing experience. Thanks again Alex/ Joe Bullard", "pics": null, "resp": {"time": 1602286076786, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115553018020533449381", "name": "teresa jackson", "time": 1607825157515, "rating": 5.0, "text": "I leased a 2021Blazer this week and my salesman was Sam Ross , he was amazing, very professional and answer all my questions. He was the reason I chose Joe Bullard Chevrolet. I'm very thankful that he was my salesman and I will  recommend him to all my family and friends.", "pics": null, "resp": {"time": 1607830476924, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117377691675330197466", "name": "Adrienne Tate", "time": 1531716607859, "rating": 5.0, "text": "My car buying experience was very smooth and enjoyable. Damos helped me find a car and Roosevelt helped with doing my financing over the phone. All was pretty much done by the time I was at the dealership to sign the papers and drive away in my brand new to me SUV. Thank you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPJ5aK-W9qVrjE1UViUj3SIzj2JdDvSHjB7EGKw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMwhfVHQIz4CpLsRF_bjIetfQTC3ulBfT0TCAnp=w150-h150-k-no-p"]}], "resp": {"time": 1532450852508, "text": "Adrienne, thank you very much for taking the time to leave us a great review! We are pleased to hear about your great experience at Joe Bullard Cadillac! If there is anything else we can do for you, please feel free to give us a call.\n\nBest,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109126291142126543755", "name": "Pat Patterson", "time": 1621117078217, "rating": 2.0, "text": "Paid almost $900 because I was told I needed a new brake pads with new rotors that I had replaced 22,000 miles ago. Said I needed a tune up at 70,000 miles because my engine light had come on.\nDrove car for 2 days engine light came on again and brakes started sqeaking.", "pics": null, "resp": {"time": 1506613946151, "text": "Thank you for your star rating, Pat! I will be sure to pass along your praises to the team, and all of us hope to see you again when the time comes to service your car.\n\nKind regards,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110773623159260657121", "name": "Ronnie Bogard", "time": 1611941242616, "rating": 5.0, "text": "Allen is a great asset to your dealership. We left your dealership after  having bad service with Moose last year and having purchased 5 caddys through you.  Allen brought us back with his low pressured professionalism!\nLook forward to purchasing more from you in the future.\nThe Bogards", "pics": null, "resp": {"time": 1611944777005, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117189001987915902531", "name": "Anita Moore", "time": 1607200187140, "rating": 5.0, "text": "My experience was great Mr. Jones was very understanding to what i wanted in a vehicle and made sure that i got exactly what i came for. between himself and Mr. Roosevelt I was very satisfied i would recommend Joe Bullard Cadillac to anyone searching for a car.", "pics": null, "resp": {"time": 1607203937575, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106726670097937771756", "name": "Danelle Davis", "time": 1607917325433, "rating": 4.0, "text": "After being in an accident and not having a vehicle for a month, Tony  Walker made my car buying experience a great one. He was able to answer my questions and get me into an SUV that had all the features I needed. I will definitely recommend Joe Bullard Cadillac and Tony to my friends and colleagues.", "pics": null, "resp": {"time": 1607920250615, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108713473597344212669", "name": "Gregory Cunill", "time": 1597178676088, "rating": 5.0, "text": "Troy was very friendly and inviting, we called told him what we wanted to look at. When we arrived it was stationed in the shade ready for us to look at. The dealership made it very relaxing unlike most where they try to pressure you into buying something you don't want. The joe Bullard Cadillac team worked up a great deal that was beyond what we expected. Thank you again Troy and the Joe Bullard Cadillac team for everything. Will be back. My daughter said to give you 10 stars, she loves her new ride.", "pics": null, "resp": {"time": 1597184822649, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115870296660902478611", "name": "Denise Sanders", "time": 1599360188032, "rating": 5.0, "text": "My salesman was Troy A.   He worked with me for about a month keeping me updated on the inventory.  I had told him my preferences early on about the car I was looking for and the type of sales partner I was looking for and from the get go he fit the bill.  This is the second auto I have purchased from this dealer and would be happy to return if or when the time comes to get another auto. CUDOS to Troy.  He truly listens and is a great fit to the Joe Bullard Cadillac experience.", "pics": null, "resp": {"time": 1599367146959, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113577112492065073166", "name": "Henry Pough, Jr.", "time": 1607190957056, "rating": 5.0, "text": "Lee Thomas and team made it easy to find a vehicle we were comfortable in  at a payment that was affordable to me. I highly recommend seeing them for any car buying needs.", "pics": null, "resp": {"time": 1607192999839, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105343337416969941435", "name": "Michael Underwood", "time": 1594687796292, "rating": 5.0, "text": "Great experience ! Troy made everything so easy. I was able to test drive and check out my vehicle in person (no haggling); then I went home and decided I wanted to buy it and we were able to complete the rest of the sale over the phone! Best part was that Troy personally delivered the car to my house ! Easiest car sale I've ever experienced", "pics": null, "resp": {"time": 1594693665097, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115948242888102927088", "name": "Jackie Rodgers", "time": 1595098641699, "rating": 5.0, "text": "Working with the team of professionals at Joe Bullard Cadillac was rewarding at the least. During these uncertain times, they made the experience like none other I've had when purchasing a car.\nWhen faced with the realization that I had to purchase a car, they made the process so delightful, anyone would be pleased to have them be your dealership.\nDon't  hesitate to call, go online or go into visit them if you are in the market for a new or preowned vehicle.", "pics": null, "resp": {"time": 1595104045954, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111685604658428412423", "name": "mike wright", "time": 1609278616998, "rating": 5.0, "text": "I would just like to take the time to acknowledge Allen AJ Jones for the amazing job he does for Joe Bullard Cadillac.  I have bought many vehicles in my life time and cringe every time  I have to look for the next one. AJ made my car buying experience change for ever. This was the easiest purchase I have ever made. No Bull from Bullard. AJ met every request in the vehicle I ask for and after the sell still checked on my satisfaction with the purchase after the sell.....who does that? Allen Jones did! When I tell you I have bought vehicles from many dealer, I have, but never will I buy from anyone but Joe Bullard Cadillac and Allen AJ Jones will be who I’m looking for to take care of me.", "pics": null, "resp": {"time": 1609327573626, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103353680574156392074", "name": "Erajah Scypion", "time": 1611287255062, "rating": 5.0, "text": "I appreciate Alan for helping my purchase my car. Very respectful man.", "pics": null, "resp": {"time": 1611289490035, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104621290866971002955", "name": "John Ellis", "time": 1603652837021, "rating": 5.0, "text": "After searching tirelessly for the perfect new truck I made contact with a sales representative at Joe Bullard. The internet sales rep walked me through the process and helped me find the perfect truck. When I come into the dealership she handed me over to Zack Bell, whom made this new truck purchase amazing. He answered all my questions. Had me in and out the door in my brand new silverado faster than any other dealer I have ever shopped. I highly recommend all the team at Joe Bullard Chevrolet.", "pics": null, "resp": {"time": 1603657644453, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114767810796668166500", "name": "Katryna King", "time": 1611712441190, "rating": 5.0, "text": "I received great customer service at this dealership. My salesman, Lee Thomas, was knowledgeable, patient, friendly, and professional.", "pics": null, "resp": {"time": 1611714295205, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111485072960258795935", "name": "Alex Argiro", "time": 1591899071839, "rating": 5.0, "text": "I bought a very nice RAM 1500 pickup truck from Joe Bullard Cadillac this week, and the people at Joe Bullard were as friendly as I have ever seen. The gentlemen and ladies that helped me were fully focused on me and what my needs were. They made my experience 100% satisfying from the initial test drives to the final purchase . It was fast easy and relaxing. I would highly recommend buying from Joe Bullard Cadillac. I will be a loyal customer for my next purchase here. Ask for Consultant : Michael Sewell.", "pics": null, "resp": {"time": 1591907120141, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109587204272915996738", "name": "Kimberly Neece", "time": 1611929899009, "rating": 5.0, "text": "Cindy was great! She cares about what customers want. Thank You!", "pics": null, "resp": {"time": 1611933985869, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109644882880718246257", "name": "Michael Miller", "time": 1592926278758, "rating": 5.0, "text": "I bought a Car from Bullard last week and have been very pleased with the experience so far. The car was in good shape and their team did a great job to make the process easy. Troy was my sales associate and he was great to work with. I’d recommend purchasing a car from them.", "pics": null, "resp": {"time": 1592933240334, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117590280480911769661", "name": "Bryan Hoffman", "time": 1610412691683, "rating": 5.0, "text": "Good choice of vehicles. Was ready for my appointment, so no waiting. Stayed after closing time to close the deal.", "pics": null, "resp": {"time": 1610414756221, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106031542023337063868", "name": "beverly tunstall", "time": 1603645258612, "rating": 5.0, "text": "Joe Bullard is truly a great place to shop for your next car,a great team ,who care about theirs  customers. Hailey and John and all the guys in the service department are super  team,Mr ROOSEVELT  Harris ,the whole sales department  are awesome  guys.", "pics": null, "resp": {"time": 1603650479173, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104156318418874577809", "name": "Shantel Dailey", "time": 1599523757822, "rating": 5.0, "text": "GREAT Experience!  Rodney was a superb salesman.  He delivered my truck to me and explained all the features.  We completed the paperwork in less than 2 hours.", "pics": null, "resp": {"time": 1598988874056, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113668922904707961041", "name": "Joseph Ecker", "time": 1594855421718, "rating": 5.0, "text": "The salesman Alex Esquibel is the man. Go to him first if you’re purchasing anything. Bought a beautiful F-150 from them and I’m very happy with the purchase and the experience. Alex was very thorough, patient, and answered all my questions despite how annoying I was. This was even after my purchase. In most cases once the sale is done the salesman has no use for you. That wasn’t the case here.", "pics": null, "resp": {"time": 1594484709243, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110440848709542579614", "name": "Janine Barkwell", "time": 1599960834356, "rating": 5.0, "text": "I had the best salesman there has been around in a while at Joe Bullard.  AJ Jones. He was so good at understanding me and what was best for me to purchase. It makes me want to make sure I get him in the future ...", "pics": null, "resp": {"time": 1599968175387, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115112809481983534749", "name": "Linda Manasco", "time": 1603635707876, "rating": 5.0, "text": "Had a wonderful experience with AJ at Joe Bullard. Everyone was friendly and professional, and absolutely no pressure!  I love my new Cadillac!!", "pics": null, "resp": {"time": 1603639698798, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112988857985805181866", "name": "Katy McGehee", "time": 1580364974516, "rating": 5.0, "text": "The service department is the best I've ever encountered. They have gone above and beyond every single time. I'm not a crying person but they've made me cry twice. The good cry. The first time: I assume they saw the toy factory and smashed snacks in the carpet or maybe it was my food covered shirt and crazy hair. Either way, they gave me a note of encouragement that every mom needs sometimes with a gift card for coffee. The second time: I requested a larger loaner vehicle which is apparently hard to come by. Along with my 3 kids, my dad is in a wheelchair and I transport him to/from dialysis and we just all wouldn't fit in the smaller one. They greeted me with a \"one tough cookie\" box with treats and snacks galore.\n\nThey are the nicest people and so accommodating. Add uplifting to that mix. That was this exhausted Mama's gift from heaven.\n\nI can't say enough good things about them. I would buy every vehicle from them a thousand times over just to show my appreciation to their service department. Thanks guys!", "pics": null, "resp": {"time": 1580373793664, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111949086790386173415", "name": "Harry Stephens", "time": 1579660309400, "rating": 5.0, "text": "Joe Bullard Cadillac in Mobile, Al is an excellent new/used car dealer.  The building was clean and attractive.  The bathrooms and waiting area were clean and well lighted.  There was no pressure to make a purchase.\nOur sales person (Troy Andrews) was very knowledgeable about the product and answered all of our questions.  He was well dressed and has a great personality.  Yes, I would purchase another vehicle from Joe Bullard when the time comes.", "pics": null, "resp": {"time": 1579667726935, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117851614677792064035", "name": "Kristi Grammer", "time": 1600724317197, "rating": 5.0, "text": "Troy and Thomas were both wonderful! They were both very knowledgeable and super helpful in getting me in a car I LOVE! Highly recommended!", "pics": null, "resp": {"time": 1600731206591, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113819162338506794284", "name": "Tim Freeman", "time": 1602950040541, "rating": 5.0, "text": "I work with salesman Alan Carlisle to purchase my wife a new 2020 Cadillac ST4. Process was very easy and professional! She LOVES her new car.", "pics": null, "resp": {"time": 1602952154079, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102470121932987842253", "name": "Ann Hodges", "time": 1618601585145, "rating": 5.0, "text": "Everyone was very knowable about my car and had every thing done in no time  there was not a lone waiting time", "pics": null, "resp": {"time": 1618605418787, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110796356306219642462", "name": "Sheryl Stroud", "time": 1592879876953, "rating": 5.0, "text": "I had a great experience purchasing a car with Joe Bullard Cadillac. I was shopping online for a vehicle, and Haley (with their internet sales) was very prompt in replying to my questions and providing me with information. I went into the dealership where Alex took me for a test drive in \"my\" car. Shopping for a car turns me into a \"Nervous Nelly\", but everyone I met was calm, and polite. I did not feel pressured nor rushed, which I greatly appreciated. I really like my car, and I really like the folks at Joe Bullard!", "pics": null, "resp": {"time": 1592886449404, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115111923175916508098", "name": "L James", "time": 1601403899185, "rating": 4.0, "text": "Hands down , just ask for Lee Thomas when you get there . Very courteous , professional and moves quick to make the deal happen . Business done easy . The business manager was very professional ( something out of the norm for most places ) . I was told that they only had one key fob during the sale . Four days later , Lee contacted me and said that he had one on the way ! Great job guys .", "pics": null, "resp": {"time": 1601407850046, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112529004548691741534", "name": "larry wade", "time": 1612727954859, "rating": 5.0, "text": "Great sales and service. Will do business again.", "pics": null, "resp": {"time": 1612729565284, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107885947921745986765", "name": "Lynne Winterton", "time": 1610555294563, "rating": 5.0, "text": "This is the first car dealership where I did not feel pressured or like I was being talked into buying the car. They were knowledgeable, patient and explained all options.", "pics": null, "resp": {"time": 1609936038617, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117327607721074821554", "name": "Helen Scott", "time": 1590743596474, "rating": 5.0, "text": "This was a great experience, as always. This was my 2nd lease with Joe Bullard. Troy and Roosevelt went above and beyond to make sure everything went well with my lease. Troy was great with following up to make sure everything was going good with my new lease. Thank you for everything  and I will recommend  you to anyone in the market for a new or used vehicle.", "pics": null, "resp": {"time": 1590751604603, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104896016773073062938", "name": "Ralph Amos", "time": 1598303897289, "rating": 5.0, "text": "We purchased a 2020 Silverado and had a fantastic experience at Joe Bullard Chevrolet !!!\n\nSam, Chuck, Drew and Ty were all very hospitable, informative and extremely helpful, in every way.\n\nI strongly recommend Joe Bullard Chevrolet.", "pics": null, "resp": {"time": 1598312042123, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114491051323949884861", "name": "Ms clinton", "time": 1573681173095, "rating": 5.0, "text": "I had an exact car in mind, down to the color, when I drove nearly 2 hours to Joe Bullard Cadillac, after finding my dream car online. I could not have been more pleased with my experience! At no time did I ever feel any pressure. At no time was I ever made to feel uncomfortable. The entire staff was friendly, courteous, patient and kind. I believe that I was blessed with my sales consultant as well! Troy Andrews is that perfect person that you only hope to get whenever you drive into the parking lot of a car dealership! He did not come outside, ever, to hound me. We all hate that whenever it comes time to shop for a car- and they do NOT do that at this dealership! Furthermore, Troy was patient in answering my questions, and always a perfect gentleman! I never felt that I was dealing with a pushy salesman. I'd highly suggest Joe Bullard Cadillac, and if you do not ask for Troy Andrews, you will be missing out!", "pics": null, "resp": {"time": 1573684631670, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110928954324353915665", "name": "Arnold Kidd", "time": 1604596829164, "rating": 5.0, "text": "Customer service was wonderful. I felt like a valued customer.", "pics": null, "resp": {"time": 1604600942047, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100794824563746209226", "name": "Natalie Hall", "time": 1594649244906, "rating": 5.0, "text": "Love Joe Bullard Cadillac. I recently purchased my second vehicle from them and could not be happier. AJ is a great salesman. Haley is the best for service.", "pics": null, "resp": {"time": 1594653994331, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102331914576356110748", "name": "Brandy Lister", "time": 1616692227894, "rating": 5.0, "text": "Service is great!  Everyone is very friendly!", "pics": null, "resp": {"time": 1616697522899, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103773304347418443574", "name": "Veronica Eaton", "time": 1602774536410, "rating": 1.0, "text": "I was due for an oil change for my 2012 Cadillac SRX and received a call from the dealership asking me to schedule an appt. I looked online 1st to schedule, there was an appt. available for the next day. I didn't book it, thinking that maybe the person that called would get credit for service. I called her back, and was informed that it would be a week out for the oil change, fine. I also had a secondary issue of getting an estimate for the liftgate actuator replacement. A week later, I take the car in and wait on it. When it was done, I specifically asked about the actuator and was told that the estimate was the paperwork. It wasn't. I called back today to see when I could have this repaired and  was given another appt. a week out. The moral of the story is that they listed 12 things for \"recommended services\"  but nothing on what I actually requested. The car could have been repaired 10 days ago if I had been given the info that I requested. Now I'm trying to see if I can get my SRX repaired at another dealership either in Pensacola or Gulf Port.", "pics": null, "resp": {"time": 1603291870115, "text": "Hi Veronica,  I am very sorry to hear about your recent experiece with us. It is our goal to provide each customer with the best service experience possible. We have passed your feedback along to our General Manager and Serivice Manager. With your feedback we can only improve our processes and provide you with the best experience possible."}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108198055592636495035", "name": "Al Flott", "time": 1600012317493, "rating": 4.0, "text": "Joe Bullard was a nice business atmosphere to go by my first new work van . My agent Mr.Terry Cleveland was very attentive to what I was looking for in a work van and gave a lot of insight on my new vehicle so I would to give him a shoutout saying thank you very much sir . And anybody else if you are looking for a vehicle and good Saleman ship go to joe Bullard they are your vehicle specialist. 👍🏽", "pics": null, "resp": {"time": 1600018598506, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106780838532788078853", "name": "Korivi ranga nanda kishore", "time": 1598448563922, "rating": 5.0, "text": "Brought a chevy spark, Lee Thomas from sales and other staff made the sale and are very professional and helpful. Received an excellent price.", "pics": null, "resp": {"time": 1598456134304, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100640697056944781455", "name": "Michelle Hartley", "time": 1567558008953, "rating": 5.0, "text": "I had the best experience buying my 2018 Dodge Challenger at Joe Bullard Cadillac. It all started with the great customer service Bobbie Hebert gave to me from the time I called to inquire if the car was still available, her wonderful knowledge about the car, and how she was easily able to relate to myself and my brother during the sales process and test drive. She was just as excited for me as I was for myself buying my dream car. She even followed up with me the next business day they were open after my purchase to see if I was still enjoying my Challenger. This is the first time I have ever had a dealership follow up after a purchase. It really made the words spoken to me at dealership mean something.....they pride themselves on the experience not the sell. I have to give Bobbie and the rest of the team who helped complete this purchase for me 5 stars for a stellar experience.", "pics": null, "resp": {"time": 1567571056741, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114957280927642213939", "name": "Susan Moulton", "time": 1593915478139, "rating": 5.0, "text": "I was impressed with the \"no pressure\" approach to the way Troy Andrews dealt with me.  I must say, the car really sold it's self, but he was great showing me all of the features and getting my phone connected to the car and the other apps.", "pics": null, "resp": {"time": 1593923210904, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105488704584646356503", "name": "Red Fox", "time": 1610311417672, "rating": 5.0, "text": "Sam Ross was helpful and nice. Thanks to all.", "pics": null, "resp": {"time": 1610314054056, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112081835122594487133", "name": "Harper Mike", "time": 1597067990453, "rating": 5.0, "text": "We were going to the Harley shop stoped for directions, this guy named Troy came out and started talking to my wife and dog. Next thing I know another guy came out named Roosevelt and started talking like a long lost family member, the next thing I know we drove away in a new Cadalic SUV. These were two great guys, I still don't know what happened but it was a great experience. Damn got to learn how to use GPS.\nThanks Guys", "pics": null, "resp": {"time": 1597037186519, "text": "Thank you for your rating! We hope to see you back soon. We appreciate your business and thank you for choosing to be a part of the Joe Bullard family of customers!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109557114949244735846", "name": "Stephanie Axtell", "time": 1577675155866, "rating": 5.0, "text": "Dan Byrd was our salesman and was the absolute best salesman we’ve ever had. He was polite, thorough, and very knowledgeable about many different vehicle brands. My husband and I look forward to continuing to do business with Joe Bullard Cadillac. I’m incredibly satisfied with my new Cadillac from them.", "pics": null, "resp": {"time": 1577680579504, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100141277020824476424", "name": "Justin Shelton", "time": 1580693487588, "rating": 5.0, "text": "Drove 2 and a half hours to visit the dealership and look at two specific vehicles. Upon arriving, Dan Byrd greeted me and let me knew if there was anything he could do for me, to let him know. Every part of the vehicle buying experience was great from dealing with Mr. Byrd in the buying experience and Mr. Thomas Bates in finance. Great team, great dealership, pleasurable experience. Glad to do business with them!", "pics": null, "resp": {"time": 1580701019032, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115731670876365696103", "name": "Haleigh Shelly", "time": 1597151220080, "rating": 5.0, "text": "It was a pleasant experience from the phone call to schedule the first appointment to driving off with our new Acadia. Thanks to everyone at Joe Bullard for making buying our new car a breeze!", "pics": null, "resp": {"time": 1597156165442, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106060090469567364040", "name": "Kevin Michaels", "time": 1612272095185, "rating": 5.0, "text": "No pressure on purchase.  Finance and sales person worked together to move through the purchasing process.", "pics": null, "resp": {"time": 1612275878990, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111578623890374788637", "name": "Matthew Miller", "time": 1596732542817, "rating": 5.0, "text": "My fiance and I had an excellent purchase experience at Joe Bullard Cadillac.  The team at the dealership went above and beyond.  I can't say enough positive things about our sales consultant Troy Andrews and finance manager Thomas.  Both were pleasure to work with.  We will certainly be back to Joe Bullard Cadillac again for our next vehicle purchase.", "pics": null, "resp": {"time": 1596738543377, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103810578376679263256", "name": "L Craig Roberts", "time": 1560703782784, "rating": 5.0, "text": "Troy is the best! Five stars+.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN9-IHA7wU3md8Uqoqmip9R7X7Y60xaPNlfYSh5=w150-h150-k-no-p"]}], "resp": {"time": 1560872516707, "text": "Thank you so much for such an awesome review! I will share this with Troy as he will be happy to hear it.\n\nKind regards,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115357365675454001072", "name": "Clarence Douglas", "time": 1602562911497, "rating": 5.0, "text": "Great and friendly service. My wife and I are likely to return in the future for more vehicle purchases.", "pics": null, "resp": {"time": 1602566915198, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117669985983788808647", "name": "Phillip Brown", "time": 1584712913209, "rating": 5.0, "text": "Really fast service.\nRodney Lofton helped make the process go really smooth and got us in our vehicle quick.\nStaff is really friendly.\nWill definitely use again for future purchases", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114949249826284116190", "name": "Johnnie McIntosh", "time": 1590776245354, "rating": 5.0, "text": "We recently purchased our Cadillac from Joe Bullard Cadillac of Mobile and A. J. Jones was our Sales Specialist.  He was professional, kind, a great personality and friendly.  His knowledgeability about the vehicle great. He explained and demonstrated every item we needed to know on our vehicle. We are very satisfied with our new Cadillac.", "pics": null, "resp": {"time": 1590784034523, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113676799574661879482", "name": "Belinda Peace", "time": 1592832630944, "rating": 5.0, "text": "Originally our thoughts were to look at various dealerships but after we met with Michael Sewell we stayed with Joe Bullard Cadillac. He was kind, thoughtful, knowledgeable, honest, and very detailed. I would highly recommend Joe Bullard Cadillac and Michael Sewell.", "pics": null, "resp": {"time": 1592839588027, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115686931062224503045", "name": "Amy Taylor", "time": 1581281450904, "rating": 5.0, "text": "We searched 14 other dealerships prior to purchasing our daughters first car and ended up back at Joe Bullard for the win. Alex and Parker were amazing and made the process a smooth one. Will definitely use again in the future!", "pics": null, "resp": {"time": 1581287718299, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106969561787849073512", "name": "James Grant", "time": 1574038963527, "rating": 5.0, "text": "We recently purchased a pre-owned Lexus from Joe Bullard Cadillac and were very pleased with the assistance from Troy Andrews.  Troy was very knowledgeable, congenial, and helpful.  I usually don't enjoy the car-buying process, but Troy made it a good experience.  I highly recommend him if you are thinking of purchasing a vehicle.", "pics": null, "resp": {"time": 1574051679977, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105048273626814413914", "name": "Dwayne Robbins", "time": 1580858729043, "rating": 5.0, "text": "Both the lead salesman and the trainee salesman were very personable and knowledgeable.  Finance Manager was very helpful explaining all the financing options and details of extended warranties.  Overall pleasant experience.", "pics": null, "resp": {"time": 1580866677898, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112608597632858841542", "name": "Tameka Jamison", "time": 1563994537390, "rating": 5.0, "text": "The experience at Joe Bullard was simply stellar. Dan was amazing and extremely knowledgeable of the product also a true professional. Even after the purchase Dan followed up to ensure that we were beyond satisfied. Hats off to Roosevelt for working your magic. Great hires Joe Bullard and happy selling!!!", "pics": null, "resp": {"time": 1564081282094, "text": "Hi Tameka. We appreciate your positive feedback about your experience. We take pride in serving our customers and we'll be sure to give Roosevelt a high-five for a job well done 😃  Hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114320716689054935130", "name": "Danielle Dials", "time": 1594226355984, "rating": 5.0, "text": "I had a great experience here. AJ and Roosevelt were exceptionally courteous.", "pics": null, "resp": {"time": 1594232779812, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109990247799859701697", "name": "Kimberly Plash", "time": 1583886351351, "rating": 5.0, "text": "I purchased my Jeep Grand Cherokee Overland from AJ Jones last month at Joe Bullard and had a wonderful experience. He was very knowledgeable about the vehicles and made the car shopping process fun.  We were in and out pretty quickly and everyone we dealt with was super friendly. I highly recommend AJ Jones and Joe Bullard for your next car purchase! A+!!", "pics": null, "resp": {"time": 1583894247421, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115479528212334491206", "name": "Sherri Herrington", "time": 1539403431433, "rating": 5.0, "text": "By far the absolute best experience I have ever had buying a car. If you are looking for a car please see Michael Sewell. Absolutely fantastic to deal with and I would highly recommend him! The transparency and honesty were a complete change from what I expected. I have an absolute new respect for the Bullard family and their dealerships. Once you walk in there is no doubt that customer satisfaction and the customers experience is higher in the business plan than the numbers are which is not normal operating procedure in most dealerships I could not write enough about how pleased I was with the whole experience. I did not walk out feeling as though a great deal on a vehicle was the only thing I got. I walked out of that dealership with an uplifted spirit and felt through the whole process that I was receiving amazing fellowship and as if I were being edified through this whole process. If God sees fit I will absolutely be a customer for life.They were an absolute inspiration and are a perfect model of a working business  plan that is extremely successful. And I’m not talking only monetarily successful. I left with a fire in me that they helped to burn brighter. And I thank them from the bottom of my heart for allowing God to work through them as they unknowingly ministered to me They never realized it and that’s what makes them special.", "pics": null, "resp": {"time": 1540855952253, "text": "Thank you for writing about your visit with us! I am happy to hear that our staff was able to provide you with the outstanding customer service we strive to deliver to each of our guests. We would love to work with you again; feel free to call us with any questions or concerns. Regards, Robert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103595353183877820198", "name": "Mariana Morris", "time": 1580250713929, "rating": 5.0, "text": "I had a pretty great experience at this dealership. Go see Moose for any of your purchasing needs. The manager Roosevelt was great, as well as the Finance guy, Tom.", "pics": null, "resp": {"time": 1580258329502, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100547641725424080080", "name": "Caleb Butts", "time": 1571429491925, "rating": 5.0, "text": "Alex was great to work with and made buying a car an easy process.  He was not pushy, but was open to discussing all the considerations when buying a car, even if it meant us getting a cheaper car.  I cannot recommend him and the Joe Bullard Cadillac team enough.", "pics": null, "resp": {"time": 1571438610755, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103942866110675565267", "name": "Clifton Brown", "time": 1564190819966, "rating": 5.0, "text": "This was by far the easiest vehicle purchasing experience I have ever had. My salesperson Bobbie is amazing she did not pressure me into anything. It was more like just talking to a friend about a car and Mr. Roosevelt was great too. I would recommend giving Joe Bullard a try.", "pics": null, "resp": {"time": 1564426731967, "text": "Hi Clifton,  Thank you so much for taking the time to leave us this review and feedback. We'll be sure to pass your kinds words along to Bobbie and Roosevelt. We appreciate your business and hope to see you soon."}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115131460889227496468", "name": "Walter J Chambers", "time": 1599324697739, "rating": 5.0, "text": "I called to get our car checked, back up camera was not working, they made me a date to bring my car in to\nbe Checked, that worked with my needs for to bring the car in..  The found the problem and had to order a\nPart and when it came in the called and ask me when I wanted to come in and have the repair done, the\nDate was made that was the first day I could bring our XT-6 in..  I could not be more pleased with my\nexperience with Joe Bullard's Service Department..\nWalter J Chambers Husband of Lois R. Rackard", "pics": null, "resp": {"time": 1599330871393, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114051046066505215936", "name": "Virginia Winchester", "time": 1598447950248, "rating": 5.0, "text": "Salesman Alex and Finance Manager Tomas were very courteous and helpful.", "pics": null, "resp": {"time": 1598456133359, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114541371885851614056", "name": "Tanisha Johnson Jones", "time": 1585016422010, "rating": 5.0, "text": "This was a great experience  Allen AJ Jones was very  helpful he went over everything with me. I want to Thank you for everything  and I will recommend  you to anyone buying a car truck or SUV", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112810631209178715537", "name": "Geoffrey McGovern", "time": 1578020397852, "rating": 5.0, "text": "Troy did a good job of getting me in and out. He took care of the paper work with the credit union people so I was good to in a short time. I recommend  Troy and the rest of the Bullard team.We bought vehicles from them in 2019.", "pics": null, "resp": {"time": 1578026275161, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109739216027752773926", "name": "Tyrone S. Johnson", "time": 1600204217529, "rating": 5.0, "text": "Purchased  Cadillac XTS 2016 only serviced by Joe Bullard, customer satisfaction important to Dealership.", "pics": null, "resp": {"time": 1600209138251, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115560649776756064701", "name": "Daniel Green", "time": 1606054388288, "rating": 5.0, "text": "Ms. H. Sutton is very professional and knowledgeable.", "pics": null, "resp": {"time": 1606051699259, "text": "Thank you for taking the time to rate us! We'd love to know more what made it a great experience for you. If you get a chance to update your review, please let us know! We appreciate your business and thank you for choosing to be a part of the Joe Bullard family of customers!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103463382883829568877", "name": "Robert Paolini", "time": 1573744335970, "rating": 5.0, "text": "This is the seventh vehicle that we have purchased from Joe Bullard and, as always we are extremely pleased.\nThe team \"Moose\" and \"Roosevelt\" , are a pleasure to work with, extremely helpful and always professional. Since our first experience with Joe Bullard and their team, we come to them first when we are in need of a vehicle and will continue to do so.\nWe will definitely come to them for our next purchase.\n\nThanks again Ro and Moose!", "pics": null, "resp": {"time": 1573756708542, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102186906615014444422", "name": "Lonnie Breland", "time": 1575940768777, "rating": 5.0, "text": "But want to give out a little about to Kevin in the Service Department..  He was very energetic and professional and courteous checking me in for certified service.  Furthermore he gave a courtesy call in the same day to let me know that they identified the issue with my vehicle and fixed it on the spot along with other premium care .  I highly recommend anyone needing. Service to give these guys and I am very sure you will not be disappointed.   Thank you sooooo much Kevin for handling my issue and look forward to my next service with you al.", "pics": null, "resp": {"time": 1575995761244, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108460431937862950230", "name": "Fantasia Gibson", "time": 1580303619044, "rating": 5.0, "text": "Allen \"AJ\"  Jones Is a phenomenal representative at Joe Bullard! Not only did he help me pick out a great vehicle, He went ABOVE to take my 4 year old on a tour while we sorted out paperwork. When you go to Joe Bullard ask for AJ you will leave satisfied!", "pics": null, "resp": {"time": 1580312194672, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111042732302062454778", "name": "Shanta Jones", "time": 1585707942387, "rating": 5.0, "text": "I worked with Mr. Dan who made my car buying experience very smooth. I highly recommend Dan and Joe Bullard Cadillac.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104253760185559249412", "name": "Tony Diliberto", "time": 1580437185344, "rating": 5.0, "text": "bought a beautiful 2014 Srx Cadillac and got a great deal. Michael Sewell was my salesperson who was very very knowledgeable on every aspect of this car. Took extra time explaining to my wife and I about all the features of this car which is a lot.", "pics": null, "resp": {"time": 1580445365229, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112472151530991163054", "name": "Donald Harville", "time": 1553472607870, "rating": 5.0, "text": "Courtney was very helpful in getting us in our new car. After hitting a snag in the process the support staff around her was as helpful working every angle possible so that we could leave with our new vehicle. My wife and I would like to say thanks again to Courtney, the staff and owner at Joe Bullard Cadillac for our third successful purchase.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100615541711386455129", "name": "Denny Sands", "time": 1576668558263, "rating": 5.0, "text": "Michael Sewell was very helpful throughout my purchase.   I am very happy with my vehicle.  I would definitely recommend Joe Bullard Cadillac to anyone interested in purchasing a new vehicle.", "pics": null, "resp": {"time": 1576687002452, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103801568140478940275", "name": "Coastal INFO Marcie", "time": 1582045116139, "rating": 5.0, "text": "Great experience with Troy helping us find a safe and fun car!!! Payton Loves it, and we will be back to buy my car in a few months!!! Thanks again!", "pics": null, "resp": {"time": 1582051074718, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114527336960650897181", "name": "Annaleigh Nowling", "time": 1583120897702, "rating": 5.0, "text": "I had an awesome purchase experience with Salesman Michael Sewell. Everyone was kind, and made the whole process painless, even enjoyable!!", "pics": null, "resp": {"time": 1583127192176, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112219610282411758716", "name": "Gb Huffman", "time": 1569113038526, "rating": 5.0, "text": "Buying my beautiful Jeep from Joe Bullard Cadillac could not have been easier.  I researched what I wanted, found her online, sent contact into to the dealership and heard from the personable salesman, Alex Esquibel, the next day.  He was extremely helpful and answered every question I had.  When we met a few days later, he and Mr. Roosevelt guided us through the purchase without a glitch.\nWe encountered other employees during that day and all were extremely courteous, offering food and drinks!\nI recommend this dealership and especially Alex Esquibel to handle your inquiry!", "pics": null, "resp": {"time": 1569116500838, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105060545836115758427", "name": "Brad Howard", "time": 1558147365649, "rating": 5.0, "text": "Mr. Elastal helped us find the perfect vehicle after we found ourselves suddenly in the market for a new car. He showed us many different cars, answered all our questions,never pushed  or pressured us in any way. Highly recommend you ask for \"Moose\" , he got us a great car at a great price and about as easy a person to deal with that you could wish for. Thanks again Moose, we'll be back.", "pics": null, "resp": {"time": 1559078382840, "text": "It is important our customers feel completely confident with the customer service they received and it made us happy to read your review. If there are any other automotive needs we can assist you with, please don't hesitate to call us or stop by. Regards, Kevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108056864990318944528", "name": "Denise Horton", "time": 1580179081870, "rating": 5.0, "text": "Great car-buying experience, everyone I encountered at this dealership treated me kindly, professionally, no pressure.  Moose Elastal was my sales rep, very knowledgeable, very helpful but like everyone else there, no pressure.  Very pleased, I love my XT5!", "pics": null, "resp": {"time": 1580186114637, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111220869886229495576", "name": "Patricia Moore", "time": 1566823076266, "rating": 5.0, "text": "I have never had a more positive experience when purchasing a vehicle. Every member of the staff was courteous and respectful. I felt like a valued, long term friend rather than a second class buyer. In spite of buying a used vehicle, I was treated as if it was brand new. The service I received was exemplary. I look forward to a long partnership of service.", "pics": null, "resp": {"time": 1566837411997, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100312208074948285936", "name": "Cheryl Ganas", "time": 1587480450405, "rating": 5.0, "text": "Troy Andrews is such a great salesperson.  This is the 3rd car we have leased from him - He is a sweetheart!!", "pics": null, "resp": {"time": 1587486372121, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116903518238209213835", "name": "Robert Howell", "time": 1539617286300, "rating": 5.0, "text": "The service department here is the best I've ever experienced.  If you're afraid of dealership prices, don't worry about it here.  The prices for service here aren't what you'd expect   Ms. Haley is an awesome service advisor. She's very knowledgeable and extremely proficient at getting things done and keeping my Cadillac in tip-top running condition.", "pics": null, "resp": {"time": 1540855865486, "text": "Robert, thank you for leaving us your positive review. We are pleased to hear that you were satisfied with the thorough service you received from us. If there is anything more that we can do please come back and see us again. Take care! Robert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111204247189335018228", "name": "Bob Breazeale", "time": 1578825406540, "rating": 5.0, "text": "Great car buying experience. A.J. was excellent. Would highly recommend.", "pics": null, "resp": {"time": 1578832297336, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106283280654100719910", "name": "Steve Cox", "time": 1578100253734, "rating": 5.0, "text": "Our experience of purchasing a vehicle at Joe Bullard was wonderful! Mustafa Elastal worked with my husband and I to find the perfect vehicle. We were allowed to test drive for more than a few miles to make sure we had the right fit for our family. There was no pressure, all questions were answered, and I feel that we received a good price.  Mustafa was very helpful, knowledgeable, and friendly. We will be a return customer!", "pics": null, "resp": {"time": 1578105376006, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112349288645563934638", "name": "James Harred", "time": 1553715464724, "rating": 5.0, "text": "The service level associated with Joe Bullard is unmatched anywhere. Troy Andrews treated me professionally and like I was an old friend. Ive never had such a pleasure buying a vehicle. The whole team, including Roosevelt Harris and Thomas Bates have made me a customer of Joe Bullard in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110384992118451998852", "name": "Angel Fek", "time": 1536783460424, "rating": 5.0, "text": "I drove from Hammond Louisiana to Joe Bullard Cadillac dealership after finding a vehicle online. Absolutely worth the drive!! Friendly employees, Sales staff was not pushy at all. They worked with me so I could drive away in the exact vehicle I wanted. I would recommend this dealership to anyone looking for a new or used car. Thank you Simmie and Joe Bullard Cadillac for making this buying experience a great one!!!", "pics": null, "resp": {"time": 1536862576705, "text": "Thank you for the glowing review! We take pride in our customer service and do whatever we can to have our customers leave happy. Please don’t hesitate to contact me or visit us if you need anything else.\n\nRegards,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112400077667777349879", "name": "Connie Lathan", "time": 1578430781200, "rating": 5.0, "text": "Great customer service! Troy Andrews was very proficient and knowledgeable  about the Enclave we purchased.", "pics": null, "resp": {"time": 1578436446308, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113199225055497363946", "name": "Brianna", "time": 1559764834667, "rating": 5.0, "text": "Troy was my sales guy and he was awesome! Even though I did not purchase a vehicle he did everything he could to help me. He was very accommodating and patient. I would highly recommend Troy.", "pics": null, "resp": {"time": 1560192902103, "text": "Brianna, we are elated to hear about your positive experience! Our team works very hard to put the needs of our customers first. We look forward to helping you again in the future! Regards, Kevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101725796994563740890", "name": "Douglas Allen", "time": 1583759103378, "rating": 3.0, "text": "What started off as a beautiful experience has turned out to be a nightmare. I purchased what was told to me to be my Certified 2015 Chevrolet Suburban LTZ. Rodney Lofton who is a awesome salesman and Roseevelt Harris the phenomenal finance guy sold me the vehicle and 3mths into my purchased I was told I had over $2k worth of repairs including brakes, new radiator, tune-up, oil cooler lines, and left tie rod end just to name a few. When I asked why wasn't these things serviced and replaced before I purchased the vehicle I was told the repairs wasn't necessary at the time. I feel the salesman did a great job but the service department made it a bad purchase by not doing their job!! I had to pay for the replacement of the radiator and oil cooling lines but the other repairs are still needed. I feel robbed and will probably never purchase from a major dealership like Joe Bullard again!!", "pics": null, "resp": {"time": 1583768140458, "text": "Hi Mr. Allen,\n\nThank you for taking the time to give us this feedback. To make sure this issue is addressed/resolved I have notified the General Manager, Jason Colbert, of the situation and asked that he reached out to you as soon as possible today.\n\nI'm very sorry that your service experience did not mirror your sales experience at our store but I'm confident if there's a way to rectify the issue our team will do so.\n\nKindest regards,\nKristina M., Marketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107790130218651534215", "name": "Cordell Morrison-Moody", "time": 1588271375400, "rating": 5.0, "text": "Rodney Lofton is knowledgeable and easy to work with.\nI literally walked in at 11:30 and drove away in my new Cadillac at 12:45\nCouldn't have been a better experience", "pics": null, "resp": {"time": 1588278419005, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113434134823229630249", "name": "Carrie", "time": 1562467569224, "rating": 5.0, "text": "After many many bad experiences with other dealerships I saw an add on marketplace for a Chevy Traverse which was actually just what I was looking for . I sent a message and had a reply with an application link within minutes. After filling out the app I got a call within maybe 30 min and we were on our way . When we got there we were greeted with a smile and after about an hour of paperwork we were leaving with our new car so hassle free friendly no nonsense service and I will come back to these guys anytime I need a car", "pics": null, "resp": {"time": 1562653592959, "text": "Thank you so much for this lovely review, Carrie! We feel so grateful that you chose to come to our dealership. Until next time, have a great day!\n\nKind regards,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106301629834463389532", "name": "Dame Tait", "time": 1555487886377, "rating": 5.0, "text": "I bought an immaculate 2003 Cadillac deville. The pictures online didn’t do it justice. Came up, saw the car, and before I even walked in Allen Jones was outside waiting on me and asked if that the one I wanted. “Yes”. He got the keys for a test drive and the rest is history. The car details and service are excellent and deserving of all high rating.", "pics": null, "resp": {"time": 1555536473722, "text": "We appreciate you for letting others know about your experience! If you ever need anything in the future, please don't hesitate to let us know. Take care!\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112140527807004736833", "name": "Lou Lartigue Sr.", "time": 1578828927054, "rating": 5.0, "text": "Buying experience was outstanding.  Simple, informative and quick.  I am a Joe Bullard buyer for life.", "pics": null, "resp": {"time": 1578835784994, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100517293424622538507", "name": "Ron Martin", "time": 1560515340615, "rating": 5.0, "text": "My experience at Joe Bullard Cadillac was excellent at the least. I was greeted with professional and courteous service. They went above and beyond any other dealerships I have previously felt with and have earned a customer for life.", "pics": null, "resp": {"time": 1560527261225, "text": "Hi Ron! Thank you for writing this fantastic review and giving our dealership such an excellent star rating! It's great to hear we were able to go above and beyond your expectations and provide you with a memorable experience. Feel free to call or stop by if there's anything else we can do for you.\n\nBest regards,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113136361883642871616", "name": "Matthew Sayers", "time": 1582732603175, "rating": 5.0, "text": "Troy and the team at Joe bullard Cadillac helped us put a 16 year old in a safe reliable suv.  They made sure we found the right suv! not just any suv.   highly recommend them for any type of automobile shopping!", "pics": null, "resp": {"time": 1582738777117, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116909759345517776861", "name": "Wanda Presley", "time": 1566246414887, "rating": 5.0, "text": "I had a wonderful experience with Joe Bullard Cadilac. They were wonderful to deal with and deliver what they promise.  Troy Andrews is an awesome salesman and very knowledgeable.", "pics": null, "resp": {"time": 1566257315699, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115336834683639388723", "name": "Kimberly Lovett", "time": 1574820227349, "rating": 5.0, "text": "Thank you so much \"AJ\" Allen Jones and Roosevelt Harris for the patience, compassion, and respect that you gave to my mother as she prepared to purchase yet another Cadillac. I am very appreciative!!!", "pics": null, "resp": {"time": 1574829331055, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101761510839116423510", "name": "L Prince", "time": 1401890841808, "rating": 5.0, "text": "Excellent Customer Service\n\nThe options/color, etc. on a car we wanted was not currently at the dealership.  They were able to locate one and deliver it in a timely manner.  Roosevelt went through a great deal to get us what we wanted and was very happy to do so.  We are very appreciative that both Andrew and Roosevelt were helpful, professional and took the time to get us what we wanted.  We definitely would recommend them and this dealership.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103716413105227163137", "name": "Bridget Havard", "time": 1553690059991, "rating": 4.0, "text": "Laniey did a great job taking care of me when I arrived to pick up my cargo net that my boyfriend ordered me. She had a service tech install it and show me how to install it and take it down. She even had my car washed . I really appreciated her attention to customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116648953615857688261", "name": "jeffery chaisson", "time": 1571238030944, "rating": 5.0, "text": "Recently Found a vehicle that i wanted and had a chance to make a great deal with Mustafa Elastal. Everyone at this dealership was very helpful on all professional levels and made it worth being a Cadillac owner. 7 stars*", "pics": null, "resp": {"time": 1571258523876, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112003643220063608962", "name": "Robert Werning", "time": 1399602548762, "rating": 5.0, "text": "Review of Joe Bullard dealership\n\nMy used car purchase was probably a little different than most.  In my case, I needed a good, reliable vehicle as quickly as possible and would immediately be making a 12 hour road trip to a different state as soon as the car was in my possession!  My salesman Curtis Williams showed me what I wanted to see, took the time to answer my questions, and gave me the time to decide if the car was right for me - no \"pressure to buy\" involved.\n\nCurtis actually delivered the car personally the next day, so that I did not have make another 2 hour trip from Pensacola to Mobile and back to pick up the car!\nOverall I would say that I am very satisfied with the service I received at this dealership.  If all their employees are as conscientious as the ones that I dealt with I would not hesitate to recommend this dealer.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110067935596966338228", "name": "Katherine Goree", "time": 1378303447810, "rating": 5.0, "text": "Allen, my salesman was excellent. He treated me like we were best friends. Very polite and considerate and professional. He went way out of his way, even offered to deliver the car and paperwork to my office so it would not cut into my lunch time. I am 43, and I have never in my life dealt with such a wonderful member of any sales staff. He is the reason I will only purchase vehicles from this dealership. He has my business forever.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108974393276718444307", "name": "Robby Owen", "time": 1537576674022, "rating": 5.0, "text": "I purchased a Jeep Grand Cherokee back in June, I will say this is the most professional dealership I have ever dealt with.The entire staff was so friendly, helpful, and very knowledgeable about the vehicle we were looking at. Our salesman, Troy Andrews was top notch, as well as the general manager, Robby. I will definitely be doing business with them again.", "pics": null, "resp": {"time": 1537893595609, "text": "Robby, thanks for the great review! Please come visit us if you need anything else, be it service or sales.\n\nBest,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115693803456068571923", "name": "Shirley Manning", "time": 1564951517077, "rating": 5.0, "text": "We just got our XT4 and are very satisfied with it. Our salesman. Troy was very kind to answer our questions and made sure we understood how things worked.  We were in a time crunch and he assured us that we could come by, call, email or text if we had more questions.\nRespect and kindness are almost a lost value in todays society, but to us they are still important, Troy exemplifies these and more in how he serves his customers,\nWe were  surprised to hear Christian music playing and to hear the testimonies of several of the staff. We thank them for their standing up for the American values and showing that they are truly a family doing business in an honorable way.\nTroy, we have put you and your new Bride on our pray list and thank you for not making fun of us older folks that haven't embraced \" this tech -infested\" world  fully yet.\nWe will see you this coming week with more ? and to drop off the keys.", "pics": null, "resp": {"time": 1565011735173, "text": "Hi Shirley. Thank you so much for taking the time to give us this great feedback about your sales experience with Troy! We're so happy that you love your new XT4. We really appreciate you choosing to do business with us and hope that you'll continue to let us know how we may be of service."}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101478375121575044847", "name": "Debra Buie", "time": 1568080283601, "rating": 5.0, "text": "Mr. Mustafa was very supportive, friendly, and genuine. I enjoyed working with him. He delivered my auto to me at home.", "pics": null, "resp": {"time": 1568089509083, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109775773943473910035", "name": "Willie Johnson", "time": 1367867211511, "rating": 4.0, "text": "I have purchase many vehicle and I must say that this was one of the most pleasant experiences I have encountered buying a vehicle.  From my internet inquiry I get a phone call from Ms. Ashley Allen, a very pleasant experience.  Ms. Allen set up an appointment for me to see the vehicle I was inquiring about with Mr. Ben Jackson.  From the moment I entered the doors I was greeted and treated as a lifelong customer.  After meeting with Mr. Jackson I was introduce to Mr. Curtis Williams who would be my salesman.\n\nMr. Williams and I sat down to discuss what I was looking for in the vehicle of my my choice.  Once I had selected the vehicle, Mr. Williams made the test drive a pleasant and unique experience.  After I decided that this was the vehicle that i wanted, he even saw to it that the reasonable minor imperfections that I nit-picked while looking over the vehicle were taken care of prior to my picking up the vehicle.  Negotiating the final price was even an enjoyable experience, which is rare.  I think that at the end of the day we were both happy with the price.  At no time during the experience did I feel pressured or uneasy.\n\nI will highly recommend to anyone that is looking to purchase a new or used vehicle, visit Joe Bullock Cadillac and ask for Mr. Curtis Williams.\n\nWillie Johnson", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117781441232126944313", "name": "John Shearhart", "time": 1420479822954, "rating": 5.0, "text": "We shopped online for a good while and Joe Bullard had the best prices for vehicles with a third row. Our salesman was Doug, and he made us feel like he wanted our business without seeming too pushy. The vehicle was sold at a good price and was in great, clean condition. Roosevelt secured fantastic financing, and took his time answering all our questions. They even let us use another  vehicle to return our rental while our vehicle was being cleaned. Overall we have no complaints and hope to do business again!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113204918371446175436", "name": "Elizabeth Stone", "time": 1561763167072, "rating": 5.0, "text": "Knowledgeable. Friendly. Helpful. I had an all around wonderful car-buying experience, especially because of “Moose” and Troy.", "pics": null, "resp": {"time": 1562105694136, "text": "Thank you so much for the wonderful compliments! We couldn't be more pleased to hear ourselves described as helpful, friendly, and knowledgeable. Also, it’s great to hear Moose and Troy made your car buying a wonderful experience. We look forward to working with you again.\n\nBest,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113409004894454225953", "name": "Gregory McDaniel", "time": 1552437509694, "rating": 5.0, "text": "This was my 2nd experience at Joe Bullard Cadillac, same team (Troy and Roosevelt), same outcome. What an awesome experience. My salesman, Troy Anderson, was excellent. Finance department was well presented by Roosevelt Harris. This was an excellent experience and these were kind, personable people. They treated us like we were family, again..\n\nOver the years, I have purchased several automobiles from Joe Bullard Automotive. The faces, at times, have changed.. But one thing has always stayed constant, the excellent treatment.\n\nThank you!!!", "pics": null, "resp": {"time": 1552693913569, "text": "Gregory, we can’t thank you enough for writing this awesome review for our dealership! It's always a pleasure to help you, and we look forward to doing so again.\n\nBest regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110897382572329750124", "name": "Anna Hall", "time": 1548550543089, "rating": 5.0, "text": "Recently purchased a Ford Edge.  Troy and Mike went far above expectation to make sure I was satisfied.  They were very friendly and easy to talk with.  Great customer service!", "pics": null, "resp": {"time": 1549311265687, "text": "Thank you for your feedback. We are happy to hear that Troy and Mike went far above your expectation to make sure you are satisfied. If there’s anything else you need, please don’t hesitate to reach out.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106445245087372362868", "name": "J Wells", "time": 1569530681896, "rating": 4.0, "text": "Bought a used CTS from these guys and I must say my sales person Troy Andrews was awesome! I will recommend him to anyone, even after purchasing the car he is still just a text away. Now for service I have to recommend Haley! She is very helpful and will go out of her way to help you!", "pics": null, "resp": {"time": 1536612009638, "text": "Congratulations on your new CTS! I do apologize for the initial difficulties you experienced with your new vehicle but I'm glad to hear that things are being smoothed over. It is imperative to us that we make the car-buying experience painless and efficient from the initial negotiations to the final paperwork and even service afterward. Please let us know if there is anything else about your purchase that you'd like to discuss.\n\nTake Care,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117110560130267551238", "name": "Red McWilliams", "time": 1560796049744, "rating": 5.0, "text": "Purchasing a vehicle had never been easier. Allen \"AJ\" Jones was my salesperson and is the absolute best at what he does. Ask for him by name, you won't be disappointed! He explained every process as we walked through it and he explained the vehicle in detail, explaining how things worked, the functions, etc. Overall, it was the best car buying experience I have ever had. Thanks to Joe Bullard Cadillac and especially to AJ Jones!", "pics": null, "resp": {"time": 1560872845229, "text": "Thank you for this great review, Red! AJ is truly an exceptional employee and we appreciate him for giving you a great experience. Take care and have a great day!\n\nKind regards,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117577856186680007923", "name": "b16jareds", "time": 1532216039059, "rating": 5.0, "text": "I was very impressed with my visit to Joe Bullard Cadillac. They have great customer service and very friendly people. They have a very nice comfortable waiting area while I was getting my Cadillac serviced and they even washed my car for me after service. Thanks for treating me so great...Jared", "pics": null, "resp": {"time": 1532451008709, "text": "Thank you for the great review. Please come visit us if you need anything else, be it service or sales.\n\nBest,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117392995477955633844", "name": "Jennifer Foster", "time": 1529354773235, "rating": 5.0, "text": "My experience at the dealership was awesome I drove from Baton Rouge, LA to purchase the car I wanted. Process wasn’t long everything was ready for me Simmie was great he took me on my test drive and made sure my car was clean before I left. He also set up all my features for me. Everyone had such great hospitality. When I purchase again in the near future it will be at Joe Bullard Cadillac 😉", "pics": null, "resp": {"time": 1529430893783, "text": "Jennifer, thank you for taking the time and driving from Baton Rouge to see Simmie and the Joe Bullard Cadillac team. We appreciate the kind and sincere comments as well as the recommendations. We will be there for you for many years to come. Enjoy your new vehicle.\n\nBest,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101491622135527518213", "name": "Cassie Vanecek", "time": 1443020144718, "rating": 5.0, "text": "We Loved our experience with Joe Bullard. Doug and Richard went above and beyond to meet our needs and ensure we left with the vehicle we desired. I will sing their praises on and on, and WILL be a return customer. Doug was the kindest, most down o business and understanding sales man I have ever dealt with. We truly appreciate the hospitality and service we received with them. If you are looking for a new or pre-owned vehicle look no further, go NOW.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100541833983509424028", "name": "Ryan Fountain", "time": 1412020582780, "rating": 5.0, "text": "I spent an enormous amount of time researching and visiting different dealerships before purchasing.  I knew from the beginning that I wanted a Cadillac, but I felt like I needed to check out different vehicle brands before making my final decision.  Joe Bullard Cadillac was the last dealership that I visited on my list and it should have been the first.  They offered everything that I was looking for and then some.  Roosevelt Harris and Curtis Williams went above and beyond to assist me with everything that I needed.  They were friendly and down to earth and made my husband and I feel very comfortable with our buying experience.  When we left the dealership my husband told me that out of all the vehicle purchases that we have made throughout the years, the overall experience with Joe Bullard Cadillac, Roosevelt, and Curtis was by far the best and we will never purchase anywhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100561274803004624002", "name": "Marsha Hollis", "time": 1557325869159, "rating": 5.0, "text": "My purchase of a Cadillac was a pleasant and friendly experience. The salesman Allen Jones was very helpful and made the whole experience easy. Thank You, I am enjoying my XT5", "pics": null, "resp": {"time": 1557857216809, "text": "Marsha, thank you for leaving us this great review! We are very happy to hear that we could be so helpful during your recent visit with us.  We look forward to seeing you back again in the future. Have fun in your XT5!\n\nKind regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110112925466436648952", "name": "Mike Chapman", "time": 1565240771444, "rating": 5.0, "text": "Our experience with Joe Bullard Cadillac dealership was without a doubt the most memorable we have ever had - from the moment we pulled into the parking lot until the deal was signed.\nTroy, our salesman, was outstanding!  He was extremely knowledgeable and very professional.  The other personnel (Alex, Dan, Jason, Roosevelt) that we came into contact with was absolutely top-notched.  Everyone went out of their way to make us feel comfortable and at ease.\nWe actually came into the dealership looking for a good service department for our 2017 Cadillac Escalade, but when all was said and done we had purchased a 2019 Cadillac Escalade ESV.\nBecause of our experience with the Joe Bullard Cadillac dealership we will be \"Returning\" customers for both service and any future purchases.  We feel as though we have made a real connection and established long-lasting friendships.", "pics": null, "resp": {"time": 1565279982115, "text": "Hi Mike, Thank you so much for taking the time to give us the rating and awesome feedback about your  purchase. We do our very best to make sure our guests feel like family and give them the best experience possible. We're sure you're going to love every minute of your new Escalade! Thanks for choosing Joe Bullard Cadillac and we hope you'll keep in touch."}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100997442203693170753", "name": "Elizabeth Swindall", "time": 1554735128320, "rating": 5.0, "text": "I always have a pleasant experience at Joe Bullard. Christian takes customer service seriously and makes my time at the service department efficient. Joe Bullard and Christian are the best!", "pics": null, "resp": {"time": 1555535651620, "text": "Thank you so much, Elizabeth! It was truly a pleasure to have you as a customer, so we’re happy to know that the feelings are mutual. Please feel free to give us a call if you need anything else in the future.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106486160209581706605", "name": "Cara Creates", "time": 1579017242799, "rating": 5.0, "text": "Wonderful experience with this dealership!  Make sure you ask for Michael Sewell.", "pics": null, "resp": {"time": 1579023357080, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106201759300794228385", "name": "C Gaye", "time": 1553711188630, "rating": 5.0, "text": "Courtney was amazing. The ease of doing business was great. It was the happiest car buying experience of my life.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113020670272460119013", "name": "Oliver Walley", "time": 1366843857053, "rating": 5.0, "text": "My experience purchasing a used car from Joe Bullard Cadillac was the best experience I ever had purchasing a vehicle. This was the first time I left a car lot, after buying, without feeling like I was pressured. The salesman was calm, collected, and patient. The whole environment, from the first time I pulled on the lot to look until I drove off in the purchased vehicle,  was completely hassle-free. I would recommend anyone to this dealership and I look forward to doing more business with them in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102032166553240249212", "name": "Whitney Briones", "time": 1531882479809, "rating": 5.0, "text": "These guys made my car buying experience fun. Josh took a lot of time to make sure that all of my needs were met for my Circus of a family! I would definitely recommend.", "pics": null, "resp": {"time": 1532450898155, "text": "Thank you so much for giving us an opportunity to work with you and your family! We look forward to helping you with any and all of your future automotive needs! Be sure tell all your other friends and relatives about your experience!\n\nTake Care,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113680088118608298642", "name": "Abed “Bobby” Qureshi", "time": 1553876598261, "rating": 5.0, "text": "They are a awesome dealership with great personal attention to details. Halley was excellent and on top of thing. Love this dealership. Thx.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106582295579462419588", "name": "Shannon Smith", "time": 1551994067597, "rating": 5.0, "text": "I unexpectedly had to purchase a new car and was not looking forward to it. However, I corresponded with Jourden a week prior to my visit to the dealership. Upon arrival I was greeted by Simmie who from that point on took great care of me. It was a pleasure dealing with this dealership based on the assistance of these two along with Mr. Roosevelt. It was definitely worth the trip to Alabama and will recommend this dealership to others.", "pics": null, "resp": {"time": 1552693889096, "text": "Shannon, thank you so much for taking the time to share your feedback with us!  We work hard to make sure our guests have an awesome experience. We will share your comments with our team and we look forward to working with you again down the road.\n\nBest regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108115301109756582631", "name": "Sarah Gill", "time": 1565138471524, "rating": 5.0, "text": "I have never purchased a luxury vehicle until I went to Joe Bullard. My salesman Troy Andrew's was very knowledgeable about the SRX I was interested in. I could not have asked for better service from the whole team at Joe Bullard. Thank you Troy and the rest of the team for making me feel special while purchasing my new Cadillac SRX.", "pics": null, "resp": {"time": 1565190586916, "text": "Hi Sarah, We're so glad to hear that Troy took such great care of you during your visit. Thank you for choosing to do business with Joe Bullard Cadillac and we just know you're going to love every minute of your new SRX. Please keep in touch and let us know how we can continue to be of service in the future!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106498795136219561352", "name": "Tom Cadorette", "time": 1399215901750, "rating": 5.0, "text": "Scott Howie & Jon McCartney\n\nScott was extremely professional, knowledgeable, and courteous. We explained exactly what we wanted and he was able to find it for us in a minimal amount of time. He did not pressure us into purchasing something similar to what we wanted but took the steps necessary to get us exactly what we wanted. We've dealt with Scott many times in the past and have always been pleased with our results.\n\nJon took the time to explain everything about our financing and payments. Although we were hesitant about purchasing the warranty he explained all the pro's and con's about warranties. He did not pressure us into purchasing the warranty but after our conversation we felt it was best to purchase it. He is very professional and friendly. Plus, he has a good \"cents\" of humor.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115090702997648592023", "name": "Gary Askew", "time": 1390587431544, "rating": 5.0, "text": "I give the above ratings because the customer service was outstanding.  Darren Robinson was outstanding, he went above and  beyond to ensure I was well taken care in my purchasing of my now well appreciated truck.  I didn't have to wait a long time to purchase my Truck.  After that well appreciated experience, I will certainly recommend my friends to purchase from Joe Bullard, keep up the outstanding work.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103747124840501769804", "name": "Lisa Fisher", "time": 1559046249527, "rating": 5.0, "text": "I have nothing but wonderful things to say about my recent purchase of my Cadillac XT5 with Joe Bullard Cadillac. AJ \"Allen\" Jones was the best salesman and made everything about buying this vehicle wonderful. The staff and deal that they gave me were all top notch!!", "pics": null, "resp": {"time": 1559078436132, "text": "Thank you for the five-star rating and kind words, Lisa! Please keep us in mind if we can assist you with anything else, be it in service or sales. Until next time, take care! Kevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114364334919408909844", "name": "Bragg Van Antwerp", "time": 1402409413183, "rating": 5.0, "text": "Kevin Busby at Joe Bullard Cadillac's Service Department is, without question, the best service advisor I've ever encountered. He is unfailingly friendly, professional and accommodating, he never fails to make me feel welcome when I arrive, and he always makes me feel like a valued customer. While I have only dealt with Kevin at Joe Bullard Cadillac's Service Department, if he is indicative of the others who work in the Bullard Service Department, there is nowhere I would ever go again for service. Truly a pleasant experience from start to finish -- every time.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117774675228965940426", "name": "LaTonya Lindsey", "time": 1530653558727, "rating": 5.0, "text": "We are thoroughly satisfied with our experience at Joe Bullard from beginning to end. Their customer service was impeccable. We felt like we were family. Damos was very efficient and polite. We plan to continue our business with them and also refer our family and friends. Thanks again!", "pics": null, "resp": {"time": 1530654757196, "text": "Thank you for such great feedback Ms. Lindsey! Please let us know how we can be of service in the future and enjoy your new car!\n\nKindest regards,\nKristina M.\nMarketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105380616065627321125", "name": "Todd Ware", "time": 1583714050059, "rating": 5.0, "text": "My dealings with Joe Bullard Cadillac was very good. their staff was very friendly and professional", "pics": null, "resp": {"time": 1583721633816, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111003768558414373417", "name": "Denise Peele", "time": 1339935948050, "rating": 5.0, "text": "Allen Williams is a friendly and professional sales consultant. Allen demonstrated all of the GMC Yukon features and answered all of our questions. We felt like we received an excellent price for our trade and our new car. We will use Allen again and will recommend him to all of our friends and family. Joe Bullard Cadillac is a great dealership, everyone their was very friendly and helpful.  They made the car buying experience fast and easy.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111212048848258455517", "name": "Mark Pawlowski", "time": 1575409803537, "rating": 5.0, "text": "Troy Andrews went far and beyond what I've seen other dealers do.\nJoe Bullard Cadillac is the place to buy your car - see Troy!!", "pics": null, "resp": {"time": 1575412519502, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110347369618535355338", "name": "Cha Kee", "time": 1439248994819, "rating": 5.0, "text": "I am happy to write about my experience at Joe Bullard Cadillac.  As a first time Cadillac owner, I could not be more happy with my purchase as well as my sales consultant, Doug Klezmer.  The laid back no pressure to buy environment is what I love most.  My sales consultant was very knowledgeable on the Cadillac and all the great features it has to offer.  Because this car has a lot of advance technology, my sales consultant went over every single feature to ensure I know how it operates.  Additionally, he made himself available to me should I have questions or concerns once leaving the dealership or in the days to follow.   Without hesitation, I recommend this dealership and more importantly this sales consultant if you are in the market for a new vehicle.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "118080749264735330936", "name": "Lauracw", "time": 1531950771254, "rating": 5.0, "text": "Simmie went above and beyond service. He was very attentive and patient in helping us find the right car for our family. He made sure the car we purchased was mechanically sound before we drove home even took care of things they found after the sale.\nThank you Joe Bullard Cadillac", "pics": null, "resp": {"time": 1532450935034, "text": "Laura, thank you for writing this fantastic review and giving our dealership such an excellent star rating! It's great to hear we were able to go above and beyond your expectations and provide you with a memorable experience. Feel free to call or stop by if there's anything else we can do for you.\n\nBest,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101089271717876153935", "name": "Ola Houston", "time": 1507983090744, "rating": 5.0, "text": "Everyone from the young lady who wrote up the service request  to the return of my car was extremely nice. Christian is the best for knowing what service my car needs. My 2010 SRX drives and sounds like a dream. The detail guys really do an awesome job with any service work performed.", "pics": null, "resp": {"time": 1507986729419, "text": "Thank you for such great feedback! We’ll be sure to share these kind comments with Christian and the service staff. We’re happy to serve and so pleased you’re still loving your SRX!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109534151471054560778", "name": "Daniel Porcelli", "time": 1558479122726, "rating": 5.0, "text": "Easiest and least stressful car buying experience I've had.  The salesman AJ was respectful and laid back.  No pressure whatsoever.  AJ, thanks for taking the time to explain to me all of the functions of the CUE system.", "pics": null, "resp": {"time": 1559078407884, "text": "Thank you for taking the time to write this review. We are pleased to hear that AJ was able to provide an efficient and overall positive experience. Regards, Kevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110986432063556852342", "name": "Lamenda Hase", "time": 1556664793455, "rating": 5.0, "text": "Salesman Michael was a very thorough salesman. He has great charisma and really makes the customer know that they are respected at Joe Bullard Cadillac.", "pics": null, "resp": {"time": 1557234133312, "text": "Thank you for sharing your feedback, Lamenda. We believe in attentive and professional customer service and I'm glad that Michael made such a great impression on you.\n\nKind regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112575028089693023518", "name": "Sonja Hollomon", "time": 1549051875046, "rating": 5.0, "text": "Troy delivered our vehicle and took the time to explain all paperwork along with teaching us how to set up and use the technology.  Outstanding service!", "pics": null, "resp": {"time": 1549399485917, "text": "Sonja, thank you and congratulations on your purchase! We are so pleased that we could make your experience easy and hassle free, and we believe that's how every car buying experience should be. We are sincerely grateful for your business!\n\nKind regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117022073857240030755", "name": "Gloria Peacock", "time": 1476542525971, "rating": 5.0, "text": "The customer service at Joe Bullard Cadillac will exceed your expectations in ways that car dealerships usually don't. I found the vehicle I really wanted (on their website) and Tundy, Roosevelt, & Kenneth made it happen for me. And then had the car delivered (for $600 as we discovered later) by the nicest guys in the world. There's a reason Joe Bullard Cadillac has so many excellent reviews: They've earned them by being the absolute best. And I couldn't possibly be happier with my vehicle.", "pics": null, "resp": {"time": 1475550815694, "text": "Thanks so much for the excellent review! We set high expectations for ourselves, and the fact that we exceeded yours can only mean we are approaching that goal. Please come back to see us if you need anything at all.\n\nAll the best,\nJoe Bullard Cadillac Team"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102558323475005056627", "name": "Paula A Chavers", "time": 1560282756220, "rating": 5.0, "text": "I had a great experience buying my dream car from Mr. Jay Carter, who provided an excellent customer service. I highly recommend this place and Mr. Carter for future buyers.", "pics": null, "resp": {"time": 1560464355367, "text": "Thank you so much for taking time out of your day to share your experience with everyone. We believe in attentive and professional customer service and we're glad that our team made such a great impression on you.\n\nRegards,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103172178335975947450", "name": "Eugene Haynes", "time": 1584379098393, "rating": 1.0, "text": "Our recent purchase of a 2019 XT5 went very well. It was a pleasure working with Mr Alan Jones.", "pics": null, "resp": {"time": 1584461693434, "text": "Hello Mr. Haynes,\n\nSo glad to hear that your recent purchase experience at our dealership with Alan was a pleasant one. If there was anything else we could have done to make this a 5-star rating as opposed to 1-star please let us know. We value customer feedback and want to use this an opportunity to make any improvements we can.\n\nKindest regards,\nKristina M.\nMarketing and PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110669572124824700842", "name": "thomas mitchell", "time": 1555458338622, "rating": 5.0, "text": "Dealing with the people here are the nicest sales force you will ever meet hands down . Sim pettway is an awesome person really cares about you when you have a concern he will get it done !!!", "pics": null, "resp": {"time": 1555536443016, "text": "Thank you for this amazing review, Thomas! We really appreciate your business.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108269690245481489077", "name": "Matt Holloway", "time": 1550253215689, "rating": 1.0, "text": "Terrible! I came in because I had a tail light out and it's one of the newer LED lights that aren't supposed to burn out. They told me to come in at 3 and I would be out by 4. At 4 they had just finished their diagnostic check and they told me it would cost $607 to replace my tail light. I told them to go ahead even though I believed it was too pricey. The rep told me the light costs $500+ and the labor wasnt that much. I started to look up the part online brand new and I could buy 2 for less than what he quoted me. I told him they could stop and I'll bring in the light myself after buying it cheaper elsewhere. He tells me I will still have to pay $135 for the diagnostic. No problem. He comes back and tells me it's already in. I ask well where is my car? He says they're finishing up. 45 minutes later he comes back and tells me that they put a new light in and it didnt work. Must be a wiring issue he said. So I said: \"So that $135 diagnostic u tried to charge me for wasn't even accurate? Because the diagnostic claimed I needed a new light.\" He never did answer. They did change my oil so I paid for my oil change only and went to leave. When I got my car back if was filthy even though they claimed all customers get a complimentary wash with all services. I will never go there again.", "pics": null, "resp": {"time": 1550256836529, "text": "Hi Matt,\n\nThank you for providing us with this valuable feedback. I assure you this is not the Bullard experience we want for our clients.\n\nI have forwarded your comments to the Service Manager, Sean Alexander, as well as the General Manager so that this can be addressed. I’ve also asked for one of them\nto contact you to personally discuss in more detail.\n\nI’m sincerely sorry for how your visit with us needed and I hope that we will be able to earn back your business.\n\nKindest regards,\nKristina M."}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109488133938550750423", "name": "Julie A", "time": 1546288122562, "rating": 5.0, "text": "Our family was on vacation in Mobile Alabama this past week. Things didn't go quite as we had planned. Our SUV was cutting out pretty bad on the highway. It was getting worse the closer we got to Mobile. I contacted my friend who's daughter lives in Mobile to see if she might know of a service place. I talked with her daughter and she informed me that her husband, Kyle, worked for Joe Bullard Cadillac. She gave me the number for the service department and said to speak with Haley.  About this time the check engine light came on in our vehicle. It was flashing on and off, then would stay lit.\nWhen I spoke with Haley in the service department she asked about the service engine light. When I told her it had been flashing intermittently she was immediately concerned and said we should get stopped as quickly as we could to avoid internal engine damage.  She then helped us get started with finding a tow service. We were 50 miles aWay and had four people so their usual towing service couldn't do it, but she got the ball rolling for us. She gave me her direct phone number so I could call if I needed anything.\nOnce we got to the dealership Kyle helped us get a loaner car while ours was being repaired. Haley kept us informed as they learned what was wrong. Our technician, Mike, came in on Saturday to work on our vehicle because we needed to leave to head back to Missouri on Sunday.\nTo make a long story short...God used all of these people to help us during a difficult time. They made this experience so much less stressful than it could've been. THEY WENT ABOVE AND BEYOND TO HELP US! And, they did it all with a smile. We appreciate the dealership and all the individuals who helped get us back on the road. I would recommend them to anyone who needs service or a new ride!!!", "pics": null, "resp": {"time": 1549399391504, "text": "Thank you for your wonderful feedback. We always strive to meet the needs of our customers no matter the situation. Feel free to let us know if you have any concerns about your vehicle.\n\nKind regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103152112090660647041", "name": "Rickey Crenshaw", "time": 1478650130327, "rating": 5.0, "text": "Great dealership, everybody from the salesman and to financial salesman was very nice and informative. Provided great information about the cars and helped with my selection a lot. Further more, the whole staff at Joe Bullard was very nice also, definitely will go back here whenever I would like to purchase a vehicle in the future.", "pics": null, "resp": {"time": 1478849462446, "text": "Rickey, thank you for the feedback! We are happy to hear of your positive experience at Joe Bullard Cadillac, and we are grateful for choosing us for your automotive needs. We look forward to serving you again in the future!\n\nWarm regards,\nJoe Bullard Cadillac Team"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113687222326552714604", "name": "Dave inDestin", "time": 1505882734206, "rating": 5.0, "text": "I trust the Joe Bullard family of auto dealers.  And that is due to the Bullard reputation and business ethics.  I had a prior experience with Damos Brand my salesman and knew I would be treated honestly and fairly by him in the buying process.  Highly recommend !!", "pics": null, "resp": {"time": 1505148055073, "text": "Hello Dave,\n\nThank you so much for taking the time to share with us about your experience with our dealership! We always welcome feedback from our clients and are delighted when we can pass along the praise to our team. I'll be sure to send a copy of this to Damos!\n\nSincerely,\nKristina M., Marketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103088759466824085111", "name": "John Nix", "time": 1572630315397, "rating": 5.0, "text": "Rodney was very friendly and made the car buying experience very easy.", "pics": null, "resp": {"time": 1572626138142, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104005216497469751542", "name": "Donna Gates", "time": 1542723517048, "rating": 5.0, "text": "Everyone there has gone above and beyond to make sure that I am happy with my XT5 purchase.  I would recommend Joe Bullard to anyone.  Thanks!", "pics": null, "resp": {"time": 1543867738992, "text": "Thank you for writing this fantastic review and giving our dealership such an excellent star rating! It's great to hear we were able to go above and beyond your expectations and provide you with a memorable experience. Feel free to call or stop by if there's anything else we can do for you.\n\nBest.\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104050205826076250572", "name": "Jerry Silverstein", "time": 1562176355454, "rating": 5.0, "text": "Everyone was very accommodating. No high pressure. “Moose” and Keith were a pleasure to work with.", "pics": null, "resp": {"time": 1562653163356, "text": "Thank you so much for this lovely review, Jerry! It was a pleasure to assist you and please let us know when we can do so again!\n\nKind regards,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111955474400578666336", "name": "Ericka Middleton", "time": 1382277996361, "rating": 5.0, "text": "Darren was a very friendly and knowledgeable sales person.  He was very attentive to our needs and was a pleasure to work with.  Jon worked hard to get us a great deal with our vehicle financing and was also very friendly and knowledgeable.  We truly enjoyed our experience at Joe Bullard and will recommend this dealership to all our friends, family and co-workers.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111965646885628172694", "name": "Madison Lumpkin", "time": 1527642836257, "rating": 5.0, "text": "My husband & I had ONE day, due to his work schedule, to find a reliable work car for him that was great on gas mileage and did not have too many miles.. but ofcourse stayed in a decent price range because, again, it was going to be a “work” car. We walked in with one car in mind that we found online, but left with a totally different one! Thank you to Joe Bullard & staff (especially Simmie who helped us) for making it a great experience buying our “first vehicle” as a married couple! I hope to be back soon when I convince my husband to let me extend the size of my SUV!!! ;)", "pics": null, "resp": {"time": 1527781080942, "text": "Thank you for reaching out, Madison! Reviews like these mean the world to us here at our dealership and I will be sure to relay to Simmie and the rest of the team. Congratulations on your first \"Husband and Wife\" vehicle! We look for to working with you both when it's time to get you into a new SUV! Take care and have a great day.\n\nSincerely,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111339401141126386981", "name": "Gil Dukes", "time": 1461418373727, "rating": 5.0, "text": "I bought a 2008 Tahoe used from Joe Bullard Cadillac. It had only 63,000 miles on it when purchased. I have now had it almost 2 years and it has just hit 207,000. I have solely had it serviced here, and couldn't be more happy with their service. Today I didn't even have an appointment, and the service staff knows how much I drive, and they put my truck FIRST in line for the ASAP oil change! Best staff and atmosphere you can find.", "pics": null, "resp": {"time": 1461600937173, "text": "Thank you for your great review! We're thrilled to hear how much you appreciate our top-level service at Joe Bullard Cadillac. Our entire team is committed to providing the highest quality of service for you and your vehicle. We can't wait to see you and your Tahoe again - we're always here to help!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105695635058287041075", "name": "Phyllis Mashburn", "time": 1566099423871, "rating": 5.0, "text": "I just purchased my second Cadillac it is a XT 5 I love it I love Joe Bullard, AJ sold the car to me and he was awesome.  He was very patient with me and he showed just how to use the car. Thank you AJ.", "pics": null, "resp": {"time": 1566145690889, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101590158550256781522", "name": "Jose Ulloa", "time": 1560726146501, "rating": 2.0, "text": "Very bad customer service and experience with them. I had to many verbal agreements with them and they failed to keep their word.\nI bought a used 2015 Ford mustang cash, about a month ago they gave me the run around of delivering the car, they said one day then another day until I had to go get the car myself over 180 miles away. I had other issues also that I dont want to write on here. I wouldn't go back there again.\nCadillac after my review resolved a problem i had, that Joe Bullard didn't, I'm glad someone cares about their costumers.", "pics": null, "resp": {"time": 1560369775602, "text": "Hi Jose,\n\nI'm terribly sorry. I've looked in our system and cannot find your name in our records. I'd love to get more details to send to the General Manager of the store for him to look further into these issues. If you wouldn't mind sending your contact information and or any additional details to info@joebullard.com I'd be happy give this to him.\n\nKindest regards,\nKristina M.\nMarketing and PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104606618885180169566", "name": "Destiny Mua", "time": 1556551334683, "rating": 5.0, "text": "AJ sold me my Jeep. He was very nice and understanding and worked with me the best of his ability.", "pics": null, "resp": {"time": 1557234034953, "text": "Thank you for sharing your feedback, Destiny. AJ is a fantastic employee and we're thankful for everything he brings to our team. We wish you all the best!\n\nKind regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107583465465141299350", "name": "Karla Hardin", "time": 1527118460497, "rating": 5.0, "text": "My husband and I were so appreciative of the staff at Joe Bullard Cadillac ! We were met by the GM and sales staff who listened thoughtfully to our specific needs. We never felt we were being forced in a direction but rather we felt they used their knowledge and expertise to tailor a “fit” for every area from the car itself to the financing. Special thanks to Damos and Roosevelt! We are confident that our future as part of the JB family is going to be as enjoyable as our purchase of our new car!", "pics": null, "resp": {"time": 1527261059904, "text": "Thank you for the excellent review! It is great to know that Damos and Roosevelt were able to provide you with a pressure-free and knowledgeable service. Please feel free to call or stop by if there is anything else we can do to help you. Welcome to the family! Until next time, happy driving!\n\nBest,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110480042859909939004", "name": "James Smith", "time": 1620682463526, "rating": 5.0, "text": "The recent lease of a XT5 is the 3rd Cadillac I have leased from Joe Bullard in last six years. Richard Borden has been instrumental in all three insuring that I got just what I wanted. I have been completely satisfied with the process in closing the deal on all three cars. A big part of each deal was because of Richard. He is the best. On the current lease, Roosevelt Harris and Damos Brand also were great.", "pics": null, "resp": {"time": 1527089048532, "text": "Thank you so much for this wonderful feedback, James! We're so glad you came back to see us for your new XT5. It's fantastic to know Richard, Roosevelt, and Damos all helped make us worth the trip in! If there's anything else we can help you with in regards to your new vehicle, please let us know. Happy driving!\n\nBest,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102932075210918917556", "name": "Tracy Williams", "time": 1526871747808, "rating": 5.0, "text": "the service I received on 2/1-2/5/18 has restored my faith in this wonderful dealership. Joe Bullard is the best from sales associate to service to the drivers they employ. Respectful and professional.", "pics": null, "resp": {"time": 1517987791662, "text": "Tracy, we are truly dedicated to providing quality customer service in all areas of our dealership. Thank you for taking the time to notice those efforts and for leaving such an awesome review!\n\nBest regards,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110773978360084027907", "name": "Pam B", "time": 1495275232096, "rating": 5.0, "text": "I bought a Cadillac SRX from Joe Bullard in Mobile, Al. This dealership, especially Brandon and Andrew were super nice and helpful. Brandon kept me up to date on the on the schedule of getting my vehicle to me since it was being transferred from out of state. Great Dealership.", "pics": null, "resp": {"time": 1496682904767, "text": "Pam, thank you for the feedback! We are happy to hear of your positive experience at Joe Bullard Cadillac, and we are grateful you chose us for your automotive needs. We look forward to serving you again in the future!  Sincerely, Marc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113854584300579890855", "name": "Denise Cheatham", "time": 1370525334272, "rating": 5.0, "text": "This was the best experience I have EVER had purchasing a vehicle! We went in, after work, on a Friday night. We kept the staff late, which is inconsiderate considering their long days...... Dean and Jon were absolutely wonderful! Thank you for providing your customers with a very friendly and extremely efficient staff!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109609845622183988514", "name": "kim wright", "time": 1553785514796, "rating": 5.0, "text": "I think that between the service Advisor Vicki Bodet and Repair tech Chase I got a good ofunderstanding of why it took longer to replace the signal bulb. good job", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115437517363102898667", "name": "J Nelson", "time": 1553722408617, "rating": 5.0, "text": "we were running late for our appointment because of a crash on Hwy 10 a half our late and we called to let them know and they were very gracious to allow us to come late and they did a great job for us.  we were impressed", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "102156366702710368443", "name": "JOHN PILGER", "time": 1553191668276, "rating": 5.0, "text": "Vicky is awesome!  She always goes above and beyond to make sure we are happy.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104751010513581213027", "name": "Cynthia Blanks", "time": 1554401386415, "rating": 5.0, "text": "Great customer service. Pleased with the maintenance and evaluation on my vehicle...", "pics": null, "resp": {"time": 1555535629153, "text": "Hi Cynthia, and thank you for this great review! I'm very happy that our team was here to help you and treated you with the customer service we know you deserve.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104697294731371657295", "name": "Dominique Williams", "time": 1554998273571, "rating": 5.0, "text": "my experience at Joe bullard cadillac has been over the top excellency. customer care is A1", "pics": null, "resp": {"time": 1555535794365, "text": "Thank you for the nice review! It is important our customers feel completely confident with the customer service they received and it made us happy to read your feedback. If there are any other automotive needs we can assist you with, please don't hesitate to call us or stop by.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113403370376402907267", "name": "Jason Salvage", "time": 1560631353709, "rating": 1.0, "text": "I took my Cadillac CTS into the dealership for an issue of my car not cutting off. I called after a day and they still didn’t know what was wrong. I picked it up and took it to another reliable mechanic and he diagnosed it immediately. I won’t use Joe Bullard anymore.", "pics": null, "resp": {"time": 1560632447570, "text": "Hi Jason,\n\nThank you for this honest feedback. I'm passing this along to the Service Manager as well as the General Manager to make sure they are aware. One of them may reach out to you for information so we can address the issue..\n\nI'm sorry we could not take care of this for you but I do hope we'll have the chance to earn your business again sometime in the future.\n\nKindest regards,\nKristina M.\nMarketing and PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113707906531934439107", "name": "Jerry Stewart", "time": 1374609731694, "rating": 5.0, "text": "Curtis (Salesman) was on top of things.  He was eager to help, and knowledgeable when answering our questions.  He was able to ensure our happiness with the purchase of our Cadillac.\n\nRichard (Finance Mgr) made our financial transaction an easy one.  He was clear & precise on explanations of the paperwork.  Mr. Nassar took his time when necessary, but expedited the purchase process efficiently.\n\nThanks to both Curtis Williams & Richard Nassar, we are now enjoying our Cadillac from Joe Bullard Automotive.  Thanks!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114015970475468478129", "name": "D Paolini", "time": 1491378118659, "rating": 5.0, "text": "Joe Bullard has always extended Care, kindness and consideration in both sales and service. The level of quality from his dealership is consistant reliability. This family value continues to gain our trust and is always appreciated and welcome in ours.", "pics": null, "resp": {"time": 1497387647472, "text": "D, thank you for sharing your feedback! It is very important to our dealership that we earn the trust of our guests by following through with our promises and providing a hassle-free service. Best, Marc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "118216088047610323704", "name": "MamaJama71", "time": 1401826398793, "rating": 5.0, "text": "Great experience, very happy!\n\nWe came to the dealership to look for a car for my daughter.  Roosevelt Harris was absolutely the best person I have ever bought a car from, hands down!!  You have a real gem in him as an employee.  Polite, friendly and personable.  A pure please to be around!!!  Jon McCartney helped with my paperwork.  He was beyond a pleasure as well.  I told him I was in a hurry and he was very efficient.  Explained everything very well to me and got my paper work printed up.  I really appreciated how efficient and thorough he was.  He is definitely an asset to your company!\n\nI never felt like they were pushy or anything.  They made me feel welcome.  My teenage daughter thinks Roosevelt is so cool.  He took time with her and answered all her questions.  She said he made her feel important and not just like a kid that didn't matter.  She said when she graduates from college and gets her next car, she's buying it from Mr. Roosevelt, he's like family to her now :)\n\nI hope you can let them know how much we appreciate them and please do something extra special for Roosevelt (my daughter's request).\n\nThanks!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103092852835803872616", "name": "Wayne Howarth", "time": 1555466380811, "rating": 5.0, "text": "I've been a customer of Joe Bullard's since 2014, all sales and service have been exceptional including this sales experience, kudo's to AJ, he was a great help in all questions and issues with the XT5 I am currently purchasing, I have and will recommend your dealership to friends and family, Thanks again, Wayne Howarth", "pics": null, "resp": {"time": 1555536466549, "text": "Wayne, thank you so much for your feedback as well as your loyalty. We appreciate building long term customer relationships and we truly value your business.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103016235642847274331", "name": "wayne coaker", "time": 1356655829343, "rating": 4.0, "text": "Our Salesman Richard Borden was very friendly and helpful in helping us purchase our car, went out of his way on  answering a lot of questions we had in making our decision. We did not feel pressured into buying this car from him in no way. He was very professional in his presentations, on a scale of 1 thru 10 we would give him a 10. We really felt special when the sales manager came in along with Ty Bullard to talk to us and thank us for buying a car from them. We were treated well by everyone involved in our purchase.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114430324259207763915", "name": "Brian Evans", "time": 1574185422997, "rating": 5.0, "text": "I recently purchased a pre-owned vehicle from Joe Bullard Cadillac. Allen Jones was my salesperson and I found him to be friendly, helpful and professional.  Allen answered all of my questions and made the process very easy. I appreciate Allen and the entire Joe Bullard staff’s desire to make sure I was completely satisfied with my purchase.  I am glad I came by to check out their preowned vehicles. I can highly recommend Joe Bullard Cadillac and salesperson Allen Jones to all who would be interested in purchasing a new or used car.\nB. Evans", "pics": null, "resp": {"time": 1574192324501, "text": "We appreciate your positive feedback about your experience. We take pride in serving our customers and hope to see you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109690416700636959562", "name": "clifton prickett", "time": 1554300021576, "rating": 4.0, "text": "I will omit talking about my first visit except to say had Kevin not call me 4 days later, I would have kept an appointment at Petro Cadillac in Pascagoula, Ms.\nMy second visit on May 29th, 2019 resulted in my purchasing a XT4 and everything was totally different. I appreciate the salesman, Sim as well as the business manager Thomas for their help in making tis purchase happen.\nClifton Prickett", "pics": null, "resp": {"time": 1554301091511, "text": "Hi Clifton,\n\nThanks so much for your feedback. I hate to hear that your first visit was questionable but am glad that Kevin reached out. We'll be passing along your comments to Sim and the entire staff. We appreciate you choosing Joe Bullard Cadillac and hope that you'll keep in touch. Congratulations on your new XT4!\n\nSincerely,\nKristina M.\nMarketing and PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117261235513908212588", "name": "La-Wanda Davis", "time": 1344875870057, "rating": 5.0, "text": "From the moment I arrived on the Joe Bullard Campus, I was greeted with the respect and sincerity one can only appreciate in the car purchase experience.  Mr. Williams emenated confidence, a strong knowledge base, and excellent customer service.  I initially had no desire to make the leap into purchasing a car.  Within myself I had concluded \"You are just looking today!\" However, after having Curtis explain in detail the benefits and details on my car, and how it was \"built to go head-to-head with the world's best\", I knew I couldn't let this opportunity pass me by.  Mr. Williams is a \"people person\", and this will take him very far in his endeavers to maximize the car buyer's experience.  I have not regretted my purchase in any capacity, and have been singing the praises of the Joe Bullard Team - especially Curtis Williams!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107872478825933674239", "name": "Dean Waite", "time": 1543801093126, "rating": 5.0, "text": "Just bought a 2019 Escalade and had a fantastic experience at Joe Bullard Cadillac.  Damos Brand was my sales associate and he was great to work with.   Personally delivered my new Escalade to my house and spent an hour with me going through all the features of my new vehicle.    Just a fantastic overall experience from top to bottom.", "pics": null, "resp": {"time": 1543867720983, "text": "We can’t thank you enough for writing this awesome review for our dealership! It was a pleasure to help you, and we look forward to doing so again.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103691536885072737741", "name": "L Adams", "time": 1407165927804, "rating": 5.0, "text": "My experience at Joe Bullard was more than I expected! Our salesman Darren Robinson went above and beyond to make our experience comfortable. He answered all our questions and had alot of patience with us. Richard Nassar our finance manager was so kind and down to earth. He made us feel very relaxed and together they made this car buying experience the best we have had and we will not hesitate to come back for our next purchase! Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104901562843191196646", "name": "tony chaney", "time": 1580780367492, "rating": 1.0, "text": "Had my Saturn aura worked on last week n after having it home for only a couple of days it is having the same problem as before. I don't feel comfortable taking it back becuz I don't want to be over charged again.  Spent $807 and I feel cheated and defeated.", "pics": null, "resp": {"time": 1517678119149, "text": "Hi Tony,\nThank you for your feedback. I've passed along your comments and concerns to our General Manager, Jason Colbert. Once he has an opportunity to speak with our Service Manager and pull the files please expect him to reach out to you. We never want our customers to be dissatisfied with any experiences at Joe Bullard Cadillac. I hope that we're able to get this resolved for you and one day you'll give us a chance to earn back your business.\n\nSincerley,\nKristina M.\nMarketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111393111616427965828", "name": "Carl Richardson", "time": 1553275390420, "rating": 5.0, "text": "Excellent staff and great management  had an awesome experience from start to finish I would recommend family and friends to this dealership. Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110354364659044595012", "name": "Michael Litteral", "time": 1358954551521, "rating": 5.0, "text": "Allen Williams greeted us on the lot when we arrived to look at a used infinity FX. Allen was very informative and eager to provide us with the answers to all of our questions. The used car wasn't what we thought would meet our needs and Allen suggested the 2012 SRX that was similar to the infinity. After test driving it we decided to think about it and our options. The team at Joe Bullard Cadillac worked very hard to satisfy all of our needs and was able to meet them! They communicated well and their since of getting everything right was exemplary. The staff at Joe Bullard was knowledgeable, friendly and dedicated. Working with Allen Williams and Roosevelt Harris made, what for us was a stressful event (purchasing a new vehicle), into an enjoyable experience for my wife and I. Kudos to the Joe Bullard team for our car buying experience! We look forward to a continuing relationship with your dealership.\n\nThank You,\nMichael and Tammy", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105279662545103840679", "name": "michael clark", "time": 1521067884852, "rating": 5.0, "text": "Wonderful dealership with no hassels. Awesome salesman Damos Brand. Extremely helpful & courteous. Thanks all!", "pics": null, "resp": {"time": 1521509308011, "text": "First and foremost, thank you for stopping by to leave this incredible review, Michael. Our staff prides itself on providing efficient and friendly service to every customer that comes to our dealership. I'm happy to see that your visit reflects these values and that Damos assisted you in such a detailed and customized manner. Give us a call if you have any further questions!\n\nBest,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109441170677048072085", "name": "Frank Berry", "time": 1555508687059, "rating": 5.0, "text": "Service Writer is Excellent.  Work is done \"on time\" and \"correctly\".", "pics": null, "resp": {"time": 1555536497377, "text": "Frank, thank you for reviewing your service experience! We aim to provide time-efficient and exceptional service for our guests and we are proud that this was received during your time spent with us.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116772894108180665196", "name": "John Youngblood", "time": 1554906424497, "rating": 5.0, "text": "Staff was extremely courteous and the diagnosis and repair of our vehicle was spot on.", "pics": null, "resp": {"time": 1555535752583, "text": "John, thanks for leaving this wonderful feedback! Customer satisfaction is our top priority and we’re ecstatic to hear that you enjoyed your experience. We appreciate your business and look forward to seeing you again in the future. Have a great day!\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114752308997868594263", "name": "Ben Zimlich", "time": 1435083149744, "rating": 5.0, "text": "Got a CTS... Staff is very polite & courteous.  Will come back for another vehicle when I plan on purchasing one.  Staff will work with you to the best that they can.", "pics": null, "resp": {"time": 1435083679571, "text": "Thank you for taking the time to write us a review. We are very happy to hear you had a great experience!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109383287833513398401", "name": "Jami Morgan", "time": 1517173600062, "rating": 2.0, "text": "The people in the service department handling my claim were very nice. What I didn't like was that the mechanics were excessively rough with my vehicle. I had to have it towed and the towing company left it at the gate. Christian got me a loaner car, which I appreciated very much. When I picked up the loaner there were 2 guys who were trying to get it started to get it up to the shop. I needed to grab a couple things out of my car so I stopped to do that. For some reason they needed to open the back hatch. I was traveling with my animals so I had a large kennel in the back. I watched them put my seats down (rather roughly) and sling my kennel from the back to atop the back seats. It made me cringe but at this point I needed to get going as I had some stops to make and  I thought surely they knew what they were doing, this is a Cadillac dealership afterall and these cars cost a lot. They will surely be careful... When I got my car back, instead of them putting the vehicle back they way they found it, the kennel was still strown across the back. (As a plus though, it was washed! Which I appreciated since I had been on the road and try to take care of my car!) When I went to move the kennel back in place I noticed that there are scrapes across the plastic sides in the back. Greeeeaaaaaat. But, at that point I was leaving to head back to my home state and couldn't worry about it. It was more important to get home safe. They told me in addition to the battery that I needed new air filters, a rear wiper blade, and the throttle body cleaned, all easy enough for me to do myself. So, now I am here doing said maintenance and when I popped the hood I immediately noticed that my positive battery terminal clip has been broken and won't stay shut. Great. I am now back home, 3 states away. I will be back to the area, and am considering moving my family there but if they don't make this right I will find a different dealership to maintenance at.", "pics": null, "resp": {"time": 1517174513045, "text": "Hi Jami,\n\nThank you for taking the time to leave your review and detailed feedback. We are closed today; however, I’m sending your comments over to my General Manager and Service Manager to make sure they address this first thing in the morning. Please expect a call from us tomorrow. I’m very sorry for your experience and I hope we have the opportunity to prove to you this is not how do business nor is this how we want our customers to feel when they leave our dealership.\n\nSincerely,\nKristina M.\nMarketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101740649282084681899", "name": "Frank Jones", "time": 1535423622419, "rating": 5.0, "text": "This was the best car shopping experience that I have ever had, if it was ten stars they would get it from me.  It started with my Internet Sales Manger Tundy McDonald and she was very excellent  getting ideas and question to help me with the purchase of my 2016 Escalade ESV. She sent me to my saleslady Courtney Mauldin, asks for her when you come in, she was totally Awesome. She went above and beyond to get a deal worked out for me,  there was an issue with the car and she took it straight to  service and they fixed it right away and found something else and ordered the part and sent it to detail to get it clean up and they did a great job. If you are looking to purchase a vehicle I recommend Joe Bullard Cadillac, who will treat you right, quick in and out, and they are Veteran friendly, great staff and service. It was worth the 285 miles that I drove from Louisiana to get an awesome deal and meet some great people that really cared about my shopping experience. Ms. Courtney  called me on Monday to check on me to make sure everything was alright with me and the Escalade, and that is quality service at it fineness.", "pics": null, "resp": {"time": 1535566795631, "text": "Wow, your kind words took our breath away! We are so glad your recent visit was such a success, and we hope you won’t hesitate to reach out again in the future.\n\nTake Care,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104978031972167887412", "name": "Gateway League", "time": 1528204798801, "rating": 5.0, "text": "Everyone was great to work with at Joe Bullard. Simmie Yarborough was a great salesman and knew the answers to our questions!", "pics": null, "resp": {"time": 1528483587836, "text": "Thank you for taking the time to write this fantastic review! Our team works very hard to ensure each of our customers are 100% satisfied with the overall experience. We look forward to working with you again!\n\nBest,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "118269244125011329367", "name": "Martinez’s Martinez", "time": 1564605333364, "rating": 1.0, "text": "I'm  Supposed to getting money back from my extended warranty the I cutt off a month a go I'm still waiting on them for my check never heard from them agien", "pics": null, "resp": {"time": 1564672014704, "text": "Hi Erika, I'm sorry that you've not been contacted about the refund for your warranty cancellation. I'm going to contact your sales person on record and the General Manager of the store to find out the status of this claim. Please be expecting a call from someone today to follow up on the refund. Again please accept my apologies for this inconvenience. Kindest regards, Kristina M., Marketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106276384469713952808", "name": "Clint Elleard", "time": 1546218639541, "rating": 5.0, "text": "All the staff here were incredibly polite and professional.\nIt was a very enjoyable experience.", "pics": null, "resp": {"time": 1549399406143, "text": "Thank you so much for taking time out of your day to share your experience with everyone. We believe in attentive and professional customer service and we're glad that our team made such a great impression on you.\n\nKind regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110320731669140385897", "name": "Fran Howze", "time": 1553030114194, "rating": 5.0, "text": "Totally satisfied.  Always a pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104503932638541959944", "name": "Matt DeBlaey", "time": 1510284197418, "rating": 4.0, "text": "Very nice people in service, and in parts. Was able to help me with what I needed.", "pics": null, "resp": {"time": 1510333117030, "text": "Thanks for the nice review, Matt! We really appreciate this feedback. It was our pleasure doing business with you.\n\nBest regards,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112846112910245690961", "name": "Lezli Thomason", "time": 1522253637621, "rating": 5.0, "text": "Simmie, my salesperson, and Robby, the GM, were both amazing and very helpful. This is the second time that Simmie has helped me and I would encourage anyone shopping for a Cadillac to give Joe Bullard and Simmie the opportunity to earn your business.", "pics": null, "resp": {"time": 1524596921133, "text": "Hello Lezli and thank you for the kind words! We couldn't be happier that you enjoyed your experience here at our dealership and that Simmie and Robby were there to provide you with such exceptional service! Thank you again and congratulations on your new car.\n\nBest,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103252521324014714064", "name": "Bill McLarty", "time": 1442461279567, "rating": 1.0, "text": "I am William, answering for my wife Cheryl.  We bought this car new in 2004.  It has been solely serviced and maintained by McConnel/Bullard.  It has less than 30,000 miles on the odometer.  It's been the worst car we've owned since our marriage in 1962.  The problem today was a broken window regulator on the rear driver's side.  My wife has been the sole driver of this car.  We have no children in then home.  My conservative guess is that this window has been lowered and raised no more than 10 times in its aborted lifetime.  My wife was told a plastic roller had broken.  A plastic roller in a $50,000 (2004) Cadillac?!  My bill:  $517.23!  I can go back through my invoices and find similar instances of shoddy work and padded bills.  During the second year we owned the car the driver side dash assembly fell off the dash while my wife was driving.  At around the 4-5 year of ownership your service supervisor convinced my wife that she needed to replace all four tires (around 10,000 miles) because they had \"dry-rotted.\" ($800)  I've owned two Cadillac De Ville's prior to this, and have never experienced what has to be either poor construction, low-quality parts, or untruthful service managers.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "115183608971801305462", "name": "KIM CARTER", "time": 1401823940408, "rating": 5.0, "text": "Awesome Customer Service!!!\n\nI recently purchased a 2011 Cadillac SRX. The customer service provided by all the staff at Joe Bullard exceeded my expectaions. I had the pleasure of working with Darren Robinson (New/Used Car Sales) and he most definitely went above and beyond to ensure I was a satisfied customer. Thanks for taking the hassle out of buying a car!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100156130621873012694", "name": "Jessica Mose", "time": 1538524939671, "rating": 5.0, "text": "Our saleswoman Courtney was amazing and genuine. We received grade A customer service every step!", "pics": null, "resp": {"time": 1538668578963, "text": "To say thank you is not enough, Jessica! We are thrilled to read your kind words about our employees, facility and overall experience with us. Please stop by Joe Bullard Cadillac again!\n\nTake Care,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104938513860987917311", "name": "Lance Wilson", "time": 1512742588957, "rating": 5.0, "text": "Cadillac Service department is fantastic and Mark the GM is awesome! Wouldn’t go anywhere else, Joe Bullard is the place to shop and service for our Escalade.", "pics": null, "resp": {"time": 1512983628658, "text": "Thank you for putting your trust in Joe Bullard Cadillac, Lance! We pride ourselves in our service department’s ability to provide world class customer service. Please always feel free to reach out if you need anything – be it sales or service!\n\nBest regards,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104564832160772955783", "name": "larryp1053", "time": 1394212596781, "rating": 5.0, "text": "My recent purchase of a 2014 Cadillac CTS was my best car-buying experience to date.\nTy Bullard, Scott Howie, Roosevelt Harris, and Richard Nassar were professional, courteous, and committed to making sure that I was completely satisfied with my purchase.\n\nThe courteous and helpful efforts of management, sales staff, customer service, and the service department were outstanding, and very much appreciated.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "107200557435623076335", "name": "Paula Messer", "time": 1384660732280, "rating": 5.0, "text": "Andrew Speight was very friendly, patient and great to work with to make sure I got the SUV I wanted.  Everyone at Joe Bullard Cadillac was nice and helpful. I'll be back!!!  Highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "105747679117534944363", "name": "William Fitzpatrick", "time": 1509931172262, "rating": 5.0, "text": "5 star service and sales. Ow both new and used cars.", "pics": null, "resp": {"time": 1510080446930, "text": "William, thanks for the great review! Please come visit us if you need anything else, be it service or sales.\n\nSincerely,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109559889414470955591", "name": "myra howard", "time": 1446646444020, "rating": 1.0, "text": "Will never purchase another used vehicle that's not made by  Cadillac. My son purchased me a Lexus GX 470 after it was traded in. I had a total of six loaner cars from the date of purchase . Why ? Because of Technicians that are clueless to what they are doing. On  one occasion I was delivered by truck to the service department on a flat. Really !!! Never Ever will they get a dime or another referral from me. I wish they had a half star. 👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "114072188825705293616", "name": "barbara cowan", "time": 1444189226122, "rating": 5.0, "text": "Saw a vehicle being advertised on Autotrader website that I was interested in. Before I made my visit to the lot, my mind was set that I would only be going to look at the vehicle. I was not even planning on test driving. But Mustafa Elastal (Moose) was so friendly and laid back, he made me feel very welcomed and comfortable.  All my questions and concerns was addressed with expertise and professionalism. Not once did I ever feel pressured. After a test drive and feeling this the vehicle I wanted, I told him I will be getting back with him. After conversing on and off for about a month with Moose the salesman by phone and having the privilege to speak directly to Ty (the owner of the dealership)  I felt the dealership really wanted my business and cared about my satisfaction.The deal was made by phone. Vehicle was delivered to my home personally by my salesman. All transactions and paperwork done in the comfort of my home. I was very impressed with the way I was treated during my recent buying experience at Joe Bullard Cadillac. Would definitely recommend family and friends.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "104545462790485273104", "name": "Austin Tanner", "time": 1554259560911, "rating": 5.0, "text": "Awesome job by the service team as usual.", "pics": null, "resp": {"time": 1557233540999, "text": "We appreciate the kind words, Austin. We look forward to seeing you again in the future!\n\nBest regards,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "117477066687103097729", "name": "Jenny Linda", "time": 1378838820886, "rating": 5.0, "text": "Bought a 2009 GMC Yukon used from this dealership. Great service, very friendly and helpful. Scott Howie was very accomodating in trying to make sure I got the truck I was looking for and was very helpful. Mr. Richard Nassar knew I was on my lunch break and worked very quickly to get me in and out and finished with all my paperwork all with a smile on his face. Went to many other dealerships in the search for this used truck and could not be more pleased with my experience here at Joe Bullard Cadillac. Will start here first next time and leave the rest for last resort!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112005826581965905408", "name": "Jeannette Bennett", "time": 1484813383944, "rating": 1.0, "text": "Worst used vehicle I've ever purchased. This car has cost more in 18 months than my Honda in ten years. Inspection protocol was incomplete before the car was presented for sale. When I tried to find out what had been done I received this asinine answer: if it needed something we did it. Will never purchase a car here again.", "pics": null, "resp": {"time": 1485366528807, "text": "Jeannette, I am sorry to hear about the recent frustration with your vehicle. Our team is dedicated to providing our customers with a top-notch experience and I’m disappointed to see this wasn’t the case for you. Our GM, Marc Heiter will be reaching out to you shortly regarding this matter. Sincerely, Joe Bullard Cadillac Team"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111732107338874997877", "name": "Johnny Swopes", "time": 1391742339494, "rating": 5.0, "text": "Absolutely, the most wonderful buying experience my wife Kathy and I have ever had.  The atmosphere was amazing!!  Ty was very gracious and made us feel so welcome as did the entire Bullard family!! Andrew Speight was phenomenal with his delightful British accent describing all of the wonderful details of this truly great Cadillac DTS. His knowledge of the vehicle was paramount!! He knew 'everything' and treated us royally with the test driving and description of the many facets of the vehicle. Andrew kept everything in perspective of the price we could afford. Then he turned us over to Jon McCarthy who was equally as brilliant. Jon made it happen!!! What service!! Jon was so relatable with such tenacity in helping us, and he really came through with making our dream come true!! We highly recommend the family of Joe Bullard Cadillac, and especially Andrew Speight and Jon McCarthy.  They will indeed spoil you! We really thank the Lord for sending us to this Company, thy are a true blessing to the gulf coast!!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108591361817485150967", "name": "C C Hall", "time": 1389817901952, "rating": 5.0, "text": "I purchased a Cadillac SRX on 1/11/14 from Joe Bullard Cadillac. Curtis, Roosevelt and Ty were very courteous to me and my husband. They answered all of my questions and worked with us to get to the price we were willing to pay. The Cadillac warranty is hard to beat, especially the 4 years of maintenance and the road side assistance. This is the 6th GM vehicle that we presently own and I know will be the best serviced one by far. I had been looking for a vehicle for 5 months when I decided to look at the SRX. I am glad I did. It has everything on it that I was looking for plus a lot or more features. Everyone at the dealership that walked by you spoke and asked you how you were doing. This is a dream vehicle for me and I look forward to driving it for years. I will recommend to family and friends that are interested in a great luxury car or SUV to get a Cadillac at Joe Bullard Cadillac in Mobile, Alabama and ask for Curtis. I had to use the service department today to get my oil changed and check the routine things out. Christian and the others were very courteous and took care of me and my SRX. The customer lounge area was very pleasant and comfortable during my wait.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113562206189833943288", "name": "Greg Loughlin", "time": 1509505765910, "rating": 3.0, "text": "Good workmanship, poor communication.  No warranty info with tires on road hazzard option.", "pics": null, "resp": {"time": 1509639136307, "text": "Hi Mr. Loughlin,\n\nThank you for giving us this valuable feedback. I have sent your comments to our Parts and Service Manager as well as the General Manager for them to consider how we can better improve our communication and process. Please feel free to contact us any time you need assistance and we hope to continue working with you in the future.\n\nKindest regards,\nKristina M.\nMarketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108958716070317869495", "name": "Ashley Brown", "time": 1398299245771, "rating": 5.0, "text": "Superior Service A++++++++++++++++++++++++++++++++++++++++++\n\nMy experience at Joe Bullard Cadillac - Mobile Alabama was excellent to say the least. The moment my fiance and I pulled up to the dealership we felt welcome. Mustafa Elastal immediately greeted us and made us feel important. He went out of his way to make us feel comfortable as he walked around the lot with us picking out suitable vehicles. This was very important to me considering I had never owned a Cadillac before. His extensive knowledge of the vehicle I wanted (XTS) and the history of Cadillac itself impressed me by far. The hospitality didn't stop with Mustafa. Roosevelt Harris also did a fine job answering all the questions I had about the different cars and prices. He also mentioned a couple of nice restaurants we could try out while visiting Atlanta, GA which we did and absolutely loved. Curtis Williams came by and personally greeted us and also had a nice conversation with my fiance. Last, but definitely not least, Jon McCartney was absolutely amazing (and not just because he actually knows where Winnfield, LA is located lol). He worked very hard to get the financing I needed to get the exact vehicle I wanted. It was a hard sale for me, but he showed us that he wouldn't give up. I really appreciated all the time that each of them took out to make our experience the best car buying experience we have had. I would recommend this dealership without thinking twice (I already have mentioned them to others), and I will be bringing others to come do business with Joe Bullard Cadillac in Mobile, AL.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "108016317518420905119", "name": "Ramona Reed", "time": 1388273502966, "rating": 5.0, "text": "Honestly we did not wake up that morning thinking of buying a car. We saw one on the interstate and decided to go look at them. When we got there it was freezing and windy and Darren Robinson was in the parking lot moving cars. He offered his help and we told him we were in town to Christmas shop not spend all day at a dealership, we just wanted to try the car on for size. he escorted us inside for coffee and cocoa and went to get the car. we test drove it. we loved it but we were not there to spend all day at the dealership. we left our personal information to be reviewed and were going to shop when Darren notified us that we would be using the cadillac for the day via loaner form approval. we really enjoyed using the car. we Christmas shopped all day and when we returned to the dealership we had been approved for the car with our payments within dollars of request. Jon McCartney had to have been the most professional financial manager i have ever encountered. He was a real person who made us feel right at home and comfortable to speak openly. very friendly and personable. then Roosevelt Harris enters the picture. a gem. a diamond in the rough. so charismatic so joyful and helpful and accomodating. I cannot put into words how much Darren helped to familiarize us with the cue and features. he was so knowledgable of the cars systems. he was an absolute treasure. I cant say but one thing about Joe Bullards team, \"you are doing something right\". I got hugs from everyone when i left. i felt like i was part of a family there. I even got a text message from Darren on Christmas morning wishing us a merry Christmas. i literally spent 2 hrs tops at the dealership and received the most beautiful CHristmas gift I could have ever dreamed of. but the most inportant thing was the environment and kindness that we experienced while there. oh and my son loved the lounge with computers and coffee/cocoa which made his time there enjoyable also. we will definitely reccomend Joe Bullard Cadillac to friends and family and we will definitely be repeat customers ourselves. my only hope is that we have the privilege of having the same staff in years to come. Thank you so very much.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106882160526485279576", "name": "Fred King", "time": 1369666671828, "rating": 5.0, "text": "From the moment I walked in the front door, Andrew, Ben, and Ty did their best to find the perfect car for us. They were more than successful, my wife and I both have never been more satisfied with a major purchase and the reason for this was the genuine effort each member of the team at Joe Bullard put forth to ensure that we left not only as satisified customers, but as new friends.\n\nAndrew stayed with us and walked us through the process and was a very genuine and honest regarding the steps and what was happenning and what was going to happen.\n\nBen was very diligent and went above and beyond to get the exact car we were looking for... the car is perfect, just what we wanted.\n\nTy was also great, taking time to sit and talk to us about what was happenning and to ensure us that everything was on track and going well. It was and it did. I do not remember seeing as big a smile as when I told my wife that ya'll had her car ready... Thanks\n\nRichard made the paperwork fly by with ease... the power of a sharpie to show me where to sign... Thanks for making the experience great.\n\nI can not say enough about my outstanding visit and purchase, when you want to go back to the dealership that sold you a car to visit with  the people who were involved in getting you a vehicle because they are now friends, I guess that is how it is always suppossed to work, I am glad that I found the place to go and to send my friends and family to when we need not only a new vehicle, but to meet some outstanding people as well.\n\nThanks again!\n\nFred & Diane", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100988052476327227986", "name": "Andrea La Rossa", "time": 1375801200891, "rating": 5.0, "text": "Wow!  Another great experience with Joe Bullard Automotive!  My Salesman, Damos Brand, was wonderful. He was courteous, professional, and very knowledgeable about the Cadillac product line and that helped make my car buying experience a dream!  Damos delivered my new Cadillac XTS to me and then spent as much time as I needed going over all of the XTS functions and assisted in setting up my XTS to suit me perfectly!!  I love my new Cadillac XTS and once again, I will recommend Joe Bullard Cadillac, Damos Brand, and the New Car Sales Manager, Roosevelt Harris, Jr., to everyone I can.  Both of these men are true assets to Joe Bullard Automotive.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116942257360494869256", "name": "Jim Smith", "time": 1356803199561, "rating": 5.0, "text": "I was impressed from the start with Rich Borden who was the first person I met and provided me an excellent selection of new and used models to make my choice. I had driven a 2002 Cadillac Deville for 10 years, so I was already happy with the Cadillac family and had owned/driven GM (Pontiacs before the Deville)cars since 1966. Because I perferred new over used, and because I had never leased a vehicle, Rich introduced me to Ben Jackson who provided me the pros and cons of the lease vs purchase option. I made my decision on a 3 year lease. I made my choice of the 2013 XTS.\nThe administrative process was made flawless by the excellent knowledge and professionalism of Ben Jackson and Richard Nassar.\nThe entire sales staff from Ty Bullard(same as when I bought a new Olsmobile Holiday 88 from his Dad and Granddad Joe Bullard in 1978), Roosevelt Harris(who presented me my Cadillac IPad),and in particular Rich Borden was outstanding.", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103676145286303035931", "name": "chris edmunds", "time": 1407813681210, "rating": 5.0, "text": "When I tell you that my salesman, Mr.Curtis Williams and my fiancé Officer Mr. Roosevelt Harris did such a out standing job. Can't get any better!", "pics": null, "resp": null, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116873779430925028813", "name": "LIONEL E WOODEN", "time": 1507901039882, "rating": 4.0, "text": "Looking at a Cadillac Escalade nice good candidate. Trying to get back there so I can weigh my options.", "pics": null, "resp": {"time": 1507986629700, "text": "Thank you for the great feedback. We appreciate your consideration!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110253467662801877623", "name": "Elaine Smith", "time": 1545348632460, "rating": 5.0, "text": "Professional staff and great customer service.", "pics": null, "resp": {"time": 1545847459977, "text": "Thank you so much for the kind words, Elaine! We strive to provide the utmost in customer service and quality to all of our guests, and we're thrilled that you experienced this value first hand. We hope to see you again soon! Sincerely, Robby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106504657848481308144", "name": "Denise Williams", "time": 1563217533584, "rating": 5.0, "text": "The service was excellent as always!", "pics": null, "resp": {"time": 1563311652178, "text": "Thank you for the great review. We look forward to working with you.\n\nBest,\nKevin Dean kdean@joebullard.com"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "113708474118209665859", "name": "Robert Turner", "time": 1493757283229, "rating": 5.0, "text": "They are always on time and courteous in the service department.", "pics": null, "resp": {"time": 1497387635926, "text": "Robert, thanks for the great review! Please come visit us if you need anything else, be it service or sales. Best, Marc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "112842503814247903504", "name": "Fred Small", "time": 1554846729288, "rating": 5.0, "text": "Got the price we wanted. We were in and out the door in 45 minutes.", "pics": null, "resp": {"time": 1555535705441, "text": "We appreciate you for taking the time to give our dealership such an excellent star rating. It helps us to know that we are meeting the needs of our customers. If there is anything else that we can do to help you with regards to your vehicle, please feel free to let us know.\n\nBest,\nRobby Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100849379303273099009", "name": "Johnny Strada", "time": 1575510034525, "rating": 5.0, "text": "Best in the business.", "pics": null, "resp": {"time": 1575520886986, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103335215645079372161", "name": "Hunter Livery", "time": 1467149379736, "rating": 5.0, "text": "Service after the sale has been the best so far in Mobile!", "pics": null, "resp": {"time": 1469826934843, "text": "William, We're glad to hear that your service visit went so well. It's always great to hear from our customers and we appreciate you taking the time to give us feedback. Thank you for continually choosing Joe Bullard Cadillac for your vehicle needs. Regards, The Joe Bullard Cadillac team"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "116794908886714654258", "name": "Valarie Bracy", "time": 1503792699561, "rating": 2.0, "text": "I had to wait 2 weeks for my car repairs. They over charged me for replacing my steering wheel collar", "pics": null, "resp": {"time": 1503794575378, "text": "Ms. Bracy,\n\nI'm very sorry your recent service experience with our store was not positive. I've reached out to Marc Heiter, the general manager, and let him know of the situation. On Monday he will pull the records for this service transaction and be in touch. Thank you for giving us this feedback and hopefully we will be able to address this and have the opportunity to earn your business again in the future.\n\nKindest regards,\nKristina M.\nMarketing & PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111986330627532115539", "name": "benjamin makamson", "time": 1536114584628, "rating": 5.0, "text": "I hate buying a car because I’m accustomed to pushy salesmen and I have to admit that I was a bit stoic at first when Troy ( Andrews ) introduced himself but as we worked through the process he was a complete gentleman and a professional and helped me work out a deal that I was happy with with . It really is a different experience at Joe Bullard and I would buy again from these guys .\nDr M", "pics": null, "resp": {"time": 1536244499716, "text": "It is very kind of you to write us such a nice review. We're proud to offer our customers a pressure-free shopping experience, and I'm glad to hear that was the case for you on your recent visit to Joe Bullard Cadillac. Thank you so much for your business and please let us know if there's anything else we can do for you.\n\nTake Care,\nRobert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "110905900604560392206", "name": "Johnnie Griggs", "time": 1545692148504, "rating": 1.0, "text": "No good service because my oil is leaking for the oil filter so I gone had bring it back.", "pics": null, "resp": {"time": 1545834679311, "text": "Hi Johnnie,\n\nI'm sorry to hear that you're having problems with a leak after your recent service visit. I have made the Service Manager (Sean Alexander) and the General Manager (Robby Herbert) both aware of your issue. Please be expecting one of them to reach out to you for more information and to see if we can get this resolved.\n\nThank you for giving this feedback and I hope we're able to continue to earn your business.\n\nKindest regards,\nKristina M.\nMarketing Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "103444801565102191832", "name": "Greer Butler", "time": 1514525232326, "rating": 5.0, "text": "Great service dept always.", "pics": null, "resp": {"time": 1515044759576, "text": "Thank you for the positive review, Greer and thank you for trusting us with your vehicle. Drive safely and always feel free to reach out with any service questions.\n\nBest regards,\nMarc Heiter - General Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "101792900332934580367", "name": "Goddbod. Junya “iceberg” Winston", "time": 1591033978952, "rating": 5.0, "text": "caddy lackey....", "pics": null, "resp": {"time": 1591039700008, "text": "Thank you for taking the time to provide us with a review of your experience. I am pleased to hear that our team made your experience pleasant and we look forward to seeing you again soon!"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "100149364833223800811", "name": "My Money prince", "time": 1540832327173, "rating": 5.0, "text": "Great service 👍", "pics": null, "resp": {"time": 1540855721743, "text": "Thanks for the great feedback! It was our pleasure to assist you. Regards, Robert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "106533344385415642859", "name": "Dorothy Scott", "time": 1540651158052, "rating": 5.0, "text": "Absolutely the Best Dealership in town!!!!!", "pics": null, "resp": {"time": 1540855783475, "text": "Wow, thanks for your feedback, Dorothy! We're so pleased to know that our team has made such a good impression on you! Regards, Robert Herbert, GM, rherbert@joebullard.com (251)-544-7341"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "111871950699374749577", "name": "Carolyn Jones", "time": 1496778714918, "rating": 2.0, "text": "Unfriendly sales people", "pics": null, "resp": {"time": 1497045553823, "text": "Hi Mrs. Jones,\n\nI'd like to apologize for your recent experience with our sales staff. If possible I would like to have someone from our leadership speak with you to get more information about your encounter so that we can address any issues to ensure a better experience for all of our customers. Please feel free to call me at 251-471-6141 or if you prefer we contact you please email your contact information to info@joebullard.com.\n\nKindest regards,\nKristina Machen\nMarketing & PR Manager"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "118196034787760261874", "name": "Paul Mince", "time": 1484761147874, "rating": 5.0, "text": "...", "pics": null, "resp": {"time": 1485363482864, "text": "Paul, thanks for the 5 stars! Warm regards, Joe Bullard Cadillac Team"}, "gmap_id": "0x889a4da8e0caaef5:0xa8eb3c2a1737d68b"}
{"user_id": "109915837302393898323", "name": "Autumn Carlisle", "time": 1564194924939, "rating": 5.0, "text": "I had/continue to have a great experience with them. Andre had me in and out of this place in under an hour with keys in hand. He was very friendly to not only me but also my daughter as well. Every time I go in the office, they are always so friendly. They are also great working with you on payments if something comes up. When we decide to buy a second vehicle, it will be with A & M.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "103452709305243726716", "name": "Kimberly Handley", "time": 1583464190519, "rating": 5.0, "text": "Great staff I saw ad on Facebook of a car I was interested in contacted them and was all set with my approval and ready to go before I visited I test drove and was very happy with vehicle selection all nice newer model cars with good mileage my car drives great they worked with me on my payments that I could afford and downpayment I would recommend them great team", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "114251264470119349309", "name": "Treba C. Harris", "time": 1584087981348, "rating": 5.0, "text": "They are so nice and let's you make your own decisions on the car you want", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "109249417149752786774", "name": "Viridiana Romero", "time": 1539960033080, "rating": 5.0, "text": "This place is the place to go for a car or truck. I worked with Andre and he went above and beyond to make sure I was satisfied with my truck and the loan process. He has great customer service and I was very pleased with him and the business. I will definitely be back and will refer people to them. Again thanks Andre for everything you did I am very grateful!!", "pics": null, "resp": {"time": 1547162348505, "text": "Thank you!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "106271146800559566470", "name": "Andre Pires", "time": 1570478026010, "rating": 5.0, "text": "Excellent dealer, friendly people and nice inventory! I recommend this car lot.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108692520327022953211", "name": "jibreel mekdad", "time": 1567001958897, "rating": 5.0, "text": "the people there were friendly and great, they gave me a great deal and the car was in excellent condition. If i could give more than 5 stars i would.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "101745681858457671888", "name": "Otis Lee Phillips Jr", "time": 1552581714990, "rating": 5.0, "text": "Great 👍 I brought a car months ago. And I tell my people to come check them out quickly get you riding", "pics": null, "resp": {"time": 1561045788120, "text": "Thank you Mrs Phillips!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "107937627270683831724", "name": "Jonathan Bryant", "time": 1540853124574, "rating": 1.0, "text": "WORST EXPERIENCE OF OUR LIVES!!\nthese 4 and 5 star reviews have to be fake or paid for. have to be!\nI got a car from them a little while back , charged almost 6000$ over what the car was worth and was assuming I was getting a decent  car. NOPE!\nIt’s completely undriveable,I spent every penny our family had in the bank and everything I could borrow and I’m still paying payments and it’s sitting in a shop till I can pay the rest of the bill.\nThey knew about the problems and lied to my face !\nStay far away", "pics": null, "resp": {"time": 1602957321201, "text": "Hi Jonathan, I am sorry to hear about your experience with A&M Auto Sales. I can assure you that management has changed since then. We are very different now and strive to provide the best service possible!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113434331522858834327", "name": "Robert Bates", "time": 1521843932823, "rating": 1.0, "text": "Stay away! They are deceptive and cheats. I bought a truck from them at an outrageous price (had no options at the time and needed a truck A.S.A.P. for business) and I have spent over $5,000 fixing it in the 6 months I've owned it. I was told by Lee and the \"salesman\" that the truck was $11,000, only to charge me $13,000. Of course once I realized what they did and contacted them they play dumb and it is too late. I know if I should have taken more time to review and ask questions but it was the end of the day, past business hours already and I needed to leave with the truck that day. Regardless you should never practice those business ethics in any industry. I have had to change the rotors, brakes, brake drums, brake cylinder, master cylinder, calipers and brackets, hub assembly, CV axles, steering arm, I am in the process of changing the transfer case (over $2,000 on it's own) and it still needs a steering column, gear box, front differential, driveshaft and possibly the rear differential. When it's all said and done I will have put at least 5 times the value of this truck into making it run right and paying it off. I am a self employed remodeler and I have missed countless days of work, lost countless jobs and it's gotten to the point that I am having trouble paying for my daughters daycare and buying her essentials. This whole deal has radically ruined my life. These people knew the situation I was in and absolutely took full advantage. Beware!!!", "pics": null, "resp": {"time": 1602957637827, "text": "Hi Robert, I am so sorry to hear about the terrible experience you had with A&M Auto Sales. Our management has changed since then. We now have a great team behind us to help with any issues with the vehicles for future or current customers!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "106711626749415683459", "name": "Marvin McCoy", "time": 1496330318287, "rating": 5.0, "text": "I highly recommend this place if you are looking for a car!!!! They had what I wanted, and did what was need to get me driving the same day!!! Thanks Mr. Lee and special thanks to Tommy", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "112181012940118527668", "name": "John Galliera", "time": 1609522419743, "rating": 3.0, "text": "Never been.", "pics": null, "resp": {"time": 1609524954351, "text": "Hello John, thank you for the 3 star review. You can come in and visit us at 518 1st Street North, Alabaster, AL. 35007 . We are close by the Shelby Baptist Hospital, we will be happy to help you find a new vehicle."}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108701766100171673736", "name": "Shalanda Hill", "time": 1503529170873, "rating": 5.0, "text": "Me an my Husband has had no problems at all so come in an purchase u a car👌", "pics": null, "resp": {"time": 1504113824178, "text": "Thank you Mrs Hill for everything!!!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "111032226785266123123", "name": "Chris Davis", "time": 1551578021886, "rating": 1.0, "text": "Card not clean drove car came back smoking I think bad cars  but that's my thoughts", "pics": null, "resp": {"time": 1602957821745, "text": "Hello Mr. Davis, we are sorry about your experience with our vehicles. We are now under different managment and can assure that the vehicles are now thoroughly cleaned. I hope that you can give us another chance in the future!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "105090458384427744071", "name": "John Hall", "time": 1490632298505, "rating": 5.0, "text": "Great sellers they really understood my situation and got me a great deal I recommend this business to everyone. Thanks you guys", "pics": null, "resp": {"time": 1492440965946, "text": "Thank you for rating A & M Auto Sales, Inc"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "105409612809342357156", "name": "Tommy Seals", "time": 1490632582938, "rating": 5.0, "text": "This lot has options no other lot has. Very friendly and will guarantee your approval", "pics": null, "resp": {"time": 1492440903640, "text": "Thank you for rating A & M Auto Sales, Inc"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108643229336949282303", "name": "pga fortnite", "time": 1476824571868, "rating": 5.0, "text": "Staff is very nice; very knowledgeable; Auto Financ Specialist!", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "116928877823447233153", "name": "jeff brantley", "time": 1561409963878, "rating": 5.0, "text": "It's always good", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113303951820508129435", "name": "BOBBIE RUSSELL", "time": 1534909069318, "rating": 4.0, "text": "Where we got our car😜😜😜", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "111323206290817482427", "name": "Greg Tatum", "time": 1543982671447, "rating": 5.0, "text": "good deals", "pics": null, "resp": {"time": 1561045840655, "text": "Thanks Greg!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113303951820508129435", "name": "BOBBIE RUSSELL", "time": 1534909069318, "rating": 4.0, "text": "Where we got our car😜😜😜", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
