{"user_id": "112357121665750041276", "name": "Teresa Ard", "time": 1617317520781, "rating": 5.0, "text": "She was very nice & I am excited to try what she has.", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "105108088450571050399", "name": "Kenna Sankey", "time": 1611860106658, "rating": 5.0, "text": "Cakes and cupcakes are delicious... very nice environment with a boutique in the inside", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "103838102615501502787", "name": "Ewan Moran", "time": 1604556216135, "rating": 4.0, "text": "services was good and the staff was very friendly and good behavior", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "108504095930410408096", "name": "Mae Shinigami", "time": 1498770754736, "rating": 5.0, "text": "The owner is super nice and her daughter is a such a polite young lady! Awesome family-run business with the best scratch-made and love-filled desserts anywhere! And the cream cheese frosting is to die for! Everything is delicious, but the key lime cupcake is a standout!\nUpdate: I'm sorry they're closed now. :(", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "103129283134961334524", "name": "Megan Cox", "time": 1457194849321, "rating": 5.0, "text": "I live out of state and have a family member in the hospital. After calling several places and having been treated rudely, Lulu's was a blessing! So nice on the phone and delivered same day for me. I hope to be able to try it in person soon!", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "116529939644055636698", "name": "Delray Powell", "time": 1467823353646, "rating": 5.0, "text": "Lulu does all my Holiday Baking and Birthdays. My husband loves the enormous Red Velvet Cupcakes that she does. Her personality is very inviting and pleasant. However, Lulu is aimed to please her customer's and her prices are reasonable. Lulu's Bakery is Super!!!!", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "102146274829915641801", "name": "Nancy Bradford", "time": 1441844356301, "rating": 5.0, "text": "Fantastic service, excellent and beautiful cake just to my specifications.  The key lime cake with cream cheese icing was delicious.  Everyone raved.  I am so happy that I tried Lu Lu's.", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "102973634004541519398", "name": "Tammy", "time": 1451596476433, "rating": 5.0, "text": "The kindest thing just happened to me at Lulu's.  My husband and I are in town for the holiday and was searching for a bakery to get some desert for our hotel room.  GPS recommended LuLu's.  We arrived at Lulu's just after she closed for the holiday, but Lulu was still in the parking lot.  Lulu greeted us, and to our surprise went in her car and gifted us some desert for our room.  This was the sweetest act of kindness from a business owner i've witnessed in a long time.  AND THE CAKE IS DELICIOUS!!!!! Thank you Lulu, we wish you continued success with you Cake Shop and we will stop in the next time  we visit Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "104397319314261164428", "name": "Cynthia Lee", "time": 1488469883828, "rating": 5.0, "text": "Excellent work..!!", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "110464387469370101951", "name": "Tamika white", "time": 1460048364760, "rating": 5.0, "text": "The best sweet potatoes pies ever!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888e81eb1eab45fb:0x70afe2e9b380048a"}
{"user_id": "100839470743535920852", "name": "Denise Brasher", "time": 1572354841625, "rating": 1.0, "text": "$80 cake but Publix is better!  I ordered a 10\" cake for a special event at my daughters school.  I saw that a 8\" was $35-$45 so I went ahead and ordered a 10\" thinking okay this may be around $50 or so.  I went to pick it up and it was over $80 - WHAT!!!  So I wasn't giving a $80 cake away. We went to Publix and gave that cake away. So we decided for $80 this had better be the best cake of our lives. We invited family over for dinner and we all dug in.  Well the chocolate cake was moist but the Salted caramel and the icing was not good.  NO ONE finished their slice.  For $80 we should've cleaned our plates and been asking for seconds.  My MIL didn't even want to take the extra home.  So disappointed.  My wedding cake didn't even work out to cost that much.  I would not recommend buying from here.  Someone had mentioned Edgar's to me but I thought they said Edward's - I'll be going there from now on.", "pics": null, "resp": null, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "112173639415136764911", "name": "Christy Holden", "time": 1540751453922, "rating": 5.0, "text": "Delicious every time! I love to pop in and grab a quick meal and a slice of cake. Fast and friendly staff!", "pics": null, "resp": {"time": 1540916381796, "text": "Christy, I'm grateful to know you're such a fan of our cakes, meals, and speedy service! The team looks forward to having you here. -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "117381011744670188363", "name": "Birmingham South Campground", "time": 1472065791041, "rating": 5.0, "text": "When our co-workers have birthdays we always celebrate with take out for lunch.We tried Cake Art for the first time today and absolutely loved our experience! The man who took our phone order was very precise. The meal was ready in a timely manner and ALL of our orders were correct. It was delicious and we will be ordering from these folks often!", "pics": null, "resp": null, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "111495950201569427632", "name": "Jessa Garrett", "time": 1492615985722, "rating": 5.0, "text": "Cake Art By Cynthia Bertolone did both the cake and the catering for my wedding, and everyone was thrilled! From the gorgeous cake to the delicious pork tenderloin and chicken piccata, the guests could not stop talking about the wonderful options. Cynthia and her team created a custom menu for us and they were there throughout the entire process. They set up and cleaned up, so there was no stress the day of for me! Thank you so much Cake Art!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOuNA4ZBLJCJKymg-BuoVF1AjNYK2VXn6bixm1r=w150-h150-k-no-p"]}], "resp": {"time": 1500674916846, "text": "Jessa, it was such a blast working with you to create the perfect menu for your wedding. I'm so happy you and your guests all loved the cake, pork tenderloin, and chicken piccata. Thanks for making our bakery a part of your special occasion. I hope to work with you for another celebration again soon! -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "107628652343850639213", "name": "Lambo Moto", "time": 1547848579106, "rating": 5.0, "text": "The food is awesome and everyone is super friendly! Give it a try you won’t be dissapointed.", "pics": null, "resp": {"time": 1548183503189, "text": "So glad our food and service didn't disappoint, Tyler! We'd be happy to welcome you back here soon. -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "104984601620750474500", "name": "Connie Settles", "time": 1474937106026, "rating": 5.0, "text": "The food here is delicious. Mrs. Cynthia was very accommodating to the food allergies my family has and the service was personal, warm and friendly. We had the lasagna, spinach calzone, spaghetti and meatballs and the chicken salad. Everything was delightful. The strawberry cake is a must have if you are in the area...do yourself a favor and get some CAKE. Some of the best cake I have had...not to sweet, light and fluffy....fresh strawberries....mmmmm!", "pics": null, "resp": {"time": 1500915740524, "text": "It' was our pleasure to customize and personalize your meals to meet all of your tastes and dietary needs, Connie. From the first bite of spinach calzone to the last bite of strawberry cake, it seems like your meal was a hit! Hope you'll be back for more summery sweetness soon! -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "115173724865667275955", "name": "mike foreman", "time": 1528500383044, "rating": 5.0, "text": "Food is wonderful. We were very happy with everything we ordered.", "pics": null, "resp": {"time": 1528899559602, "text": "I'm happy to hear that you were pleased with your experience, Mike! Thanks for the review, and we'll see you next time. - Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "101356760037943706785", "name": "Gretchen Evans", "time": 1469745082252, "rating": 5.0, "text": "I discovered this little gem about 2 months ago via a Facebook picture. I ordered my daughters Bday cake and it was phenomenal. No leftovers. Everyone raved, I have since been back for take out lunch, cake slices, pastries, and cupcakes. I seriously can't find anything I don't like. Try it, it will NOT disappoint", "pics": null, "resp": null, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "106661988307173985791", "name": "Christopher Jahraus", "time": 1498835425572, "rating": 5.0, "text": "This is a fantastic place, run by the family of the original Joe's Italian Restaurant in Alabaster.  They put so much passion into what they do, it can't help but result in phenomenal food and cakes beyond belief!", "pics": null, "resp": {"time": 1500414371990, "text": "Christopher, it is wonderful to hear that our passion and the love for our bakery has come across to you. We can't imagine doing anything else! Thank you for all of the support. We'll see you soon! -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "114945244765857027015", "name": "Sunny kang", "time": 1530828305681, "rating": 5.0, "text": "I love your carrot cake make more", "pics": null, "resp": {"time": 1530898808402, "text": "Thanks for the support, Sunny! We're thrilled you're a fan of the carrot cake. Hope you'll make it back our way again soon. -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "111098019338583624896", "name": "Kimberly Fowler", "time": 1464712449697, "rating": 5.0, "text": "picked up lunch today for coworker and I , HUGE portions , homemade authentic Italian food - Fast and friendly service . We will most definitely be back for more - you've gotta see the cake slices to believe it!", "pics": null, "resp": {"time": 1500159215750, "text": "Kimberly, thank you for writing this kind review last year -- I appreciate your support. It's wonderful you enjoyed our authentic Italian food. I hope you and your coworker return for another great meal soon. -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "107528720521465974050", "name": "Trent Daniels", "time": 1530564712921, "rating": 5.0, "text": "Food was delicious!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNcj37XnlYFaMHHwDKdU2_h9CJDpD-HUQ-OfTQ=w150-h150-k-no-p"]}], "resp": {"time": 1530709533944, "text": "Glad you enjoyed stopping by, Trent! Come see us again soon. -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "118194970423358727076", "name": "John Walker", "time": 1551035292228, "rating": 5.0, "text": "Great Cake!", "pics": null, "resp": {"time": 1551220630233, "text": "Glad you could join us, John! Hoping to see you come back soon. -Cynthia Bertolone, Owner"}, "gmap_id": "0x888923ba62d66b41:0xfe5276c06849a170"}
{"user_id": "114521978085427184184", "name": "Christy Culotta", "time": 1621110436139, "rating": 5.0, "text": "Best cake I have ever eaten! My guests went back for seconds! Cake was moist icing was light fluffy not greasy! Laura met the design I requested perfectly! Will continue to buy our cakes here! My guests will also buy from here!", "pics": null, "resp": {"time": 1623093883170, "text": "Thank you so much for your preference and this is my pleasure 😊!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "113516747705022907483", "name": "Ramya V", "time": 1596402358958, "rating": 5.0, "text": "They made my baby first birthday cake 🎂 It was so delicious 😋 & mouth watering 🤤 The medium moist cake tastes like a pastry, you can eat more & more cake as the icing is so tasty.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMYSt6OAepVLC45q6MLs7va5kE8nlroPrAZzKJ6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYDDhIAJxzKruiH_x-CPrrivDImZMFnt1f4pW8=w150-h150-k-no-p"]}], "resp": {"time": 1601756169537, "text": "Thank you 😊!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114459434804008921808", "name": "christi callahan", "time": 1619366634701, "rating": 5.0, "text": "I have gotten several cakes from here and they do a wonderful job on what you are asking.\nDue to covid this past year, I was unable to get our kids birthday cakes from here\n\nBut definitely looking forward in coming back here this year.\nThe filling and moistness of the cakes are delish!!! 😋😋\n\nI worked in a bakery for years and years and I recommend this place over most bakeries in the area.\nKeep up the good work you guys!! ❤️", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "109365747311980018414", "name": "Karen Mendes", "time": 1620506492244, "rating": 3.0, "text": "They really do make some rich cakes and decorate them very beautiful, but I didn't like that they still use the sticks for the cakes and they didn't tell me for my 3 year old son's cake that they had put chopsticks on it.", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114311774614492336490", "name": "Kelsey Manley", "time": 1613394755168, "rating": 5.0, "text": "Cakes Las Comadres made a beautiful and delicious tres Leches cake for my daughter’s birthday! I shared the design I wanted, and it came to life beautifully. I also ordered cake pops with a cactus design, and they were just as beautiful and delicious. We will return for future cake needs!", "pics": null, "resp": {"time": 1613442870778, "text": "Thank you so much it is our pleasure!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114994496038494715357", "name": "James Floyd", "time": 1531116174887, "rating": 5.0, "text": "This was more than just a birthday cake it was a piece of art, my first time using this Bakery  for my daughterthat was turning 5. The owner really took the time to discover my needs and wants, the finished product was not only a masterpiece but it tastes as good as it looked. Please take the time to visit this place they also have samples that you can taste, I shopped around for cakes and everyone seems to run to grocery stores to get a cakes made which cost more than does cake I could not believe the price for what I got was less than grocery stores.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNVe7zOrOWjNLhxTphXh5xfpS3vS0T2Bvais3mm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPvfzkZCFCXpImiFT1YR0PzaDxr2C56af5FCkZv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPwo0TQguLuZjsDSuFUT8D8-BaGVZfpzyi_HDdO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwhZWoocrowGq9Z0lXbxDaql4G9TWMp2U7Oxlj=w150-h150-k-no-p"]}], "resp": {"time": 1531363140373, "text": "Thank you so much it's my pleasure"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "104866274081489556069", "name": "Aaron Streufert", "time": 1621099731218, "rating": 5.0, "text": "I picked up a slice of tres leches cake for my fiancé yesterday. We had heard it was unbelievable and it absolutely was! The cake was probably among the best things I’ve ever eaten! I highly recommend cakes los comadres! As a matter of fact I already have twice today!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "109744702937548736438", "name": "Kertina Moore", "time": 1579197824307, "rating": 5.0, "text": "They made my wedding cake. It was delicious and sooo gorgeous.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMUoNLzHRM2kaqT3H0NuLduyltTyUsHyVrAQ_7j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOZ2EPORf_iQfYeRbkvxg8ZwvE-nwomFHOxUGlU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "105981578742883381713", "name": "Allison Cash", "time": 1604176749244, "rating": 5.0, "text": "The best cakes in town ! Not overly sweet . The owner is amazing ! I will be getting every cake I need from there ! A must try ! U will not be disappointed!", "pics": null, "resp": {"time": 1604179797117, "text": "Thank you so much!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "107561340885344030862", "name": "Miss Lauren", "time": 1597424004992, "rating": 5.0, "text": "I’ve ordered two tres leche cakes and they were both yummy. Vanilla with strawberry filling was delicious. Beautifully done and reasonably priced. Super sweet folks and the store looks so clean and shiny lol.", "pics": null, "resp": {"time": 1601756156969, "text": "Thank you 😊!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "102090970845445777801", "name": "Amanda Gramstad", "time": 1538146418126, "rating": 5.0, "text": "The woman who runs this business knows how bake a great cake! Tres leches with fruit in the middle and creme for frosting, oh my! Light, creamy, refreshing. My only comment is if you do not speak Spanish, ask when someone will be at the shop who speaks English and call back at the appropriate time or for a visit to discuss details when ordering a cake. Our family has ordered a number of cakes from Cakes Las Comadres. They have all been wonderful!", "pics": null, "resp": {"time": 1538147780268, "text": "Thank you so much it's my pleasure"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "107357052842983391638", "name": "Marsy", "time": 1555530714841, "rating": 5.0, "text": "When we have a special occasion, we love coming here. They have the best tasting cakes and beautifully decorated. It’s worth every penny! I’m not a fan of tres leches, so I usually get it less milky. I LOVE the frosting they put on the cakes though. Never had an issue with them. The only thing I suggest is having someone who is friendly at the counter.", "pics": null, "resp": {"time": 1555808103935, "text": "Thank you so much I is my pleasure!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "108079644375244316481", "name": "Andy Spero", "time": 1563922733370, "rating": 5.0, "text": "My daughter bought her wedding cake here. It was both beautiful and delicious (and inexpensive). Very strongly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114075508103934587162", "name": "Dean Ethridge", "time": 1418488493931, "rating": 5.0, "text": "If there is a more talented cake decorator in Birmingham AL I'd have to see it.  These ladies are amazing at what they do.  The cakes taste fantastic in addition to being beautiful.  You'll love Cakes Las Comadres", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114152876734595433291", "name": "April Edwards", "time": 1437680507218, "rating": 5.0, "text": "Very talented cake decorators. My daughter's cake was beautiful. I'm getting ready to order my son's cake now. If you need a cake, give them a try. They will not disappoint!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "104880016430391988909", "name": "Salimah Shamsuddin", "time": 1498188037052, "rating": 5.0, "text": "Laura did an amazing job with my wedding cake! It was beautiful and delicious! This is by far one of the best bakeries Birmingham has to offer!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "100373709386963220994", "name": "Chase J (TheChaseJohnston)", "time": 1533092628267, "rating": 5.0, "text": "I love everything about Cakes Las Comadres! The empanadas are amazing! If you haven't tried a Tres Leches cake, I highly suggest you stop by here for any of your wedding, birthday, or sweet tooth fantasies!", "pics": null, "resp": {"time": 1533901484064, "text": "Thank you so much Chase!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "104127741627521199413", "name": "Bertha Hidalgo", "time": 1439305425714, "rating": 5.0, "text": "I have been buying from Las Comadres since before they had a store front.  Their cakes exceed excellence in both taste and decoration.  They are simply the best!!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "108763947771648184972", "name": "Yesenia Benites", "time": 1552572973954, "rating": 5.0, "text": "the best cakes in birmingham the best decoration and a super work I love they are always beautiful Gracias Laura siempre más que satisfecha", "pics": null, "resp": {"time": 1554047230613, "text": "Thanks to you for choosing us!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "104286703215030791970", "name": "Randall Calhoun", "time": 1553999377224, "rating": 5.0, "text": "Great people ! Wonderful cakes.", "pics": null, "resp": {"time": 1554047264250, "text": "Thanks to you for choosing us!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "115272507457183702293", "name": "Revathi Narra", "time": 1508187343870, "rating": 5.0, "text": "Tasty cake and lovely designs, made my daughter's birthday so special...", "pics": null, "resp": {"time": 1508188687866, "text": "Thanks for choosing us"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "102094843451600996193", "name": "Jhasmin Flores", "time": 1550540738391, "rating": 2.0, "text": "Only reason I’m giving a two is because the taste was good but she did not make our wedding cake like we asked her to . Was really disappointed it looked nothing like the picture we showed her . Her excuse was she didn’t see the Cupid arrow we wanted on the cake but she took a picture and still failed to get the flower colors wrong so there is no excuse . This will be our last time getting a cake there . It was suppose to be a valentine theme cake but nope didn’t look nothing like a valentine cake .", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "113254382991738691931", "name": "Jaber Alnajar", "time": 1589466595656, "rating": 5.0, "text": "The best in town", "pics": null, "resp": {"time": 1591514520745, "text": "Thank you so much"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "117265833322624583507", "name": "Jesie Lawrence", "time": 1348862703285, "rating": 5.0, "text": "These ladies make some amazing cakes. They look beautiful, but they taste even better. So far I have had 2 chocolate Tres Leches cakes, one with peaches and nuts inside and one with strawberries (in between the layers). The icing is so light and fluffy, and the cake itself is so moist and delicious having been soaked in milk. The whole experience is delightful. They also have candles and cake accessories in the store, which is very helpful. I also had a few of the fruit-filled empanadas from the display on the counter, which were pretty tasty. If you're ever near Chandalar in Pelham, you've got to check them out!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "106196595220967294953", "name": "Michael Kihiu", "time": 1454778155711, "rating": 5.0, "text": "Mwaaaaa. Cakes  can't be  better than that at this place i just love their cakes.", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114376005305438826514", "name": "Edwin Leal", "time": 1437167561899, "rating": 5.0, "text": "Excellent flavor, very good looking cakes and made on the spot!!!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "111378693855385155892", "name": "Drew Templeton", "time": 1466283027411, "rating": 5.0, "text": "Super friendly people, amazing cakes.", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "108700877453231243682", "name": "Mariyam Tazhiba", "time": 1479107767892, "rating": 5.0, "text": "Great service, great cakes and great people!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "116774274507625637814", "name": "PATTY MOON", "time": 1581016703957, "rating": 5.0, "text": "(Translated by Google) 🦋Its taste is second to none and that I hardly went for the test that I will ask for for the next few months the very kind Susanna lady explained everything to me so I think I will order my cake here 🎂 (they should have more variety and more full counters) the designs that They showed us they are super cute\n\n(Original)\n🦋su sabor es inigualable y eso que apenas fui por la prueba del que pediré para los próximos meses la señora susana muy amable nos explico todo así que creo ordenaré aquí mi pastel 🎂 (deberían tener más variedad y más llenos los mostradores)los diseños que nos mostraron son súper lindos🦋", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPjqwjSy-rljMGpVvonl3znnYEDaA9Hx4_qHAad=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjHfdif_eKq--DEQsSrRwOw1uXOR7Hj-yT5Dhx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGOX9Asg7lhSVu6wMmYl6tbf70NzApWIispjYO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxxuX4ZBBaAReqqR7nzUqf88nEWzg6wwRxRvvv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO06uVyURUV3rjR3gly3nFroWzZOMWLf2vpqJJo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOej84KBjhwY6ftPEZST_L0keQwxV0Cex9lF2Sx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdZBGg8hDdWB5GrHltan-YceL--EdLZZNq8NU7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpNX_Pa4heFegkbypg3RZFtwFQLJEMeeqEIrWY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "105336666305356261329", "name": "AlexZandra Sanchez", "time": 1599367797598, "rating": 1.0, "text": "(Translated by Google) We ordered a cake in his store and when we finished singing happy birthday to our daughter, as a tradition, we pushed our face in the cake, but our daughter said no, this hot is hot she was trying to tell us something, so I touch the sheet green. to show that it is not hot and it turned out that there was a toothpick covered in frosting, we were all in shock, we were about to turn its face into toothpicks next time you make a cake like this, you need to inform the customer that it is made with toothpicks before someone is sent to the hospital\n\n(Original)\nPedimos un pastel en su tienda y cuando terminamos de cantarle el feliz cumpleaños a nuestra hija, como tradición, empujamos la cara en el pastel, pero nuestra hija decía que no, esta caliente está caliente estaba tratando de decirnos algo, así que toco la hoja verde. para mostrar que no está caliente y resultó que había un palillo cubierto de glaseado, estábamos todos en estado de shock, estábamos a punto de convertir su cara en palillos de dientes la próxima vez que hagas un pastel como este, debes informarle al cliente que está hecho con palillos de dientes antes de que alguien sea enviado al hospital", "pics": null, "resp": {"time": 1600646174914, "text": "(Translated by Google) Better be more careful when pushing someone on a cake many of the times the decorations require us to put certain things, people find it easy to push people on the cakes without weighing the consequences and of course they blame whoever makes the cake, Be more careful and do not blame someone else for your mistakes, you have to remove all the accessories that it brings before anything else, imagine with the force that pushed her wow!\n\n(Original)\nMejor ten mas cuidado cuando empujes a alguien en un pastel muchas de las veces los decorados requieren que pongamos ciertas cosas, las personas se les hace facil empujar a las personas en los pasteles sin medir las consecuencias y desde luego culpan a quien hace el pastel, ten mas cuidado y no culpes a alguien mas por tus errores,al pastel le tienes que quitar todos los accesorios que trae antes de cualquier cosa, imaginate con la fuerza que la empujaron wow!"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "107452089089992765311", "name": "Gardelia Romero", "time": 1611103961667, "rating": 1.0, "text": "(Translated by Google) The decoration they make is very good but with respect to the cake and its consistency it is slightly raw and caked which at the time of eating it is an unpleasant sensation.\n\n(Original)\nLa decoración que hacen es muy buena pero con respecto al pastel y su consistencia está ligeramente crudo y apelmazado lo cual en el momento de comerlo es una sensación desagradable.", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "101599700476490352814", "name": "Irete Kutan Ifaokikio", "time": 1576431806550, "rating": 5.0, "text": "(Translated by Google) We were super satisfied with the order. A very good attention and a very good quality. Blessings .\n\n(Original)\nQuedamos super satisfechos con el pedido. Una muy Buena atencion y una muy Buena calidad.  Bendiciones .", "pics": null, "resp": {"time": 1576444129937, "text": "(Translated by Google) Thanks for choosing us\n\n(Original)\nGracias por preferirnos"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "112842305012846224079", "name": "Regina Prado", "time": 1462543982667, "rating": 5.0, "text": "(Translated by Google) Perfect .... delicious ..\nAnd the store has a score of 10 for sanitary surveillance\nYou are to be congratulated..!\n\n(Original)\nPerfeito....delicioso..\nE a loja tem nota 10 pela vigilancia sanitaria\nVoces estão de Parabens..!", "pics": null, "resp": null, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "114484673889582766833", "name": "Conny Ballesteros", "time": 1560540985992, "rating": 5.0, "text": "(Translated by Google) Very delicious cakes especially the reindeer with flan ..\n\n(Original)\nMuy deliciosos pasteles en especial el reyeno con flan ..", "pics": null, "resp": {"time": 1560604874758, "text": "Thanks for your comment !"}, "gmap_id": "0x8889238ca7710f71:0x4665bee13e9e70e9"}
{"user_id": "105190787710437783547", "name": "Jason Abraham", "time": 1628297662574, "rating": 4.0, "text": "Quality of the product was excellent.   Ordered same day and was ready at requested pickup time. Decoration and taste was really good.  They're definitely proud of their product $$$... but it's worth the expense for special occasions.   Recommend the double-decker number/letter cookie cakes, but be prepared to pay higher than usual for.their quality.   Picture attached.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNm8GyltyMmSi2YwZOkNJ2-Cl77uhLcwDFiMkdu=w150-h150-k-no-p"]}], "resp": {"time": 1628624325926, "text": "Thank you for the review. We hope that you come back to visit soon and have a 5-star experience! 😁"}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "114459992692368973433", "name": "Jean fancher", "time": 1625786059797, "rating": 4.0, "text": "I called and placed an order for a cookie cake, the day before I needed it. The guy that was helping me was very nice. It looked just as I had hoped. My only thing is I wish the cookie was not so thin. Thanks!", "pics": null, "resp": {"time": 1625860850010, "text": "Thank you for the review. We hope that you come back to visit soon and have a 5-star experience! 😁"}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "111016148056822583245", "name": "Sticky Waffles", "time": 1622383752854, "rating": 5.0, "text": "This place took care of me when the other location would not.", "pics": null, "resp": {"time": 1622586847936, "text": "We are so glad that we could help! Thank you for the stars!"}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "107149636991215245418", "name": "Brandi Witdabutt", "time": 1571533967699, "rating": 1.0, "text": "Being a business owner I understand how hard it is to find quality employees. But at some point a line has to be drawn. When you have employees (Derek) who threaten customers with violence something needs to be done. When the manager on duty can’t even handle a customer complaint or diffuse a situation, the company has training issues. To even begin to think that I’ve given a company with such deplorable employees any of my money is hard to even fathom. Ntm, how they behave & speak to customers.", "pics": null, "resp": {"time": 1571756081486, "text": "Brandi, we are sad to hear that you had less than a 5 star experience. Please know that we have informed the franchise owner as each location is independently owned and operated."}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "100095947932001976987", "name": "joshua fagan", "time": 1475042859642, "rating": 5.0, "text": "i love working for this company!   i love the customers, i love the people i work with its great!  best place to work for by far!!  recently enrolled into their health insurance plan and i was impressed!  and the cookies taste great too!  I've worked almost a year there and i love everything about it..   :)   5 ALL DAY !", "pics": null, "resp": null, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "100300077544129567921", "name": "Kate Cockrell", "time": 1548733189859, "rating": 5.0, "text": "I’ve been coming here since I was little. Fantastic service always, the workers are always so happy to serve others. They are such patient people too, and of course, have a amazing cookies/cakes. The icing they use is legendary.", "pics": null, "resp": null, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "118310789335284200491", "name": "Christa Kimbrough", "time": 1561530070093, "rating": 5.0, "text": "This place has quality decorators and the staff are very accommodating. It stays busy here but they are very helpful and try to work with you.", "pics": null, "resp": {"time": 1564588693896, "text": "Thanks for the review and for your business Christa!"}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "111667900596299034694", "name": "Melinda Ledford", "time": 1469070357705, "rating": 4.0, "text": "We went to the smaller kiosk next to the food court and I was impressed with the selection. The service was very friendly and efficient. The prices are definitely a little steep for what you get but the cookies taste good. I will be back to try some of their other varities.", "pics": null, "resp": null, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "103735408702231796696", "name": "flea r", "time": 1563844835967, "rating": 5.0, "text": "The workers really made my nieces day! We dropped a cake we got from Publix, they weren’t going to be able to fix it, my niece was in tears, I called the cookie store and they got one to us in 20 minutes! Unicorn and all!", "pics": null, "resp": {"time": 1564588653843, "text": "Hi Flea, thank you for letting us know about your experience with our store. We're so happy we could make her day!"}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "100849351687244806784", "name": "Amanda", "time": 1591377310960, "rating": 5.0, "text": "Yummy cookies!", "pics": null, "resp": {"time": 1578339436105, "text": "Amanda, thank you so much for the 5 star review! We appreciate you."}, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "101623660969369222366", "name": "alfreda williams", "time": 1526758664214, "rating": 1.0, "text": "If your black they will ignore you.", "pics": null, "resp": null, "gmap_id": "0x88892216d952074d:0xd9679a5673cdce98"}
{"user_id": "106829323411791173126", "name": "Kelsey Walk", "time": 1628297840770, "rating": 5.0, "text": "I am super impressed with this location. They were already closed (by 45 minutes) this evening and we stopped by for cookies with our two kiddos. We realized the doors were locked and our kids were super bummed and began to cry. A sweet lady from inside hear them and came to open up the door, offered them cookies, AND a ring. It’s things like this, going out of your way when it’s not necessary and no one is watching, that makes me want to give you all my business.", "pics": null, "resp": {"time": 1628624340949, "text": "Thank you for the 5-star review! We really appreciate you! 😊"}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "102266321943470242548", "name": "Marleigh Carden", "time": 1618774274823, "rating": 5.0, "text": "Had an unfortunate experience at the Gadsden Highway location where they claim they did not get my order. The ladies at the Pinnacle location were able to get my cake together and decorated quickly and were a pleasure. Renee did a great job decorating and making up for the experience at the other location. I will order from here only from now on!", "pics": null, "resp": {"time": 1618865254252, "text": "Hi Marleigh, we are happy to help! Thank you for the 5 stars. We appreciate you."}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "110497733240262969549", "name": "carol", "time": 1621976348554, "rating": 5.0, "text": "to the lady working who made my cookie cake- thank you! it is a spitting image of my friend’s pet dog. i will definitely be coming back to this location :)", "pics": null, "resp": {"time": 1622060429274, "text": "Thank you for the 5-star review! We really appreciate you! 😊"}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "118097603647985516803", "name": "John Hinkle", "time": 1619904431527, "rating": 1.0, "text": "HAVE A SIGN ON THEIR DOOR BUT DO NOT ENFORCE MASK WEARING - OBVIOUSLY DO NOT TAKE HEALTH SERIOUSLY", "pics": null, "resp": {"time": 1620075730173, "text": "Hi John, we are so sad to hear that you did not have a great experience! Maintaining a safe and healthy work environment is very important to us, this is why we are continuing to monitor and evolve our operations based on guidance from public health officials and government agencies, including the CDC and the WHO, as well as the National Restaurant Association."}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "110056927089602563226", "name": "L Cannon", "time": 1594767003076, "rating": 1.0, "text": "This is like my third time coming to the store I keep ordering chewy pecan supreme cookies and instead of them saying they don’t have the cookie they keep selling another type of cookie I used to love this place  I’m never going back", "pics": null, "resp": {"time": 1595011863234, "text": "L, we sorry for the confusion and the inconvenience. There are two different pecan cookies. Pecan Supreme is chocolate chip with pecans and Chewy Pecan is the chewy batter topped with pecans. They do carry both flavors. If there are any issues with the Pinnacle location, the manager there was made aware of this complaint and will be happy to help you."}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "107005178117552538315", "name": "Jared Boike", "time": 1570560756870, "rating": 2.0, "text": "It's ok, but half of the cookie flavors aren't correct at all. For example, the mocha salted caramel cookie has absolutely NO mocha taste whatsoever. It just tastes strange and extremely artificial. Same for the liquid chocolate cookies they just taste like artificial sweetener. The double chocolate tastes great as it should, it's just some of their cookies are strange and artificial.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "102455356280058287391", "name": "Candace Griffith", "time": 1569012687549, "rating": 1.0, "text": "I was craving cookies and found this location at the strip mall but was quickly disappointed by poor customer service today (9-20-19). The woman working today at 3:30pm seemed annoyed and reluctant to assist me in selecting a cookie. When I told her I had changed my mind altogether about purchasing anything she proceeded to roll her eyes and walked away. This is the first time I have ever experienced such poor service at a Great American Cookies location and I do not plan on returning if she is a reflection of how customer service is handled at this location.", "pics": null, "resp": {"time": 1569775811614, "text": "Hi Candace, we're sorry to hear about your experience at our store. Customer service is one of our top priorities. We will look into this issue immediately to ensure that it does not happen again in the future. Thank you for the feedback!"}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "111352543714677282942", "name": "XX DOD 2", "time": 1581990785959, "rating": 5.0, "text": "Great place, had a nice sale going on and even had a gluten free varient for my mom who has a gluten intolerance.", "pics": null, "resp": {"time": 1582063834681, "text": "Hi XX! Thank you so much for the kind review and 5 stars! We truly appreciate you!"}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "104499933343570522602", "name": "James Land", "time": 1571781480398, "rating": 5.0, "text": "All of the employees are very nice, ive been doing construction on the new dental office next door and these ladies have been great! We are over there at least 10+ times a day getting our refills and cookies!!! Thank ya'll so much.", "pics": null, "resp": {"time": 1571858321777, "text": "James, thank you so much for the kind review and 5 stars! We truly appreciate you! 😊"}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "105202169882224114079", "name": "Nancy Hall", "time": 1532201468970, "rating": 2.0, "text": "When I ordered the cookie cake I asked for a small cookie cake.  When I arrived it was a large one.  When I told her I ordered a small she said they only had large at that location.  I feel she should have told me that when I ordered it.  I also asked her when it was baked and she said that morning.  No way had it been baked that morning.  It was pretty dried out when we ate it.  I will go somewhere else next time.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "104459817084093347551", "name": "Vincent Bell", "time": 1526238292628, "rating": 1.0, "text": "When we first arrived the lady working in the back sneezed in her hand and continued preparing cookies. I ask the lady in the front does she have any chewy fudge Supreme and she told me yes we do and the lady in the back shouted and told us that we cant have them because they cant serve hot cookies. The employees in the front was about to give us the cookies and the lady in the back raise her voice saying we couldn't get them. I feel like the lady was being rude and disrespectful and I will NEVER return to spend my money.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "113617223430777266584", "name": "Hartley Moon", "time": 1573242519194, "rating": 4.0, "text": "Pretty amazing place with great staff. I wish they would make more peanut butter cookies they are always out.", "pics": null, "resp": {"time": 1573498909337, "text": "Hartley, thank you for the review. We hope that you come back to visit soon and have a 5 star experience! 😁"}, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "103421374561773136441", "name": "D'Ana Boyd", "time": 1537049732068, "rating": 1.0, "text": "How in the world can I order a cookie 24 hours in advance if you all never answer the phone at the Trussville location. My Groupon is for Trussville and I don’t need to set a reminder to call you back ANSWER THE PHONE!", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "113944546268311670012", "name": "Linda Parrish", "time": 1440950408465, "rating": 5.0, "text": "My granddaughters can't pass it with out stopping in for a double sugar cookie with  icing  in the middle. Their cookies make a sweet little surprise gift for someone on your special list.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "110204101561902104181", "name": "BAY-BAY 3", "time": 1478284641346, "rating": 1.0, "text": "There normally good but this day there horrible cookies are hard as a rock. Disappointed in them..😭😭😭😭😭😭 I might have to go to the galleria to get the best cookies. But they are way to far just cookies but I have to do what I have to do....", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "112231102303696505650", "name": "Kk B.", "time": 1516491277766, "rating": 1.0, "text": "The service was terrible I asked for strawberry  and coke and she gave me something other than what I asked for and she handed me a watered down icee. I came in there to take the icee back and the other girl took the icee back didn’t even say “Sorry ‘bout that” and didn’t hand me the icee just sat it on the counter just like her co-worker did🤨 talk about rude", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "102971714075097900675", "name": "dannette shepherd", "time": 1490231020164, "rating": 1.0, "text": "Never have any cookies cooked and they never cook any more. I always walk out without.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "102520452201728765163", "name": "Tyler Hand", "time": 1472145488249, "rating": 2.0, "text": "The woman had no idea what i was saying the entire time i was there. I had to repeat myself several times and she got rude when i had to keep saying it over and over. I hope the cake turns out well when we pick it up.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "111625764152107590895", "name": "James “XDMAN” Nicholas", "time": 1481784738882, "rating": 5.0, "text": "Cookies are great especially if you have a sweet tooth.", "pics": null, "resp": null, "gmap_id": "0x88890dc866f28e5d:0x513aa6fe635e7b74"}
{"user_id": "106711418637317555496", "name": "Kim Reid", "time": 1610386890876, "rating": 5.0, "text": "My Birthday 🎂 Cake was fabulous! 🤯🥳", "pics": null, "resp": null, "gmap_id": "0x887d49ca9d98d4b9:0x5b94ae92134855b1"}
{"user_id": "114631179346777511211", "name": "kathryn wisdom", "time": 1609909169764, "rating": 4.0, "text": "Nice selection", "pics": null, "resp": null, "gmap_id": "0x887d49ca9d98d4b9:0x5b94ae92134855b1"}
{"user_id": "114610798663657237046", "name": "Dave In Alabama", "time": 1604757768785, "rating": 5.0, "text": "Fresh selection", "pics": null, "resp": null, "gmap_id": "0x887d49ca9d98d4b9:0x5b94ae92134855b1"}
{"user_id": "106439836894419083479", "name": "Toni Lachapelle", "time": 1628441782478, "rating": 5.0, "text": "Love the cookies. Ordered a cookie cake for my daughter's birthday", "pics": null, "resp": {"time": 1628624587654, "text": "Thank you for the 5-star review! We really appreciate you! 😊"}, "gmap_id": "0x888bb1155d2fdc9f:0x160e6fbf13f6b2f"}
{"user_id": "111489408309885172471", "name": "Barbara Woodward", "time": 1498004433203, "rating": 4.0, "text": "They are a little expensive for cookies but you can't beat that quality. So tasty! Quick service.", "pics": null, "resp": null, "gmap_id": "0x888bb1155d2fdc9f:0x160e6fbf13f6b2f"}
{"user_id": "106280868693830465338", "name": "Nicole Shultz", "time": 1619375413828, "rating": 5.0, "text": "Absolutely amazing experience!  They were able to take a couple photos I found on Pinterest and create the most amazing creation for my daughter’s 6 year old birthday!  Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "115521380385023792432", "name": "Judy Johnston", "time": 1612671959083, "rating": 5.0, "text": "Family owned and operated. All goodies are homemade fresh. I love everything! Birthday cakes are fresh, moist and flavorful as well as beautiful! I am really partial to the giant chocolate chip & peanut butter cookies and scones.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "106238658185376379736", "name": "Amanda Bishop", "time": 1610048213450, "rating": 5.0, "text": "I visited here today for the first time in a long time. I used to stop by here after high school for a Cranberry and White Chocolate scone, and wow are they just as delicious as I remember! This place is worth a stop. Very kind staff, I’ve never had a bad experience", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "109772249020291721277", "name": "Mallory Meriwether", "time": 1613596098136, "rating": 1.0, "text": "NEVER AGAIN! I just walked in there to get my 4 year old daughter one of their Signature Milkshakes that you see in the photo above. When we walked in they said that they were too busy make one of these milkshakes for my daughter. There were zero customers in the store.\n\nMy daughter left the store crying. They did not seem to care in the slightest. Don’t advertise something that you are too “busy” to make.", "pics": null, "resp": {"time": 1613597453829, "text": "Sorry we were not able to accommodate you.  We lost a day due to the storms and we were short staffed.  We were still preparing cupcakes and filling our cases as was stated.  I can't prepare a Milkshake without everything that is needed to go on it. Sorry for the inconvenience"}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "108657627053446658077", "name": "Lauren Braxton", "time": 1563630725174, "rating": 5.0, "text": "Everything tastes amazing, down to their homemade whipped cream! The milkshakes are out of this world, and you can’t beat their awesome customer service! Love Tee’s!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfpFMVvD_WQg0TBBBVVbbnVBqTh0HvHgxir4O-=w150-h150-k-no-p"]}], "resp": {"time": 1564154209030, "text": "Thank you so much for your review of our business.  Your opinion means so much to us.  So glad you enjoyed your shake,  and our customer service.  We hope to see you again soon."}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "106219260829565428232", "name": "Steven Jemison", "time": 1607208524485, "rating": 5.0, "text": "Just heard of this place a few weeks ago, this was the second trip here!!! They have so many choices I just want one of every thing , had the mini strawberry cake last time wow!!!!! Tried the mini key lime pie this time, and a peanut butter brownie,  chocolate chip cookie and a toffee crunch cookie. After reading the other reviews I have to say the staff here was very friendly the two times I went in.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "114864396076719746743", "name": "Red Stepchild", "time": 1508790694701, "rating": 5.0, "text": "** HUBBY got out of Trouble w/ Tee's Cupcakes. **\nMy Hubby forgot what day it was. In a panic, he visited Tea's and they SAVE HIS HEINNEY with a fabulous Glamorous cupcake that was so AMAZING that I couldn't believe he found these. As I type this review, my co-worker (another husband panicking \"What do I but my wife for her birthday\".. he is looking at Tea's website and drooling. A great lil gem of a place. Thank you from David & Stephany Henson.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMHpjzsUl4hISsYmYsV0G7vvJhQtVM4FEe6BgH5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "100923731928502582520", "name": "Chad Beasley", "time": 1592057911992, "rating": 5.0, "text": "We stopped by and got a few treats and everything I tried was amazing! The heath bar cookie and cherry danish were SOOOO good! I didn’t try the gigantic cupcakes but they looked incredible! They also have ice cream and over the top milkshakes. We will be back!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "109372217053533667982", "name": "Darryl Peterson", "time": 1554845929268, "rating": 5.0, "text": "I love this place!  I do not go as often as I like because I cannot afford the weight gain it would cause.  Everyone that has helped me has been wonderful.  I think there is a \"feel\" here that you find when the people truly love what they do.  The selection may be smaller than other bakeries, but that is what I expect for a small, hometown bakery - quality over quantity.  Even then, I'm sure that if I requested anything in advance I could get it.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "109853873275400496645", "name": "Art 2 Leo", "time": 1559325100840, "rating": 5.0, "text": "Customer service💯...Oreo cake👌🏾...Peanut butter cake/cupcakes 🏁...and MUCH MORE. I was impressed upon arrival, witnessing one of the owners assist a customer to the car, with a beautifully decorated cake. GREAT PLACE.I’d give them 6 stars..", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "113162975416086764514", "name": "Joey Williams", "time": 1564086194515, "rating": 2.0, "text": "Tried to order a Birthday cake for my daughter, was flat out told they could not get to it even with several days advance notice.  I have been faithful to this company since the first day they opened, but would not buy another thing from them, nor recommend them to anyone.", "pics": null, "resp": {"time": 1564087976106, "text": "Hello Joey thank you for your review. You just called about 30 minutes ago, if I'm not mistaken,  and asked the owner for a cake tomorrow(not advanced notice). We were more than happy to get you a traditional cake,  but you were wanting a custom designed cake.  I am completely booked on any custom cakes.  I try my absolute hardest to squeeze in as many last minute orders as I possibly can,  but I have a limit and there are people who order weeks and months in advance and I must honor their orders first.  I do apologize that we were not able to accommodate your request."}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "111825815351615532006", "name": "Greg Mattes", "time": 1528773984492, "rating": 5.0, "text": "Order a custom cake, yellow cake with fudge filling and chocolate buttercream for my wife’s b-day. She said it is one of the best cakes she has had. Cake was moist, fudge filling was awesome and the chocolate buttercream was not to sweet but had lots of flavor. Lots of other desserts and pastries to try here. She is waiting for the next occasion so we can order another cake. They were very good at getting this cake for me as it was on short notice a little over a day. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "108427410866013416782", "name": "Scott Wheeler", "time": 1466019973014, "rating": 5.0, "text": "Great place with great food and great people. They stayed open almost an hour late just so my girlfriend and I could meet up from different parts of the state and eat there. Cheap and delicious, will definitely return", "pics": null, "resp": {"time": 1474639963592, "text": "Thank you very much for stopping by.  So glad you enjoyed your experience and sweets with us.  See  you soon."}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "110388813777222856796", "name": "Lexx Slays", "time": 1474641411933, "rating": 5.0, "text": "This place is absolutely amazing!!!!! Clean,  friendly,  welcoming atmosphere.  The pastries and sweets are to die for!!!! Not only are the cakes and pastries beautifully decorated they also taste amazing.  The absolute BEST place in town!!! If you haven't been GO!!!!", "pics": null, "resp": {"time": 1474641864941, "text": "Thank you so much for reviewing Teescakes&pastries. So glad that you enjoyed your experience with us.  Looking forward to seeing you again"}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "104827453979951235000", "name": "Marsha Carr", "time": 1560550992577, "rating": 5.0, "text": "Customer Service as well as the desserts was amazing.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "104768961060747247305", "name": "Karen Leonard", "time": 1614794502157, "rating": 5.0, "text": "Anointed", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "101638412077953735770", "name": "gavin ragland", "time": 1547999016615, "rating": 5.0, "text": "The owner has years of experience decorating, and she is a really good person.", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "114049039401304888414", "name": "Kala Patterson", "time": 1597359998006, "rating": 1.0, "text": "Very rude & poor customer service !!!", "pics": null, "resp": {"time": 1597389086932, "text": "Hello Kayy. I'm sorry you feel you had a bad experience. You left a bad review because we were not able to produce a custom cake with an extremely short notice.  You called first did not have a guest count, cake design, nor a photo of what you wanted and expected a price.  You then sent a photo late Thursday evening via Facebook after  closing hours and needed the cake produced on saturday.  I simply told you no that I was booked. Please learn proper etiquette when inquiring services. We were not being rude , we were trying to get further information from you.  Be blessed."}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "107945952343741186435", "name": "Carla Hogan", "time": 1568866709051, "rating": 5.0, "text": "Holy milkshake , Batman!!! Fantastic", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "110859827044490457107", "name": "Jack Ferrell", "time": 1468543501729, "rating": 1.0, "text": "THIS PLACE WAS GROSS ! THE CUPCAKES ARE JUST FAT AND NOTHING BUT ICING THAT TASTES GROSS! The food gave my whole family a stomach ache ! Never eat dinner there!", "pics": null, "resp": {"time": 1474640517670, "text": "Thanks for your response.  We stand by our products 100% if there was an issue,we would have gladly refunded you for any goods you were not satisfied with or replaced them with something that you would have enjoyed.  We only sale baked goods and pastries at this time, not dinner items."}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "117388340111824766917", "name": "betty seltzer", "time": 1563393794823, "rating": 5.0, "text": "The food is excellent!!!!", "pics": null, "resp": {"time": 1564154236139, "text": "Thank you so much for your review of our business.  Your opinion means so much to us.  We hope to see you again soon."}, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "113443140309420768332", "name": "April Poe", "time": 1516493267521, "rating": 5.0, "text": "Best place for desserts", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "105804752050176339620", "name": "Natan Jackel", "time": 1535726562905, "rating": 5.0, "text": "Sweet", "pics": null, "resp": null, "gmap_id": "0x88893ef66a006d49:0x6b2cb7ddeecc4503"}
{"user_id": "112041440189907781211", "name": "Kanae Malbrough", "time": 1615302963785, "rating": 5.0, "text": "We used her service for our Wedding 2020 Feb. before she had her store front in Fairhope. She was very personable and very thorough. Gave us the Sample of flavor (there was a minimal cost but really low cost) on cupcake and we had fun tasting every one of them. We just wanted simple two tear cake (flower were out by us lol) and the cake was delicious!\nHer store in downtown sells cookies and cupcakes now, they are all so good!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM7Jkl5_E2lP4xSVChsiZkMKoA3Cj8Tqc_FEFnX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPETCvG3DaZoOP6JAF5ISWE7br6ah8RC2dOTUgb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_-zDK8aL_zPAvLWHh_p7RHSHs10X7j31pitDo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMXSxQzaGw9b0qppP61pvAWW29cQtwtC7FTQW0j=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "113201579604041302758", "name": "Serena kay", "time": 1627968696655, "rating": 3.0, "text": "On Aug 1st i contacted them for a  cake on Sept 10th.  I got a reply that they are booked till November.  I will have to take my business elsewhere.  Just an FYI to anyone that wants to do business here.", "pics": null, "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "108649179189931536034", "name": "J Ball", "time": 1613086659611, "rating": 1.0, "text": "I traveled over 1200 miles to Spanish Fort to celebrate my mother's birthday. I researched this web site, which states I can order a \"regular signature cake\"...NOT a custom cake...with a min of 72 hours notice. I then traveled 30 minutes to see the cakes and give 5 days notice for a simple pecan cake for my mother. I was dismissed with a \"sorry it's a holiday week\". I reminded them their site states 72 hours, and we had 5 days. I was quickly informed \"with availability.\" I double checked, and nowhere does it state \"with availability.\"  Thanks for wasting our valuable time and providing poor customer service. Do not recommend. Dr. Ball", "pics": null, "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "100619799368159666721", "name": "Matthew Joyner", "time": 1595217054547, "rating": 5.0, "text": "Brittney did an excellent job with our wedding cake. We did a cake tasting, showed her a picture of a cake that we liked from pintrest, and she blew it out of the water! The cake turned out better than the picture we showed her. She set it up beautifully and helped us with everything we needed. Perfect for any wedding!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM_XT1h42H4_ciH0mVNVvbgHmzakEhQS0CKCtAo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "116563650265799085625", "name": "Lauren Tilton", "time": 1621697232155, "rating": 5.0, "text": "They went out of their way! I arrived 5 mins before closing and they kindly offered to frost some cupcakes meant for the next day. Made my mom’s bday! So appreciative! The cupcakes were delicious!", "pics": null, "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "105483069876778988960", "name": "Ray Reynolds", "time": 1604770225361, "rating": 5.0, "text": "We visited @sugarhousefairhope today and met the owner Brittney. We’ve booked our wedding cake with her but just had to try the cupcakes & cookies. I had the BEST cupcake I’ve ever had in my life. Hands down. The Peanut Butter cupcake, topped Reese’s pieces, was outstanding! The peanut butter icing was so scrumptious. My fiancée had the wedding cake cupcake and loved it. Wow! Friends, these are #musthave #cupcakes.", "pics": null, "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "106760138337838376327", "name": "Ava Abbott", "time": 1577115002217, "rating": 5.0, "text": "I had a wonderful experience! The two girls who were distributing the cookie boxes I bought were just the sweetest. The cookies tasted so good and I want to know how she made the icing taste so good!", "pics": null, "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "114071742901409555135", "name": "Alan Evenson", "time": 1602354908822, "rating": 5.0, "text": "Tastes amazing! Definitely going back!", "pics": null, "resp": null, "gmap_id": "0x889a15f8a1dfa75d:0x1d188082173796db"}
{"user_id": "111617781690299920723", "name": "Amy Stewart", "time": 1554566048662, "rating": 5.0, "text": "She is so sweet, easy to work with, always helpful and her cakes are heavenly!! I have never heard a negative comment about her cakes and cookies. Her decorating is amazing!! We have been using her for 8 years! We will never go anywhere else!! Love love love her!!", "pics": null, "resp": null, "gmap_id": "0x888e9ac35dd7c3cd:0x78b34773d7e5d3d7"}
{"user_id": "106870690191683774507", "name": "Jordan Moore", "time": 1541200546529, "rating": 5.0, "text": "The staff at this place was amazing and helpful. The cake and cookies (Frozen) we’re top notch, and my daughter thoroughly enjoyed them. Excellent local business that has great service.", "pics": null, "resp": null, "gmap_id": "0x888e9ac35dd7c3cd:0x78b34773d7e5d3d7"}
{"user_id": "100555881691113775415", "name": "Ann Wooten", "time": 1528166349790, "rating": 5.0, "text": "This is the only bakery you need to remember! Never will I go anywhere else for any of my cake needs! I love this place! Professional , warm, welcoming & above all is appreciative of your business  !! Wish I could give more than 5 stars", "pics": null, "resp": null, "gmap_id": "0x888e9ac35dd7c3cd:0x78b34773d7e5d3d7"}
{"user_id": "112383695324321492673", "name": "Jeslyn Raetz", "time": 1534801730778, "rating": 5.0, "text": "I had a strawberry cupcake from here and it was delicious!!!! The icing tasted just right and the cake was moist and perfect!! I was very satisfied!!!", "pics": null, "resp": null, "gmap_id": "0x888e9ac35dd7c3cd:0x78b34773d7e5d3d7"}
{"user_id": "114383230800668394786", "name": "Kc Hugz", "time": 1517937029541, "rating": 5.0, "text": "These cakes are Aaaamazing!!! Cake is perfect and icing is to die for!!! So good ! You won’t be disappointed!!!", "pics": null, "resp": null, "gmap_id": "0x888e9ac35dd7c3cd:0x78b34773d7e5d3d7"}
{"user_id": "105101713535821576734", "name": "William Somar", "time": 1566257622748, "rating": 1.0, "text": "Out of business", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQecalk-YQi4GNP0z1CMwnNfosrpbyuCubFtY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e9ac35dd7c3cd:0x78b34773d7e5d3d7"}
{"user_id": "113485344350477658362", "name": "Carrie Harville", "time": 1603505326330, "rating": 5.0, "text": "We have LOVED everything we have ever gotten here!", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "115863140599050597099", "name": "Lisa Wilson", "time": 1593375893525, "rating": 5.0, "text": "Simply Cakes is the best cakes . There cakes are moist and delicious. I always order the blueberry cake it's my favorite.", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "115202098533861463475", "name": "Roy Snipes", "time": 1543804402215, "rating": 5.0, "text": "Stopped in on a weekend trip from Georgia. We hit a gem. Bought a peanut butter cake and chocolate pie.\nMY LORD...i was in heaven. Absolutely awesome.\nSome sweet ladies that certainly knows how to bake.\nI will be back. ..count on it", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "102432075093513623874", "name": "Lawanda Harris", "time": 1586058221793, "rating": 2.0, "text": "The cakes were so nasty...and red velvet cake tasted awful.Caramel cake the icing looked as if it sshould have been chocolate icing,very dry too.Please be careful bc I spent $80.00 for nothing.Very displeased.NO, NO ,", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "115174219568202084996", "name": "KNIGHTHAMMER YT", "time": 1565978898934, "rating": 5.0, "text": "The lunch was Amazing!!!!!!! Try the trio ... had chicken and  brocolli  crepes,  quiche,  and tomato  bisque  soup( my favorite). The ladies  that run the place were  so sweet . Will return  soon!", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "101420904842790536286", "name": "Charlene Lamb", "time": 1524702765885, "rating": 4.0, "text": "Food choices are very good.  Cost is pricey.  Overall enjoyed my visit.  The food is delicious.  Will visit this place again", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "104305883168112923045", "name": "Ben Leyton", "time": 1547143978693, "rating": 5.0, "text": "Their lunches are excellent. Love the Chicken Devane crepe. Cakes are out of this world.", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "106194112204018133946", "name": "Susan Frichter", "time": 1518645251680, "rating": 5.0, "text": "Everything I have tried has been wonderful!  Great for every day or special occasions!  Try them you want be disappointed!!!", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "103756685707585956917", "name": "Diane Thomley", "time": 1537331076456, "rating": 5.0, "text": "Great food!!", "pics": null, "resp": {"time": 1537373677068, "text": "Thank you we appreciate your business"}, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "115141449701274826333", "name": "Deborah James", "time": 1501706418753, "rating": 5.0, "text": "Great, delicious homemade cakes.", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "116960568278792636217", "name": "Daniel Mathis", "time": 1518716635533, "rating": 5.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "118377688368647538297", "name": "Alice Barfield", "time": 1523562061662, "rating": 5.0, "text": "The chocolate layer cake is devine", "pics": null, "resp": null, "gmap_id": "0x88928c78a30f579b:0x62aa2a426e440fd"}
{"user_id": "103908041192790944803", "name": "Angela Yancy", "time": 1520894763281, "rating": 5.0, "text": "Laura went out of her way to make sure our cake matched our invitations, plus there was a sugar free option, too!! This makes the third time that Blissfully Sweet has exceeded my expectations. I cannot wait until my next cake order!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPJwan_1tO0EP1PRxmMknEl88qC9EC98j2k94ci=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRukYr1A84bYRWdpkxUUDHheBvK-lscTa86i3S=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a1bc3f0f15261:0xef967e0a1ce11b9"}
{"user_id": "110343569945089536483", "name": "Kim Eller", "time": 1520208072455, "rating": 5.0, "text": "I have used this business twice and both times the employees have gone above and beyond. I had them make my daughters black cake with a skull and she was so excited over it we had to force her to cut it. My sons 21st birthday is coming up in a week and I'm looking forward to  seeing the work these ladies do on it.  Thank you! Excellent job! Need something stop and just see what they can do!", "pics": null, "resp": null, "gmap_id": "0x888a1bc3f0f15261:0xef967e0a1ce11b9"}
{"user_id": "117019945411737467658", "name": "Jack Morris", "time": 1501858842976, "rating": 5.0, "text": "Blissfully Sweet ' s baked goods are amazing and their customer service is incredible.  I would highly recommend this bakery to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x888a1bc3f0f15261:0xef967e0a1ce11b9"}
{"user_id": "112327901503403682457", "name": "Kristin Watson", "time": 1544291594594, "rating": 5.0, "text": "This is now Cothrans bakery and it's awesome!  Donuts, cakes, cookies, cupcakes truffles!", "pics": null, "resp": null, "gmap_id": "0x888a1bc3f0f15261:0xef967e0a1ce11b9"}
{"user_id": "105342495388222999024", "name": "Patricia Fethke", "time": 1496107119097, "rating": 5.0, "text": "Best cupcakes I've ever had!", "pics": null, "resp": null, "gmap_id": "0x888a1bc3f0f15261:0xef967e0a1ce11b9"}
{"user_id": "105446268998149671432", "name": "Mike Fisher", "time": 1597423389476, "rating": 5.0, "text": "The cakes here are the BEST! My wife got my birthday cake from Cake Designs and it was so moist. The icing was superb and it looked great. We will have to make this a tradition.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "103680813054852191796", "name": "Michael Holley", "time": 1550948649739, "rating": 5.0, "text": "Excellent work. Awesome cake", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5WZpiqqC-BlfSJnbNqtrCIWRydL6oMXM4AF8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "115509633633785720755", "name": "Jordan Dumas", "time": 1602957295663, "rating": 5.0, "text": "if it’s not Cake Design cakes or cupcakes I won’t eat it.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "108474574503797096075", "name": "Haden P.", "time": 1505136827737, "rating": 5.0, "text": "Cake Designs makes the most AMAZING cakes!\nI have been ordering all of our family birthday cakes from Cake Designs for over 15 years and my experience has been terrific every single time.\nWhatever theme or design I have asked for, Cake Designs has always come through with a gorgeous cake. The cake artists at Cake Designs are true artists. The cakes they create are absolutely beautiful works of art. At every birthday party, people always ask where the cake came from, because it's always outstanding!\nAnd the Cake Designs cakes are scrumptious. They are so moist and light that we always order a cake that is way too big for the number of people we plan to serve, just so we can keep eating the yummy Cake Designs cake for days to come!!!!\nThe staff at Cake Designs is friendly, helpful and efficient. The cakes we have ordered have always been ready exactly when we asked for them to be ready. And Cake Designs is such a clean environment. They have albums and albums of photos of cakes they have made for every occasion imaginable. It's fun just to flip through the albums to see the gorgeous cakes they've made in the past - it's great inspiration for your current cake order.\nCake Designs is amazing and I highly recommend them for your cake needs!", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "106167694624418774999", "name": "Mrs. King", "time": 1499688512221, "rating": 4.0, "text": "The cakes are always good and they can decorate to fit your style or theme! Love Cake Designs!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNp09hhDrusnfA0Mh8kZFfzu7RFCg6Ivqco9FXN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "105112494725939023028", "name": "Mamie Douglas", "time": 1505330323704, "rating": 5.0, "text": "I found Cake by Design through googling. I used their business, to design a gender reveal baby shower cake, for my daughter. They design a baby carriage cake. My guest praise the quality of the cake as excellent. The staff was very helpful and friendly in helping choose cake colors. I highly recommend this bakery shop.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "109469799364655911884", "name": "Jordan Tunstall", "time": 1484784643723, "rating": 5.0, "text": "When I turned 25 I wanted my age on my cake. It was so pretty that every year I have to get my age on my cake. The cakes are just delicious. They Have not Let me down yet! I can't wait to see what 30 is going to look like.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "109262318504822838263", "name": "Tamara Simmons", "time": 1475003888340, "rating": 5.0, "text": "I absolutely love Cake Designs. I have always gone here for birthday cakes for my family and friends. And I have been a loyal client of theirs over the years. More recently, I entrusted Mrs. Sandra and her team with my wedding cake. My cake was everything that I could have ever wanted. And it was delicious the two little bites I had. My guest thoroughly enjoyed the cake as well. The customer service was impeccable , I now live out of town and the handled all of my request over the phone. They were so kind an warm. My family and I will always continue to use Cake Designs. Thank you for the Wedding Cake of my Dreams!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "111015437649622366599", "name": "E K Daufin", "time": 1614285889391, "rating": 5.0, "text": "The gorgeous fondant wasn’t hard. It was fresh and soft and tasty. Both it and the cake were fantastic at Meka Rice’s baby shower!", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "105684966197398955496", "name": "dorothy thomas", "time": 1552571392370, "rating": 5.0, "text": "I have visit quite a few bakery stores and sample a lot of different cakes but there isn't any that have the taste,texture, and moistness of the cakes at cake design and the icing is delicious you bring a picture and they can make a cake you can eat this is my go to bakery for all of my events", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "117336583695640594652", "name": "Brittany Dement", "time": 1436550620137, "rating": 5.0, "text": "Amazing cakes and service. We used them for my wedding almost five years ago and my sister used them three years later. The cakes are moist and the pieces we had left were the toppers that we froze for our one-year anniversary (wedding cake was 500 servings, grooms cake 200 and it was all eaten by 300 guests, people went for seconds it was so good)! I highly recommend their strawberry cake, but it is all delicious!", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "117891383157409028281", "name": "Jessica Barnes", "time": 1528353903741, "rating": 5.0, "text": "I’ve been a loyal customer for over 18 years. They are the best people in the business !", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "108999183873455291569", "name": "Thelma Calloway", "time": 1513722746824, "rating": 5.0, "text": "Tried their cupcakes for the first time❤❤❤ I was amazed! I definitely will be returning. They were so 😋 delicious. .", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "118162553957379167179", "name": "Chara", "time": 1430139424120, "rating": 5.0, "text": "I have been buying cakes from Cake Design for 12 years. They are moist and good. Great designs.They staff is supper friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "113627512950774289316", "name": "Jeremiah Collier", "time": 1469153581529, "rating": 5.0, "text": "They made a birthday cake the same day needed. Quality was excellent, service was great. I highly recommend this bakery...", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "108258318231832686642", "name": "chandrika Taylor", "time": 1536945148160, "rating": 5.0, "text": "Been ordering from Cake Design for 22yrs and I've always been satisfied.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "110599704350325662319", "name": "Holly Kelsey", "time": 1527029549200, "rating": 5.0, "text": "Simply the best and only place to get cakes!", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "115303890342453132035", "name": "Matthew Wyatt", "time": 1498583274825, "rating": 5.0, "text": "The best looking and best tasting cake you'll ever have.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "107698196442171855828", "name": "lyfes truth", "time": 1517104812635, "rating": 5.0, "text": "Birthday cakes are AMAZING", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNwN9bS7-UAI7qguJdiy57jQFK3ETvpeaCE2Ze8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "110599704350325662319", "name": "Holly Kelsey", "time": 1527029549200, "rating": 5.0, "text": "Simply the best and only place to get cakes!", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "114541467595417495253", "name": "S Bennett", "time": 1476549004644, "rating": 2.0, "text": "I recently had a birthday cake done by Cake Design, and truthfully, I was quite disappointed. Insomuch as I regret ordering it from them and will be ordering future cakes from Publix instead. The cake didn't taste like a cake from a bakery. Perhaps, I should have tried Ligers.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "115200688307753662198", "name": "Jacqueline Oliver", "time": 1512499822640, "rating": 5.0, "text": "The best. O.m.g. so delicious.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "102636985288051182389", "name": "Elaine Warren", "time": 1477066116982, "rating": 5.0, "text": "Best Red Velvet Cake I have ever had the pleasure of tasting.  Staff are always accommodating and friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "100039937376808268703", "name": "Jeanetta Fowler", "time": 1530027662399, "rating": 5.0, "text": "Cake Designs has the best cakes in town.", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "100998938003280393298", "name": "Frederick Graham", "time": 1514748581192, "rating": 5.0, "text": "My one stop for all my cake needs birthdays, anniversaries, holidays, etc....", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "113005640805764597079", "name": "Paula Harris", "time": 1503618855720, "rating": 4.0, "text": "Love", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "112783584085309971050", "name": "william carlton", "time": 1472697542949, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888c2a93e3b225f7:0x6424a7bc0def1568"}
{"user_id": "102266321943470242548", "name": "Marleigh Carden", "time": 1618774111271, "rating": 1.0, "text": "Just had a really disappointing experience at this location. Pre ordered a cake a week ahead of time and they claim they never got my order. That’s fine I understand things happen. He suggests I go up to the other location down the street and order one there. I ask him if he can call and he says he doesn’t have their number. Neither do I?! Super disappointing experience and very little concern to try and fix the situation. So do yourself a favor and order from the ladies at the Pinnacle location instead!", "pics": null, "resp": {"time": 1618866229171, "text": "We are so sad to hear that you had a less than 5-star experience! Please contact our customer service team at customerservice@gfgmanagement.com and let us know what happened or how we can improve!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "103654693506888581164", "name": "Cathy Oliver", "time": 1597183984414, "rating": 5.0, "text": "Awesome location with the best ice cream and cookies. The customer service is awesome!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPOK5Gsw3H3b6NXOjTOo-bKnrITk-h2_WX88V5u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjF8Tk9EVj-6MLWjheMits8nNqwWOPK9shTNHc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPrzH3YTapwLAKEHA0hkzbA2XKXgJCg2YWWjTj5=w150-h150-k-no-p"]}], "resp": {"time": 1597241454561, "text": "Cathy, thank you for the 5 star review! We really appreciate you! 😊"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "109649613777083227228", "name": "Jeremy Prickett", "time": 1614437241550, "rating": 2.0, "text": "Arrived an hour before closing and they had already stopped using the slab so they would not do any add ins for us. Also acted like the milkshake machine was done for the day even though I think they would have made a milkshake had we ultimately asked for one. We ended up just getting 3 cones and 1 cup, and good thing we did because there was only one spoon left. Can’t figure out how this place can’t keep plastic spoons but apparently they can’t by reading the other reviews. It would have been bad had we all got cups instead of cones.  Also smelled horrible in there from chemicals maybe. Maybe they cleaned the floors and countertops for the evening an hour before closing, I don’t know. Chairs where already up on the tables like they were closing. It seemed apparent that they were all ready to get out of there as fast as they could and we felt the same way.  We almost left without getting ice cream but didn’t want to be like. Ice cream was pretty good so 2 stars instead of 1.", "pics": null, "resp": {"time": 1614610614724, "text": "Jeremy, thank you for the feedback. We are so sad to hear that you had less than a 5-star experience! Please know that we have informed the franchise owner due to the fact that each location is independently owned and operated!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "112971846778498450668", "name": "Chip Ramsey", "time": 1623032410290, "rating": 1.0, "text": "We came in almost an hour and a half before closing time and were told they were not serving any ice cream because \"their board was draining.\" We were very disappointed, especially since we had our grandson with us and he had been looking forward to ice cream all day.", "pics": null, "resp": {"time": 1623101061973, "text": "We are so sad to hear that you had a less than 5-star experience! Please contact our customer service team at customerservice@gfgmanagement.com referencing this review."}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "116982509498663716182", "name": "Leslie Paige", "time": 1618791011596, "rating": 1.0, "text": "Horrible customer service!  Would have pick ZERO stars!!\nThey only had about 5 flavors of ice cream to pick from. Said they had to make more and they\nonly had about 10 cookies made. We expected a much better experience. Very disappointed and will not be back!", "pics": null, "resp": {"time": 1618866197299, "text": "We are so sad to hear that you had a less than 5-star experience! Please contact our customer service team at customerservice@gfgmanagement.com and let us know what happened or how we can improve!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "102453435397768891194", "name": "Deborah Rose", "time": 1619560769800, "rating": 5.0, "text": "Employees friendly and very helpful in helping me to decide. Loved my experience..", "pics": null, "resp": {"time": 1619642542885, "text": "Thank you for the kind review, Deborah! We are so happy to hear that. Come back and see us again soon."}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "101874212127178546612", "name": "LylasGirls Org", "time": 1614812962149, "rating": 5.0, "text": "The lovely ladies that made us feel welcomed, really made our visit here pleasant. The ice cream and cookies were delicious.", "pics": null, "resp": {"time": 1614888129619, "text": "Thank you so much for the kind review! We truly appreciate you. Come back and see us again soon."}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "115324538787805361455", "name": "Brandon Eriksen", "time": 1613943942914, "rating": 1.0, "text": "Awful service, ended up leaving and not purchasing anything. They were out of spoons for a woman with her 3 children ordering ice cream in cups, then after the women left they were making fun of her for asking how they could run out of spoons, unprofessional service", "pics": null, "resp": {"time": 1614089586010, "text": "Brandon, we are so sad to hear that you had less than a 5 star experience! Please know that we have informed the franchise owner due to the fact that each location is independently owned and operated!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "117404911404290043728", "name": "Abri Martin", "time": 1614180701180, "rating": 5.0, "text": "Stopped for some ice cream with my family on 2-19-2021 and we had great service and delicious icecream! Can’t wait to go back!", "pics": null, "resp": {"time": 1614183099964, "text": "Abri, thank you for the 5 star review! We really appreciate you! 😊"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "118347239170762757178", "name": "Margret Blanes", "time": 1600560722462, "rating": 3.0, "text": "I want to love it. We used to get this all the time living in Tennessee. Went here tonight and I felt like my hands were tied. The sweet lady who did the mix has some things that make it a little more difficult to complete orders. I asked for a waffle bowl - sold out. So I asked for a waffle Cone and they had that. Gave my order and she’s not able to do a true mix because of her limitations. Once “combined” I was given a cardboard bowl instead. I didn’t know what to say... and the card machines ask for tips and again didn’t know what to say... I feel like it was a lose lose situation and I wouldn’t feel that way had my order been correct and things mixed like you expect. I’m just torn.", "pics": null, "resp": {"time": 1600719341789, "text": "Margret, we are so sad to hear that you had less than a 5 star experience! Please know that we have informed the franchise owner due to the fact that each location is independently owned and operated!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "106612577696894529755", "name": "Thomas & Jennifer Pickard", "time": 1596811668119, "rating": 5.0, "text": "My wife 5 year old and 1 year old love this place for a quick weekend reward snack!  The staff has always been pleasant for us and I personally recommend an Ice cream sandwich with the oatmeal cookies and sweet cream.  Yummy!", "pics": null, "resp": {"time": 1596818930233, "text": "Thomas, thank you for the 5 star review! We really appreciate you! 😊"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "101488234064008719088", "name": "Haley Mcnutt", "time": 1595797132594, "rating": 1.0, "text": "Girls are extremely rude in this facility. Got an attitude when I told them I had asked for cone instead of a cup. Then gave me my cone with ice cream melting all down the cone. Asked for the same thing in a cup and she was going to just scoop the ice cream that was melting all over the cone and put it in a cup. I said no I would like fresh ice cream please. Rude and horrible customer service. Will not return. Spend your money elsewhere for better service and ice cream.", "pics": null, "resp": {"time": 1595864618600, "text": "Haley, we are so sad to hear that you had less than a 5 star experience! Please know that we have informed the franchise owner due to the fact that each location is independently owned and operated!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "100040014633456528104", "name": "Theresa Johnson", "time": 1619557709727, "rating": 4.0, "text": "Kinda disappointed cause they don't  serve brownies", "pics": null, "resp": {"time": 1619642562448, "text": "Thank you for the stars and the feedback Theresa! We appreciate you."}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "101313349901919891654", "name": "dominique boyd", "time": 1610160540653, "rating": 5.0, "text": "I Love Marble Slab in Pensacola and in Birmingham. My Favorite", "pics": null, "resp": {"time": 1610393384825, "text": "dominique, thank you for the 5 star review! We really appreciate you! 😊"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "102295250088403663212", "name": "Ryan Restrepo", "time": 1618791444786, "rating": 1.0, "text": "Disappointing in all facets, from the incorrect hours of operation to the incorrect orders.", "pics": null, "resp": {"time": 1618866150334, "text": "We are so sad to hear that you had a less than 5-star experience! Please contact our customer service team at customerservice@gfgmanagement.com and let us know what happened or how we can improve!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "113617223430777266584", "name": "Hartley Moon", "time": 1591014404012, "rating": 5.0, "text": "Beautiful atmosphere. Excellent friendly customer service. Of course the cookies were baked just right. Happy to be the first review.", "pics": null, "resp": null, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "104227034498342171229", "name": "Jody McCluskey", "time": 1591408456630, "rating": 4.0, "text": "Had a good experience tonight but it was really crowded and nobody was doing social distancing. Everyone was right on top of each other. The ice cream was awesome and I’m looking forward to coming back many more times.", "pics": null, "resp": null, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "101902561377353635200", "name": "David Wyckoff", "time": 1608427245944, "rating": 5.0, "text": "Great ice cream,  awesome cookies.", "pics": null, "resp": {"time": 1608582239010, "text": "David, thank you for the 5 star review! We really appreciate you! 😊"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "110056927089602563226", "name": "L Cannon", "time": 1594958254366, "rating": 1.0, "text": "I have ordered twice and both times they sold me the wrong cookies no chewy pecan supreme if you order them they’ll give you chocolate chip with pecans instead of saying we don’t have that flavor anymore and of course with everything going on you can’t return them I won’t be going back that’s horrible service", "pics": null, "resp": {"time": 1595011860048, "text": "L, we are so sad to hear that you had less than a 5 star experience! Please know that we have informed the franchise owner due to the fact that each location is independently owned and operated!"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "103064534577467608926", "name": "Nikkita Mangum", "time": 1599880491622, "rating": 3.0, "text": "Clean environment, nice staff.", "pics": null, "resp": {"time": 1600107334547, "text": "Nikkita, thank you for the review. We hope that you come back to visit soon and have a 5 star experience! 😁"}, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "116396528417176987197", "name": "Dawncember Willis", "time": 1624565368104, "rating": 5.0, "text": "Great Customer Service and Good Icecream. Yummy.", "pics": null, "resp": null, "gmap_id": "0x88890d225bab8f19:0x9e4c9468f857c2f1"}
{"user_id": "115662346328013940408", "name": "bamagreen Williams", "time": 1622258507620, "rating": 5.0, "text": "They are delicious.  I purchased the mini cakes and you get 3 or 4 favors. I will definitely be back.", "pics": null, "resp": {"time": 1623440712259, "text": "This brightens our day! We hope to see you again soon.❤️ - Nothing Bundt Cakes Care Team"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "113347750242246606375", "name": "Nour S", "time": 1495044757826, "rating": 5.0, "text": "Super moist cake! Giant assortment of flavors! This place is amazing! Also service is 👌.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_jLfH3kyvLpfQBEViDV4bo1SxXKaePadpbOz_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPPvPcT7V68B_KlJw0cBQ6vi-27rb6ShUfNziBs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPC9wGw9RE-TuAM-iNIDqqdbpfJu-mcSYTNtP41=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "116907363532193329482", "name": "Veronica Burke", "time": 1624025345379, "rating": 5.0, "text": "Love this place.  One question though.  Why do they not open until 10:00 a.m.?", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "108926080833140614419", "name": "Drea Finding My Way", "time": 1621364275811, "rating": 5.0, "text": "I order my Birthday cake here last year and it was so good and fresh so I'll be ordering another for my bday this year.", "pics": null, "resp": {"time": 1621463527167, "text": "What a joyful birthday! 🥳 Thank you for letting us be a part of it. Now don't let a whole year go by before we get to see you again! After all, every day is a cake day! - Nothing Bundt Cakes Care Team"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "104587103217953063230", "name": "Whittney Taylor", "time": 1621389689274, "rating": 5.0, "text": "Omg the best cake ever!! So moist and delicious 🤤", "pics": null, "resp": {"time": 1621610751688, "text": "We couldn't agree more, Whittney! We'll keep baking them so you can keep enjoying them! 😉 - Nothing Bundt Cakes Care Team"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "117033399724261135566", "name": "jojoyful1", "time": 1618705040776, "rating": 5.0, "text": "Never disappointed here!  Polite staff and the best cakes 🎂ever!!", "pics": null, "resp": {"time": 1619039929561, "text": "Aw shucks, you make us blush.☺️ Thanks for loving us so much! - Nothing Bundt Cakes Care Team"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "113063288834053865625", "name": "Debbie Jennings", "time": 1622572896221, "rating": 5.0, "text": "Most most cakes I've ever had", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "108759533357118628629", "name": "Asher", "time": 1621646934630, "rating": 5.0, "text": "Always consistent. Always wonderful.", "pics": null, "resp": {"time": 1621877063486, "text": "Hi Asher! We LOVE bringing you joy, one Bundt at a time! - Nothing Bundt Cakes Care Team"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "108819014028886748960", "name": "Shakia Brantley", "time": 1578529169462, "rating": 5.0, "text": "Nicole, Lydia, & Kara were very welcoming and offered me the featured sample. I have been to to two other Nothing Bundt cakes and the experience here has been the best one. I will definitely be back regularly. There customer service is the best around !", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "106856402301548791985", "name": "A'aleah Taylor", "time": 1578529063014, "rating": 5.0, "text": "I fell in love with this location as soon as I walked in! Nicole, Kara, and Lydia were so welcoming. It was my first time coming, and like WOW THE CAKES ARE SO SOFT. I love it. I love it so much!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "109817083873124511043", "name": "Whitney Hodge", "time": 1565442122463, "rating": 2.0, "text": "This place is really good, but I must explain the two stars. I visited this place with my family yesterday. They had samples of their lemon cake out and they were super delicious. So I purchased a small lemon bundt cake. I was super excited to get back home (which is in Tuscaloosa) to partake in this treat. I opened the cake and attempted to dig in only to find a dark, long, straight hair in my package along with my cake. The experience was ruined. I loved those samples and was really looking forward to eating the cake I purchased, but couldn’t. I really like this place, but hygiene plays a big part in the success of businesses like this. I really don’t want to stop going to this place because their treats are so delicious, but I’m a stickler for these types of things.", "pics": null, "resp": {"time": 1565648712041, "text": "Oh no! We're very sorry to hear about this, Whitney, as our goal is to serve the most perfect Bundt Cakes. Would you mind sharing more information with us at www.nbclistens.smg.com so we can make sure your concern is properly addressed?\n-Nothing Bundt Cakes Guest Services"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "104910484983168799960", "name": "Lee Wyscarver", "time": 1565085293942, "rating": 5.0, "text": "DELICIOUS!! I went here a couple days ago and got the confetti, but also tried the raspberry white chocolate cheesecake and they were both divine. Everytime I come back I am going to try something different because they all seem heavenly. Can't wait for my cheat day every week just so I can come here.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "111164653960521223607", "name": "Linda Hamilton", "time": 1579220469902, "rating": 5.0, "text": "My most favorite place ever!!! The cakes are the BEST! And the staff is exceptional! I wish I could give 10000000 stars!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "104961784349868067870", "name": "Dawn Productions", "time": 1576589193392, "rating": 5.0, "text": "Went here on yesterday 12/16/19 for the first time after hearing so much about it. Didn’t know what to get first to so I asked Julia what was her favorite and she said RED VELET and it was SOOOO good. Thanks Julia for the recommendation and great customer service. I will most definitely be back soon to try the Lemon cake !!!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "104039004801030877171", "name": "Ericka Brown", "time": 1600031393413, "rating": 5.0, "text": "Always good... Yum", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "111989575270913780112", "name": "Susan Williams", "time": 1587472321955, "rating": 5.0, "text": "Yours, Mine, Ours Stawberry & Cream Cake was beautiful and delicious!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "117647796635089702904", "name": "Mrs Maria Rosato-Cortes", "time": 1619978020193, "rating": 4.0, "text": "Make sure your cake is not wet and soggy on the bottom!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "116043044343665579271", "name": "Brittany Henricks", "time": 1578525579287, "rating": 5.0, "text": "Great choices and always delicious with great customer service!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "106587048638712608303", "name": "Brittany Jones", "time": 1578530436613, "rating": 5.0, "text": "Great staff and excellent selection of cakes!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "112490679644023585244", "name": "Latoya Shepherd", "time": 1536011834989, "rating": 5.0, "text": "I first tasted these little bites of delight when our patient brought them to us to thank us for taking care of her. I fell in love with them. I then ordered 2 dozen for my daughter's graduation (instead of one cake or cookies, or a fruit basket,) and she loved them. They are so delicious, and moist. I must say, I am partial to the lemon flavored cakes, and the red velvet are a close 2nd! Definitely worth trying!!! Love them!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "110534228863071269380", "name": "julie knotts", "time": 1578525448550, "rating": 5.0, "text": "The cakes are delicious!  The staff is so friendly!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "104970285786965753231", "name": "Keke Williams", "time": 1599583590211, "rating": 5.0, "text": "Really nice employees!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "112260557999413598921", "name": "Stephen Frost", "time": 1554086063000, "rating": 5.0, "text": "We ordered a variety pack of mini cakes. They are amazing!! Staff was friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "117218341572337572484", "name": "MzKatt 01", "time": 1567202017704, "rating": 2.0, "text": "I usually don't leave a review however, I have been totally disappointed with the quality of the bundtlet cakes. I like to come by on Friday to pick up a bundtlet cake or three but each time this month the cakes haven't been fresh. The cakes have been very wet on the bottom; appearing to be frozen or refrigerated for some time. My husband and I stop by today for my weekend pick me up but my experience was the same both cakes wasn't fresh. The texture wasn't good, I couldn't even enjoy the BOGO bundtlet it was the same. Disappointing, I have been coming to place this since it open for business.😥", "pics": null, "resp": {"time": 1567545536525, "text": "We're very sorry to hear about this and appreciate you taking the time to share your feedback with our team. We take our guests' opinions to heart and would love for you to share more information with us at www.nbclistens.smg.com so we can make sure your concern is properly addressed.\n-Nothing Bundt Cakes Guest Services"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "110642601120433567219", "name": "Google User", "time": 1576047082626, "rating": 1.0, "text": "The African American working at the register (around 10:30AM this morning) was rude/nasty. She gave me a hard time for no reason. Will not be returning to this location.", "pics": null, "resp": {"time": 1576185355962, "text": "Thanks for taking the time to share your feedback. Would you mind sharing more information with us regarding your experience at www.nbclistens.smg.com so we can make sure your concern is properly addressed?\n-Nothing Bundt Cakes Guest Services"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "116641885192370610157", "name": "Eric Smith", "time": 1591574136234, "rating": 5.0, "text": "Amazing service and amazing cakes.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "101461728117285786613", "name": "Cynthia Brandow", "time": 1545332007349, "rating": 5.0, "text": "We ordered a cake for our daughter's birthday. My husband said he tried a free sample of the lemon drop came and said it was amazing.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "114042859911984553659", "name": "Alanda Poojary", "time": 1539995335512, "rating": 5.0, "text": "Very friendly and helpful. And of course the bundts were delicious!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "117985309579551309551", "name": "Shaniqua Jackson", "time": 1519192968229, "rating": 5.0, "text": "Omg! This place tops all the independence bakers.. the best in my opinion!", "pics": null, "resp": {"time": 1519338487143, "text": "Thank you so much for the kind words, Shaniqua! We couldn't be happier to know our sweet guests are loving our cakes as much as we do. Thank you for taking the time to share your thoughts with us! - Nothing Bundt Cakes Guest Services"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "100721450230551293838", "name": "Kathy Malone", "time": 1604451559805, "rating": 5.0, "text": "Omg!!! Best cakes ever!!!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "108567957087840596231", "name": "Virginia Dickey", "time": 1493911197528, "rating": 5.0, "text": "The rasberry white chocolate was my favorite,  but it was had to choose they are all delicious.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "105571785961487742202", "name": "Bill Hart", "time": 1508268113939, "rating": 3.0, "text": "Just picked up my dozen bundtlets. I discovered Nothing bundt Cakes last month and thought it was a great idea to give to my clients. The cakes are great and the clients love them. My assistant makes cards and ribbons for each little package. I like to go above and beyond for my clients. My assistant gave me a coupon for a free bundtlet and I told her I would get it for her. It took her 15 mins to figure out which flavor and she settled on the Pecan Praline. Because I ordered online and the amount was already totaled online I couldn't get my free bundtlet, but I just bought a dozen and I don't believe it's my fault that online doesn't accommodate coupons. The staff was really nice about it and said next time I could use the coupon if I called my order in. Nothing Bundt Cakes you assume that I'm coming back. After spending $82.26 in 3 weeks, I don't think so.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "108609026570892690846", "name": "Monica Fischer", "time": 1543955796300, "rating": 1.0, "text": "Terrible customer service. My parents went to buy birthday cake and cashier messed up their order and was incredibly rude. I called to complain and I was hung up on. We will not be returning.", "pics": null, "resp": {"time": 1544026682842, "text": "Hello, Monica! We are so sorry to hear about your recent experience at our bakery. The next time you're in the neighborhood, please feel free to stop by and speak with a member of management so that they may address your concerns. Additionally, you can always call the bakery directly.\n- Nothing Bundt Cakes Guest Services﻿"}, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "102305082658954202431", "name": "Mickey Hardy", "time": 1495045146042, "rating": 2.0, "text": "It's was aight if u know wat I mean bro.", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "109499608656865278997", "name": "Trips Riley", "time": 1576366122515, "rating": 5.0, "text": "They are awesome!!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "104249167056930126505", "name": "Stephanie Dameron", "time": 1554752527603, "rating": 5.0, "text": "great flavors, service, and samples!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "107811216467182453387", "name": "Anthony Coleman", "time": 1571451067624, "rating": 5.0, "text": "Taste Great, Gourmet", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "100499590860844396095", "name": "iamTHATGUY uknow", "time": 1489855719651, "rating": 5.0, "text": "I love the bun teenies", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "109774138880375386250", "name": "Pamela Birchfield", "time": 1520015747348, "rating": 5.0, "text": "I love this place", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "117416155803327130717", "name": "Julia Peart", "time": 1543437361110, "rating": 5.0, "text": "Wonderful cakes,  great service", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "111872530746301175414", "name": "Brittany Johnson", "time": 1513300655258, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "115458534527141268303", "name": "Taffaly Monroe", "time": 1529104277588, "rating": 5.0, "text": "The Best Cake", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "102329205820504456308", "name": "JohnnyBee Goode", "time": 1534185664703, "rating": 5.0, "text": "Fantastic!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "117878326028875303506", "name": "Kamal Balasubramanian", "time": 1507234024389, "rating": 5.0, "text": "Awesome cakes", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "113951567359742822120", "name": "Karen Shelton", "time": 1487707721422, "rating": 5.0, "text": "Yummy cake!", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "105034730303035268603", "name": "Dominic Medici", "time": 1486909224510, "rating": 5.0, "text": "Delicious 😋", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "100499590860844396095", "name": "iamTHATGUY uknow", "time": 1489855719651, "rating": 5.0, "text": "I love the bun teenies", "pics": null, "resp": null, "gmap_id": "0x8889226add5cc88f:0x357b6d073994041"}
{"user_id": "105688040570404226284", "name": "Tricia Colley", "time": 1623195175174, "rating": 5.0, "text": "The Flour Sack made our wedding cakes this weekend and they were divine!!! The bride's cake was strawberry, and the groom's was chocolate with chocolate covered strawberries on it.... they were both so, so delicious! Thank you so much to the Flour Sack for helping make our day a little sweeter!", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "107756113146504907727", "name": "Kendra Pope", "time": 1623706985379, "rating": 5.0, "text": "When my niece passed away a wonderful family purchased some cupcakes, cookies and mini pound cakes. Everything was delicious!", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "111597371087324384638", "name": "ja son", "time": 1605392001283, "rating": 5.0, "text": "My daughters Fox birthday cake was so adorable !! It was also delicious and moist. Would order from them again, and again. Thank you so much The flour sack bakery", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "105308688090666107917", "name": "Juan Cepero", "time": 1591204216324, "rating": 5.0, "text": "Ive been twice now and I’ve had the cupcakes, cookie sandwiches, edible cookie dough and cheesecake. It is all so delicious, probably not good for me but I don’t care because it makes me happy lol The lady at the desk is always nice and friendly. I definitely would not hesitate in getting some sweet treats from them. This place is a must visit for sure, and I can’t wait to go back for some more. A++", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "113673228560656784630", "name": "madison kimbro", "time": 1592613464019, "rating": 5.0, "text": "I just ordered a birthday cake for my boyfriend’s birthday and I can honestly say that it was the best cake I have had in a while. It looked great and tasted amazing. Highly recommend this place!!!", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "105497025613367420940", "name": "Bill Crawford", "time": 1591463704015, "rating": 5.0, "text": "My wife heard about The Flour Sack from her PT(knee surgery last week). Me trying to be a good husband, she told me that she would like to try so I immediately told her let's do it. We called to make our order and were both very happy with the customer service and ease of the process and selection on short notice. We were on the circle across town so we made it there in just a few minutes. I went inside and was greeted in the most cozy, comfy place I had ever been in Dothan by a very sweet, kind lady(wish I had gotten her name so I could thank her on here but too late now, thank you for you're awesome service). Our order was already prepared that quickly but the case had items my wife didn't mention so risking getting in trouble (lol not really but husband's will understand) I asked if I could add a few items and without hesitation she was ready to help me. She packaged it up, gave me a total, I paid, and left it was a wonderful all around experience. This was the simplest part of this review lol. Skip forward a few hours, we are home and have had dinner and my wife is ready to try out the cupcakes. We both had a red velvet cupcake first and we had to stop what we were doing and thinking about to take in the experience that was happening. I can not explain in words how perfect they were, texture, smell and the taste... OMG, hands down the best red velvet anything that I've ever had my entire life (I'm 33), we then had to try another one so we each tried a different one so we could taste more without eating too much and still try more because we are still both in shock of the amazing thing happening. I got a key lime cupcake and she got a birthday cake cupcake, again we both were blown away by how incredible this all was. She is actually rushing me now because I had to stop then and write this review to let anyone know, who has a sweet tooth or any reason to get a treat, this is the place to go. We will go back in future and tell everyone we know to go try it because it is that great of an all around experience start to finish. Thank you so much and we look forward to the next time.\n\nUpdate to the review, this is the next day and my wife has started negotiating terms of the last cupcake because they are that amazing.", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "102563355287256259953", "name": "Nicole Mitchell", "time": 1589311961916, "rating": 5.0, "text": "Had the cupcakes.  melt in your mouth.", "pics": null, "resp": null, "gmap_id": "0x8890458fdc68ebeb:0x1bcdce01641345de"}
{"user_id": "112282702413933550952", "name": "XPLOSION 2", "time": 1605376396392, "rating": 5.0, "text": "Ordered a cookie cake a week ahead and actually had to change when it was ready due to work not letting me off even though o requested well ahead of time. Once they found it they had no problem changing it. I think the lady I spoke to on the phone was Jessica and she was just lovely and so polite.", "pics": null, "resp": {"time": 1605550428168, "text": "XPLOSION, thank you for the 5 star review! We really appreciate you! 😊"}, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "117205944532865936212", "name": "Sharon Cater", "time": 1596318253276, "rating": 1.0, "text": "When I picked up my cookie cake that I ordered on line to make sure the spelling was correct, the fisrt thing I noticed was my last name was spelt wrong. My name is Cater not Carter.  The young lady at the counter asked someone to fix it. After a while, the agreement was made that the name was not as ordered.  When showed to me this time, I saw that an exclamation point had been put after Cater instead of a comma. The young lady said,  \"You want that fixed too?\" I  said no and left because I was detecting negativity. When I looked at the cake at home, I see that my daughter's first name was also spelt wrong.  The cake had Shavome instead  of Shavonne.  I called the store to speak with a manager.  I was informed that the manager was gone. I had to ask several times when he would be in before I was told the next day.  I  do hope I get to speak with a manager when I call back. I will repost then.", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "105832960487353220669", "name": "Michael Sims", "time": 1561844663261, "rating": 4.0, "text": "I coordinated a custom cookie a week ago.  When I texted this morning, they said they didn't have enough time and they would have to make something else instead.  I was unhappy, but, what can you do?\n\nWhen we got there to pick it up, they pulled through and got it done.  They made it happen and pictures of the cookie have circulated among the friends and gotten many compliments.  Thanks, Great American Cookie Company.", "pics": null, "resp": {"time": 1562767933224, "text": "Hi Michael! Thank you so much for your business. We're happy to hear everything turned out great with your order."}, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "100822086592225851709", "name": "Madison Deal", "time": 1578101376747, "rating": 1.0, "text": "I would honestly give no stars. They didn’t have sugar cookies or any coke. They told me this after I waited five minutes on them doing whatever to come over and finally be rude. Go to  a different shop.", "pics": null, "resp": {"time": 1578341417239, "text": "Madison, we are so sad to hear that you didn't have a great experience! Please know that we have informed the franchise owner due to the fact that each location is independently owned!"}, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "118161173973475965530", "name": "Molly Shelton", "time": 1555158464698, "rating": 5.0, "text": "They went above and beyond to make my son's wishes come true for a mario and luigi birthday cake! It looks amazing and did a great job! Thank you all i have one happy 6 year old boy!", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "105934822651215089596", "name": "Denice Carter", "time": 1543347476802, "rating": 1.0, "text": "Called to order a cookie cake. Was told they were too busy and to call back. Called back and got a fax sound every time.  I realize there are busy times but there should be someone there to make sure all orders are taken care of.", "pics": null, "resp": {"time": 1543413769522, "text": "Hi Denice, we're sorry to hear about your experience with our store. Customer service is one of our top priorities. We will look into this issue more to make sure it is handled better in the future. Please give us a chance to correct the situation."}, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "106927247500633869649", "name": "Sheila Patterson", "time": 1542524672996, "rating": 5.0, "text": "Bridgestreet had very good fresh cookies.   Beautifully decorated frosted cookies and super nice ladies working.  They were very busy.", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "100165164423539234903", "name": "Lynne Brooks", "time": 1537371868965, "rating": 5.0, "text": "Ordered a cake for my best friend a Dr. They made a fantastic cookie cake for her.With a medical theme.", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "113846397140899052055", "name": "Patrick Springer", "time": 1520684817807, "rating": 5.0, "text": "Great cookies.", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "111059903245875784987", "name": "Jeannabeanna Stephens", "time": 1540481205390, "rating": 4.0, "text": "A little expensive.", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "105710006356983446436", "name": "David Rawlins", "time": 1359948539942, "rating": 4.0, "text": "Wanted a design they didn't have but agreed to try. They nailed it!!!", "pics": null, "resp": null, "gmap_id": "0x886284603724f29b:0xe08f62f9eab94db1"}
{"user_id": "109534032213694755338", "name": "Jeanne Vines", "time": 1595689367745, "rating": 1.0, "text": "Went on Saturday morning July 24 th ,2020 girl at front counter rude no sense of customer friendliness. Lady behind me walked out .  I Came in looking to order 4 orders of biscuit and gravy with four extra biscuits . Was told they wasn’t selling so you quit making them as another lady came in looking for same thing biscuits and gravy two customers who walked out not getting what they wanted and obliviously was pleased with biscuits and gravy to be returning customers left with nothing but the memory of a very rude unfriendly worker who did nothing to make me want to return or even buy another delicious looking bakery item . Nor the lady behind me . This is sad for your local customer base", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "100321118561436912026", "name": "Dennis Carman", "time": 1584989951243, "rating": 5.0, "text": "I thought \"I'll be strong\".  I thought \"I won't become addicted.  It is good but it isn't THAT good\".  I was so, so wrong.  I'm now a D's Sweets junkie.  I search for change in my car to buy an extra brownie.  Service is too good.  The turtle fudge is on the Class I schedule of dangerous (to your waist) substances.  Simply the best.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "116480379412335182621", "name": "Everette Roberts", "time": 1597101480812, "rating": 3.0, "text": "Very good tasting. Fantastic\nDishes .......however a little overpriced! It's a keeper.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "105448518352237005050", "name": "Adonis Warren", "time": 1579644370844, "rating": 5.0, "text": "Such good sweets! Hit my sweet tooth perfect! Look forward to having a tea party next time.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "102905661735487158062", "name": "Sharon Garth", "time": 1608168209686, "rating": 5.0, "text": "Everything they bake is AWESOME!", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "113444200685759594917", "name": "Hilary Lukow", "time": 1565533610552, "rating": 5.0, "text": "Sweetest lady you will ever meet and her cupcakes, cookies, and ooooh the cinnamon rolls are amazing.  I am addicted to her yummy stuff.  Can’t imagine why she had bad reviews. You will be impressed!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "114427973631323237285", "name": "Nola Lorenson", "time": 1583010845111, "rating": 5.0, "text": "Nice customer service.Great sweets.I loved it!Cute interior.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "112387862055448539841", "name": "Valerie Carson", "time": 1570567939504, "rating": 5.0, "text": "We stopped by on a whim, a couple out of state Texans, and we were met with incredible kindness and delicious treats. Will be back again soon!", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "115861045099190744461", "name": "Barbara Darnell", "time": 1508252033320, "rating": 5.0, "text": "Great.  Don't bake for yourself or company, go to D's Sweets instead.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "104545617564803376898", "name": "Scholz Couriers", "time": 1552745976494, "rating": 5.0, "text": "Love love kalaches! Cream cheese danish was killer!!", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "115447417178720337045", "name": "Velvet Jordon", "time": 1499292400399, "rating": 5.0, "text": "Delightful culinary experience EVERY time.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "107513809937693762699", "name": "Maria Edwards", "time": 1505151184202, "rating": 5.0, "text": "Good stuff hooked on the cupcakes, fudge, well haven't had a bad bite yet.  Will be a weekly stop.", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "103714689008490972468", "name": "AydenBL", "time": 1532303417806, "rating": 1.0, "text": "Fraud, Rude, You won't get what you paid for", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "116990331925311282780", "name": "UniqueAsh ResinArt", "time": 1507604886998, "rating": 5.0, "text": "Bad brownies are amazing!!!", "pics": null, "resp": null, "gmap_id": "0x8890a3f798fa0005:0x8827592f969f2059"}
{"user_id": "100256810252745876251", "name": "Tap Russ", "time": 1592158428531, "rating": 5.0, "text": "My sister and I were walking past the shop. Katie was decorating a big cookie but I guess she noticed us out of the corner of her eye and she looked up and said hi. My sister was so impressed that she said that she wanted to buy a cookie just because (the worker before we knew her name) acknowledged us. I had to let Katie know why she made the sale. Also, we appreciate her wearing gloves and a mask.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0xc758c19aa51e09d7"}
{"user_id": "101979452322973969496", "name": "Amy Richardson", "time": 1558928083936, "rating": 5.0, "text": "Ordered a cookie cake for my daughter’s birthday. I had seen one online and wanted to get it, however, it was not one of their designs. I spoke to several employees and after discussing it with them, they let me know that they COULD do this design for my daughter!! It turned out great and she was so happy with it! I highly recommend them - they were so helpful and went above and beyond!!", "pics": null, "resp": {"time": 1561570647511, "text": "Hi Amy, thank you for your business! We're so glad to hear she loved the cake!"}, "gmap_id": "0x8892921311c230fd:0xc758c19aa51e09d7"}
{"user_id": "105275700701955415690", "name": "Jason Friedlander", "time": 1561225480313, "rating": 5.0, "text": "Blueberry muffin cookies are my new favorite thing!", "pics": null, "resp": {"time": 1561570683948, "text": "Hi Jason, thank you for shopping with us! We're so glad to hear you like the new Blueberry muffin cookies!"}, "gmap_id": "0x8892921311c230fd:0xc758c19aa51e09d7"}
{"user_id": "108209088024365040385", "name": "Tammy Banks", "time": 1485638315395, "rating": 1.0, "text": "My experience was good until I got home opened my bad of cookies and they were stale, I paid almost 10 bucks for 6 cookies that I always get and today they were not fresh cookies!!! I would like a refund on these, I really don't know what happen on this visit.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0xc758c19aa51e09d7"}
{"user_id": "102887032992618431147", "name": "1968kenpoman", "time": 1470002788122, "rating": 4.0, "text": "Their lemon cookies are great.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0xc758c19aa51e09d7"}
{"user_id": "102133586885767991787", "name": "Charles M", "time": 1524001777628, "rating": 2.0, "text": "The only redeeming quality for this store is the quality of the cookies. Management is rude,and treats the workers terribly. Especially behind closed doors. Personally don't recommend this place unless tour bringing your child to get some treats.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0xc758c19aa51e09d7"}
{"user_id": "101297353890354364376", "name": "BonnieS Carter", "time": 1623071043438, "rating": 5.0, "text": "It's always clean!!\nAnd the people who work there are so helpful as well.   They dont mind one bit helping you locate a product.  And the people they have working in the store near me on Bailey Cove Rd., they are the sweetest people.   Some have even become friends. Some will stop what they're doing just to go out of their way to make sure they speak to you.  We love our neighborhood wall market, we only go to super Walmart now if we Absolutely have to.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109112178506262257439", "name": "Timothy Wyant", "time": 1612519403609, "rating": 5.0, "text": "Nice clean location... very friendly staff...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMIy4YvjPEvjErq1FQ3yCQ4PA16ij6LyYiBxPnh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1Mapf0pfLzh6aMLWRCFz8bhKOxewc7q-t87As=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105818633938328798730", "name": "Jarrod N", "time": 1622854533120, "rating": 5.0, "text": "Definitely one of the better Walmarts in the area. Nice and clean. I always come looking for Pokémon cards and while they don’t usually have them, it’s very easy to walk over and see if they do, due to there being a dedicated card aisle on the right side of the store. Also has two different self checkout aisles that make the process a whole lot easier!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100942704957880821389", "name": "Meghan Kenny", "time": 1622174188857, "rating": 5.0, "text": "Got an excellent vaccine here. Have not gotten covid but I do see a paper clip in my peripheral vision asking if I need help with my word document. Microsoft!!!!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115129749753101993678", "name": "John Muhlhauser", "time": 1583899898736, "rating": 5.0, "text": "Such a great and convenient place.  The location is absolutely perfect.  Everything is always well stocked.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPnhPiRscUsUIfYPKh99SoULEEfkXByugLtRxMP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPSHbPOOINllJUZS5aard9GrXTnKkVsgbfevaeH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPvvokQHXp1LTbuUt5IX77I8RCbVisRMF5pzdjq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107917387614792109751", "name": "Jeremy (J.O.)", "time": 1621290661092, "rating": 5.0, "text": "Use to frequent this location more when I lived in the area. Stopped by to grab a few items. In and out. No problems. And the cashier lady was super friendly. Pleasant surprise.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117761585237880215391", "name": "Shalayne Palmer", "time": 1622427198030, "rating": 5.0, "text": "I love this neighborhood Walmart although there could be better help with self checkout but they are friendly and very helpful. They always have a nice variety of things as well.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100278547397932340976", "name": "Chicken John", "time": 1622418063211, "rating": 4.0, "text": "What I like about it is it is easy to find what you need because it's smaller. But because it's smaller there is less to buy, which defeats the purpose of Walmart. This is just more of a Kroger in my opinion. It does help that there is a larger Walmart nearby though. However I do love the staff, I left my change in the self checkout and they stopped me to hand it to me instead of being to lazy to bother.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103806368762469981536", "name": "Reb Kat", "time": 1622314354374, "rating": 4.0, "text": "I like this neighborhood market because it is always clean and very well stocked", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114812181731159200570", "name": "Belinda Montgomery", "time": 1618596688334, "rating": 5.0, "text": "Very clean store and always good selection of groceries. Staff is very knowledgeable and clean plus very kind", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101179510136795696009", "name": "Shirley Saare", "time": 1619824606315, "rating": 5.0, "text": "Great place to shop staff friendly and helpful . Check out quick  with plenty of registers open to check out.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118393827575611643401", "name": "Samuel Hunt", "time": 1612781648352, "rating": 5.0, "text": "This is a gem of a place. They have a very nice selection of gluten free baking items, well-priced organic options, and a wide selection of items for the health-conscious individual. I was pleasantly surprised to discover many items I cannot find anywhere else at great prices. I commend the management team for a job well done. I have never had a long wait at checkout either. I typically shun wal-mart because of low-quality products, but this market is outstanding. It is at the top of my list to find healthy, organic, gluten free products that even Kroger or the health foid store may not carry. VERY WELL MANAGED STORE.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114815235174240497708", "name": "Rachel Ivey", "time": 1619674740055, "rating": 3.0, "text": "My produce ended up not being the freshest, and I noticed the prices were a bit higher than other grocery stores (including other Walmart's, I think.) Not sure if it's an increase in cost and I'm just now becoming aware, or if it's due to this being a neighborhood walmart as opposed to a super walmart; or maybe even it's location...?", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114732177527052062631", "name": "Billy Martin", "time": 1617829743179, "rating": 4.0, "text": "Good service cardio sales people always are shop there many times always good service usually have what you need", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104795313384695990717", "name": "Kent White", "time": 1621043545932, "rating": 5.0, "text": "Got my Moderna vaccine through the pharmacy.  Very friendly and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103872146962831958413", "name": "Osking 32", "time": 1619820734036, "rating": 5.0, "text": "Offer delivery's too tru the walmart app.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116582486435750510110", "name": "Mystique Harrison", "time": 1618521991141, "rating": 3.0, "text": "Just meh. Didnt have what I was looking for but would serve most grocery needs.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104059814072405413524", "name": "Susan", "time": 1610863302646, "rating": 2.0, "text": "Who ever does the ordering needs to do a better job.  They are constantly out of items, and I'm not talking about essential items.  Not sure why they can't keep their items stocked like other stores.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108131581647703146843", "name": "Orlando Fabre", "time": 1617929616191, "rating": 4.0, "text": "Nice,  clean  and good service...way to go!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103942066971081956918", "name": "Judy Kim", "time": 1616529329623, "rating": 4.0, "text": "Smaller, friendlier version of Big Walmart, which I have sworn off.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105703089018646652880", "name": "Lady K", "time": 1616929599849, "rating": 4.0, "text": "Still Walmart, but more pleasant feeling for a quick run in.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114653107880749433585", "name": "S Carmack", "time": 1605472351826, "rating": 5.0, "text": "Helpful staff who immediately helped me when I got to check out and saw that a barcode was missing on a product. Fixed in less than a minute. I appreciate that so much.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101465670839560645771", "name": "Jade Rice", "time": 1612042828870, "rating": 5.0, "text": "Always friendly service here! Marsha is awesome!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101619703961469639840", "name": "TERRY GRANT", "time": 1604693546755, "rating": 5.0, "text": "The people stocking the shelves do a fantastic job, the staff are usually very friendly and helpful when it comes to needing help finding items.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116637580970983700389", "name": "Patrick Bezotte (P.M Bezy)", "time": 1619442588465, "rating": 4.0, "text": "Nice people staff was very helpful", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105604465226129871890", "name": "Donice Ortiz", "time": 1598804510856, "rating": 4.0, "text": "I went as soon as the store opened and it was only a few people inside.  So I felt safe shopping.  Store was clean and well stocked.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102142765939692551242", "name": "Christopher Hall", "time": 1599657696236, "rating": 2.0, "text": "I was a big fan of this place when they were 24 hours. Now i prefer krogers. They open at 7 and close at ~8-10. Between the oblivious patrons blocking the path, the 'buy me' displays everywhere and the daytime stocking carts it's very frustrating just to move around in the store. There is no room. This isn't the employee's fault as employee's aren't displays or stocking carts. This is a managerial fault. Have daytime stocking or 'buy me' displays. Don't clutter the aisles with both. If I had to sum up my review it's just 'store very cluttered'.\n\nI don't have the same frustrations moving around in other grocery stores. This is a walmart specific problem.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117844704830469429885", "name": "Rob Smith", "time": 1599869925191, "rating": 5.0, "text": "The pharmacists are Top notch!!  Super patient and willing to listen to you.   Cannot praise enough!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103824970884455908679", "name": "Stan S", "time": 1604012166821, "rating": 4.0, "text": "Convenient location good selection of food. Good to pick up items on the way!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111057690547892168432", "name": "Neat lawn", "time": 1615565786038, "rating": 5.0, "text": "All the workers are nice n wear a smile", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105130384107007446756", "name": "Mona French", "time": 1614961486024, "rating": 5.0, "text": "Very clean store , very helpful staff!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112507862844038371102", "name": "Travis Trip", "time": 1621815218773, "rating": 1.0, "text": "Stop tracking me stalking weirdos.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114255430655594134597", "name": "Rebecca Ricks", "time": 1614545731826, "rating": 5.0, "text": "Nice, clean, friendly customer service.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108667280901383245156", "name": "Rex Kirkpatrick", "time": 1591390233861, "rating": 4.0, "text": "Good store. Usually have what I want/ need. One minor gripe. The one way aisles really don't have a pattern. In my opinion, just open up the aisles and let people go in both directions. It is not a busy store and the chances of contact are minimal. Just my opinion", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112059339050553987571", "name": "Jenny Childers", "time": 1605916269020, "rating": 5.0, "text": "Staff that were busy filling the shelves were all nice and helpful", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113410114119167284146", "name": "Joni Graley", "time": 1594667396350, "rating": 5.0, "text": "I love getting in and out of the store for a few items or a cart full. This Walmart offers that. Also the prices far outweigh my local Walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107788796200259620677", "name": "Scott Mitchell", "time": 1599971096634, "rating": 5.0, "text": "Always have what I need and always greeted by people who enjoy where they work", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115821028940965155788", "name": "Gina Mardos", "time": 1610750714174, "rating": 5.0, "text": "Such friendly staff, my favorite place for groceries!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112522241957000090230", "name": "Sonia Latham", "time": 1601428119360, "rating": 5.0, "text": "Easy to run in and out. Favorite place to get groceries.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116797010551126489514", "name": "Jason O'Neal", "time": 1581721138453, "rating": 5.0, "text": "I was skeptical of online grocery ordering but i had an amazing experience with grocery pick up with associate SHANICIA.  Her smile and her customer service were out of this world.  I will definitely be back to use the online grocery because of this experience with her.  OUTSTANDING!!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117499218398002014244", "name": "Lisa&jerry Towne", "time": 1623203433854, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110564339766470698171", "name": "Stacey O.", "time": 1590264559721, "rating": 5.0, "text": "All of the employees were wearing masks, sanitizing wipes were available at the entrance for the carts, and the store was well stocked other than the toilet paper.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100884659871558710319", "name": "Larry Smith", "time": 1600368583360, "rating": 4.0, "text": "Nice store with easy access and close parking.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100233125878917355253", "name": "sheila simmons", "time": 1590604167209, "rating": 5.0, "text": "I will definitely be going back to this Walmart,  it was very well stocked, clean, and the employees were very friendly.\nI was there around 10 am-11am.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102213293946201214180", "name": "lisa clardy", "time": 1583105653083, "rating": 2.0, "text": "Usually I have great pick-up service at Wal-Mart, the past 2 to 3 weeks have let me down.  I’m having to wait long times for my order, 15 minutes or more, and I’m missing items on my list without being told or when substituting items I’m not getting the correct quantity.  This used to be an excellent service, please fix it.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106716218449285833346", "name": "Michael Thornton", "time": 1589058885396, "rating": 5.0, "text": "This location is nice clean and most importantly WHITE 😁 and wonderful just like me!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117754173423945321520", "name": "Dawn Kimball", "time": 1599066089479, "rating": 5.0, "text": "Well stocked way better than those on the northbside", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101596815949385862299", "name": "Brandi S. Johnson", "time": 1596112108541, "rating": 5.0, "text": "This location always has everything you need. Love the pickup staff, so friendly!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108513730800676341653", "name": "Sara Hardin", "time": 1591365754762, "rating": 4.0, "text": "Good store to run in , I won't say quick and easy bc its always packed.. If your not doing a big grocery shopping,  it's perfect", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105203113069880474502", "name": "Johnna Hall Miller", "time": 1583527014662, "rating": 5.0, "text": "All staff members in this store have always been so kind and helpful!  Shout out and kudos to one of their most caring and kind cashiers, Crystal Stipe!!  God bless this sweet girl!!  I was shopping last night and, out of the blue as is soooooo common with severe vertigo, I went into a panic attack and was almost in tears as I raced to the front of the store to check out and leave, and that sweet girl immediately noticed something was wrong.  I told her I was just trying to check out quickly because I was on the verge of a severe panic attack, and she raced around to me and put her arms around me and spoke the sweetest, kindest words, and I knew she was a gift straight from God!!  She checked me out and had me take a seat on the bench right up front and across from her checkout line, and just kept talking to me in between her other customers.  GIVE THAT GIRL A PROMOTION AND A RAISE!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102231503619118088742", "name": "K. Allen Mills", "time": 1605987978833, "rating": 1.0, "text": "Just go elsewhere. Was a genuinely unpleasant shopping experience.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106937904112814915679", "name": "Pat McNeill", "time": 1584533519625, "rating": 5.0, "text": "All employees very nice & helpful.  Not crowded.  Thank u WALMART", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116578241375142025824", "name": "Kevin Burrows", "time": 1605919549471, "rating": 4.0, "text": "Small can shop quick and friendly", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112717340623845767464", "name": "Chase McClure", "time": 1619389641120, "rating": 5.0, "text": "Easy in and out", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106927785440472359143", "name": "Ken Hall", "time": 1593014857823, "rating": 5.0, "text": "Plenty of helpful associates, well orgsnized crowd control and flow.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104460126383400669783", "name": "Jeremy West", "time": 1589955187236, "rating": 3.0, "text": "Customer service still paralyzed by Covid mania protocols", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNbi0AAv39JEAKuhrd3uma1wQT4n97iU8YJ6KMs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOq-EFu8GKPTXo3s5O-hma1iJS-cGa1wC8znHzI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101443294458968125354", "name": "Sharron Lamb", "time": 1578778102027, "rating": 1.0, "text": "I went there for a interview.  I got there early. I asked for Beth she said she would be right there. I sat and waited a hour and 1/2 and she was over in produce working. Finally she comes.I thought she was very rude. She told me that she was doing interviews. I applied for deli and she still hasnt hired anyone. Waste of my time", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118298989586364707816", "name": "Richard Bawcom", "time": 1619481809465, "rating": 5.0, "text": "Great store and great employes", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116578051438914438046", "name": "Nikki Burch", "time": 1570579142318, "rating": 5.0, "text": "I would love to thank Jay for the best customer service experience I have ever had anywhere. Especially for giving me such a quick and easy item return experience, and for treating me more like a friend first and a customer second.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106556112289031872969", "name": "Ronald Bunner", "time": 1590349838086, "rating": 4.0, "text": "Easy shopping but ALL customers must wear masks.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113566524782126827727", "name": "Wanda Gibbons", "time": 1593305878745, "rating": 5.0, "text": "Always find what I need and the customer service is always great!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117723805390720649787", "name": "Keith Ward", "time": 1619907862716, "rating": 3.0, "text": "Crowded and unorganized.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104129062226365110283", "name": "Danielle Lowery", "time": 1581544360731, "rating": 5.0, "text": "I prefer going to Neighborhood Market over a super Walmart anyday! The staff at this particular location are wonderful!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109062480468990004407", "name": "Aaron Crawford", "time": 1578633624236, "rating": 5.0, "text": "Neat and clean. This walmart is the nicest I've ever visited. Gives publix some competition.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111878246753027051491", "name": "Tami Bobicz-Bachelder", "time": 1569393571470, "rating": 5.0, "text": "I really like this store much better than the super centers, especially if you're just needing grocery items. I LOVE there budget saver popsicles- banana flavor. However my regular wal mart on south Memorial parkway hardly ever has them. Butt I can always count on this location to have just what I need and more. I would definitely recommend taking time out to go and check out this Market, is well worth it!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106141219885643186230", "name": "Chris Beale", "time": 1534545630833, "rating": 5.0, "text": "Great option to grab groceries in your neighborhood without having to visit one of Walmart superstores. These markets also have gas stations which adds to their convenience. The market does not have as many food selections as their larger stores do, but the selection is still surprisingly good. They also have a pharmacy which is another added convenience.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114965535957308018675", "name": "Amy Oaks", "time": 1604715922157, "rating": 5.0, "text": "I will miss this store as I have moved to KCMO", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115682702823247146102", "name": "Jason Harrell", "time": 1622401556223, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111444622199495938554", "name": "Christina Shore", "time": 1590800921135, "rating": 5.0, "text": "The people who work there are so polite and courteous", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108793267379323737582", "name": "Robert Karma", "time": 1578353613421, "rating": 5.0, "text": "It's easy to get into this Walmart, find what you need, and check out. Much quicker than going to the regular Walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110909724799277132518", "name": "Rhonda Sandlin", "time": 1562171476398, "rating": 5.0, "text": "The experience was excellent - response time, accuracy, and friendliness. It is strange there is no cover for the cars here. Employees have to walk farther than at other locations and they may get soaked as well.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111771794294602210626", "name": "John Rea", "time": 1608067333195, "rating": 5.0, "text": "Great service and shopping", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110540204269567815691", "name": "Scott Allman", "time": 1557997355781, "rating": 4.0, "text": "Certainly, the first ‘grocery only’ Walmart I’ve ever been in. It’s clean. Service actually seems a bit better than a typical Walmart. For one thing, this location always seems to have multiple checkout lanes open. I can’t say as much for most Walmart Supercenters where they have 20+ isles and only 2 are usually open. Perhaps, Walmart is learning something from this ‘Market’ archetype?", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100530783450934402216", "name": "Dave Butler", "time": 1584876560395, "rating": 5.0, "text": "Great store. The staff are tentative and friendly.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102005341758692647331", "name": "Jeremy Schmit", "time": 1573771316490, "rating": 5.0, "text": "Just like any other walmart, but strunk. LOVE this place. Super convient to my home and great selection for the size building they have. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117700775089170029361", "name": "Peter McDonald", "time": 1558820531234, "rating": 5.0, "text": "The customer service was amazing. Had a nice person help me find everything I needed as well as gave suggest for certain food flavors.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105798562763618899186", "name": "Joyce Drach", "time": 1596745902555, "rating": 5.0, "text": "Very convenient, clean and friendly store.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115661983969489841795", "name": "mario", "time": 1579272218615, "rating": 4.0, "text": "It an ok place to stop bye get gas, buy a fee items on the go, safe and clean. They have the online order service and your groceries can be brought to your car.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102717312750798463222", "name": "Megan Marr", "time": 1582576992089, "rating": 5.0, "text": "Bethany is a gem. Her and people like her are the reason I'm passing publix to purchase my goods. I've never visited a Walmart or neighborhood store that was so intune with their customers.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102296238766644054704", "name": "Brad OBarr", "time": 1564424888604, "rating": 4.0, "text": "Typically I'm pleased with this place, choosing it over the other supercenters. However, the last few times they have not been stocked. I'm also learning of a few grocery items that are only available at the supercenters.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112934174235838577259", "name": "ray lindsey", "time": 1519697256110, "rating": 5.0, "text": "I prefer the Neighborhood Walmart over the local super center. Easier to navigate, cleaner and well laid out - particularly for the groceries. The staff is friendlier and the customers more polite. You won't see many oddball people here. There are a few items that I will still go to the super center to purchase but that will be on an exception basis.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116425393104463828095", "name": "Mike Sparkman", "time": 1578836534898, "rating": 5.0, "text": "Love the Neighborhood Market. Very different shopping experience from a Supercenter.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104606377942106237072", "name": "Mark Saint", "time": 1576628411526, "rating": 5.0, "text": "Great staff, clean store a definite plus for folks who live in the area.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113862108449082692283", "name": "Zeke H", "time": 1568059601222, "rating": 5.0, "text": "Good shopping carts and the produce section was much better than the Super Walmart on Sutton Rd. I will definitely go back on shopping days.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110084860854762347953", "name": "Amanda Moore", "time": 1557269993427, "rating": 4.0, "text": "Clean store. Kind staff. They were reorganizing their beer section on 5-7-19, and the aisle was pretty much closed. The did offer to bring me what I needed off the aisle.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105310242668444260251", "name": "Haley *", "time": 1563343816749, "rating": 5.0, "text": "Great little Walmart with all my needs! They even have a nice makeup section! Friendly workers too!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101484837770199654441", "name": "Susan DuPre'", "time": 1543257959647, "rating": 5.0, "text": "Really like the layout of the store and all the options to choose from. Parking lot is easy to get in and out of. Staff is kind, cheerful, and helpful. Grocery pick up has been a lifesaver on more than one occasion! This store actually drew me away from Aldi!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110877919550398371597", "name": "Michael Norton", "time": 1611161588661, "rating": 4.0, "text": "Good groceries", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109590719899354767354", "name": "Susan Duthie", "time": 1542260065118, "rating": 5.0, "text": "It's a good size for me to get around quickly.  The staff is very helpful if I ever need any help.  And, it is the only store where I enjoy self checkout.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114465991193829028647", "name": "Kathleen Makovicka", "time": 1555379407103, "rating": 5.0, "text": "There was a girl there that was incredibly helpful. I wish more people were like her. Great personality and genuine", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100304002115385341276", "name": "Mary Ellen Millbranth", "time": 1467667562421, "rating": 5.0, "text": "Very nice neighborhood store.  Staff actually walks you to the spot when you ask them where something is.  Pretty amazing.  On the other hand, while they have a lots of fresh produce, they have little to no vegetarian and vegan products except some tofu and a small freezer section though they have a large gluten-free section.  I would love to see them bring more health food items in.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115855891997772489987", "name": "Donna Woods", "time": 1601409886558, "rating": 5.0, "text": "Always well stock clean and very friendly employees", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105964535749196118942", "name": "Gwyn Williams", "time": 1569705382252, "rating": 5.0, "text": "Great place to shop!  Friendly staff.  Fresh produce.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108747255350084041212", "name": "The Woke Unicorn", "time": 1566728285141, "rating": 5.0, "text": "Great place to do some quick grocery shopping, or other household and personal items.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104794371381756778783", "name": "Jacob Olival", "time": 1547035202274, "rating": 5.0, "text": "This is my store. I love the staff here. Every one of them is super friendly and they always have what I need. Awesome place to shop.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117663925792231424845", "name": "Linda Foote", "time": 1540038828099, "rating": 4.0, "text": "I enjoy shopping here regularly. It is a great outing for me. And they seem to be improving the vegetable selection and quality all the time.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100143973016165415002", "name": "Connie Heike", "time": 1577582190774, "rating": 1.0, "text": "I found everything I needed  but the vegetables that I bought for my salad wasnt the best  looking and neither was the cucumbers.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109283663979970177190", "name": "Kreigan Hopkins (Antherian)", "time": 1552507902062, "rating": 5.0, "text": "This store is awesome, really nice staff here. My GF and I went for a walk around our neighborhood, and this Walmart is right down the street. We brought a few dollars to get my GF a snack during the walk. We ended up being 6 cents short, and Diamond in the self checkout isle paid for the rest.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113237785783147240281", "name": "Paul Hanson", "time": 1577537960460, "rating": 5.0, "text": "Staff. Are very friendly and helpful..", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112579928463228021555", "name": "Sharon Cowan", "time": 1562208919865, "rating": 5.0, "text": "Great place to pick up a few quick groceries and don't want to do a lot of walking.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102008629778141347883", "name": "Donovan Williams", "time": 1571694708731, "rating": 5.0, "text": "Best neighborhood market in the area with the best grocery pickup in the state.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116335521222420516996", "name": "Allison Pence", "time": 1575653965867, "rating": 5.0, "text": "Love this place when i don't want to go in the bigger walmarts this is the place i go", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103289321853677026448", "name": "David Stanford", "time": 1569026938009, "rating": 3.0, "text": "Employees were great im seriously agrevated because I've not received any of my gift cards aor valtures from you so i guess it's ok when you can't purchase anything", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105938603570167510750", "name": "Angela Swain", "time": 1539600725718, "rating": 5.0, "text": "Love to shop here!  VERY good produce at the right price,  and helpful people.  Can't beat the pick up service!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103937634696317891016", "name": "Laura Yates", "time": 1499562850136, "rating": 4.0, "text": "I love grocery pick up. Ordering from the app saves so much time. I would give them five stars but they are frequently out of things I buy often. That almost never happens at the supercenter on South parkway. The Market is more convenient so I take my chances. You don't always know if something is out of stock until you arrive.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104552545058395716550", "name": "Aaron Lutz", "time": 1520187596288, "rating": 4.0, "text": "Very good Wal-Mart to get food items from. They also have gas you can get there to! The staff were overwhelming nice about asking if I needed help. I didn't like the parking set up. I did like how all the food is organized and easily accessible. If you use there app it's even easier to find items that you want or need.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114131534972089689950", "name": "Bill Beckum", "time": 1523987451361, "rating": 1.0, "text": "Nice clean store with good people working in it.\nThings have changed, maybe they all had a bad day today but I'm a Target customer until further notice. If they don't want to work here they should do something else not punish me with their attitude problem.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOobnXC1w49U0pfkMxOYzPWFTDDi7OoS1TVJiy6=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107539076680409138915", "name": "Mark Brown", "time": 1616564039839, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112579928463228021555", "name": "Sharon Cowan", "time": 1562208919865, "rating": 5.0, "text": "Great place to pick up a few quick groceries and don't want to do a lot of walking.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115855891997772489987", "name": "Donna Woods", "time": 1601409886558, "rating": 5.0, "text": "Always well stock clean and very friendly employees", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101779794209331611956", "name": "Reba Reid", "time": 1515803800912, "rating": 5.0, "text": "It's like a neighborhood grocery store. Don't have to walk in your legs off to do your shopping. Neat and organized. Love their product displays. Wine selection is good and the prices are best.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111971604847573993599", "name": "Pat Garrett", "time": 1561227124405, "rating": 5.0, "text": "Monica Garrett made my day awesome her friendly smile and vast knowledge.saved the day for my cookout.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102008629778141347883", "name": "Donovan Williams", "time": 1571694708731, "rating": 5.0, "text": "Best neighborhood market in the area with the best grocery pickup in the state.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113237785783147240281", "name": "Paul Hanson", "time": 1577537960460, "rating": 5.0, "text": "Staff. Are very friendly and helpful..", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109178194057538272905", "name": "Dana Wright- Dempsey", "time": 1481340425897, "rating": 5.0, "text": "Excellent, and I don't use that word lightly to describe, customer service. They are the friendlies and most helpful staff.   You won't believe it is associated with Wal-Mart.  I've yet to be in the store when I wasn't asked by at least two people if I needed assistance. Even the pharmacy is super kind and efficient.  I love the pick up service, even in the rain they greeted me, insisted I stay in car, and marked the fragile items like bread and eggs. I am impressed with this store and the associates that work at the Neighborhood Market. I can't say enough to relay how great this store and how happy they are in our community.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115698051559106530471", "name": "Michelle Huskey", "time": 1558128038998, "rating": 4.0, "text": "Everyone is very helpful and courteous!! I go 3 times a week  and have always been very happy with the store and employees!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101993903868916272489", "name": "Kimberly Cox", "time": 1600357889919, "rating": 1.0, "text": "No casher everything in the way stocking shelf", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113885330896604811048", "name": "david williams", "time": 1596010603123, "rating": 5.0, "text": "Fresh produce and convient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115698051559106530471", "name": "Michelle Huskey", "time": 1558128038998, "rating": 4.0, "text": "Everyone is very helpful and courteous!! I go 3 times a week  and have always been very happy with the store and employees!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101078444711229625042", "name": "Paul Carlton", "time": 1574908078633, "rating": 5.0, "text": "Great store for quick pickup's.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117602398204025354071", "name": "Steven Smith", "time": 1593033820633, "rating": 1.0, "text": "Pam in the self check out was extremely rude and unpleasant.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100056698765442249033", "name": "Kathleen Nordmann", "time": 1515020752547, "rating": 5.0, "text": "The best Walmart and Pharmacy in town. The whole store goes out of its way to make you feel like it your special store. The Pharmacy goes out of it way to keep your Rx current and filled even if you forget, including calls so that you have all your meds.\nThanks Walmart, you're welcome to our neighborhood.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116254887839708083796", "name": "Brian Tanner", "time": 1583273747372, "rating": 5.0, "text": "They have redbone it looks great", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101926345778298697545", "name": "Mona Lee", "time": 1581128341370, "rating": 4.0, "text": "Went later at night and was more satisfied as far as what I went in for.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109178194057538272905", "name": "Dana Wright- Dempsey", "time": 1481340425897, "rating": 5.0, "text": "Excellent, and I don't use that word lightly to describe, customer service. They are the friendlies and most helpful staff.   You won't believe it is associated with Wal-Mart.  I've yet to be in the store when I wasn't asked by at least two people if I needed assistance. Even the pharmacy is super kind and efficient.  I love the pick up service, even in the rain they greeted me, insisted I stay in car, and marked the fragile items like bread and eggs. I am impressed with this store and the associates that work at the Neighborhood Market. I can't say enough to relay how great this store and how happy they are in our community.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101358954336618212626", "name": "April Baker", "time": 1550782385357, "rating": 5.0, "text": "I love this place! Super convenient and the only Walmart in the world where the employees are actually nice AND helpful, too (just guessing cause obviously I haven't been to all of them, LOL) Love it!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106750742963195120516", "name": "Eric Fullerton", "time": 1475869933742, "rating": 5.0, "text": "I had to visit this Walmart because I'd never been to a \"Neighborhood Market\" branded Walmart before. It was super nice. More like a grocery store than a Walmart. Prices seemed very reasonable, if not on the low end. This is a nice Walmart for those looking for cheap groceries.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111106387171778172514", "name": "Nick Roth", "time": 1486391561394, "rating": 5.0, "text": "I love the neighborhood markets, they are open 24 hours a day and you can get it and out very quickly. I'm surprised sometimes at what they do carry, but they definitely have limited stock of your typical home goods. For example, this store seems to stock extension cables, air filters, car oil, etc. Essentials that you might need to grab quickly when you are getting groceries.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107497230711974332921", "name": "Johnny Orren", "time": 1605807228094, "rating": 5.0, "text": "Always clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116818233388654090091", "name": "E- Man", "time": 1564870033241, "rating": 5.0, "text": "Great service on par with the Walmart Supercenter at Drake and Memorial Parkway. Contrary to what I have heard, the prices are the same.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100806358185384737886", "name": "Corey Atkins", "time": 1556322653710, "rating": 5.0, "text": "Very respectful and humble staff.Mark Christy and Montero are always being patient and very respectful.Somtimes I notice some unique customers. But they are great regardless.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100529489290836693169", "name": "NeetarNeet", "time": 1559363663019, "rating": 5.0, "text": "Good selection, well stocked, clean, bright. Actually had a real person working the register.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105537992418367325503", "name": "Scott Jeter", "time": 1530509860267, "rating": 5.0, "text": "New grocery store format. Compact layout. Reasonable selection. No electronics or toys to sidetrack and lose time on.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105109302450968696537", "name": "marie hill", "time": 1543953677428, "rating": 5.0, "text": "Clean, well stocked, helpful staff. Far better than the Hampton Cove one. The Drake one is a nightmare!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118408903872386581255", "name": "Paul Davoren", "time": 1551485467776, "rating": 5.0, "text": "By far the best walmart store I have been to.  Staff is always friendly and helpful, store is always clean and aisles uncluttered.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115022044055493893904", "name": "Liss Sterling", "time": 1516930763955, "rating": 5.0, "text": "Great store: clean, friendly, pretty. The staff is always so friendly and cheerful. They bend over backwards to make sure you are cared for. If only the Wal-Mart Superstores could generate this level of customer service, I'd shop there, too.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100249236351086450535", "name": "Kathy Lamb", "time": 1605690938432, "rating": 5.0, "text": "Nice and clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113383012317118311692", "name": "kelly robinson", "time": 1511426527178, "rating": 4.0, "text": "It's clean with a wide selection and I love being able to pre order my groceries and set and set up a pick up date and time. They just bring it right out to the car when you arrive.  Everything is easy to find in the store and the associates are very friendly. The only problem I have is the fact that The parking lot is a little confusing", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115673018967844706551", "name": "Christie Chamberlain", "time": 1537569469698, "rating": 3.0, "text": "Over all it's a nice store but one thing I HATE about all Walmarts there is never enough register's open. An people are always lined up .But they are pretty good if they see people lined up some one will open an lane to run a few people through .", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100671234871295848268", "name": "Zed Linger", "time": 1541323370599, "rating": 3.0, "text": "It's OK. If it wasn't owned by the greedy Walton family I'd go there again but I was just there to grab a drink and wait for an Uber home from the doctor's office next door", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104436354162034854914", "name": "Henry Held", "time": 1562698060730, "rating": 5.0, "text": "Self checkout lanes are open almost all the time and it's new so I like it... some prices are more expensive than a regular superwalmart like milk but overall a quick in and out compared to a regular walmart", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103059173514861434063", "name": "John OBryan", "time": 1615007243966, "rating": 1.0, "text": "No cashiers....", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113961205259279995491", "name": "Debra McNutt", "time": 1556391405421, "rating": 4.0, "text": "So much easier than going to the Super center....i love it", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114469566959679215659", "name": "Stedjuthan", "time": 1545668618367, "rating": 5.0, "text": "I go here nearly weekly and the staff have always been helpful, kind and welcoming!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100141537926009952789", "name": "Dorothy Campbell", "time": 1605209960876, "rating": 5.0, "text": "Had what I needed.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111333181171108530259", "name": "J C", "time": 1577481187712, "rating": 3.0, "text": "Average smaller walmart grocery store with gas station. Clean.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101193641322464884512", "name": "David Hayes", "time": 1548731567654, "rating": 4.0, "text": "It's Wal-Mart, but the staff is really what makes it pleasant.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114968998107979151256", "name": "No one Important", "time": 1466914938311, "rating": 5.0, "text": "I may be partial to this location because it is within walking distance....but I am at this Walmart about once a day (at least) & the people are always very helpful and friendly....the night staff especially. They are always so sweet to my kid too!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104617657318416586641", "name": "Melanie Teal", "time": 1505077016800, "rating": 5.0, "text": "Love this new little Wal-Mart. Fast and easy. Good for a fast dash or full grocery shopping. Also has free pickup!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104620231392431497381", "name": "Mark Johnson", "time": 1482306260822, "rating": 5.0, "text": "These folks are awesome. Mark is a night manager and his crew is phenomenal. Glad I'm a friend. And they will order what you need if it isn't in stock.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100350165073962607548", "name": "Heath Varmette", "time": 1590163259057, "rating": 5.0, "text": "Very helpful staff!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100571997608731630252", "name": "Teresa White", "time": 1538613733003, "rating": 5.0, "text": "This store is so clean and everyone is helpful.  I enjoy shopping here for meat and fresh vegetables.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101368679600408106809", "name": "Peter F.", "time": 1513183328171, "rating": 5.0, "text": "The neighborhood market it's very convenient, the employees are friendly and helpful. It's generally well staffed and quick even when busy, something that can't be said for all Walmart's.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117919456520218108693", "name": "Lori Reliford", "time": 1600457154474, "rating": 4.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117251015360189553188", "name": "Kiel Pease", "time": 1481768471011, "rating": 5.0, "text": "Excellent grocery pick up service. The associate  came out to my wife's car in the pouring rain to load her groceries in the trunk. We were very appreciative.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112787503488040821863", "name": "Scott Smith", "time": 1534889654825, "rating": 5.0, "text": "They actually have food stocked with selections and never as crowded as the super Wal Mart next to my houe.  Worth the 10 min. drive.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113048595080703968103", "name": "Cathy Best", "time": 1529033688210, "rating": 5.0, "text": "Friendly service. A joy to shop there. Has a lot of what I need and is convenient.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104232545792056736885", "name": "keltin2002", "time": 1527812883463, "rating": 3.0, "text": "Nice store but the clientelle in that area are self important heels. They'll run you over in the store with their buggies or in the parking lot with their cars. It's upper middle class there, but the the general self importance and disregard for courteousy is way above their station, and polite society in general. But the store itself is clean, well stocked, easy to navigate and check out.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105275304841176278191", "name": "Ryan Robley", "time": 1543288293817, "rating": 5.0, "text": "Friendly and helpful staff. Clean, well stocked and always a pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108915860377002492987", "name": "Joseph R. Huneycutt III", "time": 1597590497099, "rating": 4.0, "text": "95% of  my grocery list", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113906200028671292252", "name": "james adams", "time": 1534838897718, "rating": 4.0, "text": "A better than average walmart. Very clean good variety and well stocked.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103105533263468869438", "name": "D Jeana", "time": 1475606470143, "rating": 2.0, "text": "Some workers here are very nice. Some are so rude for no reason. They never have much in stock. The store is always clean. But they could work on customer service.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115858544504690588548", "name": "Douglas Meeks", "time": 1561860052525, "rating": 5.0, "text": "I never go to the grocery store anymore they put everything in the car and I ordered all online did you just doesn't get any better", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109707122162047247059", "name": "paul Kiczuk", "time": 1516482373780, "rating": 5.0, "text": "Clean, friendly staff, very nice laid back atmosphere, and best of all... The deli has Land O Lakes American cheese!!!!! Hard to find down here. Our ONLY grocery store from now on!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100760191852025489067", "name": "D Brooks", "time": 1478625836516, "rating": 4.0, "text": "They are so friendly! The Wal-Mart neighborhood market team members from produce to pharmacy departments are always helpful!  The only negative is registers as with most Wal-Mart stores they have 20 registers and only two cashier's. They always have plenty of self checkouts but they could use carousel bagging if we're having to check ourselves out one bag at a time just won't do.\n... Thanks", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110935516812268754510", "name": "Chad Freeman", "time": 1508680952343, "rating": 5.0, "text": "We shop here every week. Friendly service and good selection.  Not huge as a super Walmart. Produce is good too.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113485186056980230315", "name": "shasta kimeo", "time": 1563066002780, "rating": 5.0, "text": "Always fresh foods, polite and courteous, clean, helpful, nice atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102390938682411011971", "name": "jess zeller", "time": 1569069763172, "rating": 5.0, "text": "Great prices and good selection of items", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108905212262592685608", "name": "David Szeremi", "time": 1528420262866, "rating": 3.0, "text": "Neighborhood Market is a more compact version of Walmart with only food items I could only hope they pay better attention to the expiration dates", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110935516812268754510", "name": "Chad Freeman", "time": 1508680952343, "rating": 5.0, "text": "We shop here every week. Friendly service and good selection.  Not huge as a super Walmart. Produce is good too.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115227088260727580289", "name": "Daniel Lee Hogan", "time": 1470251197358, "rating": 4.0, "text": "This is a very clean, organized, and well stocked grocery store. However, your not going to find all the processed junk food. I was impressed by the amount of healthy, organic, gluten free, Non GMO products they are carrying. Convenient, lots of parking, and it's not really a high traffic area although the rush hour traffic can spill over. Also I believe they have online shopping. Not surprising because think about it. Wal Mart was, is, and more than likely will continue to be a game changer.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113485186056980230315", "name": "shasta kimeo", "time": 1563066002780, "rating": 5.0, "text": "Always fresh foods, polite and courteous, clean, helpful, nice atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101568853524510488019", "name": "Gwendolyn Toney", "time": 1518831556511, "rating": 5.0, "text": "All of the associates are very nice and friendly. They always greet me whenever I shop there and offers to help me.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117919456520218108693", "name": "Lori Reliford", "time": 1600457154474, "rating": 4.0, "text": "Nice store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103059173514861434063", "name": "John OBryan", "time": 1615007243966, "rating": 1.0, "text": "No cashiers....", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115525658977466713137", "name": "Taylor Thomas", "time": 1506399028005, "rating": 5.0, "text": "Good location, and 24 hours. Works great when I don't need to drive down to a bigger Wal-Mart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109707122162047247059", "name": "paul Kiczuk", "time": 1516482373780, "rating": 5.0, "text": "Clean, friendly staff, very nice laid back atmosphere, and best of all... The deli has Land O Lakes American cheese!!!!! Hard to find down here. Our ONLY grocery store from now on!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100803806355368146819", "name": "Chris Williams", "time": 1492297612185, "rating": 5.0, "text": "Easy in and out.  Almost as much stock as full Wal Mart grocery.  Staff is friendly and happy to help.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108905212262592685608", "name": "David Szeremi", "time": 1528420262866, "rating": 3.0, "text": "Neighborhood Market is a more compact version of Walmart with only food items I could only hope they pay better attention to the expiration dates", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108506966838590278918", "name": "Sue MARTHA", "time": 1528258771106, "rating": 5.0, "text": "Always pleased with the convenience of Walmart close by. The prices are good & products that I use all the time.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116278098737747999208", "name": "Kristine Boyer", "time": 1521837878217, "rating": 5.0, "text": "This is a great place if you need to pop in somewhere quickly, and the staff is always very polite and helpful", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101568853524510488019", "name": "Gwendolyn Toney", "time": 1518831556511, "rating": 5.0, "text": "All of the associates are very nice and friendly. They always greet me whenever I shop there and offers to help me.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107945973474676369450", "name": "Marta Sun", "time": 1525323864049, "rating": 4.0, "text": "Not the best friendliness Publix I have visited,but very convenience.You can also find something clearance because it is an old Publix in town.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112267276165646971061", "name": "Michael Keevert", "time": 1528564584205, "rating": 4.0, "text": "One of the cleanest stores I've been to. Parking lot is kinda cramped. Overall nicer than most.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112185040957474554143", "name": "Alicia Conchin", "time": 1529873928745, "rating": 5.0, "text": "Super clean and a very quiet Wal-Mart, which is quite unsusal for any Wal-Mart these days. Always stocked well and very friendly associates. The gentlemen who runs the fuel center and convenient part, is extremely friendly and kind. He normally works most mornings and it's always a pleasure to see him. He is doing an excellent job managing that part of the business, which is also unusual for Wal-Mart to have such a well kept manager.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115227088260727580289", "name": "Daniel Lee Hogan", "time": 1470251197358, "rating": 4.0, "text": "This is a very clean, organized, and well stocked grocery store. However, your not going to find all the processed junk food. I was impressed by the amount of healthy, organic, gluten free, Non GMO products they are carrying. Convenient, lots of parking, and it's not really a high traffic area although the rush hour traffic can spill over. Also I believe they have online shopping. Not surprising because think about it. Wal Mart was, is, and more than likely will continue to be a game changer.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101134907042804016198", "name": "Hahahahahahahahahah Yoylolyloyky", "time": 1519188132637, "rating": 5.0, "text": "It is good with hi brand stuff but low prices", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMx1S0JjZgxONzGVnxbIFCrOrO_Gu4ApZQtcTtH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104890439470355430560", "name": "John majane", "time": 1582924320450, "rating": 5.0, "text": "Best small walmart", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114556025055143688582", "name": "Deb Walls", "time": 1526906239259, "rating": 5.0, "text": "It's a great Walmart to walk in,  get what you need and walk back out quickly.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100803806355368146819", "name": "Chris Williams", "time": 1492297612185, "rating": 5.0, "text": "Easy in and out.  Almost as much stock as full Wal Mart grocery.  Staff is friendly and happy to help.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115647624817413648147", "name": "Amber Arnold", "time": 1576774924427, "rating": 5.0, "text": "Never crowded, always clean!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116248841641875350443", "name": "Zachary Garcia (zakzackzachary)", "time": 1466960087549, "rating": 5.0, "text": "A very nice, clean, quiet, more grocery oriented Walmart. You wont find clothes, electronics, etc, here, only groceries. Their gas station is also really nice with very competitive prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109188495412920999173", "name": "Nick McElhaney", "time": 1482889629175, "rating": 3.0, "text": "Nice Walmart prices, but good luck finding anyone to help you when the self serve register requires an associate or you need someone to ring up your alcohol.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107748358282085697879", "name": "Michael S. Bruner", "time": 1510882801215, "rating": 4.0, "text": "Doesn't have many drinks but always great prices and the gas here is very well priced", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111685599096711453412", "name": "Philip Busk", "time": 1506394428515, "rating": 5.0, "text": "Clean. Easy to find product. Nice people at the pharmacy. Easy and fast checkout.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113820598771064284464", "name": "Stuart", "time": 1514736936646, "rating": 5.0, "text": "Very clean and well stocked. Way better than standard walmarts", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110228643809320744851", "name": "Miles White", "time": 1574644898902, "rating": 4.0, "text": "Mu husband is there just about daily lol.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100972253491450404171", "name": "Leah Russell", "time": 1479245203317, "rating": 5.0, "text": "My neighborhood Walmart on Bailey Cove Rd is fabulous!!!!!!!  Best Walmart store I have ever shopped in! Friendly helpful employees at this location.  Top notch!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101588398688014182850", "name": "herp beavis", "time": 1531722864133, "rating": 3.0, "text": "It's Wal-Mart. - minus a star because they rarely have more than one cashier hence you'll have to use self checkout. Minus another because they can't seem to keep certain beers in stock.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102833086902583306951", "name": "Mary Hutchens", "time": 1509820853756, "rating": 5.0, "text": "Their food is fresh and they always have what I want and cashier are nice and helpful", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112090772102168362637", "name": "E Briggs", "time": 1524369514902, "rating": 2.0, "text": "Very disappointing.  The store is always understocked.  Management really needs to get up to par on its inventory.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111395072865390195828", "name": "Mathew Sikes", "time": 1500072568233, "rating": 1.0, "text": "This store never has their chit together. Cookies are ALWAYS broken , if they have any. Very minimal selection compared to other Wal-Mart stores. Last visit, they had plastic covering ALL of the meat coolers as if it was all tainted or not for sale. No bueno.\nWife and I went in to grab some wine and champagne. The cashier asked to see BOTH of our ID's. We're both well over 30 years old. Often there are times where one of us doesn't have our id handy. Luckily we both had it on hand. Otherwise, the party would've been dry! This place sucks!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104372637881443960751", "name": "Lauren Turner", "time": 1488002385006, "rating": 5.0, "text": "A great addition to the neighborhood. Many grocery stores have struggled here.  The smaller store is a nice and convenient option when on Bailey Cove.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101882177444608076911", "name": "Eric B (GodSponge)", "time": 1471209474000, "rating": 4.0, "text": "New Walmart market. Still very nice inside. Hardly ever more than one cashier working though.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112722049253254656892", "name": "zeba iranikhah", "time": 1573575002905, "rating": 5.0, "text": "Employers are very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100608748182797606157", "name": "Bruce Mitchell", "time": 1500461883639, "rating": 4.0, "text": "Frustrating to have one cashier working and three watching 3 customers complete fully buggy selfcheckouts.  But staff is friendly, store is clean, prices are good.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102635279684902721781", "name": "Wendy Gardner", "time": 1568234952285, "rating": 4.0, "text": "Like the market but the employees look at you like youre going to rob the place or steal something", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110078664158506194243", "name": "James Hamilton", "time": 1487348950614, "rating": 5.0, "text": "Scaled down to just grocieries so you can get your food quicker here than a Super Walmart. Usually clean and quick checkout times.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112556271809523998176", "name": "Ryan Hammond (SaylemDaemonia)", "time": 1478744622834, "rating": 5.0, "text": "Love this place!  Much better than any other walmart I have been to,  super friendly people and always helpful!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112446878551776019435", "name": "Virginia Geoffrion", "time": 1561850973643, "rating": 5.0, "text": "Cheap food prices, inexpensive gas prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100165392842753414512", "name": "Gabriel Cody", "time": 1474498468101, "rating": 5.0, "text": "Very friendly and well stocked for a small store. Checkout is always quick.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111567920613711132096", "name": "Cary Mann", "time": 1514660883874, "rating": 4.0, "text": "Good store to go and get the essentials and pick up online orders.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110102434008214737768", "name": "Billy Ashmall", "time": 1479323161912, "rating": 3.0, "text": "Nice and quick to get in and out, however being so small they are regularly out of stock on popular items", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115187252126224326625", "name": "Kiliaen Anderson", "time": 1514571956737, "rating": 5.0, "text": "Staff is very helpful, produce is always fresh and at a great price.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106561257918078329910", "name": "Steve Brister (Brister's Martial Arts)", "time": 1604417489044, "rating": 5.0, "text": "Clean with friendly people", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103636341865003541787", "name": "Jamie Martin", "time": 1551885115066, "rating": 5.0, "text": "I love that this is very close to home.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115610920637463053955", "name": "michael mason", "time": 1489343950263, "rating": 4.0, "text": "Quick  checkout lines, ok selections of most things food and a few home selections", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103461324183032244647", "name": "William Smart", "time": 1605995304872, "rating": 5.0, "text": "Touching", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114555113386029014175", "name": "Jennifer Watts", "time": 1600415631503, "rating": 5.0, "text": "I love the employees there!! They are always really nice!!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100026114829300215879", "name": "Shubester", "time": 1503243652736, "rating": 3.0, "text": "love the pharmacy here just not a huge fan of the rest of walmart in general", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108272381598714118610", "name": "Dos Eggies", "time": 1549759284105, "rating": 3.0, "text": "Not 24 hrs any more, but it's a regular Walmart decent service", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115055914560233335173", "name": "Tim Edwards", "time": 1477929576484, "rating": 4.0, "text": "Convenient location to large residential area. Clean and well organized.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104661060521617830091", "name": "Austin Bullard", "time": 1506548968418, "rating": 5.0, "text": "For a Wal-Mart its clean and the staff is nicer than most", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107998497470546023052", "name": "Mark Havira", "time": 1498248123243, "rating": 4.0, "text": "Cleanest nicest staff Walmart I have ever been to worth driving a little extra to get to this one.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111071712356382915727", "name": "Jody Birdy", "time": 1493480051490, "rating": 4.0, "text": "It's clean and it's fast. Parking is usually pretty good.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112094088647116030632", "name": "Jand Ariel", "time": 1520206149566, "rating": 5.0, "text": "Easy in and out for quick grocery, pharmacy & necessary things.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110444682604253859947", "name": "Gopala Myneni", "time": 1528845713224, "rating": 4.0, "text": "Find most of my needed items. Cooperative", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101760995902841542591", "name": "Ellie Kate DuPré", "time": 1518661885109, "rating": 5.0, "text": "Bruh I love Walmart. ((Please note, this Walmart doesn't sell clothes))", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116244390164622620144", "name": "Tyler Young", "time": 1492283867671, "rating": 1.0, "text": "Manager is very rude. expired food on the shelf. The gas station is decent though", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105658477094632745920", "name": "Jan August", "time": 1551073184096, "rating": 4.0, "text": "Faculty is very polite and helpful very pleased.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111284724622335896345", "name": "Melinda Stiles", "time": 1500842470802, "rating": 2.0, "text": "I knw its not a super Walmart but they never have what im looking for and simple stuff. Ok so about 2 wks ago I was their.. So I thought today I would give it another chance, well I made that mistake again.. I just can't see why it takes over 10 mins just input a vendor coupon into their system. Really are you that freakin stupid I wanted to take over and do it myself..  And can you please hire ppl that have teeth... I was so disgusted I wanted to throw up she barely had teeth in her mouth and the ones she did have were all brown and black. I knw Walmart isn't upper class supermarket but c'mon!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105118873849052927008", "name": "Hensley Gray", "time": 1516854787969, "rating": 5.0, "text": "Fast and Convienant. I love this store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117942359074789080622", "name": "Jena Smith", "time": 1610244338079, "rating": 4.0, "text": "Very clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112004801244494763511", "name": "Corey Sisk", "time": 1504214401152, "rating": 5.0, "text": "I love it because it's close to home and has about everything I need", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107212337553056573441", "name": "Brad McClellan", "time": 1482422975758, "rating": 5.0, "text": "Well organized, in and out grocery store. Good prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110881072823134614805", "name": "Gregg Walker", "time": 1515802501084, "rating": 5.0, "text": "Always have been created with friendly staff, very helpful.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102442237883308934075", "name": "Samuel Pagan", "time": 1546901149507, "rating": 5.0, "text": "Very nice place to shop and the price is right", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101425251708907360683", "name": "Vincent Anderson", "time": 1540160504132, "rating": 5.0, "text": "Great store. Great service.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110733854020600980966", "name": "Harvey Trussell", "time": 1523479043297, "rating": 4.0, "text": "Fast and easy to get to moderate prices", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106420673457863890117", "name": "Brandy Hicks", "time": 1469595348648, "rating": 5.0, "text": "The best Wal-Mart in town, and perfect for quick stops!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110058534343602411339", "name": "chris p", "time": 1545154687324, "rating": 4.0, "text": "Great for groceries, but don't mistake it for a super Walmart", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117700435964401330954", "name": "Tasha Vineyard", "time": 1557695721916, "rating": 2.0, "text": "The produce was dated, they did not have celery. Store was cluttered.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106653182554092392888", "name": "Tressie Dean", "time": 1575263855977, "rating": 5.0, "text": "Clean, stocked, and the associates are great!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106242843655991741784", "name": "Alyson Dinca", "time": 1492992798284, "rating": 5.0, "text": "Very clean, great prices, and staff are always friendly and courteous.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111709066283403691236", "name": "Thomas Benn", "time": 1507325777242, "rating": 5.0, "text": "Every employee I encountered was friendly and courteous.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101535300099440114403", "name": "Stephanie N", "time": 1503018132974, "rating": 4.0, "text": "Staff is very friendly.  Great size. Not too big,  not too small.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100895452777691724310", "name": "teresa White", "time": 1500303164218, "rating": 4.0, "text": "The store was very clean.  People very helpful and the casher ask if I had my own bag for my food.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117222432169233577922", "name": "David Gore", "time": 1498437546792, "rating": 5.0, "text": "Great store. Clean and great prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108268062334910387405", "name": "Bob Stell", "time": 1492695147327, "rating": 3.0, "text": "It is a WalMart, no clothes, but lots of food. No Al Motor Vehicle here any more. Got gas.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101136607967408941891", "name": "Jeff Knight", "time": 1516042317767, "rating": 4.0, "text": "Great clean store friendly staff. Wal Mart prices", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103375649268074761315", "name": "william pierce", "time": 1560710234613, "rating": 5.0, "text": "Friendly and clean, never crowded.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110706166460738824069", "name": "Britt S.", "time": 1523149300660, "rating": 5.0, "text": "Very friendly staff. They have all of the necessities in stock.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104362665486683113103", "name": "James Daughtry", "time": 1540950402381, "rating": 4.0, "text": "I just purchased fuel at the corner Walmart store very aggravated at the pumps when it would not take my Sam's credit card to pay for my gasoline purchase. I had to use another credit card Walmart not accepting Sams are you kidding me?", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103608795488746558347", "name": "Angy Wise", "time": 1504777333276, "rating": 5.0, "text": "I gety prescription s filled here. They are always quick and polite", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106648659873910169624", "name": "Jeremy C Och", "time": 1483278287555, "rating": 5.0, "text": "Easy in easy out. Great prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107898601956095233048", "name": "john davis", "time": 1570809045773, "rating": 2.0, "text": "No Tidy Cats non clumping, no sale.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106583310136404952110", "name": "Chris Malone", "time": 1542752472649, "rating": 4.0, "text": "Friendly staff. Very helpful.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105095734393443967003", "name": "Earkley Frazier", "time": 1567110617110, "rating": 5.0, "text": "Great people and sevice", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111010793852371437131", "name": "Ed Waddington", "time": 1503257182132, "rating": 5.0, "text": "Not your typical Wally World superstore.... You actually get good customer service.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108456940768127628628", "name": "Jose Rivera", "time": 1479073247571, "rating": 5.0, "text": "Very nice people and is open 24/7.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102071816383052181752", "name": "Holly Lapointe Jordan", "time": 1499366317880, "rating": 3.0, "text": "It is a Wal Mart, nothing more or less than what you would expect from local Wal Mart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117848259945412192578", "name": "Kemberlee Atkins", "time": 1496317859320, "rating": 5.0, "text": "Easy to find what I need and the employees are always friendly!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105731130417332069770", "name": "Arika Haggard", "time": 1499865185446, "rating": 5.0, "text": "Nice Clean store with great b prices and selections", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107856492933480742461", "name": "Kirstie Inman", "time": 1512336125952, "rating": 5.0, "text": "Really nice and helpful.  Always my favorite stop.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112215296172368876078", "name": "Colin Talbot", "time": 1497929749508, "rating": 4.0, "text": "24 hours is convenient. GAS pumps are not 24 hours", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113222791099265816338", "name": "Taltos Hicks (Tala)", "time": 1559258435081, "rating": 5.0, "text": "Folks here are so nice, which is unusual for Walmart", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112787119074284310194", "name": "Steve Linney", "time": 1600308253449, "rating": 4.0, "text": "Cheap gas.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107495783123881945408", "name": "George Wallace", "time": 1497881226945, "rating": 4.0, "text": "Easy in and out. Purchased water and ice", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118294085148488854402", "name": "Beccas Man", "time": 1507691830108, "rating": 3.0, "text": "Cheap prises and friendly service", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110461008165691452570", "name": "DAN From the SOUTH", "time": 1503717401290, "rating": 5.0, "text": "They have a great low priced selection of everything!!! And 24/7!!!!!!! Never before in SE Huntsville!!! Love this place!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116796063041589141650", "name": "Erik Larson", "time": 1502452652720, "rating": 4.0, "text": "Great little store. Mostly just food.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102655866909899961645", "name": "Lorna Light", "time": 1548645786498, "rating": 5.0, "text": "Very friendly and helpful employees!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101344881216069485902", "name": "David Mullins", "time": 1533393978107, "rating": 2.0, "text": "Cannot even get someone to take my money/ also dirty store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101813390962338942212", "name": "Louis Mitchell", "time": 1515174140662, "rating": 4.0, "text": "Close, convenient, and quick check out depending on the time of day", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107666021300916919269", "name": "Raymond Mount", "time": 1502035973848, "rating": 1.0, "text": "Went there today to buy item I wanted to get cash-back and and i needed $25.00 but all you get was by twenties was gonna get 40 but they told me they would not give me change for the other twenty I think that is wrong I will go to kroger where they will give you change .", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116870480380996260214", "name": "Jennifer Cagle", "time": 1619609883455, "rating": 5.0, "text": "Convenient location! My favorite place to get groceries!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104051941622411190214", "name": "Marisa Hediger", "time": 1483221381303, "rating": 5.0, "text": "Good selection.  Easy in/out.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111724886659412349348", "name": "Rob Pierce", "time": 1512946543515, "rating": 4.0, "text": "Good for a quick stop in for a few things", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115204914077805968456", "name": "Justin Malone", "time": 1491497604332, "rating": 4.0, "text": "It's the everyday Walmart for when you don't want to deal with the headache of traversing through the supercenters.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108318861188666286350", "name": "Teresa Getman", "time": 1516731696453, "rating": 5.0, "text": "Great service.  Cheap wine prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118181957474881100328", "name": "Carol Mayes", "time": 1563307445115, "rating": 4.0, "text": "This is a good little store.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109262748908927817798", "name": "Donel Baswell", "time": 1508673874289, "rating": 5.0, "text": "Love having a Walmart close to our house although it doesn't compare to a Super Center it is a great place to pick up things I forget on my big grocery shopping trips.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114784026920081716856", "name": "Bill Thygerson", "time": 1497446697618, "rating": 5.0, "text": "Quick service, easy to get around, well organized.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102348202111972047107", "name": "jane h.", "time": 1531457876560, "rating": 4.0, "text": "This market is technically closer to me, but I much prefer the bigger Walmart between S. Pkwy and L&N. This market is crowded with merchandise and the layout of aisles and items is confusing/frustrating. Plus, the selection is limited.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110585651178561799467", "name": "Matthew Mueller", "time": 1467900251939, "rating": 4.0, "text": "This is a nice new store that serves the local area well.  I was a bit sad to see Star Market go as it is a local chain, but people demand progress.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100750509246803466961", "name": "Tessa Dixon", "time": 1496356468288, "rating": 5.0, "text": "Nicest cleanest Wal-Mart ever", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106906964547522931299", "name": "Gregg Walker", "time": 1527308785562, "rating": 5.0, "text": "Very convenient, super nice and helpful staff", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118406169857792683745", "name": "David Shotts", "time": 1465878177437, "rating": 5.0, "text": "Convenient and decent prices. Use savings catcher app.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101017338598883415376", "name": "Gina Terry", "time": 1504554465008, "rating": 5.0, "text": "Very clean, quality merchandise and terrific employees!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101596706495626907369", "name": "Elizabeth Pate", "time": 1504108184468, "rating": 4.0, "text": "Always friendly staff and great produce.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105021287476772838239", "name": "Colton Albert", "time": 1501104718854, "rating": 4.0, "text": "Easy to find items and quick check out", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114295616173332108155", "name": "Amy Kibbey", "time": 1505753370785, "rating": 4.0, "text": "Usually a good experience.  Sometimes checking out is slow.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115207411942860925783", "name": "Jeffry Schumerth", "time": 1548967642861, "rating": 5.0, "text": "My daughter work here now", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113650913553762084521", "name": "Bobby Smith", "time": 1489932939446, "rating": 5.0, "text": "This place is very clean and the staff is great", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101391872566699323485", "name": "Michael Martin", "time": 1493946795130, "rating": 5.0, "text": "Awesome place to shop, very clean store!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107122729140040536804", "name": "Barry Ikard", "time": 1538271165028, "rating": 3.0, "text": "I used to work there when it was Bruno's", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114826599724541004265", "name": "Kati W", "time": 1501610509851, "rating": 4.0, "text": "Small, but overall a decent walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118141864650253537330", "name": "Carolina Bama", "time": 1547910425779, "rating": 5.0, "text": "Really great for quick stop", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117593790248128865682", "name": "Christina Morgan", "time": 1514607592040, "rating": 4.0, "text": "It's Walmart. It's clean and it's fine.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113298153493568660697", "name": "Douglas McVey", "time": 1512792468619, "rating": 4.0, "text": "Great experience good prices.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111538295303884310499", "name": "Jennifer McClure", "time": 1567119877425, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108976029163160562514", "name": "Ailsa Dean", "time": 1540607706065, "rating": 5.0, "text": "Great Customer Service", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117176746478231383165", "name": "Amy Oaks", "time": 1512785369765, "rating": 5.0, "text": "Love it & the people r kind & helpful", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105021287476772838239", "name": "Colton Albert", "time": 1501104718854, "rating": 4.0, "text": "Easy to find items and quick check out", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100472575508358772023", "name": "Jake Howard", "time": 1579498886480, "rating": 5.0, "text": "Great Walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100447025835298915325", "name": "Thelonious Jazzman", "time": 1521728190644, "rating": 3.0, "text": "It's Wal-Mart but on a much smaller scale with an emphasis on groceries.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107122729140040536804", "name": "Barry Ikard", "time": 1538271165028, "rating": 3.0, "text": "I used to work there when it was Bruno's", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101596706495626907369", "name": "Elizabeth Pate", "time": 1504108184468, "rating": 4.0, "text": "Always friendly staff and great produce.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100269710562362126518", "name": "R&R Residential Construction & Flooring", "time": 1504708743563, "rating": 5.0, "text": "Convenient location.  Walmart pricing.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108932251188603859473", "name": "candace siler", "time": 1557609636567, "rating": 5.0, "text": "Super nice and clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113056549536836120757", "name": "Eric Vosahlik", "time": 1501354668850, "rating": 5.0, "text": "So close we treat it as our pantry.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103085755643987955460", "name": "Rosemary Davidson", "time": 1497669284510, "rating": 5.0, "text": "Fast trip with great selection.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105700658089473819165", "name": "Suzanne Ray", "time": 1495459379261, "rating": 5.0, "text": "good prices, clean, efficient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113223759010523950784", "name": "William Brinkley (Ben)", "time": 1517954047998, "rating": 4.0, "text": "Like most Walmart's it is conveniently located to our neighborhood. However, it is not a super Walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117593790248128865682", "name": "Christina Morgan", "time": 1514607592040, "rating": 4.0, "text": "It's Walmart. It's clean and it's fine.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114110388089945735044", "name": "Phylliss Neal", "time": 1517356456055, "rating": 1.0, "text": "All grocery carts was outside, none in store. I went to Kroger", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117220787514544963713", "name": "matthew meskill", "time": 1509764230773, "rating": 5.0, "text": "Just groceries! Fast", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117380726713300987636", "name": "Shane Warfel", "time": 1534345840853, "rating": 5.0, "text": "Helpful and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105859590870418111677", "name": "Charles Chereek", "time": 1541264507313, "rating": 5.0, "text": "Clean, helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104935063585593149516", "name": "Randall “Scott” Smith", "time": 1561927864815, "rating": 3.0, "text": "Needs cashiers", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110052523742178257112", "name": "Joy Grace Hudson", "time": 1536235762533, "rating": 3.0, "text": "They always get ALL my $!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115207411942860925783", "name": "Jeffry Schumerth", "time": 1548967642861, "rating": 5.0, "text": "My daughter work here now", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103396089712830480758", "name": "charles gour", "time": 1580480302038, "rating": 5.0, "text": "Convenient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107440961236995555819", "name": "Adrian Mosley", "time": 1567597790849, "rating": 5.0, "text": "Very friendly place to shop at.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103549717148165907179", "name": "Tina Hunter", "time": 1581290365686, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111437462209360509444", "name": "Danielle Carlson", "time": 1558892790456, "rating": 5.0, "text": "Your typical Walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109063931674921725392", "name": "Wesley F", "time": 1534883843809, "rating": 5.0, "text": "My go to Walmart", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "106132062740405898046", "name": "michael brown", "time": 1530744268331, "rating": 5.0, "text": "Very convenient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110606484161407214848", "name": "John Robinson", "time": 1545866990730, "rating": 1.0, "text": "I wasn't  at Walmart Neighborhood Store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104404744143286087967", "name": "Brandon Young", "time": 1526949670451, "rating": 5.0, "text": "Very pleased", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100222904415200021051", "name": "Obed Blas", "time": 1526903119488, "rating": 2.0, "text": "Another Walmart with mediocre service.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103226078036585855457", "name": "Lakshmi Inguva", "time": 1524946741768, "rating": 5.0, "text": "Shopped for candles", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112159644957002301079", "name": "Tus Nanda", "time": 1539649526909, "rating": 4.0, "text": "Good for quick trip", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103500777824260679411", "name": "Lori Hillis", "time": 1537893748487, "rating": 5.0, "text": "I like it", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105251727146185539057", "name": "Deoplo", "time": 1519857196526, "rating": 5.0, "text": "It's a grocery store.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102088141881403270883", "name": "Angela Sanders", "time": 1536986468557, "rating": 5.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108932251188603859473", "name": "candace siler", "time": 1557609636567, "rating": 5.0, "text": "Super nice and clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112470716880376737921", "name": "Ron Elliott", "time": 1516853382786, "rating": 5.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104991344219736951118", "name": "John Savage", "time": 1532964798784, "rating": 5.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111151500890487553604", "name": "B", "time": 1531495314788, "rating": 5.0, "text": "Helpful staff", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113223759010523950784", "name": "William Brinkley (Ben)", "time": 1517954047998, "rating": 4.0, "text": "Like most Walmart's it is conveniently located to our neighborhood. However, it is not a super Walmart.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104612618846591596712", "name": "Carol Albright", "time": 1529675068997, "rating": 4.0, "text": "Clean & nice employees", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104491283627284992724", "name": "Tisha Wasmund", "time": 1512078883698, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109945623856498237453", "name": "leon cleveland", "time": 1510241799306, "rating": 5.0, "text": "Easy shopping.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "115529515802353735547", "name": "Paula Peterson", "time": 1510063043033, "rating": 5.0, "text": "Convenience!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101776418740232663522", "name": "Nolan Carpenter", "time": 1521159440190, "rating": 5.0, "text": "The staff is really great at this location", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "117380726713300987636", "name": "Shane Warfel", "time": 1534345840853, "rating": 5.0, "text": "Helpful and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "118141864650253537330", "name": "Carolina Bama", "time": 1547910425779, "rating": 5.0, "text": "Really great for quick stop", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101212845953203137569", "name": "Scott Ames", "time": 1496704191138, "rating": 5.0, "text": "Great cashier.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102951095933165150523", "name": "William R. Davis", "time": 1486490160314, "rating": 3.0, "text": "It's like the other Walmarts", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111077497541750866108", "name": "Janice Swearengin", "time": 1576794446516, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102088141881403270883", "name": "Angela Sanders", "time": 1536986468557, "rating": 5.0, "text": "Great prices", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100222904415200021051", "name": "Obed Blas", "time": 1526903119488, "rating": 2.0, "text": "Another Walmart with mediocre service.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105251727146185539057", "name": "Deoplo", "time": 1519857196526, "rating": 5.0, "text": "It's a grocery store.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103191816017811685097", "name": "Doug Petty", "time": 1501688309754, "rating": 5.0, "text": "Quick in and out, love it!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104991344219736951118", "name": "John Savage", "time": 1532964798784, "rating": 5.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111172686221710379818", "name": "LISA LUGO", "time": 1567303903251, "rating": 5.0, "text": "nice", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111151500890487553604", "name": "B", "time": 1531495314788, "rating": 5.0, "text": "Helpful staff", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109274677870972373618", "name": "Tanika Bateman", "time": 1494730514746, "rating": 5.0, "text": "Has everything", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103085755643987955460", "name": "Rosemary Davidson", "time": 1497669284510, "rating": 5.0, "text": "Fast trip with great selection.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103879440612829394700", "name": "Mary Pruitt", "time": 1501679193244, "rating": 5.0, "text": "Convenient to my home and fast.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104085712149608000248", "name": "Sharon Walton", "time": 1492087016531, "rating": 5.0, "text": "Great deals!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "108489878136509686108", "name": "cindy lindsey", "time": 1492086685482, "rating": 4.0, "text": "Easy to find things,  not busy.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "109938996919775074255", "name": "Terrence Francis", "time": 1489980529769, "rating": 5.0, "text": "Frequent shopper", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112182031692932469599", "name": "Karen Drake Photography", "time": 1514562434915, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111103448624712417306", "name": "Tim Harrison", "time": 1504791066148, "rating": 5.0, "text": "Everything you need in groceries.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102951095933165150523", "name": "William R. Davis", "time": 1486490160314, "rating": 3.0, "text": "It's like the other Walmarts", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "100386425429642777456", "name": "Sharon D", "time": 1502678601777, "rating": 5.0, "text": "Hey what you need without walking a mile!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112004539132621116816", "name": "Sandy Campbell", "time": 1501808208394, "rating": 5.0, "text": "Friendly people wide aisles and everything I'm looking for", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103191816017811685097", "name": "Doug Petty", "time": 1501688309754, "rating": 5.0, "text": "Quick in and out, love it!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112806896472544168971", "name": "OCTAVIA THOMAS", "time": 1517070818898, "rating": 4.0, "text": "The prices are good.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107997551431783266587", "name": "Raymond Stapler", "time": 1483896862412, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107867942237678073617", "name": "Cipher Willett", "time": 1482892114947, "rating": 5.0, "text": "Very friendly and close to where I live!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105919317948465036875", "name": "Michele Henderson", "time": 1482524131239, "rating": 5.0, "text": "Always clean!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "111149844715824829733", "name": "Walter Kraft", "time": 1496758507434, "rating": 4.0, "text": "It's just a grocery store", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "105700658089473819165", "name": "Suzanne Ray", "time": 1495459379261, "rating": 5.0, "text": "good prices, clean, efficient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102610444497437654102", "name": "Joseph Patterson", "time": 1493072849009, "rating": 5.0, "text": "It's Walmart...what can I say?", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107049731089857512373", "name": "curt critt", "time": 1492973379286, "rating": 5.0, "text": "Clean and nice", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104846535971847820000", "name": "carlos paz", "time": 1499644033544, "rating": 5.0, "text": "Always great!!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113056549536836120757", "name": "Eric Vosahlik", "time": 1501354668850, "rating": 5.0, "text": "So close we treat it as our pantry.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113231821029204395923", "name": "Ryan Wills", "time": 1474421611571, "rating": 5.0, "text": "So much better than star market", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114936340846972120234", "name": "John Taylor", "time": 1470692525924, "rating": 5.0, "text": "Love this Walmart for quick stops!", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110355878548546088001", "name": "Chad Spencer", "time": 1487537418567, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "103815596186400535162", "name": "Ian Kinner", "time": 1486836310182, "rating": 4.0, "text": "I'm not a huge walmart fan, but this one is right down the street and serves well if you need basic groceries or common stuff.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114005040828081588451", "name": "Jose Fernandez", "time": 1486072183223, "rating": 4.0, "text": "Small enough not to be a nuisence.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112791332615272576867", "name": "Joseph Scrivani", "time": 1485373323599, "rating": 3.0, "text": "Clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "102422326079944305482", "name": "Stacy Varmette", "time": 1480438036005, "rating": 5.0, "text": "very convenient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "113275027022746271344", "name": "Jeremy Hunter", "time": 1478720884234, "rating": 5.0, "text": "They have everything you need for grocery shopping. It is never busy I can always get in and out pretty quick.", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114469742113672545462", "name": "Tina L Simmons-Mason", "time": 1497929639550, "rating": 5.0, "text": "Close by", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "110355878548546088001", "name": "Chad Spencer", "time": 1487537418567, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "112791332615272576867", "name": "Joseph Scrivani", "time": 1485373323599, "rating": 3.0, "text": "Clean", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "116677061163225094313", "name": "JJ Betancourt95", "time": 1581281974611, "rating": 5.0, "text": "(Translated by Google) Since I moved, I found this place curious since where it was from there was not and if I like it because it is very useful I will only look for what I need in the grossery part\n\n(Original)\nDesde que me mudé me pareció curioso este sitio ya que de dónde era no habíay si me gusta porque es muy útil solamente voy a buscar lo que necesito en la parte de grossery", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "114358350727428528697", "name": "avsthetiic", "time": 1581903627292, "rating": 5.0, "text": "(Translated by Google) very well\n\n(Original)\nMuy bien", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "101962011007576735446", "name": "yesenia diaz gudiño", "time": 1527284518071, "rating": 5.0, "text": "(Translated by Google) Goog\n\n(Original)\nGoog", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "104436537101249549510", "name": "Ken Mitchell", "time": 1520721164994, "rating": 5.0, "text": "(Translated by Google) Coexistence\n\n(Original)\nConvivient", "pics": null, "resp": null, "gmap_id": "0x88621287dd02ee41:0x1dc4254f44549945"}
{"user_id": "107501036826254114035", "name": "Stephanie", "time": 1618081006458, "rating": 4.0, "text": "Overall very good.  I was really excited about trying the chicken salad after reading the reviews.  It was not good at all.  There was hardly any dressing and chicken had the texture of something that had been run through a food processor.  Pasta and broccoli salad was fantastic!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOsV9NG5xQTLvt1g8ylhnu7WNhh0muV_ElwviQ_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMli_OQ8FMipdsV_mF-frcc-Ro4H5Bjn5k5gAbk=w150-h150-k-no-p"]}], "resp": {"time": 1618087644791, "text": "I’m sorry you did not like the chicken salad. We cook chicken breast and chicken thighs fresh and shred the chicken. Glad you liked the pasta salad and broccoli salad though. Thank you for your review."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "117809258853432717480", "name": "Mollie Unruh", "time": 1620140225384, "rating": 5.0, "text": "Oh. Em. Gee!!! This place is amazing. I could have bought every single thing in this place and tried them all! I got some cookies to try, the pimento cheese, sausage balls and a hot hazelnut latte. The two employees working (one was Lindsey) were SUPER friendly and the atmosphere and decor inside was SO CUTE! I love it here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOx_OBCMivhQmoXiWsByXy9migYaDrkwH7co9B3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "110177880780633637766", "name": "Carolyn Jones", "time": 1619972341074, "rating": 5.0, "text": "First time there on a Saturday afternoon. My daughter took me. She really likes the food. I got a salad trio plate. The price is comparable to others who serve this type of food. I reccomend it. Easy to find in Hartselle downtown.", "pics": null, "resp": {"time": 1620012124724, "text": "Thank you so much for coming in. We hope to see you again soon."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "108978844752861251081", "name": "Denise Barnett", "time": 1601319380380, "rating": 5.0, "text": "I love their chicken salad! I love their pretzel salads! I got pineapple pretzel salad today and it is the very best!! I ate there every day for lunch for a week! They’re always very friendly! They also have it decorated so pretty! Such a nice place to eat! Dine In or Carry Out.", "pics": null, "resp": {"time": 1601477450873, "text": "Thank you so much for your business. We are so glad you love it. Come back and see us."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "107998514978101956749", "name": "SincerlyTee", "time": 1617300328858, "rating": 5.0, "text": "If you are local and haven't stopped by here you are missing out!! I picked up a few cupcakes and cookies and omg by FAR the best cake mix I have tasted in a long time!!! I was mad I didn't pick up more! Lol. Just Decadent!! The staff was friendly upon entering!! I'll be back!!!!", "pics": null, "resp": {"time": 1617316201600, "text": "Thank you so much for your feedback and we appreciate your business. Please come back and see us. Happy Easter!"}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "113812163216352778822", "name": "Sarah Hamilton", "time": 1617042462675, "rating": 5.0, "text": "I absolutely LOVE this bakery!! Their cakes and cookies are to DIE for and the ladies that work there are SUPER sweet!!!!!", "pics": null, "resp": {"time": 1617046731095, "text": "Thank you so much for the kind words. We appreciate your business. Please come back and see us."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "117446058297123049835", "name": "Sharon Hunter", "time": 1600197081181, "rating": 5.0, "text": "Lovely local place with the friendliest of staff. And the Mounds candy bar cookie - oh my! Definitely worth a stop and support local business.", "pics": null, "resp": {"time": 1600693526481, "text": "Thank you Sharon! We hope to see you again soon."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "110520784198708454154", "name": "James Newcomb", "time": 1610469810563, "rating": 5.0, "text": "Quaint small town shoppe with food and treat selections that are to die for!!!", "pics": null, "resp": {"time": 1610594752957, "text": "Thank you so much for coming in."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "100644340917261412014", "name": "Nancy p", "time": 1573166740984, "rating": 5.0, "text": "Very good", "pics": null, "resp": null, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
{"user_id": "117201567134372611762", "name": "Nelson Reburn", "time": 1623444566119, "rating": 5.0, "text": "Friendly staff and delicious cookies!", "pics": null, "resp": {"time": 1623519314135, "text": "Thank you so much for coming in. We are glad you loved the cookies."}, "gmap_id": "0x88882af3eb655555:0xc598342ed4b1bf95"}
