{"user_id": "113780311516291432401", "name": "Angel Leverett", "time": 1617891531233, "rating": 5.0, "text": "I just want to thank Dr Brandon Johnson and all his staff for doing everything you could to make my father feel as comfortable as possible. The best doctors around y'all helped him in everyway possible the nurses was always very sweet answered all my questions always retuned my calls Everytime I had a concern.. I just can't thank you guys enough Tracy and Brandi was always checking on him which means alot..  It hurts that he's no longer here with us but I'm very thankful I got almost a year with him thank y'all for always keeping his pain managebale couldn't have done it without your help.", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "116461752656819567804", "name": "Shannon Banks", "time": 1623276397995, "rating": 5.0, "text": "Beautiful facility with amazing people!", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "108062057372060839653", "name": "jessie hardison", "time": 1608624877351, "rating": 5.0, "text": "The Very Best place, wonderful  caring people.I just Love every one so very much.spencer cancer center  is a Awesome  place to be if you are going through  any type  of Cancer..I just Love my Oncologist  Dr Farmer.she is so Amazing  and Careing.and the Nurse's  they are God sent..I Love Every one they treat me as thoe I was on a mini Vacation  when ever I went for my treatments. GOD FOREVER BLESS SPENCER  CANCER,  CENTER I have now completed  my chemo treatments,  heal by God.i went through  chemo one year and a half never once did I get sick.im truly  Bless to have know such God sent people.I Love each and every one of them.never Give up on your self Cancer is only a word. GOD HAS MIGHTY POWER TO HEAL.🙌🙌🙌🙌👏👏💞 I also took 32 Radiation  treatment, in the same Building  with Dr Cabaka, He is such a wonderful  Dr.i completed  those treatments  as well and they presented me a certificate,  and I Rang the Bell.oh what a wonderful  feeling  to No God had my Back all the way..so please  stay Encourage, no matter what illness  you face, God can and will Heal you as well..🙂", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "114442167751261998784", "name": "Golfing bros 2.0", "time": 1608139829048, "rating": 1.0, "text": "No one ever calls you back - I am trying to just set up an appointment and they can not even do that!!!! UGGGGG", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "107437432428902568773", "name": "shannon dumas", "time": 1583941907238, "rating": 5.0, "text": "Great facility! If i could, i would give 10 stars for Dr Brandon Johnson, Brandi and Selena! This combo made it easier for me during the hardest time of my life!", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "104759784284998250163", "name": "Shirley Dickinson", "time": 1561052347518, "rating": 4.0, "text": "It is very nice but needs an awning at the front entrance in case of rain. Don't want our loved ones getting wet. Also handicap door into/out of the infusion room would be nice when a person in a wheelchair or using a walker  is trying to leave the area.  Would have been nice to have a room up front  to get the pump unhooked.", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "114101699165527751071", "name": "Mattie Mario", "time": 1575361830809, "rating": 5.0, "text": "Was taken wonderful care of by Dr Johnson and nurse Lisa.  Boutique is lovely for after care from breast cancer.", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "110707870699515832071", "name": "Ivan Fairbanks", "time": 1561480407711, "rating": 5.0, "text": "Cancer infusion center my nurse Lisa is one of the best\nThe New Building is Beautiful.", "pics": null, "resp": null, "gmap_id": "0x888c92d24cecc65b:0x3081946142758098"}
{"user_id": "107678998529995131834", "name": "Rebecca Jett", "time": 1590338545370, "rating": 5.0, "text": "My nurses and doctor are awesome,  and I trust them with my life!", "pics": null, "resp": null, "gmap_id": "0x889a4d77a4990995:0x838b1c17d26a4033"}
{"user_id": "115737142450869442439", "name": "irene troy", "time": 1567015994471, "rating": 5.0, "text": "I have had a good service from caring nurses and aids and have the doctors very happy to answer my questions and make me comfortable .\nI am happy to go to this facility for my cancer treatment .", "pics": null, "resp": {"time": 1567086198363, "text": "Thank you so much for the positive feedback! It’s wonderful to know that you were pleased with our team and the care you received. We want to help every patient in our community who needs it, and sharing your experience will help others know that excellent cancer care is available in their community."}, "gmap_id": "0x889a4d77a4990995:0x838b1c17d26a4033"}
{"user_id": "109482096246916634041", "name": "Katie Ladnier", "time": 1584777831235, "rating": 1.0, "text": "If you have the misfortune of having to use a doctor on the 5th floor like my grandmother, be forwarded to be dissapointed in the desk women. Not only are they more worried about showing each other their phones and speaking/laughing so much about their chirldern and opinions that the entire lobby now knows their business BUT THEY HAVE A RIDIDULOS SYSTEM. Most of their patient are either hurting or weak and that's a given or else they wouldn't have any patients, that being said they hand each patient 10 pages to fill out and say 'just a refresher' and once they fill it out and bring it to the desk, the woman says, hold on, takes the last two pages and says these go to your nurse. Oh so now it's my job to make sure my nurse and doctor receive my information?.... Sit down only to have the woman leave the desk and bring another parent and say the nurse will also need this. Now, I am only keeping my mouth shut and dealing with it because my grandmother likes Dr. Angel. Who we haven't even seen yet even though we've been here an hour, 45 minutes past our appointment time. I am not impressed and highly dissapointed that they could know that anyone coming to third desk is only there to maintain, figure out, or treat a majoir issue inside thier bodies, and have the gaul to lolly gag on their phones and conversate. I have listened and every time thier moths are open the typing and paper movement stops, mouths shut and all you can hear is clicking and crinkling. I would care about that if the conversations we're about the task in front of them! Highly dissapointed in their effort and performance!\n\nOh and I ask if there's any way they can make more coffee being as the one cup left was freezing and she looked me in the eyes and said 'you can go look in the back and see if they have any warm'  oh cause I'm being paid to be here, I forgot! I'd be pissed if this was any doctor's office at all but the fact that cancer patients are their patients I just assumed they would hire more considerate and caring people. I have worked at a gas station whos required employees to care more than these women do about the people they are interacting with.", "pics": null, "resp": null, "gmap_id": "0x889a4d77a4990995:0x838b1c17d26a4033"}
{"user_id": "108445930845697349651", "name": "lisa mcdowell", "time": 1628693569351, "rating": 5.0, "text": "This is the most amazing store. From the staff & owner is so nice and helpful to The bras bras being like no other. I thought it was just a specialty store but they have regular bras that beat any other stores(Lane Bryant & VS). They are made high quality and feel like you are wearing nothing but very supportive and sexy. I have already been back two more times for more and thrown away all my old bras. Thank you for the great customer service and product.", "pics": null, "resp": null, "gmap_id": "0x888a3ea5a5963f65:0xa9cfd536538c8d3f"}
{"user_id": "103236598865015259060", "name": "Nancy Graham", "time": 1628693614127, "rating": 5.0, "text": "This is the best place for a new bra. I just could not find a bra that fit my big girl breast , but now I have !!!!!! The owner is great she did not even have to measure me,  just took and look and came back with the right sizes.  I have never had cancer or any problems other then not being fit good.  GO by The New You Bra Boutique and see what she has for you.... THE BEST AROUND !", "pics": null, "resp": null, "gmap_id": "0x888a3ea5a5963f65:0xa9cfd536538c8d3f"}
{"user_id": "105060549597307397817", "name": "Linda Cargal", "time": 1526994126316, "rating": 5.0, "text": "Very Helpful and  Friendly people who need help and support  after Mastectomy  .", "pics": null, "resp": null, "gmap_id": "0x888a3ea5a5963f65:0xa9cfd536538c8d3f"}
{"user_id": "108227868940978675695", "name": "amber cockrel", "time": 1516162727429, "rating": 5.0, "text": "Love this place they are very nice", "pics": null, "resp": null, "gmap_id": "0x888a3ea5a5963f65:0xa9cfd536538c8d3f"}
{"user_id": "116701707057439435212", "name": "June McClendon", "time": 1624732343673, "rating": 4.0, "text": "I highly recommend Southern ENT & Dr Walters. Likes: Website has printable new patient forms that I completed before my appointment. Comfortable waiting area. Once I got to the exam room, I was seen right away. First by the friendly, efficient & knowledgeable auditory tech who took me to the sound-proof room for testing. I was pleasantly surprised that there was no wait time between testing & meeting with Dr Walters to review my results. Five stars for Dr Walters! It was obvious that he had reviewed my paperwork in advance,. He explained my results, answered my questions, and recommended a course of action clearly & patiently. I felt like he was seeing me as a person, not as a condition. Why not 5 stars? 40-minute wait time before getting to exam room & inability to complete & submit patient forms online.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109321360756288387280", "name": "Deborah Hataway", "time": 1626970799152, "rating": 5.0, "text": "I am  completely satisfied with my appointment with  Dr. Lowery.  He put me at ease.   He has been my ENT for over 10 years and I drive over 45 miles one way because I trust him and his diagnosis each visit I have had.  He orders test when needed to ensure we know what we are dealing with.\nI recommend the Southern ENT & Sinus Center to any and everyone that needs an ENT.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118206263218210649794", "name": "CLH 79", "time": 1624315376044, "rating": 5.0, "text": "We saw Dr Fort for my son's frequent nosebleeds. He was very nice and helpful. The office is large and clean. His nurse/assistant and the front desk clerk were very nice also. Overall a great place. Easy to get an appt too.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115699391723525140900", "name": "Rhonda Rhudy", "time": 1626815709843, "rating": 5.0, "text": "Dr Walter's was very kind & thorough with my 15 year old daughter's sinus surgery. He explained the procedure to where she understood", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112046350063589526968", "name": "M J", "time": 1617746675071, "rating": 5.0, "text": "The assistant for Dr Lowery is very gentle and patient. Dr Lowery was very attentive and informative. I did not feel rushed as I usual do when visiting the doctors. Dr Lowery and his assistant listen and were compassionate. I would recommend them to my clients as well.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118241715010888133577", "name": "James Sparks", "time": 1617825141048, "rating": 5.0, "text": "Great experience.  Dr. Walton was wonderful and concerned about my illness. Would highly recommend if you need a great ENT", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102613799315012531350", "name": "Dana Price", "time": 1607193969266, "rating": 5.0, "text": "I saw Dr. Walters for the first time.... I am completely pleased! He took time with me , listened to me and discovered an issue that was previously missed by another ENT in my hometown. He took care of the problem and I felt immediately better! He will definitely be MY doctor from now on!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110115481554068986918", "name": "Lauren Gingo", "time": 1612680192404, "rating": 5.0, "text": "Dr. Fort seen my husband for a 2nd opinion and we were very impressed. He listened to all his concerns, explained in detail what he was thinking, prescribed him medication, and getting him to a specialist for more in depth testing for his trouble swallowing. He also wants him to follow up with him in the near future. One of the best Drs he's seen, not just ENT Dr's.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "107841753224888819299", "name": "Pamela Williams", "time": 1612467369274, "rating": 5.0, "text": "Dr Walters was very professional and answered my questions precisely. I will recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106998141012729230339", "name": "Ray White", "time": 1605305090089, "rating": 5.0, "text": "I was very happy with the office staff and with Dr. Lowery in their manner and concern for my well being. I highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108948349441784284622", "name": "D J", "time": 1608324642124, "rating": 5.0, "text": "They seem to be extremely cautious with Covid safety.  Dr. Walters is the BEST. Very patient,  explains well, answers all questions and really cares.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103746235602676490083", "name": "Bobbi Lee", "time": 1604173689837, "rating": 5.0, "text": "Excellent care, I felt welcomed and that all personnel were courteous and professional.  I was seen at my appointment time, in spite of COVID precautions and the aftereffects of Hurricane Zeta. Dr. Lowery was polite and answered my questions.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103424394194085224746", "name": "Heather Brownlee", "time": 1561036309536, "rating": 5.0, "text": "Went here yesterday for extreme ear pain. I had already been to a doctor and received antibiotics for what I was told was an inner ear infection. Upon arriving the nurses were extremely helpful and nice with helping me get my insurance figured out. I was taken to the back for a hearing test by another very nice lady she explained everything she was doing and explained the graph to me after we were completed. Dr.Walters was very thorough and looked in both ears more than once. He determined I DID NOT have an inner infection but, a protruding ear drum! He was able to pop it back in place for immediately relief. I was very happy with my visit here and everyone on the staff is extremely helpful and nice! I recommend anyone to go here!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109082315971785092268", "name": "Betty Bryant", "time": 1601771274314, "rating": 5.0, "text": "Prompt attention, thorough exam, left satisfied. Personnel very friendly.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106411139485337673177", "name": "Ala Barakat", "time": 1574714147498, "rating": 5.0, "text": "Friendly staff, no waiting on appointments. Dr. Walters was very friendly and knowledgeable. Highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108067481546921736104", "name": "Monty Reed", "time": 1603902935200, "rating": 5.0, "text": "Got me in same day I called. Fixed my gland immediately", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "113319179488473931618", "name": "Johnny Walker", "time": 1552072589188, "rating": 5.0, "text": "The staff is the best! They go out of their way to make you feel welcome and do an excellent job. I wouldn't considering going anywhere else and my treatment has been nothing short of a life changer.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112769715152790815053", "name": "TommyMary Grant", "time": 1605295090543, "rating": 5.0, "text": "In and out in a reasonable time", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105284883321240640723", "name": "Linda Lee", "time": 1603551441345, "rating": 5.0, "text": "Excellent serviice.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115527044841455865302", "name": "mike yeskevicz", "time": 1578437344859, "rating": 5.0, "text": "Dr.  W is great and very good bedside manner", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "111118226927417170590", "name": "James Patillo", "time": 1553719603482, "rating": 1.0, "text": "I was a patient of Dr. Jebeles for many years and was very pleased with him. In Nov 2018 I developed a severe nose bleed, something I never had previously. Had to go to emergency room where they advised me to go to my ENT Dr.  Which I did with Dr. David Walters with Southern EnT. He did nothing to treat the condition, other than advised me to go to the emergency room. Of course I told him I was at his office from what I was told to do from  emergency room Dr. that night the bleeding was severe and I called and talked to Dr . walters the next morning he advised me to go to the emergency room. Ayer a few days of  very severe bleeding I was able to get an  appointment  with  another ENT. Dr. Who immediately cart irised my nose.This Dr could not believe why Dr Walters would not treat this conditionThe bleeding was very severe and I felt it to be life threating. After almost 20 years I will never  go back to Southern ENT  And Sinus", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "117192137654006299074", "name": "Leah D", "time": 1479840431368, "rating": 5.0, "text": "I had a reaction to a steroid shot out of nowhere (that doesn't EVER happen to me), and the entire staff went out of their way to make sure I was taken care of. I was very much so blessed with their patience and kindness", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102494647938481819406", "name": "Lindsay Brock", "time": 1581728459297, "rating": 5.0, "text": "Great place great people 👍", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105138833436904284223", "name": "ANNimal 2020", "time": 1528596393523, "rating": 1.0, "text": "The rudest staff ever & Dr. Jebeles is in & out not hearing a word you say misdiagnosing you. Had to end up using another AWESOME ENT at ENT of Alabama at St. Vincent’s", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110847520477891799177", "name": "Mike MacMahon", "time": 1470661769547, "rating": 5.0, "text": "Prompt scheduling, attentive staff, and great doctors finally got me relief from my chronic sinusitis. Hooray!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "116296672795214289271", "name": "Ana Johnson", "time": 1497964879095, "rating": 5.0, "text": "Great staff! Quick and efficient!!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "107514143879872042110", "name": "Ramblin Rose", "time": 1625174885892, "rating": 5.0, "text": "Love the staff, they are always happy and talkative. They seem to like their jobs. It makes it easy to be there so often.", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "110756222938636559312", "name": "Mark Costlow", "time": 1605021945920, "rating": 5.0, "text": "In October 2020 I chose radiation therapy for my prostate cancer.  Dr Huddleston and staff put my spouse and me at ease immediately and throughout the entire 28 day treatment protocol.  Dr. Huddleston provided initial excellent counseling on the procedure benefits and cautions.  He was always available to answer questions and provide encouragement.  The staff was always ready, able, kind and professional.  I highly recommend Dr. Huddlestons' group.", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "113799057017253089964", "name": "Mike Schneider", "time": 1579839221743, "rating": 5.0, "text": "Dr. Huddleston, has assembled an amazing team of professionals at Gulf Coast Cancer Center in Foley. The radiology technicians that do the treatments are extremely professional. They do everything possible to make sure you are comfortable during your treatments. These technicians are extremely thoughtful and polite. The nurse is absolutely amazing, she is very much an important part of the treatment process. She will take the time to listen to you and answer your questions. She gave me the feeling that she actually cares about the patient. She is truly a special young woman. I believe that having my treatments done at Gulf Coast Cancer Center, was the best decision possible.", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "117068760405406453048", "name": "Robin Shaw", "time": 1565916272891, "rating": 5.0, "text": "Dr Huddleston along with his staff are exceptional! We are so fortunate to have such a talented group of Doctors living down in Gulf Shores AL. I was so relieved to not have to travel to Pensacola or Mobile for my daily treatments. Thankful for you all!", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "103225018632343435031", "name": "Bob Winchester", "time": 1581457200067, "rating": 5.0, "text": "The doctor and the entire staff exhibited the highest professionalism and patient care as I've observed at any medical facility.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "104655631910526164451", "name": "Jennifer Curry", "time": 1603207695918, "rating": 5.0, "text": "Very friendly staff..", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "109342578590803168528", "name": "Ralph Englehart", "time": 1542156825845, "rating": 5.0, "text": "The Dr and staff were the absolute best !", "pics": null, "resp": null, "gmap_id": "0x889a0def7ce45755:0x2b12704459915d75"}
{"user_id": "104183118095763930535", "name": "Rody Daw", "time": 1605814856202, "rating": 5.0, "text": "I wanted to update this review and direct it to all of the employees of this establishment! From the bottom of my heart I want to thank each and every one of you here in Andalusia. I pray for you everyday that's passed since Amy's passed on, you were her strength and her one personal hope to succeed in always fighting her leukemia. She always spoke highly of you Dr. Boatwright, and the whole team with you. Towards the end I wanted to let you know I had become so angry with this cancer of hers and a part of me wouldn't listen to any kind of words of defeat and I want to apologize for anything 😞 I may have said or done at the time! I pray that you could find it to forgive me one day for not doing more when it meant the most. I'm very sorry... If you can't then I absolutely understand and I would do the same if I were who I used to be. Amy didn't really have a great deal of friends or family besides her kids and their dad was always using them against her. I watched day in and day out of her struggle and almost everyday I had to go hide for a little while and cry my eyes out. And I knew it was coming in my mind and that haunted me so bad because I didn't want to live without her. To this very day 4 months after the grief and this horrific game of circle is at an all time high and her death has been difficult to bear. Thank you ❤️ Sacred Heart for always being there for her and for going above and beyond for every detail of her struggle! I'll forever be in your debt. They'll never be another day that I don't thank and pray for all of you. And if anyone out there has need for there care I promise you'll be making a very wise decision here! God Bless you all and may everyday of yours be blessed. Sincerely Rody", "pics": null, "resp": null, "gmap_id": "0x8891ec0677771add:0x7b0539872c727be3"}
{"user_id": "105267360896611097506", "name": "Jamie Cardwell", "time": 1528218289091, "rating": 1.0, "text": "Seems to be a communication issue amongst staff and patients.. Lab tech was very unprofessional and rude.", "pics": null, "resp": null, "gmap_id": "0x8891ec0677771add:0x7b0539872c727be3"}
{"user_id": "116105950205938467625", "name": "Arnold Clewell", "time": 1546263094341, "rating": 5.0, "text": "Kind and professional staff", "pics": null, "resp": null, "gmap_id": "0x8891ec0677771add:0x7b0539872c727be3"}
{"user_id": "104947071482703367264", "name": "emily", "time": 1616865225959, "rating": 1.0, "text": "Be careful a nurse named Jessica Rodgers was looking for fake covid 19 vaccination cards in order to not get her vaccine. She is putting you and your loved ones at risk so just be careful!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "106631866521501921835", "name": "Daniel Anderson", "time": 1603301036511, "rating": 5.0, "text": "They are a very nice place to have your treatment done and they have the best doctor's they are very friendly there and they care about your health I highly recommend this place to everyone that is fighting cancer", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "112462804369022258333", "name": "tierren blakely", "time": 1569348926256, "rating": 5.0, "text": "I had the very best experience when taking chemotherapy here. From the time you pull up at the door someone is there to greet you. Dr. Butler was my oncologist he’s so awesome. They made my experience as pleasant as possible and unforgettable in the best way! Everyone was amazing! Thank you all!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "109117123554610823628", "name": "Judy Lynn", "time": 1583183901602, "rating": 5.0, "text": "David Clarkson was the best dr my late husband could of had in my opinion", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "117534353771126700443", "name": "Lillian Jones", "time": 1568821268898, "rating": 5.0, "text": "I have been going to Mitchell Cancer since 2014, they have been wonderful to me and my husband    you are in good hands when you go to Mitchell Cancer Center.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNX5ZTI6e3YXfYBqBtkJ_m0fAg5h0BJM8_tJBBC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "107678325979178734546", "name": "Seth Novak", "time": 1575343679290, "rating": 1.0, "text": "This is the most horrible place to go doctor buttler is a lier they talk the talk but all in all they don't care about you I been suffering with pain for the past 6 years the hospitals lost my medical records and they pretty much called me a l liar sating because my medical records were lost they can't help me with my pain like I went and got all treatment for the hell of it because of this I rather die than get medical treated ever again", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "109880617768767953153", "name": "Clifford Kautz", "time": 1445892141845, "rating": 5.0, "text": "The Mitchell Cancer Institute  made us feel at ease the lady vallet  gave us hugs   and even  gave me a warm blanket when we got there. They seemed like we were truly important and cared about all of our concerns. Children and Women's hospital were top notch as well. We were given hugs  and made my family feel at ease during my surgery and my 4 day stay. 100% satisfaction guaranteed!! May God bless everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "108161772622788950929", "name": "Mary Boyer Bellipanni", "time": 1515287141226, "rating": 5.0, "text": "Dr. Finan no longer sees patients but he saved my life after I was diagnosed with ovarian cancer! He also was the doctor of my young friend and she was lucky enough to be able to have a baby. I came from 5 hours away and she 7 hours away just to see him! I trust him explicitely as does she! I highly recommend the doctors at Mitchell! Everyone I have ever met there has been very cordial and helpful! Please give them a call even if you suspect you have cancer! I wish I had called them FIRST and not had to have two operations!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "117175845132712646827", "name": "Eric Voivedich", "time": 1502397163091, "rating": 5.0, "text": "Just the best possible experience", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "101584021615459211318", "name": "Jeremy Kervin", "time": 1489082591377, "rating": 5.0, "text": "Beautiful place and all oncologist are angels", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "110647761342157897038", "name": "Linda Jaynes", "time": 1509473327257, "rating": 5.0, "text": "(Translated by Google) I couldn't ask how to better cancer issue you do care Of me. Thank you Dr. Ove and yor nurse Michelle\n\n(Original)\nI couldnt hace ask forma a better cáncer tema ti hace talen Care Of me.  Thank you Dr.  Ove and yor nurse Michelle", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
