{"user_id": "100605816895313515138", "name": "Reed Rogers", "time": 1565727203315, "rating": 5.0, "text": "Once you walk into The Picture Show gift shop, the wonderful smell leaves you feeling great all day.  There is such an incredible variety of gifts for any occasion you could want, and more.  Michelle creates an environment that you will want to come back to day after day to get gifts and visit.  HIGHLY recommended!", "pics": null, "resp": null, "gmap_id": "0x889a408ffc2f998b:0xc3ae8933e7f75aa"}
{"user_id": "108447191281705605701", "name": "Vince Napoli", "time": 1555161312782, "rating": 5.0, "text": "Great variety of Swan Creek candles! The Gingerbread and Hazelnut scents are amazing and last so long. Nice selection of cute signs and other decor items. The owner is so helpful and kind.", "pics": null, "resp": null, "gmap_id": "0x889a408ffc2f998b:0xc3ae8933e7f75aa"}
{"user_id": "108657988716173963439", "name": "Livin the dream with Chuck and Lola", "time": 1446490100969, "rating": 5.0, "text": "One of the most eclectic shops in the area. You can look for hours and always find something new.\n\nSomething for everyone.", "pics": null, "resp": null, "gmap_id": "0x889a408ffc2f998b:0xc3ae8933e7f75aa"}
{"user_id": "117442583091071786902", "name": "Tameka Colvin-Lewis", "time": 1603677224438, "rating": 5.0, "text": "I absolutely love shopping at Yankee Candle. Meghan and Allison are the absolute best. They are always super helpful and I feel like family when I shop there. AWESOME shopping experience!!!!", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "104687800004070993257", "name": "Ju Mc", "time": 1602296694134, "rating": 5.0, "text": "The crew are great employees and brand ambassadors but Allison, Julia, and the rest of the crew (including the Eros) are great people to be around.", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "118157507283950817652", "name": "Róisín Blanks", "time": 1542177450832, "rating": 5.0, "text": "I always get some solid smelling candles here that last a respectable amount of time. However the staff here really sets this location apart. They are incredibly helpful and polite, always happy to chat, and one of them today even remembered me from a visit months ago. That’s some awesome customer service and always makes for a great experience.", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "116074996358440824742", "name": "Nicholas Emerton", "time": 1548722522898, "rating": 1.0, "text": "I visited this store once....and only once. The “manager” Allison, was exceptionally rude and overbearing. She has a very strong “I’m better than you and you don’t know anything” attitude that I found very off putting.\n\nI had gone in to buy a specific candle for my mother and she had the audacity to question my selection (I assume because it was cheaper candle and not a full price $40. One)  saying “are you sure your mom would even like that?”\n\nIf this store is ever going to survive it needs a drastic change in management. I wouldn’t recommend going here. Ever.\n\nUnless snarky attitude and a god complex Is what you  look for in a retail environment.", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "109497726132610732106", "name": "Amanda Etheridge", "time": 1425690162577, "rating": 5.0, "text": "LOVE this store!!!\nThe staff, especially Kimberly, are super friendly and know my husband & I by name. She ALWAYS makes sure we have what we want, especially at Halloween, she's the best!", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "111932026090820778154", "name": "Google ruined Youtube", "time": 1533235981870, "rating": 1.0, "text": "These candles never have throws anymore. Such a waste of money and way too expensive. The staff here has always been overbearing and smothering when I'm in here. So for multiple reasons, I just walk a few stores away to White Barn/B&BW where I not only get better prices, but better throws as well. And the employees leave me in peace.", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "108351543730501090188", "name": "Dee4X Brown", "time": 1573347038102, "rating": 5.0, "text": "Sydney made the selection very easy", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "111001290269934249487", "name": "Todd Hooper", "time": 1507943774086, "rating": 5.0, "text": "The staff here were very friendly.  They were very helpful in my search for a present.", "pics": null, "resp": null, "gmap_id": "0x88892216ec062aab:0xcc0d020c632478e6"}
{"user_id": "116643094637023566513", "name": "Beachful Bliss", "time": 1615485666022, "rating": 5.0, "text": "Southern Soy Candle Co. is absolutely the best!  The candles smell absolutely amazing!  Excellent customer service and swift service.  They are great at explaining scents and ideas. I am thrilled that they are local.  I strongly recommend everyone try their candles and other fantastic products.  I love my Fragrance To Go for my car.  Not only does it smell fantastic but also looks great!  Great all around!!", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "107920935323141171498", "name": "Julie Zerk", "time": 1583782587819, "rating": 5.0, "text": "I love the creativity of these candles! From the beautiful artwork on the labels, to the engraved wooden lids- they are top of the line. My favorites are the True Crime series!", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "112215863812671648850", "name": "Faith Stringfellow", "time": 1583776320911, "rating": 5.0, "text": "I love this company so much. My favorite is the king cake scent and the doughbowl looks beautiful in my home. I tell all of my friends about them.", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "100544872789720984837", "name": "Colby and Kimberly Powell", "time": 1531930220997, "rating": 5.0, "text": "These are the most amazing candles.  They don’t just make one room smell amazing.  It actually travels through your home.  I’m super excited to get the fragrance to go Alabama A for my trucks.  Just ordered.  They look awesome.", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "116161930737049106106", "name": "Kim Jones", "time": 1539125517585, "rating": 5.0, "text": "Amazing, high quality hand-made products! All the scents smell so good that it makes it hard to choose! The fragrance to go is the best air freshener I have ever used in my vehicle. I highly recommend these products!", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "100329044756260908844", "name": "Posh Life With Vanessa", "time": 1532043368327, "rating": 5.0, "text": "I absolutely love everything they have! The scents last so long. I’m happy to be supporting a local business.", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "103648912284857759697", "name": "Anne Gilbert", "time": 1559850044547, "rating": 5.0, "text": "Honestly there’s not a scent I don’t love. Usually I get headaches from a majority of fragrances, but I have not experienced that with these products. Also, I love the fact that they are a small business and I can help support that dream!", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "113526755129273179604", "name": "Grady Miller", "time": 1531877448803, "rating": 5.0, "text": "Love soy candles!", "pics": null, "resp": null, "gmap_id": "0x889bb330f952380d:0xc9c2ab1ef8811780"}
{"user_id": "109675571209839423387", "name": "Debra McCaskill", "time": 1549650952295, "rating": 4.0, "text": "Trying to find the right phone listing for this place. The one given is not correct.", "pics": null, "resp": null, "gmap_id": "0x888c14fe3cac05cd:0xe24d2e88abea4937"}
{"user_id": "107826882674548477906", "name": "Trish Norman", "time": 1513425784049, "rating": 5.0, "text": "Everything smells so good", "pics": null, "resp": null, "gmap_id": "0x888c14fe3cac05cd:0xe24d2e88abea4937"}
{"user_id": "107747808339857227710", "name": "Daniel Whisenant", "time": 1615940318375, "rating": 5.0, "text": "I bought these cancels as a gift for my support staff located around the country. Everyone of them wrote me back to tell me how wonderful they are. They are also what we run in our house and they have a great long lasting aroma.", "pics": null, "resp": null, "gmap_id": "0x88626bce25d079e1:0xb1f81f56f24b2806"}
{"user_id": "101863797395091878337", "name": "Susan Quinn", "time": 1605647419078, "rating": 5.0, "text": "These are the \"best\" candles I've ever found. Love all the scents, Pipe Dream my fav!!! Very cool owners too. Glad I stumbled over them while in Downtown Huntsville visiting.", "pics": null, "resp": null, "gmap_id": "0x88626bce25d079e1:0xb1f81f56f24b2806"}
{"user_id": "104919038598558035052", "name": "Courtney Grimes", "time": 1628990462879, "rating": 5.0, "text": "For my daughters sweet 16 we spent a few days in Gulf Shores. The only thing she really wanted to make sure she got to do was go in this store. We spent maybe 2.5 hours searchig for our treasures and we just had an amazing experience.  When we walked in the store you could feel the energy. The owner was so kind. He recommended a few items to us . Selenite and black tourmaline. I really appreciated that he took his time to talk to us and educate us. I hope to visit again before the shop goes to online.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116154995279004995480", "name": "Kinsley Keeton", "time": 1627231081087, "rating": 5.0, "text": "I went here while I was staying in the area on vacation and was looking for a tigers eye bracelet. I easily found just what I was looking for and even bought another crystal. It had almost every crystal I was interested in I will definitely be visiting again next time I'm in town!", "pics": null, "resp": {"time": 1627235105203, "text": "Thank you for the review and your support! Be sure to subscribe to our email for the new location announcement. Our last day in our current location will be Aug 29th. 🙏💜 we will also have a new online website launch in October. Thank you again and we hope you enjoy the rest of your time here in Coastal Alabama."}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "110733453251905385992", "name": "Stormy Rainbows", "time": 1620442898043, "rating": 5.0, "text": "Amazing customer service- My twin two year old toddlers were acting 🤪🤪..The amazing gentlemen came over and let them pick some small black tourmaline for them to keep to help calm them! Then we had forgot our debit card and the nice woman at the desk wasn’t bothered at all in my son still acting a mess. Prices were FANTASTIC! They even have a small mining sluice. Will definitely be making this one of my go to crystal shops! Thank y’all so much for your patience and guidance.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "113554856234577824078", "name": "Kennedy Grace", "time": 1617818744528, "rating": 5.0, "text": "I loved it so much I was only in orange beach for a week and went to coastal zen 3 TIMES. I'm addicted. The staff was really friendly. and the prices are the best I've ever seen. And with them being online now too! they are the only place I'll ever get my spiritual needs.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109644323027919237260", "name": "Mariam Smith", "time": 1625258382531, "rating": 5.0, "text": "My sister and I did a sand bucket panning, it was very amusing and we got a nice selection of rocks and shark teeth! Everything was really cute too, I ended up with some cool mushroom stickers myself ☺️", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO8bGYgt8pNn8NH4Fgq8M_UWorgVDYYNRr4oBIB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCQ1Z4lKZg_wjbG3qTfxWZTHHUCatpKlOD3LsS=w150-h150-k-no-p"]}], "resp": {"time": 1625336407833, "text": "Yeah! Thank you for the review, we appreciate you! So glad you two enjoyed the mining ⛏ have a wonderful weekend!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115598439405820901004", "name": "Allison Chapman", "time": 1614098858325, "rating": 5.0, "text": "I will visit here every time we go to Gulf Shores or Orange beach!! I will have to shop in their online store until then! It was such a peaceful store. The owner was very courteous and helped us but he didn't hover over us like many shops will. We spent almost an hour shopping and everything was well worth its price! So glad we found this gem on our day trip I will be enjoying my goodies for a long time!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "101273241703564572255", "name": "Shawn Mitchell", "time": 1617840710373, "rating": 5.0, "text": "This was by far our favorite shop at The Wharf. We got lucky and were there when the owners were in the store. We were looking at the petrified wood and they ended up showing us so many more interesting pieces! They have this store because they love the stones and other items. Everything was reasonably priced and beautiful!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "118431549054480056261", "name": "Sierota Beth Brackett", "time": 1545067453993, "rating": 5.0, "text": "My experience at A Coastal Zen was fabulous! The owners are warm and welcoming. I felt very much at home as I browsed through their collection of healing crystals, ritual candles & incense, inspirational/motivational art, spiritual & meditation tools, and all sorts of unique trinkets and decorations. The store is filled with interesting products from across the world. There is something here for everyone! The owners even showed me a few of their prized personal possessions which were kept in the back room, making me feel like V.I.P.  The store itself was well kept...which I can only imagine to be a constant struggle considering how many shelves and items must be dusted frequently to maintain the clean environment. Everything sparkles! If you have the chance, ask the owner about the musical vibrations produced by the bronze gong hanging behind the register -- it makes beautiful sounds which fill the space entirely, engulfing it's visitors in a sense of peace and tranquility. This store is just the kind of retail attraction our community needs in this area - Definitely recommend visiting A Coastal Zen as soon as possible!!! Bring more money than you think you will need because you will be surprised how many items will strike your fancy! The owners are well educated in product knowledge and price the pieces very, very reasonably. It's a treasure trove of goodies!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6tYhpY_pMuZpJO8S_typrW-ZMwGWMcZoT_6-M=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2hVRgi4jSugsZNl_wWH5F6VEsuvuoII7AFCkY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkK_x-caP5-0GhCKa7vuRO-zR9iOdUfJlqGvqc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRgnVpymKcLYk0TqJBglyJycKLrevPqLIrm3Nl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNeh4dCZxY8xpGux4bZ6NeguJyDhyH5mMXjdOZ_=w150-h150-k-no-p"]}], "resp": {"time": 1573675648474, "text": "Thank you so very much for such a glowing review. We love our customers and so look forward to you visiting us again."}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "108285055030902494329", "name": "Ken", "time": 1625697423221, "rating": 5.0, "text": "absolutely amazing the store keepers where very helpful and i got exactly what i needed 5 stares", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "111887870042968438633", "name": "Pansexual doom", "time": 1625105409897, "rating": 5.0, "text": "I went to the warf on a vacation and stumbled apon this place, it is so cute and welcoming, the prices are super reasonable and the family that owns the place is so kind and helpful, if you are LGBTQ+ or wiccan/pagan/spiritual this place is a safe space and offers you things to show your pride or help your spiritual journey!!! I can't stress how much serotonin A Coastal Zen gives me!!!", "pics": null, "resp": {"time": 1625118393227, "text": "Awe… you made my night 💕🌈♥️ we appreciate the love and You!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "105941527717159744501", "name": "Free Me", "time": 1584473806085, "rating": 5.0, "text": "My birthday just got better!\n\nThe kids and I came in for a little Crystal mining ⛏ and had a blast learning about different stones and their meanings. I definitely recommend Coastal Zen ! They have great prices and welcoming customer service 🤩🤩🤩🤩🤩 don’t let no hater tell you different 👏🏽👏🏽👏🏽 That’s on period 🙃", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwNmIDwzcb5MeoXNTmesdNXbn-gZntZ4Umt-Oz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115188196653563439665", "name": "Antoinette Hardy", "time": 1608208837981, "rating": 3.0, "text": "I bought my custom made ring from here and I'm totally happy with it. Katherine helped me and she was very patient with me, as I am a very picky. She is very knowledgeable about diamond and will find you a diamond at a reasonable price.", "pics": null, "resp": {"time": 1608219544580, "text": "Hi Antoinette\n\nThank you for a review but I think you may have us mistaken with another company. We do not sell diamond rings nor do we have anyone who works for us named Katherine.\n\nWe are a rock/crystal shop\nIn a orange Beach ❤️\n\nHope you have a great Holiday Season!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "110767971739173120893", "name": "Michelle Murr", "time": 1601868902031, "rating": 5.0, "text": "If you are looking for something and you're not sure what, this is THE PLACE FOR YOU!  Went with a friend in search of specific stones and spent a ridiculous amount of time in the store.  Amazing people and amazing products.  I left with bracelets for myself and friends, rocks for same, prayer candles and a great gift for a friend who is a healer.  A beautiful blessing awaits you, don't miss a chance to check this place out!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107724408712202242719", "name": "Alexandra Co", "time": 1615577340375, "rating": 5.0, "text": "Love this store! Nice ambiance, great selection and the staff is always so helpful, patient and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "101911035290047174789", "name": "Melodye Harleen", "time": 1606730909803, "rating": 4.0, "text": "This place is a non-negotiable part of every trip up north for my brother and I. I generally love bookstores, especially intimate and down to earth bookstores with interesting selections. Loved this place even before I knew all the history it held.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "103423060263731217105", "name": "kxlciii", "time": 1627412527544, "rating": 5.0, "text": "best crystal shop <3", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116719870754323782638", "name": "Don Cheek", "time": 1599139084316, "rating": 5.0, "text": "Glad that we took the time to visit this store. Me and the wife found stones for us both. It was mind blowing how much information Stan gave us and in the decision that we made in our purchases. Will definitely return.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "102986450079815730631", "name": "Suerianne Davis", "time": 1590440305578, "rating": 5.0, "text": "The selection and quality in this store are amazing! The personal attention and the knowledge that Stan and his staff provide makes choosing the stones and jewelry and clusters really gratifying.  Moreover, Stan was willing to work with me to sell and mail an order when I could not travel to Alabama.  I look forward to returning when traveling is safe.  Such a wonderful experience to be at A Coastal Zen!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115759241595641884334", "name": "Lisa Hannah", "time": 1591895445895, "rating": 5.0, "text": "I love this place!! I found it 3yrs ago on our annual trip to Gulf Shores from Missouri my trip is not complete without shopping here for my yearly supplies. They are so friendly and helpful!! Also they have descriptions and uses with each stone its so amazing!! Thank You!! Will see you again in March!!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "117978009444163928080", "name": "Peyton Cole", "time": 1584324349393, "rating": 5.0, "text": "Hey I told y’all I was coming back today but I didn’t keep my word I went on home but I really appreciate all the knowledge Stan blessed me and my family with. I also appreciate the sweet deal he gave me! Hopefully me and my family luck and energy will begin to turn around and be positive", "pics": null, "resp": {"time": 1584367872216, "text": "Thank you, Peyton!  So glad you enjoyed your visit with Stan and hope you come back to see us soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "117418893460506038166", "name": "Kathy Humphres", "time": 1579051086951, "rating": 5.0, "text": "Awesome place with so many cool things and very reasonable prices. I love to go there the owners are so friendly and helpful I could spend hours just checking everything out. If you’re ever in the area you should check them out.", "pics": null, "resp": {"time": 1579218957302, "text": "Thank you, Kathy!  So glad you enjoyed your visit and hope you come back soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "106989566317636622074", "name": "Debbie Busby", "time": 1562794546606, "rating": 5.0, "text": "Very neat little shop! Beautiful crystals, stones salt lamps. Bracelets, earrings etc...\nI was able to find all of my  souvenirs to take back home with me. While I was there they have this mining  thing for children to kinda of mine for their own shells or crystals‼️ Super Cute. Great Customer Service❤️", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100531477350519372235", "name": "Glenda Zollicoffer-Harrel", "time": 1564343270460, "rating": 5.0, "text": "I had such a wonderful experience there yesterday. The owner was so nice. I bought so many pieces, but not everything I wanted, she told they had an online store for using later. gave. She also have me some useful information on traveling back this way next time. I will definitely be shopping online with her.", "pics": null, "resp": {"time": 1579219130908, "text": "Thank you, Glenda!  We so appreciate you taking the time to write us such a glowing review!  Come back soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109410246963741394529", "name": "Tina Cozart", "time": 1603655063085, "rating": 5.0, "text": "Beautiful store, friendly staff and great prices! 💯🥰✨", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "105879156417845088894", "name": "Susanna Forbes", "time": 1582992340490, "rating": 5.0, "text": "Coastal Zen is wonderful, the staff is always very helpful, everything is crazy affordable and they have everything you need. Stan is very helpful and really knows what he's taking about. I always spend way more than I would want to there, but it's totally worth it ❤️", "pics": null, "resp": {"time": 1583410190075, "text": "Thank you, Susanna!  We have the best customers and love that you enjoy shopping with us as much as we appreciate you!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115817234154721227843", "name": "Brandy McGee", "time": 1569379582555, "rating": 5.0, "text": "I’m a huge crystal hound and I was so excited to find this shop on my vacation here. The girl working was super sweet and very knowledgeable. I overheard her helping some ladies to pick out stones and she really knew her stuff. I found a lot a crystals that I didn’t have in my collection. Most expensive one was $3. I love this place!!!", "pics": null, "resp": {"time": 1573675707870, "text": "Thank you, Brandy!  We are so glad you found us and hope you make a repeat visit to our area soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "118410199404825866695", "name": "PαԵԵí Aղժҽɾsօղ", "time": 1583534648758, "rating": 5.0, "text": "Just from the reviews and photos of the shop I want to go visit! I'm a local and will certainly drop some dough on some crystals, tapestries, tarot?, and more😊 I CAN'T WAIT!! Thank you for opening a metaphysical shop in our area! ❤️", "pics": null, "resp": {"time": 1584029592689, "text": "Hi Patti 🙏 I finally figured out how to access these reviews and respond 😇 thank you so very much for the love and support❣️ let us know if we may assist you with any of your spiritual tool needs or if you just want a little pick me 😘 also send a text to the shop phone 251-752-3489 and let us know who you are and we will text you back a discount code to use in the shop or online 😍 Many blessings and much gratitude always 🙏💙😇 MK"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107585261266153304423", "name": "Princess MeMe", "time": 1535217287922, "rating": 5.0, "text": "We had a very welcoming experience. Staff/Owners were very friendly and helpful, not pushy, they were happy to help and answer questions. They made us feel like friends instead of customers. They had a great selection, I had a hard time choosing so I got a few items, We definitely recommend this awesome place. Thank you so much for all you've done for us. Be Blessed!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "108688241742096002504", "name": "Denise Davies", "time": 1584008057130, "rating": 5.0, "text": "Found this place during my yearly October orange beach visit with my husband. I wanted to find a real metaphysical shop, and this is a hidden little gem at the wharf. Whimsical, clean, and the staff was incredibly sweet. 10/10 will visit and give my business every time I visit.", "pics": null, "resp": {"time": 1584029392534, "text": "Hi Denise ❤️ thank you for your kind words and wonderful feedback! We truly appreciate all of our customers and we love hearing feedback! In a world full of rocks you are one of our favorite Gems 💎 😘✌️😍 many blessings to you and your loved ones always! MK"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "102583738884171537878", "name": "Sarah Wyckoff", "time": 1537889341847, "rating": 5.0, "text": "This shop is wonderful, and there is nothing quite like it in our area! The selection is great, and the prices are very reasonable. The staff were so friendly and helpful. I will definitely make this a regular stop!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "104018556506574443253", "name": "Brandy Knodel", "time": 1577908146001, "rating": 5.0, "text": "My absolute favorite store ever. Love you all and thank you for walking with me down my crystal journey.", "pics": null, "resp": {"time": 1578078515213, "text": "Thank you, Brandy. We do enjoy our customers and love making their experience a fun one when they visit us. We hope you visit us often!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116561567481842370655", "name": "Cara Prentice", "time": 1534638274181, "rating": 5.0, "text": "Loved this place! It was so nice to find a store that is so peaceful and inviting in a busy tourist area. Great selection of crystals, stones, jewlery & more. Owners are great and very knowledgeable. Make sure to ask them to show you what they know!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "111067639276278611653", "name": "Lauralea Lasher", "time": 1533939949251, "rating": 5.0, "text": "A wide variety of crystals and stones. Extremely reasonable pricing. Great selection on natural quartz crystals. As well as knowledgeable and friendly staff. I had to come back twice in a week for more!", "pics": null, "resp": {"time": 1533959835385, "text": "Thank you! We are so excited to be open and sharing our love of Crystals and things Love! We truly appreciate you taking the time to leave us a review! May you always be showered with Blessings!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107458850428980040331", "name": "Rachel Lavergne", "time": 1534546676072, "rating": 5.0, "text": "Absolutely love this place, I found a beautiful Mermaid light for a reasonable price and they were even nice enough to offer me a discount since I was from out of state. They have so much to offer, glad I stopped by!!!!\n\n-Rachel", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "113309432870010260344", "name": "Lindsay Hoebing", "time": 1534460765463, "rating": 5.0, "text": "What a wonderful establishment! There’s such a wide array of items available. The owner is very knowledgeable about everything in the store as well. I wish there were more stores like this!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100276064635021776205", "name": "patricia forrest", "time": 1535233043231, "rating": 5.0, "text": "So grateful this shop is here now! Beautiful store with a great selection and incredible customer service. There's something for everyone here and the owners are extremely knowledgeable and so, so kind!! 💙🙏💚", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "104523760068173848331", "name": "dolly wallace", "time": 1537997882878, "rating": 5.0, "text": "Outstanding customer service and were very knowledgeable about their inventory. Liked them so much I will buy from their online store until my next visit to Orange Beach.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100544967325688369505", "name": "Jeremy Thomas", "time": 1534002650470, "rating": 5.0, "text": "Really cool stones, very nice!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109876929732465867477", "name": "Paula Lindon", "time": 1628029653097, "rating": 5.0, "text": "Very friendly staff. Went above and beyond to find the scent I wanted in wallflowers even though they did not have it on the floor. The sales associate with certain they had it and she looked in other places in the store and found it for me. Very impressed!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1620287732291, "rating": 5.0, "text": "I shopped at this location a few weeks ago for the first time and was impressed! I wasn't hounded, but yet I wasn't ignored either. The store was spiffy, the guy who helped me out on the floor was super nice and knowledgeable. And best of all... no Bridgestreet traffic!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "101571847249574868157", "name": "Naomi Cooper", "time": 1627227480541, "rating": 5.0, "text": "Greeted immed, asked us what we were looking for, AWESOME CUSTOMER SERVICE", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "107343106038946617219", "name": "Whitney Anyanwu", "time": 1624888198943, "rating": 4.0, "text": "Very attentive staff, smaller store but has a good stock.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "103455665376002914146", "name": "Angelia Rembert", "time": 1615736837333, "rating": 1.0, "text": "I came in after working out, the 2 ladies were so focused on me and constantly asking me questions that they couldn't see the 2 women that was stealing merchandise! I (PURCHASED) over $176 worth of what I like. Employees everyone does not steal no matter what you (look) like.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "107814774395505029820", "name": "Shalea154", "time": 1604877689813, "rating": 1.0, "text": "We have given this store 3 different tries. Each time, the employees only care about chatting with each other or looking at their phones. This visit, I finally had to step out of line and go ask a group of 4 associates if anyone in the store is actually qualified to work a register. And by the way, the “Keith” that posted that the staff is great, works there.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "109614625940158012225", "name": "Sarah Bradley", "time": 1610641430392, "rating": 5.0, "text": "Hours as of 1/14/21\nSunday 12p-6p\nMonday 9a-9p\nTuesday 10a-9p\nWednesday 10a-9p\nThursday 10a-9p\nFriday 10a-9p\nSaturday 10a-9p\n\nWe have updated our hours on Google numerous times, including submitting photos. It continuously reverts back to the old hours of operation. Please call the store to confirm hours if you are unsure. We are working hard to stay open and safe for our customers!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "109774557906538374762", "name": "natashia toney", "time": 1628639000718, "rating": 4.0, "text": "They're usually pretty helpful", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "107390838624626091985", "name": "Tonio Cardenas", "time": 1606834538649, "rating": 5.0, "text": "I love this store so much it’s one one the prettiest store in Huntsville! I love the staff they are super friendly I just can’t anything wrong about them!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "110937319386178927481", "name": "Kim Hegwoid", "time": 1629429057561, "rating": 2.0, "text": "Clean not friendly service", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "115264550128720074941", "name": "eddie owen", "time": 1609078224770, "rating": 5.0, "text": "Always the right gift. Good product, good price.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "111866616013405969643", "name": "Alicia Matthews", "time": 1605456205408, "rating": 1.0, "text": "Really annoyed that the online hours reflect that this location opens at 10am. Drove all the way over to only  see a sign that shows they open at noon on Sunday. Change the online hours!!!", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "103030976107740606070", "name": "Keith Heidecker", "time": 1601347604143, "rating": 5.0, "text": "So glad this store is open. Such a friendly staff.", "pics": null, "resp": null, "gmap_id": "0x886213e68e4c9da9:0x690c2169ee96fade"}
{"user_id": "110106882032690837594", "name": "Nick Armstrong", "time": 1619652004102, "rating": 5.0, "text": "Nice place!  There is something for everyone here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOsbMlM9szGRW_0bglvfCHK0GHIfV33OvPIzydB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOi2GhIvk-CkdymlmQN2d10zcJ6k4YQh1QmE8zo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "106615113739338649685", "name": "Ed Harding", "time": 1612997587669, "rating": 1.0, "text": "Hope you dont have a bathroom emergency.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "116756472950552781366", "name": "Jim Strobak", "time": 1565903799805, "rating": 4.0, "text": "The people are really nice. They have alot of items that are antiques but alot of items that are for sale that aren't. It is a nice place to look around.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "109799618878597199722", "name": "Emery Harkins", "time": 1574285172276, "rating": 5.0, "text": "This was nice place Still new but growing.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "101534896635913358501", "name": "Rod Gunter", "time": 1425403950592, "rating": 5.0, "text": "Best antique store in the area. Donna is very cordial and will help you find what you need. We've bought many items there from knickknacks to chairs to hutches to rugs. We love shopping there.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "108662902956671730208", "name": "Laura Crabtree", "time": 1557000066665, "rating": 5.0, "text": "Great vintage selection.  Very nice owners.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "112984818277366662386", "name": "Jane Edwards", "time": 1572127304944, "rating": 5.0, "text": "This place had great prices.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "107850086868186712893", "name": "Rachel Morris", "time": 1486243539103, "rating": 5.0, "text": "I love finding treasures in this store! It is my favorite local antique store, and I visit it frequently. They have even recently added a clothing boutique in the back!", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "111114043255429451142", "name": "Roy Woods", "time": 1569364184282, "rating": 5.0, "text": "neat place and lots to look at.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "104191201790242584995", "name": "Mary Brewer", "time": 1491410268141, "rating": 5.0, "text": "This store has a huge variety of quality furniture, unique items, jewelry, clothes and much more!", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "115325471354920712481", "name": "Sally Higgins", "time": 1580593861354, "rating": 2.0, "text": "Not the same store that it used to be. The name is deceiving.  Not so many antiques as new furniture now. It has changed owners.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "112005800127556459814", "name": "Lance M", "time": 1542334085167, "rating": 5.0, "text": "Best place for unique home decor", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "112605313936614325215", "name": "Samantha Barksdale", "time": 1560113910269, "rating": 4.0, "text": "Good antique store.", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "118354383778389196708", "name": "Justin King", "time": 1491258636446, "rating": 5.0, "text": "Unique and lovely buying experience", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "113871494337765708060", "name": "Dorothy Wilson", "time": 1536434486705, "rating": 5.0, "text": "Great place to shop", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "113330955385637914441", "name": "Alesia Brown", "time": 1505958089525, "rating": 5.0, "text": "Always find a treasure", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "103526571369792351714", "name": "Saphronia Winkles", "time": 1550803220031, "rating": 5.0, "text": "awesome, awesome, awesome", "pics": null, "resp": null, "gmap_id": "0x8889f8d442987ca3:0x93dd38d723542207"}
{"user_id": "105994138020960675915", "name": "Jennifer Adams", "time": 1621041395127, "rating": 5.0, "text": "So much fun! Easy and foolproof but still a lot of fun. You can byob so a perfect girls activity or work event.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNoRZTrv-cZeSpYhfLIWjoyvT8HTM-xb1PBSFNi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqAhmoqjCIPn0dfwGpvkDLHHmTxgm96XWK9DeF=w150-h150-k-no-p"]}], "resp": {"time": 1621258024716, "text": "Hi Jennifer! Thank you so much for coming to see us and for taking the time to leave us a review and share your photos! We are so glad you had fun, and we can't wait to host you again soon 💕"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "103670955717052866121", "name": "Taylor Gage Swafford", "time": 1628296492680, "rating": 5.0, "text": "A fun experience in Birmingham especially if you are looking for something different. Great for date night!", "pics": null, "resp": {"time": 1628297251108, "text": "Hey Taylor! Thanks for your feedback we are glad you had a great time! We look forward to hosting you again!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "115573292653876034770", "name": "JC Gloria", "time": 1628172301015, "rating": 1.0, "text": "I felt rushed and pressured on Saturday and will not be returning. I appreciate the response from the owner. The dark headed male rolled his eyes at me and actually snapped his fingers to get my attention. unprofessional at a minimum and offensive.", "pics": null, "resp": {"time": 1628013581290, "text": "Hi JC Gloria! At Paddywax we take our guests experience seriously & we are sorry to hear you didn’t enjoy your time with us. If you’d like to share feedback on your experience please feel free to contact our Store Manager at (205)502-7059. Thank you!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "113838412402727067214", "name": "Chapman Smith", "time": 1621637706274, "rating": 5.0, "text": "So fun! I went in just thinking it would be a fun time for my fiancée but actually had so much fun myself! The hardest part is choosing between the giant wall of candle vessels (all of which are reusable for everyday and household use)! We’ll definitely be coming back!", "pics": null, "resp": {"time": 1622401104439, "text": "Hi Chapman! I'm pleased to hear you had a great time!We look forward to hosting you again. Remember to bring your vessel in for a refill at a discount of $20."}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "108212131142076750195", "name": "Chelsea Johnson", "time": 1601259278517, "rating": 5.0, "text": "We went with a large group of girls for the first time ever and we absolutely loved it! The instructor was so fun and helpful. They followed CDC guidelines strictly, so it felt very safe! We were only allowed to take off our masks for a quick photo and to sip our drinks. We actually learned a ton about candles and really enjoyed every second of our experience. We will certainly be back!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMGoTSJP886TPU9EJRGCjCh3WNIfdgVUvlYl-I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPHbH8YNLzVAErYcPCSXrfsliY6IMsshMIFC8c4=w150-h150-k-no-p"]}], "resp": {"time": 1601297629544, "text": "Hi Chelsea! Thanks so much for leaving this review and for coming to see us and support us during this time! We are so pleased to hear you had such a great time, and we had a great time hosting you! Enjoy those candles, and we hope to see you and your crew again soon!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "108840511639078685938", "name": "Ashlyn Schranz", "time": 1621637501440, "rating": 5.0, "text": "Absolutely amazing! Great prices, great service, and a whole lot of fun! 10/10 will definitely be back", "pics": null, "resp": {"time": 1622401165538, "text": "Hi Ashlyn glad to hear you had a great time! We look forward to hosting you again! Remember to bring your vessel back in for a refill at a discount of $20."}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "104828351466025217313", "name": "Crystal Hibbler", "time": 1605394908043, "rating": 5.0, "text": "Went with a few of sorority sisters.Absolutely worth the experience. Enjoyed every minute. So much fun!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOluDP9ImnbXlfk79nZsbzNmpxIOy_zd3JY1hvD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "115327266496204954162", "name": "Lawanda Arnold Keller", "time": 1604268933812, "rating": 5.0, "text": "Booked a class for my husband & I and it was great. The atmosphere is great & the staff made us feel welcome. The vessels and scents are amazing. So many to choose from. I'm definitely looking forward to going back again.", "pics": null, "resp": {"time": 1604323635289, "text": "Hi Lawanda! We are so happy to hear that you enjoyed your Candle Bar experience, and we can't wait to host you both again 💕 Thanks so very much for supporting us and for taking the time to leave this review!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "111219446139351739035", "name": "Kathleen Cook", "time": 1596729542606, "rating": 5.0, "text": "We had a birthday party at Paddywax! They made us feel so welcome and guided us through the candle making process. We had 9 girls in our party and it was a great size group! We are making plans to go back!!", "pics": null, "resp": {"time": 1596733255866, "text": "Kathleen! Thanks so much for coming in and taking the time to leave us a review! So glad you enjoyed your experience. We can't wait to host you all again!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "118310817222255404285", "name": "Denise Norris", "time": 1591162328481, "rating": 5.0, "text": "OMG! I had an amazing time. My best friend and I actually went this past Saturday everything ran so smoothly. Gloves were provided for that extra security. The staff was amazing and super friendly. I'll\ndefinitely be back.", "pics": null, "resp": {"time": 1591197238436, "text": "Hey Denise! A huge thanks to you for taking the time out of your day to leave us a review! We're so glad you felt safe and had a good time with us! Come back for a refill soon :)"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "103589269722255930085", "name": "Baylee Vest", "time": 1590269371180, "rating": 5.0, "text": "Definitely recommend as a date nigh idea or just to hang out with friends! The employees are SUPER nice. When my friends and I went in they made you feel like friends and not customers! I could not have asked for a better experience and customer service!", "pics": null, "resp": {"time": 1590683627558, "text": "Thanks for taking the time to leave a review, Baylee! We so appreciate your kind words and hope to host you again soon!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "114795178885077161051", "name": "Callie Miller", "time": 1584190048384, "rating": 5.0, "text": "Had the best experience here!! This idea is so much fun and I’m so glad we have one at the summit!! The candles you make are amazing and they also burn great!! It’s a great place for any type of group or party!!", "pics": null, "resp": {"time": 1584725703297, "text": "Thanks for leaving a review about your workshop, Callie! We're so happy to call The Summit our new home. Come back and see us soon!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "109171997195880656502", "name": "Paige Lee", "time": 1626655169304, "rating": 1.0, "text": "DRAMA QUEEN'S in charge.", "pics": null, "resp": null, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "114957434311004519895", "name": "Jessalin Phillips", "time": 1590272130735, "rating": 5.0, "text": "Paddywax Candle Bar was so fun! The ladies working were the sweetest. I will definitely be going back!", "pics": null, "resp": {"time": 1590699396784, "text": "Jessalin! Thanks so much for taking the time out of your day to leave us a review! We are so thankful to have staff just as sweet as our customers. Come back and see us soon!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "113330909763741222128", "name": "Benson Kinney", "time": 1583960275818, "rating": 5.0, "text": "My wife and I stopped in this location while traveling, and cannot speak highly enough regarding the customer service and willingness to exceed expectations for the Paddywax Candle Bar. We decided to make our own candles to commemorate the weekend (it was our first anniversary) and love the follow up customer service we have received since this visit. Do yourself a favor and pop in!", "pics": null, "resp": {"time": 1584725664237, "text": "Thanks for taking the time to leave a review, Benson! We're so happy you and your wife took a moment to stop in. May your candle creations bring back wonderful memories of your anniversary! We hope to host you again one day."}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "109805654143895920746", "name": "Paul Bradford", "time": 1626829537066, "rating": 1.0, "text": "Bothersome employees", "pics": null, "resp": {"time": 1626913118285, "text": "Hi Paul! We take our guest experience seriously & are very sorry to hear your recent visit was not great.Your feedback is important to us and if you would like to speak with the Store Manager about your experience please feel free to call us at (205)502-7059. Thank you!"}, "gmap_id": "0x888917e9ec737103:0xcd38542183d142ed"}
{"user_id": "108554537291208676763", "name": "Sophia", "time": 1532458221432, "rating": 5.0, "text": "I love candles and the candles there smell real good. I got the meadow showers, red rasberry, and midnight Jasmine. They're all really good smelling. I like to light them with some tea and a good book. The store over all is quite nice and the cashier was friendly. I love Yankee Candles but the prices are a bit high. They're high quality candles.", "pics": null, "resp": null, "gmap_id": "0x888c2c6dff3bf055:0xe313d97301aed068"}
{"user_id": "115180487763031642857", "name": "Christopher Gibson", "time": 1537058683839, "rating": 5.0, "text": "Madi helped me out today and was great.  She answered all of my questions, found several options that I liked, and provided great customer service while she did it!", "pics": null, "resp": null, "gmap_id": "0x888c2c6dff3bf055:0xe313d97301aed068"}
{"user_id": "107193879348475169478", "name": "Joseph Childers", "time": 1545430742857, "rating": 3.0, "text": "Nice store!  Employees were very nice as well however, they are overbearing and follow you around as if you're going to steal!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6dff3bf055:0xe313d97301aed068"}
{"user_id": "109245102680517904952", "name": "Ebony McKethern", "time": 1527543330200, "rating": 5.0, "text": "Great customer service while being a quiet, smell good place. In and out!", "pics": null, "resp": null, "gmap_id": "0x888c2c6dff3bf055:0xe313d97301aed068"}
{"user_id": "105328082722826691030", "name": "Vanessa Brown", "time": 1482298743324, "rating": 5.0, "text": "I love Yankee Candles!", "pics": null, "resp": null, "gmap_id": "0x888c2c6dff3bf055:0xe313d97301aed068"}
{"user_id": "105960761725865239154", "name": "Opal Hall", "time": 1535500374990, "rating": 5.0, "text": "I went there today, and they have some great sales on boutique clothing. Very reasonably priced, unlike some of the other boutiques around. They were making way for football season, with cute clothes and accessories for Alabama and Auburn fans, alike. They had great deals on jewelry and accessories like sunglasses. The owner was very friendly, and even offered me a quiet space for my fussy baby. She even had a little room set up with a chair and wooden changing station for breastfeeding and changing babies. She even had spare disposable diapers stocked. That was so thoughtful. I will definitely be going back, and will add photos next time. This place is worth checking out.", "pics": null, "resp": null, "gmap_id": "0x8889cbc0be85a9f5:0x6cc5cb494559b4a"}
{"user_id": "112175222535907328755", "name": "Belinda Woods", "time": 1552082674200, "rating": 5.0, "text": "Best place in town to buy jewelry! Especially Inspirational jewelry", "pics": null, "resp": null, "gmap_id": "0x8889cbc0be85a9f5:0x6cc5cb494559b4a"}
{"user_id": "115739849607926339943", "name": "Lens flare", "time": 1521823009654, "rating": 4.0, "text": "Nice staff, good deals. Good for standing around in", "pics": null, "resp": null, "gmap_id": "0x8889cbc0be85a9f5:0x6cc5cb494559b4a"}
{"user_id": "117139637867997117558", "name": "Allstar Camp", "time": 1523723235122, "rating": 5.0, "text": "Love the special attention", "pics": null, "resp": null, "gmap_id": "0x8889cbc0be85a9f5:0x6cc5cb494559b4a"}
{"user_id": "105590669391743655650", "name": "Tony Canterberry", "time": 1616632046143, "rating": 5.0, "text": "Flawless store! Perfectly organized, incredibly clean! Super cool, friendly staff! 5 stars!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNDVqr_U4nPa6Hnw0K9tSzbVM0Jgb8SDDavs6ai=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMixybQxZZyfgb8rAwpyTTdyeDWYsyD2iwHFr9F=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnFnSksK7L6vQJwpYq6uzp1LWWdHoC4_AP6Nsm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQeNfWsWmgBQrXIOlQAOeRwHsBj2vw-9-DZTfe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM9pVxFCi0XsV__7HDRnKro5PGsZpORU58ZJUAB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4ozLXygeXWJZk1_tl4asT3loigktkv3DG2u1a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111527915675556193472", "name": "Wendy Guillory", "time": 1627864121066, "rating": 1.0, "text": "I am writing this review to draw attention to a serious matter regarding the offensive behavior exhibited by Manager Beth. The incident occurred on the evening of 07/22/2021 at the Alabaster Alabama location. I frequently visit the Alabaster location, however Sales Manager Beth made my experience horrible. Due to the negative experience,  I will never visit that particular location.I’ve never been so disappointed with service.\nI reported the horrible experience to customer service and I am hopeful that the problem will be corrected but I would like to make all shoppers aware. A shopping experience should be delightful and not confrontational.\n\nHappy shopping!!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "104332357052913618489", "name": "Laquisha Grace", "time": 1611099680422, "rating": 5.0, "text": "The store was extremely neat and organized.  All the staff was friendly. I got a ton of great products.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTJQO4cbAqGvkRm4ykFesWOjG3qX-K5FdodPvB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "116025801662937190461", "name": "Jennifer Christian", "time": 1620098910087, "rating": 5.0, "text": "Love that store, enjoy there bodywash , candles and there plug-ins 😀😍👍🏽💖👏💫", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "114785396217836884937", "name": "Sam Johnson", "time": 1599709099000, "rating": 4.0, "text": "Went today for $2.95 sale. Store organized staff helpful. Just go early during sale days they were pretty wiped out but 2pm", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_Y8DOfSfP0SxHkDSDcJzcphBfFVODCF05pfAa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "107946206971875488326", "name": "Key S", "time": 1617131706844, "rating": 5.0, "text": "Awesome as usual! Great products and superb customer service !👌", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117594683567665070178", "name": "T", "time": 1604866726256, "rating": 1.0, "text": "I purchased items at a store and I forgot a coupon. I went back and brought the items to get the coupon added. The lady said one of the items was not on the receipt. That wasn’t my fault. So, instead of letting me keep the free item (THAT WASNT ADDED) she charge me for it and added my coupon towards it. I got annoyed and told her to just add charge me for the item and I’ll pay the difference with the coupon added. INSTEAD, she refunded everything and recharge me again for the full price. I check my balance and it still show I’m currently charge for two amounts. I did get a refund. I’ll wait 3-5 days but if I don’t get my money back. We got a problem.\n\nInstead of getting a free bonus air freshener. I got charge extra for something that wasn’t added and lost a free item. I WAS BASICALLY BETTER NOT RETURNING BACK TO THE STORE.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "105692052838576405951", "name": "Tameka Perdue", "time": 1620618554739, "rating": 5.0, "text": "I love it employees are very nice & helpful.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "106337615787355627267", "name": "Sydney Getz", "time": 1602207881299, "rating": 5.0, "text": "They’re always so nice and helpful! Love this store and will always recommend to anyone looking for a bath and Body in the area. Sometimes the policies and coupons can be confusing but this staff is always so patient and understanding. Couldn’t say enough nice things about them.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "105714452203811151103", "name": "Dorothy Guillory", "time": 1610598828946, "rating": 2.0, "text": "I visited the Bath and Body's Location in Calara, The first thing I noticed was the face mask that the staff was wearing, Not only was they protecting themselves by wearing the face mask they were also protecting the customers.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "113742891803081865815", "name": "ashley bee", "time": 1604788162133, "rating": 5.0, "text": "Alabaster bath and body is ALWAYS a joy to shop! The ladies that work here are SUPER nice and helpful. I will always shop here", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "101397915432144908781", "name": "Lynn Williams", "time": 1619324970224, "rating": 5.0, "text": "Love B&BW, but I hate that they never had a good online sale during the pandemic when people needed their products, not just wanted them. Shows they care only about money", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117686807514009600407", "name": "AC", "time": 1602207461414, "rating": 5.0, "text": "beautiful and organized store! everyone was friendly, patient, and helpful. shannon was really kind and helped us out so much! will definitely be coming back to this location.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "101000554872663762717", "name": "Jessica Black", "time": 1583295912618, "rating": 5.0, "text": "We really enjoyed our experience here. The store is clean, organized and pleasantly fragranced. An employee named Jordan was not only helpful, but very personable and such a joy to talk with. She was very interactive with us and my little girl even while she was working hard, which made us feel at home. She needs a promotion for her dedication and warmheartedness! I have absolutely no complaints here!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "116142183074156123853", "name": "Liz C.", "time": 1594462562605, "rating": 5.0, "text": "Went two days ago because I ran out of hand sanitizer and wanted more soap. There's really helpful arrows so all shoppers kept good distance, the sales team was very cheerful - I think they like their work. They talked me into a new scent for beside the kitchen sink! I will be back!!!!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "106507208551753630863", "name": "Mary Costlow", "time": 1592756415370, "rating": 4.0, "text": "Great sale going on today in store.  Greeted at door with a shopping bag and cheerful sales associate.  Store has just reopened and they were starting to get busy.  Well stocked and ready for shoppers.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110609813610372387116", "name": "Tonja Collier", "time": 1623447156030, "rating": 5.0, "text": "Very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "118062392948106904773", "name": "Bryan Hensley", "time": 1583535677085, "rating": 5.0, "text": "Jordan was absolutely delightful! The store was clean, organized and had a huge selection. I DEFINITELY recommend!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110175796928942480671", "name": "Dominique Houser", "time": 1582978494640, "rating": 5.0, "text": "I love bath and body wirk the staff is amazing and I can always fine a deal.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111936647034879751984", "name": "Ashley Headley", "time": 1575716898481, "rating": 5.0, "text": "Never have a problem when I go. I’m there every week just about, and I always receive outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117454661474308416349", "name": "Marion Russell", "time": 1581384828267, "rating": 5.0, "text": "Knowledgeable and courteous to help with the what's happening , even better with the weekly flyer through email.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112181012940118527668", "name": "John Galliera", "time": 1609437375121, "rating": 5.0, "text": "Great gifts.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "108548843700798847931", "name": "Candis Threatt", "time": 1583408330970, "rating": 5.0, "text": "Sales! Bought candles(3 wick!), body wash all under $40! Customer service is always top notch!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "117224481041879352107", "name": "Kimberly Whatley", "time": 1605571058618, "rating": 5.0, "text": "Nice and helpful staff", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111945202525454368202", "name": "Kimberly Ballard", "time": 1555727580151, "rating": 5.0, "text": "Mmmmm smelled so good. Staff dying to wait on me. Very helpful", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112926813596588460233", "name": "Cortney C", "time": 1572285279412, "rating": 5.0, "text": "Great sale on aromatherapy! Jordan was the best!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112412906412230069120", "name": "J. Terry McCombs", "time": 1581267232800, "rating": 5.0, "text": "One of my wife's favorite shops for soaps and fragrances.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "111790365322525608445", "name": "Christina Chamblee", "time": 1600878393838, "rating": 5.0, "text": "Love the service and kindness", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "114180244527503270637", "name": "Monique Moore", "time": 1542071430100, "rating": 1.0, "text": "I was very excited when I found out there would be a Bath and Body Works in my area. I went once before with no problem. I went tonight and there were 2 customers there me another lady. I stood in line for a very long time while the lady in front of me was being assisted. Once it was my turn I asked the sales associate behind the counter if they only had 1 register open? When she tried to respond the manager comes over and was very rude and said yes there are no customers here so we just have one and walked away. I advised her that she was very rude and left the items there. The manager at this store needs more customer service training, you had more employees working than customers but I still waiting a lengthy time to be helped and she laughed like she didn't care. I will be reporting this to corporate.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "107865101297118594745", "name": "Veronica Ramos", "time": 1542733943485, "rating": 2.0, "text": "I went in yesterday and let me just say. There was a employee there who didn’t know what she was doing. On Bath and Body Works webiste it advertised a sale in store and online for any select lotions for $3.95. I grabbed my Japanese Cherry blossom body cream and went to go check out. It rung up at $13.00. I politely asked why didn’t it pop up at $3.95. She said what do you mean? I showed her the page and said there’s a sale going on. She proceeded to say “I need to see a barcode to scan” Clearly there was no bar code but she proceeded to roll her eyes and scan a peice of paper to give the discount. Other than that. I had a good experience.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "112432976753673152142", "name": "Cindi Freeman", "time": 1581192782427, "rating": 5.0, "text": "They have the best customer service", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110332171743419440236", "name": "George Young Jr", "time": 1608413879765, "rating": 1.0, "text": "Didn't have anything", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "110675520458451068889", "name": "Niki Hope Talton", "time": 1561844916481, "rating": 5.0, "text": "Semi-annual sale. $3.12,$3.37,and $3.95 lotions, sprays, and gels. Must get there.", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "107139689005062841799", "name": "Alicia Talley", "time": 1608907301896, "rating": 5.0, "text": "Candles, Candles, Candles!", "pics": null, "resp": null, "gmap_id": "0x888925809d51dd99:0x1364617780147da3"}
{"user_id": "104711059691819899136", "name": "Brenda Sweatt", "time": 1606496084781, "rating": 5.0, "text": "Love the candles from there.", "pics": null, "resp": null, "gmap_id": "0x886269572d31e0eb:0xfbdb124934972315"}
{"user_id": "110617861505225744720", "name": "Brandon Foote", "time": 1604791544511, "rating": 5.0, "text": "Good experience and friendly staff!", "pics": null, "resp": null, "gmap_id": "0x886269572d31e0eb:0xfbdb124934972315"}
{"user_id": "116712315278976713588", "name": "Cathy Garner", "time": 1541555407601, "rating": 5.0, "text": "Sales lady was fantastic.   Went  out of  her way to accommodate my wishes.  Over one hundred  dollars  worth of merchandise.   Will go back.  It was a 2 hour drive from  my house.", "pics": null, "resp": null, "gmap_id": "0x886269572d31e0eb:0xfbdb124934972315"}
{"user_id": "106715172701184193013", "name": "Ray of Sunshine", "time": 1529002725184, "rating": 5.0, "text": "I love Yankee Candles. So many scents to choose from. And the Associate Gina was extremely knowledgeable about the types of scents that were available. Super helpful and was able to run in and out even though I could spend an hour in a store like that.", "pics": null, "resp": null, "gmap_id": "0x886269572d31e0eb:0xfbdb124934972315"}
{"user_id": "116480561621302410035", "name": "Pamela Hideko", "time": 1504916461417, "rating": 5.0, "text": "Super nice sales lady named Gina working tonight. Thanks Gina!", "pics": null, "resp": null, "gmap_id": "0x886269572d31e0eb:0xfbdb124934972315"}
{"user_id": "112711825407082597068", "name": "andrew nuss", "time": 1613755226997, "rating": 5.0, "text": "Best candles in Birmingham. The quality and time that is put into making this product is incredibly evident. Great company and will continue to buy from them exclusively, you won't find a better candle.", "pics": null, "resp": null, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "110042123586750083321", "name": "Daniel Roth", "time": 1612127132027, "rating": 5.0, "text": "Great Bear offers subtle and nostalgic scents that remind you of home. From the design to the customer service, these folks have it figured out! Wooden No. 2, Forest, Campfire and Rose are my favorite! Would highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPhVgLWSNBfgMiABzOH7Cp9_-7BK_dU4GeqpgXu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "106255673780428877008", "name": "Natalie Celia", "time": 1610327194725, "rating": 5.0, "text": "GBWC candles are so unique and smell wonderful. And the business is well run by very friendly people. Highly recommend supporting this small business! Tobacco Bay and Forest are my faves.", "pics": null, "resp": null, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "108280743224963670028", "name": "Taylor Suttle", "time": 1568985030772, "rating": 5.0, "text": "Wooden No. 2, Forest, Autumn, Succulent, and Rose are all amazing scents... who am I kidding? They're all amazing. These candles have a long burn life and are made with high quality wax!\n\nMy mom and I took the candle making workshop because she wanted to learn how to make candles at home - while we did learn how to make them - I don't believe making them at home to \"save money\" can replace the serene experience Jake provides in this workshop. Despite having an incredibly stressful week and considering skipping the workshop because I had too much to do, I found myself very relaxed after!\n\nTheir owner is knowledgeable and passionate about what he does. It was amazing to hear him talk about the different waxes and the science behind it.\n\nThe workshop costs about the price of 3 of Bath and Body Works 3-wick candles - you get 2 candles that you made with your own hands (and you can personalize the strength of the scent or mix them together), you get the experience of creating the candle (in a cool atmosphere with complimentary beer/wine for 21+) AND for possibly the coolest part - you are supporting someone local who has a dream.\n\nHe mentioned several times how the growth of his business makes him feel alive and terrified everyday in the best way - and I personally feel very lucky to have been able to be apart of that support for him both through the purchase of my candles and their workshop.\n\nThey are launching a new brand soon called Bungalow Bungalow and I can't wait to see what they have in store. Make sure you check these guys out and show them your support in Woodlawn.\n\nI would 10/10 recommend both the candles and the workshop!\n\n*Full disclaimer - I did NOT know the owner prior to my visit at the workshop and I am no way affiliated with the business or brand. I just truly had a great experience and love the product they produce.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMpcoyINdNoD57cZd3YLIybzws3LBSWxNM1bF6x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMaqBUrzXHVfLW0rnOx8h0I8A5IpDOE3BpK-CG=w150-h150-k-no-p"]}], "resp": {"time": 1573680375185, "text": "WOW! Just read this and I feel super grateful for these kind words! Im so happy you had a great time and thank you for sharing your experience!"}, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "104527581896022160505", "name": "Kaitlin Slattery", "time": 1554749483083, "rating": 5.0, "text": "The ‘ROSE’ candle is probably my favorite of the bunch. Subtle and rooted in nature- it perfectly captures a garden rose. Nothing artificial or grandma like about it. The shop itself is amazing to see- a beautiful blend of a peek behind the scenes as well as a full line up of every fragrance! Jake, the owner, is kind-hearted and approachable which makes the space feel like home.", "pics": null, "resp": {"time": 1554825217163, "text": "Thank you for the KINDNESS!"}, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "106372996404055912829", "name": "Dawson's Mercantile", "time": 1573754386899, "rating": 5.0, "text": "Forest is the BEST candle ever!  And Bungalow Bungalow is a true Woodlawn must see.  A real Birmingham treasure.", "pics": null, "resp": {"time": 1591643997163, "text": "THANK YOU!"}, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "110500332360254627504", "name": "Shannon Harris", "time": 1506814709035, "rating": 5.0, "text": "These candles are special in every way. Check out Sea Salt for those real deal coastal vibes. Great Bear Wax Co. is a small business worth supporting!", "pics": null, "resp": {"time": 1506818451583, "text": "Thanks Shannon!"}, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "107738821770932013771", "name": "Laura Townshend", "time": 1537482809359, "rating": 5.0, "text": "These candles are perfect, long lasting, rich fregrance. ♥️", "pics": null, "resp": {"time": 1591644596233, "text": "Thank you Laura!"}, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "106720525279678086655", "name": "Colleen Glenn", "time": 1515618890464, "rating": 5.0, "text": "Best candles in the USA!", "pics": null, "resp": {"time": 1517938873056, "text": "youre the best!"}, "gmap_id": "0x88891a857b2e6c4d:0xa0d2abe00b0814aa"}
{"user_id": "104179538001247913938", "name": "Shan Price", "time": 1593018778057, "rating": 1.0, "text": "VERY UNPROFESSIONAL WILL NOT SPEND MONEY HERE AGAIN ONLINE SUCKS TOO", "pics": null, "resp": null, "gmap_id": "0x888923378b6da32f:0x84b3c38594eb6e0e"}
{"user_id": "105714452203811151103", "name": "Dorothy Guillory", "time": 1593488303786, "rating": 1.0, "text": "Okay, expensive and they wasn't given out or receiving any coupons, I was totally disappointed.", "pics": null, "resp": null, "gmap_id": "0x888923378b6da32f:0x84b3c38594eb6e0e"}
{"user_id": "107271517859449854400", "name": "EVERYTHING CHILDERS", "time": 1596619307738, "rating": 1.0, "text": "On Tuesday, my last shopping Pier 1 businesses ended in Jones Valley.\nGave both locations great support.  However...the Jones Valley stop CSR's had been polite & answered questions...but wouldn't help gather my large quantity of items. I had to gather, lift, & carry them.\nFollowing Spine & Hip injections, this was strain to my back & painful. Afterwards, I struggled walking. The associate permitted me to use their plastic cart. After leaving, I was complaining to myself, as I crossed the street to my car. A lady, carrying Bath & Body bag, crossed as well. I commented about the associates at the store being lazy.\nAs that person went on. I loaded my things & was leaving the cart on the grass.  The lady in the parking area yelled & demanded I return the cart. I didn't fully understand. So, I asked again what she said. She made her demand on me about 3 times.\nI asked her if she worked there? She said yes.  I asked if she was a Manager? She said Yes!\nI tried to tell her about the laziness I was dealing with.\nShe became irritated with me. No peaceful problem solving was enacted.\nShe came hurriedly at me. I asked her to stop. I warned her, she was crossing the line.  She came anyways, within inches of me, calling me lazy, grabbed my cart without my permission, & proceeded to the store, being loud, calling me lazy repeatedly, & told me to never step foot in her store again!\nShe definitely broke the Covid rules, & came to close to me besides, causes me to feel uncomfortable.\nI requested the 911 service & filed a report.\nThe Manager, should have been more professional.  She ordered me to never come back & she don't have to worry.  I don't want to!!!\nAll I can say is remember when shopping at the Jones Valley location, to take help for you, because they are not much help.  And watch out for the Quick Tempered Manager.\nIt's 4 AM & my Spine & hip still hurt.  This  is a shame!\n🥺😢", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "107071317459739365418", "name": "Joshua Trotter", "time": 1575858426985, "rating": 1.0, "text": "Was not able to purchase my items. Store did not have sufficient change for my transaction so I was told to come back at a later date. So what your telling me is that it is two weeks before Christmas, the store has been open for several hours and you don't have change for a hundred dollar bill? Why would you even open up for business without change to operate with? How many other paying customers were unable to make a cash purchase?  Staff was rude and the store manager would not even come out of the back room to talk with me? Good luck Pier 1...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPU0jlwfSM3zhaT1N32nTJqVDZ9o_07eMFxbPMN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "103282598827344575069", "name": "Pixie Lent", "time": 1584115022995, "rating": 4.0, "text": "I love the home items but it's a little pricey.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "110679681946722723452", "name": "Sheri Spuhl", "time": 1553832266995, "rating": 4.0, "text": "We like this store. When they have a sale, it's fun to add a colorful \"something\".  The staff is welcoming.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "109876929732465867477", "name": "Paula Lindon", "time": 1538497314620, "rating": 5.0, "text": "My happy place! Love it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_kINjf6QEtPZ0mamrFtOoQvxkW4_JweODiERE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "111103448624712417306", "name": "Tim Harrison", "time": 1556914868568, "rating": 3.0, "text": "So-so store. You can get some great deals on sale items. Full price is usually kind of expensive.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "117593790248128865682", "name": "Christina Morgan", "time": 1531663067134, "rating": 5.0, "text": "It's everything you expect forom pier one regarding selection and quality products. No better place for fun and tasteful holiday decor.\n\nThis particular location has really stood out in terms of helpful staff. Several times I have gone in not sure of exactly whathat I wanted, and the staff had gone above and beyond helping me find just the right thing. I'm not very creative and they have helped my 'create' pieces, step by step. When looking for decor, I head to them first due to the phenomenal staff!!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "115497722345361542884", "name": "Lester Pettigrew", "time": 1534275848508, "rating": 5.0, "text": "The coolest home decor ever.  Great quality, and the management and staff are unbelievably nice, helpful, friendly, and knowledgeable!  You can tell they love what they do!  5 stars!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "116375795311771033205", "name": "Larry Trotter", "time": 1575836704248, "rating": 1.0, "text": "Left without purchasing anything! Very Rude employees and Manager did not care less! We went around the corner to Kirkland's and purchased what we needed. Pier 1 will not be around much longer with this kind of service and a manager ( Mrs. Pearl) with this kind of attitude.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "112157942195524329589", "name": "B Gram", "time": 1539199256397, "rating": 3.0, "text": "Stuck up and snobby staff if you don't look or dress a certain way. What a shame I'm getting a new house and have to buy all new things that I CAN afford. Oh well", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "103636341865003541787", "name": "Jamie Martin", "time": 1524249447264, "rating": 5.0, "text": "Fun place to shop. Cool things for the home.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "100900673476076835592", "name": "Brenda Estes", "time": 1538677091388, "rating": 5.0, "text": "Its was great. Love to shop there.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "106962621146393133463", "name": "Tammy Willard", "time": 1565218913434, "rating": 4.0, "text": "This time they didn't have I was looking for!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "100660789357925265329", "name": "Cathy Clayton", "time": 1545174916712, "rating": 1.0, "text": "Service at this store is pathetic. I will NEVER go back.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "116431655015737564777", "name": "Kelli T", "time": 1560896843697, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "111660817966346698445", "name": "Jenny Michell", "time": 1537488615930, "rating": 5.0, "text": "Great ideas for the fall season.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "100386425429642777456", "name": "Sharon D", "time": 1541441399896, "rating": 5.0, "text": "Love everything about this store!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "104419054227614586866", "name": "McH", "time": 1573512537789, "rating": 3.0, "text": "Poor signage for pickups.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "104419054227614586866", "name": "McH", "time": 1573512537789, "rating": 3.0, "text": "Poor signage for pickups.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "105734570444463276438", "name": "Sabrina Presto", "time": 1557152347096, "rating": 5.0, "text": "Good inventory", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "115528406213882565351", "name": "Kenneth Goodman", "time": 1577955505250, "rating": 2.0, "text": "Prices are absurd", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "115402112087852377407", "name": "Kim Bell Schneider", "time": 1526109977647, "rating": 5.0, "text": "I bought some candles for my den.", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "112063266865011896466", "name": "Asher Berry", "time": 1567529080541, "rating": 3.0, "text": "sort of uninspiring", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "102278539317649006143", "name": "Matt G Alabama", "time": 1582057961628, "rating": 5.0, "text": "Look this place!!!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "104508602908151275721", "name": "Nancy Stein", "time": 1540525618201, "rating": 5.0, "text": "Love!", "pics": null, "resp": null, "gmap_id": "0x886212f8e5fc55d1:0x41fd5fd6c66ffcef"}
{"user_id": "114406275812554411386", "name": "Jeanice Bengen", "time": 1578609069256, "rating": 4.0, "text": "Took advantage of their clearance sale by getting 4 place mats and a wicker, center mat for $10!! Looks perfect for a simple, country dining table. I love it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPeXPoq_CFLNPUHH8Rj45WuUb1x06iDa0qARM1V=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "107107739156534720158", "name": "tammy myrick", "time": 1564794645330, "rating": 5.0, "text": "I usually shop at the Pier 1 in Mobile so this was my 1st time there. The store was really neat and the staff are very friendly and helpful!", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1551983901040, "rating": 4.0, "text": "Got a wedding gift here. Lots of options. Good service and great suggestions from this team.", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "113047294319066253355", "name": "KG Gregory", "time": 1581193897577, "rating": 5.0, "text": "Great selection of out of the ordinary!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOqCvNNx70qTyKyfcm59gfEhA62l_7x0T7uPE1x=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "104182078409804619282", "name": "3 4", "time": 1537392510642, "rating": 5.0, "text": "Always having what I need with great deals and many sales going on, with candles 2 for $20 couldnt ask for a better deal this season I'm never disappointed when going to pier 1 there my to go store and always finding exactly what I need for any occasion!!", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "105016602552113881222", "name": "Yancey Burnett", "time": 1568480785826, "rating": 2.0, "text": "Apparently one must be Buddhist to visit. . .i was unaware of this requirement", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "115822886348509515283", "name": "Alisha Rogers", "time": 1557787630214, "rating": 5.0, "text": "Love the decor they sell here.", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "112977397783382884839", "name": "Kim Tracey ella", "time": 1507423098297, "rating": 4.0, "text": "Really like pier one good selection seasonal sales and stuff is great", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "104612904390308305955", "name": "S.T.", "time": 1582268294457, "rating": 5.0, "text": "Pier 1 is the best!!", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "103246143089647318058", "name": "Susan Fonger", "time": 1527377558186, "rating": 5.0, "text": "Terrific staff", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "103684200412476034323", "name": "terry bassett", "time": 1532317495468, "rating": 4.0, "text": "Nice variety, great sales", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "103497753982844813125", "name": "Joanne Wilson", "time": 1533434539056, "rating": 5.0, "text": "I love this store.", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "102147192039150348754", "name": "Tommy Robinson", "time": 1494548991234, "rating": 5.0, "text": "Great stuff but prices are high", "pics": null, "resp": null, "gmap_id": "0x863b8214088ea069:0x30a6a7269ad7be17"}
{"user_id": "112779796599063603658", "name": "Lisa Marie Lyons", "time": 1623199689708, "rating": 5.0, "text": "Ordered flowers for a graduation celebration. Wow! Beautiful, artistic, and eye catching. Delivered as requested. Thank you.", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "113557585431974735426", "name": "Miles Hudson", "time": 1616855130660, "rating": 5.0, "text": "Great service with incredible flowers!", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "100084145831441443730", "name": "Luis Rosas", "time": 1594080789863, "rating": 5.0, "text": "Beautiful Roses and decoration , very sweet lady , for a long time I’ve been trying to find a good florist every time I go see my girlfriend, and I think I finally found the one , my girlfriend love her roses and especially the chocolate they sell , I would give this 10 stars ⭐️... very satisfied with the product and will definitely will come again", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "116894724969231494295", "name": "Drew Harcrow", "time": 1589119984628, "rating": 4.0, "text": "My wife uses them often for gifts and/or flowers. She loves the girls that work in there.", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "113128464575476600011", "name": "James Duvall", "time": 1563379591015, "rating": 5.0, "text": "Beautiful arrangement, fair price. She really helped us out for my grandfather's funeral. Very satisfied.", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "115315120739825569479", "name": "Gary Braden", "time": 1621872924605, "rating": 1.0, "text": "No thank you", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "100333477263677793398", "name": "Sean Mantler", "time": 1573244560635, "rating": 5.0, "text": "Absolutely beautiful Christmas decorations and displays! Very friendly and attentive staff.", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "114870530479682841839", "name": "Elliott Varner", "time": 1557351449553, "rating": 1.0, "text": "So.... I was told by the owner of Tiger Lilly that he did his job and those flowers and exactly what I ordered. He then went on to tell me he went above and beyond by upgrading the vase and adding a bow. He then tells me that it isn't fair to him for me to bash him on social media. The post is on tiger Lilly's Facebook page under community comments. I am yet to see where I bashed him. Then he continues to inform me how you just cant make some people happy. Not one time did he offer any reparations, exchanges, refunds, discounts, or even an apology. So that's my experience with Slade Carden and Tiger Lilly.\nWhen I pointed out that he had not apologized he offered a half hearted apology. I cancelled my other orders and will not do business here again.", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "112597122921866548381", "name": "Kyle Cochran", "time": 1496461906760, "rating": 5.0, "text": "Tiger lily is the best  in town! They always exceed my expections! Make sure to call them for all your flower needs!", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
{"user_id": "115802376258813390232", "name": "j play", "time": 1573923473570, "rating": 5.0, "text": "Nice. Very accommodating", "pics": null, "resp": null, "gmap_id": "0x8861d7d4d77fab55:0xc4e982262a7dd039"}
