{"user_id": "117654283764180480777", "name": "Matthew Burke", "time": 1622738627099, "rating": 5.0, "text": "Aleah was very easy to work with. I recommend going to her for business. I know she will succeed.", "pics": null, "resp": {"time": 1624214652500, "text": "Thank you Matthew"}, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "115378423023136308585", "name": "Jim Glimpse", "time": 1615379760276, "rating": 5.0, "text": "Canna bliss products are made from the highest grade quality and made locally. They are effective and really helped with my overall well being. Highly recommended.", "pics": null, "resp": {"time": 1617395048418, "text": "Thank you Jim! We love to hear success stories!"}, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "102601943210488805985", "name": "David Robertson", "time": 1604512285359, "rating": 5.0, "text": "This lady does a wonderful job. She is on the ball and works so fast and efficiently. The products are amazing and there are soo many to choose from. As far as I can tell she vets every product she offers and only carries the ones from reputable companies that really WORK like they're supposed to. And what's even better, she doesn't price gouge. I mean, the pain lotion she carries is 1000mg per ounce and the price is amazing. And, yes, it works!! It's outstanding. All of her offerings are. Thanks for all you do to increase our health! 5 stars for sure. 😁", "pics": null, "resp": {"time": 1607441953550, "text": "Yes we agree, the Lotion is superb!! Thanks for your feedback"}, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "107219272187335579723", "name": "Kate- Lana Lang", "time": 1624146545967, "rating": 5.0, "text": "I love being informed and great selection of products!", "pics": null, "resp": {"time": 1624214639272, "text": "Thank you for your feedback!"}, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "112884996760091352510", "name": "Trenten Smith", "time": 1607389889642, "rating": 5.0, "text": "The woman who runs this business is more than helpful in helping understand the product and what you need personally. I tried the Delta-8 cartridge personally and was in shock at how quickly it began working.\nTotal game changer from this company! Can help with anxiety and restlessness everytime! Will recommend to everyone I know!", "pics": null, "resp": {"time": 1607441900695, "text": "Thank you Trenten I’m happy we could help!!!"}, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "104651293741140361363", "name": "Kevin McDowell", "time": 1607389418225, "rating": 5.0, "text": "What a great store run by a super nice and helpful lady. She helped us pick out everything we needed and it all worked exactly as expected. I can’t recommend Canna Bliss enough.", "pics": null, "resp": {"time": 1607441822565, "text": "Thank you Kevin! We appreciate your feedback😀"}, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "100401679123530005370", "name": "Brian Sponder", "time": 1590931976648, "rating": 5.0, "text": "Dealing with Canna Bliss couldn't be any easier. Support is fantastic, products are top quality and never any issues with them, delivery and/or drop off of products always on time. Excellent representatives, highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
{"user_id": "103171961236256766268", "name": "Cindy Mallard", "time": 1591034751002, "rating": 5.0, "text": "We are very pleased with the accuracy and speed of our deliveries.  The products are exactly what is expected.  Thanks for the opportunity to share this review with others.", "pics": null, "resp": null, "gmap_id": "0x888833eacf61c827:0xfc887e0a67087de"}
