{"user_id": "113661709004820609383", "name": "Freya Renee", "time": 1611336944876, "rating": 1.0, "text": "I was very disappointed with my encounter here, the staff are awful.\nI was referred by my dermatologist to have an X-ray done. I do not have insurance but was fully prepared to pay out of pocket.\nThe admissions clerk made a spectacle out of me not having insurance, getting her boss to see if they would see me or refuse me service.\nHer boss tells me I need to get the specific code so she can look it up, which is literally her job.\nShe has all of my information and the dermatologist information in front of her and she tells me I have to do it myself, call her for a price, and then come back to get the X-ray.\nThis entire exchange was very loud and unnecessary, I left in tears.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "107555460630138821719", "name": "April Rowell", "time": 1610512172189, "rating": 3.0, "text": "Xx is Zaza zzzzzs zdx zzz cc zzz zzzz z. Z s.  Xxx", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "118015363690752546490", "name": "Sister Sabotage13", "time": 1575673095972, "rating": 4.0, "text": "All of the staff have been caring and very attentive. I've never had a better stay in a hospital. The food leaves a but to be desired but I feel like I'll be great. It started in the er and now I've been in for 3 days. I'm getting great care. I couldn't ask for a better experience", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "111698133747226116400", "name": "Lisa Marie", "time": 1592091531380, "rating": 1.0, "text": "DO NOT COME HERE FOR AN EMERGENCY. We were passing through and a family member had a serious seizure nearby. He was puking in the waiting room and no one cleaned it up. They said \"housekeeping is gone for the day.\" The nurse wasn't wearing scrubs or a mask. Patient was barely able to communicate and they kicked his spouse out of the exam room. They attempted to kick the spouse out of the hospital completely, saying \"no visitors.\" Refused to let family communicate with patient to gauge his decision-making abilities and kept saying he was fine, even though they had to come out to the waiting room to ask about meds and medical conditions because he couldn't communicate this information!! Place is filthy, please Alabama do something about your rural healthcare.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "106618823853064825050", "name": "classic rock Kelley", "time": 1582657534797, "rating": 5.0, "text": "I was so so sad to hear that this hospital 🏥 was closing. One of the best there was. Would have my loved ones there over Troy, Greenville and Luverne. Doctors and Staff were like Family.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkQsYzLsSxm5LmZVJDEA2rXbTkTMmGawC8sIR2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "101576102177085714499", "name": "Will Weider", "time": 1505944680630, "rating": 5.0, "text": "This community is lucky to have a quality local hospital and emergency room. They have great staff and provide personalized care.\n\nWhen I was there the hospital leaders were serving nachos to the employees. I think this reflects the caring culture of the organization.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "103405616010048516366", "name": "Talisa Reaves", "time": 1562519953268, "rating": 5.0, "text": "Although we had a 3 hour visit, the staff was  phenomenal!!!! We had the sweetest nurses that actually took the time to talk to my children to keep from being scared and to help them feel better about our visit. My boys we’re running high fever and hurting all over, the staff immediately tested them. Our nurse was very gentle with my children during the nose and throat swabs that my 4 and 7 yr old didn’t even cry or flinch.  They ended up having the flu and one of our nurses even brought them suckers. All during this time they were serving 6 other patients for way more serious conditions. It meant so much to me that even though they were working under a lot of stress they still treated my children like their pediatrician would have.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "117390850376473595606", "name": "Kiamonte Gulley", "time": 1613082181679, "rating": 1.0, "text": "THE WORST HOSPITAL IN THE STATE DO NOT GO IF YOU ARE IN EMERGENCY NEED !!!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "108438353552208448369", "name": "Thomas Schofield", "time": 1571608112940, "rating": 1.0, "text": "This review has been in waiting for years! Thank God for Google Dr Nami almost killed my dad in critical care due to neglect and negligence on her part I will not retire in Alabama instead Michigan thank God I will never see the inside of this band aid hospital", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "100617447239344531628", "name": "Daniel Taylor", "time": 1534475023150, "rating": 1.0, "text": "Waited 4.5 hours for lower back pain from bulging disc flare up. Was never asked about my meds so I told the doctor that I was already taking nsaids and muscle relaxers daily as he rushed out of my room after 30 seconds. They bring me a muscle relaxer and an nsaid! When I asked the doctor about it, he said he NEVER gives anything more than that for pain. Uncaring ER staff who will not treat you pain.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "104683954469047129195", "name": "lee black", "time": 1513197416218, "rating": 1.0, "text": "Do not go here they will take you to court over the smallest amount of money and then if you still don’t pay they will garnish your wages. They are relentless when it come to pursuing you.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "113057614965601808743", "name": "Isabella S", "time": 1536089644124, "rating": 1.0, "text": "There is a nurse there named “Troy” who has no bedside manner whatsoever and is unapologetic when addressed.\nDefinitely shouldn’t be working there.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "117893397349599746666", "name": "Michael Owens", "time": 1535175722050, "rating": 1.0, "text": "This place doesn't even deserve a star. Been here almost 2 1/2 hrs and haven't even seen doctor for a large gash in my 3 yr olds head.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "109728912416387904793", "name": "Roger Mulnix", "time": 1552763685451, "rating": 1.0, "text": "Sitting here almost 3 hrs and ain't been seen yet, website says 30minute pledge..just wondering when that kicks in?", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "118102863031197068413", "name": "kerri sanfilippo", "time": 1561523712533, "rating": 1.0, "text": "Taking forever to see my ole man he might of had an heart attack", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "116675735112347470401", "name": "Brandon Hinson", "time": 1490221522564, "rating": 1.0, "text": "Horrible service and horrible attitudes I think I would rather take my chances on making it to Montgomery during a life threating experience", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "108221143402496468912", "name": "JoAnna Hall", "time": 1513024908795, "rating": 1.0, "text": "Slowest hospital EVER.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "103420733516288253205", "name": "FRANBAR PRODUCTIONS", "time": 1474206617956, "rating": 5.0, "text": "Saved my Life", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "112760707623820244049", "name": "Phyllis Sockwell", "time": 1612620240039, "rating": 5.0, "text": "Best cardiologist I've ever known.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x7faac90ad57e6406"}
{"user_id": "114653570996727124189", "name": "Clarene Teague-Johnson", "time": 1541172715465, "rating": 5.0, "text": "Dr. Strickland is such a professional.  I had plenty of doubts about my procedure. From the time he walked in the door until my departure,  he made me feel that I was not just a number and that he cared for his patients.  Before the procedure he made me comfortable and assured me that he would only due what was promised.  I didn't want a bait and switch.  Thanks for making experience less stressful. The office staff is extraordinary.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x7faac90ad57e6406"}
{"user_id": "108388971551793943601", "name": "D Wilbourn", "time": 1528130675577, "rating": 5.0, "text": "From the front door going in you find the front office people  professional, positive atmosphere and very nice. The office and exam rooms really clean. Technician s,  nurses even Dr Strickland were very nice . I would recommend this office to everyone who needed a cardiologist.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x7faac90ad57e6406"}
{"user_id": "112484275267141185954", "name": "Judy Beatty", "time": 1507754238913, "rating": 5.0, "text": "Dr. Strickland literally saved my husband's life. We have been faithful patients for over 10 yrs now. His staff are also fabulous, especially his Nutse Practioner, Vanessa. They are the best.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x7faac90ad57e6406"}
{"user_id": "101435243167388428206", "name": "Linda Beach", "time": 1511279848574, "rating": 1.0, "text": "My sister had to wait 5 hours on proceedure, when it was scheduled for 9, and she was suppose to be first.  No one cares.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x7faac90ad57e6406"}
{"user_id": "108084572461159663409", "name": "Ginger Tunnell", "time": 1580943045764, "rating": 5.0, "text": "Dr Arcie has been my doctor for 14 years.  I love him and his team.\nI feel confident that my heart will be created got.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xfcdef8132fbe5b46"}
{"user_id": "105940493936814947223", "name": "sheila hood", "time": 1534271346982, "rating": 5.0, "text": "So good to my mother. He has been her Doctor for many years and treats her like family.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xfcdef8132fbe5b46"}
{"user_id": "109540621252959073581", "name": "Jim Bryant", "time": 1447960496832, "rating": 5.0, "text": "Great Doc.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xfcdef8132fbe5b46"}
{"user_id": "107053069608728742171", "name": "Tom Mclemore", "time": 1583984062797, "rating": 5.0, "text": "Dr. Mirza was my cardiologist at a recent hospital stay. She was both professional and caring, taking time during each phase to explain what was going on and answer questions.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x1a47a1987cffa7e0"}
{"user_id": "106732375789843167400", "name": "Ken Williams", "time": 1531488584406, "rating": 5.0, "text": "Very thorough, excellent care, takes time w patients", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x1a47a1987cffa7e0"}
{"user_id": "110782334003597211906", "name": "Arminda B Pack", "time": 1621427708226, "rating": 5.0, "text": "Great doctor very concerned about his patients .... In my opinion he is the BEST ....he saved my Dads life and i am forever greatful to Dr Burns", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "106574804230139415703", "name": "James Gibson", "time": 1602827089301, "rating": 5.0, "text": "I cannot say enough good things about him. He is absolutely honest so if you want a beat around the bush man this isn’t him. How ever when he sees you he is kind, explains the results. He goes into extreme detail what something should look like and if yours is normal (luckily mine all have been.) wait times are short, honestly I don’t know how he keeps them short with as much attention as he gives the patient. As long as he’s in the business, and as long as I need one, he will be my cardiologist.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "106545198555243293023", "name": "Patrick", "time": 1592502729908, "rating": 5.0, "text": "Dr. Burns has been my doctor for over 10 years.  He is to the point and honest with you about YOUR problems.  He will offer guidance and help and will go out of his way to help you to get healthy but you have to have the drive to want to get there.  He is the best cardiologist in the southeast.  Don't expect him to sugar coat anything.  He will explain it to you in terms you can understand and will not be typing away on some tablet making you feel like you are some ignorant person.  He respects you and truly wants to see you get better.  His new facility is so much nicer than his previous office at the hospital.  The nurses are also just great and make you feel right at home.  Seeing a specialist can sometimes be stressful but Dr. Burns and staff set me at ease and I owe him a great amount of thanks.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "108644844294822668834", "name": "S.B. S.", "time": 1592503861920, "rating": 5.0, "text": "As a new patient I found Dr. Burns to be very personable, professional and knowledgeable.  He thoroughly explained the testing procedures and results of examinations to effectively diagnose and treat my cardiac issues.  His staff went out of their way to be accommodative and friendly even in the midst of an unprecedented global pandemic.  I am very glad I chose Dr. Burns over the big-box corporate providers in the Huntsville area.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "106532629586253365201", "name": "pilotcoolbiz", "time": 1546706185673, "rating": 5.0, "text": "I have been seeing Dr. Burns for years. He is one of the leading, if not the best Cardiologists in Huntsville. He has always gone the extra mile to work me into the schedule and has taken excellent care of me. He genuinely cares about, and for his patients, one and all. He takes the time to explain results of tests in a manner that is understandable to lay vocabularies such as mine. He is probably the most accomplished person I have ever met. His background in medicine is vast and he continues to receive accolades for recent accomplishments. He is also an accomplished pilot of both airplanes and helicopters. Just an all around good guy. Not only is Dr. Burns kind and attentive to his patients needs, so are all of his office staff. Best doctor I have ever had, bar none.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "111617133198381813681", "name": "Luke Smith", "time": 1527820875457, "rating": 5.0, "text": "I have known Dr. Burns for many years as a friend and fellow aviator. Although I myself have had the blessing of good health, I have long been aware of Dr. Burns exceedingly fine reputation as a cardiologist. I have always known that if I should ever have an issue with my heart, he would be the only doctor I would trust to sort things out.  Recently, while flying a corporate jet trip in Asia, I needed to renew my FAA Medical.  During the appointment, some questions arose with my EKG.  I immediately contacted Dr. Burns and despite the 12 hour time difference he took my call and immediately began the process of understanding the situation and working to resolve it.  Despite not feeling ill, nor having any symptoms, I was told I would need an expanded cardiac evaluation right away in order to maintain my license to fly.  Within 48 hours I was on a flight from Hong Kong to Huntsville.  Dr. Burns worked me into his schedule, reviewed my FAA medical records from the preceding 7 years and performed a thorough evaluation to find out what might be going on with me.  Fortunately,  the tests revealed I am in good health but without Dr. Burns' help I would most likely have found myself out of my profession for months or even years, working through a very challenging system to return to work.  Instead, through his thoughtful and meticulous care, I was able to return to work with a clean bill of health and a freshly renewed Medical, a mere 5 days from the start of the entire adventure.   in addition to helping me to keep my profession and livelihood intact, Dr. Burns educated and redirected my thoughts on my health in a much more positive direction.  If you have a heart issue, Dr. Burns is the one you want to help you, even if you have to travel half way around the world.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "115178275042306378498", "name": "Dayton Jones", "time": 1506553452802, "rating": 5.0, "text": "I have been a patient of Dr. Burns for over 20 years and I think he is the best cardiologist I've had in my 64 years. He is always professional in my treatment, he knows exactly what needs to be done when it comes to the heart. The doctor also has a great bedside manner. I would highly recommend Dr. Burns to anyone with heart trouble, he's always come through for me.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "115828326004169790601", "name": "Andy Perez", "time": 1506697973991, "rating": 5.0, "text": "I have been a patient of Dr. Burns for more than 20 years, he is always professional and looking out for my best interest. I believe he is the best Cardiologist in this Huntsville Decatur Alabama area. I was at his office the day he opened his new office on Bob Wallace and was very pleased with the care I received. He has put several stents in and artery that most other Cardiologist would not have attempted.  I will go to him as long as he is in practice.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "109613529167539611952", "name": "Pam Cantrell", "time": 1615982765369, "rating": 5.0, "text": "Been using Dr. Burns for 30 years,,, the best of the best!!!!", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "112684808438754942401", "name": "Angela Wilkins", "time": 1545609974909, "rating": 1.0, "text": "Do NOT, I repeat, DO NOT even think about seeing this arrogant and curt doctor. He has the God complex in addition to ordering tests that are not necessary. After tests were completed, he wasn't even able to explain the results in a manner that could be understood. From what I have been told, he was asked to leave The Heart Center practice. Wish I had known before seeing him. Proceed with much caution!", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "117757214492095570248", "name": "Stan Zangel", "time": 1543936467244, "rating": 5.0, "text": "Outstanding cardiologist. Gives you 100% attention and very detailed when explaining everything. Thank You", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "104326782508320036119", "name": "Jan Gray", "time": 1507000290424, "rating": 5.0, "text": "Dr Burns has been my doctor since '94\nHe has been very thorough in his testing . Also informative about his diagnosis. He's been available.to answer questions. I think he's the best doctor in North Alabama.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "113342753850824483857", "name": "Martha Colgan", "time": 1510801132225, "rating": 5.0, "text": "He is genuinely interested in his patients and their conditions. He isn't just trying to see as many as possible in a day, but spends whatever time is necessary with each patient and explains things well.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "104707856858494862803", "name": "Roy McVay", "time": 1506617851479, "rating": 5.0, "text": "I HAVE BEEN WITH DR BURNS FOR SEVEN YEARS, HE IS VERY PROFESSIONAL &  VERY GOOD AT WHAT HE DOES, I HOPE TO CONTINUE USING HIM AS LONG AS I NEED TO.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "112913073977272884476", "name": "hollie perez", "time": 1506458009544, "rating": 5.0, "text": "He is great at what he does he has helped my father Donnie Joe Gorham  for over 10 years.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "105910001094988272691", "name": "Erin Quevedo", "time": 1508334588058, "rating": 5.0, "text": "Dr. Burns is the best!!!!! He has taken care of my mom's heart for about twenty years. He is God sent.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "107966072055915564184", "name": "Brenda Graham", "time": 1573491639599, "rating": 5.0, "text": "Dr. Burns is very personable and thorough.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "114922928958068648729", "name": "Mad Piper", "time": 1536095914600, "rating": 1.0, "text": "How on Earth can this got have a 5.0 with at least 1 rating of 1.0??", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x544e2ffd3a32bec1"}
{"user_id": "113944478937193688879", "name": "Donna Meherg", "time": 1603395432817, "rating": 5.0, "text": "Absolutely amazing Doctor. Very knowledgeable in his field. Did an amazing job with my husband. Thank you.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "113265094961324681105", "name": "Diane Vess", "time": 1579724179798, "rating": 5.0, "text": "The most caring cardiologist I have ever seen. He diagnosed my pulmonary hypertension and right side heart failure, when a different Dr didn't even bother looking for that, said I was too young for that!", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "109426005584021423634", "name": "Kimberley Sneed", "time": 1556746400343, "rating": 5.0, "text": "I absolutely love Dr. Naidu and his staff! Everyone was so nice and understanding. They want to help you feel better and have a happy, healthy life!", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "111101375170114310858", "name": "LifeisGoodInTheSouth", "time": 1525122649304, "rating": 5.0, "text": "I suffered from severe leg pain, swelling, burning, itching and restless legs before seeing Dr. Naidu. He diagnosed my problem in my first visit & several procedures later I can say without hesitation going to see him was one of the best decisions I’ve ever made. If you suffer from any of these symptoms please call and make an appointment today! He is a very knowledgeable and caring physician whose main goal is make you better!! Kathryn Sharp, Florence, Alabama", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "106149510922548829207", "name": "Char Kenna", "time": 1560876541214, "rating": 5.0, "text": "We received excellent care. The staff is kind and very accommodating. Dr.Naidu was professional and thorough.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "111570310520336261330", "name": "Nancy Fulmer", "time": 1536444672316, "rating": 5.0, "text": "Dr. Naidu has done an excellent job on my legs. Before I started seeing him I felt like I was carrying around 2 cement blocks. My legs were very heavy. Since the procedures my legs feel much lighter. Thank you Dr Naidu. I will recommend him to my friends and family.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "112080910810439155768", "name": "Shirley Mcclure", "time": 1562119624212, "rating": 5.0, "text": "Dr. Naidu is dr who really cares about his patients. I have never had a doctor like him.  Most doctors treat you like you are intruding on them. They don't spend more than 5 minutes with you.  Dr. Naidu listens and does what he can to fix your problem.  Going to his office is like visiting family. They are all so kind and caring.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "116776012721727286308", "name": "Tami Johnson", "time": 1565671037924, "rating": 1.0, "text": "Took my mother to see Dr. Ajit.   He was absolutely the most unprofessional doctor I have ever seen.  He talked negatively about other doctors in our area, as did a member of his staff.  He was defensive when asked questions.  At times he was rude and, talked to us as if we were stupid. .  He was more interested in trashing other doctors than answering questions about mom’s legs and his treatment plan.  He was evasive about the treatment. We will not be back and do not recommend him.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "106766392108560932617", "name": "Debra Barnett", "time": 1510071360111, "rating": 5.0, "text": "He was very thorough and very kind. His patients come first. There's nothing I can complain about. His staff is just great. He took as much as needed to know what the problem was. Thank you Dr. Naidu.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "106616515758777195332", "name": "Carole Hollis", "time": 1533553009579, "rating": 5.0, "text": "I have always been a very active person, enjoying all outdoor activities.  My legs started to tire while hiking and progressed to swelling and needing to elevate them during my work day.  I was afraid that I would no longer be able to do the things I love but Dr Naidu gave me hope.  We did an ultrasound and found that the valves in  my leg veins were leaking and not pumping the blood properly.  He was very confident that he could help me.  I was hesitant to have a procedure so I opted to have it done on one leg and if it showed improvement, I would have the other leg done.\nAll I can say is what a miracle!  I had immediate relief!  When I walked out of his office, it was as if someone had taken a 5lb. ankle weight off of my leg!  No down time, no repercussions.  I was walking and working in the yard the next day!  Needless to say, I had the other leg done two weeks later and I am completely satisfied.\nI am now back to working a full day without wearing compression hose and able to hike after work.  I do not have to give up my active lifestyle and that makes me happy!\nIf you have swelling, leg pain or restrictive movement in your legs are ankles, you should give him a call.  I promise you will not regret it!", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "108364314547950826005", "name": "Carrrie Price", "time": 1560068292875, "rating": 4.0, "text": "Very friendly staff,    I have already recommended him to 2 others.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "106491925018721784020", "name": "cheryl clark", "time": 1536767510457, "rating": 5.0, "text": "I had gotten to the point, I spent most of my time sitting.  My legs were weak, restless, and they hurt.  I never approach my health without some research, and I thoroughly researched Dr. Naidu's suggestions for procedures that would help my venous insufficiency.  I was hesitant to say the least, but in the long run decided to give him a chance.  Best decision I ever made.  Dr. Naidu is very experienced, made the procedures as comfortable as possible and finished them in a timely fashion,  After a few months I have experienced complete relief of my symptoms, I'm back to walking and climbing stairs without problem.  As a bonus and thanks to being more active, I have lost 14 lbs.  I would recommend Dr. Naidu and his knowledgeable staff to anyone with leg problems.  Don't put it off, see Dr. Naidu, keep an open mind, and feel better.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "114939509682780945045", "name": "Jackie Pounders", "time": 1533059172448, "rating": 5.0, "text": "Very friendly office. Easy at making appointments.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "104920511277784445692", "name": "Adam Bayless", "time": 1510587984184, "rating": 5.0, "text": "My legs were numb,hurting,discoloration,restless leg syndrome, so I had the EVLT done and feel 100% better. It’s quick,painless and best of all no more problems....Highly recommend..", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "106994098898113205157", "name": "Alexa Rudd", "time": 1495572996266, "rating": 5.0, "text": "Thanks!!! Dr. Naidu for making such a positive impact on my quality of life,, 9 long yrs of low back pain, numb feet, hip & leg pain ... I would highly recommend seeing Dr. Naidu if you suffer from any of these symptoms,,,, if your not diabetic don't settle for Neuropathy as your diagnosis!!!! God Bless DRS who actually care about patients...Truly,,,\nThe Real Alexa 😀", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "101148386694224623180", "name": "Donna Vance", "time": 1530645816986, "rating": 5.0, "text": "Dr Naidu is an excellent cardiologist and did a wonderful job", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "102205441003190155515", "name": "Trudy Bamburg", "time": 1506711762324, "rating": 1.0, "text": "This Dr made me believe i needed all kids of work done including stints..... my legs have never been in worse shape since i layed eyes on Dr Naidi and i would NEVER RECOMEND Him to anyone!!!!!", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "109761265500086714410", "name": "Stanford Smith", "time": 1502821955899, "rating": 5.0, "text": "Dr. Naidu has helped me more than I can adequately state. At the time of being referred to his office for my leg issues I weighed around 275 pounds and was not taking good care of myself at all. During the course of the treatments I learned I had turned myself into a Type 2 diabetic with a glucose level of 289 and an a1c of 13.1. I was put on Metformin as a starting treatment, with the ominous prospect of giving myself insulin injections if my condition didn't improve.\n\nI don't know about you folks, but I don't like needles. I made a total lifestyle change; I placed myself on a 1200-calorie, low-sugar (under 25 grams a day), low-carb (under 100 grams a day) diet, got back into a regular workout regimen, and did what my medical staff recommended. The condition of my legs improved vastly from the laser treatments. Three months after I began taking Metformin my prescription was cut from two tablets a day to one, and after six months I no longer needed it. Monitoring my sugar three times daily my glucose averages dropped to below 100 with an a1c in the mid-fives. My weight bottomed out at 198. You can either have a pity party for yourself and keep doing all the wrong things, or you can make the changes you need and improve yourself. It can be done; I'm the proof.\n\nI thank Dr. Naidu and his staff both past and present for all their help in getting me to this point in my health. I am 48 years old and in my best shape since my twenties. I eat heathier than I ever have, work out 4 to 5 times a week, and sleep better. My blood pressure is excellent and all my levels are where they need to be. I'm happy with where I am, and yet I still feel I haven't peaked yet.\n\nI would recommend Dr. Ajit Naidu and Cardiovascular Institute of the Shoals to anyone.", "pics": null, "resp": null, "gmap_id": "0x887d4861dc3aa17f:0xfebb8275f75040ca"}
{"user_id": "103001946207371175031", "name": "Shelby Smith", "time": 1613242757085, "rating": 5.0, "text": "The doctor and his staff are all very kind and professional. The wait time was not long at all. I had a very good experience here!", "pics": null, "resp": {"time": 1613490029486, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincents Community Manager"}, "gmap_id": "0x888917833a399d01:0x952ad3e857b4f843"}
{"user_id": "117235143917554427509", "name": "Debbie McPhearson", "time": 1514654941186, "rating": 5.0, "text": "Dr. Raburn is awesome. He takes his time and explains things in a way that a layman can understand. He is very compassionate and thorough.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x952ad3e857b4f843"}
{"user_id": "101192500051125174350", "name": "Cynthia Robinson", "time": 1508778483770, "rating": 5.0, "text": "Dr. Rayburn and his staff made me know that they were there for me. They were thorough, professional and courteous. I was feeling hopeless and they gave me hope. I would recommend them highly. I'm so thankful to find CVA.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x952ad3e857b4f843"}
{"user_id": "114896132189905537932", "name": "alisha hassan", "time": 1578500943280, "rating": 5.0, "text": "He treats my father who is also a veteran.  The VA cardiologists in Birmingham said there was nothing that could be done and sent him home to die.  Dr. Salame disagreed and saved my father's life with an operation the VA refused to do!  He goes above and  beyond to give great care to his patients.  He is a gifted surgeon with capabilities unmatched by the VA cardiologists.  Thank you Dr. Salame, for giving us so much more time with our father.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0xfaf9534a96c5ef"}
{"user_id": "110508310674980828053", "name": "Gene Black", "time": 1578347282933, "rating": 2.0, "text": "My mother was placed in an exam room and forgotten. When I asked, \"Did he forget we were here?\" I was told \"I guess so, hasn't he been in yet?\" We had heard him in the adjoining room, so we know he was there. We finally walked out.\nThis is no way to treat any patient/client, especially am elderly person who has to rely on others for transportation.\nThey were clearly over booked.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0xfaf9534a96c5ef"}
{"user_id": "114459918678176414913", "name": "David Lowe", "time": 1514993615626, "rating": 5.0, "text": "He is really trying to help me with my health problems. He is straight forward and tells it like it is. I believe that if i do my part, i will see improvement in my health.", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0xfaf9534a96c5ef"}
{"user_id": "106192780229423452650", "name": "Jamie Robinson", "time": 1501914724256, "rating": 3.0, "text": "He's my daddy 💖 Dr. Good job Dr Salame", "pics": null, "resp": null, "gmap_id": "0x888bb3c11ae73b93:0xfaf9534a96c5ef"}
{"user_id": "106082176348483947142", "name": "Jeremiah Blackmon", "time": 1620853597396, "rating": 1.0, "text": "Terrible experience.  The front desk attendants are super rude.  Dr Lee let my father go home in bad shape.  Thankfully we got a second opinion and was admitted immediately.   Drive to Bham and see a doc at CardioVascular Associates instead.   It may save your life.", "pics": null, "resp": null, "gmap_id": "0x8889c94b04a1fdc1:0x577a25335274e189"}
{"user_id": "105920859977210516081", "name": "cody vickery", "time": 1627090012531, "rating": 1.0, "text": "Dr lee is a joke and worst doctor visit ever will make sure nobody I know goes to him he will let you die before he actually does any work", "pics": null, "resp": null, "gmap_id": "0x8889c94b04a1fdc1:0x577a25335274e189"}
{"user_id": "105440629648115018936", "name": "Renee Allred", "time": 1407724465647, "rating": 5.0, "text": "I really appreciate all that Dr. Lee has done for me. He takes the time to explain things to me and makes sure I understand what is going on before I leave his office. He doesn't try to force a procedure upon me. He explains my options and leaves the decision up to me with the option to change my mind at any time with no pressure. I am confident in Dr. Lee. He is very knowledgeable, and I trust that he makes the best decisions as to how to treat what is going on with my health.He also has a wonderful and very friendly staff. Thank you, Dr. Lee and staff. May God bless you for all you do!", "pics": null, "resp": null, "gmap_id": "0x8889c94b04a1fdc1:0x577a25335274e189"}
{"user_id": "109947311902238070619", "name": "Bob Williams", "time": 1617306916362, "rating": 5.0, "text": "Professional and knowledgeable staff at the walk in chest pain clinic. This place is the best-kept secret in Auburn! Beats going to the ER during a pandemic (or anytime for that matter). Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "117975525337841786755", "name": "Bama Becca", "time": 1617804084283, "rating": 5.0, "text": "I was having chest pain and dizziness. The staff at the Chest Pain Walk In Clinic was very expedient,  knowledgable,  and conscientious to my situation and symptoms. I was taken very good care of and they were very comforting. I would recommend The Chest Pain Walk In Clinic to anyone having chest pain or emergent heart related symptoms. It was way better than the local ER.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "105577754777300555463", "name": "Nick J", "time": 1616086287200, "rating": 5.0, "text": "I was seen at the chest pain clinic in the heart center and was given very good care. I came in to the front desk window and told her I was having pains in my chest. The nurse took me right back to a room and did a heart test with wires and took my blood. The pratictioner Tracy saw me in no time and checked me over. I had a xray done and a scan on my heart. I didnt have to worry about doing paperwork until later when I was feeling better. I have a appointment to come back tomorrow to do a test on a treadmill to be sure my heart is good.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "118133336247738240172", "name": "Malik P", "time": 1612549097108, "rating": 1.0, "text": "I went to the Heart Center’s Urgent Care Clinic. I would rate my experience a 0 if I had the option. I had high hopes for my experience because I heard such great things. I just knew I was going to get the same experience.Well it didn’t happen for me. I went to the heart urgent care clinic hoping to receive help because I had severe chest and arm pain on Wednesday and I was still having some chest discomfort. The receptionist and the woman who took my initial vitals and a EKG were very kind. However my experience with the nurse practitioner Tracy was less desirable. Tracy asked where I lived and I told her. She suggested I may want to find a closer physician to where I lived. That should have been my first sign to RUN !  Then I spoke to Tracy about my current issues that she quickly dismissed as being associated with my heart despite the fact that my ekg that was done at the beginning of my visit was abnormal. Tracy said everyone has abnormal Ekg’s. Tracy never seemed to truly listen to my problems and she was dismissive of everything I said. I felt like my voice and my concerns were not heard. So, I asked what was wrong with me. Tracy initially said she wasn’t sure but she knew it wasn’t my heart and suggested I do stretches. Tracy said she was going to look at the results of my blood work that was done initially and come back to speak with me. Problem is , Tracy never came back. Tracy sent the poor receptionist to speak with me and give me my results and to tell me that I needed to schedule to come back for a stress test later this month but I didn’t need to be in a hurry to do it.  The receptionist had a boot on her foot and was barely walking herself. I asked the receptionist to ask Tracy what did she suggest about my chest discomfort. The poor receptionist had to walk again and find Tracy. At this point, Tracy did not come directly back to speak with me. I ended up walking out of the patient room and into the waiting area to patiently wait to speak with the receptionist  once she got off the phone. At this point, Tracy came out in the waiting area to speak with me. I asked Tracy about my continued chest discomfort. Tracy told me that I could have pulled a muscle and I needed to take ibuprofen with every meal. Tracy then said it could be my esophagus or  just from standing up. Basically, she had no answers for me. Total waste of time and money. They don’t care about you. If you want to live, go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "108614393673397163525", "name": "M Stevens", "time": 1597263598182, "rating": 5.0, "text": "Very nice facility. Clean environment, easy access in and out. Friendly expert staff. One of the few doctors office which answers the phone and will call one back if they are not able.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "105561131395772363493", "name": "Shasta Robinson", "time": 1609956575509, "rating": 1.0, "text": "They don’t CARE. My boyfriend is dying from Covid he is a heart failure patient and he was told by the ER in Valley to go get an infusion in Opelika today and these doctors have not utilized communication and now he was denied the infusion and we can’t get a soul to make a phone call ! Mitchell is my boyfriend’s heart doctor and he’s simply not even pretended to put forth an effort in reference to a plan or advice .", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "102160858331465534909", "name": "Johnny Harper", "time": 1601416055424, "rating": 5.0, "text": "Dr. Barry Crowe was a life saver for me. Awesome heart doctor.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "100098964180667077633", "name": "Shirley Kitchens", "time": 1604354150894, "rating": 5.0, "text": "Excellent patient care and caring staff.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "103798012037038776536", "name": "Jessica Nash", "time": 1534278472645, "rating": 5.0, "text": "Dr. Mitchell is a very caring doctor, and his staff is AMAZING!", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "105643733011965693122", "name": "Ray Johnson", "time": 1429570732528, "rating": 5.0, "text": "They are very friendly and very much appreciated for what they do.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "102412622160430059433", "name": "Tolandra Bledsoe", "time": 1509992412903, "rating": 2.0, "text": "The Valley office can do better.", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "107561267840381759223", "name": "Sam Wade", "time": 1548883401403, "rating": 5.0, "text": "saved my life", "pics": null, "resp": null, "gmap_id": "0x888cf31e65ee324f:0x333469e798db3a03"}
{"user_id": "114749075745481045817", "name": "James Hall", "time": 1605234018587, "rating": 5.0, "text": "Dr. Jain and his wonderful nurse Keysha are the very best medical team I have ever been to see.  They are very caring, supportive, and of course knowledgeable.  They inspire and motivate me to try hard and live a healthy life style.", "pics": null, "resp": {"time": 1611256304984, "text": "Hello, Mr. Hall. Thank you so much for your review and for taking the time to share your experience! We work hard at Huntsville Hospital Heart Center to exceed expectations and are happy to hear we hit the mark. We will make sure that Dr. Jain and nurse Keysha see your nice comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107244352355207326625", "name": "Rosemary O Gracia", "time": 1623851764285, "rating": 1.0, "text": "Dr. Green is terrific and the scheduling is terrible I called the nurse twice and she assured me that the department will call me back she said that department was full she assured me that I have the stress test so I can have my revision knee replacement it's painful everytime I walk it's painful ice pack can only do so much as soon the stress test is done I have my surgery", "pics": null, "resp": {"time": 1623869235308, "text": "Hello, Rosemary. We are very sorry to hear that you have had trouble scheduling an appointment with Dr. Green. Please call (256) 801-6804 so our Service Excellence Coordinator can assist you."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112792796621473737833", "name": "Brandy Thomas", "time": 1600472299227, "rating": 5.0, "text": "Absolute LOVE Dr Kanitkar!   He goes above and beyond and he found a congenital Heart defect after my first visit,  that no other cardiologist had found and I had gone to the other cardiologist for years! He has shown he genuinely cares about my overall health!", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100214528143883045960", "name": "Vickie Simmons", "time": 1613598822733, "rating": 5.0, "text": "Very nice clean place employees great helpful caring", "pics": null, "resp": {"time": 1613659523913, "text": "Hello, Ms. Simmons. Our team strives to be helpful and caring, and we are glad to know we hit the mark during your visit. Thank you for allowing us to care for you."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "103119265035026812389", "name": "Melissa Hardenbrook", "time": 1604948711825, "rating": 1.0, "text": "I had to take m 87 year old grandmother to see Dr. Kahn today (11/9/20)@1pm. Me and my uncle are my grandmothers caretakers. Dr. Kahn’s nurse called us last week to make sure that she brought family members  with her cause she was getting some results that weren’t good. The nurse that took our temp on 1st floor was super nice. But the nurse that was by elevators on the 2nd floor was really rude and she cussed at me and my daughter. There was no sense in her behavior. So you need to check your nurses attitude toward ppl. I have already contacted higher management. I know this COVID is really really serious but that’s no reason to be so rude and disrespectful. I work on the frontline too during this pandemic. Get your ppl in check!!!", "pics": null, "resp": {"time": 1611256130881, "text": "Hello, Ms. Hardenbrook. We are so sorry to hear that one of our nurses acted unprofessionally. We expect our staff to treat patients and family members with respect at all times and will share your comments with our leadership. If you would like to talk about this further, please call the Patient Advocate at (256) 265-9449."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106961502216609819265", "name": "Carolyn Taranto", "time": 1600453711584, "rating": 5.0, "text": "Moving to Huntsville,Alabama and needed to get a heart doctor for my husband and Susan was so kind to me on phone...\nHelping me set up an appointment and she got his information and gave me the fax number to give to his heart office so they can get his information to her ..\nThank you,", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100378358238515040887", "name": "Sadie Lynch", "time": 1603122523578, "rating": 5.0, "text": "Had a appointment with dr Mann today from the moment I walked in to temperature check and check in upstairs everyone was so welcoming the nurse who did my ekg was wonderful the nurse who assist dr Mann she was wonderful and also save the best for last dr Mann was fantastic she explained everything so that I could understand definitely deserve 5 stars", "pics": null, "resp": {"time": 1611249867771, "text": "Hi, Ms. Lynch. Thank you very much for such a great review! We work hard to make sure that we are offering the best patient experience. So happy to hear that our commitment was clear with you! We'll make sure Dr. Mann sees your wonderful comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "103447123858050165479", "name": "Barbara Watson", "time": 1597678075577, "rating": 5.0, "text": "I had Hiatal Hernia surgery. My doctor was Dr. Speicher. He's the best. I would highly recommend him to anyone.", "pics": null, "resp": {"time": 1597854969747, "text": "That's great to hear, Ms. Watson! We appreciate the great review and will make sure Dr. Speicher knows how pleased you are with your surgery outcome."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "113287989392336901469", "name": "Rick Barger", "time": 1614011663250, "rating": 1.0, "text": "1 week to get a refill on Coumadin this is unacceptable", "pics": null, "resp": {"time": 1614117490375, "text": "Hello, Mr. Barger. We apologize for the delay and want to make sure you have the medications you need. Please call our administrative office at your earliest convenience, (256) 801-6804."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114144310138776799172", "name": "Alan Montgomery", "time": 1565727959441, "rating": 5.0, "text": "Caring and attentive, very well run and maintained facility.  Excel medical staff.  Very happy with the.  They LISTENED to my concerns, addressed them in a manner I could understand.  Overall a great experience", "pics": null, "resp": {"time": 1565980336858, "text": "We're glad to hear that you had a five-star experience, Mr. Montgomery. Thank you for taking the time to leave a review. We'll make sure our staff sees your comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118251920215843217847", "name": "Amy Smith", "time": 1556289298787, "rating": 5.0, "text": "Registration and check in were fast and timely.  I didn't have to wait very long at all for my appointment.  The tech who did my EKG was efficient, kind,  and competent.   Dr. Mann was thoughtful - she took the time to listen to my questions and answered them all.  Her nurse made sure that I understood follow up instructions and was clear that I could call if I needed more information.", "pics": null, "resp": {"time": 1556546191197, "text": "Thank you for taking the time to let others know about your visit, Ms. Smith. We're so pleased to hear that you had a five-star experience -- that's our goal for every patient. We'll make sure Dr. Mann and the rest of the team see your very sweet comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107908817226408029282", "name": "Janette Perry", "time": 1549297798572, "rating": 3.0, "text": "The doctor we see is wonderful. But this is the poorest run Dr. Office we go to. My aged Mother has had cancer and has heart problems so we see several Doctors. This office will tell us that they will contact us when it is closer to time for the next visit. This visit is due in Feb. and it is now Feb. I have called for an apt. I have not heard back. She is now running out of her medication and again I have called for it but have not gotten a call back. In the past I have had to call several times with no return calls. I would just expect that a office connected to Huntsville Hospital would be better run. The last time after several calls I finally went in and parked myself in their office until I could get confirmation that her medication would be called in. It took over an hour of waiting.  Another thing I have had problems with in the past was getting in when my Mother felt her heart was again out of rhythm. I know they are busy but you hate to go to the hospital to find out if she is in trouble. This Heart center has people that run a heart Cardiogram every time we go in so why can't they have a room set up for people that just need to make sure they are ok if they feel they are having problem? Most people would rather have a Doctor visit bill as apposed to a hospital bill just to get a Cardiogram run. There are a lot of people out there that can't afford the hospital bill, but with insurance could get to the Doctor.\nAgain we love the Doctor we see but feel the heart center needs better management.", "pics": null, "resp": {"time": 1549475511718, "text": "Thank you for taking the time to bring this to our attention, Ms. Perry. We're very sorry that you have had trouble getting your mother's appointments scheduled. We have shared your comments with our practice administrator, and she is more than happy to discuss this with you. Please call (256) 801-6804 at your convenience."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114418940694340652947", "name": "jacqueline so sad to hear this patterson", "time": 1594315484580, "rating": 5.0, "text": "Dr Thomas Wright has been an amazing  Dr for us", "pics": null, "resp": {"time": 1594659299446, "text": "Thank you for the 5-star review! We appreciate your continued trust in Dr. Wright and the rest of our Heart Center team."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111183495630817208317", "name": "Addie Sanderson", "time": 1601652339749, "rating": 5.0, "text": "Dr. Mann is one of the best of the best.", "pics": null, "resp": {"time": 1611248610094, "text": "Hi, Ms. Sanderson. Thank you so much for the positive rating and for taking the time to post. We truly appreciate our patients and work hard to earn positive feedback from great folks like you!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107600049092636768387", "name": "Ray Claborn", "time": 1504114499760, "rating": 5.0, "text": "I was with my wife yesterday while she visited Dr. Mann. I was highly impressed and amazed at the efficiency from the time we walked in the door. From sign-in to heading toward the examining rooms took about 3 minutes, the nurses doing the test while another was taking more information, followed immediately by Dr. Mann coming in. She quickly and completely\ninformed my wife of test results, sat on a stool and within minutes  sat a date and time for an out-patient procedure, followed by check-out. Just fantastic.", "pics": null, "resp": {"time": 1504215838483, "text": "Thank you for contacting us, Mr. Claborn. It’s our pleasure to care for your wife. We will be sure to pass along your kind words to Heart Center leadership."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "109985196974167968210", "name": "Sherry Lathan", "time": 1578152324763, "rating": 5.0, "text": "I had 2 stints placed yesterday by Dr. Ridner at the cath lab. From the moment I was taken thru that door I was made to feel cared about.  Every nurse and patient care tech that came in contact with us made sure I understood and was ok with everything they did. No one was rushing thru their jobs and everyone was helping each other learn their way of doing things. I have had multiple surgeries at different places such as MMCS, MMCN, UAB and Huntsville Hospital but the care not only me but also my husband received yesterday went way above any other place we have ever been. I would recomend the Heart Center cath lab staff and Dr. Ridner to anyone! Thank y'all for making my procedure not so scary and for taking care of me!", "pics": null, "resp": {"time": 1578324772910, "text": "Wow, what a fantastic testimonial! Thank you, Ms. Lathan, for taking the time to let others know about your experience with Dr. Ridner and the rest of our Cath Lab team. We're so pleased to know that your visit met and perhaps even exceeded your expectations. That is our goal for every patient."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115131734841478230625", "name": "khris anderson", "time": 1514913002679, "rating": 1.0, "text": "My son was asked to wear the heart- monitor.  It broke within the first couple of days and  he returned it,  Although he had never worn it - he received a letter saying that his test was complete and showed not issues.  The doctor he had seen a few years earlier hadn't bothered to read his chart before our visit.  If you go to any doctor in Huntsville Hospital's system you take your very life in your hands.  They are NOT patient-centered, but are focused ONLY on the bottom line.", "pics": null, "resp": {"time": 1515004757722, "text": "Hello, Mr. Anderson. We strive to provide quality care and service to every patient, and when we fall short we want to hear about it. To ensure proper follow up, please ask your son to follow up with our Customer Service Representative at (256) 801-6682."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "101727864550161963403", "name": "Lana Dempsey", "time": 1488812602021, "rating": 5.0, "text": "The Heart Center was a life saving experience for our dad. He received treatment for over 5 years from St. Thomas hospital in Nashville & we never saw positive results. Numerous times we asked why a certain treatment wasn't used and were given bogus answers. Dad's first visit to the Heart Center & being under the care of Dr. Cash was truly a blessing. Dr. Cash immediately identified dad's need to have a pacemaker. Surgery was scheduled, completed, and sucessful. Sadly, several years after receiving his pacemaker dad was diagnosed with Stage IV metastasized lung cancer. Dad had issues of panic/anxiety attacks which were originally thought to have been heart related. After visits and test with Dr. Cash, he diagnosed him with anxiety attacks, just from the shear stress of being a cancer patient. Dr. Cash went above and beyond to care and treat our dad. He prayed with our family and was genuinely concerned for dad as well as our family. We are very grateful to Dr. Cash and his office.\nWe HIGHLY recommend The Heart Center.", "pics": null, "resp": {"time": 1488821750280, "text": "Hello Mrs. Dempsey. We really appreciate your heartfelt review and will be sure to share it with Dr. Cash."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "116520667598806409384", "name": "Steven Holliday", "time": 1449723838811, "rating": 5.0, "text": "I have been a patient of Heart Center Inc for over a year now and every experience I have had has been excellent. My first time there I was having problems and the doctor got me in right away and ended up admitting me to the hospital to run test so that he could find out what was causing my symptoms. I have never had to wait very long to get an appointment scheduled, nor have I had to wait very long in the lobby or exam room. This is one of the most efficient and smooth running office I have been in. Every staff I have come in contact with, whether it was the front desk, scheduling, techs, nurses, or doctors, they have been extremely friendly and courteous. I would highly recommend anyone that needs to see a cardiologist to use this office, you won’t be disappointed", "pics": null, "resp": {"time": 1449763590498, "text": "Thank you for sharing your experience. We appreciate the feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "117383354075285854391", "name": "Mary Holliday", "time": 1449695102456, "rating": 5.0, "text": "My Grandfather was a patient of Heart Center Inc before he passed away. He had been treated by another cardiologist office prior to changing to Heart Center Inc. His experience with HCI was a much better, more enjoyable experience than what he had experienced at the other office. All the staff are very courteous and professional. It is a well organized and managed office. I would highly recommend all my friends and family to use Heart Center Inc.", "pics": null, "resp": {"time": 1449698570151, "text": "Thank you for taking the time to review the Heart Center. We appreciate your feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "102194964391544037331", "name": "Tricia Eakes", "time": 1449723274946, "rating": 5.0, "text": "Much appreciation and gratitude to the Physicians, Nurses and staff. There is always a helping hand no matter where you are in this facility. Everyone is very helpful and understanding from registration to point of care. It's really nice to know we have such a great facility in our home town!", "pics": null, "resp": {"time": 1449763545864, "text": "Thank you for the kind words."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112712146897383160237", "name": "Sadie Mae", "time": 1557273225813, "rating": 5.0, "text": "I come here to the coumadin clinic on the top floor. This is the NICEST group of people I've ever encountered in the medical field. From the ladies to the desks to the nurses to the NPs. They're so helpful and concerned about my health. I don't feel rushed at all. They really helped me ease through my transition onto coumadin and calmed my fears a lot.", "pics": null, "resp": {"time": 1557419938283, "text": "Hi, Sadie! Thank you for taking the time to share your impressions of our clinic. We're glad to hear that our staff is giving you such great care -- and doing it in a way that's helped ease your fears. We will make sure the entire Coumadin Clinic team sees your sweet message."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118064058086264183761", "name": "Regina Mcgee", "time": 1449694679952, "rating": 5.0, "text": "I have been a or at the heart center for over a decade.  I Have always had phenomenal care!   Both my parents are patients as well.  We are VERY fortunate to have this level of care right here at home.", "pics": null, "resp": {"time": 1449698523271, "text": "Hi Regina,\n\nThank you for your feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115771906824899048318", "name": "Edna Neisler", "time": 1478287281458, "rating": 5.0, "text": "I have been a patient of the heart center since 2002. I have a wonderful doctor,his name is Philip Laney. He is a doctor that I can trust. He has saved my life more than once. Every person in the practice is so good to me and my husband. I also am a patient of Dr Jennings. He put a CRT-D device in my chest. A difulater/pacemaker device. He is a great surgeon who took time with myself and my husband. I highly recommend the Heart Center to any one who has heart problems.", "pics": null, "resp": {"time": 1478295192797, "text": "Thank you for your feedback. It's a privilege to care for you and your family. Your kind comments will be shared with the appropriate staff and Heart Center leadership."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "112088480529644877118", "name": "Union Grove Veterans Thrift Store", "time": 1570812435524, "rating": 5.0, "text": "They real have great doctors.", "pics": null, "resp": {"time": 1571068629025, "text": "Thank you for the five-star review!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "110027092306180186089", "name": "Marc Lewis", "time": 1515343167812, "rating": 5.0, "text": "This is one of the best cardiology teams in the southern United States. Up-to-date facility.", "pics": null, "resp": {"time": 1515685651435, "text": "We appreciate the rating and your nice comments Mr. Lewis!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "100949081674993101622", "name": "Nicole Weston", "time": 1466110310081, "rating": 5.0, "text": "Hi my name is sherry Baez I have been a pt. At the heart center since 2006.that is ten years.I have always need treated great.when ever I have a question they are always happy to answer or find the answer for me.I love my Dr.there. he is always making jokes. I love my pace maker Dr too and now the vein drs.I thank gods everyday for the special hands he gave the drs at the heart center...", "pics": null, "resp": {"time": 1466456292146, "text": "Thank you for your kind words Sherry. We appreciate you taking time to review our practice and provide feedback."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "115338680088504229959", "name": "Barbara Peeler", "time": 1521484135892, "rating": 5.0, "text": "The heart center is a very nice place they make you feel so comfortable I love Dr McGraw and his staff", "pics": null, "resp": {"time": 1522156333036, "text": "Thank you for your kind words, Ms. Peeler. We appreciate you taking the time to leave a review for us!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "116763624525163633749", "name": "Matthew Goodwin", "time": 1549296104733, "rating": 4.0, "text": "Dr.Valtose is a very good down to earth Cardiologist that I Trust", "pics": null, "resp": {"time": 1549310872380, "text": "Thank you for taking the time to leave a review, Mr. Goodwin. Dr. Valtos has certainly been a great addition to our practice and to the community. We will make sure he sees your very nice comments."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "110201958691129601342", "name": "paw waw", "time": 1517972144776, "rating": 1.0, "text": "My mom just left this place in tears. She was told by her primary that she needed to have a stress test and echogram done. This is why he was sending her here. Dr. valtos didn't do any of this. Instead he took the results of some tests she had 3 months ago and, decided she needed to be on 3 different medications. She's done everything she could these last 3 months to avoid taking medications and, she was hoping these test results would reflect that. However THERE WERE NO TESTS done by Dr Valtos! This blows my mind. We just wasted money for him to tell her what she already knew? Not to mention the way he treated her was ridiculous. He didn't believe anything she told him. It seems to me that he was just to quick to judge and wanted nothing more than to push pills down her throat. Literally. I'm very disgusted with the way she was treated and, I will definitely make sure everyone I know knows how she was treated.", "pics": null, "resp": {"time": 1518473570010, "text": "Hello, Ms. Malenfant. We are sorry to hear that your mom's visit left you both upset. To help us further address your concerns, please reach out to our Customer Service Representative at (256) 801-6682."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "105469224814122336222", "name": "Charles Wildman", "time": 1450693790414, "rating": 5.0, "text": "Dr. Ridner has been my Cardiologist for more than 10 years. The more compliant I am with his advise the better my health is. Dr. Soliman installed my stint in 2005 and it has done very well for me. I couldn't ask for a better group of people to look after me from the schedulers to the nursing staff and of course the Physicians.", "pics": null, "resp": {"time": 1450711142189, "text": "Thank you for your feedback Charles!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "106201192621476795619", "name": "cheryl strickland", "time": 1435168154264, "rating": 2.0, "text": "Huntsville Hospital is a FOR PROFIT, PRIVATELY OWNED hospital who has to answer to stock holders. Therefore their profit margin is much more important than patient care and treatment.  Some of their policies reflect that also. For instance, if you go to the ER needing surgery, if there is not a DR. to do that surgery on duty, you will have to wait until one is scheduled if it \"probably\" won't kill you to wait.  My husband waited 3 days for an orthopedic surgeon for a spiral break in his femur, which is a very dangerous bone to break. It's where our blood supply is made and when broken, releases air bubbles and clots into the blood stream so he was kept on blood thinners for 3 days before major surgery.  Now, not only did the hospital get to charge us for those 3 extra days and all his normal medications, because you are NOT allowed to take your own from home, but they did NOT have to pay a surgeon overtime or vacation pay to come in when off duty, so we are cash cows to that hospital.  The nurses are horribly underpaid and badly treated, but with Huntsville Hosp. owning all hospitals for 8 counties, they really don't have a lot of choices. Most of the nurses were wonderful, however the Dr.'s, especially Dr. Wright, made us feel like our health was secondary to profit, pushing hard for procedures we are very hesitant about and offering no real evidence they would even help. In fact he told us straight out that it probably would not help, but it just might.  Just be aware the Dr.'s are Huntsville Hospitals life blood money and do your research, ask lots of questions, ask about safety and recalls for any hardware they want to implant. In our case the Defibrillator manufacturer was being sued in a class action suit because the leads were corroding and impaling the arteries, but they were still using these defibs and when we asked about them Dr. Wright's answer was, and I quote \"they all have problems\". Now that's not exactly comforting.  We told him we wanted to do some research and think about it, but that did not stop his office from calling us EVERYDAY for 3 weeks until I asked them not to call us ever again, we would call them if we changed our minds. Then we were told it was their job to \"recruit 12 to 18 surgeries PER DAY\".  Yes after 35 years of marriage, it is an \"us\" decision.  We both feel very uncomfortable with it all. We are going for a second opinion at Vanderbilt. I'll update and post what they tell us.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107721292155397117795", "name": "Sky Queen Ce", "time": 1517958574402, "rating": 1.0, "text": "Jeanna in Scheduling needs a different departments other answering the phones. I called for help several times and she just sends me on a run around. To the last time I told her that I really needed help about getting my appointment schedule. She sends me to a dead end then I can't call back cuz it's after 5. Of course all this is because she just want to go home. Started this process today at 2 p.m. I call back at 4:30 only to get basically get the run around for 30 mins and hung up on.  Please pull the tapes. February 6th 2018. Not happy.", "pics": null, "resp": {"time": 1518473526085, "text": "We'd like to offer our apologizes that you didn't get the help you were seeking. If you need further assistance or would like to speak with someone about your experience our Customer Service Representative is available at (256) 801-6682 or customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107274309179293285132", "name": "Jim Gordon", "time": 1450020134482, "rating": 5.0, "text": "The Heart Center (THC) is responsible for some of the highest-quality medical care I've ever had.  From the scheduling, to the support staff, to the physicians, their care and professionalism have been uniformly excellent.  A few years ago, after experiencing \"the bends\" on a scuba trip to the Caribbean, I was tested at THC the day after returning to Huntsville.  After an ultrasound test, I was diagnosed with a \"patent foramen ovale\", or a hole in my heart.  Within a few days, surgery was scheduled, the hole was repaired, and I was home, feeling great.  I've had several other tests at THC, including a very successful cardiac catheterization.  I would heartily recommend THC to anyone who has, or suspects any cardiac issues.", "pics": null, "resp": {"time": 1450105223384, "text": "Hi Jim,\nThank you so much for sharing your experience. We appreciate your kind words."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111386931083582009127", "name": "Juzt Kandi", "time": 1471537172541, "rating": 1.0, "text": "I called to schedule an appointment however once i got someone on the line she was clueless so she transferred to someone else ( FINE UNDERSTANDABLE ) Once i was transferred the lady answered my questions but she had an attitude then transferred me back to scheduling to make the appointment...As im in mid statement i just hear music playing the lady obviously didnt care i was talking so she transferred me to someone else...Needless to say i told the person how i had just been treated and i would be taking my money else where. Just plain RUDE !! Hope thats not an indication on their usual  behavior !! Would never ever ever go to this place !!", "pics": null, "resp": {"time": 1471546719177, "text": "We sincerely apologize that you were unhappy with your experience. Thank you for contacting us. The information you shared above will be passed along to our Customer Service Representative and management team. If you prefer to contact Heart Center Customer Service yourself, you may call (256) 508-5711 or email customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "117360967572212065566", "name": "Lindsey Frost", "time": 1403034880182, "rating": 1.0, "text": "I was told that I would have to wait 2 and a half weeks for an appointment for a pulse that was above 120 for 2 days straight and horrible chest pains. I had called at noon and was told I just needed to wait and got called back at 4:56 and was told there was nothing they could do cause they were about to close. They said they would call me the next day, 5 days later still have not heard anything. I found another cardiologist at another facility that worked me in immediately given my symptoms and age. I got my meds changed and got a heart monitor. I was more than disappointed in the staff at The Heart Center, and will tell everyone I know. I was only given attitude when I stressed how important this was, like they could care less if I had a heart attack or not. And when I said I may just have to go back to the hospital they said \"well then you just do that then\", which needless to say did not help my pulse rate problem at all.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111317365255479011101", "name": "Ashley Drewes", "time": 1449602655499, "rating": 1.0, "text": "STAY AWAY! The heart center is full of racist employees. I witnessed the white workers in this place mistreat their non-white employees using racial slurs and making verbally abusive comments to the employees. I should note I am considered \"white\" myself and found this very tacky and unprofessional behavior. I especially noticed one person, by the name of Tiffany,  making condescending remarks to one employee in particular who was not of the white race. Very disappointed in what I witnessed and would advise all to not do business here. I got up and left and never returned after that.", "pics": null, "resp": {"time": 1449604799769, "text": "Thank you for bringing this to our attention. The Heart Center's Customer Service Representative has requested that you call at your earliest convenience to ensure proper follow up: (256) 508-5711. For reference you may also email customerservice@theheartcenter.md."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "118006053628201249416", "name": "Kathy Sanders", "time": 1393964969787, "rating": 2.0, "text": "My Mother is a patience at the heart center and to date it has been a very unpleasant experience.  I am sure that the doctors there are great at their job.  I think Mother has had ok care.\nAfter several calls and no return calls back, we have managed to get the job done.  My Mother was in the hospital in January and ended up on a ventilator, the day she was released from the hospital the heart center was to come down and review her medication.  Never showed, but we had an appointment with her Doctor in a week so thought all would be good, but that appointment was changed, and then changed again.  Yesterday she went into see the dr and he had no idea what meds she was taking and what milligrams, are you kidding me, your nurse practitioner never showed up to review medications.  She is on coreg which needs to be taken two times a day, but the orders said one.  They changed her meds to hydralazine along with the coreg, the hydralazine is to be taken three times a day, but again the orders said once a day. Yesterday they took her blood pressure in the office and said it was 120/70, and my sister said that is strange. It has been running high, and she snapped back well not today.  Then the dr took it and it was 200/94, really.  On the way home from work last night my sister stopped to pick up meds and only one was there, a water pill, not the increased dosage of coreg or hydralazine.  Either this office is very incompetent or they have way to many patience.  Our Mother is very precious to us, and she has been through hell and back.  She deserves better treatment than this .", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "104257493432478120295", "name": "Tracy Schloss", "time": 1449682955264, "rating": 5.0, "text": "All of my experiences have been outstanding.", "pics": null, "resp": {"time": 1449698420198, "text": "Thank you for reviewing the Heart Center!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "104038490408778865800", "name": "Charli Hillis", "time": 1449682420577, "rating": 5.0, "text": "Dr. Allison always takes time and listens to me. Will definately be back!", "pics": null, "resp": {"time": 1449698389309, "text": "Thank you for the rating!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "114005382676703010048", "name": "James Gray", "time": 1511658343735, "rating": 5.0, "text": "A place where the staff actually CARE about the patients more than the almighty dollar!", "pics": null, "resp": {"time": 1511798128134, "text": "Hello, Mr. Gray. Thank you for the compliment and the great rating! We appreciate the opportunity to care for those in our community."}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "111972857104421072908", "name": "C Witty", "time": 1507040038273, "rating": 5.0, "text": "Great doctor! Great staff!  Best I've ever been too in Alabama!!!!!!!!!!!!", "pics": null, "resp": {"time": 1507125331451, "text": "Thank you for choosing the Heart Center to care for you. We appreciate your kind words!"}, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "107321204915505753498", "name": "David Milhollin", "time": 1428418473568, "rating": 4.0, "text": "These guys found a problem in my stress test - got me through some additional tests and then over to the hospital for a heart stint -- thank you", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0xc3a7a40a6be15cbb"}
{"user_id": "105256378627230408426", "name": "Benny Manzanilla", "time": 1627000953839, "rating": 5.0, "text": "Citron is the best he  listen to your problems and he makes you feel comfortable when talking to him and his staff is awesome they all make you feel like part of the family if you ever have a problem you can call and they work you right on in I highly recommend hem", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "114430704359313693593", "name": "Sherry Lindeen", "time": 1614799523553, "rating": 5.0, "text": "I really appreciate Dr. Citrin.  He is a very compassionate and kind physician.  He takes the time to explain medical terms in \"plain English\", that you might not easily understand otherwise.  I believe that he truly cares about his patients and I am thankful he is my cardiologist.  Oh, and I also absolutely love his Assistant Olivia!", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "110260344436654724359", "name": "Tammie Walter", "time": 1602249323136, "rating": 5.0, "text": "Dr Morin is the best! Thorough, genuine, and easy talk to. Haven\"t seen Dr Citron, only spoke with him over the phone, and he also seems concerned and nice as can be. The only downfall is the office staff is very disorganized. But the good still outweighs the bad and I appreciate ya'll!", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "112426419655239049190", "name": "Stephanie Reynolds", "time": 1582341253590, "rating": 5.0, "text": "I’m a new patient and I wanna say that I love this office. I went to urgent care and they sent me to Dr.Citrin. I was so scared of what was wrong with me. I had a few test which I had same day. Who lets you have you testing all in one day anymore . Well they do.  Best office hands down  and the staff was great. I’m going to live another day thanks to DR. Citrin and his staff.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "101902711088429432196", "name": "Jamie Asher", "time": 1582351198016, "rating": 5.0, "text": "This office is unique in that the staff is very warm and friendly.  Dr. Citrin really takes the time to make you feel at ease and I'm impressed by his knowledge and professionalism.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "113021924966981065474", "name": "Amanda Plaisance", "time": 1582322586400, "rating": 1.0, "text": "HORRIBLE EXPERIENCE SO UNPROFESSIONAL! I listened to the cardiologist YELL at his employees for over an hour about a scanner while waiting to be seen!!!  The appointment was for 2 o'clock and at 4pm still not seen and he is still complaining about a scanner! I will never come back and never recommend this practice to ANYONE. I didn't even want to give it one star!!!!", "pics": null, "resp": {"time": 1582349798413, "text": "We always welcome constructive feedback on ways we can continue to improve and strive to offer the highest quality of care for our patients.  However, we have no record of this person as a patient in our office."}, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "114559399631085700647", "name": "Jackie Racine", "time": 1556666246636, "rating": 5.0, "text": "I have just seen Dr Citrin twice.  He is a joy to be around.  Very friendly staff. Smooth running office. He did a Heart Cath and stent for me.  Very good experience for me.  I would recommend Dr Citrin to my friends.👍👍💕💕💕", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "106961822857426341956", "name": "William Sutherland", "time": 1610398058009, "rating": 5.0, "text": "Five star", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "113398514769911207833", "name": "Gloria Steiner", "time": 1503800320365, "rating": 5.0, "text": "Started going to dr. Citrin after I watched his video on 15 news about first responders. Very satisfied with my choice. Great staff and clean environment.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "116817854259598700650", "name": "Clara Holmes", "time": 1504110217183, "rating": 5.0, "text": "Dr. Citirn has cared for several members of my family and has always shown the utmost dedication to his patients. He goes above and beyond what many Doctors will do and works hard to keep the family continually informed to make the best decisions regarding care.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "115604170428223746567", "name": "William Steiner", "time": 1503505738093, "rating": 5.0, "text": "Love the staff and doctor. When you need an apt they work you right in. Would recommend, treats you like family.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "105758519994704714246", "name": "Nelson Coleman", "time": 1538943115018, "rating": 5.0, "text": "Great man, great Doctor, great staff. They are always here when I need them.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "102795642345944989972", "name": "Larry Thomas", "time": 1503031446338, "rating": 1.0, "text": "If you want a physician that has integrity and morality choose another practice.", "pics": null, "resp": {"time": 1582349577201, "text": "We always strive to provide the highest quality care for our patients and welcome constructive feedback on ways we can continue to improve their experience.  However, we have no record of this person as a patient in our office."}, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "102594144536554204039", "name": "Jessica Olsen", "time": 1572569645695, "rating": 1.0, "text": "they will cancel your appointments with other specialists without your consent. didn't take my case seriously. absolutely the worst experience I've ever had.", "pics": null, "resp": {"time": 1573612592814, "text": "We apologize for any confusion regarding scheduling an appointment for a doctor in a different specialty. When we determined this doctor did not have openings for two months and offered to schedule you with another doctor in the practice, you communicated that you had a contact there and would take care of it. We regret we have not been able to reach you by phone to discuss the matter.  Patient satisfaction is our top priority and we do our best to help patients in every way possible."}, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "116523544537935328098", "name": "Tina Johnson", "time": 1503965507749, "rating": 5.0, "text": "Great  cardiologist. # 1 in mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "101306634625371315829", "name": "GERRY WRIGHT", "time": 1504195501427, "rating": 5.0, "text": "Best cardiologist, love his new location", "pics": null, "resp": null, "gmap_id": "0x889bb28ab9336d01:0x49ad31fc155b59ff"}
{"user_id": "104456756072904126506", "name": "Felicia Brown", "time": 1622468758132, "rating": 5.0, "text": "My experience was GREAT!  I wasn’t sure what a deep cleaning of my gums meant when I got there but my technician was really good about explaining everything to me and she made sure I was comfortable.", "pics": null, "resp": null, "gmap_id": "0x88891bc9f2509445:0xd6b6e2efd9a4c8df"}
{"user_id": "106745501020630880939", "name": "GT&JoAnn Cartledge", "time": 1493239205960, "rating": 5.0, "text": "He is very skilled, knowledgeable, and patient interest", "pics": null, "resp": null, "gmap_id": "0x88891bc1d5ef057f:0x242f7bb53b31b657"}
{"user_id": "104022663049283154460", "name": "Donna Robbins", "time": 1623101280149, "rating": 5.0, "text": "Love Dr Dorene Morris n her staff BEST DR WITH A LOVING CARING SOUL LIKE NOBODY ELSE ! WOULDNT USE NO ONE ELSE !", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "108222185108168306049", "name": "Tim Elam", "time": 1519406796019, "rating": 5.0, "text": "Dr. Karr and his staff are very professional and courteous. Dr. Karr has genuine concern and takes the time to listen to his patients. Highly recommended.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP2mzRRmIr_dV01mKQa3KTC0sQk-l5PZf7GHTKi=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "106677762198761481726", "name": "Roberta Birch", "time": 1616021099065, "rating": 1.0, "text": "This is the facility where patients go for all labs and testing. Even if  you think you have an appointment, it doesn't stand. You put your name on a list when you get there. I had an appointment for a test, got down there from Florence, and they were closed! There was a severe weather warning for the county they're in, but I didn't know as I don't live in that county and didn't hear any warning. No phone call. No sign on the door. No answer to phone calls inside, no answering machine or service. They just stand you up.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "103378485739557134899", "name": "Susan McClain", "time": 1623081030205, "rating": 1.0, "text": "Be prepared to wait over an hour or two past your appointment time to be seen by your provider.  The office is dirty.  Receptionist/office workers are not very friendly. The appointment times are overbooked.  Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "114682253128668513098", "name": "Cathy Pham", "time": 1614618068192, "rating": 1.0, "text": "This place is absolutely horrible. They always over book patients. The average wait time is 1.5-2 hours. It doesn’t matter if you get there late or early, you’ll always end up waiting for at least 1 hour. It’s ridiculous. Don’t brother with this place unless you want to spend most of your day napping in their waiting room.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "111257441857859077736", "name": "Tracy Stubblefield", "time": 1607525106275, "rating": 5.0, "text": "My dad saw dr ridgeway. Love him! Well worth the wait. What a gem.  He answered all of my dads and my questions with total patience. 🙏🏼", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "112485778664154714806", "name": "Ann Shortis", "time": 1606924568050, "rating": 2.0, "text": "Disorganized,fired too many experienced staff leaving mostly young inexperienced staff. Expect long waits from over booking patients.We waited almost 2 hours on more than one occasion due to staff inability to triage patients,forgetting to sign patients in on arrival,not allowing appropriate time for new patients to be seen.Just to name a few.\nAlso,for months we have heard \"our fax machine is old and doesn't work right\". I suspect the staff cannot trouble shoot or even work it if the \"go\" button doesn't work the first time..or it is an extremely old machine that needs replacing and no one wants to spend money on it..faxes have mysteriously gotten \"lost\" far too often  to be just an accident. We have to go in person and stand at the counter and complain to get anything for another Dr to see.\nThe technician/Drs who read the CT results are 100% unreliable. 2 ct's can read wildly different even within a couple of days of each other. The X-ray situation is soso.\nStaff with minimal in house training take the various scan,ultrasounds etc  and readings..\n\nMainly,it's a crapshoot on care here.Which has gotten much worse since our Dr died in a 4by4 accident.\nI say avoid if at all possible", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "102917387449175572407", "name": "TSR Consulting", "time": 1594934459489, "rating": 1.0, "text": "I continue trying to call Dr. Liotta but no one answers the phone. Kinda hard to see my PRIMARY CARE PHYSICIAN when you dont answer the phone. Not happy about this.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "103069577720190522503", "name": "Sir Thomas", "time": 1590135636411, "rating": 1.0, "text": "Only giving one star because it’s required. I’ve been going here for years and this place has turned into a crackhouse... Going to this doctor  office (regardless of which doctor you see) is like going to a new restaurant on opening day, expect complete chaos and everything sucks!", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "111958753769950720421", "name": "James Gasque", "time": 1549921785816, "rating": 1.0, "text": "This office is completely unorganized. They never return my calls and never provide critical information to their patients. I'm absolutely amazed that they manage to retain any patients at all.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "109587629689485010391", "name": "Jaz N", "time": 1537360928386, "rating": 1.0, "text": "Staff doesn't LISTEN, they're RUDE, AND YOU WAIT FOR HOURS To see a Dr who barely listens to you for 5 min. I've called 3 times about a referral.\nWhile I was waiting for my second appointment the front staff stopped doing ALL work to ARGUE with each other about why paperwork isn't done.\nI've been to two appointments where both times Dr L has sent in a referral to me. I've been back to the Dr twice and the incompetent staff hasn't helped me. I'm in pain and the dr honestly doesn't know what this is. None of the medicine has helped.\n\nUPDATE: This post is from 3 days ago. I called TWICE yesterday about the same referral. I was told I would get a call back, apparently my referral was transferred to a different Dr in their office. Still no call back; I called back again to get the voicemail.\nISO new primary care physician", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "102884388518529234563", "name": "Jessica Jones", "time": 1534351133345, "rating": 1.0, "text": "Its sad when the people at the front desk are very rude and are too worried about partying after work. I had to get a school excuse (so my sister could go back to school that day) for my sister and she wouldn't give us one and made us wait for 15 minutes for a peice of paper. The people in the back were amazing they were kind and generous.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "111130642594484100669", "name": "Christina Roberson", "time": 1548256226889, "rating": 1.0, "text": "My mother goes to this practice and her Dr is awesome, but the office part is unorganized, rude, and plain unprofessional. It makes you wonder how in the world the people at the front desk even got their degree or if they are educated. It is a nightmare to try to get a refill on a medication. It's impossible. The only way to get them is when you actually see the doctor.. if you forget to get a refill when you see the doctor well your screwed until the next month basically. We live about a hour away from there so we can not just go by there everyday trying to get one refill. Today I called about a refill and have been trying to get this refill now for over a week and eventually instead of helping me they hung up on me. I just am beyond aggravated. My mom really likes her dr and his nurse is so sweet, but it's getting to the point that I'm seriously considering finding her another doctor bc of the fact everything about the front desk is just so unprofessional. When we gofor my mother's appt I'm going to complain about this and try to get a number that is a direct line to my mom's Dr or his nurse. I advise anyone who's thinking about coming to this practice to find another Dr office. It you are a new patient it's not worth the hassle", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "107326868649932568881", "name": "Felicia Wise", "time": 1538772357481, "rating": 5.0, "text": "Great staff, great  doctor, they really listen to you and take all precautions and does test on site!", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "103016053229321494555", "name": "robert foshee", "time": 1523375143885, "rating": 5.0, "text": "Dr. Ridgeway is the best at patient care.. he listens and lets you talk and doesn't cut you off!!", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "100631005084516420247", "name": "David Little", "time": 1537025158948, "rating": 1.0, "text": "Your gonna spend at least 4 hours to see a doctor for 5 minutes  I quit going I got tired of going up there and they couldn't give me a answers for any problem I was having. All they care about is when you coming back to pay them some more money again at Shoals Primary Care", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "111280215740965424332", "name": "Janice Nix", "time": 1533215927980, "rating": 5.0, "text": "They are professional, and have patience. They really work with you to get your health in order.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "109019602584384627981", "name": "K", "time": 1540326855390, "rating": 1.0, "text": "At 19 years old I became a patient of Brad Ginevan MD. After my current pediatrician, Dr. Rivas, advised it was time to transition to an adult provider. During the time he was my provider, Dr. Ginevan worked alongside my psychiatrist to continue maintenance of my ADHD and when necessary, he worked with specialists to manage my delicate GI condition. This included references to appropriate clinics and scheduling of applicable tests ie. Colonoscopy, EGD, etc. I truly trusted Dr. Ginevan and was incredibly grateful to have found such a wonderful physician. I never minded the fact that his office was always moving locations or that his appointments had become a nightmare to secure. I still referred only my closest of friends and family to see him. Always assuring them they'd be nothing less than satisfied with him as they're provider. Those were the old days... in 2013 I moved away to live on base with my then husband. I moved back in 2015 and returned to Dr. Ginevan. He and his staff had undergone a complete restructuring as they were now a part of the mega-merger trend and had merged with the tri-cities health giant Shoals Primary Care LLC. Due to the merger Dr. Ginevan no longer had any of my previous medical records from all of my time spent under his care which led to massive complications to my continuity of care. (I now understand the importance of my responsibility to secure medical history documentation and maintain my own current updated personal medical record.) Also, SADLY, due to the implementation of a governmental-esque standard of operating procedures, it is my opinion that Dr. Ginevan no longer maintained the level of patient care he had became known for. His office staff has always been grade-A; to be commended. If you are considering seeing Dr. Ginevan as your primary care provider this review is for you. In closing I want to say that this review in no way, intends to slander or cause malice. This review is my personal experiential reference/opinions of Dr. Ginevan meant solely for the purpose of socially informing fellow peers.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "104080606330066005909", "name": "Shelby Stanford", "time": 1557410283865, "rating": 4.0, "text": "Most of the staff is nice but they are very unorganized. Too many hands touching paperwork", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "106035591487861892757", "name": "Dawn Wheeler", "time": 1531447642051, "rating": 5.0, "text": "Dr. Karr is a wonderful doctor,  he sure cares about his patients,  I would highly recommend Dr. Karr!", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "104317065951220220483", "name": "Renae Miller", "time": 1485673535615, "rating": 5.0, "text": "Myself and my family of 4 have been using Dr Syed for 15 years...I cannot say enough of good things about him. He is very professional, courteous, and extremely intelligent, most of all, he is thorough . DR SYED  will perform tests needed to evaluate your concerns .In my opinion, he IS the best", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "107134982158800639684", "name": "Kimberly Heupel", "time": 1513021639389, "rating": 5.0, "text": "I have seen many Drs from all over and these Drs has done a complete work up on me I am at Dr now and shoals primary Care has all the Drs you could need in this building I'm very pleased with them and they have their own machines here so you don't have to go to the hospital for any kind of scans  I give them 5 stars", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "115213249032167281771", "name": "Diamond Love", "time": 1548468672058, "rating": 5.0, "text": "Dr Karr is a wonderful doctor.  He really cares about his patients well being.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "114878707028998946507", "name": "Em Means", "time": 1481038932635, "rating": 1.0, "text": "I had planned to start seeing Dr. Martin as a new patient after my husband's first visit (where they had down on his chart that he was a 60 year old female with impacted bowls). I ignored that fact and still decided to give the doctor the benefit of the doubt because I could understand things sometimes happen. However, upon my scheduled visit as a first time patient it was for 7:30 am, and I arrived at 7:15 am for new patient paper work. I signed in and no one even showed up at the front desk until my appointment time, where I  then asked for my paper work and filled it out. About ten minutes after that, another woman called me by the wrong name and when I corrected her, I was made to feel as if I had done something wrong. Also, you can not hear when you are being called because the TV is loud, so people are talking over the TV, and I have two ear infections. After filling out my paper work, I was then called back to the window, where I was asked to write down my SSN, but I had already written it down twice on the form already. This told me they obviously were not paying attention to the information they were entering. After this, and already feeling on edge from just the front desk experience, I am called back by the doctor's nurse practitioner who tells me to step on the scale, and with a horrible tone says, \"you're going to have to take some of that off.\" Meaning my purse. I ask where I should put it in case of a designated area, which seem to make her even more annoyed and she replies with, \"I don't know.\" Very snappy. I am a new patient and felt like I was asking a very simple and non offensive question. We then walk to the exam room where she informs me that I would not be seeing the doctor and that he also would never been doing my exams or ever seeing me other than a quick peek in the room. Which, as someone looking for a long term doctor, it does not feel comfortable not even meeting my doctor on the first visit. When I tried to explain that I was uncomfortable with the fact she would only be relaying my issues to the doctor, and that I didn't feel comfortable having my health looked after in third person, and that I didnt understand why they wouldn't tell a new patient to begin with when making an appointment that he or she won't be seeing a doctor. She then got upset about it and told me I could reschedule or abort because she had been doing this for 40 years. Which is fine and I explained to her I was fine with her seeing me, but that I didn't feel comfortable having a doctor diagnose me without speaking with me and knowing me as a person. She gets more upset and I said I think it would be best just to cancel because at that point, being someone who has been diagnosed with a generalized anxiety disorder, I was overwhelmed and ready to go home. She proceeded to then say to me, \"Fine then. Adios.\" I feel as if the entire situation was unprofessional on many different levels. I decided to keep searching for a new doctor. I would not advise this practice if you want to get to know your doctor for long term use, or have anxiety issues, seeing as how it is the only doctor's office I have ever been in where the lobby is loud and over packed.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "110371551383680749986", "name": "Shamea C", "time": 1515702381593, "rating": 4.0, "text": "I really like Dr. Ridgeway alot, I've been seeing him for over 5 years. He is an excellent pulmonologist, but his front desk ladies are really very rude..", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "115263242661839078727", "name": "Martin Painter", "time": 1521306437947, "rating": 5.0, "text": "Dr. Karr is the best doctor I’ve ever been with!!!", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "105446497573578478118", "name": "Samantha Smith", "time": 1502547003724, "rating": 1.0, "text": "Well where do I start.... First I guess I could start off with the fact the receptionist are very rude. Next I am being seen by Dr Aaron karr aka his assistant for a blood clot in my liver. So as I'm being processed for my visit the nurse asks me.\" Ma'am which side is your blood clot on\".........eeerrrmmm. unless I have 2 livers it is on my right side. I over looked that. NEXT , I go in for my inr check and my levels are still below standard so he send me to Hellen Keller to do bloodwork and says he will call with the results. No call..... Instead I call up there later in the day and she says you need to come pick up you medicine. So I go get it they have switched my medicine with no telling me no nothing I am a breastfeeding mother. He switched me to a medicine that I cannot breastfeed on without any consultation. I had to Google the risks and side effects. Totally unprofessional and a headache. I will be switching doctors asap!", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "108606958478100355564", "name": "Jennifer Sandy", "time": 1522087823410, "rating": 5.0, "text": "This is where I work.  Busy place, but doctors really care about their patients.", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "115477457793417811960", "name": "Jennifer Faulkner", "time": 1557932894226, "rating": 3.0, "text": "Waiting time long", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "102323802056524471967", "name": "Jason Smallwood", "time": 1472660683290, "rating": 5.0, "text": "Dr Ridgeway is a good doctor", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "116829081749796029101", "name": "Trisha Dean", "time": 1501630733391, "rating": 1.0, "text": "Sat in the waiting room for an hour then was moved to a tiny hallway for another 30 this is my Dr office and it sucks whole experience was terrible", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "103888040698123575761", "name": "Tina Peden", "time": 1563805364614, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "111485551286306206236", "name": "Janet Jones", "time": 1522941971045, "rating": 5.0, "text": "Prompt, friendly, full-service care", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "101896193770956915581", "name": "Jerry Boykin", "time": 1543262748476, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x887d48b48019956d:0x80858f3d5bf2d029"}
{"user_id": "112869223679445738983", "name": "Sean O'Donohue", "time": 1621115916783, "rating": 5.0, "text": "Recently had my first visit there with Dr. Yoe. Everyone was professional and friendly and make you comfortable right away. Great first experience I'll be going back soon", "pics": null, "resp": null, "gmap_id": "0x88890e766c126cf9:0xed7938bc8f97c6ac"}
{"user_id": "109122937254407133347", "name": "taj101276", "time": 1567517932692, "rating": 1.0, "text": "I am extremely disappointed with this place. I have nothing but problems here. 1st They tell me they have faxed my request for an ablation procedure. It could take up top 2 months to get approval. After 6 weeks I call my insurance company to find out that they faxed the request to the wrong telephone number. They called me a few days before my procedure and told me they were going to call me in a Rx to take before my subscription. They never called it in and now I'm waiting for them to call it in. I pray to God they do not amputate my leg. I have been severely disappointed with this place. I would suggest you go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x88890e766c126cf9:0xed7938bc8f97c6ac"}
{"user_id": "113221906543511629556", "name": "Cinthia Zavala", "time": 1583163657206, "rating": 1.0, "text": "My mother was given post op instructions to not be sitting or standing for prolonged periods of time. Five days a week she stands in one place for her eight hour shift. They refused to call that a restriction so my mother had no excuse at work for those restrictions/instructions to get up and move more frequently. Then when I asked them for those new instructions in writing they refused as well. I'm assuming it's because they don't want to get sued if there is a post op complication. The receptionist is extremely rude and condescending.", "pics": null, "resp": null, "gmap_id": "0x88890e766c126cf9:0xed7938bc8f97c6ac"}
{"user_id": "101527737378378437573", "name": "James Schilling", "time": 1615561386259, "rating": 4.0, "text": "Very professional staff and Doctors", "pics": null, "resp": null, "gmap_id": "0x88890e766c126cf9:0xed7938bc8f97c6ac"}
{"user_id": "115438650784314912398", "name": "Tonia Black", "time": 1554324574127, "rating": 1.0, "text": "It's hard enough to have problems and have to see the dr. It's even worse when they have a receptionist that thinks she is better than you and basically calls you a liar about your appointment time. I had proof as well. My time is just as valuable. So since I don't play those games I left. You should not have to deal with rude employees!", "pics": null, "resp": null, "gmap_id": "0x88890e766c126cf9:0xed7938bc8f97c6ac"}
{"user_id": "103803094113869356567", "name": "M Little", "time": 1454085479638, "rating": 1.0, "text": "I normally do not complain however, I do feel as though I was taken advance of and that Birmingham Vein Center,  Address: 100 Pilot Medical Dr Suite 185, Birmingham, AL 35235 did knowingly made false claims to me the patient!\nOn advice of my regular Doctor he wanted me to have a check up with a heart Doctor since 7 years ago I had open heart surgery and a heart attack.  He recommended Birmingham Heart Clinic- 100 Pilot Medical Center Drive and made an appointment for me. On first impressions I showed up on time and paid by copay and sat down.. I was about 15 minutes early so as with most Doctors I expected a wait.  Well within a few minutes they called me back.  Very impressed that they would actually keep on time with my appointment.. After screening the Doctor wanted to do a stress test and a few more test on my heart and leg veins since I had also had blood clots.. I agreed to these procedures and have no problem with that service.  After the test the Nurse said the Doctor would call in a few days with the results.  Well after two weeks I contacted the Doctors office several time and finally received a call back that everything was good that the Doctor had been on vacation.\nIn a few months I heard from the Doctor’s office again wanting to schedule an endovenous vein treatment procedure and they had cleared it finally with my insurance company.  This is really when the problem started:  The first treatment was scheduled for August 28 and at the time of scheduling I asked several times throughout the phone call what my out of pocket cost would be.. I was told by the lady and I hate I did not get her name that the procedure was being covered completely by my insurance that I would not have to pay anything.. $0.00!!! Well I went more into that with her she said it was “preventive” so I would not have any cost involved.  WELL that’s where I should have got that statement in writing.. Cause that was totally a LIE!\nAfter having two procedures with really no noticeable results.. But I was optimistic that that would help with my legs..\nEverything good until I called in December and was planning on making a payment only to find out the bill was upward $3,200.00.. We I was not prepared for that.. I told Lexi the lady in billing this story.  She said she would call me back the next day which should have been December 16th.. I finally got a call December 18th that she was working on this and would contact me back on Monday with her finding..\nChristmas came and went; New Year’s come and went… Finally January 28th I received a call (voice message at work) that she had been trying to reach me.. Yeah right!   In which I called her right back.  She proceeded to tell me that no one there would say such a thing that they did not know what my insurance would pay or not pay.. Keep in mind for two months the Doctor’s office kept submitting to my insurance company request to do the surgery and was the one who received the approval from the insurance company.. I asked who set up the surgery in the first place but of course Lexi said they have not record of that..  YEAH RIGHT!  She proceeded to tell me I would have to pay the $3,216.37. I have asked for copies of my complete file and all bills related to me.\nPOINT IS!  THINK long and hard and get in writing if you ever us Birmingham Heart and Vein Center cause what they say is not what they do!\nI am totally convinced this is how they make their extra money by saying one thing and doing another.  Lexi even had the nerve to tell me I would be charged late fees for not paying.. Think I will send Lexi a late bill myself since it only took her 42 days to get back in touch with me about this bill.\nI am hear by disputing these charges of $2,741.10 and any past due expense added to my bill!", "pics": null, "resp": null, "gmap_id": "0x88890e766c126cf9:0xed7938bc8f97c6ac"}
{"user_id": "113283487222574807945", "name": "DJ McCurdy", "time": 1622996874744, "rating": 5.0, "text": "I see and trust Dr. Brock.  Everyone I interact with is professional and courteous. People need to realize that not all are associated with CVA. There are a number of people that work for the hospital.  However I have found them to be as pleasant and helpful as anyone as well. Overall I look forward to going.  My wife is also a patient there so we get twice the opportunity for issues. We both rate the  whole building a 5.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "118375455175628113814", "name": "anna cash", "time": 1619638686886, "rating": 1.0, "text": "Rushed appointment. I wasn't able to get an echo or blood work because everyone was gone! The nurse wrote my information on a scrap sheet of paper & didn't chart any of it because the nurse that called me a month later was completely lost. My follow up was a phone call to read the results of my heart monitor and I was charged $200! Good luck contacting a nurse or Dr if needed!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101549910565275826199", "name": "Amy L", "time": 1621002605551, "rating": 2.0, "text": "Visit from start to finish took 2.5 hours but about 2 of those hours were spent in the waiting room. From the moment I entered, the lady at the front did not look like she wanted to be there. The dr also did not seem happy either. The explanations were not clear on directions of where to go next and why tests were needed. The most concerning part of the visit was when the phlebotomist touched his ungloved hand on my disinfected arm before drawing blood. The visit overall gave me a lot of anxiety, and I did not feel cared for.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "106134809977551938340", "name": "Beverly Lang", "time": 1615929687862, "rating": 5.0, "text": "Great place with lots of on-site testing. Also, some of the best and nicest doctors and nurses around.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108312171408582698612", "name": "Jacqueline Moore", "time": 1617414921411, "rating": 1.0, "text": "My husband had a stent procedure March 24th. After coming home the next day, he was having some discomfort. He called the CVA office ( off of 280: Colonnade Parkway) 3/26 around 10:20 a.m. He asked the receptionist to have Dr. Sample’s nurse to call him. His wrist ( which was the first place they tried to place his stent) was in pain and a knot had come up on his wrist. The nurse never called that day. He called again Tuesday, 3/30. After several tries, he finally talked to the nurse. Today, 4/2, he called and asked the receptionist to have the nurse to call him because his legs were cramping. He is concerned that he is having a reaction to the medicine that Dr. Sample prescribed. No nurse called him back today. The receptionist told him that it may take 48 hours for someone (nurse or doctor) to call him back. What does the patient do in this situation? It seems that CVA is not able to take of the patients after perform a procedure on them. We need advice and help from management from this facility. Overall, the main problem is getting a nurse to call my husband to help him.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101630989715529551258", "name": "Alan Creighton", "time": 1605621741568, "rating": 5.0, "text": "Dr. Eagan has taken great care of my mother and father over the last ten years.  His knowledge and professionalism has been excellent.  He listens, is considerate, answers our questions and guides us as we make decisions regarding our health care.  I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "107504376397896870087", "name": "Susan Bowen", "time": 1603161238958, "rating": 3.0, "text": "Usually visits are well organized with great heart doctors. Today they were OFF!  Wear mask in the building, ok that’s fine!  By the time we left, no one at desk to check us out, they had gone home. Thank goodness for the sweet custodial lady who found someone to help us.  Go to ask a clinical tech, a question pull my mask down, hatefully she says, PUT THAT MASK ON NOW!!!  OK, I also tell her as I walk off I don’t have the Corona.  She’s worried about me standing 6 feet away , asking 1 question. When you stop for temp check, they put O2 meter on your finger, but not ONCE DID THEY CLEAN IT,between the patients that came in after me.   Glad I went to bathroom and washed my hands after we were checked in.  But has excellent doctors!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108753487012815123477", "name": "Shelley Roman", "time": 1610455197783, "rating": 1.0, "text": "I had the worst service here with my mother. She was seeing Dr. Hasabnis and he basically scolded us saying she doesn’t need a heart specialist. She just needs a primary care doctor even though we got a referral. He was completely rude and had no bedside manners. I work with many doctors and have never been in such an uncomfortable situation. He is what is wrong with medical care and why many people are afraid to see the doctor. I am very disappointed in his attitude and unprofessional demeanor.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115683057307358191201", "name": "Randy Thompson", "time": 1603723081510, "rating": 1.0, "text": "Can't get results back in a timely manner. Nobody will answer phone when you call in. I was on hold 28 minutes. I plan to change Cardiologists in the near future. This place went down hill fast after Dr. Larry Dye and Kathy Black left...", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101029383626185417114", "name": "Patrick Hubbard", "time": 1603333064379, "rating": 5.0, "text": "Dr. Eagan at CVA is one of the most professional physicians I have ever met.  He cares deeply about his patients and is always available in times of concern.  Their office staff is professional and kind and their check-in system is efficient and quick.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "103287102929120738650", "name": "Ben Doerner", "time": 1612906223744, "rating": 5.0, "text": "Always strive to take great care of you.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "103336418023639429136", "name": "Olin Barnes", "time": 1606930234935, "rating": 5.0, "text": "Dr. Eagan and staff are excellent / attention to detail and follow up has been great CVA is very professional", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101975885138135310028", "name": "Michael Baygents", "time": 1591029314768, "rating": 5.0, "text": "This was my first appointment with CVA and my experience was outstanding. I anticipated having to wait for hours, but this was not the case. After a short wait, I was back with Dr. Percy Colon. I highly recommend him. He sits down with you and talks instead of some other places that make you feel like cattle being herded through. I needed to have a stress test done and he got me in to go ahead and be tested instead of having to come back. This helped because I live out of town. After taking the test, I was told I would probably hear from them the following week. Dr. Colon called me himself after hours to let me know my results were good. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "105838056695415213338", "name": "Elizabeth Hughes", "time": 1600704495005, "rating": 5.0, "text": "I had such a pleasant experience at CVA. The staff was very courteous and kind. From the moment I walked in, the process was very smooth and flowed well.  I was impressed on how well the office was laid out to follow the guidelines of social distancing and to protect the health of patients with COVID screening.\nI was seen by Dr. Eagan and was very impressed. He listened to everything that I had to say and was very knowledgeable. His bed-side manner was very calming. Nowadays doctor’s offices make you feel like a number but not here.  I will definitely recommend Cardiovascular Associates to family, friends and co-workers.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101826040518813815665", "name": "Paula Weaver", "time": 1601597246180, "rating": 5.0, "text": "I Love the CVA!  DR. M Honan saved my life in June 2012. I will give him praises tillI die!  The CVA clinic has a WONDERFULStaff.  MS.Kimberely, Wade, and every one else in the PT/INR clinic are very friendly and helpful.  I think the world of these ppl.  I wouldn't go any other place!  THank you Dr. Honan and all his staff!!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "117621744622284734853", "name": "tim sheppard", "time": 1572287515564, "rating": 1.0, "text": "Dr. White is excellent, but it's easier to get help from Comcast or the Government than contacting his office staff.  Somebody in management needs to lose their job over this level of complete incompetence.  I have now logged 117 minutes on hold for 3 calls to reschedule an appointment.  Simply not worth the hassle.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "110918087408271165373", "name": "Dianne Vetrano", "time": 1586545271792, "rating": 1.0, "text": "Love my Doctor but 3-4 hour wait to see him is not acceptable. I am always on time and expect the same\nCourtesy. I don’t blame the Doctor, I don’t know what the problem is, but it needs to get resolved or I am changing  Docs.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "111780834000137149282", "name": "Mike Fortenberry", "time": 1576884031613, "rating": 5.0, "text": "I will miss Dr Jerry Chandler one of the greatest doctors I have ever known. Happy Retirement go enjoy life.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113741336156475873366", "name": "Miranda Maxam", "time": 1524494718008, "rating": 5.0, "text": "I have been seeing Dr. Brock for a few years now and he has always made me feel as though I was his only patient. He always takes his time during the appointment and explores all options and avenues when it comes to patient care. I would recommend Dr. Brock to anyone that will listen. He is kind and compassionate and I never feel like just a number. All of the nurses I have dealt with have been pleasant and the front desk is just fine as well. They handle a lot of patients so during the times that I have had to wait, it is completely understandable, although, I have never had to wait more than 15 minutes for my appointment. Truly great care with Dr. Brock.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "104602526253089849609", "name": "Pat Sparks", "time": 1566567585898, "rating": 2.0, "text": "Too bad the call staff doesn't match the wonderful physicians. It took a total of 12 minutes to make a follow up appointment and nearly 9 minutes of that was spent listening to the recording telling me how important we are to them. If you have an emergency, do not put your trust into waiting on someone who cares to answer your call. There seems to be something going on within this practice and it isn't the physicians.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "111610141790413084169", "name": "Ronnie Rivera", "time": 1585008144858, "rating": 5.0, "text": "Dr. White and all the staff are great. They are caring and provide the best care available.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "110158190993544093223", "name": "Mick Gurley", "time": 1586469227022, "rating": 3.0, "text": "Wait time is unbearable.  Sometimes 2.5-3 hours.  On one visit, I drove 45 miles for an apt. and just as I was pulling into the parking lot they called me and asked if I’d mind rescheduling.  I told her it was okay and could she call me the next day.  She promised she would.  I never heard back.  I’ve had at least 4 issues with this practice not calling/faxing a prescription in.  Starting tomorrow, I will have to start cutting a particular pill in half because my prescription was not called in... AFTER TWO PROMPTS.  I spoke with the office manager two days ago and was told it would be taken care of.  It wasn’t.  Caremark cancelled my order.  I have called twice today to speak with the office manager and the second time, I was told she’d call me back in 30 minutes.  It’s now been two hours.  I think I know now where the problem lies.  As much as I like Dr. Reeves,  I’ll be looking for a different, smaller practice.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115372503969871963362", "name": "Judy Rowe", "time": 1554500174394, "rating": 1.0, "text": "My husband, Joe Rowe, is a Patient of Dr. Harrison.  He had triple bypass surgery with aortic valve replacement two years ago.  On Wednesday night, 4/3/19, he experienced some of the classic symptoms of a heart attack. He became extremely dizzy, broke out in a sweat and was nauseated but did not have chest or arm pain. Our neighbor who is a doctor came over and assisted with this episode. He administered aspirin, one nitroglycerin, and checked Joe’s vital signs. Vital signs were good and we were advised to call CVA on Thursday morning, 4/4/2019, to tell a nurse or doctor about this event and see if we needed to see the doctor. I called and spoke with a nurse around 9:45 am on Thursday, 4/4, giving her all details and also telling her that we were waiting on the results of a chest X-ray and cardiac PET scan which Joe had done the week before. She was going to try and obtain the results of these tests.  I also requested that she inform Dr. Harrison of Joe’s experience. She promised to call me back on Thursday afternoon whether she got the test results or not. As of 4pm today, we have not heard from the nurse or a doctor. We are extremely disappointed and upset that we have received no response. This is just wrong on all levels. Thank God that Joe has not experienced any of those symptoms again.\n\nWe are now debating whether to look for another doctor. We have always trusted Dr. Harrison and felt very comfortable under his care. Perhaps he was not even told about this event. We don’t know. We only know that the nurse we spoke with or a doctor should have called us back.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "114787721503119768006", "name": "John Gasser", "time": 1553790487330, "rating": 1.0, "text": "I called to make an appointment after being on hold for 30 minutes I gave up. If they won't answer their phone it makes one wonder if they really care and respect their patients. Find a cardiologist who is responsive. I know NOTHING about the level of care provided all I know for sure is that the group does not respect the time of potential patients.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "105050920928514561219", "name": "Jennifer Varnell", "time": 1572294116550, "rating": 5.0, "text": "Each time I visit I am impressed by the organization of the office flow!  I love my CVA doctor!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "114997819875047416262", "name": "Russell Glasgow", "time": 1565310106100, "rating": 1.0, "text": "As long as you can be seen in an outlying office your experience is tolerable   If you have anything done at the Colonade office you need to bring War and Peace, Gone With The Wind or just be prepared to memorize the entire Old Testament.   There is NO regard given to an appointment time for rudimentary procedures. My appointment was at 1:15 for an echo cardio gram. I was taken to s room after waiting  an hour and forty five minutes.   This is ludicrous.  The extent was I apologize we are running a little behind. Today’s visit would cause me to change doctors completely if I were not highly satisfied with my cardiologist and his staff.  Animals are treated better at the emergency veterinary office. I am completely disgusted with my service today.  Once I finally was taken to a room my procedure was fine and the person administering the Echo was great. It is obvious as a professional that quality is not part of this clinics formula.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "118431725566354415638", "name": "Lynn O", "time": 1543592122259, "rating": 2.0, "text": "Went for an ECHO, it took over an hour just to register. When you arrive they give you one of the restaurant pagers, it never went off.  You'd think as much money as Cardiologist make they could make their office support staff more efficient.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "112332502550330987044", "name": "Barry Sadler", "time": 1557416860522, "rating": 1.0, "text": "Dr. White was great but staff, front office and call service are terrible. I was told they requested insurance clearance to do some test prior to seeing my surgeon for an an operation. Testing lab never called so I called back and was told the insurance had not cleared so I called the insurance company 3 days later and was told the doctor's office never requested clearance. Every time you call the answering service it takes a minimum of 20 minutes of waiting and so far nothing good has come of it. Still waiting.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115803221247399190906", "name": "Julia Anderson", "time": 1537447352298, "rating": 5.0, "text": "Great experience.  Dr.Hasabnis is a very great doctor with a good bedside manner as long as there are no problems, then out goes the bedside manner.\nHis nurse is very efficient.\nIf there is a problem Dr. H is on it.\nThe Heart Lab is very good and efficient.\nWait time for either place is not a  problem.\nI wouldn’t go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108184905634407474455", "name": "John W Gregory", "time": 1572299370760, "rating": 5.0, "text": "i have had 3 appointments this year for follow up for A Fib and BP. The experiences have all been positive (especially since I had a good review). Also, the staff was courteous and the time for the appointment was met in a timely fashion. Dr. Mirza was helpful with my questions and did not seem rushed. I am happy with CVA.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113167964217637188981", "name": "Amy Holliman", "time": 1563978520341, "rating": 1.0, "text": "Horrible experience!  The administration of this practice is terrible.  You WILL hold for at least 20-30 minutes every time you call and what they tell you can't be relied upon.  I even wrote a letter to the Practice Administrator and my physician and was completely ignored.  Chances are the letter was never opened and/or given to them!  Although my doctor was good, the challenges in scheduling appointments or speaking with anyone overrides that.  Find a practice that actually cares about the value of your time!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113587323484236328198", "name": "Jon McClaran", "time": 1573063062607, "rating": 5.0, "text": "I am forever grateful by the professional and compassionate care I have received at CVA. All the staff, Ms. Sanford, Dr. Macy Smith, and Dr. Steve Bakir, have made a huge impact on my health and quality of my life. Thank you's don't seem to be enough....but Thank You!!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "109396298527392103475", "name": "Nancy White", "time": 1570122872156, "rating": 1.0, "text": "Dr Bakir is the best but the administrative staff is a nightmare. Rude!!! You can never get anyone to call you back! I'm thinking of changing offices just because the staff is horrible.  I've been without meds for five days and they won't call my pharmacist back", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113249181056227068147", "name": "Jerry Ross", "time": 1558383611180, "rating": 1.0, "text": "Had an appointment with Dr Reeves on May 6.    I was told by nurse, prior to seeing Dr Reeves, they had a new computer system that was consuming everyone's time.     Finally, after over 2 hours of waiting, he came in.   There was a lot of confusion concerning my history during our visit.    I've only been seeing him 11+ years now.   When I got home and read the Visit Summary I had been given when leaving the appointment I see that I am in heart failure mode and we discussed all of the symptoms, restrictions, etc.  None of that is true, including heart failure, unless they've been holding back all of these years.    Tried to call and talk to someone 2 times in the last week about this and they still have not returned my calls.    They have a new patient portal and I tried numerous times to call and get help logging in so I could send a note.   Busy signal every time I called.    So, my choices are, 1) schedule another appointment with a 3 hour wait or 2) move on to another doctor.    Seriously considering the latter since it seems they have more patients than they can manage.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101865726400744335395", "name": "Berney Waite", "time": 1503714942196, "rating": 5.0, "text": "I was a patient of Dr. Morris for years and then Dr. Dye until he recently retired. I could not have entrusted my health to two better physicians. They were both very caring and reassuring and I always left with a lot of confidence. I never had to wait to the point that it bothered me. A great place.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "111738235995854795943", "name": "Jane Gray", "time": 1571954137448, "rating": 1.0, "text": "Used my cardio Dr before he jioned CVA. I was trying to make appt and called a dozen times over 2 weeks, morning and afternoon. No answer after holding for 10 -20 minutes. Called and went to Billing and by george they answered first try!\nWhen said I had been trying for 2 weeks to get appt - she said \" We have over 20 doctors we answer for\" .  Well I guess you don't need me then with that attitude!\nI will transfer to a Cardio doctor that can answer calls from his patients whenever they call!\nDr Jacobs, if you see this and think you can salvage your patient, you do have until end of November, that is if you care about your patients like you seemed to before, to contact me.\nJane Gray.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113484240525918468212", "name": "Debbie Betters", "time": 1552526600820, "rating": 5.0, "text": "Dr Eagan is amazing! My mom is 95 and he was very patient and kind. The reception area is\ngreat and staff was wonderful, except for a nurse (Julie). She was unprofessional, condescending, and argumentative.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108599218736400511760", "name": "Brenda “B3” Third", "time": 1568053105924, "rating": 5.0, "text": "Smooth set up. My husband and I have seen several different Drs and CRNPs. He has been seening Dr Chandler since late 90's. Our extended family uses this group as well. Lots of experience using the group and we love  them. Not sure why others have had a negative experience. We highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "105274751762319201350", "name": "Alexandrea Nations", "time": 1565030816456, "rating": 1.0, "text": "Just wasted half of my day sitting at CVA. I was scheduled for a 9 a.m. appointment for my yearly check up with my cardiologist. After waiting almost an hour I had my EKG done and my blood pressure checked and was then asked to sit in the waiting room because my doctor didn't have a room available. I continued to wait until it was almost 12:30 and politely walked to the front desk and asked them to cancel my appointment because I had already waited 3 and a half hours and I had to go to work. This is the 2nd time I have had a significant wait time, the last being over 4 hours. The ladies at the front desk were extremely apologetic and asked who I was there to see. When I told them (Dr. Reeves), they suggested I find another doctor. I don't know if this is a doctor issue or a facility issue but I will not be back.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115017883558243728850", "name": "Karen Kaetz", "time": 1557242917592, "rating": 1.0, "text": "Dr Colon is great.  I am changing cardiologists  after many years due to the extreme challenges of working with the \"front office\"; extended hold times, dropped calls, lack of customer focus, no follow through.   The worst customer experience.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "104858680551413646704", "name": "Night Raider", "time": 1499417013484, "rating": 5.0, "text": "I'm very picky about who sees my mom especially since I've taken her to so many and same bad results with the long waits, cold and unfriendly atmosphere and the Dr. that acts like he or she don't want you to be there. This is the best facility with the best Dr. I've been to by far!\nEasy to find, easy parking and will help you out if you need help getting mom or dad out of your car.There is a very friendly young lady just inside the door that will come help you out, all you have to do is step inside and ask. We have never been there over an hour and a half and that says a lot compared to all the others (and there's been lots of others)  Very friendly associates and they don't treat you like a number like most places we've been. I give this place and the Dr. two thumbs up👍👍 and so does my mom.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "106338279409507688968", "name": "scot sharp", "time": 1568061532825, "rating": 1.0, "text": "This is the message I sent after seeing dr Brock for my elderly mother. They did not even respond.\n\ni just want your office to know how horrible my mother was treated when attempting to seek medical care from your office. on the recommendation of my aunt, who has been in the medical industry for over 40 yrs, we came in to see dr brock. he was not the kind and compassionate man your website describes. instead he was short rude and seemed as if he did not care at about my mother or her health. without test results back yet, he insisted that we come back the next day as if it were an emergency. when we got there, his nurse did not seem to know why we were there at all. when he entered the room, he was smacking on gum loudly like an adolescent child. he proceeded to tell us that he did not have all of the testing back yet but his recommendation was a pace maker, which shocked my mother. when she asked him to give her some more substantial reasons for why she needed the pace maker, his only repeating answer was bc that was his recommendation and if we did not like it, then he would be happy to get another doctor to see us. it came across as not only uncompassionate and unkind, but condescending. it appeared to us both that he was saying he wanted to put in a pacemaker and if we didn't want that then we knew where the door was. he was rude, unprofessional, uncompassionate, and quite frankly exhibited the characteristics of someone on drugs...the complete opposite of the man described on your website. treating patients in that manner is completely unacceptable! based on his reaction to our questions and refusal to give an answer and having not received her test results that would substantiate the need for such a device to be implanted i am of the opinion he gets a kick back of some sort for putting in so many pacemakers, which he bragged about to us during her appointment. i have never sat in a room with a doctor who refused to answer questions and was so dismissive to a patient because they had questions and concerns. i am disgusted with the lack of care for the patients well being that is more than obvious from your office staff and your doctors. i just feel like someone should be aware of the unprofessional manner in which dr brock conducted himself. i hope your organization addresses the things that happened to my mother there. i will be sending letters to the appropriate persons at the medical board as it is my opinion dr brock is not fit to treat patients either because he doesn't care about them or that he is on some kind of drug. completely unacceptable to treat an elderly woman in such a manner!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "118138161081206649550", "name": "Donna Vickery", "time": 1569650346854, "rating": 5.0, "text": "I called Cardiovascular Associates today to reschedule an appointment for my husband.  The call was handled promptly, and the CVA employee with whom I spoke was extraordinarily sweet and personable.  The call was so pleasant that I decided to share my experience.  I was shocked to discover some of the negative comments on the CVA website.\n\nMy family has trusted this group for years for healthcare needs, beginning with our parents and now my husband and me.  We have always been treated with the utmost courtesy and care.  In fact, a visit to CVA for us is like visiting a trusted family member.  This is a large practice which has garnered the respect of the community and a large following over the years.  On occasion, we may have had a short wait to speak to someone on the phone or to see the doctor; however, we would never even consider changing doctors because this is the most credentialed and caring group of professionals in the field.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "117814535303996969685", "name": "Stacie Lee", "time": 1559743967038, "rating": 2.0, "text": "I love Dr. Cavender. He is a very thorough physician and he makes sure to spend time with me each visit to listen to my concerns and allow me to ask questions.\n\nThe problems that I have with this is office is around their wait times - both in office and on the phone.  Yesterday I called and waited 30 minutes on the phone and never spoke to an actual person - finally hung up.  I called back at 2:30 pm and was able to get to a voicemail (still never talked to a person) but as of 9:00 am the following day I haven't heard back from anyone. In May, I called and waited 45 minutes on hold. Every time I have an appointment I have to plan to be in the office for at least 2.5 hours.  I spend, at a minimum, 1 hour in the waiting room every visit.\n\nI understand that doctor's offices are in business to make money as well, but when you apparently have so many patients that you can't answer the phone in under 30 minutes or return patient's calls there is a significant problem that needs to be addressed.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "118092190124723271133", "name": "Alex Muro", "time": 1542657456118, "rating": 1.0, "text": "The quality of patient care is extremely good. I rate my overall experience as one of the worst customer service experiences I've ever had.  Phone calls that ring and are never answered. Appointments that get moved without my consent, requiring another phone call that is never answered.  I even hand delivered a letter to them explaining to them my frustration with their phones--and I got a phone call back even though I told them I was unable to receive calls during normal work hours!!!  Not good for my blood pressure.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "117173592156780855915", "name": "Nila McBrier", "time": 1566259401733, "rating": 1.0, "text": "The most pathetic response ever!! Called because I have pneumonia and wanted to make sure none of the drugs interacted.  Said would tag it urgent, guess it's not!!  I will sue if they do, and am so disappointed!  Dr. Harrison, really?!?", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115021412741623846856", "name": "Kaitlyn DeBandi", "time": 1559834749293, "rating": 1.0, "text": "While I love my doctor, the staff is horrible. As a returning patient with a pacemaker, I called to schedule an appointment for a problem with my heart. After sitting on hold for 30 minutes I was told the earliest available was in 3 weeks, regardless of the issue. Then I was transferred to the nurse line. Waited on hold for an additional 30 minutes, no one ever picked up. The cycle repeated the following day with the nurse taking my number and saying she would call me back. No return phone call. When following up AGAIN the following day (3 days after the initial concern) I was told, \"Yes, i see that the message has been left for the nurse, they'll call you when they're able.\" I have seen more concern over patient/customer care when making a dentist appointment or nail appointment. If i performed the way CVA's staff does at my job, I would not have a job. The utter lack of concern over a 29 year old with a history of heart problems and a pacemaker is appalling. I suppose I'm supposed to be an alarmist and go to the emergency room because speaking my  doctor's nurse is clearly an impossibility. Whether the issue is that there are too many patients or not enough staff, CVA needs to resolve immediately because this is ridiculous. If anyone has any alternative cardiologist recommendations, please advise.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "109961547992360532406", "name": "Yvonne Robinson", "time": 1466802438570, "rating": 5.0, "text": "This was a great facility. Easy to get to and extremely clean. Every one greeted you with a smile and how can I help you. All the nurses were extremely nice and introduced themselves when they walked into the room. They all took time to listen to my mother and her issues. The doctor walked into the room with a smile,hand shake and introduced himself  to my mom, sister and me. For me this goes a long way. I appreciate the time they took for my mom. The waiting time was minimum also. I want to thank everyone for being polite and appreciate everything we learned today.. I will definitely recommend this facility to friends and family.❤️❤️❤️⭐️⭐️⭐️⭐️⭐️👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113794881117810877533", "name": "Billie Hamilton", "time": 1549557477134, "rating": 1.0, "text": "I received a call this morning from a nurse calling on behalf of Dr. David Cox. The nurse began to tell me to stop taking a cholesterol medication that was prescribed to me. The medication was actually prescribed to another patient with my name. I was at a lost for words. I asked the nurse did they not think to examine our charts carefully. The nurse spoke in a nonchalant tone and with absolutely no remorse for their mistakes. The nurse also stated that when I came in their office of January 2019 is when the mistake was made. I informed the nurse that I came in the office in June or July of 2018. Again, I am at complete lost of words. It has been 8 months since I was in the office. I began to explain to the nurse that a patient CANNOT just stop taking cholesterol medication once this medication has been in your system for a long period of time. Sudden stops of usage of medication such as cholesterol medicine can result in death. These people are playing with people's lives as if it is a game. Please pay attention to the medication you are being prescribed by doctor's and do your research before taking the medication. I thank the Lord Jesus Christ for keeping from seen and unseen danger.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "106662347383531767319", "name": "Thad Heinrich", "time": 1476849644508, "rating": 5.0, "text": "I'm  very  well   pleased with  my visit at age 31 I've  needed  serious  answers to serious problems. I've  found them  here. After 6years  of searching, my questions  we're given  answers  that  are leading  to treatment  and recovery. I pray  for the same  wisdom  to help  all.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101654837543773283756", "name": "JT Lane", "time": 1475241402542, "rating": 2.0, "text": "This place is a complete joke.  They do have some supposedly good doctors associated with the facility.  But trust me you are absolutely nothing but a number at this place.  On a blood test, for example, rather than the doctor or nurse call you with the results which would take them less than 3 minutes, they prefer to mail you the results.  When you complain about their lack of attention or follow-up, (when the letter doesn't come), you're told they don't have enough time to make a friendly call to you.\n\nBottom line, you're a number.  Who knows if the doctor actually looks at test results.  An appointment at the glamorous facility is fine.  But if you have to communicate outside the appointment, it's as if you're dealing with someone 2000 miles away.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "107796530471456761324", "name": "Chuck Robinson", "time": 1508772111626, "rating": 5.0, "text": "I am a retired dentist and my wife is a Nurse Practitioner. We both recognize excellence, when we are being treated. I would only allow Cardiovascular Associates to treat both my father and myself. There is a difference in CV care available to the Birmingham area patients. Should the need arise, any other family member will be directed to this fine and reasonable group of doctors. I especially want to give a Gold Standard recognition to Dr. Stephen Bakir and Dr. Himanshu Gupta. Theses great doctors would not be there if there were there not equally qualified other doctors at their clinics.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "107053069608728742171", "name": "Tom Mclemore", "time": 1545347998550, "rating": 5.0, "text": "Having read other reviews, I had to share that of all the other cardiologist associates in Birmingham. This group is the most caring and professional.\nI had an ablation to correct PVCs that were making my life miserable and almost unbearable.\nNever had a bad experience with a doctor, nurse, technician or staff. Having been to UAB and St. Vincent s CVA is the best.\nDr Macy Smith is not on great in his field but caring and professional.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "106073729165440510934", "name": "Jim Kidd", "time": 1539807276344, "rating": 5.0, "text": "Everyone up to and through the care I received was exceptionally attentive to detail and comfort.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108419150807824100038", "name": "Spencer", "time": 1528905510732, "rating": 2.0, "text": "The doctors and nurses and techs are nice and knowledgeable. However, every other person on the staff is miserable. Receptionists, appointment makers, billing people are all absolutely abhorrent. Having to deal with them is worse than dealing with the DMV. It’s a shame because it would be 5 star if they replaced their horrible staff. I have yet to interact with a single person that didn’t hate being there and hate having to deal with you as a patient. It’s terrible.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113373543737010211426", "name": "Marianne Nichols", "time": 1497301284936, "rating": 4.0, "text": "I do prefer the office at Brookwood Professional Building. Over at the colonnade they give you beepers so you know when it's your turn 😕 The employees have always been pleasant and efficient. I had another cardiologist whom I had been using for 10 years when she retired in 2014. She recommended the Dr. I see now with cva. I like him.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "107343274947645826415", "name": "John Camp", "time": 1550081743439, "rating": 1.0, "text": "Had my second stent placement a few weeks ago. Called the office Monday 2-11-19 with complications with meds and minor bleeding issues in the nose. Finally called me back 2-13-19 to follow up. My response, cancel my next appointment as I have already seen another Doctor and problems have been resolved. This place is a joke. #allheartsmatter.\n\nThey get one star for being open, that’s all.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101022454161432361289", "name": "Cheryl Johnson", "time": 1475794034767, "rating": 5.0, "text": "Wonderful Dr n person. Great bedside manner. I'd recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "118435750673051968104", "name": "Carol Campbell", "time": 1462548102461, "rating": 4.0, "text": "We too have had to wait for physicians in the past, but, Dr. Raburn and his colleagues are worth the wait.  After working for a cardiothoracic surgeon in the past, I guess my expectations regarding the patience of waiting to be seen by a valuable physician may vary somewhat from others, due to the fact, we are usually not aware of the urgent physical needs that YOUR PHYSICIAN may be attending to with another patient.  So, in all fairness, I feel that if we considered the needs of other patients, that may, at that time, require urgent assistance, we ourselves, would want and expect the same treatment.  If it's any consolation, we have had to wait 2 hours at some facilities to be seen by a physician.  Sometimes, you may have to wait for the best!  Warmest regards!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113534862665789802477", "name": "Mark K", "time": 1553102041417, "rating": 1.0, "text": "I've been on hold for almost 30 minutes just trying to get one of my prescriptions refilled.  The recording said have the pharmacy call to request a refill but my pharmacy said my dr. doesn't allow fax requests.  Again, I haven't spoken to one person, I'm afraid when someone does come on the line and I tell them I just need a refill they are going to place me on hold again so I can speak to nurse.  Nobody should be on hold for more than 15 minutes.  Not good.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "100489425556377783279", "name": "Darlina Bray", "time": 1537893066373, "rating": 1.0, "text": "Make sure that you check with your insurance company  before you agree to allow any testing from this physician office.  We had tests ran at this office and the Dr. (who was in our insurance network) sent the tests for reading to an Illinois company that was not in our insurance network and now we are stuck with the bill.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "117268663517247359593", "name": "Larry Roberts (Pastor)", "time": 1497023287078, "rating": 4.0, "text": "Doctors are excellent (especially Dr. Cavender), however, this place has experienced growing pains.  The organization and working procedures have not kept up with the increase in patients.  The place is a mess to get around in. The people know who you are: patient #12345. No caring  or concern for you in the front lobby area at all.  Still it could be worse: The lack of care in the front could leak to the back!", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108211758764974813401", "name": "Ramarao Chodavarapu", "time": 1539724181452, "rating": 5.0, "text": "Great doctors. Great technicians. Great experience.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "104522747831660993712", "name": "Rodney Gilbert", "time": 1522676475502, "rating": 5.0, "text": "Dr Macy Smith is marvelous..!!! Corrected my atrial fibrillation with a cardiac ablation and my wife’s irregular heartbeat with a pacemaker...excellent bedside manner and patient follow up. Wonderful physician...Highly recommended!!!\nCVA check in procedures need modernization ...and computer programs require  updating allowing info sharing with Brookwood Hospitql for testing..imagining .Too much repeating of same data  from visit to visit ??", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "107583969272055607811", "name": "Jan Hall", "time": 1511302769091, "rating": 1.0, "text": "Medicine like a fast food restaurant. Walk in and receive a pager that blinks and buzzes to go pay. Wait to go to another waiting area. Many doctors, one phone line, must get transferred a couple of times just to leave a message. Appointments cancelled by email and rescheduled for 3 weeks later in the middle of a potentially lethal condition requiring surgical intervention. I never felt like a person there. I wasn't put on the standard treatment for my condition. The only decent advice I was given was to travel for surgery. I'm seeing a UAB doctor now.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "108477129594882509284", "name": "Kari Osborne", "time": 1509303996875, "rating": 5.0, "text": "Great doctors that work together to give patients the best care possible.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "116324746044341142441", "name": "D1RoyalBama", "time": 1518708718443, "rating": 5.0, "text": "Dr. Harrison is a great cardiologist and recommend him to anyone, with heart issues.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "109263579603055842408", "name": "Tammy Byess", "time": 1474561508209, "rating": 5.0, "text": "I have seen Dr Eagan & Dr Rayburn for cardiomyopathy for over 15yrs. Great facility with easy parking & everything under one roof.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "105686242934005755647", "name": "David Atkins", "time": 1512313952565, "rating": 3.0, "text": "Dr. Rao was very professional and seemed quite knowledgeable.  However, when I phoned back a couple of days later with some questions\nand was told that they would be given to the Dr. and someone would call me back, I never heard from anyone. Disappointed about this.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113383093347025004426", "name": "Mary Jane Casey", "time": 1475163920893, "rating": 5.0, "text": "Love the associate with the wonderful doctor and the,nurses are very pleasant with courtesy", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "101421321187241993315", "name": "JAMES B", "time": 1517884680239, "rating": 1.0, "text": "Inexcusable delays in trying to get responses from doctor's nurse - either through phone or their patient portal. Have waited days to get answers to critical questions. Maybe too many patients?", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "104300791877271943210", "name": "May Ali", "time": 1546531897485, "rating": 1.0, "text": "Waited for 2 hours they were about to close and the doctor did not show up !! Left without seeing him never called or apologized very very rude no respect for patient time what so ever", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115117948445775108518", "name": "Shelia Akin", "time": 1521032338410, "rating": 1.0, "text": "Dr.Cox has a very bad bed side manner.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "113307418571714585760", "name": "Anthony Thorn", "time": 1506651975271, "rating": 1.0, "text": "Incompetence on all levels of post appointment management trust McDonald's more than I do these folks with my wife's care.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "105443979140445012669", "name": "Aerial Johnson", "time": 1461601138110, "rating": 1.0, "text": "Wait time to see the doctor is ridiculous.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "106715910565536684072", "name": "Jack Trawick", "time": 1372683783865, "rating": 3.0, "text": "The check in process sucked. Appt was at 0730 arrived at 0715. Didn't start check in until 0800. Meanwhile there four clerks sat around chatting about the weekend.", "pics": null, "resp": null, "gmap_id": "0x888917833a399d01:0x99bec420c6dacb93"}
{"user_id": "115524215039448349591", "name": "Linda Hames", "time": 1601337391612, "rating": 5.0, "text": "Dr. Katta has been my doctor for 23 years. He is a very compassionate, highly educated and experienced Cardiologist. He has saved my life a lot, in my opinion he is the best Cardiologist, I wouldn't see anyone else. He has a large waiting room and sign-in desk. His staff are friendly and helpful. He has the capability to run most all test at his office. The office temperature is lower than regular doctor offices, due to the health of his heart patience needs. Also if you let the staff know you are cold they'll get you a warm blanket. I would and do recommend Dr. Katta to anyone who needs his services.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-wTIhvhzFosAvlOUYwYCA7kvXE0UNAeiq7VI-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-0K04YMsbpZIgmve1vGRC17Aonueg-hf4D4Xk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "118010469691881642835", "name": "Hugh Callahan", "time": 1604590621864, "rating": 1.0, "text": "I wouldn't take my pet to this practice. Some members of his staff are extremely rude. Additionally, he doesn't review records and contact patient with treatment plans. I have had a resting heart rate over 100 beats per minute for 5 weeks, and he hasn't resolved the issue. He relies on his staff too much in that he allows them to review records and change medications, all apparently without his review. He was to have called me last night, he never did. In my opinion, as the son of a physician, he lacks professionalism. I would seek another caregiver if I were you.", "pics": null, "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "117962863882766368026", "name": "Teresa Christian", "time": 1579734278185, "rating": 1.0, "text": "Zero bedside manner. I was practically in tears. Dismissed my symptoms even though I was admitted overnight in the hospital. He wants my neurologist to prescribe medication he wants me to take (Doesn't want to take responsibility, perhaps??). I doubt he is used to taking younger patients. It's probably an easy in and out $$f factoryfor him for older people with simpler issues.", "pics": null, "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "103695586526591571854", "name": "Marvin Denenny", "time": 1560790987078, "rating": 5.0, "text": "Dr Katta has been my cardiologist for 14 years and he and his staff are the best in North Alabama. I believe I wouldn’t be alive today without him.", "pics": null, "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "114864455226478095541", "name": "Andris Bune", "time": 1537448420994, "rating": 5.0, "text": "Dr. Sadasiva is real expert in the field. Have excellent experience with his treatment.", "pics": null, "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "106145893365177701769", "name": "Kacie Marsh", "time": 1524771006674, "rating": 1.0, "text": "My experience today did not even deserve a one star rating. Dr. Katta was 3 hours late which could have been okay if he didn't fully dismiss all of my issues because he was in a rush. It was known at the ER two days ago that I was positive for pots,had an irregular heart beat and a small murmur. At 18 years old from sitting to standing alone my heart rate has gone from the 80's to 150's. You would think at MINIMUM he would want to see that and confirm or dismiss the theory of POTS.  Instead he said I had anxiety because I'm young when i have never experienced anything like this before. While at the ER i used a bed pan because they wouldn't even wheel me.. yet I felt Dr. Katta tried to make me feel like this was all in my head when tests at the ER say otherwise.  he won't tell me anything is wrong, and was about to send me home without one question concerning my symptom check list or test. His ASSISTANT suggested a heart monitor and even he gave a bit of an \" I'm sorry\" look. Dr. Katta's attitude was like fine. Since it was mentioned. Aweful. Would have sent me home without asking about my symptoms or doing one test. I don't even trust him to read my results or care just because I'm younger when cleary something is wrong. I had multiple \"yes'\" checked on the symptom chart from Siezure to chest pain, numbess to all sorts of more severe things and he didn't have one question for me. I will be cancelling my heart monitor with him and seeing someome that will make me feel cared for. Or who will at least not talk over me, rush and try to send me home. It is not my fault he was late. But the lack of care knowing my symptoms is very far beyond me and my mother. We have never had someone care so little with no interest to listen.", "pics": null, "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "103226078036585855457", "name": "Lakshmi Inguva", "time": 1608061869685, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x8862133a9e89ff6f:0x677ad15fc13edcdd"}
{"user_id": "103067280062003932732", "name": "Chad kiper", "time": 1614896606082, "rating": 5.0, "text": "Hands down the most friendly office I've visited. Dr. Lyons was great. His staff were super awesome? A+", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "114666535871615942799", "name": "Helen Nixon", "time": 1475587150006, "rating": 5.0, "text": "To be told you need to see a vascular surgeon is a scary thing, even for someone in the medical profession.  Dr Rose (as well as the other doctors I have interacted with as a RN) and her staff CTVSA were very kind and reassuring to my wife and myself. They made sure we understood what was happening and what the next step was to be. Dr Rose and Molly made things much easier for me.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO3RAhBX_2I7C2zKIj57mGmOqqd3a5qkSHTmc3W=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "108009525173876670185", "name": "Anil Vashi", "time": 1620676710872, "rating": 1.0, "text": "Beware about those hidden costs. Before my procedure i  did ask Dr Melanie Rose to get this procedure approved by my carrier without any surprise since i am on Medicare  and fixed income thus i got billed for another $195 needless to say ultrasound costs charged twice since the results were conflicting due to the outdated and unreliable equipment and also the pain associated with this. To supplement this the dressing broke loose before i got home due to the nurse incompetency. All my complaints left ignored by the staff in the meantime Mobile Infirmary is also to blame for this unacceptable behavior", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "114350199714594267479", "name": "Addie Brockly", "time": 1615233989935, "rating": 5.0, "text": "DR McGee saved my life no doubts about it. I thank God I was sent to him very perfectional and kind caring Doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "109259726657896942541", "name": "Ashley Fleming", "time": 1593121111840, "rating": 5.0, "text": "Dr. Daniel's performed absolutely fantastic on my  right pneumonectomy. The fact that I am still here 7 years later attest to the fact that he went far above his already high standards to preserve my life. I would very highly reccomend  him to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "108147189318488233761", "name": "Chuck Purcell", "time": 1582894915670, "rating": 2.0, "text": "Just make sure if he mentions lung cancer, Get A Second Opinion. It seems that not to many can tell the difference from lung cancer and pneumonia until you are missing a piece of your lung or all of it. I went from a supposed health issue to a real health issue since I now have been diagnosed with COPD since part of my lung was removed.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "112024404093509722998", "name": "Melinda Boggs", "time": 1606160690866, "rating": 5.0, "text": "I couldn't have asked for better care than what Dr. Johnson gave me. I'm alive today because of that man.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "107957238482742987977", "name": "teresa boggs", "time": 1471977313114, "rating": 1.0, "text": "This group has the absolute worst patient care I have ever experienced. They are slow and unresponsive. Surgery was adequate but patient care was nonexistent.", "pics": null, "resp": null, "gmap_id": "0x889a4e06a68bf3bb:0x3e6a609f70c4d881"}
{"user_id": "100905765522683135412", "name": "Susie Hartman", "time": 1623972384001, "rating": 5.0, "text": "The ladies at the desk were so friendly and helpful. The ladies who did the Nuclear Testing were tremendous. What do I say, Dr. Chris Brown is fantastic.\nHe eased my mind about everything about my heart.  I owe each one a debt of gratitude the way I was taken care of the entire time. Thank you for being so gracious with me. Glad I went to Mobile Heart Specialists. God Bless", "pics": null, "resp": null, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "114385305841759167122", "name": "Barbara Smith-Matthews", "time": 1623975324400, "rating": 5.0, "text": "The entire team was absolutely great; professionals and very efficient. My nurse was exceptional and Dr Bedwell was very thorough and answered the questions I presented.", "pics": null, "resp": null, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "114141971942813699160", "name": "shirley pierce", "time": 1618442263983, "rating": 5.0, "text": "From the inception of my arrival at mobile heart specialist facility I was received and graciously transported into my doctor's office. I am not ambulatory and because of the staff they're at the doctors office I was able to receive the finest of cardiology care.  Every individual who responded to my need for healthcare healthcare was the epitome of professionalism and grace. Combined with expedience and a comfortable atmosphere I could never ask for finer care anywhere.", "pics": null, "resp": {"time": 1618488143985, "text": "Thank you for your nice words."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "110511448698171957673", "name": "John Dyess", "time": 1620824771247, "rating": 5.0, "text": "I like how quick they got me back. Love how dr Deanandrade takes his time and answers all my questions. I never feel rushed and I feel like he really listens great job from front desk until I leave!", "pics": null, "resp": {"time": 1623180540121, "text": "Thank you for the positive feedback and review! We strive to provide exceptional care."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "101841108843795376335", "name": "Charles Simpson", "time": 1617935626167, "rating": 5.0, "text": "It was very good. I have been with this group for many years . I like Dr Brown. I was with Dr Meginson who was my father in law’s doctor.\nHis name was Dr Albert Dix. The staff was helpful and courteous.\nCharles Simpson", "pics": null, "resp": {"time": 1617986797387, "text": "Thank you for your feedback and positive review!"}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "114823163789968949795", "name": "Paresh Patel", "time": 1622472540428, "rating": 5.0, "text": "I been going to dr brown for the last 22 years no words to describe staff and dr brown\nWill recommend to anyone", "pics": null, "resp": {"time": 1622474832004, "text": "Thank you for these nice words."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "104292137012913295490", "name": "Keith McCall", "time": 1608092912698, "rating": 5.0, "text": "I like Mobile Heart Specialist, because every time I walk through the door I'm greeted by warm and friendly receptionist. The registration is easy and I've never waited long for my appointment with my Dr...\nDr. Brown has an Excellent bed side manner, He's friendly, Knowledgeable in His expertise and Always shoots from the hip and I appreciate that. Thank You So Much for taking such good care of me and my ❤️ Heart ❣️", "pics": null, "resp": {"time": 1608125550484, "text": "Thank you for your nice words. Have a Happy and Safe Holiday."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "105428832669120538897", "name": "Aqualyn K", "time": 1614224243496, "rating": 5.0, "text": "The staff is extremely attentive and very friendly. They are meticulous about being on time, and the quality of care has been excellent. Thank you!", "pics": null, "resp": {"time": 1613582127518, "text": "Thank you for your review. We strive to provide high quality care."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "114367503717458559469", "name": "Jane Fleming", "time": 1618938018985, "rating": 5.0, "text": "My tela-visit was easy, successful and\nI felt that my needs were spoken to,  Dr\nBedwell appears to be unhurried and very patient. He addresses all my concerns.", "pics": null, "resp": {"time": 1619450063387, "text": "We strive to provide excellent patient care. Thank you for your feedback and positive rating."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "113487930881294744847", "name": "Chris Berra", "time": 1613790870855, "rating": 5.0, "text": "Dr. Brown is very professional and has always been. He gives advice and explains why I need to follow what he says. He has a great bedside manner and my wife and I trust him implicitly to do what is best for me.", "pics": null, "resp": {"time": 1614002440342, "text": "Thank you for the feedback and positive review!"}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "108965259581831703200", "name": "Gesa Capers", "time": 1620782517204, "rating": 5.0, "text": "During my visit at Mobile Heart Specialists i was treated with outstanding professionalism from check-in to check-out.", "pics": null, "resp": {"time": 1620822962140, "text": "Thank you for the feedback and positive review!"}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "117659294474330099359", "name": "Robert D Reed", "time": 1620609980334, "rating": 5.0, "text": "Dr Brown always gives me the feeling that he does care about me and my health. But all the ladies in the office are as nice as they can be, even dealing with all the people that they have to deal with.", "pics": null, "resp": {"time": 1613945717546, "text": "Thank you so much for these nice words."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "105603839000032391395", "name": "J T B", "time": 1600907200233, "rating": 5.0, "text": "I cannot say enough good things about this practice and it’s staff. Dr. Chad Alford is truly an asset to medicine. His medical knowledge, thoughtfulness, concern, and overall patient care strategies show that he genuinely cares about his patients and what is best for them. I would recommend Dr. Alford and this practice to anyone.", "pics": null, "resp": {"time": 1611685970731, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "113254816829910364471", "name": "Carlton Wilson", "time": 1623551517524, "rating": 5.0, "text": "Everyone was courteous and friendly. Very good service. All areas were staffed with professional personnel who made you feel safe and secure.", "pics": null, "resp": {"time": 1611685637633, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "101318300060856854437", "name": "Cohen Holland", "time": 1594253877206, "rating": 5.0, "text": "We have been patients of Dr Alford for years. I had a nuclear stress test yesterday and it went very smoothly.  Robin and Tracy were  considerate and helpful in allowing me time to get on the table for X-ray scans.  Kudos to both of them! I would highly recommend Mobile Heart Specialist to anyone seeking cardiologists in and around Mobile.", "pics": null, "resp": {"time": 1611685963128, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "107067887771252752552", "name": "Edward Woodham", "time": 1604185465748, "rating": 5.0, "text": "Dr Bedwell is a fine doctor his staff is very friendly and helpful rate them a 10 star.", "pics": null, "resp": {"time": 1611685864385, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "110834707658638382265", "name": "Bill Phillips", "time": 1592626363172, "rating": 5.0, "text": "We love Dr. Chris Brown! He listens! And, he is very kind as well as being a great cardiologist.  We are so happy to have him as our doctor.\nDonna and Bill Phillips", "pics": null, "resp": {"time": 1592829439519, "text": "Thank you for the nice words."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "108813346723045992621", "name": "JD DMR", "time": 1601081104389, "rating": 5.0, "text": "Very caring and knowledgeable.  Staff is efficient and Dr Bedwell is knowledgeable and doesn't mind answering any questions you may have\nA ++", "pics": null, "resp": {"time": 1611685869106, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "106722651091821271332", "name": "Judith Hornady", "time": 1605976411445, "rating": 5.0, "text": "Dr. Noel Bedwell is a great cardiologist. I totally trust him.", "pics": null, "resp": {"time": 1611685656815, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "116662341057416693303", "name": "Jimmy Barnette", "time": 1593010429934, "rating": 5.0, "text": "First time on a phone visit but Dr Noel Bedwell was the ultimate professional he always has been. I love this man like a brother. He took care of my mom the same way. There's not a better heart surgeon in the world. I trust him with my life. Thank you Noel!", "pics": null, "resp": {"time": 1611685899790, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "110381784060016573059", "name": "Kim Rawson", "time": 1594857262960, "rating": 5.0, "text": "Received great care during cardiac tests from everyone!  Special thanks to Robin who called the day before and explained everything. She also met me there the next morning!", "pics": null, "resp": {"time": 1594902224564, "text": "We are glad you had a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "103701882184694770947", "name": "Brenda K.", "time": 1583774336009, "rating": 5.0, "text": "Dr. Bedwell is clearly one of the best doctors, as evidenced by his ratings.  He is very smart and has a great bedside manner.  Most importantly, I felt safe and relaxed in his care.  The nurse was also great—made me feel comfortable like I was talking to a friend...love that!", "pics": null, "resp": {"time": 1611685893137, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "103041382949226852466", "name": "Charles Cook", "time": 1610551679110, "rating": 5.0, "text": "Dr. Chad Alford is arguably the finest cardiologist in Mobile.  He truly has the patient's best interests at heart.  I heartily recommend him.  I might add that the office staff is highly efficient.  I have never encountered a long wait for my appointments.", "pics": null, "resp": {"time": 1611685649989, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "100646894847434440782", "name": "George Jenkins", "time": 1584583402619, "rating": 5.0, "text": "Top professional Doctors, technicians, nurses and clerical staff who treated me wonderfully. I have been under the care of Mobile Heart Specialists since 2011. I have received the best care and will recommend them to anyone.", "pics": null, "resp": {"time": 1611685948966, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "113004986926335585076", "name": "Michael Stodard", "time": 1594865526247, "rating": 5.0, "text": "great care / efficient staff / competent caring physicians\nI got an appointment for the day after I called / front office was excellent / no hassles.  Got all my concerns addressed.", "pics": null, "resp": {"time": 1611685875828, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "110986551193429575801", "name": "cindy janik", "time": 1616880294485, "rating": 5.0, "text": "Always a nice visit and no long wait", "pics": null, "resp": {"time": 1611685679459, "text": "Thank you for your review. We strive to provide high quality care."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "108416710200588146543", "name": "Debra Freeman", "time": 1593126635550, "rating": 5.0, "text": "Had the best dr.'s  Dr. DeAndre and Dr. Penaronda And All the nurses in ICU and some on the floor It was on all around they get 5 🌟.", "pics": null, "resp": {"time": 1611685880416, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "118279447184593994185", "name": "gcapers MississippiBeachBum", "time": 1596758088066, "rating": 5.0, "text": "Dr Bedwell and his staff were very friendly, professional, and efficient. I had zero wait time. Dr Bedwell and all members of his staff provided excellent services, explained all procedures, and answered all questions.  I highly recommend Dr Bedwell and Mobile Heart Specialists. .", "pics": null, "resp": {"time": 1611685967257, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "114889915790273022269", "name": "Jimmy Hunt", "time": 1603408584821, "rating": 5.0, "text": "Great place to go for any medical issues.", "pics": null, "resp": {"time": 1611685977394, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "115651643251249879281", "name": "Perry Enfinger", "time": 1617145641893, "rating": 5.0, "text": "A Dr you can trust", "pics": null, "resp": {"time": 1617289852473, "text": "We strive to provide high quality care. Thank you for the review!"}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "115237287023035740643", "name": "Bette Szafranski", "time": 1576944525607, "rating": 5.0, "text": "Never have to wait long.  Very professional, patient with people registering and signing in and excellent medical care.  Couldn't ask for more.", "pics": null, "resp": {"time": 1611685885741, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "117712492359478055588", "name": "thebackporchboys", "time": 1602891378015, "rating": 5.0, "text": "Always do a great job.", "pics": null, "resp": {"time": 1611685974259, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "104925798270995073892", "name": "Susan Manley", "time": 1590632744833, "rating": 5.0, "text": "Mobile Heart Specialist care and take the time to talk to you and find out why you have a problem and solve the problem. I would recommend them to anyone.", "pics": null, "resp": {"time": 1611685944695, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "116836911512966846754", "name": "Jimmy C", "time": 1590104852545, "rating": 5.0, "text": "These Drs. are top notch; so are the staff.", "pics": null, "resp": {"time": 1611685896255, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "113714714142926166887", "name": "Jacki Alvis", "time": 1583673451321, "rating": 5.0, "text": "No wait  tech. Was great. Took blood. Gave shot  mim. Pain. Very knowledge about study program.", "pics": null, "resp": {"time": 1611685952096, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "104756945291975855055", "name": "Tanya Byrd", "time": 1578100994391, "rating": 5.0, "text": "My Mom uses Mobile Heart Specialist and we couldn't be happier with the care we recieved!!! From the front desk to the testing staff to the nurses to the Dr's!!! They take excellent care of their patients!!!", "pics": null, "resp": {"time": 1611685955252, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "105432292183725891270", "name": "Ginna Chappell", "time": 1600563136649, "rating": 5.0, "text": "Excellant care", "pics": null, "resp": {"time": 1611685872316, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "105653887366005887991", "name": "Linda Hulsey", "time": 1574814341001, "rating": 5.0, "text": "Excellent service and care.", "pics": null, "resp": {"time": 1611685958613, "text": "Thank you for taking time out of your day to share those kind words. Our goal is to provide high quality care, so your feedback is appreciated."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "109714187440931182855", "name": "Shirley Nelson", "time": 1583304859084, "rating": 5.0, "text": "Experience great!", "pics": null, "resp": {"time": 1611685889465, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "109062648135582681240", "name": "Jim Schjott", "time": 1573796921323, "rating": 5.0, "text": "Very though, friendly and professional!", "pics": null, "resp": {"time": 1611685914152, "text": "Thank you for sharing your feedback! We strive to provide the best possible care to every patient, and we always enjoy reading about a good experience."}, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "117267066796784751659", "name": "Verona Ann", "time": 1624143994540, "rating": 5.0, "text": "Everyone was very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb28d5df20b1b:0x25f174dd00f7d207"}
{"user_id": "103026927169268668533", "name": "FJ B", "time": 1531234757985, "rating": 5.0, "text": "Very Good Dr. Very attentive when you are talking to him!! Very down to earth personally, easy to talk to. Within one minute with him you would think you have known him all you life. Again Great Dr!!", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x8f14d9413a66405e"}
{"user_id": "109376884257977834899", "name": "Daniel McCranie", "time": 1519655726004, "rating": 5.0, "text": "Dr. Vasquez is the best Cardiologist in N. Alabama and perhaps the entire Southeast!  My whole family has seen him since Dr. Vasquez started practicing in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88621354836d54b3:0x8f14d9413a66405e"}
{"user_id": "104952598529365204288", "name": "Tammy Brewer", "time": 1618021652296, "rating": 5.0, "text": "My husband was really knocking on deaths doors. With Dr. Sapkota he has him almost as good as he was before his problems occurred. I owe him and his staff a big thank you. I know without them I would of had a long hard road ahead of me. Thanks you Doctor Sapkota and Doctor Khan that is also in the same office.", "pics": null, "resp": null, "gmap_id": "0x887d49db0790c6af:0xf5fc8d034db846c9"}
{"user_id": "102807919571195909151", "name": "The Mad Splattr", "time": 1608652263767, "rating": 1.0, "text": "Turned away at the door for being more than 15 minutes late, even though we called ahead and spent about 20 minutes looking for a wheelchair that we were assured were by the entrance (they were not). We drove over an hour to get there only to be turned away, despite us having called ahead to discuss the situation. My grandmother is practically bed bound, yet we managed to get her out.", "pics": null, "resp": null, "gmap_id": "0x887d49db0790c6af:0xf5fc8d034db846c9"}
{"user_id": "104545197305935424730", "name": "Tim Baldwin", "time": 1605387048234, "rating": 5.0, "text": "Good experience he cares about his patience health", "pics": null, "resp": null, "gmap_id": "0x887d49db0790c6af:0xf5fc8d034db846c9"}
{"user_id": "102745280077776422499", "name": "Daniel Smith", "time": 1605034582325, "rating": 1.0, "text": "By all means avoid this man. He operated my friend and gave him a stent without anesthesia. And when my friend confronted him about it, the doctor said my bad. No one in the operating room bothered to even acknowledge him in agony when he was screaming and hollering. This is the definition of malfeasant and malpractice. This man should not have a medical license. Avoid him at all costs.", "pics": null, "resp": null, "gmap_id": "0x889a0def5060cf93:0xe99ed59c09b8787b"}
{"user_id": "111798239642946589498", "name": "Darlene Burr", "time": 1615307159273, "rating": 4.0, "text": "Dr. HEIDI IS THE BEST DOC I HAVE FOUND\nSHES A HEART DOC AND ONE OF THE BEST.", "pics": null, "resp": null, "gmap_id": "0x8891ec0677771add:0x472d9ea422a7608b"}
{"user_id": "101948209763018441705", "name": "Joey Lee", "time": 1542151149948, "rating": 5.0, "text": "Probably the most personable doctor you're going to meet. Very easy to talk to.", "pics": null, "resp": null, "gmap_id": "0x8891ec0677771add:0x472d9ea422a7608b"}
{"user_id": "105776691445957742887", "name": "Deanna Katzl", "time": 1620157585867, "rating": 5.0, "text": "You have the sweetest greeter...she was a big help to me (my first time) but she nearly made me cry helping an elderly lady check in...she was born in the 20s and she drove herself...the greeter offered to follow her home to make sure she got there safe if she was still there when she got off...so sweet...", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "110541140566349163184", "name": "Albert Woods", "time": 1602522421360, "rating": 3.0, "text": "I visited this facility on 10/12/20 for a 10:00 a.m. appointment. I wasn't called to register until 10:30. Had an EKG and B/P checked and waited on the Dr. for 45 minutes before I decided to leave. While I understand this is a Cardio Clinic  and emergencies do arise, communication by the staff  to the patient should be considered.  At the checkout station when I informed the staff why I was leaving, their response was do I want to reschedule.  I should probably be given a credit for not receiving the complete exam.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "107984372436662320349", "name": "Kyla Sullivan", "time": 1610377321656, "rating": 1.0, "text": "I had such a terrible experience here. Staff members were so uncompassionate and uncaring, didn't explain anything, and never resolved my problem. I was told that test results were normal and there's no formal follow up.\nI did have a good experience with the lady who did my echo. Unlike the others, she explained what she was doing before doing it and was very kind.", "pics": null, "resp": {"time": 1610384177992, "text": "I'm incredibly sorry to hear that this is how you feel your experience went with our office! While we are a very busy Practice, we absolutely want our patients to feel welcome and taken care of. I would love to hear more if you don't mind reaching out to me personally and explaining. You can reach me on my cell at (256) 945-0598. Rebecca Hedrick / Practice Administrator"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "105493343629264587239", "name": "David Palmer", "time": 1615395305261, "rating": 1.0, "text": "I just need to know a few things:\nWhy is patient ignorance so highly valued by your clinic?\nWhy does your portal  have such little information?\nShould the Dr's. notes on a visit in anyway match the remembered experience of the patient?\nShould billings tell the patient what services were rendered?", "pics": null, "resp": {"time": 1615396650906, "text": "Mr. Palmer - I would be happy to discuss these issues with you one on one. You are welcome to reach out to me at (256) 945-0598. That's my personal cell phone. We take a lot of pride in giving out patients above average care and work towards that with anyone willing to work with us in return. I hope to hear from you soon. Rebecca Hedrick / Practice Administrator of Huntsville Cardiovascular Clinic"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "115422773539968572680", "name": "Sue Long", "time": 1598643856322, "rating": 5.0, "text": "I have had great experience in this office every since 2018 I was wondering if  Dr Michell  Campbell is still there I am suppose to see him in December", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "112818881549461070855", "name": "Nancy Manning", "time": 1563492291708, "rating": 5.0, "text": "The people are so nice here. They are very respectful especially the doctors and nurses. Dr. Kiessling is the best. She’s very down to earth and friendly. I would and will recommend Huntsville Cardiovascular Center to family and friends", "pics": null, "resp": {"time": 1563539329056, "text": "Thank you so much for this review Nancy! We pride ourselves on taking the BEST care of our patients. Please let me know if there is anything you need in the future. Rebecca Hedrick / Practice Administrator"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "116610674526432587086", "name": "Matthew Newell", "time": 1560883381629, "rating": 4.0, "text": "On my first visit, I was left waiting for almost 3 hours! I was supposed to have tests done, but after waiting Dr. Strickland came in and asked why I was there! We talked for less than 5 minutes before he sent me to reschedule.\n\nMy second visit was very different than the first. I was called exactly on time. Everyone was helpful and friendly.", "pics": null, "resp": {"time": 1560894170709, "text": "Mr. Newell - I am so glad we were able to speak today and that your second experience with our office was to your satisfaction. We definitely work hard to be sure our patients are well taken care of and pleased with our services. I value your input and will work to continue to improve our facility processes.\n\nI hope your evening is GRAND! Please let me know if there is anything I can assist with in the future.\nRebecca Hedrick / Practice Administrator / (256) 213-4660"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "114096074710202300306", "name": "James Lee", "time": 1583188608675, "rating": 1.0, "text": "had a 130 appt. escorted to exam room at 2pm, EKG at 215, then waited to 330 for Dr Strickland..he didn't show so I left.  No one seemed to care when I told them I was leaving and the reason why...", "pics": null, "resp": {"time": 1584043451213, "text": "Mr. Lee –\nPlease accept my apology in taking so long to respond to your review. The truth of the matter is that I, the Administrator for Huntsville Cardiovascular Clinic, had a heart attack in our office 9 days ago. I will forever be grateful for how completely and swiftly my staff and Physicians took care of me. My point in telling you this is to bring to light the fact that our Physicians are often handling VERY delicate life-saving situations that cause them to run late for clinic or just have a hard time fitting everything that must be done into a day.\nI am not happy to hear that you felt as if we didn't care that you left. I can personally guarantee that is not the case. We have a reputation in our community of going above and beyond for our patients. One might even say we even spoil them a little. Since Dr. Strickland personally reached out to you (and even gave you his cell phone number), I would hope that you now agree.\nI also hope that our actions since your first visit have given you reason to change your 1-star rating. Our success depends on your happiness and we are very aware of that fact.\nIn the future, please let me know if you are dissatisfied with any service you've received from us. I am more than happy to help!\nRebecca Hedrick / Practice Administrator / 256-945-0598"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "115078533244347098523", "name": "Patsy Morin", "time": 1491926743997, "rating": 3.0, "text": "My wife and I have been satisfied patients of Dr Kelly Smith and the Huntsville Cardiovascular Clinic for many years. Last November we moved my brother to Huntsville from Orlando and immediately requested that he be accepted as a patient there as well.  He has lived these last 7 years with a defibrillator in his chest but has had no regular contact with a cardiologist.  So far he's had several visits to the clinic to establish a file of his current cardiac condition.  One of those visits (3/16/17) determined that his defibrillator battery had to be replaced, so an appointment was set up for 3/24/17 at Crestwood Hospital.  That date had to be rescheduled to 4/6/17 at 9AM.  We showed up at 8:40AM only to be told that the doctor was stuck by weather in Minnesota.  No phone call preventing us from making the trip to the hospital!  The procedure was rescheduled for 4/10/17 at 10AM. We showed up at 9:40AM and began our wait.  My brother was taken back soon after arrival and prepped for his procedure but his waiting room tracking code never appeared on the monitor.  I began to ask questions around noon without success.  No one could tell us what was going on.  The doctor finally showed up around 4PM and my brother, who'd had nothing to eat all day finally made it home at 8PM.  Not one phone call from anyone!!! Unsat!", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "106277498182479105214", "name": "Kathy Harkleroad", "time": 1500143553289, "rating": 5.0, "text": "I've been a patient of Dr. Kelly Smith for as long as I can remember. I love his professionalism, how he welcomes questions and is very reassuring in his answers. I've been the rounds in this office and have had a stress test, nuclear medicine, ekg's, echos, you name it. Each time Dr. Smith was on top of everything and told me what the results were immediately. When I had a problem with my high blood pressure, he and his nurse April were quick to answer phone calls and worked with me on adjusting my meds to get it lowered. I could not ask for a better cardiologist and recommend him highly to anyone!", "pics": null, "resp": {"time": 1500480644667, "text": "Thank you SO MUCH for the highest rating and very kind words!!!! We work really hard to take the best care of our patients. Please let me know if there is ever anything I can do for you. Rebecca Hedrick / Practice Administrator / 256-880-1050"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "113850061422349047506", "name": "robin chaney", "time": 1521644536598, "rating": 1.0, "text": "Sent my grandma to the hospital and literally absolutely nothing was wrong with her!! 88 years old and sat in the ER for 9 hours till 11 pm. Worst doctor ever! He's a cardio Dr and couldn't even do his job. He gave her a panic attack at 88 years old!!", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "100574737083341391868", "name": "TL C", "time": 1504729123254, "rating": 4.0, "text": "I had a concern with billing but the practice manager resolved it quickly, effectively and courteously!", "pics": null, "resp": {"time": 1504713996395, "text": "I am sorry you felt that your situation was not handled correctly. We do have a protocol in place for self-pay patients and, typically, all goes well. We pride ourselves in, and are very known in the community for, being above average in our patient care and satisfaction. I would be happy to sit down with you face to face or have a phone conversation with you regarding your account if you would allow it.\nRebecca Hedrick / Practice Administrator / (256) 880-1050\nUPDATE: I was very happy to help clear things up and appreciate the feedback! Please let me know if you need anything in the future."}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "100761976214908395391", "name": "Vic Robertson", "time": 1480972314908, "rating": 5.0, "text": "Dr. Strickland and the staff are friendly, considerate, professional, and proficient. I saw him once, and staff took care of everything else.", "pics": null, "resp": null, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1575254284156, "rating": 4.0, "text": "Good clinic.", "pics": null, "resp": {"time": 1575309920783, "text": "Thank you SO much for your good rating and comment. I'd love to know how we can improve and meet your 5 star rating, if you feel like sharing. In the meantime, please let us know if there's anything we can help you with. Merry Christmas to you and yours! Rebecca Hedrick / Practice Administrator / (256) 880-1050 x105"}, "gmap_id": "0x8862133bcbbf61ad:0x59261efeb07d49b8"}
