{"user_id": "108452318216825960510", "name": "Chris F", "time": 1613760104075, "rating": 5.0, "text": "Friendly people in good service.And they  always have what I need", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111629201481998458747", "name": "BJ Lawrence", "time": 1598628466675, "rating": 4.0, "text": "Very friendly, helpful, needed a board cut in two to haul and they cut with no charge.  Price was reasonable.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "110637748586957343285", "name": "Deborah Perry", "time": 1598722770036, "rating": 5.0, "text": "Great service . Prices very reasonable . Courtious staff.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "104508036459440389575", "name": "Patrick Erb", "time": 1577991419001, "rating": 5.0, "text": "They have really stepped up their game. Increased inventory a new-look on the interior with expanded products", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "111189521876633652396", "name": "Sandi Stephenson", "time": 1552754928754, "rating": 3.0, "text": "The young boy help in us was really clueless about everything we asked and the guy at the register was rude like he didnt want to be there. Other than that it was ok.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "112552503212451880129", "name": "Danny Roberts", "time": 1540833581289, "rating": 5.0, "text": "If you need building materials and appliances at low prices check here first you will be back if you go anywhere else", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "102199070504581052250", "name": "Rodney Walker", "time": 1543781892163, "rating": 5.0, "text": "They have anything and everything you could want for home repair", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "106311822894182759034", "name": "Rodney Hopkins", "time": 1544925279169, "rating": 4.0, "text": "Good prices.", "pics": null, "resp": null, "gmap_id": "0x8887b7ef11f51987:0x8ba34217adaeb820"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1624394784776, "rating": 4.0, "text": "Really like the store. Lots of options to choose from. Nicole was very responsive on the cabinet design and got the order submitted when completed in a timely manner. I would recommend.", "pics": null, "resp": {"time": 1624634423147, "text": "Hi Jennifer,\nThank you for the review. We're happy to hear you were pleased with your visit to the showroom. We value your feedback and look forward to your next visit. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115417472708461661662", "name": "Keith Quackenbush", "time": 1513117216757, "rating": 5.0, "text": "I walked in the showroom and was blown away by the selection.  After I walked in I was sooooo impressed by the service.\n\nWhat I will say is that this place is not 'cheap'... if you want 'cheap' 99 cent tile or carpet... go somewhere that sells cheap stuff.\n\nBUT! If you want builders grade, or really cool stuff at great low prices.... then they are well worth a visit! Ober 50,000 sample in a gorgous well lit showroom.\n\nBEST flooring, plumbing and cabinet showroom I have ever seen.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMAsWSQnpvqEinG4_-7BHSc9cf5dOYUiBbYhpvD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmQZUSVAiQmcYljVS6jqUbdDHg9JcSPXPNR8ik=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN67Z3MablSXoD3I4kLQPqT1l98dd4m8C-mgaFJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmqyXDZdlBASCRICrGo0YPK9RatM3okVnmGt3q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6-ttGcLCF0vBO0eO5WV4ZgvwrPX6Mx6n65tU2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPusxLNsi46rtmKB6uA0WP4pD65fL2-pi2FPjvO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMl89PSXSMdzD_Ud4LVchgmWK3gwM-AmuOf-CRr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7BLhQj-iNhkFnlIO0gNROJstBQ5JrR1gNK8Ha=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIeHtVFofEiKPeUr-ILATQkrZTgaw_BWIEMYas=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106499389525534900811", "name": "Seghers Pickard", "time": 1612396533032, "rating": 5.0, "text": "Overabundance of choices! Jeff was a great help, plus he has a really good eye for color. I was able to pick out carpet, luxury vinyl plank, kitchen cabinets, tile backsplash and grout, and countertops. So many choices of such beautiful products. Can't say enough about this one-stop-shopping hidden gem in Pelham!", "pics": null, "resp": {"time": 1612539594693, "text": "Hi Seghers,\nThanks so much for the feedback, We really appreciate you taking the time to leave a review! We pride ourselves on having the best quality materials with plenty of choices and are thrilled to hear you enjoyed working alongside Jeff. Come back anytime!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "118411282663125310378", "name": "Henry Strevy", "time": 1614081970485, "rating": 5.0, "text": "They have the best and they are very nice and polite", "pics": null, "resp": {"time": 1614353852498, "text": "Hi Henry,\nThanks for the review. We're happy to hear your visit to the showroom was a success and our team was able to be of service. We value your feedback and always look forward to new projects. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "108654884351566354484", "name": "Ben", "time": 1590168050094, "rating": 5.0, "text": "ProSource has been so easy to work with. They give great advice and don't rush like the more well known franchises and big box stores. I will use them again when I do my next renovation.", "pics": null, "resp": {"time": 1590758905997, "text": "Hi Ben,\nThanks for the review. We're elated to hear you enjoy working with our showroom and that the process was easy going. We appreciate your feedback and always look forward to new projects. Come back and see us anytime, take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "113203519863552748548", "name": "Jeff Pierce", "time": 1573190690391, "rating": 5.0, "text": "So happy we found this place! Prices and quality were outstanding but the help we received from Christoper, one of the family members that own it, was invaluable. Although they do a lot of business with pro contractors, Christopher took the time to help us (DIYers) select cabinets, a soaker tub and fixtures. We highly recommend ProSource! Jeff", "pics": null, "resp": {"time": 1573225419868, "text": "Hi Jeff,\nThanks for taking the time to leave a review. We're so pleased to hear you enjoyed utilizing our showroom and working alongside Christopher. We appreciate your awesome review and look forward to your next project!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102189620606858087351", "name": "George Sadowski", "time": 1527180524179, "rating": 5.0, "text": "If you have not shopped at pro source then you need to. The selection by far is the best in the Birmingham area the store room is beautiful as well as the selections of products. I must say the staff is excellent. I highly recommend that you stop in even if you are not building or remodeling and once you do, you will go home with ideas so that you will want to remodel.", "pics": null, "resp": {"time": 1527255292961, "text": "Hi George, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience and hope to see you again soon. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "104377946049587942150", "name": "Barbara Klein", "time": 1524774646911, "rating": 5.0, "text": "I had the opportunity of consulting, with Chris at Pro Source.  He was very patient, friendly and a good listener, of what products I was interested in. I had a kitchen flood that affected three rooms, with flooring needing tile/ carpeting, as well as, . backsplash tile. He had a wealth of knowledge, of all their materials and shared advice on my possible interests.  I was given many samples to take home to see\nthe colors, with my lighting and existing colors I was trying to coordinate together. I would highly recommend Pro Source materials  and Chris making my remodeling a good experience.", "pics": null, "resp": {"time": 1525881173963, "text": "Hi Barbara, thank you for taking the time to leave your feedback. We are pleased to hear that you had a great experience and will pass along your kind words to Chris."}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "102114088470396655242", "name": "Mitch Jones", "time": 1527179963301, "rating": 5.0, "text": "We needed to remodel a rental property and had gotten several quotes from different people before going to ProSource.  ProSource had the BEST prices AND they were the most eager to help us find what we needed within our budget.  Christopher and his staff are FANTASTIC!! Great showroom too, highly recommend them!", "pics": null, "resp": {"time": 1527255264402, "text": "Hi Mitch, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience and will pass along your kind words to Christopher. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "111284215726827876082", "name": "Brenda Lynn", "time": 1533404830865, "rating": 5.0, "text": "ProSource is a fabulous place to work. The Pancners are great people to work for and with. The other employees are great, too. It is a happy place to work and shop.", "pics": null, "resp": {"time": 1533837926223, "text": "Hi Brenda, thank you for taking the time to provide your feedback!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115384948953016513077", "name": "Tim Johnston", "time": 1506462599700, "rating": 5.0, "text": "Hands down the best,cleanest, well lit showroom in the Greater Birmingham area... Great selection of flooring, cabinets countertops and K&B!  The service is excellent and the staff is friendly and knowledgeable and really cares about getting you the look you want!", "pics": null, "resp": {"time": 1507219260743, "text": "Hi Tim, thank you so much for the positive review! We are glad that we can offer such a large selection to our customers. Come back on the next project!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "115918866966240008698", "name": "Joy Cannon", "time": 1534078930079, "rating": 5.0, "text": "Jessica and Christopher were so friendly, helpful and patient.  They made the daunting task of choosing from so many products easier and fun!", "pics": null, "resp": {"time": 1534527562677, "text": "Hi Joy, thank you for taking the time to provide your feedback! We are pleased to hear that you had a positive experience and will pass along your kind words to Jessica and Christopher! Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "104832565774838115634", "name": "Sue Smith", "time": 1510867749351, "rating": 5.0, "text": "Pro Source in Pelham has an outstanding selection & the staff is top notch.  Special hat tip to Cody Barrett, my account manager.  He has had the patience of a saint & couldn't be more helpful!  Can't say enough good things about this Pro Source.", "pics": null, "resp": {"time": 1511815607049, "text": "Hi Sue, thank you so much for the positive. Review we are so happy that we could help you with your project needs. See you on the next one!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "103807881521583055200", "name": "Amanda Larson", "time": 1513902296158, "rating": 5.0, "text": "This place is wonderful.  Everyone who works here is so helpful.  ProSource is perfect for all your flooring needs.", "pics": null, "resp": {"time": 1513005364215, "text": "Hi Amanda, thank you so much for the 5-star rating. We really appreciate it. See you again soon!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "110433268411200516916", "name": "Matt Lewandowski", "time": 1506469633402, "rating": 5.0, "text": "Employees were knowledgeable and helped us through our project, specifically Mr.Chris Pancner. We have a home in Fairhope and had our product shipped to their other location in Pensacola. I was able to pick up the material, which was wrapped perfectly. The warehouse guys were friendly and made sure I had everything I needed as well. Will be sending all I can to you guys, thank you so much!", "pics": null, "resp": {"time": 1507219295786, "text": "Hi Matt, thank you so much for the positive review. We will make sure to pass on the compliments to the rest of the showroom - they will be thrilled! See you again soon."}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "118064429393032855273", "name": "Kate Victory", "time": 1512669624877, "rating": 5.0, "text": "Beautiful showroom with tons of selections! Instead of searching all over town, I was able to get the majority of my material here!", "pics": null, "resp": {"time": 1513005391361, "text": "Hi Kate, thank you so much for the positive review. We appreciate the feedback and look forward to working on our next project together!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "117244924662295034674", "name": "george pancner", "time": 1501701572077, "rating": 5.0, "text": "Beautiful showroom, knowledgeable staff, 40,000 selections and lowest prices in town.", "pics": null, "resp": {"time": 1501862536788, "text": "Hi George, thank you so much for positive review. We are happy that we can offer a wide range of products at low wholesale prices. Hope to see you soon!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106348363915782145772", "name": "Taylor Reed", "time": 1527192632370, "rating": 5.0, "text": "They have a beautiful showroom with lots of options and a helpful staff to answer all of your questions.", "pics": null, "resp": {"time": 1527255320066, "text": "Hi Taylor, thank you for taking the time to provide your feedback! We are pleased to hear that you had a great experience. Take care!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
{"user_id": "106738619137973725477", "name": "Jessica Richardson", "time": 1506462484468, "rating": 5.0, "text": "Awesome selection, tons of choices, and super helpful staff!", "pics": null, "resp": {"time": 1507219232918, "text": "Hi Jessica, so good to hear that we could help with your project. Thanks for the positive review and hope to see you again!"}, "gmap_id": "0x888923f30a46bb4f:0x34f92e2b234424e3"}
