{"user_id": "108521383715339781574", "name": "Aiveen Kahalley", "time": 1615842111975, "rating": 5.0, "text": "We have been working with RD Lowes for over 10 years.  Consistent quality, timely response and all around a great company to work with.  Robert and his team do a fantastic job!", "pics": null, "resp": {"time": 1616269119560, "text": "Thank you for all of your business over the years.  We look forward to another 10 with you!"}, "gmap_id": "0x889a4d58159f75c5:0x600174ebd31f1062"}
{"user_id": "103820272252574883237", "name": "Nancy Wilson", "time": 1510691924622, "rating": 5.0, "text": "They do great painting and powerwashing.Very nice and professional work.", "pics": null, "resp": {"time": 1616269141034, "text": "Thank you!"}, "gmap_id": "0x889a4d58159f75c5:0x600174ebd31f1062"}
{"user_id": "117788803187601122003", "name": "Erik Nist", "time": 1600893421749, "rating": 5.0, "text": "We had a new condo in our rental program that needed a makeover. Candace and Gene totally came through and did an amazing job on a very short time frame. I was blown away about how great they were in all aspects of getting the job done. Timely, cost effective, thorough . . . I could go on and on. Bottom line, I'll be calling Island Services when my clients need the job done right. Thanks y'all!", "pics": null, "resp": {"time": 1596573491747, "text": "Thanks Erik! Glad we could help out. Popcorn removal is always a big improvement. 👍"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "102744480065288446463", "name": "Michael Overton", "time": 1422982208234, "rating": 5.0, "text": "I have known Gene and Candace a long time and they have always been extremely professional and just plain nice to be around.  Over the years we have both been clients of each other.  Island Services has got to be without a shadow of a doubt one of the top choices in the whole southern Baldwin County and Gulf Island Areas.\n\nYou will be happy you chose them and decided to eliminate frustration and stress.\n\nM.O. WebFocus Marketing Group", "pics": null, "resp": {"time": 1422984331881, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "105281299784549195965", "name": "Bellezza Photography of Alabama", "time": 1422983993172, "rating": 5.0, "text": "Great Company, Great Service, Great Results,\nThat's 3 Greats... What else do you need to know?\nHighly recommended.", "pics": null, "resp": {"time": 1422984445928, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "112379345089725188905", "name": "Aaron Aasen", "time": 1422982699109, "rating": 5.0, "text": "Great people who pay close attention to detail.  Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "105550016850619951416", "name": "Kaytrielle Jones", "time": 1423616403803, "rating": 5.0, "text": "Honest, good hearted people! You can count on quality service", "pics": null, "resp": {"time": 1423618188918, "text": "Thank you Kaytrielle!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "114405505271778312721", "name": "Iris Meyer", "time": 1423583503418, "rating": 5.0, "text": "Highly satisfied with Island Services! They provide outstanding workmanship and are very professional!", "pics": null, "resp": {"time": 1423584064108, "text": "Thank you Iris!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "115978587226826137962", "name": "Robert Schwarze", "time": 1422533529689, "rating": 5.0, "text": "Very honest and upright people.", "pics": null, "resp": {"time": 1422572928888, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "103220891827753950407", "name": "Joshuah Bryant", "time": 1422978466142, "rating": 5.0, "text": "Detailed oriented company. You want go wrong be choosing them for your home repair needs.", "pics": null, "resp": {"time": 1422979157623, "text": "Thank you!"}, "gmap_id": "0x889a04d7728e12b3:0xa8894a082eb4cfea"}
{"user_id": "107369112961501106721", "name": "Kristin Williams", "time": 1490202603068, "rating": 5.0, "text": "It feels like family. The quality of work is amazing and they work overtime to make sure your cabinets are in on time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOu0QvLx1wVxWWzsuwcVixh2pVGKyVceUmnzGff=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ae8afc5b710f:0x179cf1f6ed306316"}
{"user_id": "105334109368771087891", "name": "Rebecca Richardson", "time": 1564534108570, "rating": 5.0, "text": "The Turners made the beautiful cabinets for my kitchen after I had a fire in it. The selection of cabinets to choose from is extensive as well as stain options. The beautiful cabinets exceeded my expectations and the installation and price were fantastic.", "pics": null, "resp": null, "gmap_id": "0x8889ae8afc5b710f:0x179cf1f6ed306316"}
{"user_id": "112022007991916633597", "name": "Michelle Jones", "time": 1622594978257, "rating": 5.0, "text": "Schmidt Home Services was awesome to work with. Very responsive and great communication! We will definitely call them again in the future.", "pics": null, "resp": {"time": 1622597008058, "text": "Thank you.. we try our best to stay in touch with all out clients as much as possible.  I'm happy we where able to help you out. We look forward to working with you in the future."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113373559091292995801", "name": "Annette Hardin", "time": 1614471657726, "rating": 5.0, "text": "Polite, on-time. Excellent work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "110242958326644666701", "name": "Yingying Li", "time": 1614048480930, "rating": 5.0, "text": "very professional and helpful!", "pics": null, "resp": {"time": 1614051654942, "text": "Thank you 😊.. I'm glad we where able to figure out that headboard for you even though we where missing items for the assembly, Gotta love IKEA!😄"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "104119765343787468314", "name": "The Diva Mrs. Ash", "time": 1619216946665, "rating": 5.0, "text": "The gentlemen at Schmidt's were very professional, prompt, & informative. They installed a lock on my shed which was a complicated process. They were very diligent and kept me informed along the way.  I will definitely recommended their services to everyone & I will be using their services again!!", "pics": null, "resp": {"time": 1619217276326, "text": "Thank you very much. We are happy to help and are glad we where able to get your lock figure out."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "103209938140064926820", "name": "Peter M. Babnis", "time": 1622342120705, "rating": 5.0, "text": "Josh and Zack were awesome to work with. Easy to get in touch with, quick scheduling, and work was done to complete satisfaction. We’re new to Birmingham and are happy to have found Schmidt’s home services. I’d 100% recommend giving them a call and letting earn your business. We’ll definitely be working with them again on some larger projects.\n\nThanks guys!", "pics": null, "resp": {"time": 1622383806643, "text": "I'm glad we where able to be of assistance.  We pride ourselves on our customer satisfaction.  We look forward to working with you again in the future.  Welcome to birmingham We hope you like it here."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "114209927779929763129", "name": "Tennille Carter", "time": 1600910557720, "rating": 5.0, "text": "Joshua did an excellent job.  Very professional and reliable.  I live in another state so it was great to find a company I could trust to work on my rental property.", "pics": null, "resp": {"time": 1600906856722, "text": "Thank you for choosing Schmidt's Home Services.  The deck turned out great and look brand new. I look forward to any future projects you may have.  Call anytime and have a great day!\nJoshua Schmidt"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113226486399779629131", "name": "E F", "time": 1615404106941, "rating": 5.0, "text": "Josh and everyone at Schmidts Home Services are really fast and professional. I called same day needing a door frame repaired and blinds hung and Zach came out got the job done that very day. This was very last minute and everyone was professional and thorough.\nThank you again, great service to use I highly recommend them!!!", "pics": null, "resp": {"time": 1616029727301, "text": "Thank you..I'm glad we where able to help you out with this project. Spread the word to family and friends that schmidt's Home Services can help with all your household needs."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "115378204361100570200", "name": "J Lewellyn", "time": 1625072028645, "rating": 5.0, "text": "Schmidt’s has been very easy to work with. They worked my job into their schedule quickly. As they would complete one job, I would ask if they could do another, and they got those done, too! I highly recommend!", "pics": null, "resp": {"time": 1625073276532, "text": "We were very happy to help. I'm glad everything turned out great.  If you need any help with any future projects feel free to contact us anytime. Thank you for your business."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "111977377720279409859", "name": "Gabbi Calderone", "time": 1622752158908, "rating": 5.0, "text": "Tim was prompt, efficient, responsive, and professional.  Highly recommend! Knocked out what would have taken my husband and I probably half a day or maybe a whole day in three hours! I submitted my request and received a response instantly.  Tim was out to our house the next day and completed all tasks exactly how I wanted.", "pics": null, "resp": {"time": 1622761795354, "text": "Thank you so much for the kind words and for taking the time to do this review for us! Tim is definitely an asset to our team!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108978733634757155129", "name": "Maria Holmes", "time": 1597687539950, "rating": 5.0, "text": "I'm a little late but a huge THANK YOU to Tim Childers with Birmingham Fast Repair for putting together our patio furniture and replacing our window blinds last month. He was very professional and a great sport dealing with the complicated patio piece we asked him to put together. We look forward to using Tim again for our future projects!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAZbeB-d86c8yt5hoRb7veaAgH-MkOUAFScsGw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZzjOsE78SlZBmRVOzpLWuP-eQyHtSxyhxrh8R=w150-h150-k-no-p"]}], "resp": {"time": 1597692036499, "text": "Thank you so much for taking the time to do a review Maria! We are so pleased that you had such a great experience with Tim. Please let us know if we can ever help out again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106395817116326249386", "name": "Tiara Young Hudson", "time": 1622385928176, "rating": 5.0, "text": "The entire business model is awesome. It is hard to find a knowledgeable and trustworthy handy man when you’re new to home repairs. Our assigned handyman was everything I hoped for and he didn’t loaf on the job just because he was charging me hourly.", "pics": null, "resp": {"time": 1622824959334, "text": "Very kind words. We love it when someone notices and appreciates our unique approach! Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "111071221813907073063", "name": "Mk Rashid", "time": 1563338469012, "rating": 5.0, "text": "We have to give shout outs and thumbs up to Kyle Butler! His work has been some of the best that we've seen as far as rehabs are concerned. Kyle has Rehabbed 4 of our apartment units for us and he's about to start on the 5th unit soon. We are very excited to see his Great Work and Detail during this upcoming rehab!! We have been completely satisfied with the work that he has completed for us and we intend to use him over and over when available!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN5znmV1XUxFIFJdYTBXwQpflrSmwVhwP61IzF8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQ1QDBaszVlsN6R23dwnfS1sD7YyidIVaXFM6x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKRnQdiABj9mkFZ73U_F8EYU8IergV1PGYUhy6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFiLr0ghbyfDDtH7hZ6azGl59d0CO2bY5Y7ARL=w150-h150-k-no-p"]}], "resp": {"time": 1563378330229, "text": "We will pass along the kind words. Thank you for being such a great client. If google allowed, we’d give you 5 stars right back!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106322434717160412099", "name": "RC and MoonPie", "time": 1621360905626, "rating": 5.0, "text": "On time, worked fast. Looks fantastic, caulked, sealed, painted, cleaned up.Totally pleased. I have found my Go To home repair company!", "pics": null, "resp": {"time": 1621435286810, "text": "Thank you! Who was the handyman assigned to your project? We want to be sure to pass on the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117617474278687131201", "name": "Steve Casey", "time": 1621710832385, "rating": 5.0, "text": "I have used Bham Fast Repair on several occasions now. They always respond quickly, show up on time, and do good work for a fair price. I’ll continue to use them and highly recommend them.", "pics": null, "resp": {"time": 1622129538557, "text": "Thank you so much for taking the time to do this review and we appreciate your business!  We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "101778923479355537513", "name": "Beverly McCutcheon", "time": 1606377530577, "rating": 5.0, "text": "TRAVIS, I got the best finally. Gave up, looked for Gutter Repair. 8 years of misery with Gutter Company that installed never could fix. Same areas. Travis has been here several times repairs and so much more. More then I can say this man has done.Truly needed him years ago. Stopped all the problems I have had for 8 years with leaking gutters, A nightmare for me. I feel rescued. Has been so great I could never say enough about him. A really nice man too I got know well as I was out there with him showing me what was wrong and needed. So where would I be now without Travis. Another person or new gutters? First day he came I was horrified what he found. Asked him do I just need new gutters again, was worried then about the whole house. He said no, he was repairing them, I needed to see what was wrong, those areas. Travis saved me a lot money and stress I have been through with the thought of new gutters and couldn’t be repaired. I will always use him.\nI see now here too maybe he can clean them. Had no\nIdea all the other things this company can do. Will be helpful for me too. All the great reviews and I have just gotten one of them, Travis. Must be just like him.", "pics": null, "resp": {"time": 1607229157855, "text": "Thank you so much for your review! We are very pleased that you were happy with Travis and will pass that along to him!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110925814739244530364", "name": "Devon Rankin", "time": 1622128050091, "rating": 5.0, "text": "Hired BFP to install screens for my existing back porch. Blake contacted me the day after I submitted my request to talk through it. We communicated via text and phone after as questions came up and then Blake put together a detailed scope for the work and made great suggestions for materials to use for the job. We ran into problems sourcing the materials (very high demand!), but he kept me informed of the delay along the way and was able to begin work as soon as we had what we needed. Work was performed over a 3 day period, and Blake showed up on time and worked diligently each day. He kept me updated on his progress during the day and the end product turned out great. We can't wait to start using our newly screened porch.", "pics": null, "resp": {"time": 1622129452224, "text": "Thank you so much Devon!  We are so pleased that everything went well and will happily share your kind works with Blake!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106605411646573617746", "name": "Lawrence Sheffield", "time": 1617126064013, "rating": 5.0, "text": "BFR is the best in the business! I wish I called them sooner. Thanks Seth and Gibbs.", "pics": null, "resp": {"time": 1617806426386, "text": "Thanks so much for the review!! We are so glad you were pleased!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105843001202051508598", "name": "Charles Simpson", "time": 1617217545692, "rating": 5.0, "text": "Can't say enough good things about this service! They showed up, on time, the day after initial call. Tim assembled our patio furniture in just over two hours. We are so pleased. We'll never use anyone else. Thanks, guys!", "pics": null, "resp": {"time": 1617806550013, "text": "We are so glad you were pleased!! Thank you so much for taking time to do the review !"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109464509412322114225", "name": "Bryan Ramsey", "time": 1594351495597, "rating": 5.0, "text": "About a month ago I had posted a negative review about Birmingham Fast Repair, and I'm here to say that I was WRONG!!! They were quick to respond in the most professional manner to my complaint. Seth made this matter his top concern, which every customer would want. This just goes to show the quality of customer service this group has. Seth was very apologetic (which he did not need to be) and did a fantastic job on installing my french patio doors. Seth was such a pleasure to be around. Not only was he professional, but he took time to get to know me and my family, which went beyond my expectations. His work and craftsmanship were very impressive. He definitely knows his work and set the bar very high. I could write this review all day on how pleased we were to have him in our home and his work product. I feel like I have finally found a company that I can trust to do an Honest, and PROFESSIONAL job at an unbeatable price. Seth's work has transformed our home beyond what we thought it could look like. I would highly recommend SETH and Birmingham Fast Repair for all of your projects. They will definitely be my \"go-to\" company for future projects.", "pics": null, "resp": {"time": 1594404103981, "text": "Thank you so much Bryan!  We really value our customers and appreciate that you took time to write this review for us.  We are so pleased that you were happy with the work Seth did for you and very grateful that you gave us a second chance! Please call us again any time!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "112493158752831101881", "name": "Madison Williamson", "time": 1618858000085, "rating": 5.0, "text": "We have used this company twice now- for building our deck, building our fence, and staining our deck! Great value, great quality, and very friendly staff!", "pics": null, "resp": {"time": 1619037034237, "text": "Thank you so much Madison! We appreciate that you took the time to leave us this nice review. We look forward to working with you again :)"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "111089989782510075270", "name": "Michael Forester", "time": 1605211560212, "rating": 5.0, "text": "Gibbs, from bham fast repair, repaired a fence that was damaged from Zeta. I couldn’t get any companies to call back because everyone was busy because of the storm. I ended up getting in contact with bham fast repair. They put me in touch with their employee Gibbs and I dealt with him for the rest of the project. Very efficient way to handle work especially since I couldn’t even get a return call from others. We worked out the details and it was repaired within a  week or so. He saved us money on supplies and followed through on everything he said he would do. He was even early to my house to start the repairs. No surprise charges either. Very impressive individual and company. If I ever need any other odd jobs done, I’ll definitely reach out to Gibbs and Birmingham Fast Repair", "pics": null, "resp": {"time": 1605221566485, "text": "Thank you so much for your review Michael!  We are so glad that you were pleased with the way your job was handled and with Gibbs!  Please call us again for any future needs!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103139702407368752525", "name": "Hadden Smith IV", "time": 1604520085274, "rating": 5.0, "text": "Great company. Quality of work was exceptional and the worker we had was very professional. I'd recommend them to anyone.", "pics": null, "resp": {"time": 1604521468033, "text": "Thank you so much for your review and for taking the time to post this! Please call us again for any future needs!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109511280557242024076", "name": "Sheena W", "time": 1589994737408, "rating": 5.0, "text": "It was a pleasure working with Chris. I live out of state and own a 4 plex. One of the units were vacant and needed some paint/drywall work before being put back on the market. Chris was quick in contacting me, quick to start and complete the job and great at maintaining constant communication throughout the project. He was very willing to go above and beyond in assisting me. He provided before and after pictures and a walk through video explaining everything so I could be comfortable with his work. I can't physically be there, so he was my eyes and brought unknown issues to my attention, which he verified with pictures. I have a property management company, but their bids were high to do some of this work, which is why I shopped around and found Birmingham Fast Repair.  They also didn't catch some of the issues Chris did. My experience leads me to believe that Chris is nothing short of honest, knowledgeable, trustworthy, and hardworking. Highly recommended.", "pics": null, "resp": {"time": 1590003136760, "text": "We appreciate your business. Thank you for the generous review!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109053634298216774423", "name": "Karen Register", "time": 1605755212719, "rating": 5.0, "text": "Mailbox uprighted & concreted into position. Gibbs did a great job! On time, professional, skilled for job, communicated well, detailed. Thank you!", "pics": null, "resp": {"time": 1605755874249, "text": "Thank you so much for that review Karen!!! We are so glad you were pleased and will pass that on to Gibbs!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116495181525722011731", "name": "Joe Walker", "time": 1586277680688, "rating": 5.0, "text": "I can't say enough good things about this experience. From my initial phone call with Shannon to the finish of the job, it has been such a pleasant experience. Travis is the best! He was in constant contact with me. He was able to come do my job a week earlier than scheduled, and was able to come earlier than the appointment time. Imagine that!!! And to boot, he charged $100.00 less than the quote. He was that fast! The work looks great. I told him that I will definitely use them again in the future.", "pics": null, "resp": {"time": 1590371777298, "text": "Very kind. Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110977379092926487321", "name": "Bradford Acton", "time": 1603311164951, "rating": 5.0, "text": "Everyone should be using this business. It's not just about the cost, or the quality, or the professionalism. More than anything else, when you use BFR you know you are going to get a quality worker, an honest person, and a company that cares about those things as it grows.", "pics": null, "resp": {"time": 1603378655852, "text": "Thank you so much Bradford!! We really try to uphold those standards and care greatly about being honest with our customers and building lasting relationships! We appreciate your kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115529207962960644094", "name": "Jeri Tanner", "time": 1592600115222, "rating": 5.0, "text": "Stephen has been to our house on a couple of projects and I can’t brag enough on him. He’s got great ideas and does fast, neat work. He has a great decorator’s eye as well as the ability to do anything with tools, seemingly. So glad we found this company and that Stephen is our Fast Repair guy.", "pics": null, "resp": {"time": 1592616623750, "text": "Love that you call him “your guy”. We hope that all our customers develop a relationship such as this. Thank you for being a wonderful customer!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104157861279324833069", "name": "Bart Slawson", "time": 1588692137334, "rating": 5.0, "text": "I had a gutter that drained poorly on top of our exit stairs. Travis came on time, very polite, did a fast accurate professional job and charged half the quote. WOW that was great. This was 2nd time I used Fast Repair. 1st time a man came out and assembled my deck furniture. He did in 30 minutes for half price! Excellent", "pics": null, "resp": {"time": 1590371800192, "text": "Thank you Bart!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107992190039947739005", "name": "Greg Eiselin", "time": 1594519602399, "rating": 5.0, "text": "Thank you Tim Childers! He worked diligently to piece together a large children’s play-set, and our children couldn’t be happier. This would have taken me entirely too long by myself. We are grateful. We are going to utilize Tim’s abilities on another project in the near future.", "pics": null, "resp": {"time": 1594738673757, "text": "That is awesome!  Thank you so much for sharing that Greg.   We are so glad that you were happy with Tim's work and will look forward to working with you again on future projects!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104207456679163686682", "name": "jeremiah alcorn", "time": 1589392049625, "rating": 5.0, "text": "SO EASY!  Emailed pics, got a quote.  When it took less time than the estimate, he charged me appropriately!  So glad to have competent, respectable workers available for any project.", "pics": null, "resp": {"time": 1589409792819, "text": "Thank you! I will be sure to pass this on to Travis!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116331117173878022438", "name": "Debbie Medenica", "time": 1579816928660, "rating": 5.0, "text": "The repair person contacted me quickly, and was professional, yet cordial.  I had emailed photos of the damaged item, and he was able to give me an estimate of the time/cost required.  He was even early to our appointment, but he called before he came.  He was knowledgeable, meticulous, and thorough in his work, and left the work area completely clean.  He was a really nice guy, friendly and conversant, and answered any questions I had with expertise.  I will definitely use this company again, as well as recommend them to my friends!", "pics": null, "resp": {"time": 1579821838092, "text": "Thank you Debbie. What encouraging words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "102579978873489332139", "name": "Kim Bryant", "time": 1588970662355, "rating": 5.0, "text": "Both my daughter and I have hired Birmingham Fast Repair 3 times now. Caleb Bergmann was our technician the first time. He did such a great job we requested him the next two times. I couldn’t believe how much he got  done in just an hour. Best money I’ve spent!!!", "pics": null, "resp": {"time": 1590371860194, "text": "Thank you! We love our repeat customers!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109943955610700496942", "name": "Jenna Zoghby", "time": 1597429879219, "rating": 5.0, "text": "Tim is great! He hung 12 pictures for me in a grid format. Made my life so much easier", "pics": null, "resp": {"time": 1597433562643, "text": "Thank you for taking time to post your review Jenna! We are so glad you were pleased with Tim’s work!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "106904868610599648993", "name": "Jhavalen Brown", "time": 1590834711997, "rating": 5.0, "text": "Tim was excellent. We could not have asked for a better handyman for our job. Everything was completed to our liking and looks great.", "pics": null, "resp": {"time": 1591898287885, "text": "I'll pass the kind words on to Tim. Thank you!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "109083394355706721538", "name": "Jillian Thomas - HHS", "time": 1585333735663, "rating": 5.0, "text": "Great experience! Easy to communicate with, quick to respond, and even quicker to complete the work. Highly recommend! Grateful to the friends who did recommend this team.", "pics": null, "resp": {"time": 1589409828363, "text": "Thank you for the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104676247163784261207", "name": "Josh Crago", "time": 1571766197351, "rating": 5.0, "text": "Birmingham Fast Repair did a fantastic job with the long list of repairs that we had.  Luis did a great job, and works very efficiently.  I am glad that I have found my go to home improvement company for any need that arises.", "pics": null, "resp": {"time": 1571771452629, "text": "Thanks Josh! We appreciate the kind words!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104953353912519219413", "name": "Yuhua Zhang", "time": 1547524593790, "rating": 5.0, "text": "We had our porch stairs down and I submitted a request online. Blake quickly responded and scheduled time. he came exactly on the time he promised and estimated the work. He made very clear estimate and explained in detail of the job. The price is fair. Blake did an excellent job replacing the stairs, much beyond what we have expected. He handled the job very professionally and efficiently. After the job was done, he cleaned the work place and hauled away the old stairs. We are very happy to the job he accomplished. We highly recommend Blake to who needs home repairs. He is great! We thank him again for making our home much better.", "pics": null, "resp": {"time": 1547554686485, "text": "Thank you! I’ll be sure to pass along the kind words to Blake."}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "110718465641180812208", "name": "Joy Phillips", "time": 1570187948283, "rating": 5.0, "text": "We had a list of mostly small repairs to get done before listing our townhouse for sale.  Birmingham Fast Repair and Kyle Butler are such a blessing!  BFR website made it easy to get started.  Kyle made it easy to get the work finished.  We had a kitchen drawer that wouldn't close properly.  Small problem but essential to get it fixed.  Contractors weren't interested in such a small project, several \"handy\" guys looked at it and couldn't fix it.  Kyle fixed it within the first 20 minutes of walking through the front door!  From there he went to the squeak in the kitchen floor.  Fixed!  We needed new lattice panels on an outside storage closet.  Done!  Life is so much easier because of  Kyle and Birmingham Fast Repair.", "pics": null, "resp": {"time": 1570193470348, "text": "Thank you for kind words! We truly appreciate the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "118279556739034945919", "name": "David Dolinger", "time": 1555417132322, "rating": 5.0, "text": "Chris Evans was my repairman and did an excellent job.  The work was paint and repair on our chimney cap so involved climbing up on the roof, screening, caulking, and rust-proof painting.  Chris arrived on time, was very nice, and worked safely and efficiently to get the job done in a timely manner.\nWe are very happy with his work and will call again when needed.", "pics": null, "resp": {"time": 1555546428523, "text": "Thank you David. We truly appreciate the business. And the feedback!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108622944494082475826", "name": "Jeff Iftekaruddin", "time": 1553199350440, "rating": 5.0, "text": "The Absolute BEST!  What a pleasure to find this terrific company in Birmingham.  Each step of my customer journey was EFFORTLESS.  Seth, Shannon and Chris made my life so much easier.  Chris is an expert handyman and is as professional as they come.  If you are looking for a company that is courteous, responsive and provides stellar work, call Birmingham Fast Repair.  I will be definitely be using them in the future! Thank you Seth, Shannon and Chris!", "pics": null, "resp": {"time": 1553204951503, "text": "Thank you Jeff for the kind words! A pleasure working with you as well!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "114164332930397554177", "name": "Kaitlin Brown", "time": 1573658620995, "rating": 5.0, "text": "This is a hidden gem of a home repair service. The variety of work they're able to do is so wonderful! I really appreciate their timeliness and professionalism with each repair.", "pics": null, "resp": {"time": 1573663511354, "text": "Thank you, thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115429433027910261121", "name": "Aaron Gray", "time": 1542818900236, "rating": 5.0, "text": "Luis did a great job on the handyman tasks we've given him. He started on a fence repair and has done a number of other things around the house from painting to plumbing. Seth Corbin is also a good guy. Highly recommended.", "pics": null, "resp": {"time": 1542819868502, "text": "Thank you Aaron!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113578171023346209645", "name": "R Thompson", "time": 1593459887465, "rating": 5.0, "text": "Tim did great work cleaning and repairing our gutters, and came out within an hour of our initial phone call. Great communication and will be happy to hire again.", "pics": null, "resp": {"time": 1593466335191, "text": "Thank you! Will pass on to Tim!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104235789980065825969", "name": "John Willard", "time": 1572968619639, "rating": 5.0, "text": "Birmingham fast repair was so great to work with. Seth and his crew efficiently fixed the problems that we faced. Can’t wait to use BHM fast repair again.", "pics": null, "resp": {"time": 1572975962504, "text": "Thanks John! Always a pleasure to work with you."}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108783105927708742265", "name": "Bryan Ramsey", "time": 1589504623053, "rating": 1.0, "text": "It took about a month for someone to come out to do measurements (started the 2nd week of March). I was told I would be contacted 2 weeks later for an install. I understand this happened at the beginning of the COVID-19 situation and is a hard time for all of us, but I had not received any other communication or follow up from anyone. I had sent text messages on 2 occassions (a month after measurments) and no response. I'm not sure what its like in this line of work, but I was willing to spend close to $3K on the project and not a peep from anyone. This may not seem like a lot of money in this line of work, but $3K for a day or two of work I would be running to complete this job. I'm  concerned about the lack of follow-thru in communication. There are plenty of people that need work and it's disappointing to see the lack of interest.", "pics": null, "resp": {"time": 1589587480444, "text": "Bryan, I appreciate the feedback. Obviously we missed the mark on this one and I sincerely apologize. I’ll certainly look into what went wrong and make the necessary adjustments to prevent this from happening again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117002595676189867619", "name": "Grace Willis", "time": 1535143664898, "rating": 5.0, "text": "Couldn't recommend anyone better! (Ask for Ethan!)\n\nI called Birmingham Fast Repair to book a quote and possible appointment to install a pedicure chair's foot rest at my job. They were very fast and informative to book someone for us. They sent an email with a name/photo/bio/contact of who the handyman would be. He followed up the day before and day of (before the appointment).\n\nUpon arrival he was prepared and friendly. He assessed the parts/chair and confidently installed everything exactly as needed and at a timely manner -- I commend him for agreeing to fix it, especially since he had never worked on a pedi chair (who even has?) and it's fairly complex considering there are water lines and pipes involved. He communicated everything very well.\n\nThank you for everything. We will definitely be recommending you all to everyone we can!", "pics": null, "resp": {"time": 1535152105583, "text": "Thank you for the kind words! It means so much!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "112572611943784547144", "name": "Rebecca Barganier", "time": 1581447082925, "rating": 5.0, "text": "Excellent experience. 10/10, would recommend, will use again!", "pics": null, "resp": {"time": 1581452166993, "text": "You are too kind! Thank you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "114442721499589525966", "name": "FrostByte", "time": 1580257705020, "rating": 5.0, "text": "Did a great job hanging my tv. Was on time, professionally mannered and dressed.", "pics": null, "resp": {"time": 1580317636488, "text": "Thank you for the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107532666962236075516", "name": "Marilyn Ireland", "time": 1547832599797, "rating": 5.0, "text": "Micah did a FANTASTIC job on my 80+ year old antique dining room tabletop.  It had been ruined years ago by a felt backed tablecloth that was ironed on while sewing.  We finally got it refinished and he did a remarkable job.  Thanks so much Birmingham Fast Repair, I will be using you again.  And by the way, the PRICE was awesome!", "pics": null, "resp": {"time": 1547860265586, "text": "Thank you! I’ll make sure to share with Micah"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105650408963731561504", "name": "Jerry Currin", "time": 1529360739649, "rating": 5.0, "text": "Seth Corbin does excellent work!  Arrives on time, professional, yet personable.  Has the skills, tools, ability to complete the work assignment.  Spent extra time, without charge, to assure the job was completed to my satisfaction.  Seth is in my phone directory as a first call for repair/installation work.", "pics": null, "resp": {"time": 1529366785507, "text": "Always great to hear when one of our guys hits the mark!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117012867347705376602", "name": "Sharon Wix", "time": 1534945860345, "rating": 5.0, "text": "Everything about my experience with Birmingham Fast Repair was positive. Shannon took my call, determined what kind of help I needed and promptly put me in touch with Kyle Butler. Kyle arrived on time and was pleasant, professional and efficient. I will definitely be using BFR for future projects!", "pics": null, "resp": {"time": 1534953541885, "text": "Thank you Sharon!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103807248478057509185", "name": "slimerv", "time": 1597021643179, "rating": 5.0, "text": "Doug Sands was very nice and professional.", "pics": null, "resp": {"time": 1597025681225, "text": "Thank you so much for your review! We will make sure Doug sees it and we are very glad you were happy with his service!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108551001163451535193", "name": "Mary McC.", "time": 1502811220355, "rating": 5.0, "text": "We are thrilled with the work this company did! They gave us an accurate estimate, showed up on time, and completed the work within the estimated time frame. They were always professional and very nice. I highly recommend them!", "pics": null, "resp": {"time": 1502815453603, "text": "Thank you! Our pleasure to work with you!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113255318136601252183", "name": "DeeDee Barnes Bruns", "time": 1511297941059, "rating": 5.0, "text": "Jim from Birmingham Fast Repair did an excellent job installing my mailbox. He picked up all the necessary supplies, dug up the existing concrete base and installed my mailbox according to postal service standards. He was quick and prompt and professional. I will use Birmingham Fast Repair again!", "pics": null, "resp": {"time": 1512933891349, "text": "Thank you! We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105756473975385612568", "name": "Ellason Holliday", "time": 1594742878135, "rating": 5.0, "text": "Great experience and service, would highly recommend!!", "pics": null, "resp": {"time": 1594820632897, "text": "Thank you so much Ellason!  Please call us again anytime!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113546052482717433739", "name": "Kelley Largin", "time": 1575481827061, "rating": 5.0, "text": "Quality work. Professional and reliable!!", "pics": null, "resp": {"time": 1575912345227, "text": "Thank you Kelley!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113447356902872101594", "name": "Clay Hubbard", "time": 1504981247297, "rating": 5.0, "text": "We had our deck replaced from Blake at Birmingham Fast Repair. He did a fantastic job, was super timely with his work, and very friendly! If you are looking for a quality job, look no further! We could not have been happier with their work!", "pics": null, "resp": {"time": 1504982071688, "text": "Thank you! So glad to here it!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "105097042115684152364", "name": "Kyle Murphy", "time": 1506963040210, "rating": 5.0, "text": "I recently had some work done to my house I just bought by Micah and I am more than satisfied! The work ranged from outdoor tree work to electrical to installing shutters and house numbers and everything worked out great. The best part of using Birmingham Fast Repair is the communication and honesty you get about the service and what needs to be done. I plan on using them again for more projects around my house and recommend to anyone in the Birmingham area.", "pics": null, "resp": {"time": 1506984760659, "text": "Thank you for sharing. We look forward to the next project!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "116487728854517195490", "name": "Lisa Muncher", "time": 1556742338290, "rating": 5.0, "text": "This company did a great job for us on the deck steps we requested. The price was very reasonable, the steps look fantastic and Brent was a great person to work with. He was quick and efficient at his work and cleaned up afterwards. Will definitely use BFR again in the future. Just a note, the fact that you can pay your invoices on line, with half up front, and use any form of payment, is a huge plus!", "pics": null, "resp": {"time": 1556760193530, "text": "Thank you Lisa. We really appreciate the feedback. I’ll pass on you kind words to Brent!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115255608470999109324", "name": "Shannon Johnston", "time": 1471548449007, "rating": 5.0, "text": "Seth did an awesome Job fixing my daughters drawer to her dresser! I would highly recommend him for anything you may need fixed in your house!", "pics": null, "resp": {"time": 1471564681183, "text": "Thank you Shannon!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "108608701853877251285", "name": "Trudy Clements", "time": 1551216637641, "rating": 5.0, "text": "Highly recommend this company. From the first minute through completion of the job, everything was first class. Kyle did a wonderful job moving the cabinet over my cooktop, replacing the range hood and SS backsplash.", "pics": null, "resp": {"time": 1551218120636, "text": "We love feedback. Thank you!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "113558550874110777763", "name": "jacqueline smith", "time": 1473375099385, "rating": 5.0, "text": "Seth repaired and serviced our Dyson vacuum and I could not be more pleased! He picked up and delivered for a fair price and even found a better deal for replacement filters for me!! He was very quick to respond and the repair turnaround time was super fast! Seriously some of the best customer service around - I will definitely be calling him again!!!", "pics": null, "resp": {"time": 1473375874376, "text": "Thank you Jacqueline!!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "107571316991647484041", "name": "Rae", "time": 1564124442068, "rating": 5.0, "text": "Trustworthy, friendly, and knowledgeable. The whole process was stress-free.", "pics": null, "resp": {"time": 1565091906369, "text": "Great to hear! Thanks again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "100204599229098913299", "name": "Amy S", "time": 1479496388354, "rating": 5.0, "text": "Birmingham Fast Repair did a great job in stalling a small fence and gate in my backyard. A pleasure to work with - quick responses and good quality work!", "pics": null, "resp": {"time": 1479669851257, "text": "Thank you Amy!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104937908497463699385", "name": "JJ Thomas", "time": 1488905551510, "rating": 5.0, "text": "Seth and Bham Fast Repair were very responsive. They were able to perform the work timely, at a very reasonable price and, also, at a high quality. Will call on them again.", "pics": null, "resp": {"time": 1488906407534, "text": "Very kind! Our pleasure"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "115819374549422593846", "name": "Elaina Gunter", "time": 1517943254667, "rating": 5.0, "text": "Blake with Birmingham Fast Repair was amazing! He showed up on time, was respectful, and very professional. Communication can sometimes be a hassle with certain companies but not this one. Bham Fast repair always responded to my emails, calls, and even texts in a timely manner making this project a breeze. Blake came prepared and went above and beyond for our yard cleanup. Would recommended them to anyone for ANY job! Will definitely be hiring again!", "pics": null, "resp": {"time": 1517961951075, "text": "Thank you for the kind words! We look forward to working with you again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "117716242555072450979", "name": "Cathy Alexander", "time": 1471532012663, "rating": 5.0, "text": "I was very happy with the service I received from Seth Hamby.  I needed my reclining sofa repaired.  He came to the house and repaired it there so we didn't have all the hassle of having to take it somewhere (If you have ever had a reclining sofa you know how heavy and bulky and awkward it can be to move)! I would definitely recommend calling Birmingham Fast Repair if you have any type of repairs needed around the house.", "pics": null, "resp": {"time": 1471544812251, "text": "Thank you Cathy. It was a pleasure!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "102805233915725257488", "name": "courtney callis", "time": 1617244102290, "rating": 5.0, "text": "David Moss did an amazing job putting together my furniture!", "pics": null, "resp": {"time": 1541815641526, "text": "Thank you Courtney! We really appreciate that you took time to do a review for us. Please call us again!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "118369324823855483078", "name": "alan dean", "time": 1550263667162, "rating": 5.0, "text": "gutter work repairing leaks, painting the gutter elbows, replacing the splash guard, and a few incidentals - reasonable pricing, on time, personable service.  Much more for him to do!", "pics": null, "resp": {"time": 1550696944364, "text": "Thanks Alan! We always appreciate the feedback!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103443732244359694128", "name": "Corey M", "time": 1607228413873, "rating": 5.0, "text": "Treadmill assembly", "pics": null, "resp": {"time": 1607229068956, "text": "Thank you for your review!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "104852949043229895286", "name": "Luke Rabun", "time": 1504719503206, "rating": 5.0, "text": "Great work", "pics": null, "resp": {"time": 1504734544772, "text": "Thank you very much!"}, "gmap_id": "0x888919548bf1063d:0x9f4aa85c39b2b9e8"}
{"user_id": "103233750565246896475", "name": "Gene Montecchie", "time": 1534905323396, "rating": 5.0, "text": "Phillips scraped, patched and retextured a kitchen ceiling for us in Gulf Shores.  They showed up when they said would. They protected the floors and cabinets. They finished on time and within budget. What else could you ask for?", "pics": null, "resp": {"time": 1541128347046, "text": "Thanks for the review! Happy to help with your Sheetrock repair project in Gulf Shores!"}, "gmap_id": "0x889a0f57da1efc93:0x4cbe1e4def3cfab3"}
{"user_id": "116957891038333057222", "name": "Scott Brandstadt", "time": 1606262604835, "rating": 1.0, "text": "They never returned my call", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
{"user_id": "108966807080294768900", "name": "Katie Adams", "time": 1551209162672, "rating": 5.0, "text": "He is fast with estimates, provides fair pricing and completes the work in a timely fashion. His crew also does a good job with cleanup. I would highly recommend Estes.", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1587229455101, "rating": 5.0, "text": "I've used Estes Painting for years. He has done high end work for me every time and I continue to call him back. His prep and finish work are superior to any I've seen. True professional! I would recommend Estes Painting to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
{"user_id": "102242513818275068683", "name": "John Haggard", "time": 1479129073571, "rating": 5.0, "text": "I've used Estes for both interior and exterior work and both jobs went well. They were very professional and thorough. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
{"user_id": "106651052739289056295", "name": "Jessica Kenington", "time": 1557236465124, "rating": 5.0, "text": "Amazing work!!! Flawless painters, Excellent Carpenters , Highly recommend!!!!! A+++!!!", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
{"user_id": "103409511705147610651", "name": "Joy Whittle", "time": 1526330589855, "rating": 1.0, "text": "Called to get an estimate on a commercial job at mall and she said “ sorry, we’re not interested.” WOW! That says a LOT about your company. LAZY.", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
{"user_id": "109212483583116093934", "name": "Jerome Fahnhorst", "time": 1482794863309, "rating": 5.0, "text": "I have been using Estes Painting for a long time. They Always do the best work.", "pics": null, "resp": null, "gmap_id": "0x88891669a7746577:0x7adee4707e00a300"}
