{"user_id": "108251610646995972048", "name": "Wanda. A Thompson", "time": 1617921335657, "rating": 5.0, "text": "I am very satisfied with the service and personal consideration of all family members and friends. We were greeted with kindness and respect. Mikala was professional with her attitude and generous with her time as she explained everything in detail and answered all questions that we had. We appreciate the loving kindness in which we were treated.", "pics": null, "resp": {"time": 1617996355973, "text": "Thank you so much for your comments. We are glad Mikala was able to take care of you and your family. She really loves what she does and it comes from her heart. It means so much to us to know that we are helping families during such difficult times as the loss of a loved one. Please let us know if there is anything else we can do for you."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "102504318513220086489", "name": "Jessica Parker", "time": 1615145229090, "rating": 5.0, "text": "Robert and his staff were incredible during the passing of my father n law. Not only were they extremely helpful in making arrangements but they also went out of their way to help us make it possible to have a full military honor service for him. We are forever thankful for their compassion and assistance during a very difficult time. The chapel, the grounds and the service we received from Sunset  just can not be matched in the Dothan area.", "pics": null, "resp": {"time": 1615234760431, "text": "Hi Jessia, Thank you very much for your kind words. It was our honor to serve your family. Please let us know if there is anything we can do for you and your family."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "100866250492752439098", "name": "Hannah Waters", "time": 1618407975740, "rating": 5.0, "text": "Robert Byrd and his staff have been the most amazing people to work with during the worst time of our lives. Our sweet grandfather passed away in Huntsville and we needed him back in Dothan and they made the whole transition perfection. The facility and staff are top notch! (Working for the coroner in Huntsville and the funeral home I have very high standards in this situation) and I could not ask for better. We are forever grateful for Sunset and Mr. Byrd. Thank you for making our worst time one of our best memories celebration JT life.", "pics": null, "resp": {"time": 1618972875058, "text": "Thank you for letting us know how you feel. We only want to provide the best for our families during this difficult time. With so many decisions to make and mourning at the same time, it also can all be so much. It was our honor to take care of your grandfather and your family."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "110547065334696063125", "name": "Luan Stevens", "time": 1618411495837, "rating": 5.0, "text": "I cannot say enough GREAT things about Sunset Memorial. When my dad, JT Radney, passed, Robert Byrd was contacted. He made immediate arrangements for my sweet daddy to be brought back to Dothan and met with the family the next day. His compassion and genuine nature made it so much easier for us as a family to choose what was best for dad. We were not rushed or made to feel as if we were just another customer. Through the process, the staff was very helpful and friendly and all of our needs there were met with a smile and friendly face . I would HIGHLY recommend using Sunset Memorial when you have to lay a loved one to rest. You will not be disappointed.", "pics": null, "resp": {"time": 1618972237875, "text": "Thank you Luan for these kind words. We truly appreciate you taking the time to let us know and share your thoughts with others. It was our honor to take care of your father."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "104777172292226878721", "name": "Dustin Ethridge", "time": 1628629252178, "rating": 5.0, "text": "Very honest and the greatest people u could meet", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "117360570574041570509", "name": "Scott Metcalf", "time": 1602618404807, "rating": 5.0, "text": "Mr. Byrd and all the staff made everything about this incredibly difficult process easier. They have went above and beyond to help us in any way that they could and we are so thankful for their kindness, support, and compassion that they have extended to us. The entire facility is so beautiful, and the outside grounds and cemetery is picturesque. We couldn't have picked a better place.", "pics": null, "resp": {"time": 1602679568818, "text": "Scott, thank you for allowing us to serve your family. We hope we were able to make dealing with such a hard time a little bit easier."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "104776127201630848332", "name": "Alexandria Rogers", "time": 1609711219945, "rating": 5.0, "text": "Absolutely amazing staff and place. They handled my husband’s grandmother’s service and the compassion and handling of everything from the staff was absolutely amazing. Thank you so very much from Billie Marie Rogers’ family.", "pics": null, "resp": {"time": 1611093830383, "text": "Thank you Alexandria for your kind words. Taking care of your family was our honor."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "101890980224033016884", "name": "Trey Glass", "time": 1602594629866, "rating": 5.0, "text": "We lost our mother Rhonda Hix in 2008. I knew Robert Byrd when he had previously owned Byrd Funeral Home in Dothan. He handled my grandmothers funeral in 1997 with such compassion that I knew he’d do my mothers the same way. I was not disappointed.\n\nFrom the planning to the visitation to the graveside service Robert and his staff exhibited the utmost compassion to my family and I will never forget the compassion shown to us during this difficult time.\n\nThank you Robert!", "pics": null, "resp": {"time": 1602679774952, "text": "Trey, thank you so much for your kind words. It is what we feel called to do and we are honored that we could serve your family."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "116148763591048408191", "name": "David Speck", "time": 1605820297595, "rating": 5.0, "text": "Handled my mother-in-law’s arrangements both professionally and diligently.  A very kind and caring staff that went out of their way to assist my wife and her brothers!!!", "pics": null, "resp": {"time": 1605829969758, "text": "Hi David, Thank you so much for letting us know. It is our honor to help a family like yours during such a difficult time."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "116371704615314156766", "name": "Rob Oz", "time": 1581566341351, "rating": 5.0, "text": "I have been meaning to write a review for a very long time but, one gets caught up in every day life. My wife had her mother buried about over a year or two ago at Sunset Memorial.  Mr. Robert Byrd, his family and all of the staff are very caring.  We never felt pressured in anyway while conducting the burial arrangements. Mr. Byrd made sure to take the time and address all of our concerns. He is a truly sincere caring person who will treat your love one with the dignity and respect they so deserve. The Sunset Memorial grounds are uplifting and gives you a sense of inner peace.  Sunset Memorial greatly reflects the dedication and pride of the Byrd family and Staff.", "pics": null, "resp": {"time": 1588281714649, "text": "Thank you! What beautiful words! We are honored to have served your family."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "104592178625943548896", "name": "Lynn Cleghorn", "time": 1577627918087, "rating": 5.0, "text": "I work for a funeral home in Birmingham,  AL and attended a service at Sunset yesterday for my Godmother Rose Shirley.   I have to say that this facility is absolutely beautiful.  The service was beautiful and the staff considerate.  When we were going to the honor salute outside,  one of the directors saw my 82 year old grandmother and I coming to the pavilion and he left the pavillion to come show us a bench for her to sit on.  That is total service and care. Even though I work for a different company I have to say you guys are awesome!", "pics": null, "resp": {"time": 1588281870757, "text": "Wow! Coming from another funeral professional, your words mean a lot. Thank you so much."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "114102337543047020024", "name": "Tami Darley", "time": 1577818990809, "rating": 5.0, "text": "We have had several family members pass away over the last few years and Mr. Robert and his team are not only professional, but genuine and caring. It means a lot when you have complete faith in those to whom you entrust your most prized treasure; those you love.", "pics": null, "resp": {"time": 1588281797978, "text": "Thank you Tami! We understand how important it is to have someone you can trust during such a difficult time. We are glad you felt it."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "109872333886358451292", "name": "Erica Ransom", "time": 1454283590852, "rating": 1.0, "text": "I lost my mother in July 2015 while she was out visiting in Texas, and I called Sunset Memorial since they'd handled the arrangements for my grandmother and a cousin of mine years in the past. I believed their reputation of being professional and accommodating being that my mom was so far away from home. My mother's transport and burial service went fine. But now, 6 months later, there is still no  headstone on my mother's grave. I've called several times in the last 5 months to ask when they would set the headstone.  Each time I'm either blown off, or made a very convincing promise that it will be taken care of right away. Nothing ever gets done. My family has gone through our first Holidays without my mom, and I'm sure Sunset Memorial has no concern about the numerous calls I get from upset family members that can't find her grave site when they go to visit her. Her birthday is coming up in 2 days, undoubtedly with the same result. No headstone in her memory. The last time I called a few days ago, I spoke to Ben (again) who made it a point to mention to me that \"they'd been busy\" (for 6 months, apparently), \"it's been raining\" (for 6 months, apparently), and he reminded me that they do the headstone \"free of charge\" (which I'm sure isn't accounted for anywhere in my $13,000 payment to them, made immediately and in full 6 months ago).  I deeply regret using Sunset Memorial for my mother's arrangements. She's laying in an unmarked grave, for 6 months now, and Sunset Memorial could care less. If you want people that truly care beyond when the check clears, take your loved ones elsewhere. I wish that I did.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "117731651905065918610", "name": "jerome hightower", "time": 1594867114112, "rating": 5.0, "text": "Thank you and the staff for such ❤️ counseling with my planning inquiry.", "pics": null, "resp": {"time": 1594913658359, "text": "You are so welcome Jerome. Thank you for contacting us. It is our honor to help people when they are making such important, personal decisions. Have a great day!"}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "110248208135085987572", "name": "chad rogers", "time": 1523507043309, "rating": 5.0, "text": "This was probably the most beautiful funeral homes I've ever been to in my life. The grounds were full of flowers and the decor all over were simply exquisite.", "pics": null, "resp": {"time": 1594396323966, "text": "Thank you Chad! We really appreciate the photos and your thoughts about our funeral home."}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "106937062914991512725", "name": "Sandy Simerlein", "time": 1535557800930, "rating": 5.0, "text": "This is a wonderful family that gives 100%. I highly recommend them and the staff. The grounds are beautiful and the buildings are in pristine condition.\nSincerely,\nSandy Simerlein", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "108276736917350340385", "name": "Ed Stingray", "time": 1541631526627, "rating": 5.0, "text": "Very professionally  My father had a memorial service only. Well done thank you. Ed Onley III", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "108389759597668702951", "name": "Greg", "time": 1470363068407, "rating": 5.0, "text": "The Byrd family and staff are top notch.  I have conducted several services here and the staff has always been extremely respectful, helpful, and compassionate to each family.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "107118567544454761929", "name": "William Hill", "time": 1470495831280, "rating": 5.0, "text": "What a wonderful, caring, thoughtful staff in a very difficult time for my family! I could not ask for any more comforting attention to feelings.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "112770642728212932028", "name": "Renay Vann", "time": 1521077242532, "rating": 5.0, "text": "When they buried my mom myra allen they did an awesome job... very friendly everything was just beautiful.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "101123772497475304810", "name": "Katy Williams", "time": 1498165761155, "rating": 5.0, "text": "The Byrd family, and all of their staff, were so kind, helpful, patient, and hospitable to my family when my father passed away unexpectedly. They made the worst day of my life much more bearable, and I will be forever grateful for that.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "100030511910297589044", "name": "Joyce Dashner", "time": 1456720243608, "rating": 5.0, "text": "We couldn't have chosen a better Funeral home. We were absolutely taken care of, and it was a beautiful facility as well. My husband is buried there, and I will be as well.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "113134699625191371782", "name": "scotty johnson", "time": 1471961691491, "rating": 5.0, "text": "my father and my sister are at rest at sunset ...mr byrd and his entire staff were fantastic to me and my family. I cant thank them enough for what they did for us.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "113164211687085168089", "name": "Amy Terry", "time": 1352058053767, "rating": 5.0, "text": "Very flexible in accommodating our schedule.  Outstanding care during a heart wrenching loss.", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "101240022263774176467", "name": "Jack Epperson", "time": 1357764545545, "rating": 5.0, "text": "This is a very nice funeral home wish it was near me", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "102226408439672939236", "name": "jerry chandler", "time": 1500682667679, "rating": 5.0, "text": "Beautiful  very friendly  environment. Mr. Chandler", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "112822241037773728181", "name": "Gracie Clark", "time": 1581238636288, "rating": 5.0, "text": "Friendly people", "pics": null, "resp": {"time": 1588281727998, "text": "Thank you! We try. :)"}, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
{"user_id": "104551510300879686461", "name": "Felicia Miranda LadyFee", "time": 1507851472725, "rating": 5.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x88928e6ec6017ec5:0xa497d77cfeddbff6"}
