{"user_id": "106184379418878387068", "name": "Jeffrey Coykendall", "time": 1608936445531, "rating": 5.0, "text": "We used to board with the vet but the animals are much happier here. Rebecca is so sweet and helpful. Worth the drive.", "pics": null, "resp": null, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "104729294798839841809", "name": "Mandy Hughey", "time": 1522948497043, "rating": 5.0, "text": "First time I boarded my great Dane was here. I cannot say enough about this lady and her facility. I was so pleased with the care her received. Rebecca has an awesome place to board. She tries to make it as homey as possible for her customers. I highly recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM7OzZ00bTL3jS0JbgW5qoq1MF4i4DSdC4panE=w150-h150-k-no-p"]}], "resp": {"time": 1524452787235, "text": "Thank you! We loved having your big (BIG) baby lol...He was such a sweetie!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "110290777868089606676", "name": "Dianne Douglas", "time": 1572116977336, "rating": 5.0, "text": "A great find to care for my dogs when needed instead of caged at the vet & exposed to illnesses from patients who come to the vet!\n\nVery nice & ‘homey’. Dogs have a little vacation instead of ‘being boarded’. She takes great care of them, like they are all her own pets!!!\n\nShe is often full to capacity, especially around holidays, etc! Need to call & make reservations! Go by there & check it out & you’ll understand why!!!\n\nCosts a bit more than vet boarding, but my animals aren’t Bored! Love my dogs & it’s well worth the little bit of extra money!!!\n\nThey’re happy when I pick them up, but not stressed & eager to see me to “get out of here”! HIGHLY Recommended!!!", "pics": null, "resp": {"time": 1578082192396, "text": "Thank you so much for the kind words :)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "113070228668560890048", "name": "Corey Stewart", "time": 1590100539188, "rating": 5.0, "text": "A little out of the way, this cute little pet boarding facility is amazing! Montevallo Doghouse + Cats has a separate boarding area for small dogs is like a small hotel, complete with a bed and a door to a private fenced courtyard. However, separate small dog boarding is limited. Call early before holidays.\n\nIn addition, the playground and extra attention to the pets sets this boarding facility apart!", "pics": null, "resp": {"time": 1598978469853, "text": "Thank you so much for taking the time to leave such a kind review! We enjoyed your sweet girl's visit with us!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "117421859648667804238", "name": "Rick James", "time": 1530036736394, "rating": 5.0, "text": "Would like to stop and thank Rebecca for all her help on the phone with me. She was kind and very informative on pricing, even let me walk around the facility. The rooms are more than enough for your pets and the amount of care given is above and beyond what I could have asked for. I was away overseas for 2 weeks and my 2 furry kids had a blast. I was even given email updates which adds peace of mind especially when I'm so far away.\n\nTo anyone looking to board your dogs or cats I highly recommend this facility. I personally wouldn't keep my pets anywhere else!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMykQEMB7XrmhShrkv221L5iG2T7rW7cYXFVyu7=w150-h150-k-no-p"]}], "resp": {"time": 1531318726555, "text": "Thank you so much for the thoughtful review. We are glad the pups had a good time! Love the photo! He is such a big baby :)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "100165252286471527340", "name": "Stella Huckstep", "time": 1573426064034, "rating": 5.0, "text": "My boxers love it there.  They seem to know anytime we head that way and get so excited.  Hands down, the best boarder I have ever used.  I recommend them to everyone I know that needs to board their dogs.", "pics": null, "resp": {"time": 1578082600324, "text": "Thank you! They are so sweet. We love having your girls visit!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "116674418141014695119", "name": "Dee Shafer", "time": 1589857652201, "rating": 5.0, "text": "We love Montebello Dog house. Ms Rebecca is always professional and kind. Our boys Jaxson and Loki are always well cared for, when they get home it's time to sleep for a day or two because they are played out. We had bad experiences with boarding our babies in the past but never here.  Thank you for the love and attention you give to our boys. Awesomeness!!!", "pics": null, "resp": {"time": 1598977333482, "text": "Thank you! We enjoy having Loki and Jaxson visit and appreciate y'all trusting us with your sweet boys. <3"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "105908105741118863124", "name": "Sammy Self", "time": 1569871209514, "rating": 5.0, "text": "Boarded our 3 doggies this past Thursday & picked them up Sunday. Great place. Very pleased. Even gave me a Senior Citizen discount. Wasn’t expecting that❤️", "pics": null, "resp": {"time": 1578081617596, "text": "Thank you for taking the time to leave a review! We enjoyed meeting the pups and we look forward to seeing them again soon!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "111525461955126505357", "name": "Tim Brewer (jugglertim)", "time": 1572227970090, "rating": 5.0, "text": "Absolutely the best place to board your dog. Out of the way, but your dog gets so much more room and attention than anywhere else!", "pics": null, "resp": {"time": 1578081556416, "text": "Thank you! We love having her!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "101699038376761476489", "name": "Adam Buddenbohn", "time": 1460910538200, "rating": 5.0, "text": "We have used Montebello Doghouse 8 times over the last 1.5 years for trips ranging from a weekend to 2.5 weeks. Hands down they are the best place we have ever boarded out two dogs. They love it! They get to stay in a room together with inside and outside access as they please. Plus there is a huge outside play area that is securely fenced for them to run around in. I love that the dog house is a family run place too. My wife and I feel much better leaving our dogs with them as opposed to in a vet where they have a 4x4 concrete cage to stay in. Keep up the good work!", "pics": null, "resp": {"time": 1531320199633, "text": "Aw, thank you! You have the sweetest pups. We appreciate y'all taking the time to leave a review."}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "102098583250060611050", "name": "Michelle Coggins", "time": 1341936090254, "rating": 5.0, "text": "This is as close to home as I've found to leave your dog for a week.  The set-up of the rooms is awesome with their own little patio and yard.  You can tell that the owners truly love the animals.  You are leaving your pet in very good hands.  If you are overprotective (like me) and want to call and check on your beloved pet, the owners will gladly fill you in on how his/her stay is going.  I strongly recommend this place!", "pics": null, "resp": null, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "106807795033862982914", "name": "Leslie Schwartz", "time": 1525055045788, "rating": 5.0, "text": "More like doggie retreat camp, than a kennel!  Happy dogs when you pick them up like they actually enjoyed themselves and thoughtful staff that treat them well while you are out town.  The indoor /outdoor kennels with a view of the woods are very nice and the fuzzy covers and cots are  very nice, they are cared for with love and care. Highly recommended!", "pics": null, "resp": {"time": 1531319255410, "text": "Thank you so much for the kind words and taking time to leave a review. We enjoy having him :)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "106738580553693561813", "name": "Heather Taylor", "time": 1560737689542, "rating": 5.0, "text": "They took excellent care of our dog. We will definitely be back the next time we have to board him.", "pics": null, "resp": {"time": 1578082413263, "text": "Thank you! We had fun!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "114257750863831418586", "name": "Derrick Mendez", "time": 1556634891744, "rating": 5.0, "text": "Great experience!  My wife loved the webcam that allows you to check in on your pets while away.", "pics": null, "resp": {"time": 1560113760998, "text": "Thank you! We are glad they enjoyed their stay!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "117325426169058630101", "name": "Mariana Gruschow", "time": 1528828838709, "rating": 5.0, "text": "We have been boarding our furry kids with Rebecca for almost three years now, she's the best! They always come back home happy! She makes them feel at home :)", "pics": null, "resp": {"time": 1531318848797, "text": "Thank you for letting us care for them. They are all so sweet and fun...and very fluffy!  We love having them!   :)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "115457487160060186812", "name": "Jessica", "time": 1525383849390, "rating": 5.0, "text": "We drive from Northport so that our dog can stay here. I know my dog, Gambit, is safe here and he seems to always have a good time.\n\n\"Fun place, but they don't give me all the treats I want so I only give it one paw up.\"\n-Gambit", "pics": null, "resp": {"time": 1526397767803, "text": "Thank you! And that sounds like Gambit! (..and if you left your computer unattended I have no doubt he would hack it and order them online ;)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "113856241148117115396", "name": "Molly Hindman", "time": 1459364355049, "rating": 5.0, "text": "Absolutely could not recommend this place more! They love our doggies like their very own. We've been sending our fur babies there for 7 years now with only great experiences!", "pics": null, "resp": {"time": 1524453906843, "text": "Thank you so much! It is our pleasure to have them stay with us!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "111542477071600227145", "name": "Buster Lowery", "time": 1550971125129, "rating": 5.0, "text": "Super nice staff. The dogs love it there", "pics": null, "resp": {"time": 1560113855575, "text": "Thank you! We had fun!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "113856241148117115396", "name": "Molly Hindman", "time": 1459364355049, "rating": 5.0, "text": "Absolutely could not recommend this place more! They love our doggies like their very own. We've been sending our fur babies there for 7 years now with only great experiences!", "pics": null, "resp": {"time": 1524453906843, "text": "Thank you so much! It is our pleasure to have them stay with us!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "116642187271077479748", "name": "koby posey", "time": 1526786885673, "rating": 5.0, "text": "Very nice staff. Super management. Can only be hopeful for future growth", "pics": null, "resp": {"time": 1531318881851, "text": "Wow, thank you!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "109444974350045952325", "name": "Mary Sartain", "time": 1555704644907, "rating": 5.0, "text": "I took my Lucy there for the first time because of the great reviews.  I had only made reservations for one night but Lucy had to stay for two due to unexpected work hours and Ms. Rebecca was more than accommodating.  She provided food for her since I did not pack enough.\n\nWhen I arrived, Ms. Rebecca gave me a tour of the place and I was impressed.  Every dog had their own little room with a doggie door to the outside.  They even get one on one activity time with Ms. Rebecca.\n\nEvery time I take Lucy to the vet for day boarding, she cannot wait to go home. When I picked her up today, she did NOT want to leave. My feelings were hurt :( .....LOL!!  When I finally got her in the car, she jumped out when I turned my back to her wanting to stay. I was so happy to Lucy happy.   I now have peace of mind that when I need to board Lucy, she will only to go to Ms. Rebecca's knowing that is where Lucy will be well taken of.  Ms. Rebecca truly loves and cares for our babies.", "pics": null, "resp": {"time": 1560113843556, "text": "Thank you! We enjoyed having her!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "100230368071334904911", "name": "Simon Carbone", "time": 1463781663588, "rating": 5.0, "text": "This place is great - Rusty really takes great care of my dog River. I learned about this place from some friends a couple months ago and River has stayed there 3 times now for up to three nights. She loves it there! The last time i went, i left her blanket and when I picked it her up Rusty had washed and dried her blanket (she probably made a mess...)\n\nMy dog is a senior and they are very sweet to her. She gets to romp around the big yard without a leash and she also has her own little private yard so she has some privacy as well.\n\nShe'll definitely stay here whenever I have to leave town from now on.", "pics": null, "resp": {"time": 1524453592609, "text": "Thank you!  River is so sweet and we love having her."}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "101444288018906789261", "name": "David Porter", "time": 1520435763173, "rating": 5.0, "text": "I don't know what we would do if Rebecca and Rusty were not in business. I guess never travel. Our 3 babies seem to enjoy being away from Mom and Dad and staying at Montevallo Doghouse.", "pics": null, "resp": {"time": 1524452869664, "text": "Thank you! We enjoy having them!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "115901473320936971611", "name": "Zachary Crothers", "time": 1530416190549, "rating": 5.0, "text": "This is the best housing facility around. They are reasonably priced and take good care of the puppies.", "pics": null, "resp": {"time": 1531318518786, "text": "Thank you! We love having the your very busy, bouncy puppy squad!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "105278193108264847476", "name": "Kelly H2O", "time": 1459368319794, "rating": 5.0, "text": "If I could give this place a 20 star I would. Rebecca and Rusty are amazing people. They are so kind and sweet to the animals (and humans too).  Their facility is so clean I would stay there.  It's truly out of this world. I have been bringing my 4 dogs there for several years and know a few other people who won't bring their dogs anywhere else . The dogs and cat's don't stay in cages, they stay in little rooms with storm doors and the dog rooms have a little door at the back so they can go outside to their own private yard. In the winter there are heaters for each room that lower from the ceiling so dogs aren't cold. the cats have the cat trees in them so they'll have a place to curl up that's cozy and comfy.\nThe reviewer who said that it looks like they live near a bunch of meth addicts is ignorant.  The road to the Montevallo Doghouse does have mobile homes along it but most are well kept. That customer is so rude to assume that all people who live in mobile homes are addicts.   I have never had a problem with Rusty or Rebecca not being there and I've taken my dogs there many times through the years.  They are wonderful people.", "pics": null, "resp": null, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "115162051347455026070", "name": "J Sanders", "time": 1537397494468, "rating": 5.0, "text": "Awesome place. Mousse and Rocky love it.", "pics": null, "resp": {"time": 1560113875223, "text": "Thank you! We love having them!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "111499503424770286947", "name": "kljgreene", "time": 1436119746997, "rating": 5.0, "text": "I boarded my two dachshunds here for 5 days, I was referred here by a co worker, I was very happy with the facility. I love that they didn't go into a cage & they had access to the outside. The facility is in nature surrounded by trees. The dogs aren't \"caged\" ....Our family went out of town for a few days and boarded them at our vet...we picked them up upon returning from our trip....one of my dogs had a cracked tooth and scraped and raw nose from apparently trying to bite his way out of the caged kennel. Never again will they go there. Planning a vacation and altho montevello is a far it's well worth knowing my dogs are in good hands, more like a doggie camp.", "pics": null, "resp": null, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "112878980630979896024", "name": "Landon K", "time": 1506835913122, "rating": 5.0, "text": "My dog seems to like this place and the owners are really nice. We have been taking our boxer there for several years.", "pics": null, "resp": {"time": 1524453183587, "text": "Thank you! It is greatly appreciated. We really enjoy what we do. :)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "113629973952027717718", "name": "Lisa Bryan", "time": 1473870291359, "rating": 5.0, "text": "We have Boarded our 2 labs here many times!! And were highly Pleased with the excellent care Bo and Sadie received! From, Rusty and Rebecca and Justin, their son too! So VERY polite and Loving to our precious puppys!! Tho, both our Puppys are sad when we drop them off!!?? They quickly adjust to their room...with the clear door!! And we Know that our black lab LOVES the constant access to their Own Private outside dog run!! During the Summer months the rooms have A/C in each one and in cool weather, there's a heater above them! Which is wonderful for our Puppys! Cuz they're surely to get into Trouble if a heater were near the floor!! Justin learned quickly! LOL! That our spoiled puppys were Very Used to Being Inside in the A/C!! When we had to extend a recent trip for another day and night!!? They were GREAT accommodating Our Needs...and Making Room for Bo and Sadie!! But they were outside ...in the Shade of coarse! But, Justin said that They Both were Over-Joyed!! When their Indoor room came open!! He explained that They BOTH were hilarious!! They're simply Spoiled Rotten....poor babies had to hang in the Shade for an hour or so!? Just 2 1/2 yrs ago...they both stayed outside except overnight and in bad weather!! LOL! And this most Recent visit last month....Rebecca described our Puppys...like She'd known them both for Years!! Telling me what Each of them did on their Nature Walks!!?? And she described Exactly how both Bo and Sadie ACT....& each of their mannerisms!!? MADE ME....KNOW FOR SURE THAT \"SHE\" HAD ACTUALLY SPENT ONE ON ONE \"\"TIME\"\" WITH THEM BOTH!!!❤ This last visit they stayed 6 nights in a room together!! Which is PERFECT!! And it was a mere $200!! They are a bit far away for us....cuz we live in Helena. But it really Not too bad a drive...at all, and the more we drive it ....the closer it seems! We Also use Montevallo Animal Clinic...for All our Furry Babies....our Puppys and Kitty's! So it's about maybe 8 minutes from there!! They've ALSO...worked with us when we Needed Later Drop off after normal hours!! Quite a few times! And as I said accommodated us having to Add an extra day & night!! THEY'VE JUST BEEN WONDERFUL FOR OUR PUPPYS!!❤ Makes Us NOT BE WORRYING ABOUT OUR BABIES EHILE WE'RE AWAY FROM HOME!!\n\nLISA BRYAN....HELENA,AL...", "pics": null, "resp": null, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "110374334016273074765", "name": "Hannah Payne", "time": 1524427279441, "rating": 5.0, "text": "Very clean,  very well kept,  very caring.", "pics": null, "resp": {"time": 1531320066768, "text": "Thank you so much for the kind review! Its hard work to provide and it nice to know it's noticed  :)"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "103964776118882782742", "name": "Suzanne Hutchinson", "time": 1563984824829, "rating": 5.0, "text": "Clean, spacious, friendly conscientious staff", "pics": null, "resp": {"time": 1578082391520, "text": "Thank you!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "116077747884449192772", "name": "cindy HOLSOMBECK", "time": 1517019378407, "rating": 5.0, "text": "Rebecca and Rusty are the best!!!", "pics": null, "resp": {"time": 1524453232326, "text": "Thank you! Tell Georgia and Tiger we said \"hi!\""}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
{"user_id": "107278218528966043210", "name": "Debbie Boothe", "time": 1494446562468, "rating": 5.0, "text": "You will too check it out for yourself!", "pics": null, "resp": {"time": 1524453257994, "text": "Thank you!"}, "gmap_id": "0x88892b28d597f871:0x73abfc4d73304525"}
