{"user_id": "113588126582432503596", "name": "Shaundrika Edwards", "time": 1597225544427, "rating": 5.0, "text": "Very professional and reasonable. Would highly recommend for personal tax preparation. Quick turnaround as well..you won’t be disappointed.", "pics": null, "resp": null, "gmap_id": "0x886212ce51d16f1d:0xb726183679f20235"}
{"user_id": "116231677354757558976", "name": "Jennie Outlaw", "time": 1584475472491, "rating": 5.0, "text": "Excellent service - not only with personal - but business.   It was great to have a CPA take the time to explain ways to improve the business aspect for tax reporting.  Plus price was very reasonable.  Definitely continue using.", "pics": null, "resp": null, "gmap_id": "0x886212ce51d16f1d:0xb726183679f20235"}
{"user_id": "112962326970691551470", "name": "Jessica Smith", "time": 1367365835074, "rating": 2.0, "text": "Mr. Brown is very rude and dismissive. I got his number from the sign outside his office. Big mistake! H&R block did my taxes better! Very slow and would not return phone calls. Beware, I was extremely unhappy with my service. Use at your own risk!", "pics": null, "resp": null, "gmap_id": "0x886212ce51d16f1d:0xb726183679f20235"}
{"user_id": "108572578614824552051", "name": "Jerry Brunson", "time": 1485133886592, "rating": 5.0, "text": "Ken has been doing my taxes for years. I am very happy with his services and would recommend him and his staff.", "pics": null, "resp": null, "gmap_id": "0x886212ce51d16f1d:0xb726183679f20235"}
{"user_id": "108929134733268378405", "name": "Loraine Noland", "time": 1522460505245, "rating": 5.0, "text": "Always Helpful and Great at what he does.", "pics": null, "resp": null, "gmap_id": "0x886212ce51d16f1d:0xb726183679f20235"}
{"user_id": "113842116175784451746", "name": "Kim Mayo", "time": 1580925276546, "rating": 1.0, "text": "Beware!", "pics": null, "resp": null, "gmap_id": "0x886212ce51d16f1d:0xb726183679f20235"}
{"user_id": "108015902358694270361", "name": "Thomas Parish", "time": 1571638096508, "rating": 5.0, "text": "Best CPA firm in town.", "pics": null, "resp": null, "gmap_id": "0x888cf2c215ccf397:0xfbd82a04c43ea664"}
{"user_id": "114111211951053821494", "name": "Shelby Mote", "time": 1468007092066, "rating": 5.0, "text": "Wonderful people to work with!! Very honest and caring. Would definitely recommend them to anyone for tax, payroll, or bookkeeping needs!!", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "100365530848552643938", "name": "Darrin Swan", "time": 1492701874771, "rating": 5.0, "text": "Great experience from a great company.  Thanks for all the help with taxes and payroll.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "104474205535923552810", "name": "kiera meadows", "time": 1480101237998, "rating": 1.0, "text": "would be better if people will answer the phone!", "pics": null, "resp": {"time": 1626383131179, "text": "Thank you for your review.  That was a couple of years before we took over the tax office.  Things are much better now.  There were some health issues with ownership back then."}, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "107807661023494042927", "name": "FL Rowe", "time": 1519200681036, "rating": 4.0, "text": "Good teacher.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "107543394613470604599", "name": "Tim Bigham", "time": 1524512890712, "rating": 5.0, "text": "Very helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x889292f5f5565515:0xf39d6bde0c7454"}
{"user_id": "107539229081798948793", "name": "Carlos Millas", "time": 1628023902621, "rating": 1.0, "text": "She don't  take new clients.????", "pics": null, "resp": null, "gmap_id": "0x88928bb277f5ead7:0x729b1773b3bd6029"}
{"user_id": "118282669260393843497", "name": "Eric Carroll", "time": 1585229643279, "rating": 5.0, "text": "I've been using Jamie for several years now since moving to Dothan. I've not had any issues and this current year have a very difficult tax return. Jamie has called and kept me updated and is working very hard to help us. I really appreciate her doing the hard work cause I'm positive it's not something I could do myself!", "pics": null, "resp": null, "gmap_id": "0x88928bb277f5ead7:0x729b1773b3bd6029"}
{"user_id": "105666557296233354002", "name": "Loretta Smith", "time": 1582074964633, "rating": 5.0, "text": "I've been using Jamie Love since i move to Dothan in 1999. She's the absolutely the best. She takes care of her clients!!! Year round!!", "pics": null, "resp": null, "gmap_id": "0x88928bb277f5ead7:0x729b1773b3bd6029"}
{"user_id": "110756213705751064535", "name": "Patrick Robinson", "time": 1550844567996, "rating": 5.0, "text": "She is super nice and very professional. Will do my taxes here every year. Also a VERY beautiful woman. Big bonus", "pics": null, "resp": null, "gmap_id": "0x88928bb277f5ead7:0x729b1773b3bd6029"}
{"user_id": "108267357858859074915", "name": "Stephen Franklin", "time": 1626642612730, "rating": 5.0, "text": "Always a pleasure working w/ Bryan Parker and his staff. Even after we relocated over an hour away my wife and I continue to use Bryan for our tax needs. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100952886940019018185", "name": "Dianna Howell", "time": 1573655535164, "rating": 5.0, "text": "Bryan Parker is the best!  His attention to detail was awesome. He takes his time to explain ways to save money and gives great tax advice!  I highly recommend Bryan Parker!!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "117549785040606524293", "name": "Marcus Williams", "time": 1568145767947, "rating": 5.0, "text": "Bryan Parker CPA has provided excellent financial services to our small business. We found him just a few weeks after opening our doors. He has helped with taxes, financial planning, payroll and more. I highly recommend Bryan Parker CPA to anyone looking for accounting and finance help.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100966121221547422448", "name": "Kyle Lubsen", "time": 1551572046199, "rating": 5.0, "text": "Bryan L. Parker CPA and the staff are excellent to work with. They are very knowledgeable and helpful.  They have done our taxes for several years and they are quick and thorough. Bryan is quick to respond to questions and the staff also there if you need anything. As a small business owner it’s good knowing they have lots of experience with businesses and keep current with tax code changes.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "117091208165140612711", "name": "Mike Acton", "time": 1535231361777, "rating": 5.0, "text": "Bryan Parker and his group of employees are simply the best. Bryan is more than just \"the guy that does my taxes\". He is an advisor, a professional, and has become a trusted friend. He was recommended to me by my sister in 2006. Little did I know 12 years later that I would trust him not only with filing my taxes, but also trust him with his advice on decisions I have made with business and family matters. I recommend him because he is honest, trustworthy, and takes a personal interest in taking care of his clients.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "107464967600256228209", "name": "Brandy Hamilton", "time": 1573655343992, "rating": 5.0, "text": "Bryan and his team strive for excellence! Great experience getting my tax return completed! Very knowledgeable and friendly service!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100737971883356402400", "name": "L.E. Marcus", "time": 1573655567282, "rating": 5.0, "text": "What a great company to take the worry and stress out of dealing with the IRS! Very personable exec and staff! Definitely recommend Bryan Parker CPA for all of your tax needs.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109859697862035342207", "name": "Bonnie Sult", "time": 1573655443288, "rating": 5.0, "text": "Brian does a fabulous job for his clients and is very responsive and accurate. He is quite knowledgeable and shares that knowledge openly.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108262374914417768278", "name": "M. Williams", "time": 1562946275945, "rating": 5.0, "text": "Bryan Parker CPA does a great job on our taxes and payroll processing. I highly recommend his firm.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108547963885600221308", "name": "Nancy D. Sam", "time": 1415679352420, "rating": 5.0, "text": "As a newly opened business, we knew it was necessary to properly manage our finances. We didn’t have enough money in the budget to hire a full time accountant, so we had to settle with an accounting service. We worked closely with Bryan Parker and were able to prosper financially from the get go! The company is almost a year old now, and we’ve seen great success. Thanks!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "110475303051117164810", "name": "Cee Bee", "time": 1551718645233, "rating": 5.0, "text": "Great customer service.  Always patient in explaining things so that you understand new guidelines, laws etc.   Fast turn around time.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "106229067383085316652", "name": "Erick Boggs", "time": 1551859427787, "rating": 5.0, "text": "By far the best experience ever in taking care of our taxes.  BLPCPA is the most thorough and experienced Firm that I have ever dealt with in completing taxes.  The staff is very knowledgeable, helpful and polite.  If you are not using BLPCPA as your Accountant then you are really missing out!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113354890299372002697", "name": "Laura Steele", "time": 1556744990099, "rating": 5.0, "text": "Bryan and his staff were super to work with in getting our taxes done. My husband and I are both independent contractors and Bryan took time to meet with us to let us know how to make the most of business deductions. He also talked to us about when and how to set up a business and save even more on taxes. We will use him again!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "107309774221835934917", "name": "Sandra", "time": 1551115286894, "rating": 4.0, "text": "Very service oriented. Different from what we were used to in Ohio, where they prepared everything right in front of us. Here after they fit us into their busy schedule, and discussed our needs we found out the cost dropped off our tax records then when they were ready came and picked up our paper work.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116543050913163351927", "name": "Earl Hurst", "time": 1556702483130, "rating": 5.0, "text": "Have been using turbo tax for years and never had to much trouble with it until recently. Had BLPCPA go back over my taxes because of some things that didn't look right. They found some things that turbox was doing wrong and redid 2 years of my taxes plus this current year to help me lower my tax bill. Excellent customer service and a quick turnaround time", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "112011319020392854635", "name": "Jason M. Holt", "time": 1412943877997, "rating": 5.0, "text": "Opening a business and planning its future is not that easy; I learned that first hand. Six months ago, I opened a local business in Jefferson County and was excited to be my own boss, but I did not have much knowledge or skills about running a business or creating a business plan. Bryan L. Parker CPA was able to help me create an effective business plan, as well perform bookkeeping. I am now more confident about my business and its future.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "112066157960935318870", "name": "Marilyn Collier", "time": 1556579607005, "rating": 5.0, "text": "We have used Bryan Parker for 10 years and have been very pleased.  We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113257966579415200824", "name": "Alicia Melton", "time": 1553691232489, "rating": 5.0, "text": "We have been so pleased with Bryan Parker CPA.  They are always timely and efficient. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "109086288399945301754", "name": "Adam Holmes", "time": 1573655573967, "rating": 5.0, "text": "Bryan and his staff takes the stress away from your tax needs and payroll requirements. Highly recommended !!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116779078548972716644", "name": "Anderson Rodriguez", "time": 1418713240469, "rating": 4.0, "text": "Our business was having problems with our bookkeeping. The person we initially hired set up back big time. Luckily, we got much needed help from Barry Crauswell of Bryan L. Parker CPA, LLC. He was able to get up back on track! It was great to know that he could help get us out of the jam we were in.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103376468985409430160", "name": "Luke Germek", "time": 1556894436935, "rating": 5.0, "text": "Excellent service at a reasonable price. Thanks for all of your hard work!!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "102882648010697328637", "name": "Mike Lynn", "time": 1520618369235, "rating": 5.0, "text": "Mr. Parker is AMAZING!!! He is very knowledgeable, easy to deal with, and best of all superior professionalism at an affordable price!!! I will definitely continue using his services for both my business and personal accounting affairs!!! Thanks Mr. Parker!!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "114557499457094539349", "name": "Wes Day", "time": 1541618162848, "rating": 5.0, "text": "Bryan met with me on short notice.  Calm cool and collected, he reviewed my paperwork, charged me a more than fair rate, I thought.\n\nHighly recommended.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "101849667012111574980", "name": "Nisha Patel", "time": 1487092676075, "rating": 5.0, "text": "We have been using Mr. Parker for 13 years now for our business and personal bookkeeping.  He has assembled a great team and they do a fantastic job.  We thank you and hope to continue with many years of partnership.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "116309493239551967933", "name": "Christine Long", "time": 1556642560053, "rating": 5.0, "text": "Bryan Parker and his staff, along with his wife Pat, have been consistent, efficient accounting advisors for our family for many years.  Mr. Parker has a wide scope of business experience in many different industries, so is definitely the \"gp-to\" person.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "105922963930691908783", "name": "Matt Brundige", "time": 1487087997630, "rating": 5.0, "text": "The team is so friendly and easy to work with. No question is a dumb question and they go above and beyond to make your tax season and payroll needs a very smooth process!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "108568602490915006379", "name": "Pamela Collins", "time": 1480343988184, "rating": 5.0, "text": "Excellent and fast on completing my taxes and more money back then if I had done myself. Great advise on financial planning.  Friendly and professional staff", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103682052198523681843", "name": "Ron Waddell", "time": 1487361109912, "rating": 5.0, "text": "Bryan Parker has been my accountant and financial adviser for over ten years. I find him to be very honest, extremely knowledgeable, dedicated to serving his clients, and easy to do business with. I would highly recommend him and his staff to anyone looking for either an account or financial adviser.\n\nI find it really reassuring to know Bryan is on your side when I receive those irritating letters from the IRS.\n\nRon Waddell\nSterrett, Al", "pics": null, "resp": {"time": 1487420303536, "text": "Thank you for your kind words Ron. We strive to provide the highest level of service to our clients."}, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "100236926857041528307", "name": "Lee Dykes", "time": 1556756606029, "rating": 5.0, "text": "No one looks forward to tax season, but Bryan Parker, CPA, and his staff help ease the anxiety of filing the necessary forms on time and with accuracy.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "113060076254201156521", "name": "Kurt de klerck", "time": 1487113171767, "rating": 5.0, "text": "Bryan and his team do fantastic work , they are friendly and they always help you out in case you have any questions . I feel lucky to have them as my accountant and would only trust Bryan l Parker and his team with all my business related items .", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "111032031764538312639", "name": "Marjorie Berguson", "time": 1487122416128, "rating": 5.0, "text": "We feel very comfortable to have Bryan Parker do our tax returns.  He is very prompt and efficient.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "118323878804128032506", "name": "Iceeu (Sonshine)", "time": 1497288955272, "rating": 1.0, "text": "I had to give a star to review Mr. Parker. My. Parker is the Accountant for my neighborhood's H.O.A. I was relatively new to the neighborhood just buying my home 2 years prior to investigating the H.O.A. I was unable to get any financial information from the only board member so I went to Mr.Parker.\nHis Secertary was so kind and very helpful and I appreciated that. She told me Mr. Parker was not in the office after returning from an office. I asked her some questions and she went back and forth to the same office with answers to the question's. I them saw a man comes from the office leaving and got on the elevator headed down. I know this today to be Mr.Parker, as she walked past the man was wearing a T-SHIRT advertising his business Bryan L. Parker Accounting. I later sent him emails requesting his presence at our Association meeting, I never received a reply.\nI realize that all of this blame doesn't lie solely at Mr.Parkers feet, it lies equally at his feet and that of our Association President's feet. I received contradictory answers for questions I asked. As a homeowner I and my neighbors pay a fee to Mr. Parker and as an employee he should have been able to answer everyone of my questions and he did not. It is my opinion and the opinion of many of my neighbors that Mr. Parker made no effort to assist us with any information at all at several different requests and times. To us that is shady behavior.", "pics": null, "resp": {"time": 1501619224990, "text": "This post appears to have some misunderstandings. First of all, whoever was seen walking past, if you were told I was not in the office, was not me. We do not have t-shirts advertising our business so I would question if you were even at our office, since you have inaccurate information. Secondly, we are not employees of the HOA, we are contracted by the HOA board to handle certain accounting functions and provide the board with requested reports. Similar to any business, the reports are disseminated from the top (HOA) to those who need to know. Privacy laws are very strict and we try to adhere to them diligently. If you want more access to information of your HOA, I suggest you become a member of the board. As I understand it, several requests have been made for more board participation but thus far there have been no takers. If you become a board member, we would be glad to share appropriate information with you."}, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "102698727483056600869", "name": "Mike Bennighof", "time": 1487182542317, "rating": 5.0, "text": "Highly professional in all aspects.", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "115538371609515829629", "name": "Jeremy Thompson", "time": 1424922207155, "rating": 5.0, "text": "He got me a ton more back on my personal taxes than doing it myself online.  Will be back next year for sure!", "pics": null, "resp": null, "gmap_id": "0x888923974a207565:0x2ceecc8546a453f4"}
{"user_id": "103743159169962355484", "name": "Sonny Adkison", "time": 1620303441318, "rating": 5.0, "text": "I have relied on The Faircloth Group for approximately 7 years for both business and personal and highly recommend their service.  Nathan and his team have worked closely with us in tax planning, bookkeeping and just overall business planning.  The emails/newsletter keeps us informed of tax changes and deadlines which is a great tool that other firms did not offer us.  They are never too busy to answer a question or email.  Thank you Nathan and your amazing staff for all your hard work and the extra time you take with your clients.", "pics": null, "resp": {"time": 1620306714024, "text": "Thank you so much for the kind words Sonny! We truly enjoy working with great business owners like you and feel very fortunate that we have been able to work with you and your family for so many years."}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "113952655681141985545", "name": "Carlie Fletcher", "time": 1617120205775, "rating": 5.0, "text": "The Faircloth Group has been amazing to work with. As a newer company we were lost when it came to preparing our taxes and doing our bookkeeping. We started off by trying to do things ourselves and realized that we were unable to keep up with that aspect. When we contacted The Faircloth Group they were very friendly and helped us to understand the process. They were able to go back and catch our books up for the entire year and we set up an ongoing agreement to keep everything up to date, taking those tasks off our plates. It was such a relief to find such a great team to handle our bookkeeping, business and personal taxes.", "pics": null, "resp": {"time": 1617122684050, "text": "Thank you, Carlie, for your positive feedback! We're passionate about helping local business owners navigate and understand the accounting process. We're fortunate to work with great business owners like you! Your success is our success:)"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "114162516679868835461", "name": "Joe Kitchens", "time": 1616850653240, "rating": 5.0, "text": "The Faircloth Group is a locally owned accounting firm that does a great job for our company.  They give us the attention we want, give us good advise and work with us in all our accounting needs.  Always professional results and a friendly and helpful staff.  We feel fortunate to be a client for many years with them.", "pics": null, "resp": {"time": 1617022383503, "text": "Thank you so much Mr. Joe! We value your feedback and we're very privileged to have you as a long time customer!"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "101476004303545041779", "name": "My Name", "time": 1617231771361, "rating": 5.0, "text": "After having a bad experience with a past accountant I had asked around for a referral to a good local company, and they came highly recommended. I am so glad that I chose this company as they have been super professional, fast and really know their craft. I cannot wait for me and my company to have more years to come.", "pics": null, "resp": {"time": 1617290975593, "text": "Thanks so much for sharing your experience with us! We're so glad we were able to help you feel comfortable in your transition. We realize that you have choices when it comes to accounting services and appreciate the opportunity to assist you and your business!"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "107173286763322652116", "name": "patrick mcnorton", "time": 1616701891638, "rating": 1.0, "text": "Don't take there word for it if it doesn't sound right look the tax law up yourself. All I have to say either they don't know the laws very well or they will try to make you pay for things that is not necessary.", "pics": null, "resp": {"time": 1616707236258, "text": "Hi Patrick, thank you for your feedback. We're sorry that you were dissatisfied with your experience and that our services were not a fit for your request. Thank you for considering our firm for your tax preparation, all the best to you."}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "117025556550825667477", "name": "James Counselman", "time": 1617222172178, "rating": 5.0, "text": "Great people!", "pics": null, "resp": {"time": 1617290525463, "text": "Great customer:) Thanks James! We always enjoy working with you and your family!"}, "gmap_id": "0x889a6d9d970db82f:0x404216fc1210ae08"}
{"user_id": "107338399881434127972", "name": "Jason Earnest", "time": 1620942935501, "rating": 5.0, "text": "Mrs. Georgianne is absolutely great at what she does! She has helped me with starting a new business, my taxes, and with my retirement account! She is very polite and professional! I would highly recommend her to anyone I know! She makes things very simple and easy to understand. Five stars ⭐️ ⭐️⭐️⭐️⭐️ From me!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "108177877108750958060", "name": "Beau Pendergraft", "time": 1610495609049, "rating": 5.0, "text": "So glad to have found a PROFESSIONAL CPA that I can TRUST to be working in my best interest. Definitely reliable and reasonable! The peace of mind I get from their services is worth every penny!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "112764286491369204340", "name": "Kenny Pollock", "time": 1610396320801, "rating": 5.0, "text": "I love this office!!! Georgianne and her staff are professional, prompt, HAVE THAT NICE SOUTHERN CHARM and really know their stuff. Would leave more than 5 stars if Google would let me.", "pics": null, "resp": {"time": 1611281109406, "text": "Thank you so very much for your kind sentiments"}, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "110867534001793948523", "name": "Amber Pritchett", "time": 1618513250990, "rating": 5.0, "text": "I wouldn't use anyone else for my personal taxes or business.  She has helped is stay on track to grow our new business.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "106594559754501416995", "name": "Kayla Cherry", "time": 1614614183699, "rating": 5.0, "text": "Georgianne is amazing. She is very professional and answered all my questions. I would highly recommend her to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "104698371670000083894", "name": "Steve Pritchett", "time": 1618256913211, "rating": 5.0, "text": "We love tax time now that we have Georgianne and her team. They not only handle our past but educate us and set goals for our future.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "117787453184875423146", "name": "Brandon", "time": 1611278511247, "rating": 5.0, "text": "Mrs. Graves is very helpful and professional, and knowledgeable on tax law. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "103583726524530147455", "name": "Amanda Higgs", "time": 1585680692406, "rating": 5.0, "text": "I have been a client of Georgianne for years and could not be more pleased with her and all of her teams work!! They make my accounting and bookkeeping needs seamless and fast so I can continue to do my job!! Best in the business!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "116946711757294773114", "name": "Niki Craft", "time": 1533605813019, "rating": 5.0, "text": "Georgianne Graves is the BEST accountant there is, and very reasonable in pricing! She truly cares about you and giving you the best service while making sure that you are truly taken care of!!! I will use her and only her! I reccomend her 10 times over to anybody and everyone!", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "109018813346009072101", "name": "Ryan Engle", "time": 1549900781685, "rating": 5.0, "text": "Georgianne got us back more than we expected for a great price! She was very knowledgeable and personable.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "103466813220299570809", "name": "Hannah Cantrell", "time": 1532984330872, "rating": 5.0, "text": "Georgianne is a wonderful CPA!! In the words of my husband \"she makes me feel better about everything!\"", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "107076085337606145307", "name": "mary hart", "time": 1531865568909, "rating": 5.0, "text": "Ms Graves made this years tax experience comfortable, and her office is so cute.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "109605851758335331649", "name": "Bill Hart", "time": 1531865747682, "rating": 5.0, "text": "Georgianne is an expert at working with the IRA for persons not having filed for a number of years.  She really knows her stuff.", "pics": null, "resp": null, "gmap_id": "0x8889f8d6908894c7:0x36fd06ec2ebd1d1"}
{"user_id": "106263652728226155276", "name": "Candy Smith", "time": 1612530256439, "rating": 5.0, "text": "Budget CPA is a certified public accountant who is fairly priced and has multiple certifications. Quality work, quality service, and integrity", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x747069ce4a59b188"}
{"user_id": "106005452237565294538", "name": "zeake13", "time": 1578141293363, "rating": 5.0, "text": "The only people I trust with my taxes and business.", "pics": null, "resp": null, "gmap_id": "0x888c9338a48046c7:0xffcdc1110479d98e"}
{"user_id": "107123056540516683776", "name": "Megan Tollefson", "time": 1488913989341, "rating": 5.0, "text": "Hilyer & Associates have been doing my taxes for the last few years now. Very helpful and kind. Thank you for all you do!", "pics": null, "resp": null, "gmap_id": "0x888c9338a48046c7:0xffcdc1110479d98e"}
{"user_id": "105918788846928736101", "name": "Mark Cecil", "time": 1528202217617, "rating": 5.0, "text": "I have been using various accountants since 1986. For the first time ever I feel like I am in good hands. Alexis Willis always calls me ahead of deadlines and believes that the details matter. She takes very good care of me.", "pics": null, "resp": {"time": 1529527353153, "text": "Hi Mark, thanks so much for taking the time to leave us with this fantastic review! We are so glad to hear that Alexis has been such a great help to you. Have a marvelous day!"}, "gmap_id": "0x889a0def50699735:0x9ad5659b73a03edd"}
{"user_id": "107181829472748152542", "name": "Charles Hansen", "time": 1518037835527, "rating": 5.0, "text": "Best CPA organization around! I highly recommend and trust Bandura CPA for any of your tax needs.  Everything he does is very professional and very timely with prompt responses.  Anthony is very knowledgeable for any type of question you may have.  I have referred my family, friends and co-workers for their services.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "113525368422848772565", "name": "Andy Gagliano", "time": 1466087973733, "rating": 5.0, "text": "I have known Anthony Bandura with Bandura CPA, LLC for many years now, and I highly recommend his services. Anthony has an exceptional knowledge of the tax laws and how those laws apply in the real world. He also has a very strong business intellect as well, and he knows what it takes to make a business profitable no matter the industry or business classification.\nI highly recommend Bandura CPA, LLC for any business owner who needs help with their bookkeeping and tax filings.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1457019754115, "rating": 5.0, "text": "I have worked with Anthony before and everyone I have sent to him has been amazed at the work he does. He gets the work done fast and he is very reasonably priced. his knowledge of quick books is extensive and he has a lot of friends in the IRS so he can help you out if your about to get audited. My firm has Anthony listed in our referral page because we trust our clients to Bandura CPA LLC. Chris Reid,", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "116105108382431027559", "name": "Ken Sawyer", "time": 1521212215754, "rating": 5.0, "text": "We always receive expert advice and prompt service from someone who takes the time to really understand our business, We could not be happier  and highly recommend Bandura CPA!", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "103422800922355968694", "name": "NDT Tech", "time": 1518037921594, "rating": 5.0, "text": "I highly recommend Bandura CPA, LLC for any business owner or individual who needs assistance with their bookkeeping and tax filings.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "109981955826356170249", "name": "Alex Espinosa", "time": 1518711961673, "rating": 5.0, "text": "Very Professional and quick response from them.", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
{"user_id": "101858859352818477329", "name": "candi campbell", "time": 1523927267987, "rating": 5.0, "text": "Thanks for all you do", "pics": null, "resp": null, "gmap_id": "0x888922409db571c7:0xb2a582d9fda31593"}
