{"user_id": "103719422549390883461", "name": "Ronnie Denney", "time": 1558388671733, "rating": 5.0, "text": "Great new inside lighting and fans. In the next few weeks will get a big paint job. Inside and out.", "pics": null, "resp": null, "gmap_id": "0x888bbbee77c9716b:0xe722d703c2351295"}
{"user_id": "109705592634044982899", "name": "David A. Reaves", "time": 1578705038824, "rating": 2.0, "text": "Let me start with the Chalet...be prepared for an up hill hike just to reach cabin 12, 13 or 14...kinda tough on us old people. Parking placed closer to the door could be an easy fix. Was looking forward to a warm cozy fire in the beautiful rock fireplace only to be totally dissatisfied with a tiny set of ugly, dirty gas logs that I had to get down on my knees and light the pilot light several times to get a pitiful unrealistic fire. I would much rather enjoy a real wood fireplace in a lovely mountain cabin but if you have to use gas logs, at least get a larger (30 inch), more attractive set with remote control. The gas log industry has many lovely and user friendly sets to choose from now days. Also it makes poor business sense to incur the expense of buying gas logs, purchasing propane and the other expenses that go along with providing gas logs in the cabins (and everywhere else on the entire property) rather than having no expense and selling firewood (for a profit) to customers who could build their own real fires and enjoy the beauty and smells that come with a real wood fire.\nSomeone is really missing the target of providing a mountain resort in one of the most scenic places in Alabama. Get rid of those ultra white LED light bulbs in the Chalets. Nothing can screw up the moods and views through the beautiful floor to ceiling windows  more than those ugly, blaring, sterile white lights. LED lights are available in softer tones similar to the incandescent light bulbs of old. No more white lights!\nYou can save money with other LED bulbs.\nChalet #14 has some kind of hot water problem. After letting the hot water run for 5+ minutes, the water was only luke warm, yet 5 minutes later, turn on the hot water again and it was scorching hot. Something wrong here.\nNow for the restaurant...breakfast food and service both were pretty good. Enjoyed both looking at the most stunning mountain view in the state..\n.. eating off of paper plates and cups with plastic silverware. They explained they have a \"water shortage\" and only washing certain items. We live 70 miles away and are having the wettest year that I can remember in some time. Go figure.\nAnyway, dinner was a whole other subject. Ordered Fried cheese curds for appetizer with Ranch or Marinara sauce.\n\"Couldn't find any Marinara sauce\"...Sorry.\nOrdered a carafe of wine...after ten minutes of waiting the waitress called for the Park Ranger to come open the wine bottle. Seems that they couldn't get the cork out of the bottle.\nDecided not to order dinner and left.\nWe love our State Parks! These places are beautiful and are located in the most scenic vistas in Alabama but for the two days we were at Cheaha, we only saw 2 or 3 other people staying in the lodge or Chalets.\nWhomever is in charge of our State parks is doing a sorry pitiful job of making these resorts enjoyable to us, the state taxpayers .\nI am saddened and embarrassed that our state is not doing a better job with our properties. If our State parks were privatized, I am sure that these facilities would regain their once magnificent status.", "pics": null, "resp": null, "gmap_id": "0x888bbbee77c9716b:0xe722d703c2351295"}
