{"user_id": "112906954687000494213", "name": "soylent green", "time": 1574123441700, "rating": 5.0, "text": "I do business here five days a week so I know these people. They are a pleasure to deal with and are always smiling. For me (a guy) its especially nice that all the women are beautiful and charming. One of my favorite stops.", "pics": null, "resp": null, "gmap_id": "0x8889e45ec5ac1ec9:0xdc77265c11d19d8a"}
{"user_id": "116179052768944216007", "name": "mario grigorov", "time": 1542123612879, "rating": 1.0, "text": "Too much is waiting !", "pics": null, "resp": null, "gmap_id": "0x8889e45ec5ac1ec9:0xdc77265c11d19d8a"}
{"user_id": "102902629484937495835", "name": "Dwanda Schwarz", "time": 1566232782616, "rating": 1.0, "text": "We called to buy supplies for our business. The lady who answers phones has no clue about any of her products and when I asked repeatedly how could I buy from them or who do I need to speak to she would just reply \"I don't know\". And acted like I was bothering her day. I thought I was calling a business, one in which was in business to sale products.\nYou think the lady answering would have some knowledge on how to buy it. When she continuously repeated her lack of knowledge of her product I said, \"that's ok, I guess we can come in and place a stocking order\". She said, \"oh no, were not walk in\".\nSo I asked well is there someone I can talk to?\n\"Oh (some man). But he's busy.\"\nShe does not take my number so he can call back or give me a number to someone who had a better knowledge of their business and services.\nVery unprofessional.", "pics": null, "resp": {"time": 1566234869557, "text": "Dwanda,  are you sure you have the right company.  We are a family run business and treat all call ins with the upmost respect.  I handle sales for the company and always get messages when people call to learn more about our products.  I apologize if this happened and would be available to chat and help you locate our products.  Kind Regards, Sean"}, "gmap_id": "0x889a4183ae6321d9:0x4f698fe9f2e83282"}
{"user_id": "118322949504111247977", "name": "David Blackburn", "time": 1583470511946, "rating": 5.0, "text": "Great cleaning product and top notch customer service. We have been using them for years.", "pics": null, "resp": {"time": 1583506745400, "text": "Thank you, David for the kind words!"}, "gmap_id": "0x889a4183ae6321d9:0x4f698fe9f2e83282"}
{"user_id": "106904778607650862576", "name": "Ernest Bentley", "time": 1594841613154, "rating": 5.0, "text": "Excellent products and great people!", "pics": null, "resp": null, "gmap_id": "0x889a4183ae6321d9:0x4f698fe9f2e83282"}
{"user_id": "108964357947641957683", "name": "Dalyn Tolbert", "time": 1583118633507, "rating": 5.0, "text": "Great company to buy products from!!!", "pics": null, "resp": null, "gmap_id": "0x889a4183ae6321d9:0x4f698fe9f2e83282"}
