{"user_id": "101985505293882074514", "name": "V H", "time": 1628710750480, "rating": 1.0, "text": "I called this daycare simply asking if they had any openings. The girl that answered said they had 2 openings and even wanted to see if I could come in to tour the facility. I then advised my son was dx with autism and if they were they inclusive. I was placed on hold. The director picks up and says they don’t have any openings and that the two positions had been filled and paid for. Oh, really? Funny, how when I was transparent the conversation changed. I would have appreciated it better if they would have simply said they are not equipped. Even though my son is not aggressive, he simply needs a little bit more hands on attention. I would’ve preferred er an honest answer versus what I was given. I would never try to enroll my son somewhere where the teacher and staff where incapable of meeting his needs.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105293497763588398661", "name": "Ami Joy Scarbrough", "time": 1596469385384, "rating": 1.0, "text": "I’m literally sitting in a place that mandates marks AND a statewide mandate is in place while a director ahd I assume a franchise owner are sitting in a public place discussing COVID19 guidelines with no masks! I’m not a fan of masks either but this certainly doesn’t give me much reassurance that my child would be safe at AK if two individuals in management don’t take the County and State Health department mandates seriously. It’s a shame because I’d planned on enrolling my son after having visited before COVID19. I think I will pursue other avenues.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "100925917018523557513", "name": "Sabrina Miller", "time": 1569274483583, "rating": 5.0, "text": "I am very grateful for the School For Amazing Kids' staff (including Tina, Dana, and Teresa).  My son has a new diagnosis of autism (high functioning), and they have been very helpful with helping him through his separation anxiety and speech delay.  They personally directed us in the right direction for his speech, and  have went out of their way to comfort him when he has a break down.  Their reassurance has helped me tremendously. They all are a huge blessing to us.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "109769568946250490366", "name": "Morgan Stepek", "time": 1569274917265, "rating": 5.0, "text": "They have been a wonderful change from our previous childcare. We love the teachers and directors. Everyone has been so caring and helpful. The atmosphere is truly child focused and my son is so much happier!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105662675913979288642", "name": "Bethany Aultman", "time": 1570799271727, "rating": 5.0, "text": "This school does truly live up to its name! It is absolutely amazing. My son has attended here since 2017, and the care he has received has been incredible. His teachers from previous classes still come and check on him. I honestly don’t ever worry about him during the day, and I know he is being loved on while I have to work. I would honestly be lost without this daycare! My son tells me all of the time, “ thank you for sending me to school today.” He’s 3!!\nThe staff and directors are pretty amazing too!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "113958667329379467599", "name": "Benjamin L", "time": 1509653625995, "rating": 5.0, "text": "My wife and I love The School for Amazing kids. We just had our first child this year and we knew going back to work would be tough. He started at 10 weeks old and has done fantastic in their care. He is 6 months old now. We couldn't ask for better people to be watching our newborn. I feel very safe leaving my son their each day because I know he is in good hands. I like knowing they have a camera system installed throughout the building and that no one can check in or out with out providing a finger print.\nTheir hours each day are long enough to give us time after work to get there and pick him up. They keep track of when he eats and sleep. It's like getting a report each day about his day. The staff in the infants room is fantastic! They stick to the feeding schedule we requested and will do anything we ask.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "103609490675210709345", "name": "Courtney Shugart", "time": 1535321244470, "rating": 5.0, "text": "This is truly the best daycare. We started our girls here back in February and the difference in my three year old has been night and day. We struggled a lot before with her listening and following direction. Since starting Amazing Kids, she has blossomed. She listens to us now and loves to follow directions. She loves her teachers and constantly talks about them and all they have taught her.\n\nNot only has this daycare program helped our daughter, it has helped us too! The teachers are always more than happy to answer our questions and give us guidance when we need it. They offer such a nurturing environment for our children. We were so nervous in the beginning, as we had always had our girls kept at home but, the staff at Amazing kids made the transition much easier than I ever imagined. They answered all the crazy questions we had and never once made us feel like we were overthinking it. They have truly become a second family for us and our girls.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "109016015818727086592", "name": "Todd Mashburn", "time": 1423755122598, "rating": 5.0, "text": "We absolutely love Morningstar!  The staff and teachers that work there are awesome and they always have a smile on their face!  They are great with the children and our child can't wait to get to \"school\" every morning.  We also like the fun, seasonal activities that Morningstar provides for both the children and the parents.  These activities allow for the parents of the children to get together, to meet and talk to the teachers and for the children to have an awesome time playing!  We highly recommend Morningstar Child Care if you are new to the area!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "101988841145153303609", "name": "Erica Roberson", "time": 1554296503582, "rating": 2.0, "text": "Walked in to my son’s classroom one day to find him on the floor of the bathroom with his pants down, door open, and a kid pointing and laughing at him. The teacher sat at her desk and did nothing. I asked for security footage to be reviewed and was told it was a live feed and not recorded. I’m giving more than one star because the director assisted us all he could and I understand there’s not much you can do when you don’t have evidence. My son had a few good teachers, but there was one that he said was really mean to him. He’s doing much better now that he’s in public school.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "106602396844289446026", "name": "Katrina Ackerman", "time": 1406259112506, "rating": 5.0, "text": "We absolutely love Morningstar Daycare. As, first time parents, it was important for us to find a place that we were comfortable with dropping our girl off at.  The teachers really seem to care about each and every child that comes through those doors. It is reassuring to see your child smile when you hand her over to the teacher. We could not have chosen a better place for your daughter to go!  Hands down the best place!!!!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104844221744970119888", "name": "Brandi Hicks", "time": 1417038465704, "rating": 5.0, "text": "My daughter started attending Morningstar 10 months ago and we have been extremely happy.  We have grown to know and love the teachers there and were welcomed with open arms.  It is so comforting to know that my child is in great hands while we are at work.  Many of the teachers have become just like family to us and are so kind and caring.\nThe education that she is given at Morningstar has been wonderful in getting her prepared for 5K next fall.  We are so thankful for Morningstar and their staff.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "108797649337013205711", "name": "RaNetta Underwood", "time": 1474909316439, "rating": 5.0, "text": "Caring Staff\nIt is a very hard and even an emotional time when a parent drops their child off for daycare for the very first time and this was definitely the feeling I had when I had to finally go back to work after spending 9 wonderful weeks with my newborn; but I will say that taking her School for Amazing Kids, Calera made that transition just a little more easier than it would normally be. I remember the first day, her lead teacher, Crystal, welcomed us with a very warm greeting and immediately took my daughter for a first time bonding moment. At that moment, I knew I had made the right choice in child care for my daughter.\n\nThe staff is so friendly and they speak every time you see one of them, even if they are not the teacher of your child. They really love on the children and it reflects heavily with my daughter when I can drop her off with no hesitation from her. She happily goes to the teachers and I feel like they really care for her and her well-being. They are as well caring of the parents, by offering conversation every time you are in their presence. This is the kind of relationship that you want when you entrust your child with a child care facility for more hours than they are at home with you.  This was the most important thing to me when I was looking for child care and I know I found it in School for Amazing Kids, Calera.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105788619074884303182", "name": "Kevin Taylor", "time": 1509738718438, "rating": 5.0, "text": "I really like the School for Amazing Kids located in Calera. The school is super accessible and conveniently located for parents that have to work. It is a very good value for the money that you pay and what you get out of it. My wife and I are paying less here for my two children to go to this school where they LEARN than our previous childcare arrangements. Best of all they have a full school schedule. What I mean by that is I don't have to take off from work to watch my kids because they are closed.\n\nOn top of ALL that value the school is great because of what my children have learned and how they have developed academically. I know they will be ready for the next step. The staff is great, my kids and myself enjoy all the teachers; especially Mr. Jonathan.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104388354297591062318", "name": "Cory French", "time": 1500384762154, "rating": 5.0, "text": "Our family is very pleased with School for Amazing Kids in Calera, Al. The location is excellent, right off 65, and is very convenient for dropping off before and after work.  The teachers are awesome and they really take the time to work with each child.  Our child has transitioned from the bottle to a sippy cup/table food and has started walking with ease, because the teachers have really invested time with her.  We highly recommend School For Amazing Kids.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "100494866314545458784", "name": "Kendall Collum", "time": 1444864935884, "rating": 5.0, "text": "Morningstar is an awesome place to send your kids to daycare. Within a week, my son (3 years old) was able to recognize words and letters and my daughter (1 year old) knows where her eyes, mouth, nose, and ears are. Every staff member is genuinely concerned with the children there and it shows! I would recommend Morningstar to anyone!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "114237533627667812775", "name": "SoulofBleuz", "time": 1433296444168, "rating": 5.0, "text": "My husband and I absolutely love Shepherd's Promise. Our son was 7 months old when he started at the daycare. Needless to say, we were nervous because his grandmother kept him for us during the day while we worked. Little did we know, our precious bundle of joy warmed right up to his teachers as well as his fellow classmates.\n\nSince attending Shepherd's Promise, our baby has become so independent. It is hard to keep up with him! The teachers are so nurturing which made the transition for our son easy. We highly recommend this great daycare to new parents. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "101138586749935998975", "name": "E Atkinson", "time": 1423797477688, "rating": 5.0, "text": "Morningstar is just what we were looking for, close to home and a clean and safe environment for our child. They offer many great programs and activities during and after business hours such as parent lunches and parents' night out. Who doesn't need that?? My child loves getting up to go to school and see his friends. Walking into his room, there is a list of what they are learning for the week, which even includes a bible verse. I also love when my child's artwork gets to come home with us. It is those things that I will always cherish. Thank you Morningstar for loving my child as much as I do.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "118190968104715445350", "name": "Katie Allen", "time": 1433438983209, "rating": 5.0, "text": "I absolutely LOVE this child care facility or should I say SCHOOL. I bounced my son around for a while from daycare to daycare and the \"teachers\" weren't taking time with him, he wasn't learning what he needed, wasn't getting the attention he needed and I was about to throw my hands up until I found Morning Star. It is perfect, he gets up in the mornings ready to go see his friends and teachers ( which he never ever use to do ) and he actually had a struggle with his colors for a while and once he got into a classroom at morning star with his amazing teachers he just stared coming home each day, learning something new and he was so excited and I am so proud of him he now comes home and knows his colors! So thank you to his awesome teachers and such a fun learning facility for my son!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104111556044705391971", "name": "Jetta Johnson", "time": 1406303337150, "rating": 5.0, "text": "We love Morningstar!  My child has been there since she was 8 weeks and we've had nothing but positive experiences in 4 1/2 years. I can't imagine going anywhere else.  The teachers are great and is nice that most of the children have been there as long as we have.  We've basically all grown up together like family.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105510942630776563837", "name": "Amy Lynn Butler", "time": 1407007894478, "rating": 5.0, "text": "My 2 ½ year old toddler is ready to take on the world! And Morningstar Daycare supports his desire for discovery and need for independence, while also providing a sense of safety and security.\nIn his present class, the teachers actively partner with the parents to help your child learn important independent life skills, such as potty training and hand washing.\n\nI really like the balance they have with teaching: Child-Initiated: the children play and explore throughout their day, and they develop an understanding of their world. And Teacher-Guided: Teachers use a developmentally appropriate instructional framework to help stretch children’s minds by demonstrating, asking questions, encouraging and guiding.\n\nMy child has been going to Morning Star for over 1 1/2 years. I love it that every day he comes home with a new art project he did, or singing new song, sharing something new he’s learned.  I know at Morningstar my child is learning and thriving, happy and safe.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "113314655421421145470", "name": "Brooke O'Brien", "time": 1423756967489, "rating": 4.0, "text": "Our first child started with Morningstar when she was 9 months old.  I was a new mom and was not excited about leaving my child with strangers for 10 hours a day.  In addition, my family is not religious, and I'm an atheist, so I trying to find a secular daycare in my area was next to impossible.  We looked at multiple facilities and ultimately settled on Morningstar.  While I'm not keen about the religious instruction (biblical stories and praying at meals), the facility is always clean and the teachers are well mannered, and trained in early childhood development.   The facilities are kept up-to-date with new equipment and decor.  The directors are always happy to listen to my latest worry or concern about my daughter, her behavior, or the latest news of the day.  Parents are allowed to visit for meals and their adoption of a \"parent's night out\" is a treat my husband and I look forward to each month.\n\nMy daughter is now 3 and the teachers understand when to introduce structured discipline.  My husband and I have started using the same techniques at home so that my daughter can have consistency and a better understanding of what's right and wrong.  When my son recently joined our family, there was no question where he would go.\n\nWe have had incidents in the past of biting, falls, sickness, etc. and the staff were always prompt in notifying me and informing me of any additional needs they have.  I am completely at ease with my kids being in their care and know that they love them as much as I do.\n\nI would like to see more teachers in the classrooms, but they are following DHR guidelines for adult/child ratios.  However, I understand what that would mean for tuition rates.\n\nMy daughter is well cared for, well mannered, well educated, and well socialized (as a 3 year old can be).  And for that, I'm willing to put up with some minor annoyances about religion from time to time.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "117227606683738909208", "name": "Peggy Huckabaa", "time": 1423837483195, "rating": 5.0, "text": "My daughter started at Morningstar Child Care when she was 9 months old. She loved going to school, playing with her friends, and seeing her teachers. She graduated from 4K with a beautiful ceremony that my grandparents still talk about today. Since they are currently in their 80's, they will not have the opportunity to see her graduate from High School. It was a moment we will all treasure.\n\nMy daughter still stays in touch with some of her friends she made at Morningstar. She is now a First grader. Her Kindergarten and First Grade teachers have made comments on how advanced she is compared to some students who did not go to Morningstar. Her reading and math levels are above the expectation for each semester and in some circumstances even for the year. Morninstar gave her a great start to her education. We are extremely happy with the love, care, and learning Morningstar has given her.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104464780234480036300", "name": "Diana Sprayberry", "time": 1423774093871, "rating": 5.0, "text": "I absolutely love this daycare.  My child has been attending Morning Star since he was 2.  If I have ever had any issues they have always been very helpful and resolve the situation. I would recommend this daycare to anyone..", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "108384461223185409576", "name": "Kelli Kirk", "time": 1406042803582, "rating": 5.0, "text": "Both of my daughters attended Morningstar for a combined 3 years and I can't say enough about the teachers. My girls have learned so much in their care. My oldest has excelled in kindergarten this year and I have the amazing teachers at Morningstar to thank for that.\n\nIf you're looking for excellent childcare in a warm and caring environment, look no further. Hands down, the best childcare center around.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "117819684952928400096", "name": "Crystal Evans", "time": 1448249252576, "rating": 5.0, "text": "From a dads point of view\nI wanted a place that was safe, close to home and that would teach him. Our son is being cared for by teachers that truly care about him. I like the daily sheet that's sent home each day about his day. I appreciate that the teachers are actually teaching and not just watching him. KJ is\nlearning a lot at Morningstar and I feel that it will pay off when he starts grade school by attending Morningstar. We also have a daughter who's now in third grade who attended Morningstar and she's an \"A\" student... # school forAMAZINGKIDS", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "116859668458003607073", "name": "Abby Johnson", "time": 1423766585943, "rating": 5.0, "text": "Morningstar is a wonderful daycare.  I have 1 boy that currently attends Morningstar and one who left 4k in August to start Kindergarten.  The staff does a great job at not only teaching the children, but making it FUN!  Because of the wonderful staff in 4K, my kindergartener is way ahead in his class and is currently reading on a 1st/2nd grade level. I would and have recommended Morningstar to anyone who is looking for not just a daycare, but a preschool for their child.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "117199467805225833307", "name": "Mom of One", "time": 1407273809998, "rating": 5.0, "text": "My little tike has been attending Morningstar for nine months. To say that he loves it is an understatement. Each morning he wakes up saying \"go school\" and is disappointment when it is not a school day. When he sees the building he starts singing \"school, school, school, yeah!\" He loves going to \"school\" and we love that!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104111481299569271122", "name": "Erica Jones", "time": 1406220287543, "rating": 5.0, "text": "I would absolutely recommend Morningstar Child Care to any parent!\n\nI am a single, working mommy of three boys. My life is a whirlwind of church, work, sports, and - of course - the never-ending list of household tasks.  After unsuccessfully trying a few other centers, I was disheartened that I couldn't find a center that my youngest would love to attend...\n\nMorningstar has hands-down become that center!!  Cason (who used to cry every morning for an hour at other centers) eagerly waits by the door at our house for ME to get ready to leave in the morning.  He LOVES his teacher AND his new friends.\n\nI also ADORE the paintings and crafts that he brings home.  He has mastered his colors and enthusiastically talks the entire way home about the things that he has done that day!  I love Morningstar, and I feel confident that you will too!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105560449602812627301", "name": "Douglas Stevenson", "time": 1507332605080, "rating": 1.0, "text": "The employees at this daycare would rather try to sweep issues under the rug than deal with them. Our daughter was bitten by another child five times in the four months since moving into the infant D classroom. In early September it happened twice in one week, and that's when we finally decided to have a meeting with the office. We met with the assistant director Jonathan, and he tried to tell us that it is normal behavior and that none of the bites were aggressive. He also informed us that the daycare has no official policy when it comes to biting, other than simply informing the parents of all children involved that it happened, and perhaps additional meetings if it becomes an \"issue\". On Monday, October 2nd, our daughter was bitten again this time on the face. The teacher who was working the room that day informed my wife that the same boy who had bitten my daughter that day had also bitten two other children, and that it had been a consistent problem with this one child and the office and his parents knew about it but refused to take any real action. I had a meeting with the assistant director Jonathan the next morning, where he informed me that two of the bites were \"not aggressive \" because the children that were bitten we're trying to take a toy away. Later in the same conversation, he backtracked and claimed that there were not three bites in one day, and the information we were given was incorrect . Later that same day, my wife met with the director Brittany who informed her that there actually WERE three bites in one day, and that Jonathan knew about that and she's not sure why he would have told me that there weren't.\nWe understand that biting is an issue that is going to arise at most daycares, but we want to know that action will be taken when it becomes a clear and present problem. I also don't appreciate it when somebody looks me in the eye and lies to me. Parents trust daycares with the safety of their child, and they deserve to know what's going on.", "pics": null, "resp": {"time": 1507649052509, "text": "We sincerely regret that you and your family had a negative experience at School for Amazing Kids, Calera. As caretakers, we constantly strive to become more nurturing to children in our care and to better communicate with parents. Unfortunately, biting is common among babies and toddlers and we try our best to stay aware of when it happens and treat all children involved with the proper care. However, we always have room to improve. We appreciate your feedback and resolve to look into this matter more closely."}, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "116853981651728870176", "name": "Liz Walker", "time": 1345899544333, "rating": 5.0, "text": "When I asked my two-year-old this summer if he wanted to stay home and go to the pool with mommy or go to \"school\" (at Morningstar), he said, \"school.\"  I think that explains it all!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "111143771922235603499", "name": "Olivia Attical", "time": 1423787341182, "rating": 5.0, "text": "This is the best child care facility in Calera, AL in my opinion my child has grown to love the kids and the staff. The facility is very clean and neat and actually looks like a school. The atmosphere is amazing they make you feel so welcome. They provide a very nutritious meals which includes breakfast, lunch and snack so you don't have to worry about providing any meals. Another important part about that is that it doesn't cost any extra just for the meal that is all included in the tuition. The curriculum that they are teaching I feel is awesome to help your child adjust to school. My two year old has learned so much in the past 5 weeks that I was amazed. All the hard work and dedication that those teachers put into their jobs really shows when you interact with your child on a daily basis.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "115624620000957645011", "name": "Erica Arnold", "time": 1423761180420, "rating": 5.0, "text": "When I think about quality child care, one of the first things that come to mind is that I don’t want to have to sacrifice good care for my child(ren) at the sake of cost. And I was so happy when I realized that would not be the case at Morningstar! My children and I love the daycare employees, and I love that they get excellent care on a great budget.  Their prices are so reasonable, and this is the only daycare I have ever been in contact with that offers a military discount to families! That is AMAZING! But also with quality care, that is cost-reasonable, I worried about location. Morningstar’s location is great for parents who commute because it is right off the interstate. It is very easy to drop off my child and get right on the interstate to commute to work in the mornings.  And the facility is always How great that they support our troops in that way! As a military family, we couldn’t appreciate that more!\n\nBut also with quality care, that is cost-reasonable, I worried about location. Morningstar’s location is great for parents who commute because it is right off the interstate. It is very easy to drop off my child and get right on the interstate to commute to work in the mornings.  And the facility is always kept clean. The outdoor grounds are nice and there is a very nice playground for the children!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "113060076254201156521", "name": "Kurt de klerck", "time": 1509738021515, "rating": 5.0, "text": "We were blessed to find school for amazing kids in calera when we moved to shelby county. Joshua has been attending sfak calera for almost 5 years !! now and still ,every day ,are we amazed about how much our son knows already for his age. he speaks very well, he behaves, he knows how to write and work with numbers already ! knows songs, days of the week etc... all this can only be achieved by staying busy with the kids . He likes to go to sfak calera, he does soccer, a guitar man comes over once a week to play songs, the have festivals and career days etc..\nif you have the opportunity to have your child taken care off in a daycare, sfak calera is the best place to be !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOsXxwEtfohb5Knwedw0afGrRqUUF2LQBC6Yna0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "110464883060595520891", "name": "Shirley Sanderson", "time": 1505677440349, "rating": 1.0, "text": "Saw roaches and mice droppings in kitchen and the kids milk being left out too long", "pics": null, "resp": {"time": 1507649290556, "text": "Going back to December of 2016 we have scored no less than 99 on all health inspections. Our last inspection was conducted in June of 2017 in which we scored 100. If you have legitimate concerns about the cleanliness of our facilities we are happy to provide this documentation and speak with you in detail about this matter. Please call our main office at 205-620-1725."}, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "102032324944818337779", "name": "Bruce Trowbridge", "time": 1628343803976, "rating": 5.0, "text": "My 94 year old mom fell and fractured her L1 vertebra the day after Christmas.  She was bed ridden for a couple of months due to the pain, and after the fracture healed remained bed ridden and on oxygen due to progressing congestive heart failure.  This lasted almost 6 months until she passed, with the last 4 months under in-home hospice care.  My mom lived with me, since she (and the rest of the family) did not want her last days to be in a nursing home.  I am a single man and with the constant care my mom required, I could not handle it on my own, I needed caregiving help.  I contracted out 60 hours every week for caregiving and I took the other 128 hours myself.\n\nI contracted with BrightStar based on recommendations from friends, and I was not disappointed.   BrightStar provided qualified care givers, and if mom and/or did not relate well with a particular care giver, BrightStar would provide a different one.  We eventually evolved to a core set of 2 regular care givers, loved by my mom and I,  covering all 60 hours per week.  I don’t know if other companies would be this flexible and supportive.  If a regular caregiver could not come, BrightStar would notify me and fill the gap, so that I could always count on a caregiver at my home at the planned schedule.  Knowing that a caregiver will be there, rain or shine, is a major consideration when determining if you want to hire a known private individual or a company with lots of caregivers.  Additionally, BrightStar schedulers, nurse, business office personnel were always a pleasure to work with and very supportive of mom and I during these trying time.  BrightStar may not be the cheapest, but you can count on them, so you just set your hours to what you can afford.  I highly recommend BrightStar, and if the need for caregiving arises for me in the future, I will be calling them.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115435683279121778426", "name": "Mary Cashulette", "time": 1605815190430, "rating": 5.0, "text": "I had a horrible infection. This group is unbelievably professional and caring. Christy Jones came up with the idea of using a vac. My surgeon didn’t think about that. I trusted Brightstar more than him and was able to heal well. Thank you so much! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "101067890724144030572", "name": "Anna Elizabeth Jones", "time": 1454361694232, "rating": 1.0, "text": "100% client oriented.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115534002393895043325", "name": "Tati Monű", "time": 1517447395292, "rating": 5.0, "text": "Great place great staff and caregivers", "pics": null, "resp": {"time": 1517540339926, "text": "Thank you!  We are pleased to be able to provide our services to the local, Huntsville community!"}, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "109452318790210321813", "name": "Beverly Doyle", "time": 1620050622138, "rating": 5.0, "text": "My son has enjoyed the transition to BBMA and they have been amazing through the entire pandemic. I appreciate their efforts to keep the kids safe!", "pics": null, "resp": null, "gmap_id": "0x888c933b5eb14285:0xfd9870e1e09f7486"}
{"user_id": "116805157457535040004", "name": "Malena Warren", "time": 1624056935500, "rating": 1.0, "text": "My daughter attended the location in Madison. The staff there lacked the training, education, care or simply the common sense to recognize that my child was in respiratory distress. In fact one member of staff stated “yea I was thinking it was asthma”. They did however recognize that she had a fever. To add insult to injury they have yet to call and check on her as we continue to sit in pediatric ICU for now 3 days. I excused A LOT of the behaviors this location displayed from loosing my child’s belongings, to putting other children’s belongings on my child repeatedly, to giving her foods they were told not to give her, but not recognizing that a child is not breathing well is inexcusable!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "116009046360017387272", "name": "Anna Kinton", "time": 1615410955554, "rating": 1.0, "text": "My daughter was one of the first kids to start attending when they opened the first location. In the beginning, it was great! It was what I as a single mother desperately needed. It went downhill fast.\n\nThere were many times that the meal I sent with her was not used and they started charging me for the extra meal. I had to work at putting a stop to this. The meals, at least in the beginning, were told to me as being \"organically catered\" but that was clearly not true or had fallen away pretty quickly.\n\nAt the time, we were vegetarian - which was on her paperwork and discussed with the owner. But I learned from my reluctant daughter, who was worried she would be in trouble, that there were many times she would be required to finish her whole meal to get dessert, which included chicken nuggets. That is a ridiculous position to put a small child in.\n\nWhen I reached out via email to discuss the issue, one of the co-owners - Joey - essentially said I was lying and said no child is ever forced to eat something they don't want and did not investigate it or properly address the issue. Funny, because he wasn't even there most of the time. I still have those emails to this day.\n\nThere was also the issue of her meds not being given to her and being routinely \"forgotten.\"\n\nDebra-someone rose to being in charge and she was a very cold and rude person. Despite always paying my bill on time and being one of the original customers, she began requiring me to prepay - something which other parents I spoke with did not have to do. But interestingly enough, it was after I had raised concerns about the food issue and then the medicine issue.\n\nAt one point, I had to be out of work for a month because my daughter had caught from the daycare strains of influenza, strep, staph, and had a full blown case of MONO. I had never heard of anyone having mono younger than a high-schooler! It was made obvious then that they do not clean well enough.\n\nThe last and final straw was the lack of care and protection from the teachers. Despite being the older kid most of the time, she would get hit a bunch by the younger ones. She would tell the teachers who in turn wouldn't do anything, or she would be the one who got in trouble. I tried coaching her on how to protect herself and what to say, but she had a huge fear around doing anything and getting in trouble. No matter what she did, she said she got in trouble when she tried to stop from being hit or complained about it.\n\nI pulled her out and never took her back. She's almost 13 and still talks about how glad and relieved she is to never have to be at daycare. And sometimes I learn new things about her time there, and I overall regret that she spent any time there since it has been such a shadow in her mind.\n\nThis place can't even do the basics. I would never recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "102478510957492773121", "name": "Joseph Ayers", "time": 1532484043373, "rating": 5.0, "text": "Awesome child care option! My kids love it here. They love the sweet teachers. They are always bringing things home that they learn about. They are very happy to be dropped off. I feel safe here. It’s new and nice. They always adjust if I need to drop to part time or even if I need time off. Our area is so lucky to have this child care option!!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "118195363127870321472", "name": "Sybil Gibbons", "time": 1458054945674, "rating": 5.0, "text": "Like some families we do not have family here and KidTowne has helped so much. When we needed a full-time daycare at the last minute KidTowne was there and welcoming. Since our youngest has started school we only need KidTowne during school breaks and whenever mommy and daddy want a date night. Thank you so much for all of the hard work the many conversations and kindness Ms. Deb, Andrew and David.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "112852574436978280579", "name": "Shivonne Smith", "time": 1501620217578, "rating": 1.0, "text": "First let me say that this daycare was what I considered to be, my lifesaver in the beginning. This was primarily because of the extended hours of operation. I was working a job in Retail at that time, and did not have the luxury of people lining up to care for my child while I worked. Long story short.....   Several instances where I would pick up my daughter to find her face, nose, clothes, etc. FILTHY. Not once or twice, but over 15-20 times. I always provided change of clothes but they were NEVER used. She was always very thirsty and hungry-as they do not serve dinner until 7 p.m.\nI emailed the Director to schedule a meeting with her and the owner, to which she took days to reply. One day before the such meeting, I walked in to find my daughter with a snotty nose as an employee crouched in the corner texting on her cell phone. I was later told that BOTH owners were just TOO busy to meet with me so I sat down with the Director only. She assured me that things would improve. One being their extremely high turn over rate-that did NOT change. My daughter no longer attends this daycare. Please PLEASE do not leave your children with these people. On my daughter's last day there, while not being attended to; another child in her over 2 1/2 yr room shut her hand in a door!!! The Director nor either owner EVER called to say \"I'm sorry\", \"How is she\"... NOTHING.\nActions speak VOLUMES.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "111205050632765327637", "name": "Cody Brewer", "time": 1486502314864, "rating": 5.0, "text": "The best place to leave you child. Rita is exceptionally attentive, and has your child's best interest at heart. The absolute BEST place to have someone watch your child.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "111375550807231069290", "name": "brittany ortiz", "time": 1531258277356, "rating": 5.0, "text": "My daughter is 4 years old and is always happy to go to Kidtowne. We love the flexibility of being able to use it 7 days a week as our schedules vary. We use it for our 9 year old as well when we need a \"sitter\". Every person that works there is friendly. I also appreciate that it does not have a bad odor, as some childcare places do. I recommend Kidtowne to many people moving to Madison and consider it a great asset to the community.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "105861014711752205746", "name": "Anonymous User", "time": 1511856810296, "rating": 4.0, "text": "i love bringing my child here because she learns so much! The staff is so friendly,  I do Rita and Ashley were still working here though!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "117024389915904390062", "name": "MELANIE M (Somewhere Alabama)", "time": 1516106579765, "rating": 1.0, "text": "I myself would not take my children there. All food is cooked using a microwave. I Know to ask every day care how meals are prepared now.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "115625084595458408770", "name": "Anon feth", "time": 1457132604814, "rating": 1.0, "text": "I really don't think these people are qualified to run a daycare. Also, the \"teachers\" they hire to watch your children are very young and have practically no experience. Drop your kids off at your own risk, I'm surprised they haven't been shut down. I'll be calling DHR.", "pics": null, "resp": {"time": 1470414115030, "text": "We are sorry that you had a poor experience. We do not feel that the experience described is typical of the care provided here at KidTowne. Many of our teachers have degrees in early childhood education and all participate in rigorous training. Please give us a call if there is anything further we can do to help resolve your concerns and pinpoint any specific events."}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "101573086581830669870", "name": "Guy Hippleheuser", "time": 1492019389611, "rating": 5.0, "text": "We have two kids that have attended KidTowne for several months and can't say enough good things about the staff. We shopped around for the best daycare when we moved to the area and have to say that we made the right choice!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "102781215082073276326", "name": "Beyond Nail Spa", "time": 1461246191782, "rating": 5.0, "text": "Very clean and nice place. I love the flexible hours and people work here.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "116484233083284217885", "name": "Breanna Harris", "time": 1512178524709, "rating": 1.0, "text": "This place is so dirty they do not use sanitizer for anything. The bathrooms are always dirty. They don’t make sure that the kids are cleaned after they use the bathroom or that they was their hands. The owners are never there. They just assume. They don’t take pride in their daycare. It smells like dirty diapers all the time. I wouldn’t send my child their at all. Plus this day care doesn’t even have a oven. They only have microwave food and it’s not what they tell you they kids will be having for the week. They don’t have dish detergent to wash dishes. They just dip the dishes in some type of water solution. Their is still food that will be left on the dishes. It’s a lot of mess that’s in that building and they don’t pay enough for the work they ask for.  If i were I’d take my child anywhere but there.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "112560404216566117827", "name": "Stan Reese", "time": 1470499648738, "rating": 4.0, "text": "We have never worried when we dropped our kids off here. The staff seems to love kids and our kids always have fun.", "pics": null, "resp": {"time": 1470613371169, "text": "Thanks for the review! We always enjoy having your sweet kids around!"}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "104662944056814806933", "name": "Mr Information", "time": 1486219970139, "rating": 1.0, "text": "Walked in and saw kids bottles propped up with baby quilts and other propping tools. Small babies on the floor making it easy to trip and fall or drop something on the kids. Madison location is horrible", "pics": null, "resp": {"time": 1486491224389, "text": "We are very sorry that you had a negative experience. Please give us a call and speak with a manager. Propped bottles are certainly against our policy. We would like more information and an opportunity to resolve your concern."}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "111025247278940458523", "name": "Lydia Pinkston Gray", "time": 1457109189263, "rating": 1.0, "text": "Really really terrible staff. They didn't know how to handle a 3 year old tantrum and called me to come and get him because he was \"scaring the other students\". Then they told me that he was not welcome back. His tantrum was because he had bit his tongue, and it was hurting, and they were trying to make him eat. If you are going to run a daycare, you need to know how to handle a young child breakdown. It is GOING to happen, guaranteed. The two owners have no idea what they are doing, one had only WORKED in a daycare a handful of years before deciding to open his own, and the other one wouldn't even disclose his history. If you drop your kid off here, who knows what kind of care they are getting.", "pics": null, "resp": {"time": 1470414387347, "text": "Mrs. Pinkston, We see that your child last attended in 2013. Please give us a call so that we can resolve your concerns. We would be more than happy to share with you information concerning the degrees and experience of our owners as well as our staff."}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "110875785077912197685", "name": "Jessica Jackson", "time": 1462990943166, "rating": 5.0, "text": "We absolutely love Kidtowne!  Everyone is very friendly and my son loves going there!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "100503568814906216094", "name": "Margerita Martinez", "time": 1457556996490, "rating": 5.0, "text": "I drop my niece off here often and she loves the staff. The facility is very clean and friendly!!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "103903490887148406779", "name": "Bethany Wiggins", "time": 1509650609333, "rating": 5.0, "text": "Such sweet teachers! My kid loves going to daycare because of them!", "pics": null, "resp": null, "gmap_id": "0x88892decde60ca91:0xfffd061008dcc45"}
{"user_id": "112054285067633924122", "name": "Megan Sutton", "time": 1483022145257, "rating": 5.0, "text": "Simply amazing & affordable ♡Love Ms.Gayle", "pics": null, "resp": null, "gmap_id": "0x88892decde60ca91:0xfffd061008dcc45"}
{"user_id": "114837639405921661966", "name": "Matthew Johnson", "time": 1477419161461, "rating": 5.0, "text": "Great place! Wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x88892decde60ca91:0xfffd061008dcc45"}
