{"user_id": "112107192622640094491", "name": "A. S.", "time": 1495462530677, "rating": 5.0, "text": "Dr. Adams is knowledgeable in his field and has successfully treated my type 2 bipolar disorder.  He worked with me to find the best combination of medications so that I am able to function as a productive citizen and not be in a prescription haze/foggy mind. As a patient of Dr. Adams for ~11 years I have only had positive experiences with him and his staff and would highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "101311565114546529731", "name": "Art", "time": 1495383128245, "rating": 5.0, "text": "My family and I are very grateful for the outstanding care we have received!  We have benefited greatly and continue to reap rewards from the work we have done together.  We HIGHLY RECOMMEND this provider for individuals and families seeking compassionate, experienced, highly professional care. Thank you most of all, dear Dr. Douglas Adams!", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "114585744046161133105", "name": "Amelia Adams", "time": 1512748637510, "rating": 5.0, "text": "Please do not leave reviews on this site/page if you are not a Saturday patient of Dr. Douglas Adams. The business that goes by the name Madison Behavioral Diagnostic and Treatment Services belongs solely to Dr. Adams. The other providers that rent out an office in this building have a different corporation named Behavioral Health Offices.  This page to leave reviews on has no relation to Behavioral Health Offices providers. Unless you are one of Dr. Adams’ Saturday patients, do not leave feedback here. Thank you.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "116981634606371056216", "name": "Jason Grider (Gen Turgidson)", "time": 1513886461042, "rating": 5.0, "text": "I've been going to MBDTS for over 4 years now and have always had excellent service from the office staff and therapist. I've had three different therapist over my time there and all of them have helped me with my personal issues. The office staff has been spectacular from both the scheduling of appointments and with any billing/insurance questions I've had. Never had an issue that was not handled professionally and with care and respect. Great people!", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "109849229897749942019", "name": "Jamie Hall", "time": 1525703478872, "rating": 5.0, "text": "We have been going here for over 3 years. The care that my family and I have received has been outstanding. They really take the time to get to know you in a very unjudgemental way and are not quick to fix something with a prescription. If a prescription is needed they will take that route but it's not the first method they jump too. I trust them with everything I have.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "103825872175411957604", "name": "Sarah Capps", "time": 1571239451153, "rating": 5.0, "text": "We love Dr. Swartz right on on everything", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "113990311575510216156", "name": "S S", "time": 1495505470947, "rating": 5.0, "text": "I see Isabella. I really like her and have found her to be very helpful. She cares about me more than just as another patient.\nThere is a new lady in the office and she is very kind.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "116276336911371164111", "name": "Torey Lavish", "time": 1512426950673, "rating": 1.0, "text": "Worst professionalism I’ve ever dealt with as far as their front desk and receptionist go. Definitely not who you want to trust with your issues and problems. THEY DONT CARE!\n\nBack story: First appointment, my fiances mother wanted to make sure I gave them the right insurance cards in order because she said they got misfiled in incorrect order last time and it took them over a year to fix so I told that to the receptionist when I got there and she snarkly responded \"I doubt that\". To which I responded... \"No it wasn't a question \"if\" ...it did..\". Then I was filling out the paperwork for my fiancé and she said that he needed to fill it out hisself . With his condition he can't do that so I told her that was the whole reason we were there in the first place, and that he couldn't. She was super rude and snarky and judgemental the whole time. So we had to leave to find him an appropriate writing utensil he would use and he finally signed the papers. Fast forward to this time:\nHe has a 2:00 appointment, we arrive at 1:40... we sit all the way til 2:30 thinking Dr. Schwartz was just running behind. Then he comes out at 2:30 and calls a different patient back... so I ask Dr. Schwartz when my fiancé's appointment time is to which he says he doesn't know, so I go to the desk and ask and she tells me it was at two... but that he was running behind.. but she neglected to mention any of this for the fifty minutes we waited. So then my fiancé asked how much longer it will be for him then, and she said thirty minutes.. so we decided to leave and go get coffee.. We come back in only twenty minutes and see the previous client leaving when we walk in. She came out the door and said \" Dr. Schwartz came out after he finished with his client and you weren't here and I was \"unsure\" if you were coming back so I went ahead and gave him his next patient. To which I responded... No you told us it was thirty minutes til he would be seen.. so we left and came back in twenty. She just kept blaming it all on Dr. Schwartz when all of it was literally her lack of professionalism that caused this whole scene. She never told us he was running late, nor apologized. She never told Dr. Schwartz what she told us about him being able to see him in another thirty minutes... like I have never in my life witnessed such carelessness and unprofessional from a \"professional\" practice. So Dr. Schwartz didn't even end up seeing my fiancé even though we waited approximately an hour and a half. And he missed work to not even get his appointment due to the vendetta this receptionist had against him. Take your time and money elsewhere!\n* She is the receptionist with box colored black hair btw. Don't even know her name.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
