{"user_id": "102023825203178679551", "name": "Parker Allen", "time": 1628275333167, "rating": 1.0, "text": "I have been with them for over a year, almost every time I have to refill my meds it's a literal nightmare. They mess up the meds order in every way you can think of, it's always the same too. The med is incorrect, not the right amount and takes at least a weak to even fix the issue. I'm finding a different one, because this is just nothing but a big inconvenience.", "pics": null, "resp": {"time": 1628515986906, "text": "I am sorry to hear about your experience, if you would provide me with your contact information I would be happy to discuss this situation with you to find a reasonable resolution. you can email me at psychalabama@gmail.com"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "108267612549273913536", "name": "Chalis Love", "time": 1620328255150, "rating": 1.0, "text": "Unfortunately I did not have a great experience with my \"therapist\". Wish I could say better , I was meeting with Pamela Callaghan for therapy, I had missed a scheduled visit and received a NOT SO HAPPY call from Pamela, she stated she wish I would have called the office to cancel instead of missing the virtual appointment I told her I wanted to pay for my previous bill first to which she replied \" Are you still working?\" I answered yes. She asked if I was still taking medication i replied yes for anxiety and she said \" SOUNDS LIKE YOU NEED ANTIDEPRESSANTS\" . Its nice to know if your at work and miss a virtual visit with your therapist you will be judged and labeled depressed with no Apology. Would not recommend.", "pics": null, "resp": {"time": 1620329231497, "text": "I am very sorry to hear about your experience, would you like a call from the manager?"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "112119368772042764634", "name": "Lisa Hallmon", "time": 1626644794787, "rating": 1.0, "text": "I wouldn’t even give one star. My mom was admitted to Shelby Hospital for psychological reasons. She could walk and talk before entering. After being put on extreme medication from Alabama Psychiatry facility, my mother couldn’t talk nor walk. She has been in the hospital now for over a month. She is finally talking and her mind is coming back slowly. She still can not walk. She has been to 3 hospitals where they said my mother was highly over medicated and she has Parkinsonism from way to much antipsychotic medication. Alabama Psychiatry Doctors put her on all them. This has been so hard. I am now dealing with depression and stress as well over all of this. Do not let your loved ones go to this place! They will way over medicate. I also had spoke to the doctor about feeling that my mom was way over medicated and she just Dropped her down one dose but then added an antidepressant.  It’s been a complete change in my moms life. A horrible change!!! Another hospital is trying to get her medication corrected where hopefully she will be able to get back to normal and walk again", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "111165048329135516570", "name": "Bree B", "time": 1623436038521, "rating": 5.0, "text": "Dr. Chowhurdy is an angel. I have been seeing psychiatrist for ten years, and she is the first I’ve felt truly comfortable being open with. She saved my life, and in turn I will now be well wnough to be a wonderful mom", "pics": null, "resp": {"time": 1625169923105, "text": "Thank you for your kind review"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "116519008785449100443", "name": "Lana Farley", "time": 1623125778332, "rating": 5.0, "text": "I have had a awesome experience with Dr M he's listens n cares I couldn't ask for more", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "117028216936383477191", "name": "Taylor Simmons", "time": 1622551245999, "rating": 1.0, "text": "Dr. Dumas refuses to listen. She would not give me the time of day to explain my daughter's behavior. Therefore, I will no longer be taking my daughter to her.", "pics": null, "resp": {"time": 1622552146669, "text": "We apologize if we were unable to satisfactorily meet your needs,  I will notify the office manager."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "113573752700226286356", "name": "Kylee Pickle", "time": 1615330436104, "rating": 1.0, "text": "If it were not for the doctor I see I would certainly go somewhere else!  The front desk “girls” do not know what they are doing nor do they know how to treat people with respect and dignity.  If you have opportunity to actually get them on the phone!!  The “girls” in the billing department are not any better if not worse! They never call back when messages are left and again if you ever get them on the phone! We work just as hard as they do for pay and when insurance is filled wrong and a bill is received saying you owe a certain amount for a visit when the last two years my insurance covers 100%?  I’m going to call and question what the problem is and expect a professional to handle themselves the way they should when they work in a doctor’s office!", "pics": null, "resp": {"time": 1615339540663, "text": "I will refer this to the office manager."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "110856553054024789481", "name": "Nicole Kennel", "time": 1614046441604, "rating": 1.0, "text": "The providers are great when you can get in to see them. However, the entire place is useless if you need anything outside the appointment. They don't answer phone calls. Take weeks to respond to messages, and if you need paperwork filled out for any reason, they are super unhelpful. Been with them for years, but this has become there norm. I will be looking for another practice as soon as I can.", "pics": null, "resp": {"time": 1614085708041, "text": "I'm sorry that you haven't received the care that you expected, if you would like to discuss it please email me at psychalabama@gmail.com"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "104427518331040357811", "name": "Kenneth Larkin", "time": 1601912740254, "rating": 5.0, "text": "Dr. Chowdhury and her staff are the most caring compassionate medical professionals I have EVER had the pleasure of working with. While all the others were concerned about me having insurance and \"unable to schedule without\" this practice immediately recognized my needs and were able to see me the same day. Dr. Chowdhury took the time to listen carefully and understand what was happening and offered very effective treatment options. If you need this type of care, do NOT hesitate to reach out to these professionals. The exemplify the standards of care. I am thankful for being able to connect with them and certainly have a new \"perspective\" on my life. Thank you so very much Dr. Chowdhury", "pics": null, "resp": {"time": 1601913586418, "text": "Thank you for your kind review!"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "116390002289027990496", "name": "Lori chapman", "time": 1604697332992, "rating": 1.0, "text": "I have been trying to get my meds  correct for 2 months now. They are not good about sending p.a.s in. I have told them since September I have no more visits left so I can’t schedule a visit until January after speaking to aHolly several times she said I should hear back from her by Tuesday. It is Friday, and when I called the said Holly was busy they were transferring me to the nurse where nothing is done correct I go over again what has been happening she put me on hold and came back and said the dr would come back to talk to me. He did call. And at 2:50 I was send an email saying I confirmed my appointment this morning at 9:20. I never requested an appointment cause I am out of visits and they new that. Now they want money. Well they won’t get it I only receive 221.00  a month they get nothing and they have lost a patient. I would never recommend this office", "pics": null, "resp": {"time": 1604820945758, "text": "I'm sorry we've been unable to help you. Best of luck you."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "102075681202273935209", "name": "Brooklyn Hallman", "time": 1599229132756, "rating": 5.0, "text": "Dr. Chowdhury is great! She is always very polite and it’s clear she cares about her patients.", "pics": null, "resp": {"time": 1599241693246, "text": "Thank you for your kind review."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "103654819508565373448", "name": "Christina Hill", "time": 1597158326375, "rating": 5.0, "text": "I have met with Dr. Chowdhury twice virtually and she is warm and caring and listens to my concerns. You can tell that she cares about her patients. Everyone I have talked to at the office has been very helpful as well. Definitely recommend Dr. Jaria Chowdhury and this office.", "pics": null, "resp": {"time": 1597162272112, "text": "Thank you for your kind words, we appreciate the review."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "103075507960203686294", "name": "Bama Fan2019", "time": 1573838503444, "rating": 1.0, "text": "The Dr’s are very helpful and nice but your front office staff other than the 1 lady that I believe is new is horrific. The dark hair young lady that checked me in when I got there was just as nice and pleasant as she could be. The heavy set blond lady was VERY rude about my account talking to me in front of everyone about my balance. This is something that should be kept private. When I was leaving and trying to reschedule my next appointment I had to wait because the only person in the office was the nice young lady that checked me in. She had phones ringing and other customers checking in and no help. Finally the second lady came in with a attitude. The owner of this business needs to come in and do some house cleaning in the front office except for the dark hair young lady, she was the only bright spot of your business. Hope I never deal with the rude blond lady I think her name was Valerie or something like that. Very sad service!", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "101548094901811952622", "name": "Chris Johnston", "time": 1577762732964, "rating": 1.0, "text": "Worst place ever. The young lady at the window was very kind however, she is the only bright spot. Other were standing around talking while everyone in the lobby was standing in line. The last 3 times I have been in there your billing has been screwed up saying I owe money. I’ve learned to just bring my credit card statement with me. Service is the worst I have ever seen.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "107492964305562385131", "name": "Jean-Paul Bootier", "time": 1584318311590, "rating": 5.0, "text": "Great staff and wonderful doctors. Never had a bad experience", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "109141121801623814479", "name": "Rhiannon Perkins", "time": 1548361478411, "rating": 1.0, "text": "This was the most disappointing experience I have ever experienced EVER! I’ve been to some sh*t doctors before but I’ve never had to deal with such idiocracy before in my life. My husband was a patient with them and has had great success so I made an appointment after hearing good reviews from him and also another family member. I made an appointment a week before and two days before they called to tell me that they had to change my doctor due to a “conflict of interest”. Meaning it was my husband’s therapist and they wanted me to see the other therapist available. I agreed and set the appointment for later in the day. The day came for my appointment and I receive a call from the therapist saying that she wouldn’t be able to see me either for the same reason even though my other family member had STOPPED seeing her. She said she would call me back after I told her to go ahead and cancel my appointment. Never received a call. I showed up at the office 30 minutes early and she asked to see me in her office where she tried to further explain the “conflict of interest” that they kept referring to. I told her I could find a place closer to home that wouldn’t turn someone away who was looking for help. If you’re thinking about going here, make sure no one you know is a patient as well. Otherwise, you might become another “conflict of interest” like me and not be told until you show up because even though they say they called you and got your voicemail. I guess actually LEAVING a voicemail is too complex. I’m not doubting their ability to help, but being turned away at the door when you want help feels like an emotional slap to the face.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "100749994927379014478", "name": "T Farris", "time": 1563467473563, "rating": 1.0, "text": "The initial physician was great but after that downhill.  I was never told that I would have to have numerous appointments in order to get the testing completed. My appointment with the intake physician was changed 3 times and the last time was due to their issue with getting a THEIR new physician set up.  Still not sure how that is the patient's problem. All I was told was I could go elsewhere but the wait was going to be long. Not really because I was able to get into their office.  Unreal canceled everything and WILL NOT RETURN OR RECOMMEND.  If I could leave 0 stars I would.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "116376701582373312480", "name": "Devin “Gearhog” Payne", "time": 1550264029207, "rating": 5.0, "text": "I left an extremely emotional, long, desperate email on my appointment request, and got a call back only a couple days later. The woman I spoke to was kind and genuinely concerned about my well being. She was a little absent minded but that's what I loved about her! Softly humming tunes while trying to track down information, \"talking to herself\" when she found something (\"oh! There it is!\" etc)  It made me feel at ease.\nI don't know why the reviews are so bad for this place... I've had an amazing experience so far.\nAs someone who suffers from varying mental disorders, as well as being victim to multiple emotional & sexual traumas, I find it exceptionally difficult to trust; yet I already trust Dr. LaRussa. It's such a relief to finally meet a mental health professional who can see me for who I truly am, and that I'm comfortable enough around to be myself.\nEven though he's a psychiatrist, he listened to my rambles and my talking in circles. He offered practical theories, and gave solid advice.... And he seemed to really understand me, suggesting we find a therapist to treat my PTSD. He spoke to me like I'm a human being.\n\nI've only had one appointment so far but Dr. LaRussa is sooo fantastic! He and the rest of the staff seem to genuinely care about the patients. I look forward to my next appointment with him.\nIf you're someone who's easily threatened, this man is the doctor for you! I've met so many, and none even half as compassionate as Paul LaRussa. His gentle smile alone would make anyone feel at ease.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "108870074828168879057", "name": "ben guthrie", "time": 1547485451097, "rating": 5.0, "text": "Jennie is great! She's helped me tremendously.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "111530196541392449591", "name": "Janice Mutchler", "time": 1545326003467, "rating": 1.0, "text": "Inefficient, no regard for customer's time. Waited over an hour to see Dr for a scheduled appointment. Another patient in the waiting room with us signed in and waited an hour and a half, asked what the problem was and only then they figured out her appointment was scheduled for the following day.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "110293699383187569101", "name": "Joseph “Trent” Vines", "time": 1617455562623, "rating": 5.0, "text": "Dr. Islam is a very well respected psychiatrist in the Birmingham area whose always treated me with the upmost respect and if you work for a living, he sees patients 6 or 7 days per week and that's why I started using him, but I've grown to like him a lot. he cares about his patients and does a great job running his clinic.  kudos Doc. I wish we would've known each other a long time ago. great guy highly recommended!!!🙏🏻🙏🏻👍🏼👍🏼👍🏼", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "113503497213186980961", "name": "lauren armes", "time": 1614468570215, "rating": 5.0, "text": "I had my first appointment with Dr. Islam today and he was so caring and compassionate. I look forward to continuing to see him as my trusted psychiatrist. I would recommend him to everyone. He is phenomenal at communicating as well.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "116515616760204026953", "name": "Erin Broome", "time": 1617842514761, "rating": 5.0, "text": "Dr Nasima is so caring and genuine. I have struggled for years to find someone who seems to actually listen to what I am saying about how I am feeling. Highly recommend. Also I had an appointment the morning after I called and left a message . They put mental health first, which is so hard to find.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "115137845676812248660", "name": "Meghan Clements", "time": 1594337677176, "rating": 5.0, "text": "My Psychiatry Clinic is THE BEST! With other mental health offices we have used, we either found a doctor that doesn't seem to really care, rude receptionists, and/or it's almost impossible to get an emergency appointment. You won't find any of that at My Psychiatry! They are nothing but friendly, caring, and compassionate. I will never be able to express my gratitude for what Dr. Islam has done for my family, and to Roman for always working with us and getting us in for an appointment. Absolutely recommended!!", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "100034845845809786230", "name": "Matthew 123456", "time": 1602092510058, "rating": 5.0, "text": "I moved Back home to Birmingham after struggling for years in Florida with my issues compounded by a lack of available Doctors in Pensacola that could treat me without Insurance currently and with the new Covid guidelines it was nearly impossible to get the help needed there.\n\nBy Chance I called Dr. Islam from googling for psychiatrists here and was stunned that he actually answered the phone, then set up an appointment for initial visit the next Day!\n\nI didn't know what to expect and just took a shot at this new video conference method and it went flawless.\n\nOn top of the great service, Dr. Islam's true talent showed in the visit and outcome so far.\n\nSomehow he deciphered me trying to explain almost 25 years of taking medication for Depression at first, then anxiety in college,  and a variety of issues ever since.\n\nI knew the best method was not to sugar coat the severity of how bad I have been feeling and that I was basically unable to function normally, except for bare minumum to survive.\nI just told him the truth that I was basically staying home and not able to see a way out but that I never gave up hope but that I was in serious need of help.\n\nI told him what I thought I needed based on what had helped in the past; but also that I trust him over my opinion bc obviously my past regiment had not really helped me bc I had stagnated overall even when had all the help I thought I needed over the last 5 years..\n\nAmazingly he was able to understand my root problem better than I did honesly and prescribed a medication that has litterally changed my Life.\n\nFor the 1st time in 8 years or so, I feel free from the over whelming anxiety and sadness and fear that had ruled me for a decade and he did it with a novel approach that I didnt even know existed and had never heard of as a medication for my underlying issue of anxiety/depression/and an inablity to take needed action.\n\nHow I had never been diagnosed this way or offered this class of medication is just an example of the stigma and problems still around mental health..  Perhaps my previous doctors were influenced by the labels and words used to describe some of my symptoms which caused them to think I didnt need this form of treatment.. I dont know but there are medicines that will help you that you may never have heard of like me.\n\nIt actually makes my brain WORK the right way Versus just numbing it, and covering over the problem .\n\nI am now in a position that I am safely tapering off the medication that I dont truly need to be on(faster than I thought I could) and put that \"mistake\" in the past and I am focused on my life and my future for the first time in years.\n\nNever give up hope! Dont settle for bad help or mediocre treatment that just helps you \"get by\" each day as long as you have your \"meds\"\n\nIf you not thriving or on a path too it dont settle like I did for way too long.\n\nDont assume you know the only things that will work for you and be TOTALLY honest with the Dr so he can help you .\n\nIm even getting back into old hobbies and my next new career goals and even back into My Faith in God.\n\nIf you or someone you know is struggling please take this as a message of hope that its never too late and never hopeless.\n\nGod Bless and Thank you to Dr. Islam and Thanks to President Trump or whoever in the Government made this Tele-Medicine / new video conferencing option available. Without it I may never have found Dr. Islam.\n\nThank You Dr. Islam\n\nSincerely,\n\nMatt", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102359253690504623154", "name": "Hannah Yates", "time": 1612819963831, "rating": 1.0, "text": "They only take Blue Cross insurance.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102713433949230005870", "name": "fazle matin", "time": 1580060679657, "rating": 5.0, "text": "Wonderful clinic and physicians. Caring and kind.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102309511909508219363", "name": "Rxseirixlle Geabov", "time": 1581656140971, "rating": 5.0, "text": "Amazing !!! Amazing !!!!! Amazing!!!!! Love that place😊", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
