{"user_id": "110132211437930682653", "name": "Jl McCall", "time": 1628355011830, "rating": 5.0, "text": "Steven came out to complete a chimney inspection because I thought an animal was trying to gain entry into the chimney. There was no animal but another issue was discovered. He informed us of the issue, provided photographic evidence of the problem, and supplied us with a reasonable price for repair.\n\nThe weather was rainy and as a result the repairs had to be delayed but Steven stayed in contact with us regarding when the repair could be completed. He arrived when he said he would and completed the repair. He again provided photographic evidence of the repair. We had a very positive experience with Red Mountain Chimney and will definitely use them for all or our future chimney needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPpInKHIzh4cu-0lBVkxr-1xqUe6zHyy-jUV-Q_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPesRnk8_IRfCq_YEmRBMkl5KnoB26b0g9YSn2k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM_TsKBTAwu7SoU62v3kGpAFZfYB1XjbM_Fa1gD=w150-h150-k-no-p"]}], "resp": {"time": 1629983527427, "text": "Thank you so much for your review. We strive very hard here and take our reputation very serious. Hope to see you soon."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "102006275678739658492", "name": "Gail Hutton", "time": 1628888180655, "rating": 5.0, "text": "Wonderful experience", "pics": null, "resp": {"time": 1629983646393, "text": "Thank you Gail. I am very happy that we were able to meet your needs and make you another satisfied customer. Hope to see you soon."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "112436546463521102260", "name": "Kay Fleming", "time": 1623885980466, "rating": 5.0, "text": "Great service and very professional.   Will be using again in the near future.    Thanks for a great job!", "pics": null, "resp": {"time": 1624521026291, "text": "Thank you so much Mrs. Kay. My reputation is very important to me. Thanx for the review. Thank you for keeping your word. That means eveything to me."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "112876772378984492359", "name": "Nina McCallum", "time": 1607743107039, "rating": 5.0, "text": "Very professional and thorough. I will call again for future services.", "pics": null, "resp": {"time": 1616984548381, "text": "Thank you so much Mrs. McCallum for the review. We strive for excellence. See ya soon!"}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "108724945352609333153", "name": "Larry Greenberg", "time": 1601075603366, "rating": 5.0, "text": "Very very professional.  He actually was here early for the appointment and started right away. Did a very thorough inspection, including taking pictures of the things I needed to watch and replace, so I could see them first hand.  Told me in detail what was wrong and what I can expect to happen down the line. He even told me where I had a wasp's nest that needs to be taken care of and how big it is. He comes highly recommended and will be getting my repeat business for years.", "pics": null, "resp": {"time": 1601400299605, "text": "Thank you so much for the review. We take our reputation very serious. Hope everything goes well for you in the repair. You can always count on us for any information even if you do not use us for any repair. Just give us a call."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "115306898205058592227", "name": "Jenny Camp", "time": 1542748785004, "rating": 5.0, "text": "Highly recommend!  My chimney was smoking pretty bad and he came out and cleaned it.  He also found a few issues that needed to be fixed to keep us safe.  His prices are reasonable and we were able to schedule within a week of calling.  Very satisfied..", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "104035298299310903818", "name": "Dawn Friday", "time": 1541018998060, "rating": 5.0, "text": "Steven was very personable and professional!  The work he preformed was outstanding and he explained everything he had done, plus what is needed in the near future.  The pricing was reasonable, which makes this affordable to be a yearly maintenance.  I’m so pleased with our experience with Red Mountain Chimney!  We will most definitely be using them again and be recommending them to everyone we know!\nThank you Steven for making this such a wonderful experience!\n\nThe Friday’s", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "100762561031694539658", "name": "Amy Milam", "time": 1593720300222, "rating": 1.0, "text": "After almost 8 months of patiently waiting for Steven to show up and do the job he was paid a large deposit for, I am now asking for a refund. This was a City job and would have been sizable check for him. He was very responsive to all my texts and calls for three months. Each time I told him no rush and accepted his apology and new timelines. However, after three months of delays, he didn't respond to my text in the fourth month, and then COVID. When I called him in the seventh month, he sounded relieved; he indicated his office flooded; he forgot my number; forgot the location of the building; and didn't think to call City Hall. He apologized profusely said he would be out to re-familiarize himself with the job the next week.  I believed him, despite the doubts in my mind, but he didn't show up again. That is when he said he had been set behind on other projects due to rain (my project was indoors and all he had to do was stop by to refamiliarize himself with it). At that point I politely asked for a refund. One would think the person that had waited a year after paying a huge deposit, towards an even bigger job would get priority for at least a visit. Hopefully he is more prompt with the refund, but the city will follow up with that and they won't be as patient.", "pics": null, "resp": {"time": 1597341287982, "text": "Ive called you twice to resolve this matter. No response fom you. I am deeply saddened that you aren't happy with Red Mountain Chimney but I have been trying to call you to resolve this matter."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "113787655977895459088", "name": "Katherine Hanks", "time": 1584404632708, "rating": 5.0, "text": "I called several chimney inspection and cleaning companies in Birmingham and Red Mountain was the only one that got back to me almost immediately. The others took days to call me back. They inspected and cleaned my chimney within days of first reaching out to me and their price was the best compared to others that I received a quote from.  They also came back a few days later to correct some issues discovered during the inspection and again the service was great and the price was fair and the quality of work is great! Cannot recommend them enough!! Definitely will hire again!!", "pics": null, "resp": {"time": 1601400485510, "text": "Thank you so much Mrs. Hanks. It makes my heart happy that you are satisfied and we were able to resolve any and all issues. Have a very blessed day and we are always here for you."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "105788134310832426910", "name": "Deborah Parker", "time": 1550892297180, "rating": 5.0, "text": "Steven is very knowledgeable and thorough. He cleaned my chimney and made all the necessary repairs. He installed new spring loaded dampers that will help with keeping out any wildlife that might try to visit. Thanks so much Steven (and Brad) !! Great job!!!!", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "105506543546289989849", "name": "AHA 1987", "time": 1572999583290, "rating": 1.0, "text": "WOULD NOT RECOMMEND. Excuse after excuse... this guy rescheduled 3 times and didn’t show. Not to mention that I was the one that had to call him each time he didn’t show only to find out he forgot. Don’t put something on the schedule if you have something else going on. (In response to their response to my rating)... Or common sense would say to call your appointments to reschedule if you have something come up. I have had to reschedule other work around this guy. He has put us in a bad spot. Extremely unprofessional.", "pics": null, "resp": {"time": 1597341550403, "text": "Thanks for going under another name, trying to ruin me. If you would've called me and let fix whatever it was..... I surely would've handled it. I take my reputation very seriously and for you to go under two different names to try to slander my company. I work hard to try to build this company I didn't need your extra help to try to tear it down. We are both grown adults and we can handle this like adults. But you chose this way instead. Why, I do not know......."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "105158717465924432208", "name": "Monica Napier", "time": 1607714626308, "rating": 5.0, "text": "I had Red Mountain Chimney come out to sweep my chimney and they were very prompt. Their service was outstanding and I was very happy with the price of the repairs that were needed.  Would recommend to anyone and use them again.", "pics": null, "resp": {"time": 1610391870519, "text": "Well thank you Monica for your review. We were glad to have given you the utmost of service as we try to give all of our customers. And you are a Pete repeat you are a repeat customer and always glad to help I love to keep you as a repeat customer so to you and your family have a wonderful New Year and a very blessed day. See you next time!"}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "111359986350582460105", "name": "C. A. Powell", "time": 1532366809489, "rating": 5.0, "text": "Dryer vent cleaning at a very reasonable price -- excellent work -- was fine with two storey vent, going to roof with elbows.  Did not balk a bit.  Price is reasonable enough to schedule annually -- not a budget breaker.  Easy to book through FB message too.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "113345687759221828528", "name": "Martee Duffey", "time": 1560438001704, "rating": 5.0, "text": "Very professional. Arrived at correct. Answered all questions. Even have advice on alternator problems. We will recommend to everyone because we are going to hire again for any repairs and a fireplace remodel. Expert in the field.\nGreg and Martee Duffey", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "116861864289002689687", "name": "Brett Knight", "time": 1551890356140, "rating": 5.0, "text": "Steven went above and beyond to repair my chimney when other service providers wouldn't. I am very happy with the service that was provided and will use him again in the future.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "115642019279532811813", "name": "TLS", "time": 1542996482492, "rating": 5.0, "text": "They came to our house and did a great job.  Honest throughout the process.  Identifying what we needed and what we did not.  He even got on our roof !", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "109763316263302394080", "name": "Kara Harrison", "time": 1556719608395, "rating": 5.0, "text": "Great job and even came back for more work to make me happy. We had squirrels in our chimney and he fixed it to keep them out.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "116642623741070599162", "name": "Rita Randles", "time": 1523639871881, "rating": 5.0, "text": "Happy with the price. Was done in a great timely manner. Done a great job very friendly and respectful. Would recommend this company to all my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "115642019279532811813", "name": "TLS", "time": 1542996482492, "rating": 5.0, "text": "They came to our house and did a great job.  Honest throughout the process.  Identifying what we needed and what we did not.  He even got on our roof !", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "111359986350582460105", "name": "C. A. Powell", "time": 1532366809489, "rating": 5.0, "text": "Dryer vent cleaning at a very reasonable price -- excellent work -- was fine with two storey vent, going to roof with elbows.  Did not balk a bit.  Price is reasonable enough to schedule annually -- not a budget breaker.  Easy to book through FB message too.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "113787655977895459088", "name": "Katherine Hanks", "time": 1584404632708, "rating": 5.0, "text": "I called several chimney inspection and cleaning companies in Birmingham and Red Mountain was the only one that got back to me almost immediately. The others took days to call me back. They inspected and cleaned my chimney within days of first reaching out to me and their price was the best compared to others that I received a quote from.  They also came back a few days later to correct some issues discovered during the inspection and again the service was great and the price was fair and the quality of work is great! Cannot recommend them enough!! Definitely will hire again!!", "pics": null, "resp": {"time": 1601400485510, "text": "Thank you so much Mrs. Hanks. It makes my heart happy that you are satisfied and we were able to resolve any and all issues. Have a very blessed day and we are always here for you."}, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "109763316263302394080", "name": "Kara Harrison", "time": 1556719608395, "rating": 5.0, "text": "Great job and even came back for more work to make me happy. We had squirrels in our chimney and he fixed it to keep them out.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "116861864289002689687", "name": "Brett Knight", "time": 1551890356140, "rating": 5.0, "text": "Steven went above and beyond to repair my chimney when other service providers wouldn't. I am very happy with the service that was provided and will use him again in the future.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "101455042819671170377", "name": "tyrone kidd jr", "time": 1558622646544, "rating": 5.0, "text": "Great service and very reasonable for the work.", "pics": null, "resp": null, "gmap_id": "0x88891ec31bbfc1e9:0xe4b525f11e7a1b53"}
{"user_id": "116421651777453014670", "name": "Kelley Reischauer", "time": 1619124873264, "rating": 5.0, "text": "Tanner and Kyle saved the day! I am so appreciative for the time they took to brainstorm a solution so the ginormous surround that made my fireplace look like a chalkboard won't be necessary! (The salesperson did not tell me about this huge, chalkboard-sized surround. The sales technician also didn't mention that the fan would be audible along with a sort of annoying hum. For the amount of money we spent on this system, it would have been nice if he had been clear about how exactly it would look) Anyway, thanks Kyle & Tanner!! You two are the best! My husband and I are (now) so happy with how it looks...it even makes up for the annoying fan noise. Be sure to ask for Tanner and Kyle as they are awesome! And the company should thank them as they are the reason I didn't (justifiably) lose it. Bonus: Tanner also removed a regulator  that our contractor's folks had installed inside our house after explaining the dangers of that (gotta love Alabama codes)!", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "113145037791969062101", "name": "Mel H", "time": 1616602819451, "rating": 5.0, "text": "We just purchased our home in December and we could not get info from the sellers regarding proper cleaning and maintenance of the fireplace in the home. We decided before we used it, it would be best to have it cleaned (if needed) and inspected. The book time in winter is crazy busy and I believe it was about 60 days out, but given the season this is normal. Preston and Mason showed up on schedule even calling ahead to let me know they were on their way. They were polite, professional and took time to answer my questions (which I asked a lot). They cleaned the chimney, inspected it and addressed potential future concerns (issues that for now are ok but if left overtime would become a problem). I appreciated this as it gives me time to prepare to get them addressed. They did not sell me on anything not needed and provided pictures of the areas of concern. I highly recommend this company. Everyone should do annual maintenance on their chimneys/ fireplaces if they use them in winter. The price was fair for the work and service performed and We have zero complaints. Highly highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "104584503298794158401", "name": "Earl Campbell", "time": 1599191953368, "rating": 5.0, "text": "Had the honor of this company and great technician Preston Smith come take care of my chimney. We just bought an older house and to say it hadn't been cleaned in awhile is an understatement. They came and did an immaculate job with wonderful customer service. I will definitely use them again and highly recommend. Well worth the cost.", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "114478050241408319707", "name": "Tristian Ikard", "time": 1578335752840, "rating": 5.0, "text": "Preston and his coworker did an outstanding job with our chimney inspection. They were very knowledgeable and provided excellent customer service. They answered all of our questions and did not try to up sell us on things that were not needed. I will definitely continue to use their service annually for inspections and any other work. I would 100% recommended them to anyone that needs work done on their fireplace.", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "112852339127015811759", "name": "Tyler Lavena", "time": 1591726512365, "rating": 5.0, "text": "A1 Chimney Specialists are an exceptional company!  From the dispatcher to the technicians it is obvious they are a very professional organization!  They are courteous, prompt and provide quality service!", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "114319900475372599429", "name": "Paul Doyle", "time": 1581532109200, "rating": 5.0, "text": "I highly recommend A-1 Chimney.  They provided OUTSTANDING Service with low cost.  If it was possible to give them a 10-star rating, they deserve it.  Sam Solomon was the technician. He is professional and is a Outstanding representative for this business.", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "105814993605919187268", "name": "Kal Katrajus", "time": 1586950523315, "rating": 5.0, "text": "We loved the service that was provided when we really needed it. During these times precautions were appropriate but the job got done and we are up and running again! - KK", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "106756272860844493663", "name": "Allison Block", "time": 1565177522029, "rating": 5.0, "text": "The folks at A-1 are communicative, professional and accommodating.  They showed up, did the work and didn't try to push more services on me while also explaining what could be done to protect/preserve my chimney in the future.  I will definitely be calling again!", "pics": null, "resp": {"time": 1572625913335, "text": "Thank you, Allison, for the kind review! We're glad we could help!"}, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "100601214102019135299", "name": "F. M.", "time": 1605965683376, "rating": 5.0, "text": "They didn't provide service to my area, but customer service on the phone was great.", "pics": null, "resp": null, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "112149619154797255079", "name": "Kaleb Smart", "time": 1572632439637, "rating": 5.0, "text": "These guys are very knowledgeable and friendly, and they do good work. They were open to questions. They made some recommendations based on photos and explained everything very well", "pics": null, "resp": {"time": 1573242442795, "text": "Thanks, Kaleb, for the feedback!"}, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "107240396747363140414", "name": "Nyla McCoy", "time": 1594256634453, "rating": 1.0, "text": "We called the number from Google maps.  We tried  calling several times and had a busy signal each time.", "pics": null, "resp": {"time": 1594308818592, "text": "So sorry you had this experience. Unfortunately it was out of our control - our phone system was down when you were trying to call. Everything has been fixed now though so we hope you try to call back at (256) 285-4895 between 8am and 4pm. Thanks! Bear in mind that if we are on another call, you may need to leave a message. Or you can also contact us on the website form here: https://a1chimneyspecialist.com/contact-us/"}, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "116038773460967550695", "name": "Barbara DeFalco", "time": 1549910624274, "rating": 5.0, "text": "A1 chimney specialists are professional, knowledgeable, prompt, courteous. They inspected, repaired  my chimney and dryer vents. I highly recommend them.", "pics": null, "resp": {"time": 1572625976499, "text": "Thank you, Barbara, for the recommendation!"}, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "116930996126533026013", "name": "Nathan McCall", "time": 1576513161865, "rating": 5.0, "text": "They did a great job installing a new damper plate.", "pics": null, "resp": {"time": 1576870591651, "text": "Thanks, Nathan!"}, "gmap_id": "0x88626d0897e8586d:0x702b02af374f6d04"}
{"user_id": "104940813962468471504", "name": "Sabrina Salmon", "time": 1614028782854, "rating": 5.0, "text": "David and Zach are both amazing technicians. They did a thorough inspection job both in the home and on my roof. Cleaned it all. Took pictures of everything. Explained to me what was happening, what would need to be handled, what to look for, and why it was important. All In terms that I could understand. They left my home as clean as they entered it. Not a drop of creosote or Ash on my floor. Great attitudes incredibly efficient and on time.\nI will be having them come back to fix a couple of necessary issues. I look forward to knowing that my home is being handled by professionals. And that I will be safely up to code and be able to enjoy my next cozy fire", "pics": null, "resp": {"time": 1617713481801, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "106373111181323829979", "name": "George Evans", "time": 1613747139529, "rating": 5.0, "text": "Honest, professional, and reasonable.  Came in, all wore their masks while they were in the house which we felt was very respectful.  Offered some suggestions about things that we would likely need to do in the future and gave us prices but were very honest about the condition of our chimney and didn't suggest any work that didn't need to be done.", "pics": null, "resp": {"time": 1617713536601, "text": "Thanks for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "113225505153003408093", "name": "Virginia Perry", "time": 1601983703254, "rating": 5.0, "text": "Sootmaster had two men come to my house. One was being trained but they both seemed knowledgeable and worked quickly together. Needed some repair on my crown since it was pooling water. They added a slope, applied some sealant, and showed me some pictures of it; it looked good! He said it would last at least 20 years but they gave me a 10 year warranty just in case.", "pics": null, "resp": {"time": 1617714097684, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "102635310176735702600", "name": "Betty Harner", "time": 1597697393264, "rating": 5.0, "text": "Tried calling a different company first but they didn't answer. Kinda glad they didn't because Sootmaster is great! They got me in for an appointment the same week and were very helpful in describing why they were doing what they were doing. The price was fair and the serviceman told me I'm safe to use my fireplace come winter time.", "pics": null, "resp": {"time": 1617714434306, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "111708648492074158449", "name": "Bambi Houston", "time": 1607713380574, "rating": 5.0, "text": "Wow, I can't say enough great things about them.I had a feeling i was in desperate need to have my chimney clean.  That was an understatement. My appointment was between 10 and 2 they came right at 10 and were done before 11.They explained everything as they went and even cleaned off the roof for me. I need some work i am glad they found when they are done I will feel safe to have a fire 🔥When they were done they left everything perfect. Only one thing I kind of wish he would of dumbed it down for me but my husband was on the phone and he understood.  He did take pictures to show what I needed done. That helped ALOT!!!!!!!!", "pics": null, "resp": {"time": 1617713485533, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "116845089051122923241", "name": "Corinne Flickinger", "time": 1615940236044, "rating": 2.0, "text": "We have wasps coming through our gas fireplace so we hired Sootmaster to come check for a wasp's nest in the chimney. He spent a total of 10 minutes here to look in the chimney, tell us there was no wasp's nest, and charge us $240 for the \"cleaning and inspection\" (although he didn't clean, because it's gas and doesn't get build up).\nIn short, I don't recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "117981688595767048086", "name": "Diego Martinez", "time": 1598062249894, "rating": 5.0, "text": "I was preparing for hurricane season coming up, so I asked sootmaster to come out and waterproof my chimney. I figured this way, it would be a lot cheaper than to get water damage and not have a company available to fix it for awhile. The guys applied some paste to my crown and installed a damper. I think they did something else also but I can't remember what it was. Regardless, I feel relaxed knowing that I'm good to go when it starts raining.", "pics": null, "resp": {"time": 1617714185640, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "113228729863789328271", "name": "Ethan Yang", "time": 1598501154423, "rating": 5.0, "text": "There was a terrible smell coming from my fireplace. I was impressed with Sootmaster's website so i called them and their prices were reasonable. Turns out, there was 5 dead squirrels in my chimney. The technicians got them out, cleaned it, and installed a damper. Very happy to get that smell gone.", "pics": null, "resp": {"time": 1617714181575, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "104749627264267720863", "name": "tanner brock", "time": 1591811342812, "rating": 5.0, "text": "I called the office and within the hour Tim came out. He was very knowledgeable and nice. He pointed out the things that I needed and quoted an excellent price. I would recommend them to everyone for all their chimney work", "pics": null, "resp": {"time": 1591900913271, "text": "Thank you for choosing us! We are happy to be able to help!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "105334529104032254960", "name": "June Turner", "time": 1598318022891, "rating": 5.0, "text": "Asked for an appointment with the sootmaster to inspect my chimney. Not only did he inspect it, he explained each step to me, what to look for, and why it's important. I really learned a lot and felt I got my money's worth. Great job Sootmaster for your five star service.", "pics": null, "resp": {"time": 1617714183308, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "114154415463945388635", "name": "Lincoln Hayes", "time": 1598296510754, "rating": 5.0, "text": "I was very pleased with my experience with Sootmaster Chimney Sweep Birmingham. They answered the phone and set me an appointment for the next day. The technician called me 30 minutes in advance to let me know he was on his way and showed up on time. He got the bird out safely and cleaned the wastes up. Very happy and would use them again.", "pics": null, "resp": {"time": 1617714184590, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "111430403820526273005", "name": "Lily Fears", "time": 1597587894728, "rating": 5.0, "text": "Sootmaster is a very professional company. David was super helpful and explained to me the purpose of his very extensive safety inspection. I'm glad sootmaster took the time to fully check out my chimney to make sure it was safe to use.", "pics": null, "resp": {"time": 1617714437624, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "105118445273540623939", "name": "Jordynn Davis", "time": 1597842019053, "rating": 5.0, "text": "My husband called the sootmasters and they sent out David. He had a great attitude and seemed happy to be working on my chimney. I'm glad that they sent out such a nice worker.", "pics": null, "resp": {"time": 1617714432293, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "100309382307994591479", "name": "Kelley Collins", "time": 1597689145310, "rating": 5.0, "text": "Called Sootmaster to clean the chimney in my rental property. Was very impressed by their company's response time and quick service. I would use them again if I had problems in my other properties.", "pics": null, "resp": {"time": 1617714435357, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "112028541354541817181", "name": "Florence Stevens", "time": 1597766916318, "rating": 5.0, "text": "I stumbled upon Sootmaster's blog while looking up how to decorate my fireplace and read a few articles. One of their articles said that I needed a chimney sweep every year so I gave them a call. The team was helpful and professional and I would use them again.", "pics": null, "resp": {"time": 1617714433169, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "107258703061984959798", "name": "Steven Spiegel", "time": 1605809646943, "rating": 1.0, "text": "I called to book an appointment, got scheduled and waited 2 weeks for my appointment. I took off work for this appointment which costs me money. The day of the appointment they called and told me the technician was running behind and wouldn’t be able to make it. The next available appointment was a MONTH away. Unbelievable.", "pics": null, "resp": null, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "116319068899160885492", "name": "Lonnie Reynolds", "time": 1598823942361, "rating": 5.0, "text": "Had a downdraft issue in my fireplace. The guys came out and put some type of device on the top to keep the draft out. Quick and easy fix!", "pics": null, "resp": {"time": 1617714126387, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "106766814425021071278", "name": "Will Jensen", "time": 1599835494187, "rating": 5.0, "text": "Got my annual chimney inspection again. The storm collar wasn't completely sealed so they applied some silicone and sealed it back on. Good prices for everything as well.", "pics": null, "resp": {"time": 1617714074210, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "118129692957272333350", "name": "Tanner Thompson", "time": 1594161591342, "rating": 5.0, "text": "These guys are excellent. David and Dakota came out to do an animal removal a rodent had died and the smell was horrific. I called Sootmaster and they came out the same day. They where very professional and polite and now thanks to them no more smell.", "pics": null, "resp": {"time": 1595104423127, "text": "Thank you for using Sootmaster!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "100656519551623110631", "name": "Devin Harbin", "time": 1595335131785, "rating": 5.0, "text": "David and Dakota came to perform a sweep and did a wonderful job and they where very clean about it . I’ll def will be using them every season", "pics": null, "resp": {"time": 1596125071996, "text": "We are happy we could help! Thank you for the review."}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "115281025899918954011", "name": "Michael Mcginnis", "time": 1591829231974, "rating": 5.0, "text": "I called in and with a quick response time I had David at my home. He was very knowledgeable about the safety issues wrong with my fireplace and explained them thoroughly. He fixed all the problems on the spot and at a great price . Thank you sootmasters .", "pics": null, "resp": {"time": 1591900827865, "text": "We are happy to help! Thank you for choosing Sootmaster of Birmingham!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "113802986495276744154", "name": "Xavier Kelley", "time": 1591206442344, "rating": 5.0, "text": "SootMaster is an incredible company. Professional, and Punctual. They not only do Chimney Repair Services, but also Dryer vent services and chimney leak repair.", "pics": null, "resp": {"time": 1591206701904, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "101283332667905634760", "name": "Travis Dearing", "time": 1594684203796, "rating": 5.0, "text": "They came out to perform a sweep and did a great job very clean about everything as well .", "pics": null, "resp": {"time": 1595104377002, "text": "Thank you for the great review Travis!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "113950580119589503720", "name": "David Eggler", "time": 1592433871508, "rating": 5.0, "text": "What a great company outstanding work . My chimney still hasn’t leaked since .", "pics": null, "resp": {"time": 1593208015112, "text": "Thank you for the great review David!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "104185066739252488171", "name": "Justin Mike", "time": 1593531963946, "rating": 5.0, "text": "Sootmaster did a wonderful job sweeping my chimney . I’ll def be referring them", "pics": null, "resp": {"time": 1593695675525, "text": "Thank you for the great referral!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "100189019906047290199", "name": "Jeff Johnson", "time": 1591991324045, "rating": 5.0, "text": "Extremely happy with sootmasters . I recieved a quick response followed by a great bid . My chimney hasn't had a problem since the repairs where finished even after all this rain.", "pics": null, "resp": {"time": 1592222367322, "text": "Thank you for choosing Sootmaster!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "110459768275115861464", "name": "tanner schuab", "time": 1591992198533, "rating": 5.0, "text": "Great job Tim !!! This company is on point , will definitely recommend", "pics": null, "resp": {"time": 1592222398332, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "110925080075372357067", "name": "Jamie Delgado", "time": 1597172302927, "rating": 5.0, "text": "Great service at a fair price", "pics": null, "resp": {"time": 1617714513146, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "117030098879534026732", "name": "Jeremy Gardner", "time": 1597417492063, "rating": 5.0, "text": "I don't normally leave reviews but I got an email asking if I would, and since the guys that cleaned my chimney last month did such a great job, here's a 5 star review.", "pics": null, "resp": {"time": 1617714514908, "text": "Thank you for the great review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "114375649376831156870", "name": "Paulie Crist", "time": 1597229972514, "rating": 5.0, "text": "Nice to have a service company that will actually show up on time. Cleaned and inspected my chimney. Thanks Sootmaster", "pics": null, "resp": {"time": 1617714545227, "text": "Thank you for the 5 stars!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "105229432792490310502", "name": "Colton Sims", "time": 1598022285346, "rating": 5.0, "text": "Had Soot Master do an inspection and a sweep. You'd be surprised how much soot is in a chimney that hasn't been cleaned. The man told me that this could cause fires if it weren't removed, so have them come out and clean yours.", "pics": null, "resp": {"time": 1617714186821, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "112589074818732735248", "name": "Shelly Towns", "time": 1614481098796, "rating": 1.0, "text": "Never called back", "pics": null, "resp": {"time": 1617713635250, "text": "I'm so sorry to hear this, please give us a call back at (205) 956-1900 and lets see what we can do to make this right."}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "116314894179988221010", "name": "Megan Jenson", "time": 1593644194808, "rating": 5.0, "text": "David came out to check my chimney for a dead animal and found a squirrel!  The smell was horrible I’m so glad I called them .", "pics": null, "resp": {"time": 1593695690089, "text": "We are glad we could help!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "109112231330371421236", "name": "Tyler Lance", "time": 1593132001471, "rating": 5.0, "text": "They came out to do a sweep and did a great job they even found some serious water damage on top of my chimney .", "pics": null, "resp": {"time": 1593208041751, "text": "Thank you for choosing Sootmaster! We take pride in taking care of our people"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "111625342789795459173", "name": "Lance Belmont", "time": 1597343424871, "rating": 5.0, "text": "We have used the Soot Masters various times over the last few years for various reasons when it comes to our home and fireplace. We bought an old dutch colonial and it has 2 fireplaces.", "pics": null, "resp": {"time": 1617714540211, "text": "Thank you for the 5 stars!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "113828282565345854681", "name": "Nick Jackson", "time": 1604951035619, "rating": 5.0, "text": "Used to soot masters before the winter seasons. The technician came out and did a full inspection and a chimney sweep. We were amazed at how much should and other material came from within our chimney. Thank God we got this sweep done when we did.", "pics": null, "resp": {"time": 1617714094705, "text": "Thank you for the amazing review!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "100028722618911802509", "name": "Bridget Barnes", "time": 1594340770659, "rating": 5.0, "text": "I had a horrible leak and the office sent out David to inspect where it was coming from . He wasted no time hoping on the roof and found exactly where my leak was . Thank you Sootmaster", "pics": null, "resp": {"time": 1595104406298, "text": "We are glad we could help you Bridget!"}, "gmap_id": "0x88891dfc8dcdd15b:0xbb28d776fb50608f"}
{"user_id": "105965098830027828489", "name": "Pat Ferguson", "time": 1525443719722, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888a3eb3708c182f:0xf64d627879b8d177"}
{"user_id": "114515934938416672201", "name": "Anita Eubank", "time": 1621200659838, "rating": 4.0, "text": "Black Widow Chimney Sweeps came for an inspection and chimney sweep. They gave me an inspection and cleaned our chimney to having it looking like new. They were quick to come, the next day after I called, and did a thorough and wonder job in all areas. I was totally satisfied with their work. They stayed close to the estimate I was quoted and did a great job all within a couple of hours. They took great care to keep the inside of my home clean as well. Very satisfied with their work and would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "110290040646634383020", "name": "Jeff Cornelius", "time": 1615320466538, "rating": 5.0, "text": "Had a great experience with Black Widow Chimney. They converted the fireplace from had to wood burning, added a natural gas starter, and repaired the chimney cover. They were courteous, quick to respond, and did a great job. I would definitely recommend them and use them again.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "108337404331966750821", "name": "John Timson", "time": 1615854966438, "rating": 5.0, "text": "Patrick and  Cameron were a pleasure to have in our home. The work was completed in good order and a the cost that I was told beforehand.  If  you have any fireplace issues call BLACK WIDDOW.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "112117004667785821247", "name": "Andrea Lucas", "time": 1602796895808, "rating": 1.0, "text": "I wish I had read these reviews before hiring Black Widow to do an inspection on our new home that had 3 fireplaces and we wanted to make sure they were 'wood' ready. After raving about the skill level of the mason that built these fireplaces in 1986 they still came up with several issues that had to be dealt with including cleaning, to the expense of OVER $5,000. We were appalled at the price because we do have some knowledge of masonry. Had someone else come out who said our fireplaces were good to go...did not even need cleaning as they did not appear to ever have been used for wood. I've never had a bid before that I thought was almost criminally high!", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "108573913227812538486", "name": "katherine tucker", "time": 1615177190961, "rating": 5.0, "text": "They made our super old, used, and neglected fireplace like new!  👏🏼 💯", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "106705933878651557307", "name": "Felicia Scalzetti", "time": 1512581207751, "rating": 5.0, "text": "I had an amazing experience with these gentlemen. They kept me informed at every step, were more than willing to explain what they were doing and why and did an absolutely wonderful job. Could not recommend them more highly.", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "103047225937755520180", "name": "Kelly Grimes", "time": 1515081940323, "rating": 5.0, "text": "Worked with Cameron and his brother on several issues with my chimney. They worked very quickly, responded to my making an appointment on very short notice, and gave me lots of good advice. Will definitely use them again in the future. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
{"user_id": "107470359940271761700", "name": "Kathy Turner", "time": 1503931999217, "rating": 1.0, "text": "Watch out for this company  - I got a quote to do a chimney sweep and inspection from a competitor for $169 - a discounted price since it was August.  I mistakenly texted this company to reschedule my appointment (thinking I had called the other company).  Carmen knew I was not his customer and he took advantage of the situation.  After the inspection and cleaning was done - he would not accept the quoted price of his competitor and made me pay $249.  This was $80 more!!!!  I objected and reminded him it was \"August\" and I was given the $169 quote as a Summer discount.  He raised his voice at me and was completely unprofessional - to the point where I told him to leave.  Lastly, he had me make the check out to him personally, which raises some other questions.  I would not recommend this company!", "pics": null, "resp": null, "gmap_id": "0x88891a4f1df93545:0x74862f95b3dad52c"}
