{"user_id": "107901642284701835668", "name": "Akinajin", "time": 1508088180327, "rating": 5.0, "text": "Lived here most of my live. Great place to raise a family.", "pics": null, "resp": null, "gmap_id": "0x888925def155cd2d:0xe88494d7e6b947db"}
{"user_id": "105192036104543660004", "name": "Gwen Bergeron", "time": 1600022414052, "rating": 1.0, "text": "My 3 adult daughters & I came to Orange Beach & stayed at the Phoenix  X for Labor weekend. The condo was fabulous, the beach was clean, the water was beautiful. We arrived late Fri. evening. Sat. we went out &purchased 4 beach chairs,2 umbrellas & ancors. We hauled it all back to the room that evening.  Sun. morning noticed that everyone left there's on the beach(Sat evening) that Sun. afternoon we left those items on the beach, planning to go pick them up after dinner. We returned between 8:30 & 9pm and went to pick up our things.We were told the city cleans up the beach & they throw everything. We were not advised about that when we checked in. The sign @the desk was at the end of the counter & there was something obstructing our view from where we stood. There were no signs on the way to the beach nor in the elevators stating that. The least the clean up crew could have done is  put the brand new chairs & umbrellas in lost & found. Needless to say that sure ruined a good weeken & lost $150.00 of beach necessities. I think between the town & The Phoenix X we should get reimbursed.  I certainly could not afford to lose that amount of money. Sorry to everyone that my rant wa so long.\nGwen B. from Louisiana.", "pics": null, "resp": null, "gmap_id": "0x889a0652e4abc14d:0xb8c97c82ca7cf34f"}
{"user_id": "113453919801107937436", "name": "Eric Daily", "time": 1601040681108, "rating": 5.0, "text": "I love these people!", "pics": null, "resp": null, "gmap_id": "0x889a0652e4abc14d:0xb8c97c82ca7cf34f"}
{"user_id": "104674782787422072897", "name": "Craig Winn", "time": 1548561410527, "rating": 5.0, "text": "City hall is three buildings in one. It has bikes for the trails and the council chambers. Great facilities.", "pics": null, "resp": null, "gmap_id": "0x889a0652e4abc14d:0xb8c97c82ca7cf34f"}
