{"user_id": "108445540745045269123", "name": "Cecil Knight", "time": 1611269971886, "rating": 5.0, "text": "Handicapped parking at door.  I had no problem getting my wheelchair into ground floor office.  Was helped by clerks to pay for a new city business license for 2021. Got a paper copy of my license.", "pics": null, "resp": null, "gmap_id": "0x88626589cf8f5d09:0x9dad391054721d60"}
{"user_id": "112665726080880624848", "name": "B_onthe_road State Park Traveler", "time": 1578051683068, "rating": 5.0, "text": "My husband and I had to visit here and everyone was extremely helpful and kind! Love Madison! Thanks for the great service by everyone there.", "pics": null, "resp": null, "gmap_id": "0x88626589cf8f5d09:0x9dad391054721d60"}
{"user_id": "103781568347132061522", "name": "Kim Tannehill", "time": 1485853574325, "rating": 5.0, "text": "Love our Madison Police department!", "pics": null, "resp": null, "gmap_id": "0x88626589cf8f5d09:0x9dad391054721d60"}
{"user_id": "110308963633685543301", "name": "Neatsuniques Neat", "time": 1621282569970, "rating": 1.0, "text": "Zero customer service, employee was waving his arms asking do \"you think I'm lying to you\" simply because I asked a question to confirm his answer. Zero consistency when speaking with different employees and asking the same question. Asked to speak with a supervisor, whose first question was \"are you taping our conversation\" and \"maybe come earlier\" after being there for over a hour, apparently not enough time for the rude employee to assist me. Did I mention at the time only one other customer in the waiting area, who left not long after I sat down. Worse experience ever.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xc5ce49600680283c"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1555098990566, "rating": 1.0, "text": "Simply an embarrassment.\nThis city is not just behind in the private and public sectors, but the small task of obtaining or renewing a business license seems  like a daunting task to be performed by city personnel. There is no true customer experience or respect for business owners, no proper procedure to makes these transactions streamline. It goes beyond the pure lack their training, lack of technology and business ethics.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xc5ce49600680283c"}
{"user_id": "106945068968184690848", "name": "Jessika Crooker", "time": 1557496707076, "rating": 1.0, "text": "The state holds your tax refund for over 5 months when you do not even owe anything. They waiting to be sued", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xc5ce49600680283c"}
{"user_id": "105918788846928736101", "name": "Mark Cecil", "time": 1528202217617, "rating": 5.0, "text": "I have been using various accountants since 1986. For the first time ever I feel like I am in good hands. Alexis Willis always calls me ahead of deadlines and believes that the details matter. She takes very good care of me.", "pics": null, "resp": {"time": 1529527353153, "text": "Hi Mark, thanks so much for taking the time to leave us with this fantastic review! We are so glad to hear that Alexis has been such a great help to you. Have a marvelous day!"}, "gmap_id": "0x889a0def50699735:0x9ad5659b73a03edd"}
{"user_id": "100780703447591526502", "name": "Nicholas Ward", "time": 1615992799483, "rating": 1.0, "text": "Cannot get an appointment at this office? I have been trying to get in contact with someone from the IRS for a year and have not been successful.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "113637114387139401943", "name": "Candace Jones", "time": 1495925645110, "rating": 1.0, "text": "Please call the 1 800 numbers or numbers given on the main website. I thought I would receive better service in person from the local IRS in Birmingham. I unfortunately visited this office in May of 2017. Also, remember you must now make an appointment. Not helpful and not friendly. Upon first entering the office doors I was treated horrible. The security guard is the only person who will treat you with kindness. Very nice man. Once you enter watch out. I came there for help and was greeted with such disregard or respect. I left feeling like what was the point trying to obtain help. I am a taxpayer trying to resolve an issue and the person at the front desk is being condescending and rude. He interrupted me several times as I was trying to explain. Grabbed his head as if I was stressing him.\nNo effort taken to try and help or assist me. What is the point of this local IRS office? I just left. I felt like crying. I was glad I did not schedule an appointment with this office. So, I called the main IRS number. I was treated with so much respect and kindness. In addition,  she apologized to me. They made an error on my account. Such a simple problem. I will never ever go to this facility again. I work hard and do not deserve this kind of disrespectful behavior I received from that front desk person. You are already stressed walking in. Anyway, I am glad I know I can receive better service from the numbers on the website. Just kind of sad the local office in Birmingham is not a place I can consider.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "105970757067103209668", "name": "Rosalind Lewis", "time": 1606856138511, "rating": 1.0, "text": "Cannot get an appointment at this office?", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "100777639727365691345", "name": "Rhonda Hooper", "time": 1565206868117, "rating": 1.0, "text": "Unreliable service!!!!   I called and made an appointment for a Friday @ 1:30.  They called and cancelled.  I then made another appointment for a Wednesday, (5 days later) and they called and cancelled that appointment as well.  Needless to say, I will drive the extra miles to go to an IRS location that actually WORKS and wants to help people.  This office needs to close if they aren't going to be open to help the people that need it.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "113402672812873856083", "name": "B Ben Ezra", "time": 1541788820405, "rating": 1.0, "text": "Very ghetto and low quality service if you go there you will waste your time. Very rude and very dry they just have no feelings you feel like talkin to a dead fish I just hate being here today I wasted my time. the tax officer will not listen to what I say and she will stop me when I was trying to explain to her and she just has one sentence to repeat and doesn't have any motivation to understand my case or to work with me I don't think the name advocacy is right they should be called something else.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "105726020619488276891", "name": "Patricia Hanner", "time": 1545410047360, "rating": 5.0, "text": "Made my app.on time.waiting period was about 10 min.took care of my business quickly and I was out the door.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "111816526097702550025", "name": "Missy Norris", "time": 1504811660771, "rating": 1.0, "text": "Super rude person at front desk. Now they require you to make an appointment. I didn't know so she slammed a piece of paper down in front of me giving me a phone number to call to make an appointment. It costs nothing to be kind. This receptionist had zero clue how to be nice to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "118370180648559425405", "name": "Dan Nathan", "time": 1551739616282, "rating": 4.0, "text": "Great secretaries!!!", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "100217946905639837380", "name": "Jason Higgins", "time": 1583158717111, "rating": 1.0, "text": "Useless phone number", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "103002249395833179187", "name": "Artonious Thomas", "time": 1544035395863, "rating": 5.0, "text": "Helpful!", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "114529022604082821880", "name": "William Whitson", "time": 1523896358864, "rating": 2.0, "text": "I had to show the Tax Officer how to file my taxes. We even got a second opinion from an IRS Officer in Austin Texas, and the ending results were identical to my figures. But now no one is talking! I give you all two stars because only two individuals have responded to my issues!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "103323050013210560635", "name": "Frog Price", "time": 1488605540413, "rating": 1.0, "text": "It is the center for the IRS in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
{"user_id": "112198720729865775080", "name": "Leo Rasta", "time": 1458909113086, "rating": 1.0, "text": "Terrible service. Filed taxes months ago", "pics": null, "resp": null, "gmap_id": "0x88891f1a1ede22d5:0xfc2cea8e19099f3"}
