{"user_id": "112269060255262896730", "name": "Nick_the _gamer", "time": 1626056419988, "rating": 5.0, "text": "Auburn police is wonderful and hard working", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "103943078300683378386", "name": "Mary Rober", "time": 1556163875692, "rating": 1.0, "text": "There are some nice police officers but for the most part they are dirty and fail to protect citizens from people of power. They work with a terrible DA, Brandon Hughes, who is known for sleeping with several police officers and other people that work for the local government. Maybe the police should do their job and protect everyone not just the people who are well connected. Maybe they should start investigating people like Brandon Hughes and Mary Roberson instead of people walking home from the bars.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "108061451673256323067", "name": "Skip Iron", "time": 1530031138342, "rating": 1.0, "text": "Terrible experience with these cops. They taught me the very important lesson: telling a cop the truth regardless of the circumstances only results in them selecting you to bully today.\n\nI'll hand it to the people in the magistrate's office. They were awesome, helpful, considerate, and apologetic for the situation... However, I have nothing for Auburn PD. My experience with them has been that they are mostly comprised of lazy bullying power trippers.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "103524593720489527503", "name": "Saddie Bell", "time": 1574477594601, "rating": 1.0, "text": "I have had to call the APD to my place of employment twice due to a suspicious vehicle in the parking lot late at night. The first time it took them over 20 mins to get the my work place and the vehicle had left and the asked me for details of the vehicle after I told them I had went to the back of the building where there were no windows for my safety. And the second time I have called was due to someone knocking on the door saying it was a delivery. Mind you I am contracted through another company to clean this place therefore I don’t receive delivery or sign paperwork. I informed the  operator of what happen and told them that the office was closed and there shouldn’t be any deliveries. They said they were sending an officer over needless to say the person was still in the parking lot trying to make me sign paperwork and the police never showed up to my knowledge I never spoke with an officer. The APD never informed me of what the out come was or if it was safe for me to leave I have to call someone from home to meet me outside of the building in order for me to leave the building.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "115902542362135346368", "name": "John Reeves", "time": 1480975646262, "rating": 5.0, "text": "Two officers responded to my daughter's trailer to investigate a possible break-in. They arrived in a timely manner and went through her trailer and luckily nothing was wrong. They were extremely considerate. Two thumbs up.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "107808592550428054271", "name": "Cody Kane", "time": 1535660038218, "rating": 5.0, "text": "Extremely respectful and helpful. I am an Auburn area supervisor of the largest  private security company in Auburn  and have interactions with them frequently.  Their goal is always to serve and protect.\n.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "114667358135802111296", "name": "Teaperk", "time": 1556823230739, "rating": 1.0, "text": "Lazy, lackluster attempt to resolve my case. Without going into details, my case would’ve been better resolved had I not gone to the police in the first place. They in fact made the situation worse, with any resolution near if not impossible.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "107500520057652625641", "name": "DCON TBIRD", "time": 1487872238434, "rating": 1.0, "text": "I was in a auto accident with Lorenza Dorsey  the captain of the auburn police dept. I was traveling on 280 and he was behind me for a few miles. I turned off on 72 and I was waiting to turn in my co workers driveway when I was rear ended by Dorsey. Speed limit was 45 mph and he totaled my vehicle. Then he was picked up from the scene no drug test or anything was performed. To top all that he didn't check on me.   So be careful when the Au police is behind u", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "106116799092457584323", "name": "Al W.", "time": 1579639912079, "rating": 5.0, "text": "make safe good ys good", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "106340339288890975145", "name": "Dave Johns", "time": 1601310215035, "rating": 5.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "101124790322538686908", "name": "Paullie Shore", "time": 1490634763962, "rating": 2.0, "text": "got stopped for \"not having my seatbelt.\" Was charged a fine, i had my seatbelt on the whole time, during the drive to work and during the police officer talking to me...", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "103389008835737155817", "name": "Chris O’neil", "time": 1517597128151, "rating": 1.0, "text": "Called to ask about a parking ticket that I recieved even though I had paid the meter. I was transfered to the records court where a very rude woman informed me that wasn't her job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
{"user_id": "102486386054104990696", "name": "Melinda B", "time": 1461010934057, "rating": 1.0, "text": "Auburn Police Department is full of despicable, cowardly, poorly trained officers.", "pics": null, "resp": null, "gmap_id": "0x888cf2e3c18255c3:0xd48e0ce741c5a4a5"}
