{"user_id": "110490189661737074497", "name": "Rick McGalliard", "time": 1511560800120, "rating": 5.0, "text": "Attorney Brian Mann has been the most professional, caring and competent attorney I have ever had the privilege of repeating me. In regards to a divorce and adoption he has been   a tremendous attorney to have fighting on your side. With the quality and level preformed for my family in the past I am now working with him on a 3rd issue with peobaye court and have every confidence that he will right the wrong and the injustice done to us by the Elmore county probate court. He charges his clients affordable rates and also takes the time to listen to better right your case. I would recommend Brian Mann to anyone who needs representation in his area of expertise. If Google allowed me I would give more than 5 stars.", "pics": null, "resp": null, "gmap_id": "0x888e810877d82d83:0xad2700c8d5010d56"}
{"user_id": "100128854852742012352", "name": "Maxine Rudolph", "time": 1559485344850, "rating": 5.0, "text": "Awesome he was very helpful and got me what I needed within no time. Thanks for helping us your awesome.", "pics": null, "resp": null, "gmap_id": "0x888e810877d82d83:0xad2700c8d5010d56"}
{"user_id": "100139219050710075381", "name": "Jud Norrell", "time": 1506999421513, "rating": 5.0, "text": "My sister and I hired Brian D. Mann to represent our family before the Elmore County Probate Court. He prepared a Petition of Temporary Guardianship for me to assist a relative who was temporarily incapacitated due to alcohol abuse that led to a 10-day stay at Jackson Hospital in Montgomery. Judge Enslen granted the Petition without a court hearing, due to the thoroughness of Brian's Petition. We found Brian D. Mann to be an effective, efficient, personable lawyer. His fee was reasonable. I recommend him without reservation to anyone needing a competent, caring attorney.  Judson S. Norrell, Jr.  October 2, 2017.", "pics": null, "resp": null, "gmap_id": "0x888e810877d82d83:0xad2700c8d5010d56"}
{"user_id": "105289765444952925255", "name": "Edythe Dansby", "time": 1537151190120, "rating": 4.0, "text": "Pretty nice guy", "pics": null, "resp": null, "gmap_id": "0x888e810877d82d83:0xad2700c8d5010d56"}
{"user_id": "107709480901266763613", "name": "Auburn Tigazs", "time": 1537306530799, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": null, "gmap_id": "0x888e810877d82d83:0xad2700c8d5010d56"}
{"user_id": "104798417134418637703", "name": "Delray Powell", "time": 1521022391301, "rating": 5.0, "text": "Great lawyer", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPA0wfiaAa_Fgk7b-xs4ZhaOUykxWrlgr4AAgLk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e810877d82d83:0xad2700c8d5010d56"}
{"user_id": "107696732617387598464", "name": "Kim Thigpen", "time": 1621857655676, "rating": 5.0, "text": "They are great and caring people.  He's a great lawyer and he's wife is a lawyer too . I can say enough about them", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "112911317666149635048", "name": "Josh Briggs", "time": 1607571712831, "rating": 5.0, "text": "We came to the Saint Firm after an adoption scam and both a Texas adoption agency and Texas court system that drug their feet and made our adoption process incredibly slow and frustrating.\n\nBeth Saint was able to fast track our adoption process and was incredibly quick to respond to any questions we had. I cannot recommend her enough.\n\nThank you so much for helping us through this journey and making it a simple process for us. We are forever grateful!", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "112779911060965811749", "name": "Leigh Ann Roberts", "time": 1600798918215, "rating": 5.0, "text": "I hired Beth Saint to probate an estate and I was extremely pleased with her services.  She handled all of the details professionally and kept me completely informed throughout the entire process.  I was able to turn it all over to her and know it was handled. I couldn't have been more pleased and I highly recommend her and her office.", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "105880853609112410697", "name": "Dana Greene-Davis", "time": 1596885918394, "rating": 5.0, "text": "I hired Mrs. Hardeman Saint. I can not say enough good things about her or her husband Mr. Saint. I have had multiple bogus lawsuits filed against me since 2013. I hired more attorneys,  because the first two didn't do a lot even though they charged a fortune. I hired the Saint Firm, the best decision ever!! I am thankful I did. Mrs. Hardeman Saint had two weeks to the day to get prepared for my ••cases••. Remember I already had two other attorneys, one from '13 and another one from February '19 that did very little to almost nothing. I HIGHLY HIGHLY RECOMMEND BETH & PATRICK. They was always accessible, friendly, easy to understand, affordable, and went above and beyond to finally get me closure on my parents estates and all the other frivolous lawsuits that was filed as a smoke screen and to cost me more unnecessary money. In less than 45 days they was able to put all of the bogus frivolous lawsuits to bed forever.  If you want attorneys to get things done correctly and quickly the LOOK NO FURTHER ~~ HIRE THE SAINT FIRM ~~. Also just for the record Beth is a bulldog and doesn't take any bull from other attorneys. She will call them out!! She fought for me, didn't back down, was always available and had to go against a very evil crooked lawyer and client of that particular attorney. Again I want to reiterate if you want results and want them fast hire the Saint Firm!!", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "116259907620190909454", "name": "Katharina Bailey", "time": 1601512990415, "rating": 5.0, "text": "We would recommend their service.Beth was great at explaining things to us so we could understand.", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "111702856358358296045", "name": "Pat Ireland", "time": 1593634149658, "rating": 1.0, "text": "Took all my money and did not even have a Hearing or appearance for me. He then withdrew and did not give me one cent back. His action were terrible. I am even a fellow Marine Corp Veteran you would think he would have treated a brother better. Do yourself a favor find some one else on any matter", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "108543232801124329277", "name": "Charles Lamar", "time": 1621516320042, "rating": 1.0, "text": "Very unprofessional ,would not recommended her to anyone", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "102415385673476749521", "name": "Lauren Bourland", "time": 1600440098870, "rating": 5.0, "text": "Beth was professional and very knowledgeable. Would use her again!", "pics": null, "resp": null, "gmap_id": "0x887d49afdf185879:0x1638fddb2cf33ae3"}
{"user_id": "116398742803353060106", "name": "Becky Hicks", "time": 1622860838279, "rating": 5.0, "text": "Won cases over and over for me. Unbeatable cases he slammed dunked it. From criminal to family court Chip is the best. I've recommened himself to my brother and cousin which all won their cases as well. You dont have to worry when hiring this attorney. If you need a win pay alittle more and you wont regret it. When all other lawyers say theres no hope, call Chip he will find a way for you.\n\nWish he practiced in all states because I could use a lawyer like himself right now in Gatlingburg TN.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "104685048074420088723", "name": "Haley Lyckman", "time": 1611879307430, "rating": 5.0, "text": "When I got hit by a drunk driver that totaled my car and racked up thousands of dollars in medical bills I was so overwhelmed. I took my case to Jonathan at the Cleveland Firm and he handled everything. He kept me informed every step of the way and was so easy to speak to. He took care of every worry I had. 20/10 would recommend for any legal issue you have.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "109340672119456126203", "name": "Josh Bowman", "time": 1605207073538, "rating": 5.0, "text": "Very impressed with the professionalism and guidance I received while trying to work my property case with the help from Mr. Jonathan Wynn. Jonathan went above and beyond to make sure everything was in order so it could go as smooth as possible when settling this case. I didn’t feel rushed or confused on anything I came across with this for Jonathan’s willingness to help and walk me through the procedures and what all we had to do. Any future case that I will need settled will DEFINITELY be through the Cleveland Firm, LLC. Strongly suggest Jonathan Wynn!", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "100000174414182321947", "name": "James Wright", "time": 1597899036379, "rating": 5.0, "text": "Helped me on a wreck involving a man that hit me from behind .we made a deal out of CT.honest man got more than I asked for.played 🏈 at the same school as my half brother.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "117458056153669587296", "name": "Virginia Green Nowling", "time": 1580248359251, "rating": 5.0, "text": "Great colleague.  Highly recommend Chip and his staff.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "112466944963592535396", "name": "Jen Blozik", "time": 1538062997060, "rating": 5.0, "text": "There aren't words for how well the whole staff has and still treats us. We are going though the most important time in our lives and they have truly been there for us. I can't ever imagine anyone fighting harder and treating us like we matter and our case matters to them .", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "113923206433117986533", "name": "KatyPerry Isahologram", "time": 1560695652077, "rating": 1.0, "text": "This guy is a joke.  He has people working at other law firms feeding him info on clients.  He only wants your money.  This guy needs to be disbarred and should be sued for malpractice.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "116323598659863386547", "name": "Flat Earth Florida", "time": 1569098566833, "rating": 5.0, "text": "The earth is flat. Youtube \"Eric Dubay\"", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "101977308534558765548", "name": "Josh Yates", "time": 1511278187050, "rating": 5.0, "text": "Highly Recommend for divorce, final Will, and legal consult for small business.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "107561874209889157433", "name": "Kristen Eaves", "time": 1506701731601, "rating": 1.0, "text": "They didnt even take the time to actually look at the case . I would not go to this law firm for any reason !!!", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "103478723487000422341", "name": "Lindsey Patterson", "time": 1613063126672, "rating": 5.0, "text": "Awesome service! Very detailed, oriented and helpful!", "pics": null, "resp": null, "gmap_id": "0x889a4fd6a0ea528b:0x953d0577792ec3e0"}
{"user_id": "106034866192718884668", "name": "Perry Callier", "time": 1587133262451, "rating": 5.0, "text": "Very professional and knowledgeable Attorney. (Very helpful)", "pics": null, "resp": null, "gmap_id": "0x889a4fd6a0ea528b:0x953d0577792ec3e0"}
{"user_id": "115119991698570499247", "name": "Robert Miskel", "time": 1575757709945, "rating": 5.0, "text": "Kinda spooky my calls to places are asked to be rated, but very friendly office.", "pics": null, "resp": null, "gmap_id": "0x889a4fd6a0ea528b:0x953d0577792ec3e0"}
{"user_id": "111183483740651811351", "name": "Cornelius R. Marshall", "time": 1578992689061, "rating": 5.0, "text": "Great Service 👍👏👏👏👏", "pics": null, "resp": null, "gmap_id": "0x889a4fd6a0ea528b:0x953d0577792ec3e0"}
{"user_id": "107478628403180647468", "name": "Patricia Williams", "time": 1556165885607, "rating": 3.0, "text": "Just passed by enrout to another location", "pics": null, "resp": null, "gmap_id": "0x889a4fd6a0ea528b:0x953d0577792ec3e0"}
{"user_id": "109164684547844050282", "name": "Sherita Watts", "time": 1606931123212, "rating": 5.0, "text": "Attorney Donohoe is very nice and personable. She has a very sweet disposition and seems to genuinely care about her clients. I'm very excited to work with her in regards to my case.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "116999504716091426399", "name": "Marvin Patterson", "time": 1599751943021, "rating": 5.0, "text": "I honestly can say Donohoe & Stapleton Law Firm are one of the best if not the best law firm in the state of Alabama. I've use them in the past on a workman's comp claim that I was taken advantage of and they stepped right in & got me some money. I'm here with them again for another workman's comp claim & my social security claim. I recommend them to anyone who has a wrongful death claim, personal injury, workman's comp, or a social security claim believe me you won't regret it, plus you don't have to pay anything until you win so what do you have to loose.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "112768822080264939329", "name": "Shirley Jenkins", "time": 1597544613653, "rating": 5.0, "text": "Mrs. Donohoe is an amazing, awesome and great lawyer. Mrs. Donohoe, helped me with my disability case and she won my case. I appreciate Mrs. Donohoe for not seeing colors with her clients. Mrs. Donohoe doesn't judge her clients she help them to the fullest. Mrs. Donohoe, I will refer other clients to you", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "102967733223985024889", "name": "Dorothy Leonard", "time": 1599766769550, "rating": 5.0, "text": "Dorothy Leonard I was referred by my friend to ms C Donohoe I am very Glad that I did when I carry my paper work to her she and her professoional Staff and my friend told me that she will do just what she say she will do . ms C Donohoe won my Disability case the very time as well as the second time yes she did it again and yes she did it I WON .i just want to take this time out to Thank her and her Staff  for a job well done and yes I will be happy to Refer her love 💕 you and Thank you for a Job Well Done  ms C Donohoe", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "113148444887872984624", "name": "Pam Carr", "time": 1600967932092, "rating": 5.0, "text": "Everyone in this office is always very helpful and willing to go the extra mile. Professional and caring", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "113356198915707553860", "name": "Lisa Girdner", "time": 1599671864042, "rating": 5.0, "text": "Representing me in my worker’s compensation going a wonderful job, assistanting me with filing my SSI disability. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "118401027801011364869", "name": "Sallie Davidson", "time": 1601665757643, "rating": 5.0, "text": "Donahue & Stapleton represented me and I was very pleased with her service and staff, they are very professional and i would recommend them to anyone", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "107315601011240240925", "name": "Vonomecia Jackson-Ashley", "time": 1603818156923, "rating": 5.0, "text": "I can say that with Cathy Donohoe she literally cares about her clients. She took care of everything I needed with all the paperwork and she was very professional at all times. Thank you for all the work you have done to assist me during my case.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "100245074823887562923", "name": "Harold Whatley", "time": 1597360467321, "rating": 5.0, "text": "Awesome lawyer when ever I needed someone Cathy was quick to respond  to every situation from both of my workman's compensation cases and disability case , she treats you like family from day one, I can always count on Cathy and her staff to get the job done.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "117975681058026231997", "name": "T S", "time": 1596116814385, "rating": 5.0, "text": "Mrs.Donohoe is a very lovely nice lady , and she's the best Lawyer , I've ever met . If you need a disability lawyer , you'd be crazy not to go to her ..", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "101273084664864710342", "name": "Carlos Mcgee", "time": 1603814242113, "rating": 5.0, "text": "She listen to me antently. She showed concern.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "103474613726038567927", "name": "Damion Lymon", "time": 1601665048895, "rating": 5.0, "text": "Very professional staff, i would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "112427207298201118471", "name": "Toni Leake", "time": 1585233577342, "rating": 5.0, "text": "Miss kathy has been my attorney for a long time she won my workman's comp and my disability she treats everyone like family i just love miss kathy thank you for all you've done for me", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "113127185090687087488", "name": "Marie Taylor", "time": 1498490038700, "rating": 5.0, "text": "I had the pleasure of retaining Ms. Donohoe through a personal referral. This was a complex personal injury case which could have been drug out for years. From the on-set, I found her to be very professional and focused on my needs, not her potential profit. Her level of knowledge, detail and preparation was very impressive. She did not leave anything to chance. She actually examined every possible piece of evidence, spoke with multiple witnesses, and even compiled a comprehensive matrix to determine future medical costs that I will no doubt have to address for a long period of recovery. Again, very impressive and thorough!\n\nMs. Donohoe, and her staff, made me feel at ease, and very confident that I would prevail in my case. And, I did. In a short time, and without court, she was able to secure a significant settlement that now I can rest knowing that I can cover all of the many medical expenses ahead. Now, I don't have to worry about the career I lost because of extended hospital stays and many, many medical appointments. I don't have to worry about losing my home, my car, my self worth. Because of Cathy Donohoe, I WILL SURVIVE! I will have my life back!\n\nWould HIGHLY RECOMMEND this attorney and her entire team!", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "116147410179540614338", "name": "Shawndrika Watts", "time": 1578683645349, "rating": 5.0, "text": "She is helping me with my social security case an I am very satisfied with her service", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "102219555799163263597", "name": "Rebekah Clark", "time": 1536191395477, "rating": 5.0, "text": "Cathy and her staff were very professional and understanding. They helped me win my case in a very short period of time. They were also easily accessible and walked with me through the process. I would recommend them again and again. Thanks for all that you do.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "102260193726657310898", "name": "Ed Eaton", "time": 1605540656084, "rating": 5.0, "text": "Great and knowledgeable attorney.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "108206325389859959094", "name": "Carol Coleman", "time": 1588257865229, "rating": 5.0, "text": "Cathy Donohoe help me with my disability and a she was awesome", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "117617243850295454582", "name": "Valencia Parks", "time": 1489100070410, "rating": 5.0, "text": "Ms. Donohoe was very thorough & professional with the handling of my case. Being turned down really had me about to give up. She made me feel that I was a priority, instead of just another case.\n\nI really appreciate her & Ms. Liz for their time & professionalism. I would recommend their services to anyone I encounter. Thank you so much for resolving my case.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "111830316325929684539", "name": "Archie Cox", "time": 1571109496095, "rating": 5.0, "text": "I would recommend Cathy with any help you need with your SSDI.She is very understanding and professional about client's needs.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "101277699250396059071", "name": "Mark Hudson", "time": 1598627203702, "rating": 5.0, "text": "Donohoe represents me on my Workers Compnsation and social security cases. I would refer her to everyone", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "114414805906040481681", "name": "Linda Gilbert", "time": 1495679330049, "rating": 5.0, "text": "I met Cathy yesterday for the first time. She immediately makes you feel welcome and puts you at ease.  I am filing for SSD which is scarey for me. She answered all my questions, eased my fears an gave me confidence in this process. Her secretary Emily is great. Before l left information was sent to SS office. That's fast and efficient. She called to check on me today. She genuinely cares. She is smart, funny and honest. I hope l never need another attorney but if l do it will be Cathy Donohoe. I would highly recommend her.\nThank you Cathy for everything.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "114630495071805215357", "name": "Swaylo Rendae", "time": 1551366840313, "rating": 5.0, "text": "My name is Debra Todd Ms.Donohoe won my social security case im so happy and highly recommend her to anyone who need help with there disability", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "117909389863287313042", "name": "Angie Edwards", "time": 1559535488173, "rating": 5.0, "text": "Very helpful staff and helped me out alot when I had my law suit with Wal Mart cause of a job injury, and now bout to recontact them bout another case.. would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "100162318242021140986", "name": "sherita pettway", "time": 1539606218287, "rating": 5.0, "text": "Mrs.Cathy Donohoe is the best lawyer in Montgomery her and her staff welcome me with opening arms and the best part is that they put God first and I love it thanks so much.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "113666812540360586891", "name": "Emily Warrick", "time": 1493904619274, "rating": 5.0, "text": "Cathy represented my husband and both sons in a pretty traumatic personal injury case.  She was very aggressive in our cases obtaining a settlement within months of being retained.  She was sympathetic to my minor son's resulting medical conditions, and even after the case was resolved, would still call to check on him and my husband.\n\nShe also represented my husband in his disability case due to the injuries he received in the accident.  It was a fully favorable decision.  She thoroughly explained the process to him and walked side-by-side with him until his benefits began.  Very professional, very aggressive, definitely client-oriented.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "107031060587589961887", "name": "Edward Pettway", "time": 1538578830728, "rating": 5.0, "text": "Mrs.Cathy Donohoe and her staff are amazing the second you walk threw the door they make it all about you.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "105790428630669930218", "name": "Ann Sheppard", "time": 1575954374383, "rating": 5.0, "text": "Cathy Donohoe is a very good lawyer.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "115865580159442476466", "name": "Cathy Donohoe", "time": 1578613230472, "rating": 5.0, "text": "Thank you to all my clients that gave us a 5 out of five rating.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "117070559021209280634", "name": "Cheryl Pettiway", "time": 1499497769283, "rating": 5.0, "text": "I had a great experience with Dohonue she Won My Social Security Benefits For the ( Bench) Thanks for been a loyal Outstanding Attorney.....", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "102133428970078905706", "name": "patricia kerber", "time": 1491823390964, "rating": 1.0, "text": "I would not use any part of this company, she an very bad lawyer, she lies to you don't tell the truth I put 5 complete to the start bar she think ok that I got my finger cut off by McAlister's Deli in Prattville I belive she got payed off ,and made an loan in my name and made an false workman's comp case in an other state ,where I almost was put in jail ,for frud ,so I tell everyone that never use this company, will give you all papers,she need to discuss bar from bing an layers, she and her other person Liz is very rude .", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "113242259121948779278", "name": "James. Edward Gholston", "time": 1570875621247, "rating": 5.0, "text": "It's  great", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "104166133665151139794", "name": "Tina Roehm", "time": 1510332036606, "rating": 5.0, "text": "They are the best law firm in Montgomery AL.", "pics": null, "resp": null, "gmap_id": "0x888e81db401243bf:0xca8e447584c51c00"}
{"user_id": "117654717587158612679", "name": "Kernisha Duvall", "time": 1619703199771, "rating": 5.0, "text": "I want to say thank you to John Watts and his team for helping me with my case. They were able to get it dismissed without me even having to go to court. I am super appreciative and would recommend them and their services to everyone.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105869914703978167312", "name": "Tanya Metcalfe", "time": 1623777522378, "rating": 5.0, "text": "When I received a letter in mail informing me that I was being sued I was terrified. I immediately got on the internet and researching law firms in my state that handle cases like mines. That’s when I came across Watts & Herring, LLC. The instant I called them they insured me that they could get the situation handled for me with any problems, and that’s just what they did in a matter of no time. They always were very informative when dealing with the matter. I would refer them to anyone, especially to people who are inexperienced in such situations. Watts & Herring you are the best in Alabama!", "pics": null, "resp": {"time": 1623778212463, "text": "Thank you Tanya for letting us help you and for leaving us such a kind review!  We appreciate you and have a great day!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "117172154683851473970", "name": "Scott Chamblin", "time": 1619366037113, "rating": 5.0, "text": "I would just like to take a moment and thank Mr. Watts and let everyone know who is skeptical, this firm, Mr. Watts is hands down very professional and very trustworthy. Please put your trust in them.  I had a very scary situation where I was summoned to go to court because I was being sued by a debt buyer that I had no obligation to.  This was gonna put an overbearing restraint on my livelihood. I seen an ad or video online with Mr. Watts, I listened and took a leap of faith, it was the right choice and I'm so happy I took that leap.  Please please trust in them if your a little skeptical. They resolved my issues and fought for me, I now no longer have a debt buyer trying to sue me, my case was dismissed.  I highly recommend them to anyone without doubt. Thank you so so much Mr. Watts you are a life saver.  I will definitely use them from now on in any future disputes.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "118213930158481461879", "name": "Talbert Griffin", "time": 1609434285414, "rating": 5.0, "text": "When I first heard about Watts & Herring I was a little skeptical. Everyone seemed so happy with their professionalism, expertise, service and most importantly, results. It seemed like one of those \"too good to be true\" scenarios. HOWEVER, it wasn't! John and his associates exceeded what would have satisfied me. Their communication, speed of responses and advise led to the perfect outcome.\nI had a debt buyer that sued me, and with John at the helm, we were able to get it dismissed and he is now working diligently to get it off my credit report. My wife has perfect credit and I always felt this was dragging us down, but after John's work, I feel confident that I'll be close to her score very soon. Thanks John!", "pics": null, "resp": {"time": 1609436757856, "text": "Talbert thank you for the review and glad we were able to get a good outcome.  Thank you for sharing your experience and thoughts and we'll talk to you soon!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112096260876377638004", "name": "Zachary Upton", "time": 1620397076361, "rating": 5.0, "text": "John and his staff handled my case with a debt collector, effectively, and timely. It is always uneasy and a bit scary when dealing with debt collection agencies. John and staff answered all my questions and just helped put me at ease with my situation. Highly recommend them!!!", "pics": null, "resp": {"time": 1623227842504, "text": "Thank you Zachary!  We enjoyed representing you and appreciate your feedback!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114097832944937957708", "name": "D. Davis", "time": 1608551946098, "rating": 5.0, "text": "John Watts has represented me in two separate lawsuits with debt buyers. I found John online initially. I watched several comprehensive videos he had posted, explaining from A-Z about what to do when being sued by debt collectors. His knowledge and his honest demeanor, is what prompted me to call and request his representation. Thankfully he accepted and managed to get my case dismissed, without me having to pay the debt buyer anything. He also had the collection account removed from my credit report. Without a doubt, I called John when I was sued the second time, and the results were the same as the first.\n\nI’m thankful for finding John Watts and I’m grateful for his help. I also want to acknowledge his staff for their hard work and professionalism. I can’t say enough good things about John and his team. They are remarkable and I appreciate each of their help!\n\nIf you’re being sued by a debt collector/buyer, John Watts is who I recommend. You’ll be glad you did!", "pics": null, "resp": {"time": 1608560956782, "text": "Thank you sir for the kind review!\n\nWe have enjoyed representing you very much. You made it extremely easy to do so.\n\nThanks again and have a great day!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116717206509918334641", "name": "Ernest Powell", "time": 1618523303465, "rating": 5.0, "text": "Would like to talk a minute and thank Mr. John Watts for the awesome job he did for me. I was being sued by a debt buyer and they were very unpleasant to deal with, then i was watching you tube and found a clip of Mr. Watts and called and him and his team handled it for me . Awesome job Mr.Watts and your outstanding professional team. Thank you very much for all you and your team did for me.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116360725516635263894", "name": "James Hutson", "time": 1615055603428, "rating": 5.0, "text": "I called John because I was being sued by a creditor. He was very informative in explaining the steps he would take and gave me many options to help. In the end, his firm handled everything and settled the case where it was removed from my credit report and I paid nothing to the company. They also offered to review mine and my wife’s credit to check for discrepancies and have them fixed. I would never hesitate to use their services again. Thanks!", "pics": null, "resp": {"time": 1615056301944, "text": "Thank you James!  We enjoyed representing you and appreciate you sharing your experience in your review.\n\nThanks again and have a great day!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "118130271917222507194", "name": "teresa crow", "time": 1603855157188, "rating": 5.0, "text": "I highly recommend John Watts.  He is attentive and knowledgeable.  He solved and handled my problems and concerns swiftly giving me peace of mind.  He treated me like I and my situation mattered.   He lifted the weights off of my shoulders and gave me workable things to do to help.  I will be forever grateful.  Give him a try,  You will not be disappointed. .", "pics": null, "resp": {"time": 1603858481385, "text": "Thank you Teresa -- appreciate the feedback and it was great to work with you.  Have a great rest of the week!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "100924768134826905690", "name": "Letarvius Copeland", "time": 1612956754480, "rating": 5.0, "text": "Feeling so thankful! I was being by a debt collector and had zero clue what to do. I then came across a video on YouTube with John Watts explaining in detail on how they can handle my situation. The more I listen the more I also became a student with great understanding of the process. Needless to so I place no situation in their hands and today I’m very pleased with the overall results. I highly recommend Watts to help with anyone’s debt situation.", "pics": null, "resp": {"time": 1612958953387, "text": "Thank you so much for leaving us a review and feedback. You took action when so many are frozen by fear.\n\nIt has been great representing you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "104513541975830554969", "name": "Matthew Huddleston", "time": 1600885379511, "rating": 5.0, "text": "I really don't know where to begin with Mr. John Watts. I found him online a couple of years ago and continue to watch & learn from his YouTube videos weekly. I have used him a couple of times to take care of collection accounts that I had. The entire process was so easy. He was very professional, handled everything quickly, kept me informed with updates throughout the process, and even followed up with me after everything was completed. Where else can you find this type of service from an attorney?\nHe will even answer a text message and give you free advice. I can't explain how appreciative I am & how lucky I was to find an affordable attorney to handle these aggressive collection agencies. I highly recommend John Watts to anybody in need of his services & firmly believe once you go with him you will not go with anyone else. Thank you again John.", "pics": null, "resp": {"time": 1600892859153, "text": "Thank you Matthew we really appreciate the feedback!  It’s been great to help you and thank you for the kind words!\n\nJohn"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116295646187521567843", "name": "Mandy Cantone", "time": 1613167829567, "rating": 5.0, "text": "I called Watts & Herring when a collection agency was attempting to sue me for money on an account that I didn't even recognize. They responded right away and have since closed my case with a favorable ruling, as I owe the debt collector nothing. I am a very busy Wife, homeschool mom, and I have a full-time career. I'm very thankful that John Watts was able to take this off my hands and off of my credit report!", "pics": null, "resp": {"time": 1616958140602, "text": "Mandy thank you for your kind review!  We appreciate the chance to work with you and glad you were happy with the results. Thanks again for leaving us feedback!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "117457186734740566078", "name": "Niga Malone Colbert", "time": 1616113878132, "rating": 5.0, "text": "I received a summons form a debt collector and I freaked out instantly along with the summons was multiple letters from attorneys in my area advertising bankruptcy. I didn’t wanna file bankruptcy so I called John to get an inquiry on what I should do. My call was return promptly and he went over the entire process with me and calmed my nerves. The situation was handled in a short time frame and it was one less thing I had to worry about. I highly recommend this law firm.", "pics": null, "resp": {"time": 1616115994167, "text": "Thank you Niga for your feedback!  We appreciate it very much.  Glad to have helped.  You took the action when so many freeze or give up.  You figured out your rights and then took action.  Thanks for letting us be a part of it and working with you.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "102984914125616422159", "name": "Rita Stevenson", "time": 1604681935587, "rating": 5.0, "text": "I just got off the phone with John Watts who is a consumer protection lawyer. He exhibited excellent customer service. He was patience, knowledgeable, and very funny. Although my situation was serious to me, he was able to put me at ease because of his humorous stories. He also gave me a clear path for a successful dispute. I would  recommend his services to anyone in the need for a consumer protection lawyer.", "pics": null, "resp": {"time": 1607012739902, "text": "Thank you Rita!  Appreciate our conversation and thank you for taking the time to leave us feedback.  Have a great day!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114153263161859430961", "name": "D “Professional pilot” B", "time": 1599839469402, "rating": 5.0, "text": "I reached out to Mr. Watts firm initially after being served by a local court informing me of a suit brought by a debt buyer.  I contacted his assistant, Carolyn, who was awesome!  I decided to proceed with his representation, and the case was settled without having to pay the debt buyer, and within an hour of my signing on with Mr. Watts.  (This must be is some kind of world record).\nFast and professional, if you are dealing with a debt buyer don't hesitate to give them a call.  You won't regret it!!", "pics": null, "resp": {"time": 1599857176967, "text": "Thanks DB!  We appreciate the chance to represent you.  Sometimes these cases settle quickly and sometimes they don't but our goal is to get all of them handled so our clients pay no money to these debt buyers.\n\nThanks for letting us help you and for your confidence in hiring us!  Appreciate the review!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103559134396139038900", "name": "Randall Manweiler", "time": 1603398607139, "rating": 5.0, "text": "Absolutely the best at what he does, and explains the entire process to you. It is very special to have someone who can answer questions before you ask them. You don't have to worry about a single thing, because it is then in the hands of THE consumer law expert. You may feel anxious, but you don't have to. Hire John Watts to take care of business for you.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "101522558568901885622", "name": "MrBlessed7", "time": 1595941091300, "rating": 5.0, "text": "Really liked how my case with the debt collectors was handled. Received a judgment against me and was unsure of my next move. My wife began to research our options, and she came across a YouTube video of Mr. Watts explaining how to tackle these things. It was not so much how to tackle it that stood out to me. Was the principles he stood for the values of right and wrong. He kept saying just be honest in court and very truthful. These things stood out to me and I thought there is someone I want working for me. Someone who values honesty and truth. And I didn’t look anywhere else after that and gave them a call and am glad we did.\nThey were very helpful and handled the case right away, and within a few short weeks we got a settlement in our favor. Thank God for these things.\n\nSo if you are looking for a team that puts the values of truth and good work. This is a place to start.", "pics": null, "resp": {"time": 1600096920584, "text": "Thank you very much for your review and feedback!  It was a pleasure to represent you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "101289052606732396436", "name": "Johnna Calverase", "time": 1595004697813, "rating": 5.0, "text": "John Watts is the most amazing guy and lawyer I have ever had the pleasure of speaking with. I have a very unusual case of questionable debt collection coming from Denmark from a debt collector located in California out of nowhere which is complicated to deal with. So many unknowns and I was unable to sleep because I felt overwhelmed on how to deal with it when I found out.\n\nWithin a few hours of making contact with Mr Watts, he sent me a few steps to take in order to get on the right path to sorting this out. Within 24 hours he called me and we discussed the way forward and we came up with a plan.\n\nHe is easy to talk to, takes the time to explain things and is very pleasant and patient. I feel a HUGE sense of relief now and very confident I have found the right person and firm to navigate my way out of this unusual situation successfully.\n\nThere are not many lawyers that will help with fighting off debt before it goes to judgement or collections. These guys are pretty much it in Alabama and they are AWESOME. This is how EVERY law firm (lets also say every business) should run a business: prompt, detailed, caring, calm, dedicated, hardworking, intelligent, effective and responsive. An absolute breath of fresh air.\n\nI have my plan and I am ready to fight now thanks to Mr Watts!!!", "pics": null, "resp": {"time": 1600097054289, "text": "Thank you for taking the time to leave us a review!  Really appreciate you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110777247615406207741", "name": "T S", "time": 1593229247874, "rating": 5.0, "text": "I was being sued by a debt collector and because of the reviews online, contacted Watts and Herring. They were very easy to deal with. Carolyn was very reassuring.  I was afraid I would have to go to court and that this would ruin my credit. But Mr. Watts had my case settled in a matter of days in my favor! Truly amazing. He was very knowledgeable and took time to explain everything.  I would definitely contact them if you need help with a debt collector!", "pics": null, "resp": {"time": 1593261126993, "text": "Thank you so much for the kind review!  We have enjoyed representing you — you were very easy to work with. Thanks again for letting us help you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "113867845507714433207", "name": "Jennifer Fitts", "time": 1607004312838, "rating": 5.0, "text": "I honestly can’t say enough about John Watts and his team. They took care of absolutely everything. I would give them 10 stars if I could!!", "pics": null, "resp": {"time": 1607005796646, "text": "Thank you Jennifer!  We enjoyed helping you and hope you have a great day!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110663867376935481369", "name": "amelita jones", "time": 1603137944178, "rating": 5.0, "text": "I recently was sued by a debt collector, I had so many emotions I really didn’t know what to do. So I decided to get a lawyer. I went online to look at Mr. John Watts office reviews and determine I was gonna go with them. Ms. Carolyn made me fill at ease and they were very helpful. I would recommend them to anyone who is facing being sued by a debt collector.", "pics": null, "resp": {"time": 1603143687597, "text": "Thank you Amelita for the feedback. It has been our pleasure to represent you.\n\nThanks!!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "100044735006200374086", "name": "Michael Driskell", "time": 1599633179473, "rating": 5.0, "text": "Unfortunately, I was sued by a debt collector. In researching what I was facing, I discovered John Watts' videos on YouTube. I watched every one that possibly had anything to do with my situation. In doing so, I went from feeling uncertainty over being sued to confidence in the outcome of my case. I called his office and Carolyn very patiently went over all the possibilities and my options. I decided to let John and his staff handle my case. Sure enough, one week before my court date, John let me know my case had been settled. If you are dealing with a debt collector, get some peace of mind about your situation...get in touch with John's office. You'll be glad you did!", "pics": null, "resp": {"time": 1600002778490, "text": "Michael, thank you for leaving us a review.  We enjoyed representing you and always appreciate when consumers research their options.  Thanks for letting us work with you and have a great week!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116470819093116160412", "name": "john freeman", "time": 1591808921631, "rating": 5.0, "text": "I contacted Watts and Herring after a debt collector sued me. I contacted them because after some research I quickly saw from reading the reviews that they were the ones to hire. Carolyn immediately assured me I was in good hands and made me feel at ease. From this point on everything was handled quickly, efficiently and smoothly until the case was settled. Throughout the process Mr. Watts kept me informed and made a stressful situation absolutely painless. Mr. Watts and staff are awesome and the ones to hire if something like this ever happens to you. Thanks again to Mr. Watts and staff for helping me!", "pics": null, "resp": {"time": 1600097103055, "text": "Thank you John for your review and the feedback.  We enjoyed representing you -- great to work with good people!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112629264076612335443", "name": "christine barber", "time": 1621273120842, "rating": 5.0, "text": "My experience with this law firm was so amazing, they settled my case within a couple of days, if I'm every in a lawsuit again, I make sure I choose watts & herring!!, Give them a chance you want regret it.", "pics": null, "resp": {"time": 1621387074342, "text": "Thank you Christine!  We enjoyed representing you -- thank you for being so great to work with.  Have a great day!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "113098471219868979646", "name": "Tonya Johnson (Sunshine)", "time": 1627512999182, "rating": 5.0, "text": "Attorney John Watts is extremely good", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "107712266799379515006", "name": "Cassy Reeves", "time": 1587955743499, "rating": 5.0, "text": "Thank you  to Mr. Watts and his staff!  I contact Watts and Herring law firm and spoke with Carolyn. She assured me I was in good hands .  My case was settled quickly and Mr. Watts kept me informed every step of the way. Truly a life saver! The burden I felt before contacting Mr. Watts turned out to be stress free. Everything was done by phone and email.  Thank you again Mr. Watts and may God continue to Bless you!", "pics": null, "resp": {"time": 1603858535791, "text": "Thank you Cassy -- appreciate you taking the time to leave us feedback!  We enjoyed representing you very much.  Thanks!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "107870827802049315805", "name": "Sha B", "time": 1596344828651, "rating": 5.0, "text": "I had debt collectors hounding me while being sick and out of work with covid!!! These debt collectors DO NOT CARE!!! But after doing my research on YouTube, I decided to try Mr. Watts. And I tell anyone reading this he’s well worth it. Kept me up to date!! Answered my emails, and I mean he answered them. Not his secretary or assistant but him personally. Which is very different. I wish I had known of Mr. Watts a few years ago. But GODS timing is always on time. If anyone reading this is like me and read reviews before spending money, then STOP right here!!! Because you found your man!! Mr. Watts will get the job done. Now you have to realize more so now that we are dealing with people that have no morals or empathy because of the shape the world is in now. People sick and losing their jobs. So if you are being sued call Mr. Watts because I contacted him after I answered my suit.\n\nThanks so much Mr. Watts\n\nSharon Berry", "pics": null, "resp": {"time": 1600096868958, "text": "Thank you Sharon for your review -- we really appreciate it!  We enjoyed representing you and thanks again for your feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105022816175334914545", "name": "Meleta Littlefield", "time": 1612831853602, "rating": 5.0, "text": "Great go getter, was being sued from debt collector, was handled quickly, painless, very helpful, professionals.\nThanks John Watts", "pics": null, "resp": {"time": 1612959002479, "text": "Thank you for your review and the chance to represent you!!  Have a great day!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "111703389962815861992", "name": "mike salvador", "time": 1596075192735, "rating": 5.0, "text": "John watts is Top Self guy. They get no better than him. He has done some work for us as nd he gets it done. He does what he says he will do, he can talk the walk and walk the walk. Just cannot express how great he is. Amazing. Thanks john for all u have done for us", "pics": null, "resp": {"time": 1571392062950, "text": "Thanks Mike -- really appreciate your review!  It has been great working with you and your wife. Talk to you soon!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "111781311224711918196", "name": "Charles Eldredge", "time": 1612978740099, "rating": 5.0, "text": "This is the third case that Watts and Herring have successfully solved for me against illegal and predatory collection agencies for accounts that were closed over six years ago.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105174140774656049543", "name": "Don Worrell", "time": 1597280189894, "rating": 5.0, "text": "Wow the communication was amazing sending video messages every step of the way. What ever your case is you can't go wrong with John. Thank you sir!", "pics": null, "resp": {"time": 1600002818945, "text": "Don thank you for your review!  Glad you enjoyed the video messages -- if you have any feedback on how to make those better, let us know.\n\nHave a great day!!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "104344265254153052001", "name": "Aletha Hampton", "time": 1582988758646, "rating": 5.0, "text": "I usually dont write Review and I'm a very skeptical person. But I am so Grateful and Thankful for Mr. John Watts and his entire Team they were God sent and I'm so thankful. I was being sued by a debt buyer/collector and it was not fun. I'm 43 years old single mother that try and do my best every day but sometimes life happens and then your back is against the Wall. To know that people like this still exist is a blessing. This was a burden for me (literally). I am at peace because of Mr. Watts and His Team these people are the entire best you will not be disappointed from the beginning to End! Mr. Watts and his Team truly do want to help people and I'm so when I found him on YouTube searching for some help because I didn't know where to start. Mr. Watts videos caught my eye immediately. I can go on and on about this experience with these group of Amazing people!\nHappy, Grateful, and Truly Thankful 💜", "pics": null, "resp": {"time": 1582998010273, "text": "Aletha thank you so much for your kind review!  We enjoyed representing you very much.  Have a great day and thank you again for your feedback!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "107560659250524115386", "name": "asmiley18", "time": 1595692397210, "rating": 5.0, "text": "Words are not enough to describe just how wonderful John and his staff (Carolyn) have been in dealing with this lawsuit filed against me three months ago. I came across John's YouTube videos at the end of last year when it became evident I'd be sued and decided to save his contact info. Once I was sued, there was only one call to make and that was to John's office. I left a voicemail explaining my issue and Carolyn called me back immediately and explained how simple the process would be. There was no need to go to the office or show up in court! John handled everything and I knew I was in great hands given the prompt communication. I just received an email from John informing me that my case had been settled and I need not pay any money to the debt collector! If you're in Alabama and are facing a lawsuit, call/email John immediately and I promise you, you'll not be disappointed! Thank you, John!", "pics": null, "resp": {"time": 1580560457355, "text": "Thank you so much for your review and the chance to represent you. We enjoyed working with you very much!!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110704564170420389347", "name": "Andre Kistner", "time": 1598617788882, "rating": 5.0, "text": "John and his staff are very helpful and got my debit buyer suit settled quickly. I highly recommend them if you have a debit buyer going after you.", "pics": null, "resp": {"time": 1598622211930, "text": "Thank you Andre for the review and feedback!  We enjoyed working with you very much. Have a great day!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103607523042313200002", "name": "SR C", "time": 1581106117220, "rating": 5.0, "text": "John Watts has handled several cases for me, ALL with terrific outcomes. I know lawyers can’t promise anything, but if you want want two lawyers you can really depend on, I highly recommend you call John and Stan first before anyone else. Thanks, John!", "pics": null, "resp": {"time": 1581167781923, "text": "Thank you for your very kind review!!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "104965077983072228954", "name": "Hurst Brood", "time": 1581093268603, "rating": 5.0, "text": "Very impressed! I saw the videos John made and decided to contact them for help and they were prompt and Randi called me ASAP with a resolution. Definitely will recommend them and will continue to use them. New customer satisfied!!!", "pics": null, "resp": {"time": 1581167832994, "text": "Hurst thank you for leaving us a review and I'm so glad Randi was able to help you.  She's very good!!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "102732020055123549979", "name": "Kelly Toups", "time": 1571782143092, "rating": 5.0, "text": "Mr. Watts took about 45 minutes out of his own time (without rushing me), doing a great job of answering all of my questions, and I had a bunch!  He is professional, kind and very patient.  He, truly, has a “teacher’s heart.”  I, highly, recommend that you contact him concerning any legal issues, because he will do his best to steer you through the right legal channels.  He is a “Godsend”!", "pics": null, "resp": {"time": 1575032425032, "text": "Kelly,\n\nThank you for your feedback!  Really appreciate it!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112942497762964217289", "name": "jeff helton", "time": 1595861298898, "rating": 5.0, "text": "I was sued by a debt buyer, i had never heard of them, yet they claim i owe them money. I started searching for answers on the internet (where else), and discovered that if i ignored them, pretty soon they would be getting 25% of my paycheck, it's just that easy for them if you do nothing. So i filed an answer with the court, thinking i could handle this, then i started receiving envelopes full of \"evidence\" from the opposing attorney, which he intended to introduce. At this point, I knew i was in way over my head. Feeling very anxious, i returned to the internet looking for more answers, i found some of Mr Watts' videos on YouTube, and decided to  call, best decision ever. They told me they had it, and they would be fighting for me. Due to covid-19, things were delayed a bit, but the case  was settled in a timely manner. Everything about this firm is first class, hopefully, i won't need their services again, but if i do, i certainly will not hesitate.", "pics": null, "resp": {"time": 1595865334833, "text": "Jeff, thank you for leaving us a review -- we appreciate your kind words!  It was a pleasure to represent you and reach out if you ever need anything."}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "115428069130726658505", "name": "Sunday Caradine", "time": 1587754160231, "rating": 5.0, "text": "If you are like me and received a summons in the mail and being sued by a debt buyer and have no idea what to do next please call John Watts and don't hesitate, Watts & Herring is a wonderful firm that really cares for their clients. I was so scared when I received that summons on New Years Eve 2019. I did a internet search for the local council and Mr. Watts popped up and am forever grateful for that search. The minute I spoke with his secretary she put my fears to rest thank you Ms. Carolyn... I really really love the people that I have spoke with or emailed with. They have many years of experience and know just what you are going through.\n\nThank you John and all the others that helped me get my case settled and the worry off my mind. God Bless", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "113349984339531778293", "name": "Marshea Johnson", "time": 1544459708549, "rating": 5.0, "text": "I’m very pleased with Mr. Watts and how he handled by case against a recent debt collector. The firm took my case and I had to not lift a finger. There was no reason for me to show in court because Mr Watts was my voice, eyes, and ears during this whole litigation. Not only did he WIN my case, he had them to remove the bad debt off of my credit report all together. I would most definitely recommend this firm to anyone seeking to send the debtors packing and heal your credit. Thanks again Mr. Watts and staff!", "pics": null, "resp": {"time": 1563887512584, "text": "Marshea,\n\nWe enjoyed representing you and thank you for leaving us feedback!\n\nHave a great day!\n\nJohn"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "102271735819028164131", "name": "Dan P", "time": 1552613251601, "rating": 5.0, "text": "I stumbled upon Watts & Herring while searching for legal representation in a case involving a debt collector, and I have to admit, I had nothing short of an outstanding experience. Mr. Watts personally kept me up to date with developments regarding my case and this firm delivered on expectations set from the beginning, every promise kept. I'm absolutely grateful and would not hesitate to work with him again in the future if need be. Fantastic, efficient legal service, would highly recommend!!!", "pics": null, "resp": {"time": 1563456832777, "text": "Dan,\n\nThank you for your feedback and for letting us represent you!\n\nWe are glad things worked out and appreciate you as a client.\n\nHave a great rest of the year!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "111866270390139314976", "name": "Cydney Dorsey", "time": 1570817303203, "rating": 5.0, "text": "I highly recommend John for any of your consumer legal needs! John is an expert on consumer protections in Alabama, and he was incredibly easy to work with. I felt like a priority to John and not just a means to profit, and that really made me feel so much better during a terribly uncomfortable time. John really impressed me with the level of service and the number of resources provided, and I wouldn't recommend that anyone look anywhere else!", "pics": null, "resp": {"time": 1571392093815, "text": "Cydney, thank you for your kind review.  Appreciate it very much!  John"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "113637353478918244737", "name": "Eledo Outlet", "time": 1547149366743, "rating": 5.0, "text": "Awesome service guys ! Was sued in small claims court by Portfolio Recovery - who had bought my old credit card debt...never been sued in my life. Cards got behind - due to job loss. I was beside myself with fear. I started searching online for help and found this amazing law firm - Watts & Herring - they are like the \"Amazon\" of solving these types of issues...one phone call - immediate help - was so quick and painless. Case settled quickly and I am totally satisfied. I loved being able to communicate via texts and how personal the whole process was. Hats off guys ! I got debt and I will be back to get more help...\n\nWe are most interested in hearing how you felt before you met us.  So what emotions, concerns, etc. when you were sued.\n\nThen how did you find us and how did that make you feel.\n\nThen when you spoke with us -- how were you treated.", "pics": null, "resp": {"time": 1563887478737, "text": "Eledo,\n\nThanks for your review.  Glad we were able to help you and you enjoyed how we communicate.\n\nThanks for letting us help you and have a great day!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "107990481014466178882", "name": "Pedro Lopez", "time": 1575225977516, "rating": 5.0, "text": "I live in FL but I have a property in AL. AL laws are very different compare to FL. When I needed a expert on consumer protections in Alabama, I found John Watts and his team.\n\nIn the first call, Mr. Watts took about 40 minutes out of his own time and answered all of my questions and concerns. With only one, well redacted letter, my problem got solved.\n\nI highly recommend Mr. John Watts and his team for any of your consumer legal needs!\n\nThank you bery much Mr. Watts. You are part of my AL team!", "pics": null, "resp": {"time": 1575232366435, "text": "Thank you Pedro for your review.  We enjoyed representing you and glad we were able to help you.\n\nThanks again for leaving us feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116950827131197020826", "name": "Eric Stevenson", "time": 1563225186862, "rating": 5.0, "text": "Stan and John are my \"go to\" consumer protection lawyers in Alabama. Being close to the Alabama State line, we get a lot of calls from people in Alabama who need help with consumer protection cases. Everyone I send to Watts and Herring is thrilled with the attention they get. I can't think of a better firm in Alabama.", "pics": null, "resp": {"time": 1563374900871, "text": "Thanks Eric!  Its great to have someone in Florida we can send folks to also!  Keep fighting my friend and thanks for the kind review!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103185247038668785714", "name": "Shawn Mertz", "time": 1515165961253, "rating": 5.0, "text": "Before working with John at Watts and Herring I wasn't sure what to do!  John made the process easy to understand and I never felt judged for past mistakes.  I didn't just have an attorney or advocate, I had a friend by my side who was going to walk through this situation with me.  Now that its all over I can't explain the relief I feel!  I hope I never encounter this situation again, but John and his team would be my first call, they gave me peace of mind, which is invaluable.", "pics": null, "resp": {"time": 1515175050294, "text": "Shawn,\n\nThank you for the kind words.  Glad we could help you.  You figured out your options and then took action which is what we all need to do when we face challenges.  Thank you for letting us be a part of the solution.\n\nBest wishes and thank you for taking the time to leave us feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106715100463653810868", "name": "Ian D. Owens", "time": 1565966113104, "rating": 5.0, "text": "John and his team are experts in the field. They make sure to communicate throughout the entire legal process and never make one guess 'what happens next?' I can, without reservation, recommend John for his legal prowess, timeliness, and professionalism.", "pics": null, "resp": {"time": 1570792994837, "text": "Thank you very much Ian -- it was great to work with you!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "101749025623171794938", "name": "Name Witheld", "time": 1528935094099, "rating": 5.0, "text": "I reached out to 2 different law firms regarding my lawsuit by a debt collector, neither of which got back to me, before finding John Watts. I came across one of his videos on youtube and quickly found myself watching many more. His freely available content gave me much more insight into my situation and how best to proceed. I knew that John was the one I wanted in my corner after watching his videos and didn't hesitate to reach out to him about my case.\n\nHe and Carolyn were very polite and respectful to me. The consultation with John left me with no doubt that I would hire him for this. It was evident on the phone, as in his videos, that he knows his stuff. Immediately after speaking with him over the phone I felt absolutely sure that if anyone could win my case it would be him.\n\nAfter hiring him it was very simple. I didn't have to drive to meet him anywhere or go out of my way for meetings. Everything was done electronically with him and his office which made the process very easy. Any questions I had were answered with either a phone call or email. Simple.\n\nI am glad and relieved to report that he indeed resolved my case! If you are fortunate enough to have found John, do not hesitate to contact him and do not waste precious time reaching out to other law firms in Alabama who probably aren't interested in taking your case anyway.\n\nThanks John and Carolyn!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "115320863333658157056", "name": "Jennifer Gervais", "time": 1523024288683, "rating": 5.0, "text": "Awesome! FRIENDLY, extremely knowledgeable, awesome office staff. Before I hired Mr. Watts, I spent 3 years miserable. Hiding from harassing phone calls from a debt buyer. Hiding. Feeling worthless. Helpless. Hopeless, angry, edgy, and agitated.  Carolyn was amazing, so friendly, nice, and gave me hope.  She was always available for communication, and so was Mr. Watts. My case was settled in 1 day. 1 day! I’m thankful for meeting them, and will always recommend them. I was able to sleep a full nights sleep this week. I haven’t done that in 3 years. So thankful for you all.", "pics": null, "resp": {"time": 1526919681251, "text": "Jennifer,\n\nSo glad you had a great experience in a difficult situation.  Carolyn is definitely very amazing -- I try not to mess up what she does.  :)\n\nI really appreciate you leaving us a review and I'm so thankful getting this all behind you has helped you to find peace.  I know from personal experience when we can't sleep well, it affects everything.\n\nThank you for letting us help you and may the future hold wonderful things for you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109054422321465839347", "name": "Matt Downs", "time": 1480629904925, "rating": 5.0, "text": "I came across Watts & Herring, LLC when I was looking for an attorney after being contacted about an old debt.  I wasn't being sued, but I did want to get an expert on my side so I could take care of it and move on with my life!  John Watts contacted me quickly and was able to answer all my questions and recommend a solution.  He negotiated with the collector and took care of the issue completely.  John and his office staff were friendly and extremely responsive.  John answered all my questions and gave me peace of mind that my issue was being handled by someone that was confident and knowledgeable.  That's definitely the kind of person you want negotiating on your side!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106393104036977032563", "name": "Brian Eubank", "time": 1528822577890, "rating": 5.0, "text": "Mr Watts & his staff, including Mrs Carolyn, were outstanding to deal with. They helped turn a bad situation into something manageable & were able to accomplish things in days that I could not, after months of trying. I would most definitely use them again or recommend to anyone. Efficient, very reasonably priced & treated me like I was the only client!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109162356055823397725", "name": "Jimmy Cor", "time": 1553810125470, "rating": 5.0, "text": "This is hands down people who are about their jobs and their clients. Speed, accuracy, peace of mind, there is zero flaw here. John is absolutely incredible! This is s PRISTINE establishment", "pics": null, "resp": {"time": 1562595716467, "text": "Thank you so much Jimmy for your kind review!  We are glad you had such a good experience with us and thank you for taking the time to leave us feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109088336303907989501", "name": "Renee Smith", "time": 1486399223137, "rating": 5.0, "text": "When I received information regarding a company attempting to sue me, I was sad, worried and upset. I had never been sued or in any legal trouble before so I had no idea where to turn. I decided to go online and do some research on solutions and upon doing so I found Watts and Herring where John Watts was shown on a video describing a case dealing with the exact company that was attempting to sue me. Seeing John on that video as well as others made me feel better that there was someone out there that understood and had successfully dealt with fighting this company first hand. I decided to reach out and very shortly after doing so I received a call from Carolyn. She was very helpful in explaining my options and told me that I would be working with John Watts on the case if I decided to move forward. I decided to proceed with working with John on the case. After speaking with him and describing what I was dealing with, he made me feel at ease about the situation. He stayed in contact with me every step of the way and did a great job with keeping me informed about the status of the case. Working with his office was also very convenient. Throughout the entire process, I never had to take a day off work as John and his staff did everything possible to make sure that everything was convenient to me as a client. I am happy to report that the case was successfully won and I no longer have to worry about that company coming after me again. I would recommend John and his staff to anyone needing help in a situation such as mine. Thank you John and staff of Watts & Herring!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "108451798483247697688", "name": "Benny Ledford", "time": 1543443666406, "rating": 5.0, "text": "This will be my second time to deal with John and Carolyn. Honest and up front on case. I highly recommend. I came to John the first time based on the positive reviews from clients.", "pics": null, "resp": {"time": 1571392139212, "text": "Benny, thank you for leaving us feedback.  Appreciate it much and it was a pleasure to work with you.  John"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103490593098951785805", "name": "Laura Langhoff Arndt", "time": 1539625617133, "rating": 5.0, "text": "I talked to Randi about a foreclosure issue and she gave me outstanding advice! She was very knowledgable about the topic and was more than happy to answer all my questions. If you have an issue with foreclosure in Alabama I would definitely recommend getting in touch with her or somebody else at Watts & Herring. THANK YOU RANDI!!", "pics": null, "resp": {"time": 1575032476547, "text": "Laura,\n\nThank you for your review.  Foreclosure issues can be very confusing so I'm glad Randi was able to give you some good insight.  Thank you again for your feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105921194446646854857", "name": "Steph R", "time": 1565187732660, "rating": 5.0, "text": "As stressful as a lawsuit can be, Mr. Watts and his team made it painless. The debt collector was particularly shady and I had no idea how to handle it so I searched for a lawyer. I came across their website in a Google search and decided to give them a call. Very responsive to emails and messages. I didn’t have to do anything but sign some paperwork via email. No appointments necessary. The case was settled within a month and I don’t have to think about it ever again!", "pics": null, "resp": {"time": 1565194832371, "text": "Steph,\n\nThank you for leaving us feedback and we enjoyed helping you with this matter.  Thanks again for your review!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116698545607575597161", "name": "Kelli Norwood", "time": 1531323056635, "rating": 5.0, "text": "John Watts represented me in a lawsuit regarding a debt stemming from a divorce. Not only is the pain and life change of divorce something that creates stress and fear in life, being sued left me feeling confused and scared. Not only did I have a stranger approach my home to serve me, I was so stressed and upset about what the next steps should be. I have never been to court or sued before. What do I do? Can I go to jail? Who can help me? That's when I found John Watts. Not only did John walk me through the process and explain all of the legal terminology, he also eased my fears and explained everything in a way that helped me sort through what steps I needed to take next. John and his office were always available to answer questions - no matter how small. My case was settled and dismissed quickly and a huge weight was lifted off of my shoulders.", "pics": null, "resp": {"time": 1575032562869, "text": "Kelli,\n\nThank you for letting us help you and we really appreciate the feedback in your review.  It was a pleasure representing you and we wish you all the best!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "117426777819457813733", "name": "TheAliciaBryan", "time": 1531950442559, "rating": 5.0, "text": "Sometimes you may find yourself in situations that you never thought possible. I'm so glad there are knowledgeable, caring, non-judgmental companies out there like Watts & Herring to settle the nerves and get results. They have an awesome team...", "pics": null, "resp": {"time": 1582998090970, "text": "Thank you for your review!  We enjoyed working with you and wish you all the best!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112286089045311452183", "name": "Porter Hodges", "time": 1514414238505, "rating": 5.0, "text": "Excellent, professional, and very personable representation. Fantastic team to work with!\nJohn, and his great team, worked with for me, and with me, to resolve my lawsuit in a much better way than I could ever have imagined!\nI can't say enough about how pleased I am with the representation I received!!!   HIGHLY RECOMMENDED!!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106596531127857534812", "name": "SM Thompson", "time": 1461820136965, "rating": 5.0, "text": "Watts and Herring, LLC is an outstanding law firm.   They have represented me in several cases and won every one of them.  John and his staff are extremely knowledgeable, professional, and  compassionate.  John explains the process clearly and ensures his clients completely understand. He is genuinely concern about the best interest of his clients.  Also, John and his staff go \" above and beyond\" the call of duty to provide exceptional services.  After a case has been resolved, he continues to communicate with his clients and provides additional assistance if needed.  This law firm has been truly a blessing to me.  Words cannot express the gratitude I have for this law firm.  I am so very thankful.   I refuse to hire another law firm to represent me.  I highly recommend Watts and Herring, LLC.   This law firm is the BEST!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "111340030247012689167", "name": "Ronny Parrish", "time": 1497533508013, "rating": 5.0, "text": "I first heard John Watts after searching Medicare \"5 Year Look-Back Period\" information for my Dad in Alabama.  Not only did I find his information on this subject extremely beneficial, but it prompted me to listen to most all of his Estate Planning posts.  I contacted John for my own estate planning needs because of his personable demeanor and, quite frankly, his simple elementary approach to explaining estate planning.   Carolyn's prompt service and John's generous time and information was truly more than I ever expected!", "pics": null, "resp": {"time": 1497536184922, "text": "Ronny, thank you for taking the time to leave us a review.  I'm glad the information on our videos/articles helped -- sometimes the interplay of Medicaid and Medicare for long term care can be confusing.  We have \"look back periods\" and \"penalty periods\" and all sorts of numbers.\n\nI appreciate you saying we make it understandable -- have to do that so I understand it.  :)\n\nThanks again and I'll let Carolyn know the kind words you had for her!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110209640780272386718", "name": "Lisa Grady", "time": 1520985591079, "rating": 5.0, "text": "Being sued can be shocking and a bit scary. After one conversation with Mr. Watts I was immediately put at ease and decided immediately to hire him. John walked through this situation with me, understood the nature of the case and guided me through the whole process. John always answered my question promptly. He won my case.\nI would like to thank Mr. Watts, Carolyn and the rest of the crew for helping take care of this. If I ever (I hope I don’t have to) go through this again I know I will be calling John again.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105555859414413573958", "name": "D Ragusa", "time": 1472307635675, "rating": 5.0, "text": "We came upon an unexpected legal matter just as we were preparing to close on a home via a corporate relocation plan. We were in a really tough bind and the financial ramifications could have been severe. Moreover, we had a very small window of opportunity to resolve this matter in time to close on the home we were building. To complicate matters, we had to handle this situation from out of state.\nWe sought specialized legal counsel and found John via a Google search. The videos that John posts on his website, intrigued us enough to give him a call to discuss our situation. This turned out to be a great decision!\nFrom the first call, John and his staff provided understanding and formulated clear options for a successful resolution. John took personal ownership of the case after the initial call. From that point, there was constant and open communication by phone, text and email. Honestly, John was ALWAYS available to discuss our case. We followed John's advice and the case unfolded just as he said it would. This experience exceeded all of our expectations and turned a bleak situation into a resounding success. We truly believe John was the reason for this outcome. We can't thank John and his staff enough for helping us when we needed it most. We HIGHLY recommend John's team for anyone who needs similar legal help.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110796197204388348828", "name": "Anita Mintz", "time": 1560556276801, "rating": 5.0, "text": "I really appreciate how John Watts defended me against a debt collector. Mr. Watts clearly communicated what to expect and answered the lawsuit promptly and eloquently. I was anxious about going to court, but there was no need to go to court, or to be anxious.\n\nThe settlement was favorable and my follow-up questions were answered immediately in plain language. Mr. Watts took a considerable amount of time and care to address all my concerns and confirm that my credit report would properly reflect the sucessful lawsuit resolution.\n\nThanks to Attorney John Watts for his much needed help. Thanks also to Carolyn Allcorn, Legal Assistant, for her initial help.", "pics": null, "resp": {"time": 1562595273729, "text": "Anita,\n\nThank you for leaving us feedback!  We really appreciate it.\n\nIt was a pleasure to represent you and we are thankful that you had a great outcome.\n\nI know when I'm dealing with something that is new for me, I like the process explained.  So it was our pleasure to explain the process to you.\n\nCarolyn is great at explaining things as well and glad you had a great experience with her also.\n\nWe appreciate the trust you had in us to represent you and thank you again for taking the time to leave us feedback.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109381542959677274390", "name": "Angelique Judice", "time": 1515530313086, "rating": 5.0, "text": "I had the pleasure of working with Randi on my foreclosure/auction. She was very knowledgeable and really jumped right into the facts and details of my case. This firm is top notch with customer service and true concern for people and their legal issues. I would definitely RECOMMEND THEM TO OTHERS!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1522524855576, "rating": 5.0, "text": "When I was served papers for Capital One's suit against me, I was intimidated, stressed, and overwhelmed at the thought of attempting to do this on my own. I remembered John Watts from his YouTube videos and decided to call his office first.\n\nJohn's office was helpful, informative, and fast! They answered all of my questions and took care of my issues within hours! They were also considerate of the pricing of services. I would gladly work with John Watts any time!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114207144919657050177", "name": "John Carlile", "time": 1488902940971, "rating": 5.0, "text": "I was recently faced with a discouraging matter regarding a revolving debt that stemmed from a past divorce. It had morphed into an insurmountable problem. I contacted my family attorney and through his contacts was referred to Watts & Elder Law. Upon contacting John Watts, I immediately was greeted by John and his staff with a genuine interest in helping me resolve the matter. I made the decision to hire John and cannot be more pleased. John took my case site unseen as we live states apart and never asked for a Penney up front. He and the firm made the experience effortless for me and treated me like family. John successfully negotiated an amicable settlement and even leaned into help me with the legal costs to make it affordable to a single dad. I cannot say enough great things about Watts & Elder Law. In the end, John is just not my attorney, he is a friend. Thanks John!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "104889628448824705032", "name": "Himanshu Pandit", "time": 1500071382729, "rating": 5.0, "text": "I found John after a lot of search for a decent lawyer in and around Huntsville, AL. Before I met John, I could it find any lawyer who could understand my case, let alone have a plan to tackle it. John took his time to understand, think through my case and plan the solution in detail. He is an excellent legal mind who cares for the best path for client - a rare combination. I would definitely recommend just running your case by him and you will see the value prop.", "pics": null, "resp": {"time": 1500294918853, "text": "Thank you Himanshu for the very kind review.  It was a pleasure to represent you and thanks for making it so easy!  Sometimes people want to hire a lawyer and then not communicate but you were great -- helped us to prepare your case.\n\nAgain thank you for the nice words and thank you for having the confidence and trust in us to let us represent you.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109219130963634167803", "name": "Miriam Moss", "time": 1505249559106, "rating": 5.0, "text": "Spoke with Carolyn and John. Both were wonderful. They were very thorough and made us feel comfortable. During our initial consult John provided great information and guidance in an easy to understand manner. Highly recommend this firm!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "111664861663180518955", "name": "Edgar Dale", "time": 1532196442834, "rating": 5.0, "text": "When served with a summons in my driveway as I was getting into my car, I was a bit confused. The envelope contents naming me a co-defendant made me change gears and begin researching my options. Several legal firms sent unsolicited advertisements to my mailing address. In searching my home city for legal council I discovered that  most only handled bankruptcies. That was not the route I wanted to take. My wonderful wife found the legal firm of Watts and Herring LLC online. On the website were a number of  useful Youtube articles explaining how to handle my situation and even how to do it myself. However, the old saying about the person that represents himself in court has a fool for a lawyer rang out loudly in my brain as did a movie quote, \"A man's got to know his limitations\". I decided to contact Mr. John Watts.\n\nI told my co-defendant about Mr. Watts and it was agreed to see if they would represent us. Mr. Watts assistant, Carolyn was cordial, professional and to the point. She arranged a phone conversation and Mr. Watts listened to my side and let me know about my options. None involved bankruptcy and he told me how to fill out the defendant's responses. My co-defendant agreed to be represented by Mr. Watts and the step by step procedure went as planned. It was reassuring that we were informed along the way and Carolyn was usually available to answer any questions I had either that day or the next.\n\nNow that it is over, I am glad that Watts and Herring represented us. Most of my contact was through emails and a few conversations with Carolyn. I would tell anyone not to expect any drama and the only thing that can't be sped up is the wheels of justice. Be patient and let your legal representatives do their job. Watts & Herring did.", "pics": null, "resp": {"time": 1581167930748, "text": "Edgar thank you for your review.  We enjoyed representing you very much!  You took action which is vital -- I know I've been guilty of learning stuff but not taking action.  So congratulations to you for not only learning your rights but taking action.  Thank you again for leaving us feedback!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105180093219223385723", "name": "Jessica Mitchell", "time": 1532884010904, "rating": 5.0, "text": "John Watts represented me in two lawsuits for debt. When I called the law firm, I explained my situation to Carolyn and gave her the information for my cases. After agreeing to hire the firm, I signed the required documents and they handle everything after that. I didn't have to feel stressed about the lawsuits anymore and was able to focus on other important things in my life.\n\nAt the end, John was able to get both of my cases dismissed. I am very grateful for everything that this law firm did for me. I would recommend to anyone, who is stressed about a debt lawsuit, to contact Watts & Herring.", "pics": null, "resp": {"time": 1571392369259, "text": "Jessica, it has been our pleasure to help you in your cases.  Thank you for the feedback -- we greatly appreciate it!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "117924106703310362624", "name": "Deedee Clark", "time": 1536158558918, "rating": 5.0, "text": "Looking for a lawyer who is honest, fair, and straightforward! I found them in Watts & Herring, LLC! Randi Curb cut me no lack! Just what I needed and I listened! It’s not easy to let people take control and drive, but when I shut up and listened to a well qualified, professional lawyer I was able to stop panicking and put together a plan, and move ahead! They answered my calls when I couldn’t even get others to answer the phone! BUT they also helped  me find another lawyer who specializes in another issue I needed!\nI would recommend them to anyone!!!\nThank you!!!", "pics": null, "resp": {"time": 1571392322365, "text": "Deedee -- thank you for your review!  Sometimes we have good news for folks and other times we don't but we do our best to always give folks the reality of their situation so they can make good choices.  Thanks for the feedback and glad you had a great experience with our firm.\n\nJohn"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116938049196788858887", "name": "T Baechtold", "time": 1525353761762, "rating": 5.0, "text": "Randi and John- u guys are the best. Going to need u again Unfortunately .... I will call u Randi Friday/Monday!  Continue to do the awesome caring work you do!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "104716629112989706136", "name": "Ray Cureton", "time": 1462902407550, "rating": 5.0, "text": "I must say that working with John Watts and his colleagues has been a blessing in a difficult situation. When I was named in a lawsuit as a cosigner for a debt, John took the time and put in the hours to settle the case for less than 50 cents on the dollar - which, by the way, was more than fair concerning the circumstances of this particular case.  I highly recommend Watts & Herring, LLC for anyone who has a consumer law issue they need to resolve. John was VERY knowledgeable of the applicable law, and truly set my mind at ease during numerous phone calls. THANKS JOHN!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "118167851477443919291", "name": "Peggy Bolton", "time": 1517844524491, "rating": 5.0, "text": "I had an upcoming court date that I didn't know how to deal with and was very nervous about . I spoke with John Watts and he walked me through step by step how to handle my situation. After speaking with him I now know how to respond. He truly cared about me, answered all of my questions and made me feel confident about my court date.", "pics": null, "resp": {"time": 1517845239519, "text": "Peggy,\n\nThank you for taking the time to leave us a review.  I'm happy our conversation helped and wish you the best!\n\nThank you again for the feeback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106582272855997089108", "name": "Jacob Taylor", "time": 1531155385209, "rating": 5.0, "text": "The legal landscape can be confusing and scary. I have had less then stellar experiences in the past with the legal community. It has been a Godsend that I have been able to interact with the professionals at Watts & Herring. They have provided honest, fair, and compassionate guidance all while not yet representing me. With their assistance I have been able to weather the first round of storms against my mortgage company. While the battles will continue, I rest better each night knowing these folks are out there to level the playing field as much as possible. These are good people, doing good work...daily.", "pics": null, "resp": {"time": 1575032601369, "text": "Jacob,\n\nThank you for your feedback and review -- we really appreciate it!\n\nBest wishes!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112965366142832838767", "name": "L Dawkins", "time": 1465842924531, "rating": 5.0, "text": "Watts and Herring are fantastic. Their staff is friendly and very easy to work with. They helped walk me through all of my options when a debt collector attempted to sue me. I was very anxious as I'd never been sued and had no idea how to proceed. When I hired John for the case, he worked hard to keep me in the loop, to make certain I knew all of my options with the debt collector and that I was included on all relevant motions. I have to say that having John and his team at my back made me feel a hundred times better. At the end, we were able to win our case and all of the stress has melted away.", "pics": null, "resp": {"time": 1465844024743, "text": "Thanks for your review and feedback!  Thank you for letting us help you -- I know it is scary dealing with this type of stuff and we appreciate you letting us represent you.\n\nSo happy to hear the stress has melted away -- we all have too much of that so nice to get rid of some, eh?\n\nThanks again for your great feedback and letting us help you....\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112108827405284922582", "name": "Diamonz P", "time": 1467676432291, "rating": 5.0, "text": "On March 23, 2016, I received a writ of garnishment notification from the county clerk office in the county where I reside.  I was baffled and upset.  I had no idea that a default judgment had been entered against me.  I never had any legal issues before and I felt helpless.  However, I did feel like I had some kind of legal rights and taking no action at all was not an option for me.  I felt like I had to fight back in some type of way and not let these people (the plaintiff) unjustly take my hard earned money.  Therefore, I began to do some online research to find out how I could combat this legally.  I came across the Watts & Herring, LLC Law Firm.  I liked the information that they displayed on their website and they seemed very experienced and knowledgeable of consumer rights.  I decided to give them a call and I initially spoke with Ms. Carolyn Allcorn and she was very courteous and understanding of my situation.  She got me in touch with one of the attorneys, Mr. John Watts, who has been nothing short of helpful, knowledgeable, experienced and he keeps me up to date on things every step of the way.  Needless to say, I have no regrets of choosing Watts & Herring, LLC as my attorney.  I am grateful to have found them and my journey with them has been very satisfactory and pleasant.  I highly recommend this law firm to anyone and you will not be disappointed with the results as I have not been disappointed!  Thanks again Watts & Herring for all you have done!!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106885418070703866197", "name": "D. Davis", "time": 1522727970770, "rating": 5.0, "text": "I was recently sued by a debt collector. My credit score did a nose dive over night and worry set in. I thought I was ruined...at least for the next 7-10 years. I didn’t know what to do, but I knew I had to think of something fast! I started googling my questions and I kept finding answers from the same guy/lawyer, named John Watts. Every question I had, he not only had the answers, but he described them in detail in YouTube videos. He seemed honest, so I called his office.\n\nI spoke with Carolyn and it was a pleasure. She was a very kind and professional lady. She took away my worry and set my mind at ease. After we spoke, the ball rolled quickly. In no time, everything happened just as John said in his videos. Here’s what I mean (this was the outcome): my court date didn’t happen, I didn’t pay anything to the debt collector, and their negative remark on my credit report removed.\n\nI had no idea that my outcome was even possible when I was first sued. John Watts is a Godsend and I mean that folks!! He knows his stuff!! My gut was right about him being honest and I am very thankful for him handling my case. If you’ve been sued by a debt collector like I was, there’s no need to look anywhere else. Give John Watts a call and I guarantee you will not be disappointed!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "101613922604161406218", "name": "Meg S", "time": 1549209166949, "rating": 5.0, "text": "Out of the blue one day, I received papers regarding collections. I sure am not going to pay, as my debt is not to them, and I think suing someone (and for full amount when they presumably paid pennies for a bundle of debts!) who does not even owe you should be illegal. Let me tell you right now that John Watts is who you want to turn to in order to resolve matters such as this. People may worry about money and affordability -- you pay less than you would if you had a judgement made against you. I contacted his office the same day as I was served, which was on the weekend, and heard back the very next morning! I was quite nervous before speaking with Carolyn and John. My mood toward the whole thing changed after speaking to them. John handled EVERYTHING. I know I worried way less than if I had been going about this on my own. The cases (yes, two) both wound up settled and I was informed of developments. I am sure I will need to contact them again in the near future thanks to a negative time slot in my life, and I will not hesitate to do so. You can tell that John is a nice and caring person. I needed to write a review, as I search reviews on services and products of interest myself. They are important and are part of how I discovered what an amazing job John and his office does. Definitely call or send a message if you have an issue with collectors. He has numerous videos on YouTube that you may want to watch. Not only are you paying for legal representation, but for collections coming off of your report and peace of mind! It has been well worth the money to me.", "pics": null, "resp": {"time": 1563456937008, "text": "Meg,\n\nThank you for letting us represent you and for the kind feedback you gave us.\n\nOur goal is to do a great job representing folks and also lower their stress level.  Dealing with this stuff is a challenge but once you can put it behind you, it is a great feeling.\n\nThanks again for trusting us with your cases and for taking the time to leave us a review.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105653474290061026297", "name": "Amy Perry", "time": 1529344035378, "rating": 5.0, "text": "I'm so grateful for the time Atty. Watts spent with me over the phone.  I could not afford to hire his firm but he gave me some vital gems to assist me with my case with Midland Funding.  The YouTube   videos were the icing on the cake.  Atty. Watts explains the processes and gives you key things to look out for so that you won't be overwhelmed with the process.\n\nFILE A RESPONSE TO THE LAWSUIT AND SHOW UP TO COURT! (best advice ever!)\n\nI followed the instructions--- answer the summons, show up to court and be prepared with a definitive response to the claim of debt.  I did all of that and the Judge informed the lawyer that I denied owing the debt and now she has to fulfill my Request for Production.  The lawyer stated that it was my debt because she had credit card statements.  The Judge replied, \"we live in a day of identity theft and the defendant has requested that you produce a signed agreement between her and Midland Funding ---can you produce it\".  The lawyer responded that she believed that she could produce the information.  Judge gave us 60 days to return back before him.\n\nThe lawyer asked if she could speak with me in the hallway and the judge suggested that I see what she had to say.  She asked me did I not received the credit card statements that were sent to me.  I stated, \"I repeat my answer from court --- I have received everything that your office submitted to circuit court\".  She replied, than you have everything (I remembered Atty. Watts mentioning to be cautious in your response to the lawyer because they can flip it back on you).  I reminded her that the judge asked her office to fulfill my Request for Production and she said that I will have everything in 30 days.\n\nSo I will await whatever further documentation that Midland Funding can produce.  What's amazing is that Midland Funding is projected to be removed from my credit report September 2018.  I cross referenced that with all three credit bureaus and they all notate September 2018.\n\nAtty. Watts, I thank you so very much for everything.", "pics": null, "resp": {"time": 1582998222468, "text": "Amy you are very welcome and thank you for leaving us feedback and your story.  Wishing you all the best!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112044630286216042142", "name": "Kathrine Jones", "time": 1520609621489, "rating": 5.0, "text": "I was sued by a debt collector. Inexperienced in this type of situation, I turned to the internet to search for information. I came across the Alabama Consumer website discussing exactly what I was going through with lots of videos and simple explanations. I immediately contacted John Watts' office and within minuets received a response. Before speaking with John I was embarrassed, scared, and confused. On the initial call, John explained away my worries. He made me feel at ease with my situation, and I was treated with the utmost respect. I decided immediately to hire John Watts. Since then, all correspondence has been quick and easy, and John was able to settle my case. I hope I'm never faced with another situation as such, but if I am, I know I can count on John to have my back. Thank you just doesn't express my gratitude enough.", "pics": null, "resp": {"time": 1520611095263, "text": "Kathrine,\n\nThank you for your feedback and we enjoyed representing you!  I really appreciate the kind words you have said and glad you had a great experience.\n\nAs a reminder, you took the action.  You researched your options.  You called us even though it was not easy.  And you hired us.\n\nYou did exactly what we should all do when faced with a difficult decision -- find out our options and then take decisive action.\n\nCongrats on doing that!\n\nThank you again for letting us represent you and for your review.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "108911132512853494923", "name": "Daymond Chief Jones", "time": 1573972592713, "rating": 5.0, "text": "Mr. Watts was kind enough to do a public education video for all people to bring them knowledge about the law in consumer protection issues in Alabama.\n\nHe is on top of his game", "pics": null, "resp": {"time": 1575032353688, "text": "Thank you very much for the kind review.  Glad you found value in our videos and thank you again for taking the time to give us feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105718643197880148280", "name": "Brett Ferrel", "time": 1464703247918, "rating": 5.0, "text": "John and his staff have been extremely helpful throughout my situation.  I received a complaint from small claims court where a creditor was attempting to collect an old debt.  I didn't know much about the process necessary to properly handle the complaint and I wasn't sure what my options or rights were in this matter.  I started researching these concerns and I came across some videos that John had put together on his website explaining exactly what I wanted to know.  I reached out to John so that I could ask further questions and get advice specific to my situation.  We spoke for a while and he was very patient on the phone and answered every question I had.  He genuinely cared about my situation and offered advice that let me know he was extremely knowledgeable about consumer protection law.  John represented me and handled everything like a professional.  John and his entire staff are quick and responsive to every communication whether it's from me, the courts or the opposing counsel.  The matter in question was handled to my satisfaction and I wouldn't hesitate to have John represent me again in any matter pertaining to consumer protection.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "115760722043214174410", "name": "W B", "time": 1457580898441, "rating": 5.0, "text": "On a Thursday evening after a long work day, I was served a notice of being sued by a debt collector that I had never heard of. I had only 14 days to respond to the courts my anxiety was high; I was in shock and felt like the rug had been snatched from under me. On Saturday, when I starting researching the debt company; I found the Alabama Consumer website and read about Watts & Herring, LLC.  Once I listened to John’s video on “your 5 options if being sued by a debt collector” I felt as if a \"ton of bricks\" had been lifted off my shoulders.  I immediately contacted his office online and within 30-45 minutes I was contacted by his staff and was very pleased with the prompt reply, professionalism and knowledgeable staff.  John was very thorough in explaining my options and patiently listened to me with his full attention and I knew I was in capable hands.  I was able to turn all my worries over to John and his staff so I could focus on my job. John and his staff kept me updated and communication regularly which really eased my mind. My humblest thanks go out to John, his staff and his expertise which gave me peace of mind once again!!! If you ever find yourself in this predicament, I highly recommend that you contact John and his staff at Watts & Herring, LLC.", "pics": null, "resp": {"time": 1563375102635, "text": "Thanks WB!  We appreciate the feedback and the chance to represent you.  You did the critical first step which is to find out your options and then you took action.\n\nSome people never learn their rights -- but you did.\n\nAnd even folks that learn their rights don't take action unfortunately -- but you did.\n\nThat's why you had a great outcome -- learn your rights and take action.\n\nThanks for letting us be a part of this and we appreciate the review you left us!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103033624665317924845", "name": "Kristy Rather", "time": 1529334778069, "rating": 5.0, "text": "Randi is fierce! She put a plan of   for my situation in 15 minutes and educated me along the way. This is legal assistance at it’s best.", "pics": null, "resp": {"time": 1603858598704, "text": "Thank you Kristy for the feedback about Randi!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112954635071180696389", "name": "Jammie Lunsford", "time": 1484835217739, "rating": 5.0, "text": "John and his staff were outstanding! When I got sent letters I didn't know what to do, but John and his staff quickly solved my cases. They won both my cases and are very quick to answer you with any questions you may have.", "pics": null, "resp": {"time": 1484837161710, "text": "Thank you Jammie for your kind review.  We have enjoyed representing you and I'm glad we achieved the results you wanted and that you found our firm to be good about answering your questions.  Thanks for letting us represent you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112218558002212693446", "name": "Audrey Deloach", "time": 1535728369956, "rating": 5.0, "text": "All i can say is this firm is great!!!!!. Randy is talented trustworthy knowledgeable and so kind. A true go getter. If you want to WIN GO TO WATTS AND HERRING .\nTHANKS", "pics": null, "resp": {"time": 1571392334362, "text": "Thank you Audrey!!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106151364313415355798", "name": "Taylor Valenta", "time": 1501249838653, "rating": 5.0, "text": "working with John Watts was such a blessing! John and his team put me at ease and made this entire process so smooth. Every time I had a question he was there with an answer! Thank you again for all that you did!", "pics": null, "resp": {"time": 1501256440215, "text": "Taylor thank you so much for your review and for letting us help you.  We know this \"legal stuff\" can be challenging at times and so we do our best to make the process smooth.  Helps a bunch when we have great clients like you.  :)\n\nIt was wonderful to represent you and thank you for leaving us feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105374564582834018286", "name": "Gerri Wheless", "time": 1505245351459, "rating": 5.0, "text": "John and Carolyn have been great!  I have been able to call Carolyn anytime and she even called me back while in Georgia visiting her grandchildren.  If is had a problem or concern I could text John and he would get back with me as soon as possible.  I have lots of things going on in my life that really stress me out and when I got 3 civil summons in one day I had no idea what to do or how to handle it.  I got online and did some research and sound the Watts& Herring website with tips on what to do and a video explaining in detail what was happening to me.  My mind has been eased and I'm not panicking anymore.  I know that John and Carolyn will do everything they can to settle my case with my best interest in mind.  I have no doubt.", "pics": null, "resp": {"time": 1505926652208, "text": "Thanks for giving us feedback Gerri -- we appreciate it!  It is our pleasure to represent you and we are so glad you took action -- so many do nothing when sued.  It is very scary but you stood up for yourself, looked at your options, and then made a decision.  Thanks for letting us help you and for the kind review you gave us!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "100629751208974851333", "name": "Doug Jordan", "time": 1529699346895, "rating": 5.0, "text": "I was sued in small claims by a debt buyer. I have never been sued before so this was a very upsetting situation for me. I didn't know what to expect next. I had all these questions going through my mind as to what was going to happen. Luckily I found out about John Watts at Watts & Herring through a youtube video. I contacted the office and talked with Carolyn. She was very nice and assured me that everything was going to be ok. She even told me that \"we got this\". That was a big relief for me. I could even sleep better after I found out that they were on the case. In the end the John was able to get the case dismissed. I highly recommend them.", "pics": null, "resp": {"time": 1582998163547, "text": "Doug -- so glad we were able to work with you and thank you so much for leaving us this review.  Have a great day!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105158373673879826385", "name": "Shirley Ulmer", "time": 1529111744273, "rating": 5.0, "text": "I absolutely would recommend anyone who may be having any kind of issue dealing with the credit world, please,please contact Watts and Herring.They are kind, caring,and will definitely help you resolve or, guide you to understanding, how to best approach and resolve your issue.I learned so much from my first contact via phone about our situation.I was given the best advice to resolve an issue ,with an credit card my husband received,but never activated, but kept the card, but did not use it at all.We had an fee of $500 dollars, and we do not know what this fee ,was for.The card was a revolving card of $17,000.Well anyways we closed the account, but this particular card was still on us about paying this $500 dollars.We didn't\"t feel like we owed this money because we never activated the card.I have learned through Watts & Herring to read the disclosures, the fine print.I really, really,have strengthened my knowledge of dealing with situations of this kind, should it ever arise again ,in our future.I will be well prepared, a big THANK YOU TO WATTS & HERRING!!READ THOSE DISCLOSURES.", "pics": null, "resp": {"time": 1581167979868, "text": "Great advice to read the disclosures!  Thanks for sharing your experience and advice and thank you also for your review!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112873870220885949428", "name": "Lisanne", "time": 1516301458517, "rating": 5.0, "text": "When we received the summons in the mail that we were being sued by a debt collector, all we could think of was how in the world is this happening after so many years! We panicked. Being on disability, we have no money, no means and no way to take care of all that paperwork ourselves. We were beyond relief when we came across Watts & Herring! We couldn't believe what we were reading - that this could all just go away. After one conversation with Mr. Watts we were immediately put at ease. No worries! Thank you so, so much for helping us!!", "pics": null, "resp": {"time": 1516305293217, "text": "Lisa,\n\nThank you for leaving us feedback -- we appreciate it!\n\nGlad we were able to ease some of the burden on you -- you didn't ask to get thrown into this strange world of lawsuits.  Can always be a challenge when we face unknown things.\n\nBut you did it the right way -- you figured out your options and then made a decision.\n\nThank you for letting us help you and thank you for taking the time to leave us a review.\n\nBest wishes!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "111106195142947514895", "name": "Candace Peters", "time": 1506523805297, "rating": 5.0, "text": "I contacted Watts and Herring to gain some information regarding a case. I initially spoke with John's assistant, Carolyn, and she took down the details of my inquiry and set up a call for me and John for the next day. The conversation I had with John was very informative and relaxed. John gave real life scenarios for my situation, and left me with varied options. I went in very apprehensive, and ended the phone call with a different peace of mind. I respect lawyers that are not just in it for the lucrative aspect of things, but to work to help people that need them and their expertise. I would highly recommend working with John and his team, I'm sure you won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116496550243962437914", "name": "Necy W", "time": 1520368488303, "rating": 5.0, "text": "I was sued by a debt collector.  I had no idea what I was supposed to do or what I should do. I only had 6 days left to file an answer and I knew I didn't want to handle this myself in court.   I was so stressed out about it and I wanted it to be over. I ended up turning to Google to learn what others did when they were in my position.  I googled until my eyes hurt.  The day before I filed my answer I came across a video on YouTube with John Watts.   After looking at the videos I realized he was in Alabama so I decided to call just to get any kind of advice.  I spoke with Carolyn(she's so nice and knowledgeable btw) and after letting me know they'd represent me and settle my case I was SO relieved!... after spending about a week stressing over what to do I could finally breathe!   I got a phone call from Mr. Watts letting me know my case had been settled!  Making that phone call to Watts & Herring that day was the answer to all my problems!...Thank you sooo much for everything!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "117310210672621735095", "name": "Amy Snider", "time": 1516300273868, "rating": 5.0, "text": "Upon finding out I was being sued I was really shocked and a bit scared. I had received a letter in the mail stating that your firm could help me. I immediately contacted the office and spoke to Carolyn who talked me through the whole process and got things started. I would have had no idea what to do without her.\n\nMy papers were promptly delivered and signed and my case was handled in a very timely fashion. By knowing and understanding what was happening it definitely helped and I knew I was in good hands. Also, being able to sign documents online was a godsend considering its hard for me to get out of the house much.\n\nMy case was handled quickly and easily and I would like to thank Mr. Watts, Carolyn and the rest of the crew for helping take care of this and for keeping me informed along the way. I will definitely contact you again if ever I need to resolve another matter.", "pics": null, "resp": {"time": 1516300988816, "text": "Amy, Thank you for taking the time to leave us feedback.  Glad we were able to help you.  You took action which is so hard when there are difficult times in life -- so easy to just bury our head in the sand but you took immediate action.\n\nWe love using Docusign to get papers signed -- glad it is helpful to you also!\n\nThank you again for letting us represent you and also thank you for leaving us a review.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "108839257470865796441", "name": "Keith Thomas", "time": 1479836078241, "rating": 5.0, "text": "John Watts is the best.  I was facing a lawsuit that was headed to circuit court that I didn't know how to defend on my own.  After consulting with John Watts and his law firm, he was able to get the case with my lawsuit settled and dismissed.  He gave me all of my options and after only two months, everything has been resolved.  He comes highly recommended.", "pics": null, "resp": {"time": 1479839388758, "text": "Thanks Keith for your kind review.  We appreciate the chance to represent you.  We know it requires trust to hire someone when you have been sued and you were a great client.  Glad we were able to work it out for you.  Thank you again for taking time to leave us a review and have a wonderful Thanksgiving weekend!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110858689443863290441", "name": "Alex Kelly", "time": 1454681574775, "rating": 5.0, "text": "Great service! They gave me all my options in a clear and understanding matter. When it came down to it these guys took care of business. I highly recommend.", "pics": null, "resp": {"time": 1460813007378, "text": "Thank you Alex for taking the time to leave us some feedback -- we appreciate it!  It was our pleasure to help you and I want to congratulate you because you took the time to understand all of your options and then you took action....\n\nThanks again for leaving us a review and we wish you the best!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110933386537514249889", "name": "Sharon Headley", "time": 1514057663763, "rating": 5.0, "text": "Wish I would have known about them earlier, they just saved me a ton of money and helped clear up my credit report!  Took him less than 48 hours after I got the information he needed : )", "pics": null, "resp": {"time": 1526919545853, "text": "Sharon thank you for your review!\n\nSometimes the legal process is slow but we never complain when it goes fast.  :)\n\nYou did a great job doing what every consumer needs to do -- figure out where you are -- what your options are -- and then make a decision.  Take decisive action.\n\nYou did that and you got a great result.\n\nGlad we could play a small role in that.\n\nThanks again for the review and we wish you only the best!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103789261329320709166", "name": "Jennifer Lynne Clevenger", "time": 1544027692004, "rating": 5.0, "text": "My wife was home when a strange man approached the door.  He asked for me, she was not sure what was going on.  She informed him that I was not at home and the man said, “here take this”.  She asked what it was, but he responded I am just here to give it to you and got ugly with her and sternly told her she had to take it and then insisted on her name.  She was very upset.  Reluctantly she gave and realized she had just been served papers.  She immediately went in a total panic attack.  Thank God my older children were home at the time.  My wife, being a former paralegal, called around to friends who all refused to help us.  Due to circumstances beyond our control 4 years before, we lost our vehicle due to a job change for me that proved disastrous.  It was a very dark time for us, but we managed to pull ourselves up from it and found good jobs, we even bought a house.   We didn’t hear anything regarding the vehicle for years.  Then we got a letter that an attorney had the old “account”.  Then we got served 2 weeks later.  We thought we going to lose everything again and that process was inconceivable.  Being desperate, my wife looked on the internet and found Watts and Herring.  The testimonials were unbelievable.  The videos on their site only made us feel even more like someone cared and help was attainable.  We filled out the online contact form and within 24 hours we were contacted.  The attorney we spoke with was so understanding and comforting regarding our issue.  We felt we could breathe again and that things would be ok.  We had prayed for God to lead us to a strong tower, and we found it in Watts and Herring.  They were so kind and understanding and were able to settle our case in a matter of days.  Mr. Watts protected us and got us the best outcome we could have ever hoped for.  Our case was dismissed.  We are so grateful that this nightmare is over thanks to this wonderful firm.  I highly recommend them to anyone that needs help in anyway.  Thanks Mr. Watts, David and Jennifer C.", "pics": null, "resp": {"time": 1570793079543, "text": "David and Jennifer -- thank you so much for your kind review and sharing what you went through.  It was a true pleasure to represent you and we hope things are continuing to go great with you.  Thank you again!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110589490490581269289", "name": "Matt Dunaway", "time": 1497474628583, "rating": 5.0, "text": "I've know John for over 20 years.  As a fellow Alabama attorney, John and I have worked on countless cases together.  John is one of the finest consumer law attorneys in the country, in my opinion.  In addition, he is friendly, nice, and really cares for his clients.  I would give him 6 stars if I could.", "pics": null, "resp": {"time": 1497530544893, "text": "Thanks Matt for the nice review!  I have enjoyed working with you also.  Let's keep fighting the bad guys my friend....  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "100862677005845718969", "name": "Patti Davis", "time": 1449982950471, "rating": 5.0, "text": "You know the proverbial \"we have all fallen on hard times\" line? Well, that happened to me but the hard times wouldn't go away! After a year of unemployment and having a baby, I fell behind on a few bills. Finally, caught a break and landed a wonderful job! Immediately after receiving my first paycheck I began calling creditors to \"do the right thing\" I had no clue that I was actually waking a sleeping dragon!\nAfter a year in the nightmare with creditors, I felt bankruptcy was my only option. I had hired a credit counseling service, who took my money and ran. I hired a credit clean up service, who took my money and ran. The same story repeated itself over and over. Creditors were suing me, my life Was imploding and I feared I was about to lose everything! Finally, while googling bankruptcy laws, I somehow stumbled on the name John Watts and thought, what do I have to loose? I gave it one last stitch effort. I was amazed at the amount of advice he gave! He really seemed to care! He spent ample time helping me to understand my situation and gave me several options, bankruptcy was not one of them! He even sent a packet full of information! He felt like he could make an impact on my situation and that he did! One of my  creditors was American Express. They are no longer a creditor because the debt was cancelled and is to be erased from my credit report!!! John Watts was able to accomplish this without having to step foot in the court room! One case down and one to go! I am incredibly thankful to have found John Watts! Has been so very kind and generous and has given me the peace of mind I need! It gives me hope that my credit will be back in shape soon and I won't have the cloud of bankruptcy looming over my head! If you are facing a challenging situation, I urge you to give him a call! You have nothing to lose and everything to gain! I promise you, you won't regret it! Kind, compassionate and caring are the words that describes John Watts! He loves what he does and it shows. He truly is an attorney that cares!", "pics": null, "resp": {"time": 1562766357660, "text": "Patti thank you for your kind review!  Sorry you hit hard times (we all do at some point but no fun!) and I'm glad we could help you get through it.\n\nThank you again for taking the time to leave us feedback -- we appreciate it very much!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103611855014988837435", "name": "Steven Rogers", "time": 1530673919665, "rating": 5.0, "text": "Thank you, thank you Randi for all your wealth of knowledge and expertise. You took the time to answer every single question I had. You also educated me on situation concerning my options in dealing with the mortgage company. I wish I had talked with you first!!!\nIf anyone is having to deal with mortgage companies or banks concerning short-sale, Deed-in-Leau, banckruptcy, etc. you need to call Randi at Watts & Herring. This woman knows her stuff, and she will not mislead you. Call her. AAA+++", "pics": null, "resp": {"time": 1603858570857, "text": "Thanks Steven very much!!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103106374582721415056", "name": "Terra Reed", "time": 1458578536173, "rating": 5.0, "text": "My employer was served with a large garnishment in which they had no choice to start deducting from my paycheck.  The problem is that I was unaware of the debt and had never received notice.   I was in complete panic and rightfully so as I was getting 25% of my paycheck deducted for a debt that I was unaware of.   I was referred to John from 2 different attorneys and I can honestly say I could not have been more pleased with the referral.   To make a long story short John fought hard for me and my case.  He kept me updated and he kept me calm.  The best part is that he believed me and my story.  I know its easy for people to think you are running away from your debt but John never doubted what I was telling him.   It took a few months but he fought hard and I received ALL of the money that was garnished along with the company dropped the case and the judgement.  I would highly recommend John and his staff.  I  will be forever grateful for John working so hard on my case.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "108022352871802155935", "name": "Peter-John Sligting", "time": 1460567171077, "rating": 5.0, "text": "Dealing with Debt is hard especially when you find out someone is suing you. I happened on John Watts's website by happenstance and sent an email requesting help. John responded almost immediately. He was personable, calming and helpful in his response. Both he and Carolyn (John's legal assistant) were extremely nice and I have valued the advice they have given me. THANK YOU John for everything.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "118296039424808816355", "name": "Brandy Gaither", "time": 1501791214152, "rating": 5.0, "text": "Spoke with them regarding a garnisment of wages issue.  Extremely nice people!! Very helpful in my situation and led me in the direction to start resolving my issue!! Highly recommended!!!!", "pics": null, "resp": {"time": 1501794255023, "text": "Brandy thank you for leaving us a review!  We are glad we were able to help you see how to resolve your situation.  You did the right thing in finding out your options and now taking action.\n\nBest wishes with everything and thank you again for leaving us a nice review!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116305760226512663875", "name": "Lamar Brown", "time": 1531757107491, "rating": 5.0, "text": "As I started researching the company trying to sue me, I was researching and come across Watts & Herring website, great data base and very helpful, if I do use an attorney it will be Watts & Herring.   Thank You.", "pics": null, "resp": {"time": 1575032502163, "text": "Lamar thank you for your feedback and review!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114187535237550006901", "name": "Mark Hodgson", "time": 1479841521407, "rating": 5.0, "text": "John and his staff are amazing. A debt company sued me i contacted john and within 2 weeks they had resolved everything . If you are being sued contact john before you do anything, John and his team will walk you through everything and put your mind at ease. Thanks john", "pics": null, "resp": {"time": 1479843737077, "text": "Thanks Mark!  Appreciate you taking the time to give us feedback.  I'm glad you allowed us to help you and thanks for having faith in us.  Have a good one!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110129587326250683423", "name": "BJ Spruce", "time": 1534342426627, "rating": 5.0, "text": "I was out on date with my wife when I came home to my mother in law giving me a stack of papers delivered while I was out. I was being sued by a debt collector I had never even heard of. After a day of panic and trying to wonder what I was going to do, my wife started taking to google to look for any kind of help. Watts & Herring was the first thing that popped up. So I gave them a call and explained my situation to Carolyn who is a very sweet lady. She told me exactly what I would need to do and told me that everything will be ok and that \"weve got this.\" Within 2 weeks I received a response saying my case was settled. I must recommend that if anyone has any issue at all with debt collectors in Alabama, please do not hesitate to call this firm. Mr. Watts, I want to thank you from the bottom of my heart and please know that my family will always be eternally grateful for what you did for us. Thank you so much!!", "pics": null, "resp": {"time": 1534343892578, "text": "BJ -- thank you so much for leaving us a review and sharing your experience.\n\nYou were great to work with and while I appreciate the compliments -- you are the one who took action.  So many do nothing when facing difficulties -- it is just human nature for all of us.\n\nBut you guys took the initiative so you deserve the credit.\n\nThanks again for letting us help you and have a great day!!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110424214060186698587", "name": "Mike Ross", "time": 1458487903929, "rating": 5.0, "text": "I was being sued by a debt collector.These people had me intimidated and very nervous about this court case.Mr. Watts gave me advice  and information that not only made me feel much more comfortable,but actually helped me win my case.Upon learning of my success,Mr. Watts called to congratulate me.He also informed me that because these people were in the wrong from the beginning that it would be in my best interest to sue them back.With the help of Mr Watts and his team I did.We won a settlement that I was very pleased with.My name is Mike Ross,I am 54 years old,and I would highly recommend Mr. Watts and his team if you want to win your case.Their very knowledgeable,and will make you feel at ease.Thanks again guy's I really appreciate your help.", "pics": null, "resp": {"time": 1563539468053, "text": "Mike,\n\nThank you for your kind review and feedback.  And especially thank you for letting us represent you.  It is scary being sued but you took action and that's the key.\n\nThank you again for your feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "101645841003863229836", "name": "SU Hunter", "time": 1498736806788, "rating": 5.0, "text": "I will be honest, I hate lawyers.  I had a case though, that I needed help with.  I did the internet search and found Watts and Herring.  After a few emails back and forth, I decided to try it on my own.  This office still helped me prepare, even though I had not hired them.  I was surprised.  I went to court and found that the judge pretty much wasn't going to listen to anything I had to say, because I wasn't a lawyer.  I lost the case.  Mr. Watts called me personally and discussed my options with me.  After an hour on the phone, I decided to appeal my case with John's help.  I had a second case coming from the same company and John said he could win that also.  I thought, what do I have to lose.  Within 30 days of hiring John Watts, I received notice that both cased were being dismissed and it would be coming off my credit record.  As I said, I hate lawyers.  If I ever need one again though, I will be calling John Watts.  His office is very responsive and gets the job done.  He doesn't make fake promises.  Well worth the money.", "pics": null, "resp": {"time": 1582998353729, "text": "Thank you for your review.  I'm glad we were able to help you.  You did not give up -- you kept fighting which is a great quality.  Thank you for letting us work with you and for your very kind feedback.\n\nHave a wonderful day!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "101810364503990056659", "name": "James Bennett", "time": 1537247943918, "rating": 5.0, "text": "The YOU TUBE video was PHENOMENAL! I need help with a case in KY and will call", "pics": null, "resp": {"time": 1571392240912, "text": "James -- glad you liked our videos on YouTube.  We aren't licensed in Kentucky so you may want to look at this website to help find a lawyer to help you -- https://www.consumeradvocates.org/find-an-attorney.  Best wishes and thanks for the feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110260567767404239650", "name": "Brad Cox", "time": 1449749558210, "rating": 5.0, "text": "I had been sued by a collection agency over a debt that was not mine and totally unexplained. As a person with limited means I started looking to the internet for information and came across Watts and Herring Consumer Protection, LLC. I started reading their VAST knowledge base about consumer protection, and more over my rights as a consumer. There are documents that will assist you through this process. I was shocked a business released so much information. As I learned about the SMALL CLAIM COURT PROCESS and the valuable tools I had in my hand I decided to fight my own case in the Small Claim Court that had been filed against me. As I was told in the documents; Small Claims Court was just as I had read. A room full of collection attorneys PREYING on people that had no idea and was agreeing to things they had no idea they even owed. NOT ME, I asked questions and within five minutes I WON MY CASE. Months had went by and my credit report did not reflect the win. After two to three attempts and certified letters I made the call to John Watts and his team. They review my case and on my behalf filed a Federal Law Suit. This case has been settled and I am grateful for Watts and Herring for their assistance. All of the Staff at the firm were knowledgeable and very helpful. I recommend Watts and Herring for and Consumer related issues.", "pics": null, "resp": {"time": 1463423241981, "text": "Thanks Brad for taking the time to leave us a review.  Glad you found our website helpful -- we do our best to give away a ton of information.  For some folks, it makes sense to hire us and for many it makes sense to do on their own like you did.\n\nCongratulations on winning your case.  Amazing these debt collectors/junk debt buyers take such a flippant approach to our credit reports.\n\nWe appreciate you letting us represent you in federal court and thanks again for taking the time to leave such a detailed review.\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "105110211334163356939", "name": "Toni Rentz", "time": 1505155391806, "rating": 5.0, "text": "I was sued by a debt buyer in Small Claims Court. I answered within the allotted timeframe and received notice that a court hearing had been set. I did some research and came across John Watts' website and his video about steps to take. I received free legal advice elsewhere and the first thing from that attorney's mouth was \"Let's work out a settlement\". When I stated I didn't want to do that the attorney said, \"I guess we can go to court\". Well from Attorney Watts' video I learned you NEVER want to pay the debt buyer money because they paid the original creditor pennies on the dollar so everything they collect from you is profit!! I called Attorney Watts' office and spoke with Carolyn. She was so understanding and really comforted me during this stressful confusing time. I hired them to handle the lawsuit. I was told I wouldn't even have to go to court, he would go to court for me and call me with the decision. Then I received a personal email from Attorney Watts himself, which I found so sweet. Sometimes when you hire attorneys you never receive anything from the actual attorney only his staff but that is not the case with this firm. Well fast forward to 2 weeks since hiring Attorney Watts and I received a notice that my case had been dropped, no judgment against me, no consent judgment, and I don't owe them a dime! I remember being so worried when I found out about the lawsuit and then resting so peacefully afterward hiring him. I am extremely grateful and so glad I chose to go with him instead of the \"I guess\" attorney. Thanks so much Attorney Watts, Carolyn, and all of your staff!", "pics": null, "resp": {"time": 1505179822555, "text": "Toni, thank you for leaving us a review and sharing your experiences.  It can be so stressful to get a lawsuit filed against you by one of these debt buyers.\n\nSo glad you did your due diligence and kept asking questions.\n\nCarolyn and the others at our office are great and make us as the attorneys look better than we are.  :)  Glad you had a great experience with us and thank you for letting us help you!\n\nAppreciate you taking the time to leave us feedback also!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112457042182335103361", "name": "Jason Krebs", "time": 1494518503916, "rating": 5.0, "text": "I have known John Watts for several years.  As I lawyer myself in another state, I rely on John for information on Alabama law, both personal injury and consumer.  I recommend John highly.", "pics": null, "resp": {"time": 1582998251991, "text": "Jason -- thank you for the feedback!  Keep fighting the bad guys my friend....  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106221382019565534412", "name": "Jason Holifield", "time": 1531412071246, "rating": 5.0, "text": "The best advice I could ever give in a situation that involves foreclosure, is to contact this law firm FAST & EARLY!!!! From speaking to Randi, I immediately knew by our talk that this was the firm that was not afraid of fighting the fight, but they also want clients that are fighters also! I made a ton of mistakes by not contacting them earlier on but I’ll never forget the follow up and advice given! Never have I encountered a paralegal on as high of level and knowing of John G Watts reputation, if your faced with issues of a foreclosure sale happening CALL NOW!! Do not wait! If you do then all you’re doing is allowing your own hole to big dug deeper with the cheats, lies, fraudulent activity, and misleading acts by your mortgage company!!! You have rights! You have a choice to do it yourself, hire another attorney, or you can hire the Great White Shark of LawFirms and let these guys take over knowing they are going to fight and expose the banks for who and what they are! Call the offices of Watts & Herring and get your peace of mind happening ASAP!", "pics": null, "resp": {"time": 1582998121155, "text": "Jason we really appreciate your feedback and review -- thank you!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109687091762609709170", "name": "Jackie Umpleby", "time": 1468261667134, "rating": 5.0, "text": "When I was first served a summons and learned that I was being sued for an old debt, I was terrified. I am a young mom and have a lot on my plate, not to mention- I have never been in any \"legal\" trouble before. The debt was far more than I could afford. At first, I did very little research. I tried reaching out to the debt collector directly to try and settle this. When that did not go anywhere (and it typically doesn't, they would rather not settle directly. They can get more by taking you to court.) I reached out to Ferry & Nichols. Ferry & Nichols send out the same letter to everyone in the state of Alabama that has an open case against them. They state they are a mediator and will \"assist\" you in \"settling your debt at a much lower price\". For me, it was $300 lower than the alleged debt..but with their fees I would be paying only $50 less than what I was being sued for. After a few calls to them, something was fishy. They never answered any of my questions and I spoke to multiple different people who kept telling me different things. I was not confident with hiring them. At this point I had only a few more days to respond to my summons before a default judgement was placed against me. My anxiety was through the roof. I did more extensive research and came across Watts & Herring. The videos on his website were so helpful, I called immediately. Caroline answered my call and she was so comforting..I laid it all out on the table; my problem and how fearful I was. She reassured me that Mr.John Watts could help. And he did! Not only did he give me the best possible choice, he taught me a lot! He was always a text, call, or email away. He solved my debt with this nasty debt collector better than I even expected! My total cost spent was far less than I would have guessed when I first started this process. My only regret is that I let myself worry and stress too long...I should have called the minute I found out. John is a life saver and made what could have been a very bad experience into a great one! My advise- do not make any decisions into solving your debt until you speak to John. He is an amazing and genuine person. Highly recommend this wonderful man and his office!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116607111985095540648", "name": "Tomm Pi", "time": 1468607364061, "rating": 5.0, "text": "I was being sued by a collection agency for a large sum of money and when I tried to negotiate they offered to reduce the amount to 90% of the original amount. Unhappy with the attitude of the collection agency, I searched the internet and found John Watts. I was a little skeptical but I am so happy I went with John. My case from beginning till end took 2 months but he did exactly what he said he would do. I paid 0 dollars to the collection agency and they had to clear up on my credit reports. John is truly helping people and I hope to find more people to send his way. I want to thank John and his staff for their help. You have helped me and my family so much!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "117873868235125684448", "name": "Alex Ranns", "time": 1501035484390, "rating": 5.0, "text": "I discovered this firm via Youtube and they truly helped me. Thank you so much!!!", "pics": null, "resp": {"time": 1582998375033, "text": "Alex -- thank you for your review and glad you found our videos.  Have a good one!  John Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "113659479970967971070", "name": "Julie Tillman", "time": 1481941091904, "rating": 5.0, "text": "So...... years ago, I made a terrible decision to consolidate my credit card loans and the company I was working with just told me to pay them and they would settle with the credit card companies. Long story short, I paid them monthly but not all accounts were settled. Several years later, I end up getting a letter saying I'm being sued by Unifund. I did a little research and came across John's website. From the first point of contact, he and his assistant, Carolyn, were extremely professional. They were very patient when answering all of my questions and made sure I understood my options clearly. I decided to represent myself in court and John walked me through the process, step by step. Thanks to his help, and maybe a little luck, the judge ruled in my favor. I didn't owe the money! Not only that, we turned around and sued Unifund and instead of going to court, they settled for $5,000. (They are apparently a shady company, so DO NOT automatically pay them!! Call John!) So thanks to John Watts, I ended up making money instead of having to pay it. How crazy is that?! And by the way, with this money, he helped me put it to good use by settling another old debt for about half the balance. This guy is nice, honest and knows what he's doing. I would recommend him to anyone! I will be forever grateful that I decided to work with him!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "100330197085960113407", "name": "JLW Moon", "time": 1475102482054, "rating": 5.0, "text": "John was a tremendous help and went above and beyond. Over the course of 2.5 years, John guided me through a very difficult situation and helped find a resolution. Thanks for all you do.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "109929393855917463303", "name": "M. Jael Wall -Ellis", "time": 1547666888788, "rating": 5.0, "text": "The staff was more than knowledgeable and helpful. I highly recommend using their services.", "pics": null, "resp": {"time": 1563799067309, "text": "Thanks for your kind comments and feedback -- glad our staff was helpful to you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "102599615941504741116", "name": "LH 97", "time": 1459403718880, "rating": 5.0, "text": "A couple of years ago my husband was served papers that he was being sued by an \"infamous\" debt collector. We were so upset and didn't know where to turn. We had only 14 days to file an answer to the complaint or the plaintiff would get a default judgment. I started searching on the web of how to answer the complaint, but had no idea how we were going to fight this! I didn't know where to even begin!\nThen, I came across Watts & Herring, Consumer Protection Attorneys website and blog and started reading and watching videos that John Watts had posted. I started feeling much more at ease and decided we would try to fight this.\nWell, before I had even submitted an answer to the complaint, a process server came again and my husband was being sued for a SECOND lawsuit by the SAME \"infamous\" DEBT COLLECTOR!! Now we had TWO answers to file. I felt a bit overwhelmed, but felt like I could tackle this. We WERE NOT going to let them win by a default judgment!\nI turned in the answers and got notice of court dates. The court dates were exactly a week apart!\nI did a lot of research and felt VERY confident on our day in court. I did have some concerns in facing a judge and not knowing what questions may be asked by the plaintiff. However, I came prepared to court, and after speaking with the attorney for the plaintiff for awhile and questioning everything that was his \"evidence\", he caved. We WON lawsuit number one!\nThe very next week we went to court for the second lawsuit, very confidently, with our heads held high, and lo and behold...the same attorney was representing the plaintiff! Again, he caved. So, WE WON AGAIN!! We had been sued TWICE by the same \"infamous\" debt collector and BEAT THEM both times!\nWell, I had sent an email to John Watts of Watts & Herring to let him know about our success and to thank him for all of the wonderful information on his website. He congratulated us and suggested we sue the debt collector back in Federal Court. WOW! I had no idea that was an option!\nEven though we succeeded in our county small claims court twice on our own, I knew we would need the expertise of John Watts for the Federal Lawsuits; there's no way we could do that on our own.\nJohn explained our options and was very attentive with any of our concerns. He represented us in filing TWO Federal Court Cases against the debt collector that had no right to sue us.\nThe process went very smoothly for us. John or the knowledgeable staff at Watts & Herring kept us updated regularly throughout the whole process of any kind of progress being made on the lawsuits, and that put my mind at ease instead of worrying and feeling overwhelmed.\nBoth Federal Court Cases resulted in settlements that we were very pleased with. We could not have been any happier. We truly would like to thank John Watts and the staff of Watts & Herring! We could not have fought those battles alone!\nSo, for any of you reading this, if you're sued by a debt collector, I highly recommend Watts & Herring! Be SURE to answer any lawsuit within the deadline and do not let them win a default judgement! Try not to be overwhelmed, intimidated, or let it stress you out or give you anxiety. Seek the advice of Watts & Herring. They are very friendly and knowledgable folks and can explain your options. I know you will be pleased!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "106753985192971763410", "name": "John Jackson", "time": 1584215873997, "rating": 5.0, "text": "They take care of you", "pics": null, "resp": {"time": 1603858555418, "text": "Thanks John -- we appreciate the review and feedback.\n\nJohn"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114294480484654689053", "name": "wc Scales", "time": 1473782253546, "rating": 5.0, "text": "My family has been going through a stressful time moving my grandmother to a nursing home. We were not getting any help from the faculty she was in. The facility was trying to coerce us to hire a specific attorney. We did not think we needed an sttorney. I contacted this firm and John Watts gave us direction during a consultation. He did not believed we needed an attorney either. He answered all of our questions and advised us. It has been a trying and confusing time and we are so grateful to Mr. Watts for his help!!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "104289350708259589009", "name": "Stokes Spencer Jr", "time": 1515172546695, "rating": 5.0, "text": "I was served with papers telling me that I was being sued by a debt collection agency. I was a little scared, angry, confused because I had never been in this situation and had no idea what to do or where to turn. I did not want another blow to my already sinking credit so I immediately began to do research and I came across an article written by Mr. John Watts that described exactly what I was going through and how I could handle it. From that point I went to the website and submitted my information and received a phone call from Carolyn Allcorn who was so nice and helpful she took my information and said ok Mr. Watts can make this go away and you would never have to deal with this company ever again. I was a little skeptic at first but she reassured that this was my best option so I said ok lets do this. I was more at ease than before but still had a little worry. That very next morning I received a  call from Mr. Watts who told be the company has agreed to drop the case. SAY WHAT? Just like that? I was so relieved and knowing I didnt have to deal with this company coming after everything I have worked for. I just want to say thank you so much to Mr. Watts and your entire team you have made my life easier. Thank you for working so hard and so quickly to get this resolved! I am no longer worried about these evil companies coming after me ever again claiming I owe them anything because I now have someone on my side I know I can turn if this happens again.\n\nIf you are ever in this situation I urge you to contact Mr. John Watts, you wont regret it!\n\nOnce again thank you! thank you! thank you!\nStokes Spencer Jr.", "pics": null, "resp": {"time": 1515175440177, "text": "Stokes,\n\nThank you for taking the time to leave us feedback.  We appreciate it very much!\n\nYou took action -- you figured out your rights and then you made a decision.  That's what we have to do in these situations.\n\nI'm happy we could help you -- it doesn't always happen so quickly but nice when it does.  :)\n\nThank you again for the very kind words and know that we enjoyed representing you...\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103752818666185204724", "name": "Terry Bain", "time": 1467064554508, "rating": 5.0, "text": "This experience for me has been interesting. When I first received those papers of being sued and possibly having my wages garnished I felt helpless. That made me depressed and hopeless  I wasn't able to sleep or eat for a couple of days. It seemed unfair that my credit and my income were constantly taking hits and there wasn't any room to breathe or get ahead. Then I started to look for help and come to find that there aren't many lawyers that are willing to help and support you during those times. Fortunately in one of the oddest places I found a person who would teach me a lot that was Google and YouTube. First I was able to find Randi on Google and she enlightened me on many aspects of how these things go then she sent me links to helpful information that led me to John and YouTube. The videos were a breath of fresh air! Finally someone who is interested in educating others as well as putting actions with it. Randi connected us and there wasn't any delay in him reaching out to me and putting the situation in terms that I could understand and making me sure that there are options. Many people don't get the chance to have options when dealing with legal issues and I am glad that there are lawyers out there that will inform as well as help you to stand up to poor collection practices and tactics. I wish that they had a larger platform to reach many others like myself whom otherwise would have to take being mistreated by the collections system. I feel if all lawyers could be like this then people would have less disappointment with the legal system, from start to finish his whole team treated me like a person and kept me informed as to what was going on with my case and made me a part of what was going on. One of the most satisfying things about this whole process was to deal with someone who when they said something they meant and did it. I have learned a lot during this experience and I can't thank you enough for your help.\nSincerely Yours\nTerry Bain", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "113247933370568289856", "name": "Brenda Geiger", "time": 1472660264200, "rating": 5.0, "text": "I'd like to thank John Watts and his team.  He and his staff were very knowledgable and got my case settled quickly.  I would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "107206711551557772163", "name": "Pam", "time": 1501250348914, "rating": 5.0, "text": "Randi helped to calm me down, explain what we needed to do step by step and understood our situation. Not only would i recommend them, i will use them again anytime i need them!", "pics": null, "resp": {"time": 1501256167096, "text": "Pam, I'm so happy Randi was able to help you.  Part of what makes it so difficult is you get \"thrown into\" this legal arena without warning.  And there are so many confusing words, contradictory advice, etc.\n\nSo you were very smart to do your due diligence to find out your options and then to decide what is the best course of action for you.\n\nThanks for reaching out to us and thank you so much for taking the time to leave us feedback in your review.  We appreciate it very much!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "112627302766147516893", "name": "Mohogany S. Prewitt", "time": 1475939366348, "rating": 5.0, "text": "As for how I felt when I was sued, It was very unsettling for both myself and my Husband. I have to admitt that I immediately went into a panicked. Although it was after 6 pm on a Friday evening, I grabbed the telephone and began to call the list of Attorney's I had Googled. My stress level shot up and I thought about taking the pills that my Doctor recomended to calm my nerves a few weeks ago, but I discovered that I had ran out.  What I did do, was make sure that I had taken my blood pressure meds. for that day. Thereafter, the entire weekend was a blur.  I could not get my mind from focusing on being sued.\n\nMonday morning rolled around and we figured that perhaps we can try to work this out without legal counsel. I then called the number on the paperwork. The person on the other end (whom I thought represented the TJMAXX Co.)convinced me that I would be out of this mess if I paid them a lump sum or payed a sum monthly for 2 years, and signed a Concent Judgement Form. That was a chance I welcomed if it meant that we would be out from under this pressure. We considered selling my Husband's vehicle to do the settlement but decided against it( his car isn't worth much anyway). Instead, I made the first monthly payment which was money set aside for my 14 year old daughter's Curriculumn for that year. We felt uneasy about the Consent Judgement Form after we did some research on it. My Husband and I placed a stop on the check , but the bank said it had already been processed. We then decided that we will seek legal counsel because clearly, we needed it!\n\nTuesday morning I got a call from Mr. Watts's Secretary, Carolyn. Just speaking with her,  made me feel less anxious, but I was still not completely settled. The following day My Husband and I spoke with Mr. Watts. He took his time and explained the situation and our options. All of our questions were answered and we ended the call with the feeling of having had a black cloud literally lifted from over our heads! Although we are aware that the process is in its infancy, our anxiety level has greatly diminished!\n\nFast Foward to October 8, 2016:\nAround 8:45 that morning we got an email from Mr. Watts stating that we won our case! We were so grateful to God and Mr.Watts and his Staff! One other thing...during the time we were waiting for the case to settle we did not receive anymore threatening comunication from the Company that we were being sued by. This made waiting for our Victory a great deal easier! We recomend Watts & Herring, LLC to all anyone who ever find themselves in such a terrible place as we did.\n\nSincerly,\nMr. and Mrs. Prewitt", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "100458798204077620878", "name": "Susan D", "time": 1458857088303, "rating": 5.0, "text": "I will never forget the fear that I felt when a collection agency was threatening to sue me with harassing letters and phone calls.  I will aslo never forget the relief I felt the day that I walked into the office of Watts and Herring and spoke with John Watts.  I have never felt so relieved in my life.  The first time I sat down to speak with him, I felt like he was an old friend.  I walked into his office hoping for answers to get the bad guys to stop harassing me.  Not only did Watts and Herring get the bad guys off my back,  all communication from them ceased immediately, AND I ended up suing THEM for violation of the FDCPA .  It really felt great to turn things around on them.  Lately, with all of the scams going around, I have received threatening phone calls from phony debt collectors.  All I had to do was send an email to Watts and Herring and they answered me immediately to assure me that the phone calls were from scammers.  I felt that same feeling of relief as when I spoke with them for the first time.  If I ever have questions, I know that my old friend is only an email away.   So, if you are experiencing similiar issues, I would highly recommend a phone call to Watts and Herring.  They will fight for you; take care of those bad guys; and turn your feeling of fear into a feeling of relief.", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "116426224262834221231", "name": "MARY DAILEY", "time": 1528740302583, "rating": 5.0, "text": "I Don't know what to do LVNV was sueing me the bill was paid but they said it wasn't I look at some reviews and read a lot of them from John Watts and he said give him a call and I did  Carolyn sent me some steps about the seven mistakes and they were on point because 4 of the seven they ask so I won the case THANK YOU JOHN AND CAROLYN GOD BLESS", "pics": null, "resp": {"time": 1528756861328, "text": "Mary,\n\nThank you for taking the time to leave us a review!\n\nGlad the report helped -- so much of getting a good outcome when dealing with collectors is to know your rights and then take action.\n\nYou certainly took action and you won so congratulations to you!\n\nThank you again for the feedback and have a great rest of the week!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "115845294560765404043", "name": "Tammy Wyatt", "time": 1528754621888, "rating": 5.0, "text": "I was in despair about my legal rights on the foreclosing of our home Randi Watts gave me some sound legal advice.", "pics": null, "resp": {"time": 1528756395127, "text": "Tammy, we are always glad to help any way we can.  Facing a foreclosure is incredibly scary but you have done the right thing to figure out your rights and take action.\n\nThanks for taking the time to leave us feedback!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "114640909699022155991", "name": "Jeffrey Brunk", "time": 1537889775564, "rating": 5.0, "text": "Provided a quick resolution to a troubling situation.  Entire staff is very friendly.", "pics": null, "resp": {"time": 1563539544307, "text": "Jeffrey,\n\nThank you for your review.  We know people call us when they are facing difficult times so we always do our best to be friendly and helpful.  You were great to work with and thanks for your feedback!"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "103272135772681008524", "name": "Nikkie B James", "time": 1456956137001, "rating": 5.0, "text": "Thank you so much, John!\nWonderful Firm!", "pics": null, "resp": {"time": 1562766380907, "text": "You are most welcome -- we enjoyed working with you!\n\nJohn Watts"}, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "115467049060168467933", "name": "Toby Hardy", "time": 1458849843623, "rating": 5.0, "text": "John and his team saved our house from an unfair mortgage servicer that was not playing by the rules.. highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891b91690004ef:0x82b36df943c7bdf8"}
{"user_id": "110860448399331072407", "name": "Tanner-Gean Dowell", "time": 1627084015936, "rating": 5.0, "text": "Ian and Thomas ARE MY TEAM! They were amazing! Made my divorce quick and easy! Very responsive and professional! Will look to Ian for all my legal needs from now on! Held my hand through it all and still responds at the quickest call or E-mail!!! Cannot say how much I am at ease knowing I've got a lawyer team that works FOR me!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106808053877852743200", "name": "Lewis McCluer", "time": 1619279026738, "rating": 5.0, "text": "I'm involved in a landlord-tenant dispute and realized I was over my head and needed help. I contacted the Powell Law Firm and got a consultation with Thomas that day. He was very attentive and professional and let me know my options in plain, no nonsense terms. He also let me know that the firm was always available should the matter get to the point that representation became necessary. When I had further questions as the situation progressed, I called back, but was unable to reach Thomas immediately, as he was in court that day. I left a message with their front desk,  and received a call back from Melvin later that day as Thomas was still in court. He listened intently and further advised me as what I needed to do, and even returned another call in regards to my issue. Both Thomas and Melvin were extremely helpful in what was to me new territory as I had never been in a situation like this before. They stood ready to assist any way they could to include retaining their services should the need arise. As a retired Marine with 26 years service I know professionalism when I see it. Hope I don't need to retain an attorney for this current situation but I have full confidence in them should that need arise. I highly recommend that you contact them in the event you fell you may need the services of an attorney/", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "113487847135832316301", "name": "Lisa Edwards", "time": 1626804915412, "rating": 2.0, "text": "I had a 10am appointment to see Mr. Thomas today. It was the worst meeting i have ever had with this company. The young lady at the front desk was more interested in talking to her friend on the phone then greating me when i walked in. after standing there for a few minutes i was told to go have a seat in another room to wait again. as I'm waiting i can hear Mr. Thomas instructing another young associate to go and tell someone to do something and make sure they get it done because that was his money. I'm pretty sure that conversation should not have been discussed in front of a potential client. As I am sitting there explaining to Mr. Thomas why I am there seeking hes services he was more interested in picking the sores on his leg then paying any attention to anything i had to say, and while he was showing me the bruises from his recent jet ski accident all he could tell me was to seek an attorney immediately. I believe that's what I am here. What he ment was i needed a court appointed attorney because I could not afford him. So with Very unprofessional! My family has dealt with Powell Law firm for many years my aunt has know Mr. Thomas sence hes graduation year in 07. They have been wonderful people always willing to help with a smile. till now. So with no help from Mr. Thomas all I can do now is sit back and hope a friend doesn't pass away in lockup because she has a rare condition that causes her to have seizures. I am so disappointed in the actions of Mr. Thomas and the rudeness of the employees at Powell Law Firm.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "100902628666946632693", "name": "Gregory Dalzell", "time": 1626453525916, "rating": 5.0, "text": "My sister-in-law and wife were trying to figure out what to do with issues related to their father’s estate. It was especially difficult because they are in Virginia and the estate is in South Alabama. They called several South Alabama law firms seeking help and the reactions ranged from lack of response to disinterest in their concern. They called Powell Law Firm and spoke with Mr. Melvin Dixon. Mr. Dixon listened with patient understanding to their problem and did what he could for them with direction from his senior partner. They are very grateful.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "118330176431002688600", "name": "Karen Ulrich", "time": 1624466088769, "rating": 5.0, "text": "I just needed my questions answered to make sure I was making the correct decision on an eviction process.  He listened and answered all my questions and even offered to help me again.  I am so thankful he was willing to help me without the expectation of money.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "107951597291764037125", "name": "Patric Landrum", "time": 1616011996713, "rating": 5.0, "text": "I would definitely definitely recommend Ian and the Powell Law Firm to anyone. Ian has assisted my business partners and I on several task for our company.\n\nThe professionalism and service level we reviewed from this team was outstanding. We will absolutely be doing future business with this awesome team.\n\nHighly recommend!\n\nRespectfully,\nGulf Coast Security LLC.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106691410347904209936", "name": "Cassandra Karcz", "time": 1616448238393, "rating": 5.0, "text": "I called the Powell Law Firm about a situation that had me in a panic. They were able to get me in quick, and handled my situation immediately! Thomas is great, and put my mind at ease (and gave me a good laugh, while doing so). Their staff is amazing!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106786266679158786639", "name": "Sarah Reynolds", "time": 1606271564946, "rating": 5.0, "text": "Thomas handled my case with utmost professionalism and concern for my needs and especially for my children's needs.  He was accessible and always willing to answer my questions directly and honestly, no sugar coating.  This law firm will fight for you as long as it takes. The office staff, especially Kimmie, was always ready to answer my calls and help me with whatever I needed to get accomplished at the time. During the most horrible time of my life, Thomas and Riley stood by my side until the end of this difficult process. I can't thank them enough.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "109304266640833108957", "name": "Julie Roberts", "time": 1594672264622, "rating": 5.0, "text": "I really really like Thomas Hughes, after meeting with him, and the entire staff they all made me feel comfortable, straight to the point!\nAbsolutely THE BEST LAW FIRM I HAVE EVER DEALT WITH!!!!!! Needs a 10 Star! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "101476228033013696220", "name": "Valerie Coulter", "time": 1602176984211, "rating": 5.0, "text": "Outstanding crew... They were very Professional, kind, and nice to work with!!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102289647367991014496", "name": "FRANK RENTZ", "time": 1584737985155, "rating": 5.0, "text": "The Powell Law Firm did wills for my wife and me. They were very professional and thorough. The work was done in a timely manner. I certainly would recommend them to others. I was very pleased.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110280103903710786743", "name": "Amber Middleton", "time": 1565722778130, "rating": 5.0, "text": "The Powell Law firm and their staff have been fantastic through out my divorce and custody issues. Riley Powell has been there to answer any questions I've had and I've sent plenty of emails to his firm and they have all been responded to and in detail.I am always kept up to date and I always feel comfortable in court and in knowing myself and my children's best interest are put first. They truly care and always make sure things are going okay for us!  Riley Powell and Thomas Hughes are hands down the best!", "pics": null, "resp": {"time": 1566253743656, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112804854970169096855", "name": "Lydia Franz", "time": 1567184014137, "rating": 5.0, "text": "Riley told me the best thing I have ever heard about Attorney's.\n\"You pay an Attorney to worry for you\"\nNot only did he worry for me, he brought my case to the best possible outcome we could achieve. No one ever really wins when you have to take it to court, but the advice and representation that I received made my life better, and we were able to at least bring things to a acceptable conclusion.\nI would highly recommend the Powell Law Firm.", "pics": null, "resp": {"time": 1568451270274, "text": "Thank you for leaving us a review. We appreciate it!"}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106260565649116410204", "name": "C.C. Moreno", "time": 1595297372723, "rating": 5.0, "text": "Both Thomas and Riley are consummate professionals. With their combined advocacy, I would trust them with anything I needed handled.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103890901319725228077", "name": "Doug Jacobs", "time": 1565726681016, "rating": 5.0, "text": "5-Star Performance!  I had a case that took over two years to get completed but it was all worth the effort. Riley Powell has a photographic memory and it pays off in the courtroom. Thanks again for a great job to Riley, Thomas and Kimme!", "pics": null, "resp": {"time": 1566253724942, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "117118563722722065792", "name": "Ashley Hall", "time": 1537728035194, "rating": 5.0, "text": "Riley Powell and staff are amazing. He is more than just an intelligent, skilled, driven, and experienced lawyer although those are noteworthy attributes; he is someone who cares and is passionate about fighting for you. He knows what to say and what to do, and I am grateful God saw fit to put him in my path. I highly recommend Riley Powell.", "pics": null, "resp": {"time": 1566253752448, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111447719194241910969", "name": "Peggie Montgomery", "time": 1587768374913, "rating": 1.0, "text": "Costly and he did not represent our son as promised.  A lot of hot air!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112634507670671020646", "name": "Earl Suhre", "time": 1575327795549, "rating": 5.0, "text": "Mr. Powell & Thomas were Amazing in the case they were handling for us !!!! We cannot Thank Them enough ! They went above & beyond . The Best Attorneys Ever !", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102927331386640173175", "name": "Serendipity Sharra", "time": 1529039036799, "rating": 5.0, "text": "Met with the owners on a job interview and I can honestly say they were two wonderful, friendly, honest, and smart men. I didn't get the job but they were kind and honest with that too. I would highly recommend them and will certainly go see them if ever I am in need of a lawyer.", "pics": null, "resp": {"time": 1566253778635, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106713700146633879124", "name": "Amy Elliott", "time": 1565811262181, "rating": 5.0, "text": "Riley Powell and the attorneys at the Powell Law firm are professional, knowledgeable, honest and will fight for you!  I appreciated them being so caring, and keeping me informed during my case.", "pics": null, "resp": {"time": 1566253715758, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111700835149697040103", "name": "Donna Michelle Wade", "time": 1528082860564, "rating": 1.0, "text": "Absolutely horrible representation . I gave them $1800 cash for a simple divorce, asked for no desperation of assets, no children involved. Simple divorce that was us mail paperwork, and showing up for final dissolution court hearing. Now they are trying to extort another $625 out of me. Maybe they are \"great\"  for their rich and privaledged clients, but have no heart or soul for your everyday person. I ran home from an extremely abusive relationship and chose them because they were close by. My mistake . Do your homework and chose a attorney based on your needs, not their's.t", "pics": null, "resp": {"time": 1566254154668, "text": "Thank you for taking the time to leave us a review. Although it is difficult to hear negative feedback, without receiving reviews we can't improve our services in order to provide the best legal services for our clients. From your review, we looked at how we communicate expectations of fees with clients in more detail so there are no surprise fees from filing. We truly appreciate you took the time to leave us a review and hope you are doing well."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103180079001744797172", "name": "Arjen Meter", "time": 1529355941422, "rating": 5.0, "text": "The Powell Law Firm has always handled any issue, question, or legal concern my family and I have came to them with quickly. I couldn’t imagine using anyone else.", "pics": null, "resp": {"time": 1566253761952, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110012305343759381325", "name": "Christi Wallace", "time": 1565723246415, "rating": 5.0, "text": "Highly recommend Powell Law Firm. And the staff is very friendly.", "pics": null, "resp": {"time": 1566253733407, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "104770225365755219357", "name": "Ray Ainsworth", "time": 1504141749277, "rating": 5.0, "text": "Awesome attorney!! Always there when you need them. Recommend to everyone we know.", "pics": null, "resp": {"time": 1566253809574, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103194917123923915953", "name": "Sherry Lucas", "time": 1553786294559, "rating": 1.0, "text": "Absolutely horrible attorney for custody disputes. Made my case an absolute nightmare because of no communication with me unless he wanted more money.", "pics": null, "resp": {"time": 1566254006822, "text": "Thank you for bringing this to our attention. While no one likes to hear negative comments, we sincerely need to know when we fall short in our clients eyes. Our goal is to achieve Justice for every client and provide excellent representation. From your suggestion, we have looked at how we streamline communication with clients and this is why feedback is so important. Thank you for taking the time to leave us a review."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111708988510646622173", "name": "Liberty Avera", "time": 1502310460290, "rating": 5.0, "text": "Very professional and helpful attorneys! Would recommend them to anyone!", "pics": null, "resp": {"time": 1566253816322, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111245771268094104840", "name": "Judi Grant", "time": 1495462706390, "rating": 5.0, "text": "Great attorney!!! I would definitely recommend him!", "pics": null, "resp": {"time": 1566253827858, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112069465183014736856", "name": "Jennifer “Dixie” Phillips", "time": 1445644656960, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": {"time": 1566253836686, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "101847791969887155682", "name": "Ana Sandoval", "time": 1598402584143, "rating": 5.0, "text": "Excellent lawyer. Very friendly and professional", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "105192768623282835757", "name": "Miranda McGregor", "time": 1568243960746, "rating": 5.0, "text": "James is very personable, friendly, professional and a wealth of knowledge!  Anita is friendly, helpful and a delight to speak with.", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "112861873367403794982", "name": "Donna Sessions", "time": 1509393324534, "rating": 5.0, "text": "James is very professional, efficient, and knowledgeable about the law.  He delivers a fast, friendly service. Job well Done!", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "111739903695044129926", "name": "Jennifer Vestal", "time": 1509333739465, "rating": 5.0, "text": "Simpy the best! James is friendly, welcoming, and easy going. He is efficient, organized and and effective. A++", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "105221926639928289884", "name": "Phoebe Minardi", "time": 1527004561147, "rating": 5.0, "text": "James Dorgan was very kind and informative when dealing with my legal issue. His office gave me quick and efficent service while charging a very reasonalbe fee. I would highly reccommend him to anyone needing legal services.", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "114382261619049109652", "name": "Taylor Zinner", "time": 1507642997818, "rating": 5.0, "text": "Great Guy! Easy to work with!", "pics": null, "resp": null, "gmap_id": "0x889a408ffc1f5569:0xd10afaf9163d4a37"}
{"user_id": "102884497210438357671", "name": "K-BARR 1400 bLOCC", "time": 1553644712702, "rating": 5.0, "text": "Mrs. Ford is super professional and very thorough in her approach for justice. I highly recommend her. -Shawn Hammonds", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "110119210494621888180", "name": "Susan Reed-Killingsworth", "time": 1609831712943, "rating": 5.0, "text": "My favorite attorney in Huntsville!!!", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "105036202230840468441", "name": "Shawnna Williams", "time": 1565746225873, "rating": 5.0, "text": "Very thorough and attentive", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "104853872587733795672", "name": "Sherry Barnes", "time": 1573962878554, "rating": 5.0, "text": "Great honest law firm", "pics": null, "resp": null, "gmap_id": "0x888d479d050782a1:0xc1042985c3ff2e36"}
{"user_id": "101562185519280444415", "name": "Kenneth Mcdonald", "time": 1555094433529, "rating": 5.0, "text": "Did a very good job.", "pics": null, "resp": null, "gmap_id": "0x888d479d050782a1:0xc1042985c3ff2e36"}
{"user_id": "104909239520301900316", "name": "Vickie Gamble", "time": 1573485746473, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x888d479d050782a1:0xc1042985c3ff2e36"}
{"user_id": "101557274494313485725", "name": "Steven Wray", "time": 1619568015287, "rating": 5.0, "text": "Fair people, with fair prices and great service!", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "114465294208574890839", "name": "John B", "time": 1593605077577, "rating": 1.0, "text": "Had a 3:00 appointment, man walks in without,  I walked out. I thought that’s what you had appointments.\nNever go back", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "104638619670307970207", "name": "Kevin Huckaby", "time": 1564616551791, "rating": 5.0, "text": "Professional and friendly staff. Very thorough in what I needed done. Clint Maze and his associates were easy to work with and kept in touch with me as needed. Very prompt service.", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "112696710140656818046", "name": "Adam Graham", "time": 1554564589784, "rating": 4.0, "text": "Clint Maze is a great Lawyer if you need one in Arab. He does stay rather busy so you would need to call to set up a apt.", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "112754658668080405181", "name": "Kristi Davis", "time": 1570039198861, "rating": 1.0, "text": "Do not expect Tracy to contact you back after your case is over for assistance. Had an em situation dealing with my children. I left to voice messages as well as 2 emails that was never returned.", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "118040485466008487483", "name": "Joyce Schroetlin", "time": 1583005751397, "rating": 1.0, "text": "I can not say anything good about this place. The absolute worst business I have ever encountered", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "109176425978890792063", "name": "Tara Helms", "time": 1523393753701, "rating": 5.0, "text": "Very professional! I have worked with this law firm years. They are a full service law firm who work hard to take care of their clients. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "113172201504427324757", "name": "Anthony Ledbetter", "time": 1546204734080, "rating": 1.0, "text": "Mr Burke is a nice man . Beouy is a corrupt POS!!!", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "105834142402121951764", "name": "Angie tidmore", "time": 1511140971178, "rating": 4.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x8889e680946d27d7:0x8b76ecd255d46fb2"}
{"user_id": "111091799109698826616", "name": "Christy Harding", "time": 1620244167801, "rating": 5.0, "text": "I would give 10 stars if I could! They are wonderful! Took great care and was so attentive to my needs!! Professional and personable. Recommend to anyone who needs legal assistance.", "pics": null, "resp": {"time": 1620253357145, "text": "Thank you Christy!  😊"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "103415928987523677958", "name": "Kimberly Rollins", "time": 1620929679248, "rating": 5.0, "text": "This is a law firm that truly cares! Mr. Gary has been the best attorney! His staff has been fantastic to us!", "pics": null, "resp": {"time": 1620930709788, "text": "Thank you so much for the kind words!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "104354478112949788439", "name": "DIane Roden", "time": 1624155546158, "rating": 5.0, "text": "Lackey worked within the system and saved my husband's  CDL's.", "pics": null, "resp": {"time": 1624156262453, "text": "Thank you for the review.   We're always happy when we can help a great family like yours!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "118305911545859494222", "name": "Lauren Shankles", "time": 1614887817536, "rating": 5.0, "text": "The Lackey Law Firm surpassed all my expectations for quality legal counsel. The administrative staff was kind and always helpful, and I couldn’t have asked for better attorneys.", "pics": null, "resp": null, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "106391794053858084246", "name": "Deborah Cornelison", "time": 1604999293298, "rating": 5.0, "text": "Family run.. I believe the Lackey Law Firm employees some of the smartest attorneys in Scottsboro.", "pics": null, "resp": null, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "116572221235389272275", "name": "Natasha Snow", "time": 1600360118548, "rating": 5.0, "text": "The attorneys and staff at this firm are very knowledgeable and caring. I strongly recommend.", "pics": null, "resp": {"time": 1600364235089, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "109393037819380317384", "name": "kenneth gray", "time": 1586674324976, "rating": 5.0, "text": "This office has been amazing and very professional. I highly recommend them to anyone in need of a lawyer for any issue. They know what is best for you and will help you through whatever legal situation you have.", "pics": null, "resp": null, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "104099136003959457275", "name": "Teresa Miller", "time": 1612963552389, "rating": 5.0, "text": "Everyone is so nice and very professional .", "pics": null, "resp": {"time": 1613167166216, "text": "Thank you for the feedback!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "109208006358350921817", "name": "linda lovelace", "time": 1600987746946, "rating": 5.0, "text": "Even though they could not help me as I my case would have likely ended up in Tennessee, we were more than satisfied with their advice. I will use again if needed.", "pics": null, "resp": {"time": 1600988379759, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "109188130792678056950", "name": "Georgianna Garrard", "time": 1559157152387, "rating": 5.0, "text": "I highly, highly recommend these folks. Especially Justin! He has helped my family so much and he is always there with expert advice for any questions I may have. These folks do a wonderful job. They are always more than willing to help. Excellent people.", "pics": null, "resp": {"time": 1559167941648, "text": "Thank you so much for the review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "112492346695934929259", "name": "Kerri Jones", "time": 1572822572482, "rating": 5.0, "text": "I dont know what we would do if it weren't for Justin! Not only is he an excellent attorney, he is an all around good person. He kept me informed, I basically showed up, he handled everything else. I would recommend anyone to contact Lackey Law Firm for any legal issues. They are all so professional and down to earth at the same time..can't go wrong with them!", "pics": null, "resp": {"time": 1573124923875, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "109817555278278044068", "name": "Jam Vic", "time": 1560878508488, "rating": 5.0, "text": "Everyone was so nice and helpful! They got everything done super quick! Jennifer Gary snd Katie were who worked on my case they made me feel comfortable and at ease. Very helpful answered any questions I had. They are the best I wouldn’t go to anyone else they are worth every penny!", "pics": null, "resp": {"time": 1560899319512, "text": "Thank you for the review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "112625018514373898131", "name": "Nichi Mcpherson", "time": 1621735028473, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "109966390991163674608", "name": "Dana Thompson", "time": 1559523708870, "rating": 5.0, "text": "I highly recommend Jennifer or Justin. Very friendly and willing to help anyway possible. They’ve been helping our family for many years. They definitely go the extra mile to get the job done. They’re very understanding and down-to-earth and family oriented, great people!!!", "pics": null, "resp": {"time": 1559525073243, "text": "Thank you Dana!  We consider our clients to be our family, and we love the Thompsons!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "118418240660502761368", "name": "Herb Wright", "time": 1560897723572, "rating": 5.0, "text": "The most knowledgeable dependable straight forward attorney in the area Bar-none! Did I mention extremely reasonable legal fees? Just hands down the finest law firm in Northeast Alabama maybe the whole Southeastern US.  I implore u to let them handle your legal matters.", "pics": null, "resp": {"time": 1560899276788, "text": "Thank you for your feedback!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "107736751450501578493", "name": "Randy Smith", "time": 1568084678517, "rating": 5.0, "text": "Great family firm. Truly wonderful people. They made the process of my case transition smoothly.  Highly recommend!", "pics": null, "resp": {"time": 1568110175424, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "116048555542292555527", "name": "Justin Seyl", "time": 1598836289163, "rating": 5.0, "text": "Very helpful and gets excellent results!", "pics": null, "resp": {"time": 1598840317992, "text": "Thanks!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "106897972185470356276", "name": "Chris Dudley", "time": 1612504951744, "rating": 5.0, "text": "Justin when above and beyond to help me with all of my lawyer needs. Thank you Justin.       Well back for part 2. Not so well this time. I would love to tell you some good ole lie. But I just can't. Lets see, first he done my mothers last will. But I'm not suppose to say she was under medication for Cov-19 at the time of doing the will. Witch I don't think you are supposed to do. But who cares. Next he was supposed to be my lawyer. Which is no more. But hey if you need a real good lawyer that will not surprise you when you need them the most. Go with Will Parks. He is jam up.", "pics": null, "resp": {"time": 1545269721813, "text": "Thanks Chris!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "118127353107784483108", "name": "Porter's World", "time": 1559672417359, "rating": 5.0, "text": "For anything I’ve ever needed I’ve always called up Jennifer. She is more than helpful and always assures she has my back. Just recently I received some news from her and had I not had that little bit of information and a headstart I would’ve been totally blindsided. They are truly great people and go above and beyond for anyone who has ever used them. I will go to them every time.", "pics": null, "resp": {"time": 1559673275692, "text": "Thank you for trusting us Lauren!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "106695213005463747859", "name": "Heather Anderson", "time": 1559580739149, "rating": 5.0, "text": "The most professional and proficient people I have ever met! They really care about your situation and are very personable. I could not have made it through my situation without them! Would recommend them to anybody!", "pics": null, "resp": {"time": 1559582563126, "text": "Thanks Heather!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "107161618301014164382", "name": "Sharon Chisenall", "time": 1576621147959, "rating": 5.0, "text": "Very helpful any time I have ever needed legal advice.  I would recommend this Law office to anyone in need of legal counsel.", "pics": null, "resp": {"time": 1576624836776, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "107724937044810828613", "name": "Jesse Wilhelm", "time": 1559581993877, "rating": 5.0, "text": "Very professional. Handled my case in a timely manner and kept me informed from start to finish. Friendly service from the time you walk in the door.", "pics": null, "resp": {"time": 1559582538025, "text": "Thank you for the review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "117242760303655145258", "name": "C. Carter Clay", "time": 1519421591388, "rating": 5.0, "text": "I have worked with the Lackey Law Firm on many personal injury matters over the years.  They are extremely hard working and aggressive advocates for their clients.  They are also compassionate, organized and detail oriented.  I enjoy working with them and give the firm my highest endorsement.", "pics": null, "resp": {"time": 1519422787445, "text": "Thank you for your kind words about  our firm!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "110724067974965185974", "name": "Amber Haynes", "time": 1570109221660, "rating": 5.0, "text": "Jennifer has helped me a few times, she is very caring. I’m very thankful for her assistance and would recommend her to anyone.", "pics": null, "resp": {"time": 1570190055585, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "105825137530012272241", "name": "Derick Thorn", "time": 1567905986982, "rating": 5.0, "text": "These people will bend over backwards to help you in anyway they can, great people i would recommend to anyone that needs a lawyer", "pics": null, "resp": {"time": 1567906631540, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "110304964050954362351", "name": "Joshua Saint", "time": 1559525356873, "rating": 5.0, "text": "My experience with the Lackey Law Firm was second to none. Each member of their team was exceptional in their representation of me and went above and beyond my expectations.", "pics": null, "resp": {"time": 1559525791635, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "101338640261363933292", "name": "James Headrick", "time": 1575911985200, "rating": 5.0, "text": "If you're in need of representation. I strongly recommend using The Lackey Law Firm.", "pics": null, "resp": {"time": 1575930091962, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "103461885120458751972", "name": "sj dekranes", "time": 1536571306822, "rating": 4.0, "text": "Appointment was easy to make, consultation could have been a tad bit better but it was free and helpful! The front desk was very sweet too. Wait time wasn't long either. I recommend.", "pics": null, "resp": {"time": 1536583021154, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "100198956985841947986", "name": "holly stewart", "time": 1559528378014, "rating": 5.0, "text": "Not just any Law Firm. This one goes above and beyond and treats you more than a Client. They treat you like Family. No other firm I’d trust more A+++++", "pics": null, "resp": {"time": 1559557959828, "text": "Thank you for your review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "115444356627243474685", "name": "Dana Kay", "time": 1568651324168, "rating": 5.0, "text": "Jennifer Lackey is a great lawyer & will fight for you! 10/10 recommend!", "pics": null, "resp": {"time": 1568658409019, "text": "Thank you for the review and kind remarks!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "117798307626729323567", "name": "Jessica Rains", "time": 1559738946686, "rating": 5.0, "text": "I would recommend this family! I have used both Jennifer and Gary in the past and would not hesitate to hire them again.", "pics": null, "resp": {"time": 1559739731319, "text": "Thank you for the review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "116438377985163904355", "name": "candi townsel", "time": 1546036948327, "rating": 5.0, "text": "I have used the Lackey Law Firm for many years on several cases and have always been pleased with the outcome of any situation I faced . They  have always been kind and respectful to me and made sure I was well taken care of under any\ncircumstances.  Thanks guys for the team work and representing me in my times of need 😊I highly recommend the Lackey Law Firm !", "pics": null, "resp": {"time": 1546042412963, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "115765968195270870780", "name": "Dustin Talley", "time": 1568071925981, "rating": 5.0, "text": "Best damn lawyers in Jackson County hands down.", "pics": null, "resp": {"time": 1568073214783, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "105274082032787283766", "name": "Rolland Day", "time": 1559531915266, "rating": 5.0, "text": "I have had the pleasure of knowing Justin lackey for several years now and by far is the best attorney i have used and will be my last he will keep my business.ever thing I ever needed he has got in court and as well as more than I expected.", "pics": null, "resp": {"time": 1559557984637, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "101632068953886045234", "name": "Jordan Broussard", "time": 1545268278482, "rating": 5.0, "text": "Justin Lackey will always be my go to when I need excellent representation!! They never fail to satisfy!\n\n--Jordan Broussard", "pics": null, "resp": {"time": 1545269024178, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "110776339932158348856", "name": "Shon&Micah 2015 music case", "time": 1567958945319, "rating": 5.0, "text": "Always friendly , Will greet you with a smile , & give you the best advice!!", "pics": null, "resp": {"time": 1567967505665, "text": "Thanks!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "117349800186124405995", "name": "Stephen Atkins", "time": 1608674975077, "rating": 5.0, "text": "Good people", "pics": null, "resp": {"time": 1608676212040, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "103262136036308001656", "name": "Amanda Webb", "time": 1559072325167, "rating": 5.0, "text": "We love the Lackey Law Firm ! Best in Scottsboro! Would not use anyone else! Not had the experience of working with Gary, but Jennifer and Justin are awesome!", "pics": null, "resp": {"time": 1559079267571, "text": "Thank you for the feedback!  We truly appreciate it!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "118161829518225225293", "name": "Toby Green", "time": 1545276854247, "rating": 5.0, "text": "The lackey law firm is the best of the best! Handled my case great and got the results I was Looking for!", "pics": null, "resp": {"time": 1545299504377, "text": "Thanks!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "116603056934770693440", "name": "Sam Cosby", "time": 1559309676028, "rating": 5.0, "text": "Not only was Jennifer professional while handling our case she was also very personable.  She cared about my wife and her injuries, always checking in on her and keeping us updated on our case.  There was never a time that we felt neglected or just another client, with Jennifer.  I would absolutely recommend Jennifer at The Lackey Law Firm!!  ⭐️⭐️⭐️⭐️⭐️⭐️", "pics": null, "resp": {"time": 1559311681900, "text": "Thank you, we appreciate your feedback!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "105252939985028515319", "name": "james case", "time": 1567564643352, "rating": 5.0, "text": "Set up my LLC . Awesome to work with", "pics": null, "resp": {"time": 1567591741279, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "106200829561253605304", "name": "Trenda Summerford", "time": 1559580877585, "rating": 5.0, "text": "I would very highly recommend Justin or Jennifer, they have been great to my family!!!", "pics": null, "resp": {"time": 1559582517656, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "115620485269062822326", "name": "Natalie Pope", "time": 1560037273175, "rating": 5.0, "text": "They have great service and the nicest people you’ve ever meet", "pics": null, "resp": {"time": 1560039962301, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "108935028842393001111", "name": "Susan Hartline", "time": 1534274049535, "rating": 5.0, "text": "I felt that Justin went about and beyond to try and find a lawyer that would take my case. But very hard to get doctors to go against each others. Thank you for your time and kindness.", "pics": null, "resp": {"time": 1534416762104, "text": "Thank you Susan!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "101622227920606877987", "name": "Susan Hughes", "time": 1553729698536, "rating": 5.0, "text": "Hi my name is Danny Hughes I got a ticket in Scottsboro al and it could have changed my life in dramatic way because I hold Cdl license I called the lackey law firm and they were really nice easy to talk to. I told my deal to mr Justin and he went to bat for me and did what he thought he could do. I  couldn’t believe it happened that way ,and the nice lady in the office was just a great my family is truly grateful this is how I make my living I would recommend the firm to everyone I know thank u for all y’all did", "pics": null, "resp": {"time": 1553731068834, "text": "Thank you!   It was a pleasure being able to help you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "115306513890966911636", "name": "Tiffany Jones", "time": 1567899603294, "rating": 5.0, "text": "Best lawyers around! Highly recommended!", "pics": null, "resp": {"time": 1567901275427, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "108924336952543184465", "name": "brian porter", "time": 1559267195103, "rating": 5.0, "text": "The best by far. Jennifer will go above and beyond to do exactly what she says or can do.", "pics": null, "resp": {"time": 1559306693414, "text": "Thank you for your review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "107624077651623430784", "name": "Mike T", "time": 1545269306630, "rating": 5.0, "text": "Only peace I have in these trying times is knowing The Lackey Law Firm is on my side. I told the officers not to make mistakes bc Justin would destroy the case in court.. guess they should have listened", "pics": null, "resp": {"time": 1545269695068, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "111616033495257602354", "name": "William Bailey", "time": 1488039940411, "rating": 5.0, "text": "Mr. Lackey is a Mason and a Shriner ---  they are the most honest and ethical men on earth.", "pics": null, "resp": {"time": 1497034384902, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "118300175798471827665", "name": "Ric Patterson", "time": 1581340124061, "rating": 5.0, "text": "The best.....no doubt", "pics": null, "resp": {"time": 1581346280287, "text": "Thank you for the review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "116046928196340597507", "name": "sonia willmon", "time": 1559588741180, "rating": 5.0, "text": "I love the Lackey Law Firm. They are great", "pics": null, "resp": {"time": 1559596631679, "text": "Thank you Sonia!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "115131557684210310460", "name": "Austin Hinkle", "time": 1560037052665, "rating": 5.0, "text": "Great people great service", "pics": null, "resp": {"time": 1560039984410, "text": "Thanks for the review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "100576863290318994423", "name": "Bailey Jones", "time": 1559755571857, "rating": 5.0, "text": "Great People!", "pics": null, "resp": {"time": 1559756436585, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "100611718577516034780", "name": "Darren Arnold", "time": 1550432659835, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1550442872505, "text": "Thanks!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "105906687773445196825", "name": "Janet Harbin", "time": 1559061464515, "rating": 1.0, "text": "Expensive and rude", "pics": null, "resp": {"time": 1559079213957, "text": "We are sorry that you had a negative experience with our law firm.  We strive to make sure all potential clients leave our office with the information they need about their legal situation if possible.  Thank you for the feedback which helps us improve for the future."}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "111894464166176654843", "name": "torri prince", "time": 1535738096170, "rating": 5.0, "text": "Best lawyers in town!", "pics": null, "resp": {"time": 1535748760961, "text": "Thank you!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "112577995646098420138", "name": "Billy Arnold", "time": 1514532555776, "rating": 5.0, "text": "A++++", "pics": null, "resp": null, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "112092552200482330441", "name": "TheAngelwithhorns2", "time": 1497032122254, "rating": 5.0, "text": "You can depend on Gary to get answers and results  will use again if I need a Jackson County attorney", "pics": null, "resp": {"time": 1497034363332, "text": "Thank you for the great review!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "116807036260493652371", "name": "Marta Ortega", "time": 1577056049763, "rating": 5.0, "text": "(Translated by Google) They are very good lawyers and help Latinos. They have people who speak Spanish\n\n(Original)\nSon muy buenos abogados y ayudan a los latinos. Cuentan con personas que hablan Español", "pics": null, "resp": {"time": 1577060098480, "text": "(Translated by Google) Thanks for the compliment!\n\n(Original)\n¡Gracias por el cumplido!"}, "gmap_id": "0x8861eee737b730ed:0xd7ad6e3b44edcf9c"}
{"user_id": "117330907753986939962", "name": "Jonathan Hornsby", "time": 1605040230005, "rating": 5.0, "text": "We couldn't have been more pleased.  Their real estate work was so thorough that they found an issue with the original owners dating back to 2012.  We will gladly use them again!", "pics": null, "resp": null, "gmap_id": "0x88626cc97ffd9deb:0x9dbc1f668b927c6a"}
{"user_id": "108327783600068966649", "name": "Keff Edwards", "time": 1563974747629, "rating": 5.0, "text": "Have used this attorney for Corporate issues and he has always been knowledgeable and fair.  I recommend Randy for any of your small business legal needs.", "pics": null, "resp": null, "gmap_id": "0x88626cc97ffd9deb:0x9dbc1f668b927c6a"}
{"user_id": "105780573184286011402", "name": "Shelli Bennett", "time": 1524661123562, "rating": 5.0, "text": "I have known Randy professionally for more than 25 years and have dealt with him and his staff hundreds of times.  My experience has always been that he is friendly, honest and experienced.  He is one of the first attorneys I refer when asked about real estate or corporate law.", "pics": null, "resp": null, "gmap_id": "0x88626cc97ffd9deb:0x9dbc1f668b927c6a"}
{"user_id": "101940745192876686517", "name": "Ned Needlelander", "time": 1538763635497, "rating": 5.0, "text": "Knows his stuff better than anyone in town. We bought a historic home that had been bought and sold 5 times on record. ALL attorneys missed the problem with the deed, not Randy.  Not only did he identify it, he chased down the closest relative of the person that had not cleared the deed and got clearance with having to lay them ONE RED CENT! One of the more “popular” closing attorneys in town has closed on thisnplace twice before and missed the deed issues. Thank you Randy!! You ARE the best", "pics": null, "resp": null, "gmap_id": "0x88626cc97ffd9deb:0x9dbc1f668b927c6a"}
{"user_id": "117288778479270024428", "name": "Elizabeth Albers", "time": 1525718780399, "rating": 1.0, "text": "If I could give 0 stars, or negative stars, I would. This is the rudest attorney's office I've ever dealt with. They made errors and wouldn't take the blame, treated me badly, treated everyone at the table badly and cannot explain their own numbers. I understand errors and mistakes, but I don't understand it on someone's biggest purchase, and I don't understand rudeness. It's completely uncalled for. If you're thinking about using them for a real estate closing, DON'T DO IT!", "pics": null, "resp": null, "gmap_id": "0x88626cc97ffd9deb:0x9dbc1f668b927c6a"}
{"user_id": "116444153648890234627", "name": "Amy Ellis", "time": 1475853204780, "rating": 1.0, "text": "Absolutely horrible to work with.  He was the closing lawyer on the sale of our home (buyer's pick).  He had no personality, did not shake our hands, was EXTREMELY rude, made rude comments to us, and charged me extra interest on the balance due on my home (5 days worth) because he \"didn't have time\" to wire the money or go to the bank - which I think may be illegal.", "pics": null, "resp": null, "gmap_id": "0x88626cc97ffd9deb:0x9dbc1f668b927c6a"}
{"user_id": "106702280341768709971", "name": "Ivery Smith", "time": 1608310861111, "rating": 5.0, "text": "Mr. Schoettker treated me with the up most professionalism, with prompt and great results...I now have a new found respect for law firms!", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "109020372922731692592", "name": "Theresa", "time": 1598060790221, "rating": 5.0, "text": "I really hope they can help me. The secretary was very helpful and respectful. Want to come by the office and show your firm my videos and pics.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "104621300446530700580", "name": "Ivery Smith", "time": 1600793493136, "rating": 5.0, "text": "Was fast at handling my cases...Even through the pandemic which is what I call above and beyond satisfactory!!!", "pics": null, "resp": {"time": 1600800464058, "text": "Thanks Ivery, glad we could help."}, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "112283076202241456430", "name": "amy wells", "time": 1570566086132, "rating": 5.0, "text": "Very professional. Answered all questions. We live out of state and need assistance with traffic violation. Ben was very knowledgeable and quickly helped us with court resolution.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "113636143426339296475", "name": "Mac McClellan", "time": 1548860688798, "rating": 5.0, "text": "The folks at Barfoot & Schoettker were great!  Their knowledge and advice were excellent and produced favorable results.  Don't get sucked in by the ambulance chasers that spend more time advertising than representing clients. Check the reviews on the net and and make an informed choice. Thanks again guys (and Ms. Kay)!", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "111875186120542097774", "name": "Orlando Estrada", "time": 1571343751211, "rating": 5.0, "text": "I got a speeding ticket in Alabama and reside out of state. Mr. Schoettker's office was responsive and communicated clearly on expectations. He eventually got my citation dismissed and was prompt with follow ups.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "113222520937682091413", "name": "Mark Toney", "time": 1551490784464, "rating": 5.0, "text": "Attorney Schoettker was absolutely amazing. He did everything that he said he would do. He took care of my traffic concerns with no problems. I would for sure recommend this firm", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "114498285145048778153", "name": "Andrea Peel", "time": 1547152969913, "rating": 5.0, "text": "The interaction was always professional while also being personable and productive. Pricing was definitely fair and much better than other firms I spoke with. Overall it was a very positive experience during a very negative situation. I hope to never consult an attorney again however, if the need does arise I will definitely call Barfoot & Schoettker.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "108293930075294540880", "name": "woolrose", "time": 1531105520975, "rating": 5.0, "text": "I am 70 years old and have never, until recently, sought the assistance of an attorney (except for developing a will or to review contracts before I signed) . I asked a relative, who used to work with the court system, to suggest a good law firm. My relative stated if I wanted an Honest and Reliable firm, I should contact Barfoot and Schoettker.\n\nAfter making an appointment, I met with their associate, Jase Sayre and provided him with the paperwork. We discussed my case and Jase  explained all aspects of the procedure in detail. While working my case he kept me informed of the progress. He fully explained the options available to us and allowed me to chose which avenue I though best.\nThe result was he recovered a very significant amount (the full amount) of money owed to me.\n\nI highly recommend the Barfoot and Schoettker Law firm. My case was solved in a quick and extremely efficient manner. The costs were very reasonable (no padding the books or intentional delays as I have heard that some law firms do). The interaction was always professional while also being personable and productive. Thank you Jase for your hard work and honest work ethic.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "110673497898074101539", "name": "David Peel", "time": 1547577712687, "rating": 5.0, "text": "Very pleased with the legal service provided by Ben Schoettker,. His genuine care and concern for his clients is a much-appreciated bonus. Would definitely recommend this firm.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "113029055402604276076", "name": "Joan Beasley", "time": 1538753882424, "rating": 5.0, "text": "I highly recommend Barfoot & Schottker over all others.\n\nWith only a few months left before the two year deadline of my case, I contacted this firm to consider my case. (The attorney I initially hired had unexpectedly retired.)  Barfoot & Schoettker agreed to take my case even though they were working against a close deadline.\n\nI was impressed with their care and compassion, close straight forward communication, integrity, diligence and professionalism. Jase and Kay  were diligent in keeping me informed about the case and including me in decisions that had to be made.\n\nOverall it was a vey positive experience, and I would not hesitate to use them again.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "113969781768127854979", "name": "John Bush", "time": 1517946635130, "rating": 5.0, "text": "Great lawyer, went above and beyond to help me out and legitamtly cared about what was happening to me. He did a wonderful job and was there step by step explaining and making sure i was aware of what was happening.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "101959848703204412113", "name": "Anthony Riley", "time": 1520880500785, "rating": 5.0, "text": "Mr. Schoettker was a man of his word, he said that he can get something done and he did just that and I appreciate his service, thank you.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "102200044097546945358", "name": "Emily Trotter", "time": 1504028890676, "rating": 5.0, "text": "We are very pleased with our recent experience with Barfoot & Schoettker.  My husband had a prescription wrongly filled at the pharmacy.  Mr. Schoettker took our case and negotiated a fair settlement for the suffering that resulted from taken the wrong medication.  He listened to all our concerns and treated us with the greatest respect.  We are both retired and are grateful to have found an attorney who really cares.\nWe would highly recommend Barfoot & Schoetkker to anyone who might need a personal injury attorney.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "114478560530790591426", "name": "Candace Payne", "time": 1490734325933, "rating": 5.0, "text": "After my accident I was fearful of how things would go with the other driver's insurance company but thankfully I called Barfoot and Schoettker and they helped me so much. They made a scary situation not so bad. Thank God for them. I'm so blessed that they are in town and really go the extra mile to help their clients.", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "104821800957212266300", "name": "Louis J", "time": 1532627771108, "rating": 5.0, "text": "would like to take this time to thank barfoot & schoettker  for taking the time to resolve my traffic problems in court he resolve issues fast with no issues I would highly recommend this law firm  to anyone and trying to handle court issues  thanks again and god bless", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "110210330906912688920", "name": "James Burlingham Sr", "time": 1517074399810, "rating": 5.0, "text": "Got the job done and great communication at a fair price.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888e810ccc6d41ab:0x3b5b14ab6d3374da"}
{"user_id": "109644033929317994505", "name": "John Allen Dees", "time": 1575493330007, "rating": 5.0, "text": "Excellent law firm! Amanda Cook has represented me for many years. She gets results and has an incredible understanding of the law. She places client’s interest first and delivers results. I cannot stress the importance of having an attorney represent you that can be trusted. I use Amanda and her firm for personal and corporate law and highly recommend her and her firm.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "104605536948423497449", "name": "Amanda Brown", "time": 1575487021835, "rating": 5.0, "text": "Amanda Cook was there for me when I felt that I had no one. She kept outstanding and detailed files. She was and is still a caring and conscious person. I trust Mrs. Cook because she was and is always forward and honest. I hold her in the highest of regards and hope she continues to be successful. Thank you for all of your help Mrs. Cook.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "108169762106398780036", "name": "Melony Scott", "time": 1575486849875, "rating": 5.0, "text": "Amanda has been nothing but sharp, professional, and absolutely goes above and beyond for her clients.  I would definitely refer and recommend her team for any and all of your real estate closings.  Best closing attorney in town.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "112065845213252215695", "name": "Britt Stewart", "time": 1592436846833, "rating": 5.0, "text": "Amanda was very responsive and helpful in answering questions I had. She made it very easy to understand what she was explaining to me as she was answerin .", "pics": null, "resp": {"time": 1592496858283, "text": "Thanks, Britt!"}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "114747648592487171086", "name": "Vesko Ruychev", "time": 1575572040017, "rating": 5.0, "text": "Amanda Cook is simply fantastic - very compassionate and determined lawyer. She is very knowledgeable in her field and takes every case seriously. I would recommend her to anyone who needs legal help in the Montgomery area.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "117002363099761293655", "name": "Happy Plant", "time": 1575500898518, "rating": 5.0, "text": "Amanda Cook is one of the most professional and ethical lawyers I have ever met. I have known her for many years and have seen, first hand, her integrity under fire.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "109931954828290582960", "name": "Renee Williams", "time": 1575504288415, "rating": 5.0, "text": "Amanda at Cook and Associates has been a godsend for me and my Production Company, ClassA entertainment. She is very knowledgeable, professional and understanding. I was lost when it came to contracts and certain legal aspects of the Industry and with her and her firm's help and expertise, we were able to get through our first major film distribution deal with ease. She is open, honest, fair and non-intimidating and my crew and I need and appreciate that. I highly recommend these guys!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "103788935114690151706", "name": "Chris Tarantino", "time": 1606050833528, "rating": 5.0, "text": "Best law firm in the area.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "103315757220045923657", "name": "Melissa Douglas", "time": 1555875543738, "rating": 5.0, "text": "They are thorough and take care of their clients. As a client since 2018 till now she has been there with me through every step of the way. So far my processes are going better than I expected and she is very patient with me. 🙏🏾", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "115909689548384142759", "name": "Donna Wallace-King", "time": 1575522994953, "rating": 5.0, "text": "Amanda Cook is an excellent attorney who knows the law, knows what she's doing, and knows how to help you.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "100462850223584979781", "name": "Jessica Lidvall", "time": 1550186783962, "rating": 5.0, "text": "Great choice in a place to go!!\n\nMrs. Edwards is very respectful and professional. She is extremely helpful and patient when you have a ton of questions.\n\nCook and Associates ✔✔", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "105108679963079525811", "name": "Tiffany Birley", "time": 1575485755916, "rating": 5.0, "text": "Amanda is very thorough and works hard for her clients.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "101981365406872978193", "name": "Kevin Cheff", "time": 1553687988840, "rating": 5.0, "text": "My husband and I hired Britany Edwards through Cook & Associates to assist with preparing for my Green Card case and attend the interview process. With short notice, she was able to gather key evidence and provide excellent advice and guidance. I would without hesitation hire Britany again in the future for my immigration legal needs.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "108063941568868988973", "name": "Kamaria Waiters", "time": 1556752540883, "rating": 5.0, "text": "Amazing and  affordable I looked her up by a whim and boy was I surprised at how she handled my divorce, at every meeting she treated me as top priority I have referred her to several family member and still keep her number in my phone on stand by.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "109579596911167305810", "name": "Zachry Ashmore", "time": 1510877910770, "rating": 5.0, "text": "Amanda is a highly competent lawyer who knows how to win. As a former client I cannot recommend her services enough. She helps you understand your rights and goes the extra mile to ensure you get what you deserve.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "108791845843035799435", "name": "Valtoria Jackson", "time": 1568397528344, "rating": 5.0, "text": "Prompt Personal Patient and Professional to a diverse community.", "pics": null, "resp": {"time": 1573693198221, "text": "Thank you!"}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "118294674440253991154", "name": "Micah Hohenberger", "time": 1505960182254, "rating": 5.0, "text": "She did a wonderful job. Very helpful and follows through with any issue you will have. I would highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "106976782506717656149", "name": "Kimyatta Chong", "time": 1542244575173, "rating": 5.0, "text": "The most professional and organizied business Attorney! She will definitely fight for her clients.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "115452665781330852161", "name": "Britt Johnson", "time": 1575503179287, "rating": 5.0, "text": "Amanda Cook helped me tremendously through a tough time.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "112664093801535349684", "name": "Jessica Argue", "time": 1550187808275, "rating": 5.0, "text": "Britany Edwards is wonderful and will fight for her clients!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "110648235980868930324", "name": "Tangela Broaden", "time": 1579958925996, "rating": 5.0, "text": "Very friendly and knowledgeable people", "pics": null, "resp": {"time": 1582329808132, "text": "Thank you, Tangela!"}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "117672840978131555737", "name": "Ned Lidvall", "time": 1550185651755, "rating": 5.0, "text": "The best and very helpful with any questions!!", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "116662015388513805065", "name": "Jeremiah Horton", "time": 1556284978480, "rating": 1.0, "text": "Gave me a quote  $300 Talk to a another lady on the phone tell me it would be $900 3 times the money I was expecting to spend.   Never sent her any paperwork. 10 minute conversation on the phone Sending me bills for $300 This is definitely  Not anyone you want to do business with!!!!!!!! Crooks", "pics": null, "resp": {"time": 1559149531598, "text": "Mr. Horton, thank you for your feedback. We would be happy to address all of your concerns if you would call us to discuss the issue."}, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "107375605431341034464", "name": "GT Comic Con", "time": 1503529218629, "rating": 5.0, "text": "Experienced and very professional lawyer, the best to work with.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "100484430856197750625", "name": "Scott Grant", "time": 1575500348457, "rating": 5.0, "text": "Super attorney & person.", "pics": null, "resp": null, "gmap_id": "0x888c2bb129b3a283:0xe9b6047ad2f3d11e"}
{"user_id": "114052739869600041989", "name": "Staci Wilson", "time": 1581100945575, "rating": 1.0, "text": "Called to get a copy of my paperwork emailed to me. A lady was so rude over the phone, I asked her to email me something she said ok and processed to hang up, I asked if she needed my email address first. She never sent it. I called back and spoke w/ a man who was helpful and sent me what I needed.", "pics": null, "resp": null, "gmap_id": "0x88891bc333f8aeb3:0x3768b7efe9a3ed7d"}
{"user_id": "116304487721031775537", "name": "LaQuandria Riggs", "time": 1524501556536, "rating": 1.0, "text": "I was always told if you can't say nothing good don't say nothing at all. They get just what they deserve a 1", "pics": null, "resp": null, "gmap_id": "0x88891bc333f8aeb3:0x3768b7efe9a3ed7d"}
{"user_id": "101084451719790784424", "name": "Karla Centers", "time": 1526505385474, "rating": 5.0, "text": "Great to work with, professional and courteous.", "pics": null, "resp": null, "gmap_id": "0x88891bc333f8aeb3:0x3768b7efe9a3ed7d"}
{"user_id": "110790683883128840455", "name": "Ariyel Brooks", "time": 1579785488133, "rating": 1.0, "text": "Horrible customer service.", "pics": null, "resp": null, "gmap_id": "0x88891bc333f8aeb3:0x3768b7efe9a3ed7d"}
{"user_id": "107883563260850589391", "name": "Miriam Coley", "time": 1509136805213, "rating": 1.0, "text": "RUDE STAFF, UNPROFESSIONAL, EXTREMELY UNINFORMATIVE...WOULD GIVE ZERO STARS IF POSSIBLE", "pics": null, "resp": null, "gmap_id": "0x88891bc333f8aeb3:0x3768b7efe9a3ed7d"}
{"user_id": "103422731649240496676", "name": "Donna Dew", "time": 1613868510695, "rating": 5.0, "text": "Professional, and reliable.  They don't mind you calling them anytime and they are all straightforward.   I would highly recommend any attorney with this firm.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "117106067095096920217", "name": "Natalie Schibell, MPH", "time": 1564877685609, "rating": 1.0, "text": "I would give no stars if I could as I have made three calls over the course of two weeks seeking representation without a response. The answering service used is either not recording messages or the attorneys are being selective. I realize my matter is a small one; however, a return phone call within a reasonable amount of time is the bare minimum expectation this firm could not meet. I have worked in a prominent law firm for nearly a decade and know the value of customer service with every client, both large matters and small. I unfortunately cannot use that law firm as I moved a great distance away. Parkman and White, please return your phone calls, whether you can take the case or not. No firm is too big or an attorney too important to make a courtesy return call or email, at a minimum. You can even have your staff perform the task for you. This way a potential client cannot waste additional time and effort and can call someone else who cares enough to provide the service.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "111156296796968826477", "name": "Ryan Blanch", "time": 1546987508231, "rating": 5.0, "text": "We’ve litigated and tried several major cases together.  What a team.  These guys are simply awesome.  Jim Parkman captivates juries and judges alike with his humor and courtroom presence. Will White’s no-nonsense cutting cross examinations destroy government witnesses.  No one I’d rather go to trial with.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "106165058868512638419", "name": "jonny harvell", "time": 1396642946579, "rating": 5.0, "text": "To describe the ability of these men in their element is nearly impossible. I could not imagine a better team of attorney's to handle any civil, state or federal case. The honesty and determination showed during my case was, in one word, \"AMAZING!\" The experience and expertise displayed inside and outside the courtroom was outstanding. These guys are professionals on every level. If you are reading this and have a loved one in need of an attorney or need one yourself, Parkman & White is where your research should end!", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "114035976289212752360", "name": "Victor Revill", "time": 1522376972046, "rating": 5.0, "text": "These are outstanding attorneys at this firm!!!   I was wrongfully arrested and charged in Blount County.  Attorney Clayton Tartt represented me and he did an AMAZING JOB.  He was prepared, professional, persistent, caring, compassionate, and an outstanding litigator!!! I am a Criminal Defense lawyer that was charged with a crime. I went to Clayton.  If a Criminal Defense lawyer chooses a Criminal Defense lawyer, then he will only choose the best.  I chose Clayton because I knew he cared about his clients and I knew he would be willing to fight. He fought to get me acquitted and I am forever grateful!!!  Trust me, Clayton is an outstanding attorney!!!", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "114179602382429607670", "name": "Jenn Carroll", "time": 1505733591701, "rating": 5.0, "text": "By far the best!  William White and Jim Parkman are amazing at what they do. Anyone that ever asks me about a lawyer, I would refer them to Parkman and White, LLC. Best decision I have ever made.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "105896313030068805818", "name": "Mike R", "time": 1544203239922, "rating": 1.0, "text": "Mr. Parkman charged me tens of thousands of dollars.  I am convinced that he deliberately undermined my case. I had to hire another attorney to defend my case. I found Mr. Parkman to be insufferable,  highly inflammatory, arrogant and strikingly incompetent.  I really like William White.  He deserves a medal of honor for tolerating Jim Parkman.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "100546642756578913720", "name": "Krystal Dixon", "time": 1424197208723, "rating": 5.0, "text": "We hired Parkman and White after my husband was accused of a crime that could have landed him in jail for many years. He had done nothing wrong and unfortunately in our world of technology a computer virus was almost our undoing. We were told that if we wanted the best we should hire Parkman and White. We met Jim Parkman face to face a couple of times and though I did not have the pleasure of meeting William White, I had numerous phone conversations with him. They worked diligently to clear my husband's name. It took almost two years but the night before we were to go to court Mr. White called to inform us that all charges had been dropped. They fought to prove his innocence and I am so thankful that we were sent their way. Mr. Parkman and Mr. White definitely lived up to their reputation of being the best. If you have a legal issue I would highly recommend you get in touch with their law firm.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "118421791758961523093", "name": "S Cole", "time": 1389135539421, "rating": 5.0, "text": "When the stakes are the highest, and your personal reputation, recieving professional, educated, tanacious and agressive defence are of paramount importance . Parkman and White are the ONLY law firm to TRUST and RELY on.  William White and his team assisted me in a time of great legal need with my reputation, financial security, and potential criminal charges against myself. William White was tenacious, exposed the truth and my case was dropped in a Grand Jury Investigation.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "109234907529080186731", "name": "Amanda Griffin", "time": 1527468335058, "rating": 5.0, "text": "Best attorneys in the southeast.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "105250244298431966835", "name": "Roderick Covington", "time": 1436988398230, "rating": 5.0, "text": "During a time when I sought justice and it was nowhere to be found, I found Parkman and White.  And trust me, they helped me find justice.   At the end of my trial, justice prevailed and I was found not guilty on two counts of charges which ended my career.  If you are looking for justice, if you are looking to make a wrong right, look no further than Parkman and White.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "100545436300754474026", "name": "Clark Thompson", "time": 1422991621951, "rating": 2.0, "text": "Firm was unable to help with my case.  May have been isolated to my situation though.", "pics": null, "resp": null, "gmap_id": "0x88891b90dab8f955:0xf27f5686a4def54c"}
{"user_id": "111022963953379205790", "name": "Sarah Stanley", "time": 1605191235199, "rating": 5.0, "text": "I absolutely love this group of people. Frank, Debra, Kelly, Teri, Chuck, Caroline are all absolutely amazing and so polite. I have had the pleasure of knowing them for four years now. They have treated my family well and have helped us with any issue we have had. I highly recommend Potts & Young Attorneys to help you with any issues you may have going on because once you hire them, they work nonstop to make everything happen for you. I love you guys!", "pics": null, "resp": {"time": 1605531326468, "text": "Thank you so much, Sarah! We appreciate you!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "115349759852498758856", "name": "Alvin Smith", "time": 1605401237412, "rating": 5.0, "text": "Love the atmosphere of this law firm. They're honest in their evaluations and very fair in their dealings. Will always use them and will recommend them to family and friends!", "pics": null, "resp": {"time": 1605531379707, "text": "Thank you so much, Alvin! We sincerely appreciate the positive feedback and recommendations."}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "114848250239044090115", "name": "Henry L. Weekly Sr.", "time": 1605269296380, "rating": 5.0, "text": "I find Frank, Debra, and the Staff at Potts & Young guilty of knowing the laws and guilty of working tirelessly on my case so I may receive the maximum monetarial value for my case. I have recommended them several times with the same results. I Appreciate You!", "pics": null, "resp": {"time": 1605531359865, "text": "Henry, thank you for your kind review, it means so much to us. It was a pleasure working with you!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "101939179678921397071", "name": "Kay Hyde", "time": 1604531608380, "rating": 5.0, "text": "They helped us were no one else would ! Thank y'all so very much for being so patient with me. Love how professional both of you are.  Thank you so very much for everything!", "pics": null, "resp": {"time": 1605531286607, "text": "Thank you so much for your 5-star review, Kay. It was a pleasure working with you and we appreciate the positive feedback!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "112870636843967502955", "name": "Tiffany Burton", "time": 1604880400739, "rating": 5.0, "text": "We hired Debra Coble as my fathers Probate Attorney to help fight for his mother’s estates and assets. Mrs Coble is very knowledgeable, experienced, and trustworthy. She believes in her clients and fights an excellent case. She believes in fighting for what’s entitled to her clients. She fights for her clients inside and outside of the court room. If you’re looking for a Probate Attorney hands down please contact Mrs Debra Coble as your Attorney. You won’t be disappointed. Now, my father can rest knowing his got everything that was entitled to him. Thank you so much Potts & Young Attorney and especially Mrs Debra Coble. We appreciate you.", "pics": null, "resp": {"time": 1605531313682, "text": "Tiffany, thank you so much for your wonderful review! We sincerely appreciate it and are here if you ever need us again."}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "115888436554810718305", "name": "Sandra Bonds", "time": 1597874792235, "rating": 5.0, "text": "Best attorneys in Alabama love Frankie and all the employees.", "pics": null, "resp": {"time": 1604439413022, "text": "Thank you for your kind review, we really appreciate it!"}, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "111215123117231970417", "name": "Jodie Moore", "time": 1571433046340, "rating": 4.0, "text": "The food is great. The atmosphere is very comforting and calm.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "115274532594905630609", "name": "JESS'C STIDHAM", "time": 1527116574779, "rating": 5.0, "text": "If you are in need of legal advice I highly recommend Potts & Young! They are honest, trustworthy & dedicated professionals who will have your best interest at heart. There is no one else I'd trust more with my legal matters.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "104794685970651053242", "name": "Jackie Gross", "time": 1558459011409, "rating": 5.0, "text": "Dedicated attorney and staff that strive to do the very best for their clients.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "103945949080058047237", "name": "Xxlxvelydxeams 123xX", "time": 1578353268078, "rating": 5.0, "text": "Response was quick and answered all my questions", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "101632500763469029367", "name": "ReleaseTheMem12", "time": 1525720357756, "rating": 5.0, "text": "Frank B Potts is a highly skilled Attorney dedicated to serve his clients with the best advise and resolutions to their legal issues and cases.", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "103858476451238361368", "name": "jessica potts", "time": 1572313058863, "rating": 5.0, "text": "Best law firm ever :-)", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "113843034038989654182", "name": "Alan Haygood", "time": 1561423916507, "rating": 5.0, "text": "I highly recommend Potts & young", "pics": null, "resp": null, "gmap_id": "0x887d485ef8db30ed:0x37e35965c41612ae"}
{"user_id": "107621768652738156029", "name": "Melissa Davis", "time": 1606189798050, "rating": 5.0, "text": "I highly recommend Johnny Amari and his team.  I immediately felt comfortable when we met, he is very kind and  personable. He was available for me, even after hours, when I had questions and to provide emotional support.  He went above and beyond in every aspect of my case.  He listened to my ideas and valued my input, and I felt very cared for both legally and emotionally.   There is not a doubt in my mind that if I had been with another attorney,  I would be headed to federal prison.  He explored every angle to reduce my sentence guideline and had very good input on ways to get the judge to see me as more than my crime.   If you want an attorney that is attentive, available, capable and persistent, you will find all that in Johnny Amari.  I literally owe him my freedom.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "109505656008718186731", "name": "Debbie Desmond", "time": 1613380529983, "rating": 5.0, "text": "Johnny Amari helped me with a situation I needed immediate assistance with. He exceeded my expectations and went above and beyond what I asked of him. I would absolutely use him, with any legal matter, if needed in the future.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "106363041393517850274", "name": "Amanda Poole", "time": 1593395864066, "rating": 5.0, "text": "Mr. Amari is a great attorney very professional. He has a great sense of humor and did a fantastic job. I just wanted to tell him thank you so much for helping me. I would recommend Mr. Amari. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "105838850565770801950", "name": "Dern Happy", "time": 1617817081338, "rating": 5.0, "text": "John Amari took my major problem and came back with a minor inconvenience. Far exceeded all expectations. THANKS!", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "111964410383320250578", "name": "Tri Jackson", "time": 1596151012455, "rating": 1.0, "text": "After two years of out and out lies by the associate O. PARRISH on a living will, final will,  filling out\nsimple paperwork ( documents ) for Medicare that Medicare said for an ATTORNEY ( that's a joke) and was told that AMARI and Gray were representing me in the big pharma case. For TWO YEARS I WAS TOLD ALL WAS GOING GREAT AND AFTER JANUARY 1ST 2020 ALL WOULD BE FINISHING UP. Since January I have left countless messages, sent registered letters and the only thing I have gotten is the most unprofessional response you could imagine. They took my money made promises and did absolutely nothing. I'm a 100%disabled person and a UNITED STATES COAST GUARD VETERAN and have never been lied to and deceived so much in my hole life .", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "113378740369274843565", "name": "Bonnie Hubbard", "time": 1579621112175, "rating": 5.0, "text": "Wonderful, attentive, professional, and kind attorneys. They genuinely take time to review your case and explain the legal process. The offices are clean, beautiful, and modern. The retainer and rates were more than fair given the impressive quality of work. I would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "103331778602541434206", "name": "Katelyn Lear", "time": 1605986283828, "rating": 5.0, "text": "Hands down best legal team i have ever had a pleasure of working with!", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "104332911055918182539", "name": "Henry Glover", "time": 1587494862149, "rating": 5.0, "text": "Been a fan of the Johnnys for many years.  Love knowing that my family and business legal is in their hands.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "105230787488845149539", "name": "Matthew Burford", "time": 1524760283901, "rating": 5.0, "text": "Great 1st class legal team.", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "113004015874411924619", "name": "Christopher Lee", "time": 1564188426470, "rating": 5.0, "text": "Great and caring team", "pics": null, "resp": null, "gmap_id": "0x88891b960cf17e7b:0x4f88489b6e5149af"}
{"user_id": "116278960962059693695", "name": "William Garner", "time": 1622078235364, "rating": 5.0, "text": "My experience was he is straight forward he answers any questions he can pertains to your case or not he cares about your loved ones. He and I and my case lasting few years and he got it dismissed. Would certainly recommend Randy Ferguson to anyone\nThank you so much again Mr Ferguson", "pics": null, "resp": {"time": 1622120692994, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "108331138943101449790", "name": "Corey Jordan", "time": 1621015580344, "rating": 5.0, "text": "Very good law firm. Was able to provide the services  I needed.  Highly recommended firm.", "pics": null, "resp": {"time": 1621017014497, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "100001057384768624715", "name": "BRAD BURKMAN", "time": 1616677435293, "rating": 5.0, "text": "Randy is an outstanding attorney. Very responsive and helpful. I will recommend him to anyone I know dealing with legal issues.", "pics": null, "resp": {"time": 1616678726286, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "102778689337997971088", "name": "Derek Dornellas", "time": 1620001882249, "rating": 5.0, "text": "Known Jackie for years and always had great outcomes at affordable rates.", "pics": null, "resp": {"time": 1620045416810, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "105589614473834353408", "name": "Tessa Jo", "time": 1599247165485, "rating": 5.0, "text": "I got in some trouble in alabama and i live in indiana. I hired randy to be my lawyer from alabama because that’s where my case was. he was so nice and helpful with everything even thought i was 6-7 hours away from him! i highly recommend him", "pics": null, "resp": {"time": 1599256223320, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "117281853470104273869", "name": "shamikia montgomery", "time": 1595616035701, "rating": 5.0, "text": "OMG I had the pleasure of working with him he is amazing what I thought would take weeks took a day in a half. He is very professional I called him after 8 and he helped me answered all my questions with no hesitation.. He is the best I have no complaints .....If you need help yall look him up call him ..he will respond .i left a message he returned my call..He was heaven sent..Thank you Jesus ....He help on saving my Baby! He the GOAT.....  Mr.Randy God bless you...Look him up you want be disappointed", "pics": null, "resp": {"time": 1595620968066, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "107966354408801228664", "name": "Sara Saiger", "time": 1580059605182, "rating": 5.0, "text": "Randy Ferguson took an extremely stressful, complex, and terrifying situation and was able to efficiently and very effectively find solutions. He proved to not only be a top notch attorney, but a compassionate human being. He is rare in his ability to work within legal constraints but still find solutions that are the best and most realistic for his client(s). We have been incredibly fortunate to have the honor of having him represent us and he comes highly recommended!!", "pics": null, "resp": {"time": 1580221297603, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "105401757236996328970", "name": "Christina Horne", "time": 1575423377189, "rating": 5.0, "text": "5 Stars does not reflect how awesome my experience was with Mr.Ferguson. He is very professional & straight forward. I’m celebrating because his work was perfect. He made a stressful situation stress free, and gave myself and my family peace of mind. Thank You!", "pics": null, "resp": {"time": 1575468047700, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "114492100408119897304", "name": "Ashley Grantland", "time": 1554408033684, "rating": 5.0, "text": "Randy was my attorney in a criminal case. And was very informative , he text me and called me throughout the entire process . he gave me legal advice prior to meeting him, he answered all questions and even text me the morning of court and was very responsive and I highly recommend using him . my case was dismissed.  Which was very important to me as I am seeking my doctorate and will be an emergency room Physician in the future.   Do yourself a favor and make an appointment with this law firm for any legal needs .", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "103970263660170794015", "name": "jarvis Armstead", "time": 1574533757190, "rating": 5.0, "text": "Would highly recommend Randy to anyone looking for legal services. I got in a car accident to which my vehicle was not insured at the time. The person that I was in the accident with, insurance company attempted to sue me for almost $7000 for an accident which I was not at fault. I hired Randy & he got the case dismissed before my scheduled court date. Didn’t even have to step foot in a court house. Great lawyer, if I have any legal troubles the the future Randy is the first person I’m calling.", "pics": null, "resp": {"time": 1574537594322, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "100349081589092984967", "name": "robert anderson", "time": 1573670611630, "rating": 5.0, "text": "He is a great person and he will try his best to help you", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "112990523381387981074", "name": "Davee Tucker", "time": 1550369539468, "rating": 5.0, "text": "Randy is Great guy, and extremely reasonably priced compared to others. However don’t let that tag fool you. He is a major advocate, and will fight for you. A+", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "110577614022741657799", "name": "Vicky Waller", "time": 1506723180621, "rating": 5.0, "text": "What a great experience in having to use an attorney!  He is NOT one of those attorneys that tell you what you want to hear to get your business.  Very knowledgeable, caring, honest, and helpful.  Randy went out of his way to explain the process.   I highly recommend Randy Ferguson.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "100128410015057135693", "name": "belinda woods", "time": 1529080096158, "rating": 5.0, "text": "I absolutely love working with Randy,  he lets you know upfront, your fees (no extras) payment plans (no hassel) very understanding....won my cases, always informing me on updates...could NOT have pick a better Attorney.  My Attorney for life", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "114650066271979323438", "name": "Brett Banks", "time": 1533179339014, "rating": 5.0, "text": "Randy Ferguson is a great lawyer. He has helped me with my situation tremendously. I will not hesitate ti tell anyone to hire him because he will get the job done", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "100033986454563901035", "name": "Sawyer Pannell", "time": 1511193004270, "rating": 5.0, "text": "Mr.Ferguson is a great attorney with a lot of knowledge in law. He is gave some great advice on a personal matter. I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "102653532436108898053", "name": "Rita Johnson", "time": 1491588860119, "rating": 5.0, "text": "Attorney Ferguson is a true professional. He stands out above all others in this area.He responded quickly to my needs and knew exactly what to do to resolve my issues. I highly recommend him and I will certainly call upon him again when needed. My hat goes off to him. Thanks Randy!\nR. Johnson", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "103699463355203992722", "name": "Michael Shane", "time": 1582510017447, "rating": 5.0, "text": "Very good very smart and a fighter", "pics": null, "resp": {"time": 1582567602568, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "117247217347957150085", "name": "LaToya Wilson", "time": 1502203231967, "rating": 5.0, "text": "Attorney Ferguson  was referred to me. We never meet face to face or sat in  his office. It was short notice that his took our case\nWe are not from the Huntsville area. So I was very worried. He help me to understand and calm my fears.  He was professional, courtesy, and worked with us by keeping in touch throw emails and phone calls. Thank you for Ray Ferguson for coming to our rescue.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "106294846537994847770", "name": "Jason Rose", "time": 1504721893860, "rating": 5.0, "text": "Mr. Ferguson has been very helpful and always returns my calls very quickly!  He is very professional and I would recommend him to anybody that needs an attorney!", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "116484811260651285214", "name": "Tammy Klimek", "time": 1534339869170, "rating": 5.0, "text": "There are not enough words to express how grateful I am for Randy Ferguson and his hardwork and dedication involving the case of well being of my mother. He spent countless hours talking with me and was always there when I needed him. I am blessed beyond measure that I was referred to him. I highly recommend his firm for any legal needs you have. He went beyond the call of an attorney he became someone that listened, cared and was always there even if i needed him. He was always on top of everything , and the greatest of all he always was quick to call back but 99% of the time he answered the phone which most attorneys have a voicemail. Thank you again Randy for being the best attorney anyone could ask for. If I could give him a 10 Star Rating He would definitelyget it. Sincerely,  Tammy Klimek from Prattville, Alabama", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "113379804426838646539", "name": "Stacey Wright", "time": 1558705299617, "rating": 5.0, "text": "I made a 15 minute phone call and he put me at ease about my situation, great advice thank you very much.", "pics": null, "resp": {"time": 1558708195243, "text": "Thank you for your review.  Call us if we can ever be of assistance."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "110130815440942788878", "name": "Joe Tyler", "time": 1558713904485, "rating": 5.0, "text": "Randy represented me in two car accidents and a bicycle accident. I would recommend him to my friends.", "pics": null, "resp": {"time": 1558718172859, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "103023421898045616537", "name": "Mike Calhoun", "time": 1479968779531, "rating": 5.0, "text": "Randy handled a case for me. In a very professional way. Honest and listened to what I had to say. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "104581717892074764681", "name": "Heather Armstrong", "time": 1601578927456, "rating": 5.0, "text": "Cause..hes my attorney", "pics": null, "resp": {"time": 1601642375106, "text": "Thank you for your review."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "100216361329633819302", "name": "Chantal Wilson", "time": 1512671514478, "rating": 5.0, "text": "Mr. Ferguson is a very kind and patient attorney. I highly recommend him if you are in need of a Great attorney!", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "111596754100161374849", "name": "Dana Womack", "time": 1481660468627, "rating": 5.0, "text": "I, Thomas McNutt, used Ferguson and Ferguson on a case that no one else could do. I would highly recommend them on any case that you may have. He is polite and he listens to what you have to say.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "103024745498186333374", "name": "Thomas Jordan", "time": 1529078991105, "rating": 5.0, "text": "Really great guy very professional, and reassuring no worries at all HIGHLY RECOMMENDED", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "112281973646078021075", "name": "candace caudle", "time": 1510171304053, "rating": 5.0, "text": "I hired him to represent me in a case in Huntsville.   I would recommend him to friends who need an attorney,\n.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "109233226931755535734", "name": "rell marshall", "time": 1509549368875, "rating": 5.0, "text": "I hired Randy Ferguson to represent me in a case. I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "112895015183373090869", "name": "ginger reagan", "time": 1515226169560, "rating": 1.0, "text": "He didn't really help my son at all I feel like I wasted my money he would have done better with a public offender", "pics": null, "resp": {"time": 1601039673508, "text": "Your son was charged with a very serious offense that normally requires mandatory prison time. Your son got no prison time at all. You wasted your money? Really."}, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "113253292424593522125", "name": "james reid", "time": 1481250544053, "rating": 5.0, "text": "Professional.   Honest.    Affordable.    Highly Recommended.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "113496289534991752886", "name": "Myguy B", "time": 1513024968889, "rating": 5.0, "text": "Real Attorney, experienced, professional, confident, saved me from \"ignorance of the Law\", answered right away", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "118266685252824551040", "name": "Bob Isoyev", "time": 1516308500001, "rating": 5.0, "text": "He is smart, likes to help people, gave a good advice!", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "113642968561797500389", "name": "Armstrong Heather", "time": 1562336657830, "rating": 4.0, "text": "He's nice", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "114562772743136038866", "name": "Amaz1ng", "time": 1512239377952, "rating": 5.0, "text": "Very helpful and professional", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
{"user_id": "117907589063507876556", "name": "Shawn Johnson", "time": 1478280017792, "rating": 5.0, "text": "Randy was will good listener and was able to help me out and help me out when no one else would so I would tell me friend's to use if if they have any problems and I know. I would use him again if I need.", "pics": null, "resp": null, "gmap_id": "0x88626ca9e6ae9f81:0xc7b18119ffa087e2"}
