{"user_id": "116398742803353060106", "name": "Becky Hicks", "time": 1622860838279, "rating": 5.0, "text": "Won cases over and over for me. Unbeatable cases he slammed dunked it. From criminal to family court Chip is the best. I've recommened himself to my brother and cousin which all won their cases as well. You dont have to worry when hiring this attorney. If you need a win pay alittle more and you wont regret it. When all other lawyers say theres no hope, call Chip he will find a way for you.\n\nWish he practiced in all states because I could use a lawyer like himself right now in Gatlingburg TN.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "104685048074420088723", "name": "Haley Lyckman", "time": 1611879307430, "rating": 5.0, "text": "When I got hit by a drunk driver that totaled my car and racked up thousands of dollars in medical bills I was so overwhelmed. I took my case to Jonathan at the Cleveland Firm and he handled everything. He kept me informed every step of the way and was so easy to speak to. He took care of every worry I had. 20/10 would recommend for any legal issue you have.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "109340672119456126203", "name": "Josh Bowman", "time": 1605207073538, "rating": 5.0, "text": "Very impressed with the professionalism and guidance I received while trying to work my property case with the help from Mr. Jonathan Wynn. Jonathan went above and beyond to make sure everything was in order so it could go as smooth as possible when settling this case. I didn’t feel rushed or confused on anything I came across with this for Jonathan’s willingness to help and walk me through the procedures and what all we had to do. Any future case that I will need settled will DEFINITELY be through the Cleveland Firm, LLC. Strongly suggest Jonathan Wynn!", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "100000174414182321947", "name": "James Wright", "time": 1597899036379, "rating": 5.0, "text": "Helped me on a wreck involving a man that hit me from behind .we made a deal out of CT.honest man got more than I asked for.played 🏈 at the same school as my half brother.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "117458056153669587296", "name": "Virginia Green Nowling", "time": 1580248359251, "rating": 5.0, "text": "Great colleague.  Highly recommend Chip and his staff.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "112466944963592535396", "name": "Jen Blozik", "time": 1538062997060, "rating": 5.0, "text": "There aren't words for how well the whole staff has and still treats us. We are going though the most important time in our lives and they have truly been there for us. I can't ever imagine anyone fighting harder and treating us like we matter and our case matters to them .", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "113923206433117986533", "name": "KatyPerry Isahologram", "time": 1560695652077, "rating": 1.0, "text": "This guy is a joke.  He has people working at other law firms feeding him info on clients.  He only wants your money.  This guy needs to be disbarred and should be sued for malpractice.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "116323598659863386547", "name": "Flat Earth Florida", "time": 1569098566833, "rating": 5.0, "text": "The earth is flat. Youtube \"Eric Dubay\"", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "101977308534558765548", "name": "Josh Yates", "time": 1511278187050, "rating": 5.0, "text": "Highly Recommend for divorce, final Will, and legal consult for small business.", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "107561874209889157433", "name": "Kristen Eaves", "time": 1506701731601, "rating": 1.0, "text": "They didnt even take the time to actually look at the case . I would not go to this law firm for any reason !!!", "pics": null, "resp": null, "gmap_id": "0x888e8561c4d0f059:0x2cfbda4c66816e2e"}
{"user_id": "105431565013846621244", "name": "Matthew Koss", "time": 1611144439809, "rating": 5.0, "text": "Tusco has been great to work with. Both their field and office staff have were very responsive and were more than willing to work with us as a team to solve challenges that arose from some of the unique conditions on our project. The installation + training of their security systems were seamless. I highly recommend Tusco!", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "117695783830181554858", "name": "Teddy Rhodes", "time": 1622230045542, "rating": 5.0, "text": "All around Great People", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "110344502713036741512", "name": "Mike Lamon", "time": 1603721184388, "rating": 5.0, "text": "In 2014 an F1 tornado came through my neighborhood destroying much of the fencing.  My neighbors and I contracted Tusco to replace the damaged fencing.  After several years some of the replaced fencing began to lean.   We contacted Tusco, who sent a representive out to investigate the problem.  He determined that some of the posts had not been treated by the company Tusco buys them from.  Tusco promptly  replaced the fence posts, making our fence new again.  We very much appreciate Tusco's response to the problem, and the professionalism of all who assisted us to include Julie in the office, Rick the supervisor / investigator, and the men who did the repair work.", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "108261335326129714500", "name": "GR82B A MAR10 martin", "time": 1593640105018, "rating": 5.0, "text": "Absolutely the best company in the world!", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "114230741267121467126", "name": "Jeremy Horton", "time": 1515872560621, "rating": 5.0, "text": "Very impressed with the workmanship and quality of their installation.", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "103224413546495668498", "name": "Amanda Provancher", "time": 1497221013381, "rating": 1.0, "text": "Very very very rude. Do not recommend. Very reckless", "pics": null, "resp": {"time": 1502822851684, "text": "Amanda, we apologize for any negative impression you may have gotten from our company or employees. If you don't mind, can you please elaborate on your grievance with Tusco? We are a commercial perimeter security contractor, and it is unclear how we may have given such an impression to you personally as we conduct business solely with commercial contractors, property owners, and governmental agencies.\n\nThank you,\n\nTusco, Inc."}, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1584589989146, "rating": 5.0, "text": "William white was one of the most helpful attorneys I have met and had a profoundly positive impact on my legal career. Every attorney associated with this firm is the best of the best and that comes from a competitor .", "pics": null, "resp": null, "gmap_id": "0x889292f8b79b0a37:0xa4e18dd5affce3d5"}
