{"user_id": "108642134360776862145", "name": "Tim Caldwell", "time": 1594913323979, "rating": 5.0, "text": "Sawgrass is the absolute best in surveying and engineering consultants in Baldwin County and the greater Mobile area!!!  Excellent work,  excellent quality, excellent prices!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b33d06c0f9f:0xd56ea6043a348357"}
{"user_id": "108278260922029593613", "name": "B Smith", "time": 1558719791814, "rating": 5.0, "text": "Best engineers in Jefferson County. Friendly staff. Extensive knowledge of Birmingham. Swift and accurate. They also work well with city, county and all utilities. Don't even waste your time with any other company. Schoel should be your only option.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "106958358025434070649", "name": "2Face Joker", "time": 1591803873830, "rating": 5.0, "text": "They do great work and have a awesome reputation over a hundred plus years and going strong.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "112787817221465959617", "name": "Cc Tt", "time": 1510186653213, "rating": 1.0, "text": "All they worry about is charging more than anyone else in Alabama. Save yourself 10 times the money and go elsewhere. Their engineering skills are no better than anyone​ else's. The quality of your services are based on how well the men in the field doing the manual labor are doing their job. The engineers don't step foot out of their air-conditioned offices and the men in the field are rushed, underpaid, and half of them unqualified while having to use outdated, worn out, uncallibrated instruments. And this is what you will find at any surveying company. So when you're choosing who to write your check out to, maybe think about getting some estimates, because the outcome will be the same. Your land isn't gonna change, the same measurements you're over paying them to make will be the same measurements you can have done by any other company for less than half the price. Good luck. They will never have my business.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "115856704806025612483", "name": "Bill Stevens", "time": 1566090097264, "rating": 5.0, "text": "Top rate civil and surveying", "pics": null, "resp": {"time": 1570827224863, "text": "Thank you for the 5-star rating!"}, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "100609289629996583677", "name": "Eric Graham", "time": 1478199962103, "rating": 5.0, "text": "Real pros.", "pics": null, "resp": null, "gmap_id": "0x88891bc5d518a011:0xa93b5760c9da8066"}
{"user_id": "112321116800020524958", "name": "Alexandra Murray", "time": 1619443435853, "rating": 5.0, "text": "David S**** the owner inspected a drainage easement on our property and was able to advise us as homeowners the steps to correct drainage and erosion control issues. He provided several ideas and advised us to contact the county and builder to have these issued corrected. He has all the technology to take aerial footage and soil samples to obtain accurate information and is incredibly knowledgeable! He went above and beyond for us and I know he truly had our families best interest. I would recommend DSLD to anyone without a doubt.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "106801910992134550072", "name": "Laura Witcher", "time": 1597937382685, "rating": 5.0, "text": "I called several companies about an immediate project and possible other projects. When David Sharp showed up at our door we had a pleasant surprise. Not only is he a great person, but he was my husband’s youth director years ago and they got to have a little reunion. DSLD filled in and tiled a front porch that was formerly a long planter box. We had previously spoken to many others about the project and never was happy with the response, the quotes, or how the others listened to what we wanted. We are so pleased with DSLD’s work, how quickly they completed the project, how well they communicated with us, and the quoted amount for the work that they have us as customers from now on! Plus all the staff are very friendly and helpful!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiOrz67YeLntYUbtci-smb2K2iw7MyOJvzpr0K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgms5sKlWZTGAZ-G5BOb5dlpOc0KWNa5A_XflF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNBaaiYMsfZ3rS0WwsVTBgFbl0G3ParxvFZ2Gm7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOF4jWsYmHAno_fxzhKOpi7aNbTkAVf0l36F_gn=w150-h150-k-no-p"]}], "resp": {"time": 1598882241879, "text": "It was so good to meet you Laura and catch up with James!  Thank you for your kind words and we look forward to working with you in the future."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113033204294121397297", "name": "Chase Carter", "time": 1619392035988, "rating": 5.0, "text": "This review is kind of overdue,  but getting the pool ready for this season reminded me I’ve yet to write one.  DSLD installed a Desjoyaux pool at our house last spring.  From design work (Stephen) to the crew that installed our pool (PM Austin) we were very pleased and our backyard was completely transformed.  Their vision for our backyard and the product they delivered completely surpassed (in a good way) the one we thought possible.  Our project consisted of not just the pool install, but rerouting/hiding a drainage ditch that went through the middle of our yard, regrading the entire backyard, sprinkler install and pouring a parking pad.  DSLD was capable of handling the entire project without having to contract out things here or there so it was nice only having to deal with one company from start to finish.\n\nAnd probably most importantly David and his team are good people.  5 stars and highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117581098683132876007", "name": "Robert Anaforian", "time": 1601215160112, "rating": 5.0, "text": "DSLD has earned our highest recommendation. Throughout our project David and the entire team demonstrated integrity, creativity, top notch customer service, professionalism, and premier craftsmanship.\nYou will not be disappointed!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsf7_9PmJ5GyVgi24A7060n_vXDTuSmB0q4NM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUcZvjMYUDoo551scqgaXW9YN9p1u-jE1n0Nc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105156255194838739170", "name": "Rob Sharp", "time": 1618932465987, "rating": 5.0, "text": "DSLD traveled to mine and David’s mom’s house. The backyard was approx 110 ft and open to all, no privacy. I watched the crew scalp the old lawn and graded down to a more level surface. Then they planted about 20 trees which served as a privacy fence. Mixed in a variety of bushes and plants. I could only imagine how it would look when all planting matured. They laid new sod and it looked like a picture from Home and Garden magazine.\n\nThrough the years I have visited my brother and his family and he’d take me on job sites with him. I was amazed to see the complexity of installs he was undertaking. The attention to detail David gives to each install is second to none. I could write a few pages just on that subject. (But I won’t) His new store AquaScapes was an overnight success. I tribute this to David’s insight of products as well as knowledge of the industry. Offering fountains, fish ponds, fish of course and swimming pools from the store, has only broadened the DSLD complete landscape portfolio.\n\nI have to tip my hat to my brother and his team of professionals. His sons Zachary, Miles and Cole play a major part in this well oiled machine as they each have a part in most every install. They are dependable, punctual and treat each job as if it were being installed on their property.\n\nRather you have DSLD perform their expertise on your yard or not, you have to admire how far they have come.\n\nWishing you all continued success!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "115887581742208407752", "name": "Daisy Hawkins (Hope Series)", "time": 1619634636150, "rating": 5.0, "text": "The most professional one stop shop for all that I needed.  This team landscaped the front and back, built a screened in patio.  Created and installed all new flagstone walkway and side patio and surrounding my new beautiful water fountain from their Aquascapes location at Hanna's Garden on 280.  Then painted my entire exterior on my house and addition.  Very professional, hard-working, and eager to accommodate any requests I had.  Highly recommend this group for your outdoor hardscape and landscape.  I loved not having to be the contractor on all these things.  They handled all for me.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105412446339422660363", "name": "Laerke Costov", "time": 1627438401718, "rating": 1.0, "text": "Run as fast as you can in the opposite direction! Avoid at all costs!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117060964320707968870", "name": "R Daniel Chang", "time": 1621267414548, "rating": 5.0, "text": "David came by for our consultation on time. He was very attentive to our questions and concerns. We're still in the process of making final decisions on contractors and builders but dsld is certainly at the top of the list.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113482551053842444997", "name": "Steve Skelton", "time": 1616113682517, "rating": 5.0, "text": "I could not be more pleased with this company! They are professionals in every sense of the word.\nThey have done multiple projects for myself and my wife. They are what I would call...outdoor wizards!\nThey have installed amazing landscape lighting for us, completely redesigned our shrub and flower beds, and installed the most awesome landscape masonry borders I’ve ever seen. I have a large fountain in one of the shrub beds in the front of my house. Mind you, this thing weighs like a bazillion lbs. I was recently trying to clean it out and get it ready for Spring and Summer. I accidentally let the bowl tip off the pedestal. Well, I tried to lift it up and get it back on the pedestal. I suppose I’m not as young as I used to be, because I couldn’t budge it. I really didn’t know what to do, so I called DSLD and asked if they could come by and get this monster back on the pedestal. It wasn’t more than a day later, when I got in from work when I noticed that my fountain was sitting upright, filled with water, just waiting to be plugged in. When I called Zach Sharp, ( a great young man by the way) to ask what I owed them, he absolutely refused to take a cent, saying it only took a few minutes and I could not get them to take anything for their time and trouble. In today’s world, qualities like that are rare. If you ever need any type of landscape architecture, a pool, anything “outdoorsy”,\nThese are the guys. They are 5 stars in every category and I could not give them a higher recommendation.\nDon’t waste your money on shoddy work! Call DSLD . They are definitely the best!\n\nSteve Skelton\nDunnavant Place at Highland Lakes", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113809371975189393006", "name": "Jason Hall", "time": 1603288247089, "rating": 5.0, "text": "DSLD does excellent work. It’s almost hard to believe it’s the same yard from before to after. The yards they have worked on and completed are the type of yards you would see on TV or magazines the quality is so good.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116480513897387240618", "name": "Heather Brown", "time": 1604092705117, "rating": 5.0, "text": "DSLD rescued our backyard garden! In March, we used another landscaping service to prepare landscaping beds and plant hydrangeas, roses, azaleas, camellias, gardenias, etc. The beds were not properly prepared, and the plants became diseased, stressed, and began to die very quickly. We also had a serious drainage problem.\n\nDSLD determined why our new plants were failing, recommended solutions, and implemented their plan; amending the soil and replanting the plants we already had. They also solved our drainage problem. Now, we have a gorgeous backyard!!!\n\nWe highly recommend DSLD!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105850376186232250078", "name": "Lauren Clemons", "time": 1599147058436, "rating": 5.0, "text": "Great communication and presentation of information on their entire pool building and landscape design process!  I appreciate the quick responsiveness and the professionalism so far.  Excited to get started on our back yard transformation project!!", "pics": null, "resp": {"time": 1599685499771, "text": "Thank you for your kind reply. Look forward to working with you on the design."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "102795393070692604561", "name": "Hughes Home", "time": 1606076537427, "rating": 5.0, "text": "DSLD repaired our pool and got it running before spring was over. They did an outstanding job and were generous with their time and efforts. They have also provided valuable ILP lessons for the youth on our camous that will help them get started once they graduate HS.", "pics": null, "resp": {"time": 1606169363914, "text": "Thank you very much for your kind remarks. Our owner David Sharp enjoys teaching the independent living classes at kings home, and we were all happy to rebuild your swimming pool and wish you many years of swimming recreation and enjoyment."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "105513441949920977034", "name": "Drew Ellis", "time": 1591413965210, "rating": 5.0, "text": "Genuinely good people and very good at what they do. Arturo and his crew were very professional and made sure everything was done right. Stephen was easy to communicate with and a pleasure to work with. You get what you pay for with this crew.  We love our new backyard and patio.", "pics": null, "resp": {"time": 1591731612400, "text": "Thank you for the kind words Mr. Ellis. From design to implementation, It was a pleasure working with you and your family to bring your backyard living space to life!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "109885379475406676216", "name": "Joe Limbaugh", "time": 1617741295033, "rating": 5.0, "text": "Even though we did not select them as part of our bid process, they were very professional to deal with.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "101214040991855745332", "name": "Lester Ruttka", "time": 1599606798046, "rating": 5.0, "text": "DSLD does exceptional work, is efficient, fast, and reliable. Whether it is general landscaping or custom design they can't be beat.", "pics": null, "resp": {"time": 1599685608487, "text": "Thanks for the kind words Mr. Ruttka. It was a pleasure working for you!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117356515438974984803", "name": "Annilaurie", "time": 1598713009635, "rating": 5.0, "text": "DSLD did a great job on are yard.  We love our beautiful new beautiful back yard and lighting.", "pics": null, "resp": {"time": 1598882379426, "text": "Thank you for your kind words. It was a pleasure working with you to transform your backyard!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113495610356696334467", "name": "William Gilley", "time": 1556572920185, "rating": 5.0, "text": "DSLD sets the standard for professionalism and integrity in creating amazing outdoor spaces. Their team works with you to create designs using the best quality products available. Their crews are efficient and well organized. They are honest and dependable and the quality of their finished work is second to none. I highly recommend using them for your next outdoor project.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "112716414007080434744", "name": "David & Ann Swanson", "time": 1594319839169, "rating": 5.0, "text": "Very knowledgeable and professional. Great job.  Pool and landscape look fantastic. Would highly recommend", "pics": null, "resp": {"time": 1590502708546, "text": "Thanks for the kind words Mr. and Mrs. Swanson."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "103550641931716815370", "name": "Alene Morgan", "time": 1584233475919, "rating": 4.0, "text": "If you are looking for a landscaping company that will give you good professional advice in addition to responding to your specific request, DSLD would be a good bet.  Perhaps the best quality is the attitude of those involved in which you sense they really care to do a good job for you.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "115624569660376036855", "name": "James Graham", "time": 1598991102384, "rating": 5.0, "text": "I really enjoyed the planning process that DSLD took us through.", "pics": null, "resp": {"time": 1599660870599, "text": "Thank you! It was a pleasure working with you and your family!"}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "100666153079763170689", "name": "Jason Carpenter", "time": 1535508718720, "rating": 5.0, "text": "I have used DSLD numerous times and I am always 110% satisfied with the attention to detail and the final product of their work.  The DSLD team is always courteous, professional and respectful.  If your like me and don't have a vision for your lawn, call DSLD and let them handle it - you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "117889529628916507797", "name": "Script Inspired", "time": 1574701167606, "rating": 5.0, "text": "Very knowledgeable staff. Great care and attention to detail was taken when installing sod in my yard. Fantastic finished product!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108489985414334381857", "name": "bill rodgers", "time": 1546467798023, "rating": 5.0, "text": "Did what they said they would. Mason is a true artist. Offered great design and additions as we went. Jason was a wonderful asset to have on my job. Will mark them as KEEPERS.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "100352823394783090579", "name": "qb1_7 Wanderful1", "time": 1611170303043, "rating": 3.0, "text": "A little arrogant if you ask me", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "100507286865342211235", "name": "Bryan Chace", "time": 1576724362702, "rating": 5.0, "text": "Knowledgeable, professional, and excellent workmanship. Attentive service and estimates. They do what they say, and do it very well.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "106802802850175093281", "name": "Jamie Berry", "time": 1556932323261, "rating": 5.0, "text": "Great company to work with. Very knowledgeable and efficient. All around great group, I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108060663797590743204", "name": "mary pickett", "time": 1546732043908, "rating": 5.0, "text": "We had just moved into our new custom home but had questions about some of the builder's construction decisions.  We wanted a neutral opinion.  We called DSLD and they promptly came to access our questions and did a complete review of the home.  Afterwards, we were provided a concise review of construction and systems.  They explained why the builder did certain things and advised on how to get things investigated/repaired.  I recommend DSLD.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116239773308142999133", "name": "tim roberts", "time": 1527724178617, "rating": 5.0, "text": "I have performed a lot of work around these guys and they are the best in the business. I am an electrician and many time other trades only care about thier part  job. Their masons work with all the trades to make sure the customer gets the best project possible. I have never seen anything but  jobs of the highest quality around these guys and look forward to working around them again down the road.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "113439479955876951729", "name": "Lou Eppolito", "time": 1540774441933, "rating": 5.0, "text": "Design work was functional and attractive. Implementation was first rate. DSLD stands behind its work. Overall, a great experience!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "101816095609575616469", "name": "Ron Boisclair", "time": 1564760743123, "rating": 5.0, "text": "Exceptional client service, workmanship and a great team. Working with DSLD owner David Sharp was a pleasure. He responded to my inquiry within a day and met with me within a week to discuss options for landscape and drainage work on my Highland Lakes home--the $100 up-front consult fee was a worthwhile investment, and was applied to to the cost of my project. Work included expanding, grading, and sodding (Zoiysa) the backyard, which included construction of a 70 foot concave curved/step-graduated wall, installing a new drainage system along and under the driveway, and adding an external sump pump well and pump to move water from a tied-in roof downspout and overhead deck drain. DSLD completed the project in approx. 2 weeks.  Good communications throughout, with detail breakdown of proposal costs.  Definately recommend.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "114008116624620607805", "name": "Stan Ingram", "time": 1577116217024, "rating": 5.0, "text": "Pleasure to work with.  They did everything they promised in good time.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116807137217355113357", "name": "Jim Mason", "time": 1554746540301, "rating": 5.0, "text": "Very professional staff. They assisted me in any way possible and were sure to follow up on my inquiry to see if I needed any additional help.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "112455983675959806081", "name": "Brian Parrish", "time": 1570670353104, "rating": 5.0, "text": "Professional, respectful, hard-working team that delivers top notch service! You will be happy with the results and so will your neighbors!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "108025899390725273835", "name": "Justin Abercrombie", "time": 1518549609820, "rating": 5.0, "text": "DSLD takes pride in the quality of work for each and every job. The company as a whole is very friendly, and makes the experience welcoming as well as rewarding.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "103161347841108485095", "name": "Tim Kirksey", "time": 1557860271456, "rating": 5.0, "text": "Staff is very courteous and professional. A fun place to shop!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "107704469215962647631", "name": "David Sharp", "time": 1523724033093, "rating": 5.0, "text": "As an owner/operator I enjoy meeting new and old clients and working with some of the finest people I know.  Our employees stay put!  We have folks here going on three decades and and counting.\nDon't take my word for it, call us today and put our professional team on your next project!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "106549235233377848473", "name": "Russell Baker", "time": 1577717639598, "rating": 4.0, "text": "Knowledgeable crew always showed up as scheduled and happy to coordinate their work with other Contractors. Pricing is not the cheapest but you get what you pay for", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "101364454963043619171", "name": "Nelson TAYLOR", "time": 1583890505616, "rating": 1.0, "text": "Terrible follow up!!! I contacted DSLD for a replacement pool liner after visiting Aquascapes store. They would not provide photos of their work, references etc. Very obvious they are unqualified for such projects!", "pics": null, "resp": {"time": 1591303088105, "text": "Mr. Taylor, we apologize for our untimely follow up on your request.  You caught us at a very busy time and we have since hired the requisite personnel to ensure this does not happen again. At your inconvenience, please stop by AquaScapes anytime for a $25 credit on anything in our store."}, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "110433171724283695337", "name": "Ed Bartlett", "time": 1538787660424, "rating": 4.0, "text": "Extremely professional.  Cutting edge designs.  Top quality construction.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104646490926883103594", "name": "Lester Colindres", "time": 1518567188975, "rating": 5.0, "text": "It's been great working for DSLD\nfamily oriented company.\nLots of opportunities to learn new skills.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "109666238525128245108", "name": "Brady Pugh", "time": 1518556541202, "rating": 5.0, "text": "DSLD is a dependable family owned and operated business that has unmatched customer satisfaction. Attention to detail, knowledge, and integrity are some of the values that this quality landscape company prides themselves in.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "103246960820633226748", "name": "Griffin Hansen", "time": 1561242396982, "rating": 5.0, "text": "Great landscaping company, and their chicken yard on Dunnavant is a lot of fun to see every day.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "110203558856388388546", "name": "Leo Hernandez", "time": 1518634092254, "rating": 5.0, "text": "Dsld gave me a great introduction to customer service and taught me about the workings of a successful small business. the company is family owned and operated, and it feels like you are with family when you are at work. Love Dsld and would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "116365118937523404051", "name": "markus frederick", "time": 1518542715841, "rating": 5.0, "text": "Love working here! I get time off for my school and i like how it's family operated!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "111769733770875919062", "name": "James Martindale", "time": 1518551658784, "rating": 5.0, "text": "Great family owned business, very professional work!! Quality at its finest!!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "110381893035475669378", "name": "Kelly Matthews", "time": 1548116454768, "rating": 5.0, "text": "Great Administration and an Excellence Driven Team", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "109597840293051631711", "name": "Michael Crump", "time": 1536107231583, "rating": 5.0, "text": "We love how the project turned out and highly recommend DSLD.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104746524828206144737", "name": "Greg James", "time": 1538335668884, "rating": 5.0, "text": "Great guys.  They do fantastic work!!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "114052142898458635700", "name": "Frank McClure", "time": 1552256604046, "rating": 5.0, "text": "Very professional, fixed my drainage issues, and repaired landscaping to desired condition.  Would use again.", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104408424798035797493", "name": "KEITH JEWELL Straight-Line PARKING LOT MAINTENANCE", "time": 1475423579683, "rating": 5.0, "text": "Great service good people to do business with", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "104936519051582804225", "name": "Cooper White", "time": 1560449043189, "rating": 5.0, "text": "Very professional and got the job done quickly!", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "114703962043272744489", "name": "R Heffner", "time": 1570752724074, "rating": 4.0, "text": "Phillips", "pics": null, "resp": null, "gmap_id": "0x88893e19213388e5:0xeb3f3999b720c596"}
{"user_id": "102908396958213414468", "name": "New Life Builders LLC", "time": 1613594013405, "rating": 5.0, "text": "Good guy to work with.", "pics": null, "resp": null, "gmap_id": "0x889a0e0f9f5b365d:0x87917842a62f68be"}
{"user_id": "118422860748563972630", "name": "Angela Rene' Craig", "time": 1526250227216, "rating": 5.0, "text": "Randy Are is awesome...", "pics": null, "resp": null, "gmap_id": "0x889a0e0f9f5b365d:0x87917842a62f68be"}
{"user_id": "115403229510293909478", "name": "Misty Fontenot", "time": 1609799446059, "rating": 5.0, "text": "I work for an architecture firm in Birmingham and part of my job is to secure surveys for our clients that we use to begin work with them. I work closely with the Gonzalez-Strength team and they are all so wonderful. They are incredibly responsive and do excellent land surveys. We’ve done multiple jobs with them so far and look forward to our continued relationship!", "pics": null, "resp": null, "gmap_id": "0x88892251064d79fb:0x91d2dd32b02b293"}
{"user_id": "116629998200781911730", "name": "Perry Barbaree", "time": 1582748855731, "rating": 5.0, "text": "I'm a real estate agent in Bham area.  I have worked with GSA many times, personally and professionally.  They are responsive, nice, professional and competitively priced.  If you need a survey or Engineering services, choose this group.", "pics": null, "resp": {"time": 1582752643992, "text": "Perry, we appreciate the great review and absolutely enjoy working with you!  Thanks so much!"}, "gmap_id": "0x88892251064d79fb:0x91d2dd32b02b293"}
{"user_id": "114639833536605400268", "name": "Kevin Stober", "time": 1342716049839, "rating": 5.0, "text": "Best Civil Engineering & Survey Co. to work for. We pride ourselves in not only doing an excellent job but to make our clients happy knowing it's done right.", "pics": null, "resp": null, "gmap_id": "0x88892251064d79fb:0x91d2dd32b02b293"}
{"user_id": "106823948362470976399", "name": "Suzanne Strength", "time": 1510171447084, "rating": 5.0, "text": "The best in the business!", "pics": null, "resp": null, "gmap_id": "0x88892251064d79fb:0x91d2dd32b02b293"}
{"user_id": "110576081629011195073", "name": "ALAN STEPHENS FALLETTA", "time": 1611358537264, "rating": 5.0, "text": "The andor Equal to the Best Architectural Firms in the Universe!", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "105041599367663082940", "name": "Ashley Wiley", "time": 1523470172885, "rating": 5.0, "text": "toured the firm on a field trip. the office is beautiful and the firm has done some amazing projects.", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "115247920295980873895", "name": "Adam Cornelius", "time": 1566418248917, "rating": 5.0, "text": "Great engineering and architecture firm", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
{"user_id": "107254403120027757775", "name": "T. O.", "time": 1548335011434, "rating": 5.0, "text": "great place to work", "pics": null, "resp": null, "gmap_id": "0x88891bba5c9f0eb7:0x59ed822ecb44b69c"}
