{"user_id": "108345699936577837922", "name": "Amanda Bolle", "time": 1483720490398, "rating": 5.0, "text": "My experience with Luke's pressure washing was positive all the way around.  The technician arrived on time and was friendly, I wanted to adopt him.  He did a wonderful job and now my driveway sparkles!  I plan to have them back soon to do my windows and patio.", "pics": null, "resp": null, "gmap_id": "0x888a3eaa669ccf51:0xb233f25135fc201"}
{"user_id": "100287009962484702491", "name": "Charlotte Sommersby", "time": 1484019726233, "rating": 5.0, "text": "Luke has done numerous jobs for me from home to business. Each time he consistently does an excellent job and in a fast turn around. Highly recommend and his pricing is very competitive.  No job too small......", "pics": null, "resp": null, "gmap_id": "0x888a3eaa669ccf51:0xb233f25135fc201"}
{"user_id": "102583072701788684150", "name": "meagan Howell", "time": 1483744595288, "rating": 5.0, "text": "Luke does great work! Highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x888a3eaa669ccf51:0xb233f25135fc201"}
{"user_id": "111228224301638731226", "name": "Obiediah Brown", "time": 1579019817526, "rating": 5.0, "text": "Great job", "pics": null, "resp": null, "gmap_id": "0x8888e129501a31d1:0x4507c37278e84ebe"}
{"user_id": "108192194079694054286", "name": "Anthony Hall", "time": 1485751912807, "rating": 5.0, "text": "Great work", "pics": null, "resp": null, "gmap_id": "0x8888e129501a31d1:0x4507c37278e84ebe"}
{"user_id": "105856403826598664038", "name": "Michael Kemp", "time": 1627671018015, "rating": 5.0, "text": "Guys out on the pad are hard workers.", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "108477870676895146979", "name": "Brian Rouse", "time": 1608228483194, "rating": 5.0, "text": "Very fast unloading. 20 min between bumping the dock and pulling out empty.", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "108226136631708981863", "name": "Larry Smith", "time": 1547748500968, "rating": 5.0, "text": "Very good place to deliver freight. Folks there extremely nice and unloaded me very fast.", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "111087430567066785983", "name": "Donald Lundy", "time": 1612457794603, "rating": 5.0, "text": "Quick and courteous", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "100369523024230287264", "name": "Joshua Andres", "time": 1598927710773, "rating": 5.0, "text": "Ive been there before", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "117817521853274526840", "name": "daniel Travis", "time": 1581180849642, "rating": 1.0, "text": "It's not even worth discussing", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "107623731967080951057", "name": "Jay Johnson", "time": 1517360895494, "rating": 1.0, "text": "They care more about employees than clients.               Without clients you have no employees", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "114592052327051513368", "name": "Luke Ross", "time": 1493644700004, "rating": 5.0, "text": "10/10 best experince", "pics": null, "resp": null, "gmap_id": "0x88891db0d9ae6feb:0x7181998cb8bac8aa"}
{"user_id": "100054927386226241463", "name": "Ana Carolina Muldoon", "time": 1628987884661, "rating": 5.0, "text": "These ladies do an amazing job every single time ! I’m not going to lie, at first I was skeptical because of the price. We had recently used someone else in town and were not pleased at all with the quality of work we received for the amount we had paid. So we were extremely nervous. But I can honestly say that nothing comes close to the quality work that these ladies do and the services they provide. I am so thankful that we have two maids and a mop to help my husband and I  with the heavy duty cleaning so that we can have more time to spend with our babies!\n\n10/10 definitely recommend!!!!!", "pics": null, "resp": {"time": 1629078657518, "text": "Thank you Ana for taking the time give us your feedback.  We are so happy you have more time to spend with your family!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100916809269351258700", "name": "Nathan King", "time": 1628966180550, "rating": 5.0, "text": "On move-in day at our new house, we had another cleaning company scheduled, and they never showed. I called Two Maids & A Mop and asked if there was any way they could squeeze us in (this is a few hours before the end of the business day on a Friday, mind you). They ensured they could get us something, and within two hours, two cleaners were at our door.\n\nNot only that, but our AC went out in the middle of the clean (it was 98 degrees outside). The cleaners just laughed it off and were incredibly professional and friendly. They even offered us some advice on cleaning certain areas of our new house in the future.\n\nI recommend TM&AM to anyone needing cleaning services in the Auburn area. They are extremely dedicated to providing a quality product and good service. They were excellent in helping us with a situation that could have been a mess — literally and figuratively.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109727435233982422576", "name": "Symone Alexander", "time": 1628365663919, "rating": 5.0, "text": "I am truly amazed! My house was spotless when I came home! The attention to detail like folding the ends of the tissue paper and ways of placing things that make everything look less cluttered was amazing! They were also extremely friendly and efficient!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114639225205997526936", "name": "SUSIE HOLMES", "time": 1626812996457, "rating": 5.0, "text": "Two Maids & A Mop were very easy and professional to work with.  I was able to secure a move-out cleaning a month in advance, and they continued to say in touch with me via text about my upcoming cleaning.  They even called me from the duplex the day of cleaning to confirm some things, which was very appreciated.  They did a fantastic job deep cleaning a 2 story, 4 bedroom, 3.5 bath duplex for 4 college boys.  We are very pleased with their work and highly recommend them.  We will use them again!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112948461139151124781", "name": "Shawn Jeter", "time": 1627043696794, "rating": 5.0, "text": "Krissy was fabulous to deal with and made sure we were completely happy! Her communication skills and transparency are refreshing and a welcome treat in today’s world! There were a few loose ends to tie up toward the end of our cleaning, and Krissy and Ashley went above and beyond to get the job done. I am so impressed by their services and willingness to go the extra mile, that I will definitely use them again. Two Maids is the real deal!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100077788454704594600", "name": "Nikita Akbari", "time": 1624328257595, "rating": 5.0, "text": "It’s the attention to detail for me!\nI’m an impossible person to clean for. I’ve tried 2 other services and felt underwhelmed. All sweet and helpful, but not what I was looking for. The team that came out today left my beds CRISPLY made, left the bathrooms sanitized and my home is REFRESHED. I was upfront with my expectations when I called & booked service, I shared what was important to me… they totally delivered. Already looking forward to the next one!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104035586753836905216", "name": "Blake Busbin", "time": 1628007787960, "rating": 5.0, "text": "Very happy with the initial cleaning we had. Team was prompt and professional. Very attentive to detail. Did an outstanding job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113541480526744083565", "name": "Wendy May", "time": 1628190231500, "rating": 5.0, "text": "I was very happy with all the cleaning and attention to the deal of the cleaning with Natalie and Brittney. I actually want them both to do my biweekly cleaning. Thanks to them sooooo much….you are appreciated!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116422874844349172280", "name": "Suzi Mckibben", "time": 1621441288639, "rating": 5.0, "text": "The crew that came did a fantastic job on a deep clean.  They were very thorough, and the house looks amazing!  I've had a cleaning service from a different company before, but this crew was 100x better.  The customer service setting up the appointment was great.  Chrissy was a sweetheart.  Looking forward to their monthly service.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111172760477322528793", "name": "Luke Oeding", "time": 1627479445462, "rating": 5.0, "text": "I was very thankful that they were able to get me scheduled the same day I called. The cleaners did a nice job, and they were very efficient. The fact I didn't have to supply anything (cleaning tools, chemicals, etc.) was also very nice!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105336075872121616885", "name": "salina", "time": 1623261275708, "rating": 5.0, "text": "Team 3 very beautifully cleaned my home and changed the whole look of it. Now, thanks to them, it is the most clean I’ve had it in years! My place looks great. I will definitely be using this service again! Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111370873464210712926", "name": "Eden Wells", "time": 1623298625503, "rating": 5.0, "text": "Kimesha and Elaine did a superb job with our home! They made sure everything was left spotless before the kids and I arrived. Not one thing was out of place. They even tackled hard surfaces such as my greasy stove, baseboards, and under the kids bed. I would 100% recommend Team 7 to anyone especially if they are looking for the job to be done without worries. Team 7 truly went above my expectations.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108094318020007122060", "name": "abw0035", "time": 1627172397845, "rating": 5.0, "text": "Great job! Definitely recommend this cleaning service to others! Needed a move out clean and it was SPOTLESS! So pleased with the outcome!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100085618642205084016", "name": "Rachel Foster", "time": 1623310049575, "rating": 5.0, "text": "I had a great experience with Kimesha & Elaine. They’re awesome at what they do! They did an OUTSTANDING job! They went above and beyond cleaning my home. I would definitely use them again. They had excellent service and are meticulous cleaners.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107359933400911079415", "name": "Ron & Kim Weyer", "time": 1621527549146, "rating": 5.0, "text": "This is the best cleaning service that we have had the pleasure to work with! They did an amazing job. We hired them for a move-out clean, and the house was cleaner than when I moved in when they were finished! They were so nice, professional and addressed every detail. I was so impressed with the service and would recommend them anytime.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115095348830441934008", "name": "Karl Westfall", "time": 1626538841489, "rating": 5.0, "text": "I called to schedule and they were out the next day. Candice and team 8 did an awesome job doing a deep clean. A great experience throughout the process. My thanks", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107831566601991072923", "name": "Keyon Hicks", "time": 1624648565104, "rating": 5.0, "text": "I am very impressed by the work. Elaine & Roo did an amazing job. They were kind and courteous and didn't hesitate to ask a question when needed. I will most definitely use the services again!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103226921253609443341", "name": "廖本庭", "time": 1619306300077, "rating": 1.0, "text": "Be careful with your belongings...\n\nBooked moving clean online. Last minute notice for changing time due to they don't go through that route the scheduled day. After cleaning was done, all of the blinds were not cleaned as advertised. Had to ask them to come back. When I went back to check again, the frame for the vent outlet was on the floor.... Worst of all, they threw away a large area rug after first cleaning instead of cleaning it as advertised on the website. Called to talk to customer service about the area rug and was told she wasn't authorized to handle this and will ask the owner to contact me. Nothing happened after a week. My wife called again and was told the same thing. Never was contacted. Paid more to get the service quality and hassle free  but it wasn't there.", "pics": null, "resp": {"time": 1619364879844, "text": "Thanks for your feedback.  We are certainly not perfect but implying we would take or knowingly dispose of someone's belongings is baseless and says more about your character than ours....\n\nLet's be clear, you left your rug with other items for our team to remove from home post move out.  Your attempt to imply otherwise unfair and not accurate.\n\nMove in  / Move out is for empty homes.  Deep cleans are for homes where items remain.\n\nAs discussed several times, typically  in a move in / move out clean the expectation is the house will be empty.  We are glad to place a small amount of trash that remains in the garbage as a service.    In your case, you left some miscellaneous items as well as this rug.     As we explained, if there were items that were not to be disposed of, you needed to provided guidance prior to our team arriving and cleaning the home.\n\nDo believe our team went back to home to address an item you discussed with our manager.   We try extremely hard to stay on schedule but some times events occur outside our control.  Not an excuse just the reality.\n\nEnd of the day we certainly don't like having dissatisfied customers but are willing to take the negative feedback rather than pay for a rug that was left with other items to be disposed of after move out.  Had we been provided this direction prior to arriving at home we would be more than glad to address.    Thanks for your business and my apologies your are dissatisfied with your experience.  Sometimes we simply cannot find a solution that is fair to both parties based how event transpire."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108270474062064030978", "name": "Hannah Tatum", "time": 1623440035603, "rating": 5.0, "text": "team 8 does a great job cleaning! i would recommend this service to anyone who wants a clean home done well! they’re awesome and so friendly 😇", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117962554692419600029", "name": "Henry Porter", "time": 1620860760614, "rating": 5.0, "text": "Madison and Shontia have been coming to clean our home on a bi-weekly schedule and it’s very much appreciated! These girls are very thorough and professional! Would recommend them to anyone who needs that extra help cleaning! Thanks girls look forward to seeing you again in two weeks!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106600309952648012127", "name": "Michelle Z", "time": 1624066201958, "rating": 5.0, "text": "Excellent experience! Called for a last minute pre-party cleaning and they were here the next day. Very friendly cleaning team that cleaned quickly and did an excellent job. I especially appreciated that they helped to pick up and organize some of the toys. Also, didn’t make me feel judged for any extra messy areas. Really my best professional cleaning experience and will recommend to friends. #thankyou #team3", "pics": null, "resp": {"time": 1624302239098, "text": "Thanks Michelle.  We are so glad we could help!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114285306599155574614", "name": "Shay Marshall", "time": 1623436184610, "rating": 5.0, "text": "If You want to Book With Some one I Recommend Shontia and Madison… they Did an Awesome Job on My Home… Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118320304463533340637", "name": "BlueShock2011 (BS)", "time": 1617676318229, "rating": 5.0, "text": "Wow.  We had the fortune of having Elaine & Autumn of Two Maids in to our home this morning for a Deep Cleaning and we could not be more pleased.  I don't just mean the aspects that both Elaine & Autumn performed their jobs but also the professionalism that they each exhibited.  If we could rate Elaine & Autumn as their professional care for our home----we would rate them at 10-Stars apiece.  Thank you ladies!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111555894926970126022", "name": "corina arrington", "time": 1623418132319, "rating": 5.0, "text": "I just wanna say Brooklyn Adams that works there is the best so sweet and caring. She takes her job very seriously. I would highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104258962493155596183", "name": "Christina Strong", "time": 1623692863331, "rating": 5.0, "text": "This is by far the ABSOLUTE BEST maid service I received.   The cleaned much more than expected.   Professional great job on house. Thank you", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105846064726786494395", "name": "Mindy O'Brien", "time": 1626289772389, "rating": 5.0, "text": "What a great job! Two deep cleans and twice a month service that I couldn’t be happier with.  They show up on time every time and do a consistently great job! Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106290963539833159120", "name": "Judith White", "time": 1621549958136, "rating": 5.0, "text": "I am so happy with the deep clean services I got from Elaine and Candice! I’m so impressed with how well they cleaned everything, and their communication about our preferences for different parts of the house. I highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114285930757038286817", "name": "Lisa Horwitz", "time": 1621461759588, "rating": 5.0, "text": "WOW!! We recently moved to Auburn and had been looking for someone to clean our house. We had a couple experiences with other services that we did not want to repeat. And then WOW!! Heidi and Sabrina cleaned our house today and we could not be happier!! They did an outstanding job, they were very helpful and just very nice!! I am thrilled that we found Two Maids & A Mop and that they sent Heidi and Sabrina!!", "pics": null, "resp": {"time": 1621525958462, "text": "Lisa, we appreciate you taking the time to let us know how happy you were with your experience.  We are excited to have you a part of the Two Maids family!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101672768309386681133", "name": "Kimberly Greer", "time": 1623273846496, "rating": 5.0, "text": "Team #7 did an outstanding job with cleaning my home. I would highly recommend Two Maids and a Mop, especially Elaine and Kamisha. ❤️", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100943788639480387745", "name": "luis pinzon", "time": 1623505783042, "rating": 5.0, "text": "team 8 was great, really good cleaning and a great team overall. would highly recommend it o friends and family if they need their homes cleaned.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110136698080114110049", "name": "Darryl Jacksson", "time": 1623316592458, "rating": 5.0, "text": "The staff kimeshia and Elaine did a great job cleaning my house and they were very professional. I would recommend their service to everyone", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107649153910710434258", "name": "Sharee Hutchins", "time": 1623271445477, "rating": 5.0, "text": "I needed someone very last minute and someone suggested Donna here at this establishment. And I must say, WOW! She was wonderful and super sweet! Great job, Donna!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100685178604644121805", "name": "Itss Jaylaaa", "time": 1623276279336, "rating": 5.0, "text": "Team 7 did an awesome job today cleaning my home. I would  highly recommend Two maids for all your cleaning needs .", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112827891193045112894", "name": "bridgette marshall", "time": 1623437420901, "rating": 5.0, "text": "Thank you Madison and Shontia for an awesome job you guys did to my home. Highly recommended for these two ladies\nThanks again\nSee you guys soon", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100501412901417478794", "name": "Kathrine Ware", "time": 1621617011979, "rating": 5.0, "text": "Two Maids and a Mop Auburn sent a deep cleaning crew of Lisa, Kailey and Keyia to help at my mother law’s house after we completed a major decluttering project. They were professional, hard working and completed the job timely and as promised. They exceeded our expectations! The home is a classic cabin with an addition that presents a challenge for cleaning given the high ceilings, many windows, painted sills, blinds, baseboards, older appliances and fixtures etc etc etc. They were definitely up for the challenge and we highly recommend them! We look forward to seeing them again when they return for regular maintenance cleaning which we have already scheduled.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109164595871815974818", "name": "Demetria Jackson", "time": 1623534639926, "rating": 5.0, "text": "Kimesha and Elaine did an amazing job on cleaning my summer home. I highly recommend these ladies very kind and professional!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110497412207041763936", "name": "Quanevius Marshall", "time": 1623435646434, "rating": 5.0, "text": "Thanks to  Shontia & Madison I have a nice clean house and office. They did a wonderful job I highly recommend them to you all.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109892483303184257747", "name": "Charles Bowman", "time": 1623265669079, "rating": 5.0, "text": "Team 3 ) Donna's Team of Ladies do  the Best Job cleaning our home! Definitely would recommend using the cleaning service if you need one you can trust do a professional job right !!🙂", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107519896425554830457", "name": "Renee White", "time": 1625182923479, "rating": 5.0, "text": "I was in a bit of a pickle today and had made a bigger mess trying to get my house together.  after I got overwhelmed I called these girls and asked when the soonest available time was and they were here within the hour.  came home and was less overwhelmed. thanks so much for helping so quickly today.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116248002019150734477", "name": "Call me Jamie", "time": 1623440139846, "rating": 5.0, "text": "Great experience and very thorough. Team 8 was amazing! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114902849575971036419", "name": "Danielle Gunn", "time": 1620836383492, "rating": 5.0, "text": "I will definitely be using this service again. Kimesha and Kaylie were so sweet And went above and beyond for me. I had a few things on a list that I for sure wanted clean but they did that and more! It was greatly appreciated.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107990712032743809544", "name": "Hayli Rodriguez", "time": 1615997227259, "rating": 5.0, "text": "This was out of my comfort zone, I have never used a cleaning service before for my home. But Sabrina and Heidi made sure it was the best experience for me! Super excited to continue doing business with them! They did an amazing job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109254436853555265501", "name": "marquese davison", "time": 1623264175130, "rating": 5.0, "text": "Team 5 is great I’ve used the for lots of construction clean up and I couldn’t be happier. Awesome team", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105475472690525082297", "name": "Jasonisnice", "time": 1623439485996, "rating": 5.0, "text": "Team 8 does a wonderful job cleaning, i would recommended the company to everyone! Great people 👌🏻", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107634371129957624915", "name": "Jennifer Justice", "time": 1614718477240, "rating": 5.0, "text": "I loved walking into my super clean house yesterday. Melissa and Whitney did a fantastic job cleaning!!! They were extremely nice and professional. Thank you for a great job!!! My house no longer smells like a dog 🤣🤣🤣", "pics": null, "resp": {"time": 1614784398841, "text": "We love making our customers happy.  Thank you for letting us clean your home Jennifer."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110170861008273550654", "name": "Brent Cofield", "time": 1623357314054, "rating": 5.0, "text": "Kayli and destiny done an outstanding job at cleaning my house! I recommend these two for all your cleaning needs!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117433554903994026603", "name": "Karman Brown", "time": 1616079837983, "rating": 5.0, "text": "Sabrina and Heidi did a move out clean for your apartment, and I was impressed..the place smelled great and they went above and beyond! Those ladies did a wonderful job. Would recommend 100 percent, you won't regret it! 😉", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103107520563784393334", "name": "Katelyn Smith", "time": 1616257315500, "rating": 5.0, "text": "These ladies did a FANTASTIC job. My house has not been this clean since we moved in!! I could not be happier with the outcome! I will definitely be a repeat customer and will be recommending to ALL of my friends in the area!! 10/10!! Excellent job! 🤩", "pics": null, "resp": {"time": 1616333694746, "text": "Thank you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106451007687919611420", "name": "Christy Nason", "time": 1625681350362, "rating": 5.0, "text": "Team 9 is awesome. Thank you for the fast and friendly service. Excellent work.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110662094616904762681", "name": "luke merrett", "time": 1623454798611, "rating": 5.0, "text": "Team 8 does a great job and very professional! This service is great and i would highly recommend it to everyone.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110236671215672561743", "name": "Charles Bomn", "time": 1623266657254, "rating": 5.0, "text": "Donna's Team (3 ) Does a  Wonderful  Job cleaning our home every week! Definitely Recommend!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112385434017628249575", "name": "Jiyoon Lee", "time": 1626671961915, "rating": 5.0, "text": "Team 3 is awesome!\nThe whole house is so fresh and clean !!!  Excellent service :)\nThank you Team 3 !", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106759238298501844500", "name": "brandon jones", "time": 1623294158102, "rating": 5.0, "text": "…Team 7 did a great job cleaning my home!  Definitely welcome recommend Team 7.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117319404146006922162", "name": "Betty Vines", "time": 1623277131056, "rating": 5.0, "text": "After a long day at work .I arrived home to a spotless home.Team 7 Elaine and Kimesha did a great job cleaning my home", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117303555349562459899", "name": "Joel Markgraf", "time": 1623443668895, "rating": 5.0, "text": "Thanks to Lisa and Ro! Great cleaning! Will definitely call again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106237641595632451797", "name": "Aimee Thrower", "time": 1623271155650, "rating": 5.0, "text": "Donna is the best and knows what she is doing when it comes to cleanliness!! Definitely out done her self on my home !!! Great work thank you", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113035769427217634987", "name": "Ren Mil", "time": 1623264531385, "rating": 5.0, "text": "Got my first cleaning from Two Miads and a Mop and it was AMAZING! Team 5 did a fantastic job!! Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105603117735448135955", "name": "Jenny H", "time": 1625626021348, "rating": 1.0, "text": "I’ve booked online for deep clean before they start recurring cleaning service. Three cleaning ladies came and they blocked the indoor security camera with their purse while they were cleaning 2nd floor. They didn’t clean windows and blinds. They didn’t block security camera in the kitchen. They only did spraying degreaser on the countertops and clean cabinet doors.\nI didn’t pay $676 for wiping the countertops, moping floors and cleaning bathrooms. They scrubbed the shower head in master bathroom and got damaged.\nSo disappointed. I’ve contacted and they said it is sheetrock dust on my windows and needs several cleanings. Doesn’t make sense at all because I saw dust on all windows and blinds a hour after they cleaned.\nNever recommend to anyone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMna7xzN58D-EySL99SX8RxIPf9jW2_26-sjC_k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdbFmzA31kzVJKs61KaZaRtlt8_VdWo06_ee_a=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJqx6IKfL5Mes2pfGtASJh7MRNo1yVnOC-bl-X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIveN3rMmt0sUejyJrwJUJNRcoqzXiJp-IdVPW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNNJSwGptvZyXikpBUUgsocnPnjtfn2neTOXjfV=w150-h150-k-no-p"]}], "resp": {"time": 1625753540189, "text": "Thanks for the feedback Jenny.  We acknowledge there is a small percentage of folks we just cannot make happy.  You fall in the small percentage.  Is unfortunate but a reality.   All the best."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115910538759151309387", "name": "Cyndi Parker", "time": 1623367607003, "rating": 5.0, "text": "Kayli and destiny are a team and done a great job. I would definitely recommend these two .", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115036948315596134868", "name": "Hyatt Higginbotham", "time": 1616095918106, "rating": 5.0, "text": "I was very pleased with the deep clean that I received in my apartment. The maids named Autumn, Whitney, and Kimesha were very professional and even offered to come in earlier then planned which worked great for my class schedule. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111395099916559220681", "name": "Elander Moss", "time": 1623330448714, "rating": 5.0, "text": "The girls did a great job especially with deep cleaning. Thank you destiny and team two", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104000710284523906376", "name": "Quanesha Presley", "time": 1623274757514, "rating": 5.0, "text": "Team 7 especially Elaine and Kamesha did a wonderful job leaving my home spottless clean. Thank you", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104991249898354917641", "name": "Landon Long", "time": 1623257783167, "rating": 5.0, "text": "Larae and Alex cleaned our home and did a fantastic job!! I will definitely be using them again!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115381762285427738398", "name": "Bonnie Bryan", "time": 1620461326128, "rating": 5.0, "text": "These ladies came in and went to work!! They did a great job and were very personable! I will  definitely be using them again !! Thank you ladies for a job well done !", "pics": null, "resp": {"time": 1620599409261, "text": "We love our PHCs!  Thank you for letting us know about your clean!!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110632932237198985274", "name": "Jonathan Lowery", "time": 1619713223287, "rating": 5.0, "text": "Good day! Whitney, Kayla, & Destiny did a phenomenal job! They were kind, professional, & very courteous. I definitely recommend these individuals - as well as Two Maids Auburn service overall - to everyone! 😊✨", "pics": null, "resp": {"time": 1619730444786, "text": "Thank you Jonathan.  We love to hear you had a great experience."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117988237487930828417", "name": "Carol Ech", "time": 1606326069457, "rating": 5.0, "text": "First time experience with Two Maids, or any maid/cleaning service as a matter of fact. I have high expectations for cleaning standards and have trouble letting others do it. I did the paid time option since I didn't need the bedrooms cleaned and chose 2 hours. In 2 hours they did an outstanding job and got everything on my to do priority list except for one item (done partially, ran out of time) which was bonus if they got to it. They left everything cleaned, they cleaned thoroughly and not just around stuff, plus they placed everything back where it was. I'm thoroughly surprised and did not expect them to be able to meet my standard. Donna, Elaine and a third maid (I suspect she was in training) were a dream. Respectful, nice, cordial, thorough and very hard workers. Great communication too to ensure I was satisfied with the work.", "pics": null, "resp": {"time": 1606345475277, "text": "Thank you for the review Carol.  Our PHCs work hard to provide great service."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101451593923556516596", "name": "Chandler McCrory", "time": 1616003367652, "rating": 5.0, "text": "Thank goodness for Larae and Alex from Two Maids & A Mop! I am always on the go so house cleaning is always last on the list. They came in and cleaned everything from top to bottom. I highly recommended this crew for you cleaning needs. Sweetest girls EVER and very professional!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117128971602376430817", "name": "Anaidra Reese", "time": 1617214209209, "rating": 5.0, "text": "Team 4 of Two Maids & A Mop of Auburn did an amazing job! They were personable, timely, and efficient. They even made the beds !! Overall a great job! Would recommend everyone to use them.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114800314772973425493", "name": "Autumn Frederick", "time": 1604166744828, "rating": 5.0, "text": "The girls were so nice and listened to everything I needed to tell them about the house before I left and they followed those instructions. They were also great for answering any questions I had about the process. They wore masks while they cleaned, so no worries for anyone concerned about COVID-19. The house looked and smelled great when I came home. There were a few spots the mop didn't clean in the kitchen and the rug in the master had a little debris, but the other rugs were spotless. Overall, the house is perfect and we are all happy with the work that was done. Best of all, we didn't have to do it. So glad we had such a good team for our first experience with Two Maids and a Mop.", "pics": null, "resp": {"time": 1604241725617, "text": "Thank you for your feedback Autumn.  Our goal is always to make our customer's lives easier."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108892887444190088144", "name": "Joshua Strong", "time": 1623257961971, "rating": 5.0, "text": "Larae and Alex cleaned my home they did a great job, I am going to request them again on our next cleaning. They were very professional and showed up on time.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106234480043382465484", "name": "Davida Willis", "time": 1623257321749, "rating": 5.0, "text": "Alex and her team member La’Rae did an awesome job cleaning my home. Go team 5 !!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106416557316530768222", "name": "Kaysen Hearn", "time": 1624297706540, "rating": 5.0, "text": "Rolasha,Larae, and Alex did amazing! Totally recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113200540528742179102", "name": "Jennifer Spencer", "time": 1619303427634, "rating": 5.0, "text": "Donna and Sunny did a great job. Everything looked and smelled clean. I was home when they got here and they were personable and easy to talk to.  We have been using Two Maids for over a year and this team was awesome!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108812347179384654115", "name": "Amanda Mcspadden", "time": 1622573594436, "rating": 5.0, "text": "Staff is very friendly and professional. Great job cleaning my house! I am glad I chose to go with this cleaning service.", "pics": null, "resp": {"time": 1622649158019, "text": "Thank you Amanda.  We appreciate you taking the time to let us know about the service you received.  We're glad you chose us too!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106806281292298657212", "name": "Tamara Bowden", "time": 1609682935929, "rating": 5.0, "text": "Great!  Heidi and Sabrina were wonderful.  I was moving out of my house and could literally not done it without them.  Each detail for the most part was perfect and they executed their job with thoroughness and excellence.  I encourage anyone looking for a deep clean, a move-out cleaning or a regular cleaning to use Two Maids and a Mop today!", "pics": null, "resp": {"time": 1609770964165, "text": "Thank you Tamara!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105111395101957278071", "name": "Melissa Cupit", "time": 1617824708279, "rating": 5.0, "text": "Two Maids did an OUTSTANDING job!!! Unbelievable how well they did. They cleaned things I had not even thought about for a while. Very professional and will DEFINETLY use them again. Marissa, Emily, and Jada, thank you for your hard work!!", "pics": null, "resp": {"time": 1617897666452, "text": "Thank you so much!  We love exceeding our customer's expectations."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100351839089093359105", "name": "Keirsten leigh ward", "time": 1623265509359, "rating": 5.0, "text": "Team 5 laray and Alex did an amazing job last week on my house!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111454237239084213491", "name": "Chris Dar", "time": 1618870371867, "rating": 5.0, "text": "Shontia and Madison did a great job cleaning our home. They were on time, professional and friendly. It was a great experience all around.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112402889105216954003", "name": "Mauri-Batik Hamilton", "time": 1613589796333, "rating": 5.0, "text": "I purchased a deep cleaning as a kickoff to a stress free Valentine's Day weekend and Two Maids Auburn did an amazing job. They were thorough and nice and the look on my wife's face when she returned home from a hard day at work to a sparkling clean house was priceless. Thank you!!", "pics": null, "resp": {"time": 1613759626064, "text": "We are glad you and your wife were pleased with the cleaning and had a Happy Valentine's Day!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100393386705169092775", "name": "Lulu & Kae Mobb", "time": 1616100628974, "rating": 5.0, "text": "Donna, Sukayla, and Skylar did an awesome job on cleaning my house. I would recommend these three women at anytime! Keep up the good work ladies.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104685701358128451450", "name": "Miranda King", "time": 1615051237552, "rating": 5.0, "text": "Great first experience. Melissa and Whitney were very thorough, efficient, and courteous. They were in and out and my house looks and feels very clean! I’m looking forward to my next appointment.", "pics": null, "resp": {"time": 1615082969744, "text": "Thank you for letting us clean for you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100758305495476165091", "name": "Carole Swendrowski", "time": 1621098832572, "rating": 5.0, "text": "The ladies that came this month did an excellent job! They were fast and efficient!", "pics": null, "resp": {"time": 1611941272549, "text": "Thank you Carole!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101250556680717282327", "name": "William Holman", "time": 1616020411145, "rating": 5.0, "text": "If you need any cleaning done at your place I would highly recommend Heidi and Sabrina both are very good at what they do and very friendly people. 5 stars!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106600233024987695232", "name": "Joi Williams", "time": 1616084110582, "rating": 5.0, "text": "Sukayla, Donna, and Sky left my home SPOTLESS! They were very respectful and professional. I’m scheduling another cleaning as I write this! would 100% recommend them!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101429469878280305620", "name": "Jonathan Wells", "time": 1623453823885, "rating": 5.0, "text": "Team 8 is very professional and I would highly recommend their services to anyone!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106842167761192940225", "name": "kim young", "time": 1623264371215, "rating": 5.0, "text": "I am giving team 3 a good review because they do\nan excellent job!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108557654307247005750", "name": "Gary Tyson", "time": 1623333756655, "rating": 5.0, "text": "Kayli and destiny are amazing!! They did the best clean I’ve seen in a long time!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101098112885810357612", "name": "Ronald Russell", "time": 1618417148667, "rating": 5.0, "text": "Donna and Candice did an excellent job!! We are extremely pleased with their work. Will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111266557879304476959", "name": "Terilyn Reber", "time": 1613266403348, "rating": 5.0, "text": "I am so glad that I found two maids and a mop. I am prepping my parents house for sale and I don't live in the area I don't even live in the state. And I was having trouble finding reliable contractors for other types of work and I figured I'd have the same thing with the final cleanup people. But they did a bang up job! Absolute perfection considering what they had to work with in that house. Thank you thank you thank you to maids in a map. I'll recommend you to anybody please put me down as a reference for any new customers you pick up.", "pics": null, "resp": {"time": 1613759677522, "text": "We love being able to help our customers any way we can.  Thank you for trusting us Terilyn."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106470073032596594314", "name": "Alexandria Champagne", "time": 1615996366932, "rating": 5.0, "text": "Heidi and Sabrina did a deep clean on my house. i am so impressed with how clean it was and how friendly and nice they were ! i will definitely be using Two maids again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113015705305241648262", "name": "Rodrick Coleman", "time": 1623444848001, "rating": 4.0, "text": "Glad I called Two maids and a mop to deep clean my office and I was kind of skeptical but I am glad they didn’t let me down my office is clean and smells amazing I can’t wait to see my customers smile once they walk in because I’m in love thanks to Madison and Shontia I highly recommend calling them", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112099590346506619682", "name": "Lindsay Rae Taylor", "time": 1614266264198, "rating": 5.0, "text": "Our house is cleaner than ever before. Madison and Shantia did such a thorough, beautiful job, and we will definitely call Two Maids and a Mop the next time we need a deep clean. We highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105940775257593279669", "name": "Jack Hill", "time": 1623282606251, "rating": 5.0, "text": "Team 3 was highly proficient and well mannered would recommend again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112257783299384535032", "name": "Susan Fureigh", "time": 1613700207886, "rating": 5.0, "text": "Donna and Sunny did such an amazing deep clean for us yesterday! No detail was missed, everything was sparkling! They are so professional, but also so personable and pleasant!", "pics": null, "resp": {"time": 1613759561272, "text": "Thank you for trusting us with your home Susan."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105401708198467042012", "name": "Jacob Drescher", "time": 1613237063075, "rating": 5.0, "text": "This was our first time using Two Maids & A Mop! Easy process from setup and scheduling to the cleaning! Sabrina and Heidi did a great job. Look forward to working with them in the future.", "pics": null, "resp": {"time": 1613759719468, "text": "We always strive to make our customer's lives, and the process, easier."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115195576150458407504", "name": "Ryan Ferry", "time": 1616074276373, "rating": 5.0, "text": "Sky, Donna, Kimesha, and Kayla did a wonderful job! I am very pleased with how well ya’ll did! Definitely going to use two maids and a mop for any of my cleaning needs again! And definitely 5 stars!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103877497448228818985", "name": "Jenn Aspinwall", "time": 1615925637456, "rating": 5.0, "text": "The deep clean we got with Two Maids & A Mop was just what we needed. Everything looks brand new! Donna, Kimesha, & Sky did an amazing job.", "pics": null, "resp": {"time": 1615927482581, "text": "Thank you for letting us clean your home!  We are so glad you are happy with the results."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100107369828751207175", "name": "Naomi Rigby", "time": 1609339423795, "rating": 4.0, "text": "First - let me say - I have VERY high expectations when paying someone to clean my house...\nNow, let me say...\nI WOULD recommend Two Maids and a Mop (Auburn) - only because of Whitney and Melissa!!!\nTwo weeks ago - yesterday, Two Maids and a Mop (Auburn) came to my house for a thorough cleaning.  After leaving, unfortunately, I was unimpressed, but because we all have \"bad days\", my first instinct was to give them another chance.\nThe day of my follow-up cleaning (2 weeks later), I sent a text to confirm my appt time - since I did not receive a text reminder - like I did for the initial cleaning.  After a short time had past, with no reply, I called and spoke to Chrissy.  Although I did not call to complain, I did mention that I was not satisfied with my first cleaning - and why, but explained that - because everyone has bad days - I was waiting for this cleaning to see how things went.  I must say, once on the phone, Chrissy was very responsive and willing to make everything right.\nNow to the GOOD stuff...  Whitney and Melissa.  These 2 ladies are THE BOMB!  They came in - WORKED HARD, and had my house \"sparkling\" when they left - so much so - that upon their departure, I immediately sent  Chrissy another text message - PRAISING their work and asking to have these 2 young ladies clean my house from now on.  (Sadly - I am still awaiting a response.)\nIt is women like Whitney and Melissa who make a business look - not just good - but impeccable!!!! - and all the bad bearable.  (Two Maids and a Mop - Auburn needs to do all they can do to keep these 2 ladies happy and working for them!)\nI sincerely hope I hear back from Chrissy soon - saying - yes to my request. 😀", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109921341908335664512", "name": "jamilah page", "time": 1606774822342, "rating": 5.0, "text": "Amazing! Fast and reliable. Whitney and Melissa are top tier. They came in and started immediately. It took them a little over an hour and our condo looked like a magazine cover. Thoroughly impressed. I will be calling them again. No doubt.", "pics": null, "resp": {"time": 1611941520773, "text": "Thanks Jamilah!  Our ladies work hard to take care of their customers and their homes.  Thank you for choosing us."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118347727974452944456", "name": "Barbara Daron", "time": 1622737582622, "rating": 5.0, "text": "Wonderful service! Polite and patient employees! Extremely pleased!", "pics": null, "resp": {"time": 1620420117074, "text": "We love hearing about your experience.  Thank you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112773310163629756691", "name": "Brandon Anderson", "time": 1623456010443, "rating": 5.0, "text": "Team 8 is the best! Highly recommend using them!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100031433452005143387", "name": "Devon Klotz-macdonald", "time": 1616020976077, "rating": 5.0, "text": "Sabrina and Heidi cleaned my apartment.  I'm so impressed with them! Will definitely be booking another cleaning with them !!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105550834055771951917", "name": "Mary Skelton", "time": 1617077646022, "rating": 5.0, "text": "sabrina and heidi were amazing! 100% recommend! thank u so much!! trusted them in my house and hard working", "pics": null, "resp": {"time": 1617113763490, "text": "Thank you Ms. Skelton.  Our PHCs work hard to make their customers happy."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100675142579319069398", "name": "Elaine Manning", "time": 1628012354182, "rating": 5.0, "text": "The maids did a great job!  They were prompt, courteous, and did an awesome job with the clean.  Would welcome them back anytime!", "pics": null, "resp": {"time": 1609772058967, "text": "Thank you for letting us clean your home."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108860725979314758155", "name": "William Snyder", "time": 1616717400448, "rating": 5.0, "text": "The two ladies were ver professional and did an excellent job! We will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106888773664946256495", "name": "Patrick Ratliff", "time": 1609695602591, "rating": 5.0, "text": "We had a great experience with Two Maids and a Mop. Whitney and Melissa did an outstanding job! We booked last minute, around the holidays, and didn’t have trouble getting an appointment. They went above and beyond cleaning out house and left it in fantastic shape. Did everything we asked and more. Thank you!", "pics": null, "resp": {"time": 1609770919331, "text": "Thank you for your review Patrick.  Our PHCs take great pride in the work they do.  We love making our customers happy!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116410509867445563412", "name": "Jamie Adkins", "time": 1616010115326, "rating": 5.0, "text": "Heidi and Sabrina did such an amazing and efficient deep clean at my home, I would definitely recommend them thank you for such a comforting experience!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103212169625340444797", "name": "Julie Rhodes", "time": 1599071213898, "rating": 5.0, "text": "What a blessing!  3 wonderful young ladies came today to do a deep clean on my home and what a great experience.  They were very detailed with the clean but also efficient.  Our home has never been this clean and I call myself a \"clean freak\"!   Definitely will be having this service every 2 weeks.  So excited to find a great service!", "pics": null, "resp": {"time": 1599140247811, "text": "Julie,  we look forward to delivering you great results every time!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117738988864844466443", "name": "Nubby Power", "time": 1616020453071, "rating": 5.0, "text": "Kayli and Abbie done a marvelous job on cleaning my house! Would definitely recommend these two or anyone from two maids!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112617542139214337461", "name": "Jenny Will the Varsity exhibition be up as well?", "time": 1611258259942, "rating": 5.0, "text": "Always a good experience. The girls are great and are willing to pay special attention to something when necessary. We’ve had them since early fall and are extremely happy.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113988334450752926034", "name": "Patti West", "time": 1622046783049, "rating": 5.0, "text": "Excellent service, polite and efficient workers. I would hire them again.", "pics": null, "resp": {"time": 1622057253064, "text": "Thank you Patti."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108917540647335066385", "name": "Mary Doiron", "time": 1615926837230, "rating": 5.0, "text": "It was so nice to come home to a clean house.  All employees I interacted with were professional and responsive.  Will be using this service again!", "pics": null, "resp": {"time": 1616082901780, "text": "Thank you Mary."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113322466318058108685", "name": "TONIYA COLLIER", "time": 1623277777843, "rating": 5.0, "text": "team 7 did a great job cleaning our home", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113650915121764149186", "name": "Brenda Johnson", "time": 1628216274104, "rating": 5.0, "text": "Madison and Shontia do their thing and I stay out of their way..  My house Smiles when they’re done.\nSee you guys next month😊 I have to keep saying the same thing about Madison and Shontia, they know how to clean, and they’re genuinely polite.  They are definitely keepers.  Thanks Ladies, see you next month🙏🏽And thanks to, 2 Maids of Auburn", "pics": null, "resp": {"time": 1604189746707, "text": "We love it when a house smiles!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102917366224737453211", "name": "Pelham Torbert", "time": 1616112441723, "rating": 5.0, "text": "Sky, donna , and kayla did such a good job! The house looks terrific,  thank you guys so much . Keep up the good work ! And keep that work ethic", "pics": null, "resp": {"time": 1616333608928, "text": "We love hearing from our customers.  Thanks for the encouragement."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115552758868826062088", "name": "Rick Givens", "time": 1595620699200, "rating": 4.0, "text": "Trying to find a house cleaning service is a challenge when so many don't even have a clue and some many folks don't know what clean really is.  I found the service on the internet and as you can imagine its a franchise service run by a very responsible owner. The House is new and did not even have blinds in it to two days before they showed up.  The house has two adults and no pets or animals.  It took no time and was cleaned well but as you can imagine it was not in rough shape.  They did a great job and we look forward to their return. We moved from Atlanta to Auburn and loved our maid service so we have high expectations. I believe as we go forward the ladies work will be evaluated much better.\n\nFor now just hire them cause they did do the best job of anyone we have used or reviewed in the area!", "pics": null, "resp": {"time": 1596413695998, "text": "Thanks Rick.  We look forward to exceeding your expectations."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110140815220143029351", "name": "Beverly Ogburn", "time": 1613056861729, "rating": 4.0, "text": "Great job Ladies! They must use some kind of magic potion cleaning products - my floors and showers are sparkling!! Thanks!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104851166147273169952", "name": "Samantha Mothershed", "time": 1616084009179, "rating": 5.0, "text": "Thanks again, Whitney, Autumn, and Kamisha! These ladies did an outstanding job! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105287710203580343286", "name": "abigail nailer", "time": 1616071114092, "rating": 5.0, "text": "Thank you to Larae and Alex they did a wonderful job cleaning my house !! My house has never looked so clean !!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105659011095905306734", "name": "Christy Giles", "time": 1616104451841, "rating": 5.0, "text": "TeShaundra did an amazing job with cleaning my house. Keep up the good work!", "pics": null, "resp": {"time": 1616333548175, "text": "Thank you Christy!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116825854785176401904", "name": "Anfernee Bullard (TubaDottENT2)", "time": 1623275236736, "rating": 5.0, "text": "Ms Elaine and kimesha left my office cleaner thann beforehand", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116403104898522983499", "name": "William Reeves", "time": 1595000033052, "rating": 5.0, "text": "Donna and her crew (Melissa & Abbie) arrived at home with their masks own. Donna are her crew have been cleaning our home every two weeks for months now and I always look forward to the cleaning knowing that Donna is in charge.  She is such a kind person, she gloats over our dog Dutch so I never have to worry how our pet is being treated. Donna is a meticulous cleaner, respectful manners, does a great job on the hard to reach places in our home, especially in the bathrooms and showers. Melissa and Abbie were excellent too they all worked together as a TEAM...Thanks so much, Bill Reeves", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114116805529592659911", "name": "Phyllis Payne", "time": 1612367773591, "rating": 5.0, "text": "Abbie and Kayli are professional, knowledgeable, and very friendly. My house is spotless after they leave. I highly recommend 2 Maids and a Mop.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101372449244754906302", "name": "Chloe Cofield", "time": 1616088583323, "rating": 5.0, "text": "Amazing service! Whitney Hadaway and Autumn Kimsha were great! Definitely recommending!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105568379818216393776", "name": "Dyl", "time": 1616088597443, "rating": 5.0, "text": "Thank you heidi and sabrina for the cleaning it was very much needed,impressed with how quick you guys finished! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111734333947230824562", "name": "Becky Edwards", "time": 1606333708970, "rating": 5.0, "text": "We have been using Two Maids and a Mop (Sabrina/Heidi) for over a year and have been very pleased with everything they have provided!  They are always professional and friendly!  Our home is always clean and fresh when they are done!  Thank you for all you do!", "pics": null, "resp": {"time": 1606691288529, "text": "Thank you Becky for your review.  We always look forward to coming to your home."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101183591665045419841", "name": "Jennifer Senn", "time": 1623451901453, "rating": 5.0, "text": "Highly recommend, team 8 does a wonderful job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116359753498081350634", "name": "Cindy Danley", "time": 1603559568694, "rating": 5.0, "text": "I was completely blown away by the level of service I received from start to finish. The minute I received the call back on my inquiry I had a good amount of confidence in the service. Then when the two young women came to clean I was 100% happy with their performance! Thanks again for your help!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113074442964011348112", "name": "Lia L", "time": 1596219985194, "rating": 5.0, "text": "Abbie and Caitlin did a fantastic job cleaning the unit I moved into. Even with a bunch of boxes and furniture, they were able to make it work and get the place looking nice again! Chrissy (the manager) was professional and made sure things were taken care of. Overall I am very happy I chose to use this company!", "pics": null, "resp": {"time": 1596413787321, "text": "Thanks Lia.  We love to hear good things!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105363901875215075377", "name": "Karen Nix", "time": 1611672667744, "rating": 5.0, "text": "I enjoy doing business with Two Maids and a Mop.  Sabrina and Heidi are my favorite cleaning duo!  They do their best quickly and are always so kind.  I appreciate them very much.  Thanks, Karen Nix.", "pics": null, "resp": {"time": 1609772174889, "text": "Thank you for your business Karen.  We love Heidi and Sabrina too!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110749339423523812859", "name": "Mary nix", "time": 1614273604413, "rating": 5.0, "text": "It was great! The girls were so nice and did a WONDERFUL job cleaning my home!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116653131411410943519", "name": "Deborah Junker", "time": 1609569303708, "rating": 5.0, "text": "I left a note for Heidi and Sabrina, I was not there when they arrived,  and they did a perfect job. These ladies are great- they are super trustworthy and do a great job. I can’t say enough good things about them.", "pics": null, "resp": {"time": 1605902931832, "text": "Thank you Deborah.  We love hearing from our customers!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113781004582755039628", "name": "Gail Riese", "time": 1616261150096, "rating": 5.0, "text": "Our ladies did a fabulous job! They were meticulous, professional, and very knowledgeable about cleaning and disinfecting!!", "pics": null, "resp": {"time": 1616333710539, "text": "Our PHCs know their stuff!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111654608889008803744", "name": "Lisa White", "time": 1613774728707, "rating": 5.0, "text": "Whitney and Melissa did a great job cleaning our home! We definitely want them again!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111802740873527325723", "name": "Shannon Anway", "time": 1607038074652, "rating": 1.0, "text": "I was never informed the deep cleaning would cost $400 dollars, but was charged $400. To clarify, when I entered the information online I was given the price of $140 dollars. I THEN spoke with a representative of the company who clarified the first clean would be a deep clean, but never stated this would result in a higher cost. I was completely misled to believe my fee would be the $140 versus almost $400. When I called to discuss they could not give me a rational for why the price was as expensive as it was and accused me of lying on the internet submission regarding occupancy and square footage even though I told the woman I spoke to on the phone I lived with my boyfriend and two dogs. Completely unprofessional, dishonest and clearly have poor business ethics. Additionally, when I informed them I’ve used cleaning services for a number of years and have never been charged that much for an initial clean (and told them the name of the company I had used in my previous rental), they eluded to the fact that the company in question was not professional or a legitimate business. Who speaks of competitors that way? Would never recommend and would give zero stars if possible.", "pics": null, "resp": {"time": 1607034688549, "text": "Shannon thanks for your feedback.  As I understand you booked your clean online.  There is some expectation that folks who enter data requested for booking online will provided accurate data.  When booking online you indicated you had 0 pets, 1 occupant, and your square footage was 2200.   My understanding is you have 2 occupants and 2 pets per your phone conversation.    Your clean was actually discounted based on less occupants and no pets.\n\nMy understanding is you had no issues with the service other than price.  Hard to address what you heard or did not hear during the call with our office as it relates to price.  We certainly try to communicate price as part of any booking but your reaction indicates you did not hear it or we failed to communicate it.\n\nLastly, based on your call your position was discount or negative reviews.  Unfortunately we do run into this situation 1 or 2 times per year.   Certainly don't like failing to meet your expectations, but will not be coerced into discounts by threats either.  You bear some responsibility to understand the services you have secured. This would certainly be an exception for one of our customers to invite us into their home to clean and not know what services they will receive and what they will cost.\n\nAny desire to discuss further just call the office and let Chrissy know you want to chat with the owner and she will put us in touch."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107026346900537814565", "name": "Donna Birkhead", "time": 1601911427701, "rating": 5.0, "text": "Very pleased with Donna, Shontia & Kaci today. They arrived on time ready to clean. Pleasant and wanting to please. My house was very clean and even smelled clean. The kitchen, baths and all floors were shining. Thank you for a job well done!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100492544995122325792", "name": "Kimberly Potter", "time": 1611427572791, "rating": 5.0, "text": "The ladies did a fabulous job! My bathrooms sparkled and my whole house felt so fresh and clean when they left. Very satisfied!!", "pics": null, "resp": {"time": 1611941323836, "text": "Kimberly, we love hearing how happy you were with our service."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103705984036489921526", "name": "Kimberly Tyson", "time": 1623333063613, "rating": 5.0, "text": "Kayli and destiny was amazing!! Couldn’t ask for better!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116235672533364361915", "name": "Bianca Williams", "time": 1622254918116, "rating": 5.0, "text": "Kayli and Kimesha did an awesome job on my move out cleaning and saved me so much time!", "pics": null, "resp": {"time": 1613759577739, "text": "Thank Bianca!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105936534608696318699", "name": "Connie King", "time": 1605912004512, "rating": 5.0, "text": "Highly recommend this cleaning service! From scheduling to day of cleaning the staff was friendly and efficient. Madison and Shonti arrived on time and was completely professional.  They cleaned magnificently!!!\nI will definitely be scheduling with them again!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107086908504559310788", "name": "Annette Brand", "time": 1605894401573, "rating": 5.0, "text": "I wasn't home because I'm in the hospital but my daughter was and she was very impressed with them. My personal experience was just making the appointment which was great. Very please and considering a weekly or biweekly plan.", "pics": null, "resp": {"time": 1605977167497, "text": "Thank you Annette.  We always want to make our customer's lives a bit easier."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109325390978013918749", "name": "V Hog", "time": 1607621486310, "rating": 5.0, "text": "They did a great job with how poor the house was at first! Very very happy. Would not hesitate to use again.", "pics": null, "resp": {"time": 1609772145850, "text": "We appreciate your feedback."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104678308460827830614", "name": "Wade Mezick", "time": 1616101777713, "rating": 5.0, "text": "Donna,Sky,Kayla did a wonderful job cleaning!! Would definitely recommend service !!", "pics": null, "resp": {"time": 1616333535154, "text": "Recommending our service is the best compliment we could receive!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100717134249414450287", "name": "Deborah Junker", "time": 1626484274311, "rating": 5.0, "text": "Heidi and Sabrina did a great job! Thanks ladies!", "pics": null, "resp": {"time": 1620599380095, "text": "Thank you for your review!  We love to hear good things."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107418082544930154293", "name": "Peter Henderson", "time": 1622945309591, "rating": 5.0, "text": "I have used this service for several months and I am exceptionally pleased with their work, their professionalism, and their great attitude. I plan to use this service indefinitely.", "pics": null, "resp": {"time": 1613759734701, "text": "Thank you Peter."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102265789442055211959", "name": "Scarlotte Vaughn", "time": 1612805109584, "rating": 5.0, "text": "Two Maids and a Mop were great! The ladies were in and out quickly and did everything I asked them to do!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100986866306571104647", "name": "Jess (evilgurl)", "time": 1616079833613, "rating": 5.0, "text": "Fantastic! Highly recommend Heidi and Sabrina for all your cleaning needs.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107831953305459296306", "name": "Elaine presley", "time": 1616106983939, "rating": 5.0, "text": "Team 7 did an awesome job tiday cleaning my house.", "pics": null, "resp": {"time": 1616333583255, "text": "Thank you for the review."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110051111082929734351", "name": "Camila Andrea", "time": 1613863437384, "rating": 5.0, "text": "I did a deep clean and I have been having them come over and clean my house weekly.\nI love their work, how personable they are, how comfortable it is to have them around, and everything always is very clean, organized and looks awesome", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102691261696849789541", "name": "Ashley Greenwood", "time": 1603982023405, "rating": 5.0, "text": "Madison and Shontia did a wonderful job deep cleaning my office today. Any issues or concerns I had they addressed them. I was worried about the floors and they moved EVERY chair (around 14 chairs) around our conference tables to properly sweep and mop under them. I always love when Two Maids comes!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117125855883493636586", "name": "Michael Teasley", "time": 1615996481388, "rating": 5.0, "text": "Heidi and Sabrina do a fabulous job  . Always satisfied with their services!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117042493637710760647", "name": "Caitlin Thorn", "time": 1599380635671, "rating": 5.0, "text": "Outstanding service! I had a very short notice move out clean. Two maids cleaned that day and under less than ideal conditions. Extremely responsive and top notch—would highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115288637506925326302", "name": "Jean Spicer", "time": 1620149462362, "rating": 5.0, "text": "They were excellent..very thorough, professional, and friendly!", "pics": null, "resp": {"time": 1620226137883, "text": "Thank You Jean!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115552455549791783187", "name": "Rachel Mullins", "time": 1618935839569, "rating": 5.0, "text": "As always Two Maids of Auburn were great to work with and did an outstanding job.", "pics": null, "resp": {"time": 1619017090750, "text": "Thanks Rachel!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114126814848666289364", "name": "Jacey Coffman vlogss", "time": 1623265200692, "rating": 5.0, "text": "Team 5 did an amazing job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103479774781127344583", "name": "M J", "time": 1605290559162, "rating": 5.0, "text": "Melissa and Whitney were absolutely amazing and I would 100% recommend 2 Maids again based on the job that they did today.  They were extremely thorough and cleaned the nooks and crannys that have been neglected for years. Thanks and hope to see yall again!", "pics": null, "resp": {"time": 1605372857297, "text": "We love to make our customers happy."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112201165734024458580", "name": "Amy Thomas", "time": 1596752698967, "rating": 5.0, "text": "They made my all-white interior shine again! We have two inside dogs and every surface just needed to be wiped and refreshed. They were on time and sent three- (surprise!) not two maids to get the job done. They went above and beyond, even cleaning my stairs when I only contracted them to do my first floor. Will be using them again!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115588440397301211629", "name": "Riley Heitschmidt", "time": 1596809192944, "rating": 5.0, "text": "My roommates and I hired two maids very last minutes to clean our new house. They came as soon as they could and did an incredible job. The two maids, Sabrina and Heidi, were very kind and helpful. Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106257586356448916469", "name": "Gloria Nicholson", "time": 1612045615244, "rating": 5.0, "text": "Heidi and Sabrina did a great job. Would use their services again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105652259315531803749", "name": "Donald Spinner", "time": 1613232823862, "rating": 5.0, "text": "Melissa and Whitney did a great job and spent more than the 2 hours expected, They were through on everything we asked for. We like them to come for next months cleaning.", "pics": null, "resp": {"time": 1604189942976, "text": "Thanks Donald.  It's great to hear our PHCS exceed expectations."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108203830921501968311", "name": "Michelle Alford", "time": 1592409162349, "rating": 4.0, "text": "The ladies, Christy, Madison and Patti, were great. They did a good job and were very pleasant. Everything looked and smelled clean when they were done. They were also very kind to my pets. I would definitely recommend 2 Maids & A Mop to anyone needing a good deep clean or weekly cleaning services. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107203218135820352561", "name": "Jason Hurst", "time": 1594332389355, "rating": 5.0, "text": "Donna has been coming to my home every two weeks for months and I always look forward to seeing her.  Such a kind person, a meticulous cleaner, eager to please with requests, sweet manners.  Abby and Beth who were new, I had no idea!  They were busy bees, asking lots of questions for accuracy.  Thanks so much, Sha Hurst", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117836304345676166297", "name": "Melanie Merrett'", "time": 1604508565103, "rating": 5.0, "text": "The service and the job they did was phenomenal. I can't say enough about how great they are. If you need your house cleaned, this is the place to go:)", "pics": null, "resp": {"time": 1604583570716, "text": "Thank you for your recommendation Elanie."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112548227542184532601", "name": "Steve Guice", "time": 1589562575112, "rating": 5.0, "text": "At first I was anxious about having the deep cleaning done because I had never had it done before. However, Chrissy was super to work with and was very reassuring and encouraging and put my mind at ease!  Christy, Alyssa and Kaitlyn went over and above the cleaning in my home, even staying an extra 2 hours to get it all done! I will definitely be calling Chrissy and 2 Maids and a Mop again!! I will recommend them to everyone!!!! They are the best!!!!!\nSteve", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102829082542427930325", "name": "Susie McGuire", "time": 1621802118376, "rating": 5.0, "text": "Heidi & Sabrina were professional, engaging & thorough", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103809649785562119075", "name": "Brittney Thaxton", "time": 1599239902130, "rating": 5.0, "text": "I had the top to bottom service and could not be more pleased! Ashley and Whitney did a great job! I will definitely call them again! I highly recommend Two Maids and a Mop of Auburn!", "pics": null, "resp": {"time": 1599325262292, "text": "Our PHCs work hard to make our customers happy."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109709507111461920353", "name": "misty carroll", "time": 1611788754399, "rating": 5.0, "text": "Very prompt and professional cleaners. Definitely willing to make sure you are pleased with the services rendered.", "pics": null, "resp": {"time": 1611941241732, "text": "Making sure our customers are happy with their service is top priority for us.  Thank you Misty."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110822694300075631620", "name": "Keli Holley", "time": 1603891124549, "rating": 5.0, "text": "Donna, Elaine and Annsley (yes it took 3 maids and more than one mop too) did an amazing job cleaning our house. They worked so hard and I do recommend them! The service was amazing but I would recommend management discuss pricing changes and have invoices pre determined before service. I signed up for a biweekly premium but management wanted to do a deep cleaning first. Mostly my fault for not asking if the price would increase. But it was worth it! Also someone left their LSA sweater :)", "pics": null, "resp": {"time": 1603896926444, "text": "Thank you Keli.  We do recommend recurring services start off with a deep clean.  That way we can give you the best results from the start."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113055713075884934851", "name": "Julia Heidemann", "time": 1581614253153, "rating": 5.0, "text": "Wow!!! I cannot say enough about Two Maids & A Mop of Auburn. Kate and Sabrina came to our rescue!! They did an excellent job of cleaning our home. I am so grateful for their service!!! Job well done, girls!! I will be calling them again. I HIGHLY RECOMMEND Two Maids & A Mop of Auburn!!!  5 STARS!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114045452076606713574", "name": "Elizabeth DuBois", "time": 1596655854297, "rating": 5.0, "text": "Cannot recommend this company enough. Chrissy, the manager, and her crews are all so professional and do an amazing job. We will definitely be using them again.", "pics": null, "resp": {"time": 1596663608181, "text": "Thank you Elizabeth."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112496483247812898178", "name": "DJ Collier", "time": 1606337106630, "rating": 5.0, "text": "Sabrina & Heidi always do a great job and are punctual and professional  while delivering great customer service.", "pics": null, "resp": {"time": 1606691340827, "text": "Sabrina and Heidi are great examples of the customer service we always strive to provide."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104831603074291281733", "name": "Johnny McWilliams", "time": 1581692012114, "rating": 5.0, "text": "Lauren always leads the team that comes to our house. She knows exactly what needs to be done. She is very detail oriented and makes sure everything is just right before leaving. Lauren and Heidi do an excellent job, are very friendly, courteous and respectful. They are a pleasure to have here cleaning. They love our dogs and make them comfortable while here.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106244891703227254556", "name": "Harescramble Adventures", "time": 1616087797411, "rating": 5.0, "text": "Sabrina and Heidi did a phenomenal job, my place is spotless!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117347308920637138342", "name": "Towers Boy", "time": 1616023609992, "rating": 5.0, "text": "Kayli and Abbie are very professional and amazing cleaners", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100435190755966232880", "name": "Kip Oldham", "time": 1580397051549, "rating": 5.0, "text": "These ladies take care of our place extremely well. It is very nice to know that we can trust this company to ease the load of responsibility that comes with the blessings of having a place to get away. In addition they are attentive to the occasional unique request or special need to be handled and they communicate with us regularly to make sure we know their comings and goings. You would definitely benefit from partnering with Crissy and her team to take care of your property.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112074642538427784232", "name": "Keith Matthews", "time": 1602724631756, "rating": 5.0, "text": "Alex and La’Rae did a fantastic job cleaning my house! Definitely would recommend this service to anyone looking to clean their home!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112495630104342653815", "name": "Sydney Waitz", "time": 1599153191226, "rating": 5.0, "text": "Melissa and Whitney are always stellar with my clean. Honestly the best team, my house is always so much cleaner after they’re here! They go above and beyond.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111788057642862354149", "name": "TC's Dimples", "time": 1598973906724, "rating": 5.0, "text": "Caitlyn, Abbie, Kacie were very thorough and efficient.  They were very nice and I was very pleased with their work. I appreciate their hard work.", "pics": null, "resp": {"time": 1599325307793, "text": "Thank you for letting us know Theressa."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106265873225376896227", "name": "Kimberlee Harrison", "time": 1623362605062, "rating": 5.0, "text": "Very pleased with the team that cleaned our home today, they were detailed and professional and both ladies were polite - excellent service. We will be using them again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101410333825355679019", "name": "Ann Martin", "time": 1603726359810, "rating": 5.0, "text": "Whitney & Melissa cleaned for me Friday! Awesome job! Sweet girls that are hard workers!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102861681756764619686", "name": "Chrissy Aultman", "time": 1581521654271, "rating": 5.0, "text": "Two Maids and a Mop did a fantastic job cleaning our office this morning here at Thalamus. They were personable and friendly while also being quick and efficient. We can't wait for them to come back and clean again! Thanks so much Lauren and Heidi!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110038248334698510842", "name": "Afra Williams", "time": 1599882660073, "rating": 5.0, "text": "This is my second time using the services of Two Maids and a Mop. They did an outstanding job of cleaning my home. They were prompt and courteous and thorough. I recommend to anyone who needs a little bit of help with cleaning!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105368424774184778565", "name": "STEPHANIE NEELEY", "time": 1595008115063, "rating": 5.0, "text": "Donna cleans our offices in Opelika every week.  She is always on time, does a great job and a very professional.  It really helps knowing she will be there and take care of what needs to be done.  One less thing to have to worry about!", "pics": null, "resp": {"time": 1595080163435, "text": "Thank you Stephanie!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104044654683741137525", "name": "Jonathan Carpenter", "time": 1601582644451, "rating": 5.0, "text": "Our renter was having to move out in a pinch and we needed someone to do an extensive clean with very short notice. Someone met me at the house to give me a quote and three days later the job was done in less time for less money than anticipated. The house was an absolute disaster at 9:00 a.m. but was ready for me to paint and meet the new renters before dinner that evening.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110694574658342044652", "name": "Melissa Holt", "time": 1598023335895, "rating": 5.0, "text": "Whitney and Melissa did a great job, were timely, efficient, and kind. I highly recommend! Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112513285656555952102", "name": "Lauren Woodie", "time": 1576592876575, "rating": 5.0, "text": "I am SO happy with my decision to hire Two Maids!! I scheduled them for move-out cleaning and they were in and out before I had a chance to get back to my apartment. The house was spotless and they did a wonderful job! They cleaned the oven, fridge and baseboards perfectly. I am very happy with their work!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103861023784428404808", "name": "Victor G.", "time": 1579140520571, "rating": 4.0, "text": "Kate & Kaily did fabulous work. Their attention to detail was A+. For all the tasks involved in a deep clean, they were quite thorough and fast (2.5 hrs). My only issue was with scheduling. My appointment time was changed w/o notification. That is why I'm not giving 5stars. Management resolved the problem by offering a discount on the service. Job well done. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112409145364508030968", "name": "Charlie Baker", "time": 1597328881817, "rating": 5.0, "text": "Yesterday I had a great cleaning experience with Sabrina and Heidi.  I had an early appointment and they were on time and the worked hard for 3 hours.  The smell of the home was fresh and they did a great job.  I plan on using the cleaning service for my future needs.", "pics": null, "resp": {"time": 1597412226184, "text": "Thanks Charlie!  We are thrilled you loved your experience with us."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118250463256573665343", "name": "Myla Young", "time": 1623260516396, "rating": 5.0, "text": "Team 3 does a marvelous job!!!!🎉", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117295174246313469264", "name": "Kim McDaniel", "time": 1584063754999, "rating": 5.0, "text": "Heidi & Sabrina were FANTASTIC!!! They were truly professional and very sweet! Just a delightful duo! My deep clean was not only thorough, I feel they went above and beyond to help me! I would highly recommend both these ladies and 2 Maids and a Mop, and i intend to use them again in the future!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102056359243967505314", "name": "Allen Landers", "time": 1612045712324, "rating": 5.0, "text": "They did a really great job cleaning my house and were very efficient with their time. I will definitely hire them again!", "pics": null, "resp": {"time": 1596413705053, "text": "Thank you Allen."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112760872975469945833", "name": "Simone Little", "time": 1613353533915, "rating": 5.0, "text": "My cleaning service from Two Maids and Mop was outstanding. They exceeded my expectations and did a phenomenal job with my house. They covered everything on my list and worked efficiently. The service was wonderful and I will definitely be using them again in the future.", "pics": null, "resp": {"time": 1599325240220, "text": "We love hearing that you loved our service.  Thanks!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104531953008905883498", "name": "Deloris Senn", "time": 1623442187210, "rating": 5.0, "text": "Team 8 is great!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113265288560555655293", "name": "Judy Moss", "time": 1611413831120, "rating": 5.0, "text": "donna and sunny were fantastic  they were very professional", "pics": null, "resp": {"time": 1611941344024, "text": "Thanks Judy!  We love our ladies!!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109493919676809642746", "name": "Deborah Jackson", "time": 1577392129948, "rating": 1.0, "text": "The management is the problem. To get your business they claim they will be glad to work in your choices of appointments. But then you are at the mercy of someone sitting at the computer and letting it generate times and days. Your schedule doesn’t matter. Poor service model. They think you work for them. Some type of issue with the manager and her ability to follow directions. You cannot substitute their services either. I make my own beds, take trash out and pick up house in advance thinking other items could get done in place of those chores. Nope, anything but what is listed is extra. Not sure though how they do ceiling fans on the list because once you hire them, they refuse to get on a step stool. Price point is higher than other competitors.", "pics": null, "resp": {"time": 1577752154452, "text": "Deborah I am sorry that your experience has led you to feel this way.  I can certainly appreciate your comment around being at the mercy of someone at a computer screen.\n\nThe Team has cleaned your home two previous times without comment or criticism.   In fact, after your Thanksgiving clean you texted “the girls did a really good job”.\n\nToday you turned our team away and were charged a cancellation fee.  These type fees are always a tough decision as a business owner.   You know a negative review might be coming because you stuck by your cancellation policy.  In most cases it is the right thing to do for the PHC's whose earnings will be impacted by the late cancellation. For 99% of customers this simply is not a problem as we share this policy in our Welcome Packet.\n\nLike most service companies we do utilize computer scheduling.  We offer multiple cleaning packages.  We even offer custom packages.  Cost will vary based on requirements. What we do is complete the clean as defined in the package you purchase.  Most customers prefer to know what they will receive and want it done consistently.\n\nNow let me offer you some feedback as the owner.  I have owned this location since it opened.  We are not perfect but strive to improve every day.  After speaking with multiple members of our team it is clear to me that your goal was to bully your way out of a fee you were fully informed of.  You were extremely abusive and spoke down to all of our team members on the day after Christmas of all days.\n\nWhile I can empathize with your frustration with being charged a cancellation fee I would challenge to treat people with dignity and respect in the future.  If you cannot do that then I suspect most small business owners like myself would prefer you take your business somewhere else.\n\nThank you for your feedback.  Have a Happy New Year and if I can ever be of any assistance call the office and ask for Blue.  They will get us in touch."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117999428883634851806", "name": "Melissa", "time": 1596918379147, "rating": 5.0, "text": "Kaci, La’Rae, and Jamie were awesome! My apartment has never been so clean! They were very nice, and worked quickly without missing anything! I have never used a cleaning service before, so I really didn’t know what to expect; nevertheless, I was blown away by how well my apartment looked! My kitchen has never looked so spotless! I keep finding things that they cleaned that I wouldn’t have even thought about (i.e. my microwave)! Amazing work with such kind workers! I would highly recommend!", "pics": null, "resp": {"time": 1597003938761, "text": "Thank you Melissa for taking the time to let us know that our PHCs did a great job for you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104684454406741846821", "name": "Sheila Hopkins", "time": 1565875831836, "rating": 5.0, "text": "We just moved to Auburn this week and scheduled Two Maids & A Mop to come in and do a move-in cleaning. They were fabulous. Lauren, Christina and Tanya arrived on time and went right to work. We had scheduled them for three hours, but they were done in just two. The place was spotless. In addition, the entire crew was personable, fun and a pleasure to have in our new home. We will definitely be using this service again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105942848630551944258", "name": "Melissa Bruce", "time": 1609286153961, "rating": 5.0, "text": "They did a great job! Highly recommend!", "pics": null, "resp": {"time": 1609772040596, "text": "We appreciate your recommendation!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118062786725423045862", "name": "Vic Pyn", "time": 1591901721482, "rating": 5.0, "text": "The two ladies did a great job. They were friendly and responsive to how I wanted certain things done. For me it was a great relief to have this all done. At age 81 and with a wife who has Alzheimers, I could not do everything they did. It took them about 6 hrs. They vacuumed carpets, mopped the kitchen and bathroom floors (3 and 1/2 bthrms, 3100 sq ft house), did blinds, dusted three ceiling fans, all wall hangings, and high-reach areas, cleaned all sinks, showers, etc., etc. I was very pleased.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110029961446103265399", "name": "Marisa Singh", "time": 1576855710046, "rating": 5.0, "text": "Great experience! The ladies arrived on time and got straight to work. It was very clear they knew exactly what they were doing. I got a deep clean done and am very pleased with their thoroughness. They did light fixtures, base boards, doors, cabinets, tall ceilings, blinds, etc. They even washed a few dishes and threw out all the trash before they left! It was definitely a nice treat having this done and I’ll definitely hire Two Maids again 👍🏼", "pics": null, "resp": {"time": 1577752356315, "text": "Thanks for the feedback Marisa.  We have some great team members.  Hope we exceeded your expectations."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118291325003987944345", "name": "Crawford Melton", "time": 1615930306620, "rating": 5.0, "text": "Madison & Shontia cleaned for us and do a consistently good job cleaning our office every other week. Thanks for all your hard work ladies!", "pics": null, "resp": {"time": 1597858116698, "text": "Thanks!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115253877168055521989", "name": "Gene Akers", "time": 1605722394851, "rating": 5.0, "text": "The ladies did an excellent job in cleaning our home and were timely and professional.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112317711684732906328", "name": "Mical Traynor", "time": 1602249871555, "rating": 5.0, "text": "It was such a great feeling to walk in to a shiny, clean house today. Thanks, Donna &Kaci!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "117811210906368481203", "name": "Meg & John Anderson", "time": 1604342756687, "rating": 5.0, "text": "Always professional and thorough cleaning.  Highly recommend!", "pics": null, "resp": {"time": 1604411403886, "text": "Thank you for your recommendation!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105759535586726394049", "name": "Ells", "time": 1596232913753, "rating": 5.0, "text": "Abbie and Caitlin were wonderful and did the job very quickly and efficiently! Would definitely recommend working with Two Maids and a Mop :)", "pics": null, "resp": {"time": 1596413758777, "text": "Thank you for taking the time write a review for us."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110779411087591241116", "name": "Laura Sutterer", "time": 1580484084220, "rating": 5.0, "text": "Donna always leads the team that works on my house. They are always on time, professional, and kind. I am very comfortable with having them in my home and so grateful to have the whole house cleaned at once. My family loves coming home on those days too!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111969962478014571930", "name": "Jolene Clark", "time": 1590079470508, "rating": 5.0, "text": "The cleaning team at Two Maids and a Mop did a fantastic job cleaning my house!  Donna cleaned my blinds, while Kaci wiped baseboards, and Tadesja scrubbed the grout on my bathroom floor.  Everything looked just like new when they finished.! They even completed these jobs and had time to do extra items on my list.  I was amazed at how efficient and thorough all of them were.  Thank you!!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104039826600319513228", "name": "Joe Belcher", "time": 1594404424594, "rating": 5.0, "text": "They did an absolutely amazing job cleaning our offices at Building and Earth. Great service!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106970961114483899845", "name": "Amy Darby", "time": 1577715799111, "rating": 5.0, "text": "A quick call (or email) to Two Maids is worth your time!  They gave me a quote over the phone and set up my appointment asap.  The ladies were prompt and worked very efficiently.  I highly recommend TMM for any type of cleaning service, weekly, monthly, or just once.", "pics": null, "resp": {"time": 1578871532223, "text": "Thanks Amy.  Glad we made you a happy customer."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112927605765414165911", "name": "Renee Gosda", "time": 1605835649800, "rating": 5.0, "text": "This company was hired by a tenant to clean the home rented from me. The house was filthy dirty and I was most upset by the condition of the home prior to the tenants move out date.\nI was extremely surprised to find the home immaculately clean when the tenants moved out. I found the Thank You note from the ladies (Donna, Patti, Whitney) who cleaned the home and felt the need to respond. I will definitely keep their information for cleaning my other Auburn properties in the future.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115069409055777081991", "name": "Emily J", "time": 1583176338241, "rating": 5.0, "text": "My husband had scheduled a deep clean of our house as a valentines gift being that I was hugely pregnant and hadnt felt like/ had the ability to get down and meticulously clean like my nesting instincts wanted to. We were able to book a date in a timely manner. We unexpectedly went into labor the night before our cleaning, so we did not see the result until we arrived home from the hospital. It was such a relief to be bringing my baby home to a clean house! We keep a pretty tidy house, but it was noticable in the attention to detail that the ladies left no dust bunny unturned.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107806344742585904449", "name": "Robin Arnold", "time": 1607308924309, "rating": 5.0, "text": "Update - I now use them for regular cleaning service.  They consistently do a thorough cleaning job and I couldn’t be happier.\n\nI requested a deep clean of my house. The ladies were friendly, professional and did an amazing job. I live in the country and dirt is a constant problem.  They got all of my baseboards looking almost new.  I would definitely recommend Two Maids & A Mop and I will use them again.", "pics": null, "resp": {"time": 1609772225442, "text": "We work hard to exceed our customer's expectations.  We are here to make your home cleaner and your life easier."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110976777748725678428", "name": "Andrew Goldsmith", "time": 1532708858550, "rating": 5.0, "text": "I scheduled relatively late for a cleaning of the house I am renting. The customer service was outstanding. They found an open slot that fit my timeline and saved me a lot of money by walking me through what service I should schedule. Kacie and Kayla were not only professional, and did an amazing job in the three hours that they were at the house, but they were also accommodating and friendly. They left the house in better condition than when I moved in. I would absolutely recommend this company and these two individuals for anyone in the Auburn area. Excellent service. Affordable pricing. Hassle-free experience. 5 Stars. 2 Thumbs up.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106558376109165448233", "name": "Emanuela Mandolesi", "time": 1590226115012, "rating": 5.0, "text": "This company has solved all my problems! They are friendly, quick, punctual,clean and professional. Definitely my favourite cleaning service!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101730659445238418630", "name": "SW Smith", "time": 1578778239325, "rating": 5.0, "text": "I was very impressed with the punctuality and professionalism of Tanya and Scottlen.  they arrived on time they immediately began working after receiving a brief tour of my home. they worked very efficiently as a team and provided a thorough, deep cleaning. I was extremely pleased with their work. In fact, my husband commented that our bathroom was so bright, it now looks as if we had put in extra light bulbs! They were personable and friendly while remaining committed to their tasks. Definitely will use Two Maids & A Mop again. I was able to receive next day appt which I really needed. The scheduling process was also efficient and professionally handled.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105583915322725899647", "name": "Paige Ellison", "time": 1587063390441, "rating": 5.0, "text": "Highly recommend Donna and Tadesja! They did an amazing job cleaning and disinfecting my home! Trustworthy, fast, thorough, and kind! I", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105883538484403049367", "name": "S LI", "time": 1585686468566, "rating": 5.0, "text": "They clean my son's apartment and do a great job. They coordinate with him about the schedule and bill me. They are very professional and detailed.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103895535956902972882", "name": "Haley Farish", "time": 1611974421669, "rating": 5.0, "text": "Heidi and Sabrina did an amazing job on my apartment! not the first time I've used two maids and I swear they dont ever miss!  They were even especially nice to my sweet pup while they were here as well", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115659718859534275182", "name": "Don Fisher", "time": 1590856833507, "rating": 5.0, "text": "The girls that cleaned were outstanding and really appreciated their attention to detail. Great job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100651742365275947741", "name": "Joann Sulak", "time": 1606069636140, "rating": 5.0, "text": "Sabrina and her co worker did an amazing job", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118043882629606999651", "name": "Terrie Goodwin", "time": 1603473589993, "rating": 4.0, "text": "It's always a pleasure knowing my house is clean. The girls are so pleasant and helpful.", "pics": null, "resp": {"time": 1599325331044, "text": "Our PHCs love their customers!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111365832647290817519", "name": "Kelly Jordan", "time": 1533311995140, "rating": 5.0, "text": "Called to schedule a move-in cleaning based on the reviews I saw for this company. After we scheduled a cleaning, we had to change the start time due to our apt not being ready and they were very accommodating. Kacie and Kayla were wonderful. Very sweet and very good. The apt was amazing after they were done. Only cleaning company we found that would clean inside the appliances too! (That oven after....wow). Would highly recommend again. Thanks ladies!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109201985251675499811", "name": "john garner", "time": 1551460329021, "rating": 1.0, "text": "The owner of two maids and mop sent two inexperienced maids that moved slow and lacked communication skills. The owner told them what to do over text messaging and phone. They obviously never cleaned an oven or owned a dishwasher. The maids did not do most of the stuff the owner said they would over the phone. They did not even clean two rooms.\nI have had my home cleaned by experienced maids that worked hard. If you need your house cleaned for a reasonable price, don't waste your money here.\nI suggested to the owner that she should send a list of what they do and don't do. She argued with me about that. She should have sent someone experienced, but she was more interested in basically stealing my money for cheap labor.", "pics": null, "resp": {"time": 1553092306127, "text": "John,  I wanted to reach out regarding your concerns. I have had an opportunity to discuss with team.  First let me say thank you for taking the time to share your feedback. We will strive to improve based on the deficiencies you highlighted. Second, let me say I am sorry that you had a bad experience. As our slogan says we strive to be “A Maid Service Worth Talking About”.  This was a situation where we tried to provide service in a situation we probably should not have.  Our team called the office on arrival and quickly noted to management that we would be unable to conform to our standards in the time we estimated based on our phone conversation.  We estimate times based in large part on customer feedback about conditions at the location.   We called you after their arrival in an attempt to reset expectations based on our visual inspection.  Your dissatisfaction confirms that in some cases the service we provide is not the solution.  I feel our team probably knew that on arrival but we tried to be helpful and proceed.  For that we apologize.  Glad to discuss further are your convenience.  Just call the office and ask them to get you in touch with Blue."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115169564176728396099", "name": "Jinright Family", "time": 1544668593371, "rating": 5.0, "text": "We’ve used Two Maids and a Mop a few times now and been very pleased. Chrissy is a pleasure to work with and oversees the job to make sure everything is done well. Christina, Landon and April came today and I was even more impressed. I confess to being hard to please in this area, but they were successful. Their attitudes were genuinely pleasant and enjoyable to interact with. I say genuinely because they didn’t seem to be putting on a show to get a good review. My son was home and they were kind to him and even engaged him in conversation. I must also confess that they worked so quickly that I was sure I’d find things not cleaned to my liking, but again was pleasantly surprised!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103131385787476853142", "name": "William Mcalexander", "time": 1587919027095, "rating": 5.0, "text": "Ashley and Chrissy were very helpful in getting our son's apartment cleaned perfectly during Spring Break.  I was communicated with, and our son/his roommates were very appreciative of the spotless clean.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109216255574650439577", "name": "Jacquetta Sands", "time": 1592434285645, "rating": 5.0, "text": "They cleaned non-stop. Christy, Patti, and Maddison were professional. They cleaned my home to their best ability.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107239209761493614570", "name": "Brittany Schmalenberger", "time": 1580698085488, "rating": 5.0, "text": "Two Maids & Mop of Auburn are amazing. The ladies there are extremely nice and trustworthy. They are reliable and do a fantastic job. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116328898100606465792", "name": "Ry Morales", "time": 1591388046837, "rating": 5.0, "text": "Just had my house cleaned by them and they did a great job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105341224050861433944", "name": "Jeanine Lawley", "time": 1616090770098, "rating": 5.0, "text": "Today is cleaning day!  I have used Chrissy's team for several years now and couldn't be happier with Heidi and Sabrina.  I don't even need to be home and I know the house will be taken care of.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105101564760680019386", "name": "Melissa Williams", "time": 1603383733930, "rating": 5.0, "text": "Donna and her team have cleaned my house several times! They pay attention to detail and make sure to do a great job! I highly recommend  them!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104688784066216373203", "name": "christopher clark", "time": 1580407803010, "rating": 5.0, "text": "Alyssa, Kate and Scottlen did a wonderful job. They were prompt, friendly and extremely Professional. They catered to my families needs and did an Excellent job of Deep cleaning my house.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113475535079229724232", "name": "Bob Kribel", "time": 1599146449990, "rating": 5.0, "text": "Friendly, efficient, and reliable service. The place sparkles when they leave.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111164443407753551066", "name": "Andrea Rossi", "time": 1610921455121, "rating": 5.0, "text": "I've had numerous professional cleaning services and most of them start out strong and then begin to fall short over time. So far, Two Maids is the best. Why? They are bright, courteous, and professional. My team, Donna, Elaine, and Sunny, works hard and stays until the job is done. The mounds of dog hair create a challenge . Most of all, they listen to my requests and remember how I like my house cleaned. Also, management tries very hard to keep the cleaning teams consistent, which, I believe is one of the most important features of a successful\ncleaning company. This is my third year and I am still very pleased with Two Maids and a Mop.", "pics": null, "resp": {"time": 1611941453495, "text": "Thank you Andrea.  Our ladies love their customers.  Relationships are important to us."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105768932922667121744", "name": "Catherine Maslin", "time": 1595008313861, "rating": 5.0, "text": "Donna does a GREAT job cleaning our Opelika location!", "pics": null, "resp": {"time": 1595080607528, "text": "Thank you Catherine for taking the time to let us hear from you."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104895803054473744951", "name": "Matthew Allsbrook", "time": 1623172631117, "rating": 5.0, "text": "They did an excellent job as always. They cleaned efficiently and quickly.", "pics": null, "resp": {"time": 1596413639349, "text": "Thank you Matthew."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115709804611033386483", "name": "Kristin Ludwig", "time": 1552936289164, "rating": 5.0, "text": "I had a wonderful experience and the ladies did an outstanding job! Melissa, Landon, and Kasie were excellent to work with and exceeded my expectations. Chrissy was also great to work with in scheduling and determining the best package for my home. I am so pleased, I am going to have them come for regular cleanings going forward. I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107019547887450867208", "name": "Ashley Miller", "time": 1534511544221, "rating": 5.0, "text": "We had some home repairs done that left tons of dust everywhere! Kacie and Kayla did an amazing job cleaning. They are quick, but extremely thorough! I've hired other local cleaning companies in the past and these ladies are the best hands down. Would definitely use them again!", "pics": null, "resp": {"time": 1534513943579, "text": "Thank you, Ashley! We think Kacie & Kayla are a wonderful team too. Thank you allowing us to take care of your home."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101049179286310248997", "name": "Heather Medeiros", "time": 1583522575523, "rating": 5.0, "text": "Two Maids and A Mop are awesome!!! We highly recommend them! They did an excellent job!!! We are VERY happy with the service 5!26 provide!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108223576634657389077", "name": "Laura Culpepper", "time": 1591381496252, "rating": 5.0, "text": "I was pleased with the job they did.  It seems like they really care about the house they're cleaning and take pride in their work.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111842572480283820022", "name": "Sarah Martin", "time": 1575338793910, "rating": 5.0, "text": "Rachal and Hallie did an incredible job cleaning our home! They are super professional and we have been so pleased every time Two Maids and a Mop help us out!❤️", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115231303439932038208", "name": "Michelle Meeks Smith", "time": 1539307338726, "rating": 5.0, "text": "Kacie and Kayla came a few weeks ago and completed and deep clean on my house and it was wonderful! It was immaculate and so clean that afterwards that I signed up for the maintenance plan. Today Kacie, Kayla, and Kelsey came out and cleaned today and it’s so nice to come home to a clean home and not have to worry about anything. I definitely recommend them! Very professional service.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113806974514012322053", "name": "Joyce McKim", "time": 1562851102204, "rating": 5.0, "text": "Thank you Chrissy for providing such a devoted team Kacie & Melissa!  They did such an outstanding job and made our home sparkle!  We look forward to seeing them regularly, if possible!\nJoyce & Ted McKim", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113703819836120743530", "name": "Nikki B", "time": 1527562494963, "rating": 5.0, "text": "Alicia, Chelsea, and Eryn are amazing!! They come and clean every other week and it’s something we look forward to every time! We are strongly thinking about having them come every week because they do such a wonderful job. The management is just as wonderful and helpful. Even when we had a family emergency, they moved our appointment at the last minute so we could have our grieving time as a family and they still came later that week and did our dishes, made our beds, and cleaned everything for us to come home too. Words cannot describe how much we love and appreciate their service!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118106995313378193651", "name": "Donna Bowman", "time": 1580434506372, "rating": 5.0, "text": "Very Awesome team of Ladies who works hard to get the job done of all of your cleaning needs ❤️", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107174324153768861234", "name": "JIMMY GOREE", "time": 1592317871445, "rating": 5.0, "text": "Two Maids were great people to work with.Answered any and all queistions I had", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107182676250356301375", "name": "Emily Sanford", "time": 1604015188047, "rating": 5.0, "text": "Excellent service! They are highly responsive and professional.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111812755314002753882", "name": "Shane and Brian Ledbetter-Dunn", "time": 1607536077719, "rating": 5.0, "text": "Great,  professional, prompt, and did a fantastic job.", "pics": null, "resp": {"time": 1609772233112, "text": "Thank you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107168257046319533036", "name": "Rebecca Scott", "time": 1590419536395, "rating": 5.0, "text": "My home is thoroughly clean!  Heidi is a tremendous team lead and pays close attention to detail.  The sanitizer they use to disinfect areas makes us  comfortable and the fact they use mask and gloves is great!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116870113542608138058", "name": "Kelly Martin", "time": 1532625044500, "rating": 5.0, "text": "Two Maids and a Mop has been doing a bi-weekly touch up for us for several months now. I initially hired them to do a single clean but was so happy that we kept using them.They are dependable and do a great job. The touch up service is really perfect for helping keep your house maintained; it is just what we need as two busy, working parents who don’t want to spend our entire weekend cleaning. It’s also a really nice thing to look forward to, coming home to a fresh and sparkling house.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114713488860705479412", "name": "Marissa Phipps", "time": 1574720319299, "rating": 5.0, "text": "Hallie and Rachal came to my house today and did such an amazing job. I came home to not only a clean looking home but a clean smelling home as well. So happy with the results!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100133819833346799189", "name": "Lisa Pierce", "time": 1527095892915, "rating": 5.0, "text": "I really appreciate Chrissy's team in Auburn! They did a fantastic job even working around a nervous puppy. I have been very pleased with the times they have been out. They are highly professional, friendly, and affordable.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103144047971571006427", "name": "Rodney Friday", "time": 1528726641564, "rating": 5.0, "text": "Two Maids & A Mop did a great job for me on a client's vacant home. I'm a Realtor and needed it cleaned before listing it.  They did a wonderful job despite a few challenges, including no air conditioning on a 90+ degree day!  I will definitely be recommending them to other Realtors and to future clients.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102803683277146340550", "name": "Kaitlyn Childers", "time": 1533056069377, "rating": 5.0, "text": "Christina and Kenzie did a wonderful job at our apartment for our move out inspection! The place was cleaner then when we moved in 2 years ago! They managed to get stains/stickers off of my shower from a prank that we didn’t think was going to be possible to remove completely. The move out inspection went great and the inspector told us we had one of the cleanest apartments they had inspected! Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114979546374108281297", "name": "Medaria Chang", "time": 1578149298095, "rating": 5.0, "text": "They did an excellent thorough job and I would highly recommend them.", "pics": null, "resp": {"time": 1578871544424, "text": "Thank you."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105648135102861770026", "name": "Master Gardeners Lee County", "time": 1598980620796, "rating": 5.0, "text": "Two Maids and A Mop provide great professional service.  Always looking forward to their visits!", "pics": null, "resp": {"time": 1599325317122, "text": "Thank you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111091294870046134412", "name": "Regina Casillas", "time": 1533824802153, "rating": 5.0, "text": "We have been very happy with Christina and Kenzie for their attention to detail. We always look forward to coming home to great work! They are always willing to provide suggestions for us to help clean areas that need a little more attention. We have shopped for a maid service here in town for the last year and I can say you get the most bang for your buck!! Look forward to working with Two Maids & A Mop for years to come!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102546360753215083462", "name": "Emma McCormack", "time": 1532993565397, "rating": 5.0, "text": "Used this service when moving out of my apartment. We gave them a list of things we needed done and they completed everything on the list. The entire apartment was spotless when they left. Definitely recommend for moving out. They did an amazing job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108305353813292623981", "name": "张熙皓", "time": 1573504788125, "rating": 5.0, "text": "The two girls that cleaned my apartment did a good job. They’re names were Tonya and Marissa!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115513675056037915451", "name": "Gina Austin", "time": 1546975759920, "rating": 2.0, "text": "Hired this company to clean before we moved in a house we recently purchased in Opelika. The team commented that the house was one of the cleanest they'd ever encountered as a move in cleaning so I showed them the areas I was most concerned about. We asked about time frame and were told they estimated about three hours. We returned home in less then two hours to find cleaning crew was already gone. Master bathroom shower was not cleaned, spots on kitchen floor which I cleaned and sent photo of to contact number (no response), oven sprayed with cleaner but not wiped out, side of refrigerator which I specifically pointed out not cleaned. Very disappointed with this service and would not recommend them.", "pics": null, "resp": {"time": 1553091632286, "text": "Gina as discussed by phone a few weeks back we would be glad to get a team back out and address any items you feel were missed.   We have not heard back so please call us at your convenience.  334 246-9099"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116514195816663561063", "name": "Monique Cosby", "time": 1578318206590, "rating": 5.0, "text": "They always do a great job. They are reasonably priced too.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102824281472579373062", "name": "Jamie Smith", "time": 1598049040617, "rating": 5.0, "text": "Great job today, Kayli and Madison!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101697450314326290765", "name": "Rachel Hawkins", "time": 1528838750147, "rating": 5.0, "text": "Just hired this service, and am so happy with the job Christina and Chelsea did on my house! It looks great, plus the ladies were so friendly and positive. Also, the customer support from Chrissy in the office is excellent.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105705739015988476275", "name": "Sydney King", "time": 1533755495231, "rating": 5.0, "text": "Christina and Melissa did a great job cleaning our house! They made sure everything on our list was fine, ensuring that we receive our security deposit! Very affordable!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112968789495927093336", "name": "Abbey Johnson", "time": 1533170662403, "rating": 1.0, "text": "My mom had hired this company to do a “move out” cleaning of my apartment, the furniture was all moved out and the apartment needed a fairly deep clean before it was inspected. We went back to check everything out almost 4 days after the service came through, and found my thermostat (that I had previously turned off since no one was living there) was running and had been running 24/7 on 65 degrees, and my bedroom fan was still running. So now we will be paying the electric bill for those almost 4 days where my air conditioner had been left to run on a very high setting. Opened the closet with the water heater and there was still dog hair all around the floor, the oven had not been cleaned out, there were flecks of dirt in the bathtub that were not there when I moved out, and nothing around the washer/dryers had been cleaned out. We also went through and re-mopped the floors, and there was dirt coming up on the mopping pads as if the floors had barely been touched. When we sent the photos to the manager, she called my mother back to argue with her that the apartment was very dirty and that they don’t touch water heaters. Apparently sweeping up the floor around the water heater is considered messing with it? This also does not explain the dirty oven, the dirt in the tub that was not there before, and the utilities that had been turned on and left on high for days. All she did was half heartedly offer to come help my mom clean (we had already cleaned up after them so we declined), and no apologies or attempts to reconcile for these other issues were made. She literally only called my mom back to argue with her. $200 later for an hour cleaning of a 450 sq foot apartment, and we had to go spend another hour cleaning up all the stuff they left behind.\n\nIf you don’t leave your apartment spotless, which defeats the entire purpose of having a cleaning service come in (I’m not talking leaving it absolutely filthy and covered in trash, but needing reasonable deep cleaning after 2 years of living there), then don’t even bother hiring this service. If you have any complaints or concerns you’ll be argued with and no attempts to reconcile or partially reimburse will be made. Seriously, this service is very overpriced for the service you receive. Hopefully you’ll find better cleaners elsewhere. Very unprofessional.", "pics": null, "resp": {"time": 1533178282727, "text": "Abbey your mother did hire Two Maids & a Mop of Auburn.   I am the owner and have had an opportunity to discuss this situation with our team.  Don’t believe you have had any interaction with our team but the space in question is your apartment.\n\nOur team shows up and based on conditions instantly called our manager.\n\nManager contacted your mother based on condition of apartment on arrival.\n\nIt is crucial that we understand the condition of location we will be cleaning so that we price it correctly and adequately schedule time to complete.\n\nTeam actually spent an hour over expected time to clean based on conditions they encountered.\n.\nWe received call from your mother on Monday (4 days after clean) with several concerns.\n\nWe welcome feedback and as a team look for opportunities to get better each and every day.\n\nOur manager offered to come to the location and walk through it with your Mother and address any missed items.\n\nWe value your opinion and thank you for your feedback, but this feedback feels inconsistent with the effort put in by our team cleaning your apartment and that is disappointing.\n\nI will simply close by saying I am glad to have a conversation about this at your convenience.  Feel free to call the office and our team will provide you my contact.   Blue."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101376629402727360464", "name": "Amanda McCourry", "time": 1557521841528, "rating": 5.0, "text": "Two Maids was fantastic.   Loved the attention to detail in the cleaning process.  Thanks Kacie and Melissa, you both were awesome!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "101848083174128842083", "name": "Jonathan", "time": 1532298878815, "rating": 1.0, "text": "I hired Two Maids & Mop of Auburn for a “deep clean” of my home and did not receive the level of service expected for the price ($345 for less than 1,200 square feet on the lower level of my home).  Quite honestly, it wasn’t even equivalent to what I’d expect from a basic weekly cleaning.  After reporting this to their local office (same day), I was told that refunds or even price adjustments are strictly against franchise policy. My only option was having them revisit my home. The office manager returned with the crew that afternoon for a redo which included an awkward walkthrough.  At times, I actually felt like I had to defend myself for questioning the quality of their work.\n\nPoint being, I called this company to help me. I had no issues with paying a premium price, but expected a premium service.\n\nThis was such a waste of money and an overall bad experience.  I never even received a follow-up call.  I hope that my review is helpful to those researching cleaning services in Auburn and also to management in possibly reevaluating their policies, pricing, and services.", "pics": null, "resp": {"time": 1533179129148, "text": "Johnathan thanks for taking the time to provide our team feedback.  While not what we would like to hear it is through feedback like yours that we can evaluate what we are doing and identify areas for improvement.\n\nWould be glad to discuss your experience at your convenience.  I would be interested to hear about the specific problems you encountered with our clean.\n\nYour satisfaction is our goal.   We are always striving to improve our polices and cleaning processes.  Your rating directly impacts the compensation of our team via our Pay for Performance compensation plan.\n\nCall the office at your convenience and tell them you would like to connect with Blue."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111013730014160396981", "name": "Margaret St John", "time": 1552773199606, "rating": 5.0, "text": "My team were promp, efficient, and thorough. They worked quietly but were cheerful and solicitous, often checking with me how about wanted things done. They finished before the two minimum hours were up, do urged me to find more for them to clean. I am quite excited mpressed and will use them again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103283761915760195927", "name": "Amanda Hiley", "time": 1527619629535, "rating": 5.0, "text": "Christina and Chelsea did a great job. Very professional and friendly--and very thorough cleaning. They did a deeper clean than I expected. Would definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114504409259887635142", "name": "Vitor Manoel", "time": 1567802064439, "rating": 5.0, "text": "Marissa and Tanya did a great job at my apartment, was a super fun time of us talking and cleaning stuf XD", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107607420864447729411", "name": "Reiko Williams", "time": 1530116969719, "rating": 5.0, "text": "Great service!  Christina and Kacie were very thorough, prompt and detailed oriented.  Will definitely be a repeat customer and highly recommend to all!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108309201058321441755", "name": "angela thompson", "time": 1602096826434, "rating": 5.0, "text": "Love the teams at Two Maids & a Mop. Especially, Landon & Kasie, who were with us today!  They did a great job & were courteous and professional. I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115744119785152242485", "name": "Jeananne Allgood", "time": 1601331456265, "rating": 5.0, "text": "They did a wonderful job!", "pics": null, "resp": {"time": 1601334042501, "text": "Thank you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110741893554767783173", "name": "Marsha Bailey", "time": 1524841990728, "rating": 5.0, "text": "I had a deep clean done of my house this week. The ladies did a fantastic job! They were very professional. I signed up to have them clean my house every month! Thank you , Kayla, and Susan!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115910659696243884314", "name": "Joanna Martin", "time": 1532734159708, "rating": 5.0, "text": "Used Two Maids & A Mop of Auburn for the first time today.  A very good experience.  Kayla & Kacie did a great job.  Will definitely be using them again!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106819942570525773032", "name": "Evan Steinberg", "time": 1531423896270, "rating": 5.0, "text": "Spoke with them on the phone, and they had incredible customer service. One of the nicest and most patient people. Absolutely loved them!", "pics": null, "resp": {"time": 1531426745665, "text": "Evan , thank you for taking the time to leave such a nice comment as this. We always do our very best to make sure we give to others as we would want given to us. Thanks again!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109956961685854083665", "name": "Gleason Jones", "time": 1543964124209, "rating": 5.0, "text": "Tory and Melissa did a great cleaning job in a very timely and professional way. They told me everything they did and I was very pleased with it all.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "103704987302088005676", "name": "JT Thomas", "time": 1522794882344, "rating": 5.0, "text": "We recently bought a home in Auburn, but travel often so need a reliable and trustworthy service to keep our house clean and fresh, when we aren’t there.  Two Maids, especially the Manager, has been very helpful with her follow up, helping us select the right service to meet our needs, and has gone above and beyond our expectations.We highly recommend Two Maids and a Mop!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "108890148702483689349", "name": "John Martin", "time": 1553786836240, "rating": 5.0, "text": "Two maids & a mop cleaned up our old place of residency in auburn and did an impressive job...from the refrigerator to the bathroom and everywhere in between. This was our first time using them so wasn't sure what to expect, but i would definitely refer and use them again.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116340512641217908307", "name": "Jessica Blackburn", "time": 1532911342219, "rating": 5.0, "text": "Two maids and a mop has been cleaning my house every two weeks all summer and they have been doing an excellent job! I love using their services and not stressing about cleaning the house.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113190856134013578103", "name": "Paula Lacey", "time": 1592081349969, "rating": 5.0, "text": "Christi and Madison did a good job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106686232398771581070", "name": "Suzie Akers", "time": 1606936573033, "rating": 5.0, "text": "I tried Two Maids and a Mop, and I was very happy with the their work.  I have now signed up for them to clean my home on a recurring schedule. The girls were professional, and they did great job.", "pics": null, "resp": {"time": 1611941468318, "text": "Thank you!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114766464841396673494", "name": "Robert Smith", "time": 1523204116213, "rating": 5.0, "text": "Can't say enough good things about Two Maids and a Mop!  They went above and beyond on our first deep cleaning and got us out of the mess we were in.  Now, they continue to keep things in order so we can spend more time doing family activities and not obsessing over cleaning the house all the time .  They have turned our home into a clean, manageable space that we finally enjoy spending time in!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "107607158870437026246", "name": "Kalyn Holland", "time": 1538690134010, "rating": 5.0, "text": "Kacie and Kayla did FANTASTIC!!! I am moving into a new house and to say it was dirty is a vast understatement!! I have never been pleased with any cleaning company, but they did awesome!!! Will definitely look to Two Maids for all of my future cleaning needs!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115964707893298700438", "name": "Matte Blackham", "time": 1582246177317, "rating": 5.0, "text": "Detailed oriented and very professional! Signing up for regular service!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118427701965586359059", "name": "yang", "time": 1574454379674, "rating": 5.0, "text": "marissa tonya Alyssa cleaned my kicthen well", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114827502152996742855", "name": "Shuying Cao", "time": 1574458752186, "rating": 5.0, "text": "marissa tonya and alyssa cleaned my apartment well", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115435796784553346983", "name": "Xunqi Feng", "time": 1574458338904, "rating": 5.0, "text": "Marissa Alyssa and tonya always make my apartment shine", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "118010132498053399702", "name": "Jacquelyn Hightower", "time": 1522959694483, "rating": 5.0, "text": "Madison, Kayla, and Susan are the best cleaning crew! My apartment is completely spotless! If I could give them 10 stars I truly would!!", "pics": null, "resp": {"time": 1522961100711, "text": "Thank you, Jacquelyn! Your PHC's absolutely enjoy cleaning for you. You are just as much a pleasure for all of us here at Two Maids."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111448337349005738456", "name": "Octavia James", "time": 1522102450047, "rating": 5.0, "text": "They always do THE BEST job. They are quick too. I’m always satisfied with they’re work 😘", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104775818048284868035", "name": "deborah hutchinson", "time": 1534998775450, "rating": 5.0, "text": "KAYLA AND KACIE WAS SO SWEET FROM THE BEGINNING TO THE END.....THEY CLEAN OUR HOME AND DID A OUTSTANDING JOB.WE SIGNED UP FOR ONCE A MONTH CLEANING I SURE DO HOPE I GET THEM BACK.CHRISTY IS ALSO A SWEETHEART.SHE MADE SURE I WAS HAPPY..... YES I AM AND HIGHLY RECOMMENT TWO MAIDS AND A MOP OF AUBURN TO ANYONE........KEEP UP THE GOOD WORK.CANT WAIT FOR MY NEXT CLEANING DAY.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "116818107500084257802", "name": "Jennifer Tadlock", "time": 1580697511669, "rating": 5.0, "text": "We would definitely recommend Two Maids and a Mop! They are very responsive and professional!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "114144527046443751698", "name": "rhonda cescutti", "time": 1523629683315, "rating": 5.0, "text": "I have used Two maids and. a Mop for the past several months.  They do a really good job.  I love coming home to a nicely cleaned home.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110706442486869839943", "name": "Michele Ogletree", "time": 1527154209028, "rating": 5.0, "text": "They did a great job on my mom's house. She was 100% satisfied & that is not easy to do! :)", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110276329583217591468", "name": "Leila Moore", "time": 1596213605275, "rating": 5.0, "text": "Melissa and Whitney were awesome!!", "pics": null, "resp": {"time": 1596413716510, "text": "Thanks Leila!"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111591880997503676649", "name": "Auburn 2020", "time": 1573077446777, "rating": 5.0, "text": "Kacie and Kailey worked a miracle, they did an outstanding job", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "105149796275208730869", "name": "Betsy W.", "time": 1615998137228, "rating": 5.0, "text": "The ladies were friendly, efficient, thorough and professional. They did a great job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109061232528409192086", "name": "Tyler James", "time": 1542211877750, "rating": 5.0, "text": "They cleaned my apartment and were super friendly and did a great job would definitely recommend", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111991414985287608570", "name": "Ebony Doolittle", "time": 1623271292349, "rating": 5.0, "text": "Donna is great!!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "111248085881446759542", "name": "Barry Jones", "time": 1530313048031, "rating": 5.0, "text": "Awesome service and price\nCleaned for 8 strait hrs and was spotless", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109550182991287633492", "name": "kara l", "time": 1528408996956, "rating": 5.0, "text": "Alicia and Chelsea did a fantastic job on our move-out clean!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112118242444349846436", "name": "Yvonne Dorff", "time": 1522786133137, "rating": 5.0, "text": "I love them! They are superfriendly and are doing an awesome job!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100125166072269143291", "name": "Michael Deutsch", "time": 1544554445881, "rating": 5.0, "text": "Kacie and Tory were nice and did a good job", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "102830476598829559543", "name": "Katy Phillips", "time": 1580743280054, "rating": 5.0, "text": "Would definitely recommend, management is great!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "113883719697982399311", "name": "sue Tucker", "time": 1535743717085, "rating": 5.0, "text": "Very glad I found them. They do a good job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100983743542293112043", "name": "Shawn W", "time": 1515938709593, "rating": 1.0, "text": "Terrible service, upon paying for the move in/move out service for $300 I was informed a refrigerator was not an appliance so that was not touched, ok.  Upon further inspection the oven was just wiped over, several fan blades were not dusted, several windows not touched and a toilet not cleaned.  Not sure what I paid for to be honest.  Save your money and use someone else", "pics": null, "resp": {"time": 1516042570090, "text": "Shawn, I wanted to reach out regarding your concerns.   First let me say thank you for taking the time to share your feedback.  We will strive to improve based on the deficiencies you highlighted.  Second, let me say I am sorry that you had a bad experience.  As our slogan says we strive to be “A Maid Service Worth Talking About”.   We want to be known for exceeding customer expectations and your feedback indicates in your case we missed the mark.  Please call us at (334) 246-9099 at your earliest convenience.  We look forward to the opportunity to address your concerns and are hopeful we can find a way to exceed your expectations.\nNicole"}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115650926276239291617", "name": "Allen Conradi", "time": 1540659208050, "rating": 5.0, "text": "Performed move out cleaning at our business.    Did a great job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "115872555592756382255", "name": "Diana Weathers", "time": 1535384463873, "rating": 5.0, "text": "Great cleaning service and will highly recommend to anyone!", "pics": null, "resp": {"time": 1535386663853, "text": "Thank you, Diana! We are looking forward to cleaning your home."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "110042045811278176030", "name": "Pam Brownfield", "time": 1530024674985, "rating": 5.0, "text": "The team showed up right on time and with a great attitude toward the grimy job. When they left, our son's home was cleaner than I've seen it in years. Now he's ready for his new bride to move in! Thank you ladies.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "106514894873474864974", "name": "Gay Langley", "time": 1528397143204, "rating": 5.0, "text": "They were very nice and did a thorough job.", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104229984001948934054", "name": "Tracy Snoddy", "time": 1606151649808, "rating": 5.0, "text": "These ladies know how to clean! Great job", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100374071529649799442", "name": "Dalton Dunlap", "time": 1532020405202, "rating": 5.0, "text": "Absolutely amazing! Wonderful job!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "104873218237564981210", "name": "Susan Harris", "time": 1591919554612, "rating": 5.0, "text": "Very thorough and polite!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "109847337901060017743", "name": "Laura Faith", "time": 1543426392925, "rating": 5.0, "text": "Great cleaning service!!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112194838950111850673", "name": "Motki Didi", "time": 1577374312005, "rating": 1.0, "text": "Very expensive", "pics": null, "resp": {"time": 1577400213103, "text": "Motki,  Perhaps you should try the service before calling it expensive.  While I am sure you are an excellent judge of residential house cleaning services  what made you deem our service expensive when we have not actually done a cleaning for you?\n\nIn the end I would consider Motki's review for what it is.  The opinion of someone who has not used our service.  Driving up their guide level by simply giving reviews on any business they land I suppose."}, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "112965295945584280982", "name": "Dorothy Curtis", "time": 1629146191329, "rating": 5.0, "text": "Thank you Team 3 - Donna, Angie and Kelly.  You were prompt, professional and worked very efficiently.  You worked around the boxes and chaos of moving in with smiles and encouraging words.  I would like you to come monthly to help us maintain.  Many thanks!", "pics": null, "resp": null, "gmap_id": "0x888cf2e8bc654731:0x76a1661ea305ee05"}
{"user_id": "100428795450614047391", "name": "Brandy Lee", "time": 1535343457138, "rating": 5.0, "text": "Amazing location!!! Very clean and friendly environment. Owners are very attentive and kind. Cheapest place yet! Washers are dryers worked fantastic! All around amazing experience.", "pics": null, "resp": null, "gmap_id": "0x88892b5adebdea3f:0x126c8d36ec6aa58b"}
{"user_id": "106606782814311635219", "name": "goldie nelson", "time": 1574610464441, "rating": 1.0, "text": "This place is not open the hours described. It's Sunday, 9:47am and it is closed.", "pics": null, "resp": null, "gmap_id": "0x88892b5adebdea3f:0x126c8d36ec6aa58b"}
{"user_id": "114116805529592659911", "name": "Phyllis Payne", "time": 1601402271929, "rating": 5.0, "text": "Angelica led the two-member team who cleaned my home.  It was Angelica's second visit.  She does an outstanding job, is professional, friendly, and knows her work.  CSI did a restoration for me about a year ago.  I was beyond pleased with their work.  It's still top-notch!", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "105050920928514561219", "name": "Jennifer Varnell", "time": 1501688114737, "rating": 1.0, "text": "BEWARE.  I recently had a horrible experience with this company.  I had contracted them to clean very specific parts of a rental I own but when then tenants showed up for move in, the unit was not clean.  Only one item we had agreed to was actually clean.  I then had to go to the townhouse and clean for 2 hours myself so my tenets could move in.  The floors were not swept or mopped, appliances and cabinets not wiped down as agreed. Fans and window sills filthy, even though we discussed doing this in advance and it is outlined on the invoice. I even sent them pictures.  What's worse is that even after I contacted them, they never called me back and still charged my card!  I have disputed this with my credit card company, but what a hassle.  Save yourself the trouble and get a company that will do what is right when they make a mistake. The pictures below are just a small sampling of what it looked like \"after\" the cleaning!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6kmGKDa4VMjK0g-_-RA-CONv1qF2xIa5Jl2_o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdp6g66UQhqLOG2vhJ2tLNRSzgeCr5uxN7KqR8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "111528074204380000892", "name": "Anna Claire Stinson", "time": 1582044647934, "rating": 5.0, "text": "After a no show from another local cleaner, CSI was able to fit me in at the last minute. The team did an incredible move-in clean and was prompt, professional, and thorough. Alana, the representative I spoke with on the phone, was courteous, friendly, and determined to keeping us on schedule for our move. I highly recommend CSI and will certainly use them in the future.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "105112824585158185665", "name": "scott pilkington", "time": 1589471890577, "rating": 5.0, "text": "We've been using CSI weekly cleaning sefrvice for at least 10 years and are always very pleased with the job they do. We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "101840724477201963352", "name": "Vickie Bolling", "time": 1581375549801, "rating": 5.0, "text": "I am so impressed with CSI. They're so good and efficient. From the first interaction with them, they are very friendly and informative. I absolutely love Tania and Alyssa--what a team!\nMy house has a lot of books--done--theyre all dusted. My house is old;they make it look better (cleaning done correctly has that effect). I'm a little bit of a clutterbug--they magically organize the little things like exposed cords, kitchen stuff put where it belongs--what a concept!  Tania and Allysa make things I don't even notice cleaner and better. They're also kind and considerate in my home.", "pics": null, "resp": {"time": 1581437192017, "text": "Thank you Vickie for your feedback. We absolutely adore you as a customer and hope to keep this relationship for a very long time. Tania and Alyssa have talked about how much they love and appreciate you."}, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "113044986932460495261", "name": "Candice Hamilton", "time": 1498134018075, "rating": 5.0, "text": "I have loved working with CSI! We had a pipe burst in our kitchen which sent water into our kitchen, laundry room, living room and dining room. CSI packed us out and moved our furniture back in after our renovations were complete. They sent a cleaning crew to deep clean all of the dust and grit that was stirred up during the renovation process. The ladies that they sent were fabulous!!! They were quick but efficient, and my house looked and smelled amazing. Thank you CSI!!", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "114194290164705818820", "name": "Jessica Torres", "time": 1581348060715, "rating": 5.0, "text": "I highly recommend this company the girls are amazing at what they do ❤️", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "108533760443735325747", "name": "Randy Rogers", "time": 1527283395102, "rating": 5.0, "text": "This company is on time and does a great job. Kelsey is always super nice and does a great job. We request her on every job. I would recommend this company to everybody.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "112789746132110509640", "name": "Erica Odell", "time": 1505519787467, "rating": 1.0, "text": "I recently had them do a move out clean. Upon walking in I immediately noticed base boards that were not done in several rooms. (This was the main thing I asked them to do). Floors looked swept but not mopped. Windows still filthy. I had to spend several hours cleaning after them keeping me up till midnight the night before I moved. Not worth the almost 300 I spent.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "115840107318530921144", "name": "Beth Bowman", "time": 1473974609027, "rating": 5.0, "text": "Its amazing what these carpet guys can do. Ours went from stained and gross, to practically spotless. Should have hired them a long time ago!", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "117971708413924607247", "name": "Oscar Fernandez", "time": 1565313013278, "rating": 5.0, "text": "Have a working partnership with them. They do great work.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "100221794247706193369", "name": "Aaron Folta", "time": 1379355646258, "rating": 5.0, "text": "I've trusted CSI with my carpet cleaning needs for years, and they continue to exceed my expectations. I've recently used their Maid service for general cleaning. I may never need to clean again! Not only do they GUARANTY their work, but they're honest and they get the job done at an affordable price. HIGHLY RECOMMENDED!", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "109707961720928152122", "name": "Josh Poole (Pooleus)", "time": 1482949585067, "rating": 5.0, "text": "Our water heater flooded our house, and thankfully CSI took care of us! They responded quickly and did a great job. Rick was friendly and knowledgable. We will call them again for any water damage needs!", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "106824829035252688900", "name": "Angel Mangram", "time": 1581348041125, "rating": 5.0, "text": "I LOVE THESE PEOPLE..", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "108637514713155663738", "name": "alex stance", "time": 1341970970517, "rating": 5.0, "text": "CSI Cleaning & Restoration did a great job the move in cleaning they did at our new home in Opelika AL. The walls and crown molding were filthy, and CSI made short work of it and all the rest of the kitchen and bathrooms. The carpet cleaning was top notch as well. I tell others about the cleaning service all the time.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "116362318794893683951", "name": "John Folta", "time": 1379098621828, "rating": 5.0, "text": "I highly recommend this company. They did a great job.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "109844368738949867351", "name": "Hayden J", "time": 1412291625502, "rating": 5.0, "text": "CSI always does a great job! Love how they clean our house!", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "116052299827904766664", "name": "Katrina Paxson", "time": 1498592634051, "rating": 4.0, "text": "CSI does a great job!  Employees are always friendly and willing to do what is asked of them.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "111669128543445107824", "name": "Elliott Wood", "time": 1469736852884, "rating": 1.0, "text": "Not impressed. Watched the crew show up in the driveway momentarily and left. Never knocked on the door and never called the contact number I provided.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "112820675840475134745", "name": "Brandon Marcello", "time": 1493157728392, "rating": 1.0, "text": "Terrible. Spots of house completely skipped by cleaning crew. No idea what they did for five hours other than burn time. They also left my doors and garage door unlocked without notifying me they were finished. Complete waste.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "115515960449650655432", "name": "Amanda Marcello", "time": 1493215108526, "rating": 2.0, "text": "Pretty unsatisfied with the 5-hour  \"deep clean\" service we had today. We hired this company to thoroughly clean a house we just purchased so it would be spotless prior to moving in. Upon arrival to our house this afternoon, right off the bat we noticed they left the garage door up with our belongings in plain view. The front door was unlocked as well. The crew was nowhere to be found.\n\nAs we looked around to see what had been done, here are just a few things we noticed:\n-soap scum in the shower\n-hair in the sink/tubs\n-microwave not cleaned\n-oven not cleaned\n-things on kitchen countertops that would have easily been brushed away even if wiped with a dry cloth\n\nWe were supposed to be notified prior to the crew leaving and we weren't. I tried to call the office at 4:30 pm and no one answered.\n\nI am very dissatisfied with the level of service. Book this company at your own risk.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "109543003371866856750", "name": "Kaylen Anderson", "time": 1427997566175, "rating": 5.0, "text": "We had my Mom's carpets cleaned, and we were very happy with the results!  Her carpets were pretty bad, they exceeding our expectations of how they would turn out.", "pics": null, "resp": null, "gmap_id": "0x888ced30df79e2e3:0xbed4b9beb9eb2eb1"}
{"user_id": "105368659053229489108", "name": "Corey Vaughn", "time": 1516600567711, "rating": 5.0, "text": "These guys helped me get my rig going", "pics": null, "resp": null, "gmap_id": "0x889a05b7faf18063:0xc5381f463cb9d44f"}
{"user_id": "117540305199133153768", "name": "john Stewart", "time": 1515702086103, "rating": 5.0, "text": "They offer a wonderful and fast service that really gets the job done....", "pics": null, "resp": null, "gmap_id": "0x8888fa842616f76f:0x982efe7335922c9f"}
{"user_id": "104583983038785082417", "name": "Kelly King", "time": 1552352948321, "rating": 5.0, "text": "I go there about once every two weeks. Always in and out no problems no waiting. Plenty of washers plenty of dryers, And they have free internet access. As far as the atmosphere it's a place to do your laundry.", "pics": null, "resp": null, "gmap_id": "0x88895beab7e5639f:0x44a73ce8398cac82"}
{"user_id": "103455050401551698058", "name": "Please No Trash TV", "time": 1499805043050, "rating": 5.0, "text": "Washers - 1.75, took about 30min\nDryer - 0.25, took about 6min\nWas quiet, had A/C. Just don't max out your loads, be smart", "pics": null, "resp": null, "gmap_id": "0x88895beab7e5639f:0x44a73ce8398cac82"}
{"user_id": "109898026703960368525", "name": "Eugene Wood", "time": 1538524845712, "rating": 4.0, "text": "H\nGood", "pics": null, "resp": null, "gmap_id": "0x88895beab7e5639f:0x44a73ce8398cac82"}
{"user_id": "116025294223116526955", "name": "Tammy Estes", "time": 1516413322170, "rating": 3.0, "text": "They're high...", "pics": null, "resp": null, "gmap_id": "0x88895beab7e5639f:0x44a73ce8398cac82"}
{"user_id": "107913045351005354518", "name": "Rebecca Harrell", "time": 1508596063683, "rating": 4.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x88895beab7e5639f:0x44a73ce8398cac82"}
{"user_id": "100406799386514432739", "name": "Robert Fairbanks", "time": 1512591044072, "rating": 3.0, "text": "Cost to much to wash", "pics": null, "resp": null, "gmap_id": "0x88895beab7e5639f:0x44a73ce8398cac82"}
{"user_id": "109674572862169427999", "name": "Tijuana Lawrence", "time": 1571862423054, "rating": 5.0, "text": "All About Cleaning provided me a onsite quote within my budget and performed the work within the time I needed them. Professional, superb cleaning, and can get the job done. They did a perfect job without any issues .", "pics": null, "resp": null, "gmap_id": "0x8892920f8d581cd3:0x539682be959b7bc3"}
{"user_id": "109863466130531523352", "name": "Harry Grier", "time": 1508601405231, "rating": 5.0, "text": "Great service.  Very dependable.", "pics": null, "resp": null, "gmap_id": "0x8892920f8d581cd3:0x539682be959b7bc3"}
{"user_id": "104417906329685759899", "name": "Christie", "time": 1595892104141, "rating": 1.0, "text": "Never answered the phone", "pics": null, "resp": null, "gmap_id": "0x8892920f8d581cd3:0x539682be959b7bc3"}
{"user_id": "104280488484244957682", "name": "Eduardo Saldana", "time": 1514316561590, "rating": 5.0, "text": "Lulu and her Mom do a fantastic job at cleaning  houses. They provide a honest and friendly service. Would hire them anytime! Keep up the great work.", "pics": null, "resp": null, "gmap_id": "0x88626c899aeeffe9:0xeff3f2335018fe51"}
{"user_id": "105767417209614742420", "name": "Rab Stewart", "time": 1574290238214, "rating": 5.0, "text": "Tom and the people at Specialty Cleaning can handle your mess. They will shoot you straight and get to work!", "pics": null, "resp": null, "gmap_id": "0x8889190a5ec22e99:0x5573f22fffa0072e"}
{"user_id": "111846307544741383544", "name": "Amy Patton", "time": 1561344802583, "rating": 5.0, "text": "You won’t find a more honest, reliable and trustworthy company to clean your home. They have done residential and commercial cleaning and are always professional and on time!!", "pics": null, "resp": null, "gmap_id": "0x8889190a5ec22e99:0x5573f22fffa0072e"}
{"user_id": "104671360818658895644", "name": "Charles McClellan", "time": 1554231298248, "rating": 5.0, "text": "Very honest and reliable people who do excellent work!!", "pics": null, "resp": null, "gmap_id": "0x8889190a5ec22e99:0x5573f22fffa0072e"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1508443079986, "rating": 5.0, "text": "Tom is a wonderful person to work with.", "pics": null, "resp": null, "gmap_id": "0x8889190a5ec22e99:0x5573f22fffa0072e"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1614101524990, "rating": 5.0, "text": "Very Christian minded and genuine company.  I have great experience with Specialty Cleaning.  As an added bonus the prices are always fair as well!!", "pics": null, "resp": null, "gmap_id": "0x888919ee65382cc1:0x5047dd57e86d1c71"}
{"user_id": "112744450320183290239", "name": "Shannon Adcock", "time": 1614781272926, "rating": 5.0, "text": "Best price quote I received and did a fantastic job!", "pics": null, "resp": null, "gmap_id": "0x888919ee65382cc1:0x5047dd57e86d1c71"}
{"user_id": "105044962524974615561", "name": "Charles Laidlaw", "time": 1594849224689, "rating": 5.0, "text": "Stuart and his team are outstanding!  Responsive, knowledgeable, personable, and reasonable costs.  I found him to be straightforward and honest, but at the same time, sensitive to my situation.  I would recommend him for any decontamination needs.  I found his customer relations to be top-notch.", "pics": null, "resp": {"time": 1594859074787, "text": "Thank you, Charles. We appreciate the kind words and positive feedback!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "101817843924647244811", "name": "Vanguard Birmingham", "time": 1594656160021, "rating": 5.0, "text": "Alabama Bio-Clean was thorough, professional and extremely responsive to our needs. We are very pleased.", "pics": null, "resp": {"time": 1594859173982, "text": "Thank you, Vanguard team! It has been a absolute pleasure to work with you!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "107375794760677872941", "name": "Marie Guerrero", "time": 1576863671258, "rating": 5.0, "text": "I highly recommend Alabama Bio-Clean to anyone needing their services. I unfortunately required their service due to my brother unexpectedly passing and his remains had decomposed in his home for approximately a month. I was able to get ahold of Stuart on a Sunday early morning and he quickly took my information and throughly explained the process. I then worked with Steve to complete the work and he handled everything with such compassion and care I am extremely grateful to him. We were faced with a very difficult situation on how to handle this and they handled everything and kept us informed of the project status at all times. They were kind, compassionate and professional throughout. I am very grateful that we used Alabama Bio-Clean for this service and I wouldn’t hesitate to use them again. If you require their services, I highly recommend them and you will not be disappointed. Thank you Alabama Bio-Clean for providing your services and taking care of the families the way you do. We will always be grateful ~The Guerrero family", "pics": null, "resp": {"time": 1577118412803, "text": "Thank you, Marie! We are so glad we were able to be of service to your family."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "112940478652632526032", "name": "Jennifer Johnson", "time": 1561497129447, "rating": 5.0, "text": "Your work was very much appreciated.  My aunt had passed away in the home and wasn't discovered for several weeks plus she was a hoarder.  Your team treated me and her things with so much compassion and respect as if it had been someone from their own family.", "pics": null, "resp": {"time": 1561553873467, "text": "Thank you, Jennifer. We appreciate the kind words. Our team strives to provide the best service to all those we serve."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "116506850202642592448", "name": "Dee Creel", "time": 1572215656665, "rating": 5.0, "text": "Alabama Bio-Clean did an outstanding job cleaning a room that had been damaged significantly. They were fast and very thorough.  I would highly recommend them!", "pics": null, "resp": {"time": 1572360711680, "text": "Thank you, Dee. Alabama Bio-Clean is committed to outstanding service. Thank you for the recommendation!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "106403972089806849279", "name": "Lynne Ninas", "time": 1569277421187, "rating": 5.0, "text": "Our job was a body which wasn't found for over a week. They were fast and professional. I am pleased with the results.", "pics": null, "resp": {"time": 1569281427286, "text": "Thank you for trusting us to care for your family. We appreciate you working with our team to help with such a sensitive situation."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "103633037923778965400", "name": "Jason Hickey", "time": 1568054112419, "rating": 5.0, "text": "Stuart and his crew are angels on earth. They not only did an amazing job for my family during our time of tragedy, but they showed an incredible amount of compassion. They took all the worry away and took care of the job while giving us time to mourn. I couldn't have asked for any better service by any better people.", "pics": null, "resp": {"time": 1568480022528, "text": "Jason, thank you for allowing us to serve you in your family’s time of need. Your kind words and compliments mean so much to our team."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "100180005230919815523", "name": "Lincoln Berland", "time": 1573763328839, "rating": 5.0, "text": "They were very prompt in responding, extremely courteous and highly efficient for a cleaning job in our basement. I highly recommend them.", "pics": null, "resp": {"time": 1573767298742, "text": "Thank you for allowing our team to serve you and the kind words. We pride ourselves in doing great work!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "112418711240383036882", "name": "Caroline Dorris", "time": 1576777565906, "rating": 5.0, "text": "Phenomenal customer service! Efficient, friendly and professional.", "pics": null, "resp": {"time": 1577118466073, "text": "Thank you, Caroline. Our team works hard to be efficient, friendly and professional!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "111111111183653095837", "name": "Danielle G.", "time": 1563826224057, "rating": 5.0, "text": "We were soo impressed with the way everyone employed by this company treated us and the compassion and kindness they showed.  Its was a very traumatic time in  our lives and these people we're so patient and very available for all our questions. They did a great job cleaning up and getting the smell out. They are not weird or shady like some of the ppl in these type of buisnesses. Great company.  I hope I never have to use you again, but if I do, you'll be the ones I call.", "pics": null, "resp": {"time": 1563827680364, "text": "Thank you for the kind words, Danielle. We appreciate you trusting Alabama Bio-Clean to serve your family."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "109493165217982754673", "name": "Shawna Kelley", "time": 1523459473731, "rating": 5.0, "text": "Considering all the circumstances in my situation, Alabama Bio-Clean is the company that helped get the job done!! They did an excellent job for my property and I recommend them to anyone who can utilize their services especially in someone's time of need. Thank you for your prompt work and outstanding service!!", "pics": null, "resp": {"time": 1568480261409, "text": "We pride ourselves in serving others! Thank you for the compliments."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "110635179280190388464", "name": "Sheryl Tucker", "time": 1421683532661, "rating": 5.0, "text": "These guys are terrific!  They are hard-working, fast, and efficient, as well as professional, clean-cut, and respectful.  Even when my loved one got ornery as they were doing their job, they understood that this was stressful for her, and they still responded gently and with understanding, while at the same time, trying to reason with her.  I am so impressed at how much they accomplished in six days.  I think one more visit should finish the rest of the house!  I highly recommend them for hoarders!  (I'm sure they are superb at the other services they provide as well, but hoarding clean-out was what we used them for).", "pics": null, "resp": null, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "102799302416532719104", "name": "Terry Richmond", "time": 1545667677719, "rating": 5.0, "text": "Wonderful experience in a terrible situation, Alabama Bio-Clean's people were not only personable but calm, reassuring and very professional. We feel we received the very best advice and service during our disaster.", "pics": null, "resp": {"time": 1568480177822, "text": "Terry, thank you for the review! We were honored to serve you!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "103302081939759230770", "name": "Randy Reed", "time": 1503677685454, "rating": 5.0, "text": "Alabama Bio-Clean did a super job at our facility.  Stuart Frandsen and his team were highly professional with 100% of the emphasis on us as their customer.  I highly recommend these guys.", "pics": null, "resp": null, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "117578876553686640265", "name": "Pedram Maleknia", "time": 1579662256267, "rating": 5.0, "text": "Every time I have been to Royal Fine Cleaners, they have been nothing short of professional. The service when you walk in the door is impeccable, and I feel like family every time I go in. I appreciate their work, and I hope wherever I go to school next has a dry cleaning business as good as this one.", "pics": null, "resp": null, "gmap_id": "0x888602ea13eeec3d:0xe57c4407617da0fe"}
{"user_id": "117960926307131126238", "name": "adam pitts", "time": 1568411301531, "rating": 5.0, "text": "Royal Cleaners is the best dry cleaning service in town! I had left a suit there over a year and they held on to it! Also wasn’t charged any extra fees. Fast, friendly, and professional!", "pics": null, "resp": null, "gmap_id": "0x888602ea13eeec3d:0xe57c4407617da0fe"}
{"user_id": "114418012499379800796", "name": "Katherine Webster", "time": 1484516465832, "rating": 5.0, "text": "I love this dry cleaner! They always have my clothes done by the next business day, and their prices are extremely reasonable. I've been coming to this location for about a year, and I can't recommend it enough.", "pics": null, "resp": null, "gmap_id": "0x888602ea13eeec3d:0xe57c4407617da0fe"}
{"user_id": "103204595589834866630", "name": "Kim Hawkins", "time": 1490411688588, "rating": 1.0, "text": "This cleaners is the worst place for alterations! Do not use them! They took over a month to put in a zipper on a skirt. They originally said it would be $24 and then charged $25. Yeah, I know it's just a dollar, but they should be giving me a discount for my troubles, definitely not charging more. The guy said they send alterations out to a company that does high volume and isn't interested in doing one skirt-- would have been nice to know that over a month ago, buddy.", "pics": null, "resp": null, "gmap_id": "0x888602ea13eeec3d:0xe57c4407617da0fe"}
{"user_id": "113478396759228074054", "name": "Alex Lee", "time": 1562601445732, "rating": 5.0, "text": "Friendly staff, and my clothes always done well", "pics": null, "resp": null, "gmap_id": "0x888602ea13eeec3d:0xe57c4407617da0fe"}
{"user_id": "108061412271635176982", "name": "Mrs Tuck", "time": 1616779517843, "rating": 5.0, "text": "I’ve used this cleaning company more than once! Anyone can do a great job the first time but to continually do a great job and be professional is very rare in the time we’re living in! I can honestly say that I’m truly grateful for this company. They left my building smelling like lemons it lasted up to 3 weeks!! They arrived within the appointed time frame and really gave me a fresh perspective on using cleaning companies! I have to say that I was pleased from booking to seeing the results of the work! Thank you for your professionalism and a job well done!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110280413325210889562", "name": "tor zaleski", "time": 1546372850873, "rating": 1.0, "text": "I paid $285 for a \"deep clean\" so that my wife could relax and start off the new year less stressed. We selected for the baseboards and doors to be cleaned. Keep in mind, our house was so clean when the two cleaners arrived they even commented on this. Here is a photo of just one of the baseboards in our master bathroom and the magic eraser after my wife cleaned it herself. Not only did my wife have to do the cleaning herself, which is what I was trying to avoid, but now she is upset about having wasted so much money on something to be done poorly. Will not use again, nor will I recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRi78nyZLVEtDWk3WPkKwEmpwAO3MGSbdpn9mF=w150-h150-k-no-p"]}], "resp": {"time": 1546466516411, "text": "Mr Zaleski, We want to thank you for allowing us to rectify our error! We are thrilled you are satisfied with our service and our team looks forward to servicing you again in the near future! ECC strives to deliver the best possible experience to all of our customers. Expeditious, courteous, professional, detailed service is our goal for every customer, every single time. Guaranteed!\nBest regards,\nMrs. Burden\n334-246-2230"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103348245218605346379", "name": "Shemeka Brock", "time": 1622492407394, "rating": 5.0, "text": "I booked Expert Cleaning Concepts for a messy closet makeover and to organize my cabinets. In the 3 hours that they were at my home. They cleaned my entire apartment and left it spotless. The workers were friendly and very attentive.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109844368738949867351", "name": "Hayden J", "time": 1611414287913, "rating": 5.0, "text": "I can not share enough good things about this company! When I call these sweet ladies, I feel like I am talking to a bunch of my friends, not a corporate cleaning service! These women are amazing, professional, always on-time, very affordable and just so kind and willing to work with you for what you need. I am so thankful for Expert Cleaning Concepts, they have helped me in many tight schedule situations and they always do an amazing job! Use this company!! You will love them and use them forever!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109173031692438852187", "name": "Amber Daniel", "time": 1613858938495, "rating": 5.0, "text": "Expert Cleaning Concepts is friendly, flexible, very reliable and care about their clients. I like the fact that the team shows up when scheduled and get the job done. My experience as an intern was a breath of fresh air. I was provided all the tools I needed to perform my duty. The people at ECC were courteous which made my job easier. I didn’t feel like a burden if I needed to ask for assistance. I learned not to limit myself and that it’s never too late to pursue your dreams.\nThe CEO is simply amazing. She is  the epitome of professionalism. I highly recommend the company for your next cleaning service.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "111847033679332176584", "name": "Jay calloway", "time": 1613171023491, "rating": 5.0, "text": "I’ve been here for a week and I absolutely love it. Good team work , very professional and I would refer anybody who wanna get better with business and office work to apply for the internship here and of course mrs. Johnson is absolutely a nice lovely women who I much look up too.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116004775598421544548", "name": "Toyar Holstick", "time": 1611347739797, "rating": 5.0, "text": "Expert Cleaning Concepts is a very professional and profound business. They offer good quality cleaning to each and every customer. I recommend Expert Cleaning Concepts for your cleaning needs.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116643895421576103564", "name": "Hillary Caldwell", "time": 1609815904168, "rating": 5.0, "text": "This company is amazing, professional, and they take pride in what they do. I was very impressed with how they went the extra mile to make my business look extraordinary for my staff and clients. I definitely recommend this company, you will not go wrong!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104085357080517366717", "name": "Hustle Inc Films", "time": 1600123690465, "rating": 5.0, "text": "I had just went through a break up and I’m a guy, that works long shifts and I just didn’t have the energy to clean like I’m suppose to.. ECC came and did a wonderful job... I have a lovely home and when ECC finished it looked like a brand New Home again, they was on time, and professional, I’ve told family and friends! If u looking for finial confirmation, my experience should be it!", "pics": null, "resp": {"time": 1602596802724, "text": "We know how hard this can be. Thank you for opening up your home to us. Please do not hesitate to give us a ring again!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117277473205720004595", "name": "Teresa Hicks", "time": 1602599763772, "rating": 5.0, "text": "My name is Teresa and I have recently concluded my Summer 2020 internship program with ECC. I greatly enjoyed being a part of the Expert Cleaning Concepts' staff during internship. I became immensely inspired working directly alongside the CEO, Mrs. Johnson, and her phenomenal management & staff. The program helped me to master my interpersonal skills as well as learn the dynamics of running a successful company. It also gifted me the opportunity to gain office experience to amplify my resume. I highly recommend to the youth to join ECC's internship program if they are interested in starting their own business, a non-profit organization, or desire an experience to enhance their resume.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102286607813888488387", "name": "Betty Janigan", "time": 1597969288740, "rating": 5.0, "text": "This cleaning service is exceptionally professional. Friendly. Courteous and very prompt.  They went above and beyond to meet my needs and more.  Expert Cleaning is definitely a company that I will refer as well as continue to use their services at any cost, the prices as well are amazing.", "pics": null, "resp": {"time": 1602596973241, "text": "Thank you Mrs. Betty. You're one of a kind. We appreciate you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112087446669521944386", "name": "Jeanne Manning", "time": 1604755726133, "rating": 5.0, "text": "Extremely professional and did a fantastic job.  Top Notch!  I have used others and won't go back.  Thank you ladies!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114719237108219352815", "name": "Erika Byrd", "time": 1605637683218, "rating": 5.0, "text": "“ Expert cleaning concepts is a professional and reliable cleaning company, they are always on time and put 100% into everything they do! They are an amazing business to work with and I will be using them again...", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103144182908697744261", "name": "Natalie Winston-Calloway", "time": 1594922898990, "rating": 5.0, "text": "Expert Cleaning Concepts, INC is a one of a kind business! Not only does this business provide excellent cleaning services for their customers, they also invest into the community! This business not only values their customers, they value each individual in the community and this is apparent in the numerous community service projects that this company has undertaken! The owner of this company had a strong vision for what this company would stand for and it is amazing to witness such a wonderful asset in the community!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117646201494246139141", "name": "editoria thompson", "time": 1600524678186, "rating": 5.0, "text": "KoKo and Dorthy did a great job on my apartment. I wasnt there because I had to work so my friend let them in when I got home my apartment was nice and clean they did an AMAZING job I definitely will use this company again and the same cleaners!!", "pics": null, "resp": {"time": 1602596687231, "text": "Oh WOW, this is awesome news! We appreciate your business and feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106476171222533696614", "name": "Jayla Young", "time": 1623338205987, "rating": 5.0, "text": "Team 3 did an amazing job", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101084324556244846686", "name": "Timothy Gary", "time": 1604961335351, "rating": 5.0, "text": "I've been working with Mrs. Johnson at Expert Cleaning Concepts and working for ECC has been an excellent experience and an on time blessing! I have enjoyed every week as I have learned how the company operates and how I should run a business when I start my own. Mrs. Johnson and the rest of the office crew were so welcoming but very professional and I dearly enjoy my mornings with them all. I have seen our field workers do an excellent job as well with cleaning residents for our customers. Mrs. Johnson holds our cleaners to a high standard and they set themselves to met those expectations! ECC is a wonderful place of business and also has great internship and job opportunities.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100793870347909550256", "name": "Sherry Grady", "time": 1606522523064, "rating": 5.0, "text": "Love these ladies! They are wonderful. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100793870347909550256", "name": "Sherry Grady", "time": 1606522523064, "rating": 5.0, "text": "Love these ladies! They are wonderful. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114135886059632608692", "name": "Chantel Snow-Hall", "time": 1594248653253, "rating": 5.0, "text": "I am very pleased with Expert Cleaning Concepts! From the staff to getting the job done, they are always professional. They get the job done in a timely manor and complete the job with excellence! If you are looking for good quality cleaning services I highly recommend Expert Cleaning Concepts! They are THE BEST!!!", "pics": null, "resp": {"time": 1594304093790, "text": "Thank you Mrs. Hall for your feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100059063313620454661", "name": "Adri", "time": 1605627335491, "rating": 5.0, "text": "Everyone was so professional and polite....It made my experience that much more enjoyable!!! I definitely will be coming back!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117891055889717584945", "name": "Shay Edwards", "time": 1592152696615, "rating": 5.0, "text": "I must say exceeded my expectations thus far!!! Wonderful staff and very professional. I actually won a free deep clean and when i say they went above and beyond they truly did. I have been in my duplex for 4 years so to come back from my vacation to my home looking like we just moved in was amazing.", "pics": null, "resp": {"time": 1592169954333, "text": "Ms. Shay, WOW! Thank you for the feedback. We hope to see you soon for another house cleaning."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112513883971139253441", "name": "danielle nelms", "time": 1595293123385, "rating": 5.0, "text": "I wanted to do business with them when I seen them do the free baskets for the elderly. They gave them free cleaning supplies and free rides to wherever they needed to go. When I called to book with them, they answered all of my questions and was very professional. They service was very detailed and affordable. I will book again very soon", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102872702587099605286", "name": "jessica dunn", "time": 1597961711027, "rating": 5.0, "text": "I would highly recommend This Cleaning Company. The service they provide is excellent and they exceed my expectations every time.\nThey always do a thorough clean,\nthey are prompt and very reliable.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103977994403431270925", "name": "Betty King", "time": 1600126899302, "rating": 5.0, "text": "Expert Cleaning Concepts, is the most professional service I know, bring back life and light to your home. Give them a call you will not be disappointed. Thank you again", "pics": null, "resp": {"time": 1602596725967, "text": "Mrs. Betty, we truly appreciate your feedback. You're fantastic."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116391508695011887938", "name": "Ryan Conner", "time": 1597720378198, "rating": 5.0, "text": "Great job by GREAT people. Upon meeting the cleaning crew they all greeted me very professionally and energetic. I Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105077713063742401485", "name": "Felicia Jones", "time": 1602179731271, "rating": 5.0, "text": "Hey,  The experience were tremendous and work very remarkable and quality was good so if anyone wants good service One call that all Love them🖒🖒🖒", "pics": null, "resp": {"time": 1602596649033, "text": "Hi Ms. Felicia! You're awesome! Thank you for the feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107571891034678982110", "name": "Jacqueline Felton-Williams", "time": 1592051420627, "rating": 5.0, "text": "I must admit, great company!!! Professional and caring. Not only a cleaning service but they take time to give back to the community. Every deed is appreciated. A blessing to the community 🙏🙏🙏", "pics": null, "resp": {"time": 1592170049574, "text": "Thank you Mrs. Williams! You're terrific. Thank you very much for your feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105945195523466207860", "name": "BRANDON DIXON", "time": 1599500351268, "rating": 5.0, "text": "Exceptional cleaning service. Highly recommend. Will not hire or turn to any other company. Lifetime customer here.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115054062717262949751", "name": "House of K Boutique & Beauty", "time": 1594910573805, "rating": 5.0, "text": "This company is amazing for your cleaning needs. They were very responsive and attentive to the things we needed done. I highly recommend booking them.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105782660506005877156", "name": "cellabianca gray", "time": 1604030451082, "rating": 5.0, "text": "Definitely a great cleaning company that get the job done to perfection! No complaints", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115379306594258051071", "name": "Kelli Coulter", "time": 1575946025026, "rating": 5.0, "text": "I booked the 2 maids for 2 hours for my house and was able to add on some additional services for a very reasonable price. They came out early and got started right away. They did such an amazing job in all of the rooms but especially the bathrooms. I will definitely be using them again!", "pics": null, "resp": {"time": 1578182946279, "text": "Hi Kelli, thank you for leaving us your feedback. We truly appreciate it. Looking forward to seeing you soon!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106691272834494532737", "name": "Alfreda Hyman", "time": 1605628353590, "rating": 5.0, "text": "What a rewarding experience, nothing like a Clean Home, ready for the Holidays. Thanks ECC.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116559098163740682815", "name": "Tasha Burks", "time": 1597968497940, "rating": 5.0, "text": "Very passionate about their customers needs. Also ECC is always giving back to their community. Highly recommend!!", "pics": null, "resp": {"time": 1602597021128, "text": "Thank you Mrs. Tasha. It's an honor to know you. We truly appreciate your kind words."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117839974235027440483", "name": "Jacarl Gullatte", "time": 1594827965152, "rating": 5.0, "text": "I recommend ECC hands down. This is the best cleaning service there is. The staff is always trustworthy, professional and prompt. There’s no other cleaning service like it.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105753341787675241580", "name": "Mercedes Benford", "time": 1599772664486, "rating": 5.0, "text": "Wonderful cleaning service ♥️♥️.. They definitely aim to please every single time !! Book an appointment, you won't be disappointed !!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110564799669835256848", "name": "FrezzKnow Vlogs", "time": 1591706186174, "rating": 5.0, "text": "I highly recommend this awesome cleaning service and their staff.  Very punctual with time, no corners cut, and they made sure I was satisfied. The price is right and there was no spot left in sight!", "pics": null, "resp": {"time": 1592170109222, "text": "It was great cleaning your come! Once again, CONGRATS."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114542152738061225221", "name": "Kelli Linander", "time": 1572008495974, "rating": 5.0, "text": "I highly recommend Expert Cleaning Concepts to come clean for you! My experience was a great one. My house was such a mess, but when they got done, it was spotless!! They were so thorough and highly professional. I look forward to having them back every other week. I assure you that if you give them a call for your cleaning needs, you will not regret it.", "pics": null, "resp": {"time": 1572281092740, "text": "Thank you Mrs. Linander for your feedback. It is always a pleasure to service you. You are a pleasure to work with.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101281110754948266979", "name": "Altumura Rosencrantz", "time": 1597425098334, "rating": 5.0, "text": "I love this company very dependable and they do an outstanding job.  The girls are awesome and very nice!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110734919219272876945", "name": "Michael Martin", "time": 1594256190750, "rating": 5.0, "text": "ECC has great a quality service. The staff is so amazing and really care about the job and customers. ECC is very active in the community is well. I applaud them for everything they do and the hard work that they put in.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101725125993651266982", "name": "Nikki W", "time": 1597962629634, "rating": 5.0, "text": "Very friendly cleaners came. They did an exceptional job. Everything was to my liking.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103773432059572047330", "name": "Al Dixon", "time": 1580854571955, "rating": 5.0, "text": "Best cleaning service in town! I was skeptical about hiring cleaners for my home initially but my coworker recommended this business. I was blown away by their professionalism and their excellence! I will definitely be using them in the future. Thanks so much team!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113854749791217480347", "name": "Iciameka Baker", "time": 1579141125427, "rating": 5.0, "text": "The two ladies were on time and very friendly. They introduced themselves and asked was there any specific thing they should focus on!  They were very meticulous and paid great attention to detail. It felt good knowing everything is clean and sanitized. I really didn’t think they would clean an entire 4 hours, but once I went back into my new home, it was spotless! NOW we’re ready to be moved in!!! I would highly recommend them!", "pics": null, "resp": {"time": 1579276807320, "text": "Mrs. Baker, once again Congratulations on your new home. It is truly beautiful. Our team enjoyed making your home perfect before the big move. You and your husband deserve the BEST from us. Thank you for recommending us. We are looking forwarding to servicing you in the future."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116082061771669344850", "name": "Tina Stevenson", "time": 1594269256414, "rating": 5.0, "text": "ECC is the best company EVER!!! Caring and professional.. A blessing to the elderly during this pandemic. I would definitely recommend ECC for all your cleaning needs", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110221342821970875674", "name": "Latrica James", "time": 1588718854684, "rating": 5.0, "text": "This company cleaned our church due to COVID 19. They are very friendly, very professional and were very responsive. I contacted the owner because that was the only contact info I knew and she never rerouted me! She scheduled gave me quotes, scheduled my appointment and emailed me what was to be expected! The clean up ladies were very friendly and professional also. I will definitely be using them again  and referring them to everyone needing services! I highly recommend ECC!", "pics": null, "resp": {"time": 1589738303893, "text": "Mrs. James,\n\nThank you for giving us your feedback. We truly appreciate you. It was our pleasure to clean your church."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110240837285116335661", "name": "Mixti Cox", "time": 1582393222831, "rating": 5.0, "text": "Expert Cleaning Concepts did an absolutely brilliant job on a horribly filthy trailer.  In one day they got it to near perfect condition.  The staff was punctual and very professional and got right to work.  The owner, office people and crew were so friendly and easy to work with that I will never use any other cleaners service.", "pics": null, "resp": {"time": 1583169609434, "text": "Mrs. Cox, it was truly a pleasure to assist you. We made it our business to ensure you were well taken care of. Thank you so much for entrusting us with the large project."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103021227692319094301", "name": "roderick autry", "time": 1605635026158, "rating": 5.0, "text": "Very professional and precise would definitely recommend repeatedly and immediately!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101060525772985858908", "name": "Martavious Johnson", "time": 1592160392159, "rating": 5.0, "text": "This is an amazing company with a true passion for what they do. They care about people and you can definitely count on them to get the job done precisely & promptly every time you call them.", "pics": null, "resp": {"time": 1592169830382, "text": "Thank you! We truly appreciate your feedback.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109496663830987824136", "name": "Mona McDonald", "time": 1600119896668, "rating": 5.0, "text": "Expert cleaning did an Awesome job and very helpful and such a Blessing to our community.", "pics": null, "resp": {"time": 1602596882522, "text": "You are so kind Mrs. Mona! Thank you for everything. See you soon."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114291329548217488902", "name": "Donnie Smithwick", "time": 1579893704370, "rating": 5.0, "text": "Expert Cleaning always does a great job! It is wonderful to come home to a clean home. The business that I work for recently had to change their cleaning crew. We hired Expert Cleaning to do the job. Excellent work and very dependable.", "pics": null, "resp": {"time": 1579907918129, "text": "Mrs. Donnie, you are such an AMAZING client. We truly love cleaning your home and office. Thank you for your generosity and always making the environment so pleasant. We wish we could clone you 10X. Thanks a lot for everything.. We'll see you again within a few days."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104427289016552852268", "name": "Shirley Miles", "time": 1592172700014, "rating": 5.0, "text": "Not only does the company have an excellent cleaning service but she serves the community as well through feeding the elderly and creating care packages for them. This is especially important in times like these. Thank you for all you do!!!!", "pics": null, "resp": {"time": 1592169886942, "text": "Thank  you Ms. Shirley! We truly appreciate your feedback.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105212834932065117284", "name": "Brandon Gage", "time": 1580657424077, "rating": 5.0, "text": "I invited Expert Cleaning to help me with my home and I couldn't be more thankful. These guys are awesome at what they do. Everyone is very professional and nice. I sure will have them back to assist me with cleaning and I will refer them to a friends and family. Thank you guys!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100564856000520634580", "name": "Jessica Oliver", "time": 1581613293514, "rating": 5.0, "text": "This is my third time using the company and the service has been excellent. Very professional and always on time. The owner is caring and makes sure that the customers are always satisfied. I would definitely recommend this company to anyone.\n-Mrs. Oliver", "pics": null, "resp": {"time": 1582240603738, "text": "Thank you for your heartwarming compliments to our ECC family, crew and services, Mrs. Oliver. You deserve our very best."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112829739728545873581", "name": "Laura’s floyd", "time": 1592055853024, "rating": 5.0, "text": "I recently volunteered for an event hosted by this business that gave away free care packages to the elderly and it was amazing! This company goes above the regular standard of a business and gives back to their community. I loved every second of it!", "pics": null, "resp": {"time": 1592170006926, "text": "Ms. Laura, thank you for volunteering at our most recent event. You're awesome and we thank you for your feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104102278705146883314", "name": "Kiryana Newton", "time": 1591843423067, "rating": 5.0, "text": "I ABSOLUTELY JUST LOVE EVERYTHING ABOUT THIS BUSINESS !!!\nVery great communication, friendly staff , not to mention this has been the best cleaning i’ve encountered during my lifetime ! HIGHLY RECOMMEND!!", "pics": null, "resp": {"time": 1592170084221, "text": "Thank you! We truly appreciate your kind words."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104125532003817834821", "name": "Serlanda Hannah", "time": 1579048866997, "rating": 5.0, "text": "Very Fast, Friendly & professional service! Very punctual. Staff is very trustworthy. I was more than pleased. I definitely will be calling them again!!", "pics": null, "resp": {"time": 1579276639170, "text": "Thank you Mrs. Hannah. We truly appreciate your feedback! You're truly phenomenal!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112024403204211805132", "name": "Stephanie Tucker", "time": 1592277578914, "rating": 5.0, "text": "what a awesome company not only do you and your team clean, but you and your team are blessing others through giving. keep giving and do what you were called to do. i know the community thanks you.", "pics": null, "resp": {"time": 1592482377011, "text": "Ms. Tucker, thank you very much. We truly appreciate your feedback. Our team absolutely love giving back to our communities."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105007879585565915481", "name": "Lucy Winn", "time": 1580860626876, "rating": 5.0, "text": "The best cleaning service around town. Trust me, you will not be disappointed. I enjoy coming home to a clean home after a long day of work. I been using Expert Cleaning Concepts for many years & highly recommend this company. Two of my favorite teams are Aaron & CeCe, & Jessica & KoKo. They does an amazing job & has my home spotless every visit!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104132358779959219136", "name": "Inez Ottis", "time": 1605634066537, "rating": 5.0, "text": "My place never smelled soo good until I contacted Expert Cleaning Concepts INC. thank you ladies", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102981866134770642772", "name": "Emperor KJ", "time": 1580861422768, "rating": 5.0, "text": "My first time using an cleaning company and I must say I am amazed. The ladies came out and done a wonderful job. They was on time, friendly , and was very detailed with their work. Thanks ECC, I will definitely be using again.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106214597111090550360", "name": "Desiree Ross", "time": 1592155395311, "rating": 5.0, "text": "I would like to extend gratitude for ECC amazing community service. Recently this awesome company blessed 100s of elders with essential care packages and offered free rides to assist with servicing our elders during this pandemic safely as possible. ECC is more than a cleaning company ECC is our community! Thank you ECC for always going above and beyond for your customers and community!", "pics": null, "resp": {"time": 1592169918286, "text": "Ms. Desiree, you have warmed our heart with your review. We truly appreciate you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108834541600111463769", "name": "Cheryl Bowers", "time": 1583025939846, "rating": 5.0, "text": "I have been using Expert  Cleaning Concepts  for the last several years. I would never use another cleaning company.  They are awesome and treat your home as if it was their own. Completely satisfied!!", "pics": null, "resp": {"time": 1583169679448, "text": "Mrs. Bowers, you're so awesome! We cannot thank you enough for the continued business."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107292899058626104971", "name": "Judy Fernandez", "time": 1568468730224, "rating": 5.0, "text": "RECOMMENDATION: ⭐️⭐️⭐️⭐️⭐️\nExpert Cleaning Concepts!!!!\nWOW! This company consistently delivers exceptional service!\nI’ve been using them a while and  they are thorough and detailed oriented. EVERY. SINGLE. TIME!\nMy house is sparklingly clean!\n\nOther cleaning companies are great at first then service dies down. Not with ECC!! I am so impressed that the cleaning is AMAZING every time!!  Rates are reasonable, too!\nNeed a cleaning service? I highly recommend this one for A-1 service!!!!", "pics": null, "resp": {"time": 1570822571086, "text": "Hi Mrs. Judy, we appreciate your feedback. Thank you for being a long time client for the past 3 years!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108342695138295376460", "name": "Xavier Thoms", "time": 1553967571425, "rating": 5.0, "text": "Very professional,  arrived on time, and call to confirm  appointment.  Pressure wash my two story home. Never had it wash in 9 years,  so you can imagine how dirty and stained it was.  This guy took his time & went over it thoroughly.  And I was HAPPY. Thank God we do have some honest people in this world.  Who want to do right by you. Highly recommend. Going to continue using this service,  for all my cleaning present tent and near future .", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112645542725274179714", "name": "Robbie Futrell", "time": 1575567077242, "rating": 5.0, "text": "Did an outstanding job! Attention to detail, professional, polite, quick (they don't mess around!). We will use them again, and we highly recommend.", "pics": null, "resp": {"time": 1575648397089, "text": "HI Mr. Futrell,\nYou're the best. Thank you for allowing us to service your home before the Holidays. Merry Christmas and may 2020 be fruitful!\n\n-Shan J.\nOwner"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103576615805291874548", "name": "The Mayo", "time": 1570428524323, "rating": 5.0, "text": "All I can say is Ms. Jessica and Mr. Aaron are a “GODSEND!” They did a FANTASTIC job in a timely manner. Both of them assured me that I would be taken care of and they did not disappoint🥰 I am sold on this service and will continue to use them in the future!! YOU GUYS ROCK♥️♥️", "pics": null, "resp": {"time": 1570822380477, "text": "Thank you. You're awesome. We appreciate your business. :-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113278605425886874794", "name": "Claude Jarrett", "time": 1581565953444, "rating": 5.0, "text": "This Company is professional and were very understanding of my needs. ECC ensues me 100% satisfaction and WOW! I was very impressed. Will call them again and I highly recommends ECC Cleaning Concepts...", "pics": null, "resp": {"time": 1582240709342, "text": "Thank you so much. Your appreciations boost our morale to deliver the very best of our asurances to you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117572109291017983033", "name": "T Stokes", "time": 1552617701287, "rating": 5.0, "text": "We have a game day rental house that they clean regularly. Every single time, the house looks perfect for our guests. Tonight I completely forgot that we have people coming tomorrow, and didn't reach out to them until 9pm. They wrote me back instantly and let me know it would be taken care of. Couldn't ask for better, more trustworthy or dependable folks!! 5 Stars!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116141553852339671469", "name": "Tweet Gray", "time": 1604030637817, "rating": 5.0, "text": "COVID-19 doesn’t stand a chance cause I called Expert Cleaning Concepts to sanitize my home.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113203307975031283126", "name": "Kerry Hancock", "time": 1568504682824, "rating": 5.0, "text": "These guys are on point! I love using their services! Ms Williams and Princess come to work and make miracles in my toddler overtaken house 😂. They have great availability and the price is worth it! I get so excited every time we have a cleaning!!", "pics": null, "resp": {"time": 1579276943888, "text": "Mrs. Hancock, you're AMAZING! We always enjoy cleaning for you! See you soon."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108750438289965456555", "name": "BeatsByWhite FTSM", "time": 1581023908445, "rating": 5.0, "text": "I have been using ECC for over 2 years. As always, great service.  You will be hearing from me soon to book before Spring Break.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117936585530756903980", "name": "Theresa Love", "time": 1547403714272, "rating": 5.0, "text": "The ladies always do a GREAT job! I have been using them for over 7 months. I'm comfortable with them and trust them to clean while I'm working. I work 50 to 60 hours a week. Honestly, I only have time to feed my dog, eat supper, shower and rest. Leah and her partner really take the stress away. I highly recommend to do something for yourself. Its a relief to have them.", "pics": null, "resp": {"time": 1549665493741, "text": "You deserve it! Thank you for using our service. We appreciate you sooo much!!!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117401052384152165899", "name": "June Bage", "time": 1579361015548, "rating": 5.0, "text": "Expert cleaning is number 1!! The cleaners always do an amazing job. Everyone is always polite from the office to the cleaners. I recommend to Expert Cleaning Concepts to anyone looking for a honest company.", "pics": null, "resp": {"time": 1579633259980, "text": "Thank you Ms. Bage! We truly appreciate your feedback. Our team truly pride ourselves on being polite and giving each client 200%. :-)  We are looking forward to doing more business with you this year."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109253467531098556020", "name": "Carrie S.", "time": 1549410126513, "rating": 5.0, "text": "They did such a great job and I called late in the day and they came the next day!!!!  Sabrina and CC came to clean my daughter's dorm room at Auburn and they did a great job!  We will use them again, and use them when my daughter has to move out of the dorm at the end of the year. I highly recommend them and the communication was excellent as well!  Great job!!", "pics": null, "resp": {"time": 1549665441901, "text": "A true SWEETHEART! Thank you for trusting us. You're totally AWESOME! Looking forward to cleaning your daughter's dorm again. I have a daughter who attends college out of town so I know how important it is to ensure they are well taken care of.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109605585187581948372", "name": "Jordan Jackson", "time": 1553717516809, "rating": 5.0, "text": "I can’t say enough about how great Princess and Annetta were. They were extremely thorough and my house looked and smelled cleaner that it ever has. I can’t wait to have them back to clean again!! If you’re looking for a company that is easy to work with and does a fantastic job this is it!!", "pics": null, "resp": {"time": 1553787708630, "text": "Hi! You're simply one of the sweetest clients. Thank you for re-booking for next week. As always, we will take GREAT care of you. We appreciate you giving us your feedback. See you then! Can't wait!!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107878638872796891398", "name": "Kay Walker", "time": 1570161511236, "rating": 5.0, "text": "Professional and sweet staff. They never disappoint and my house smells amazing for days. Highly recommend booking an appointment  today!", "pics": null, "resp": {"time": 1570822449964, "text": "Hi Mrs. Walker! Thank you for being a long standing client. We truly appreciate you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102941867359516803861", "name": "Karrie Roberts", "time": 1569296221999, "rating": 5.0, "text": "I have used this company for the past three months. Pleased with the work and customer service. I love coming home for work to a freshly cleaned home.", "pics": null, "resp": {"time": 1579277000900, "text": "You're the BEST! Thank you for allowing us to servicing you each month. We always enjoy it! See you soon!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "111346866988324214796", "name": "Yuying Liu", "time": 1574877479371, "rating": 5.0, "text": "I was really satisfied. At first I didn't know the living room didn't include our open kitchen. Our living room didn't need to be cleaned, but the kitchen was very messy. When I was annoyed that I had wasted my money, shan, the manager, told me that I could arrange a cleaning for us. This time, I not only cleaned the living room but also cleaned the kitchen. I will really come back.", "pics": null, "resp": {"time": 1575064589191, "text": "Hi Mrs. Yuying! We are thrilled that you are SATISFIED. We were happy to help. See you soon!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108868217058658753634", "name": "Chasing Bliss", "time": 1535391218894, "rating": 5.0, "text": "I have had my apartment cleaned by ECC about three times. Each time they have been amazing. My home is clean and smells good. They even arranged my pillows on my couch to look better than where I had them. :)Thank you so much to Princess and Annetta for all of their hard work! I will be booking again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110890189215333791300", "name": "Judy Fernandez", "time": 1549664691816, "rating": 5.0, "text": "Expert Cleaning Concepts delivers 1000% service AGAIN & AGAIN! Their team comes in and spot cleans to perfection! They are always\nprofessional, courteous and expeditious.\nI wouldn’t dream of calling any other cleaning company! Thank you Expert Cleaning, you truly are experts!", "pics": null, "resp": {"time": 1549665345030, "text": "Hello, you're the SWEETEST!! Thank you so much for everything. We love cleaning your home. You know each time you book we will ALWAYS take care of you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116764622546681856812", "name": "Jillian Martin", "time": 1483462122022, "rating": 5.0, "text": "ECC cleans my home twice a month and those are my absolute favorite days of the month.  It feels so good to come home to a perfectly clean home.  They are always so nice and professional.  They do a fantastic job and my whole house looks and smells amazing.  They always call me that afternoon to make sure I am happy with the services they have provided.  I have and do recommend them to everyone I know.  You will not be disappointed. They are reasonably priced and wonderful!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117242351400727799758", "name": "A True Worshiper of God", "time": 1561933205941, "rating": 5.0, "text": "Annetta and Princess they are really really great kids enjoy being around them they didn't even wake them up when they was sleep also they wash dishes you can help me folding clothes I was sick that day I'll recommend him to anyone who needs help what is a deep clean are just a few room they did an amazing job both bathrooms with shiny dishes with all nice to put it up if I was a little bit of clothes that I had all in all I was able to rest which was much needed", "pics": null, "resp": {"time": 1562204473008, "text": "Hi Chelsey, thank you for the feedback. Annetta and Princess are always great with children.:-)  This is one of our TOP things that we LOVE about them. We have enjoyed cleaning for you and look forward to the next visit. Once again, THANK YOU!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114800514346718231800", "name": "Michael Murray", "time": 1581186366911, "rating": 5.0, "text": "They have been extremely professional and I would highly recommend them. Very responsive to requests and glad I have someone I can trust.", "pics": null, "resp": {"time": 1582241079195, "text": "With utmost pride and joy, we thank you for your kind word of support, Mr. Murray. We dedicate our growth in the horizon to all wonderful customers like you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100699595257070906572", "name": "Kathryn Shepard", "time": 1502216208885, "rating": 5.0, "text": "Two ladies are just finishing up my house.   They went right to work and stayed busy.  They dusted and swept and mopped.  The house looks so much better than it did before they came.\nThis was a one-time experience for me but I have enjoyed it and look forward to a time when I can make it a regular thing.\nWell worth the money.  Thanks so much.\n\nKathryn Shepard", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103155446919752583176", "name": "Sarah Price", "time": 1564427099769, "rating": 5.0, "text": "Super kind, very accommodating to your schedule! Owner even makes herself available personally. Phenomenal service, will recommend to all of my Auburn friends!!", "pics": null, "resp": {"time": 1564511722463, "text": "Hi Sarah, it was my pleasure working with you.Smile\n\nThank you very much for allowing my company to service you\nand your friend Jessica.\n\n(Even if it consisted of me getting it done at 5AM for you, lol)\n\nPlease let me know if you ever need anything.\n\nYou’re the best! Awesome working with you. 💖❤💖❤💖"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107027897090134962823", "name": "Chasidy Mangram", "time": 1504825336576, "rating": 5.0, "text": "Just had some cleaners come to my house to do a 2 maids 2 hours general cleaning. I could not be any happier with the result! As soon as I walked in it smelled so clean and fresh. They did an amazing job and I would highly HIGHLY recommended their services to anybody. I can't wait for my next house cleaning!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107889072934309329949", "name": "Amy Trevathan", "time": 1506783962626, "rating": 5.0, "text": "I have always cleaned my house but recently my weekends have been so busy that I wasn't giving my house the best cleaning to my standards that I usually do. I saw an advertisement for Expert Cleaning Concepts,read the reviews and decided to give them a try. I've never used a cleaning service before to clean my house so I was a little nervous. I was concerned with \"will they clean it to my liking? \" \"will I have to go behind them? \" Let me just say they did a fabulous job! They were supposed to arrive at 3:00, they were early and started immediately. When I got home, my house smelled so good and clean. It was a wonderful knowing that my weekend is free to do whatever I want without worrying about cleaning the house! Thank you ECC, I will definitely be using you more in the future!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100266070019047702191", "name": "Thomas Chadwick", "time": 1483057552692, "rating": 5.0, "text": "I will recommend this cleaning company to all of my friends and family. Everything was GREAT from the beginning. Thank you all so very much, my home feels so fresh and clean and smells wonderful! I also loved the fact how well you all interacted with my dog as he (spot) is very much so an important part of my family :) I will DEFINITELY be using your services again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102768419342784697147", "name": "Walter Reaves", "time": 1483112897596, "rating": 5.0, "text": "I am so impressed on how they paid attention to listen and interact to figure out my exact housecleaning instructions and needs. My recent move-out clean order was quite extensive and must pass the building administrator's move-out inspection. I feel that these ladies are surefooted with their capability and they amazed me. Expert Cleaning Concepts fulfilled what they promise to deliver.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112504443166192090057", "name": "Katie Harris", "time": 1540244273265, "rating": 5.0, "text": "I love them.  They always call before they come and are punctual.  They  do a very thorough job and they take pride in a job well done.  They do anything that I ask them to do.  I  highly recommend them to anyone that needs this service.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117939400180264554729", "name": "Destiny Pitts", "time": 1591751715906, "rating": 5.0, "text": "Great Company! Highly recommend !", "pics": null, "resp": {"time": 1591792723583, "text": "Thank you Destiny for your feedback!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116877578422471464462", "name": "Alfreda Hyman", "time": 1580854644218, "rating": 5.0, "text": "Thank you so much for your Team of professional's, outstanding job!!!.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110640158932637651250", "name": "christian stirling", "time": 1533065431445, "rating": 5.0, "text": "Amanda and her crew did a fantastic job deep cleaning my trailer. ECC was able to come out on relatively short notice and was exceptionally thorough and ambitious with their cleaning, going above and beyond to make sure that the place was spotless. I would definitely hire them again in the future.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104745370467079555760", "name": "Gateway Life", "time": 1532488508343, "rating": 5.0, "text": "I'm so lucky I found such a great company. They are reasonably priced and extremely nice. I thoroughly enjoy the way they clean my house. It is emaculent EVERY TIME! If you are looking for a maid service in Columbus Ga I strongly suggest you call them...", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118335185031631477619", "name": "Kashundra Brewer", "time": 1546712947762, "rating": 5.0, "text": "I highly recommend Expert Cleaning Concepts! I have used them multiple times since moving into my home over a year ago.  As an entrepreneur, I need the relief at times of having others clean for me when my schedules doesn’t allow. With them, I don’t have to worry one bit about something being done right.  The staff is very friendly. What I appreciate most is that they clean as I would.    Small things that matter to me such as wiping my trash can etc are done.  I keep my home rather clean, but they find areas that to clean that some think are minimal.  I’m slightly OCD; so, I notice any and everything that’s not done.  They are the only cleaning service that I use because they are very thorough, and I trust them to get things done. They also have ᵃ loyalty card hat I utilize.  I’m almost on a new card. Thank you all for always helping me out.  I’m certain I will be calling you soon. It’s time for ᵃ deep cleaning with the spring cleaning add ons:)", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107950255920631393770", "name": "Lamar Winston", "time": 1578183638051, "rating": 5.0, "text": "Very professional and I will call again and I highly recommend ECC", "pics": null, "resp": {"time": 1579277034621, "text": "Thank you for recommending us Mr. Winston!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118319318063112743768", "name": "Safiyyah Thomas", "time": 1531881254586, "rating": 5.0, "text": "Excellent cleaning service! They are thorough and have budget friendly service packages. Very easy to book online and very friendly cleaners. When I needed a quick tidy up before houseguests or a move out cleaning they’ve always done excellent work for me.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109769051847816634942", "name": "Summer Williams", "time": 1547748639362, "rating": 5.0, "text": "I love that the ladies went the extra mile to help organize my kids rooms AND found cash and placed in in a spot where I would find it. I love \"extra\" and trustworthiness! ECC days are my favorite days!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118435376707180521324", "name": "Terry Carlson", "time": 1476407303023, "rating": 5.0, "text": "As Auburn engineering students my roommate and I have such demanding schedules, we are always stressed for time and the ladies at Expert Cleaning Services are exactly what we need.  They are extremely professional, trustworthy, and friendly.  This is the second time we’ve had them to clean (more like sanitize) our dorm room.  They do an awesome job cleaning.  They even wipe down baseboards, wipe down doors, wash dishes.  Thank you! Thank you! Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114239766676143793351", "name": "abby kelly", "time": 1372795167346, "rating": 5.0, "text": "Expert Cleaning Concepts came and cleaned my house on the very last day of my vacation. Even though I was out of town, communication was impeccable! I knew exactly when they arrived and left. It was so nice to come home to a clean home! They are extremely kind, conscientious and thorough. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113053840477731252677", "name": "JB Nesmith", "time": 1549670294474, "rating": 5.0, "text": "CC and Sabrina did a great job.  I look forward to them coming back.  Dusted, mopped, swept, cleaned restrooms, granite surfaces, all.  I am impressed.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115166044744683118107", "name": "Tracy Coxwell", "time": 1509108477175, "rating": 5.0, "text": "I really LOVE working for this company. You couldn't ask for a better company to work for. This company truly believes in making their clients happy. You couldn't ask for a better place. The owner, office staff, and cleaners are the greatest. Everyone truly needs to try us out, you won't regret it.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104711129362115307272", "name": "Anthony Bethea", "time": 1531969271193, "rating": 5.0, "text": "I was very impressed with the job the ladies did to my condo. They were prompt, professional and efficient. I highly recommend their services. Great Job Ladies!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103991226900615929922", "name": "Jimmy Johnson", "time": 1539449824639, "rating": 5.0, "text": "They did a great job on my condo last Friday! Just in time for game day! Amber and Brittany saved the day because I didn’t have time to clean. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114852603180393145345", "name": "Mia Wright", "time": 1591270399205, "rating": 1.0, "text": "Would not recommend. CEO treats her workers unfairly", "pics": null, "resp": {"time": 1591796503396, "text": "Hello Ms. Wright,\nThank you for being a former employee at Expert Cleaning Concepts, Inc. We have enjoyed training you this year. Here at our organization we treat each employees with the highest respect and fairness. As always, my door is open if you would like to speak with me.\n\nYou are bright and multi talented. We wish you the best in your future endeavors.\n\nBest Regards,\nMrs. Johnson\nCEO/ Founder"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112182567207196825589", "name": "Kara Bowling", "time": 1503684811150, "rating": 5.0, "text": "Expert cleaning concepts never fails to impress me with their cleaning. They always get up all the cat hair in my house which is a ridiculous amount. They leave the bathrooms and kitchen spotless and sparkling. I will continue to use them to clean my house!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118284415406835234820", "name": "Cheryl Waller", "time": 1477783429482, "rating": 5.0, "text": "This cleaning company is just what I needed! They were great from start to finish. Great customer service and professional staff made this move in a breeze for me and my family. They came in and got to work immediately. The house was a wreck from the previous owners. Full of cat fur and trash left behind. Appliances were so bad I thought we would have to trash them. But these lady's came in and cleaned house!!! Literally!!! I highly recommend giving them a call for your light cleaning all the way to the tough stuff. Thanks ECC for making this move so much better.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109047689239571478425", "name": "BeeTV Network", "time": 1433865719197, "rating": 5.0, "text": "I am a very busy mother of 3 that works from home. My schedule is so hectic that my house looked a mess until I contacted Expert Cleaning Concepts. These ladies were so professional and left my house immaculate. My baseboards, windows,  and bathrooms were left spotless. I am very satisfied and HIGHLY RECOMMEND THIS COMPANY. Speaking as a busy mom, this company has made it possible for me to spend time with my children instead of worrying about keeping my house clean. CALL THEM TODAY...THIS IS ONE HAPPY MOTHER!!!!!! #bestcleaningcompany...#spotless...#professional..#VERYAFFORDABLE..", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118284415406835234820", "name": "Cheryl Waller", "time": 1477783429482, "rating": 5.0, "text": "This cleaning company is just what I needed! They were great from start to finish. Great customer service and professional staff made this move in a breeze for me and my family. They came in and got to work immediately. The house was a wreck from the previous owners. Full of cat fur and trash left behind. Appliances were so bad I thought we would have to trash them. But these lady's came in and cleaned house!!! Literally!!! I highly recommend giving them a call for your light cleaning all the way to the tough stuff. Thanks ECC for making this move so much better.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101266854275208688764", "name": "Kenny Mathews", "time": 1412944853813, "rating": 5.0, "text": "Thumbs up! Great prices. Early response time. And very thorough. I will recommend and re-hire when needed.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114852603180393145345", "name": "Mia Wright", "time": 1591270399205, "rating": 1.0, "text": "Would not recommend. CEO treats her workers unfairly", "pics": null, "resp": {"time": 1591796503396, "text": "Hello Ms. Wright,\nThank you for being a former employee at Expert Cleaning Concepts, Inc. We have enjoyed training you this year. Here at our organization we treat each employees with the highest respect and fairness. As always, my door is open if you would like to speak with me.\n\nYou are bright and multi talented. We wish you the best in your future endeavors.\n\nBest Regards,\nMrs. Johnson\nCEO/ Founder"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115950905889734854459", "name": "Jasmine Grady", "time": 1529860315692, "rating": 5.0, "text": "ECC was highly recommended by my sorority sister. The move out cleaning covered everything on the checklist. Honestly, after the packing it was almost impossible to clean the required areas. Thank goodness, this process is now over! I’m relieved. #NextChapter If this help my cleaners were Donna and Leah.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108673515943946926719", "name": "Amanda Streeter", "time": 1429814792047, "rating": 5.0, "text": "This is such a great group of ladies. They have an excellent response time, and they always do such an outstanding job. I had the pleasure of working with Kelly and Ms. Spence this past Saturday and they made my home smell and look soooooo great! I will continue to use them in the future!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113136178084007975127", "name": "Mariel Morris", "time": 1402336572192, "rating": 5.0, "text": "Stephanie always make sure my apartment is cleaned thoroughly each month. She has a great attitude  and always work the FULL 3 hours without taking breaks and wasting time. In the near future I would like to see more later appointment options.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107249343471398435740", "name": "Mike Simpson", "time": 1496950508935, "rating": 5.0, "text": "Expert Cleaning Concepts is by far the best!!  Their staff is attentive to any clients needs and will go above and beyond to ensure total customer satisfaction, from general cleaning to deep cleaning they will make you smile with joy!  Go ahead and contact Expert Cleaning Concepts relax and watch them work!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115551111312862943807", "name": "Cambrie Rodriguez", "time": 1504824988428, "rating": 5.0, "text": "This company absolutely blew me away! From the moment I called and spoke with the office to book my appointment to the moment the girls left. I feel like so much has been lifted off my shoulders. Thank you so much ECC for everything. Will definitely be booking for recurring and referring to all my friends! Tha k you again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102873294952714261317", "name": "craig milbry", "time": 1546713170695, "rating": 5.0, "text": "Great service friendly staff on time , the ladies That clean my house was really good thanks a million", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108530670554064952284", "name": "Marlin Ross", "time": 1540139513510, "rating": 5.0, "text": "I will hire again. They’re the only company that answered my call. The prices are good.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115950905889734854459", "name": "Jasmine Grady", "time": 1529860315692, "rating": 5.0, "text": "ECC was highly recommended by my sorority sister. The move out cleaning covered everything on the checklist. Honestly, after the packing it was almost impossible to clean the required areas. Thank goodness, this process is now over! I’m relieved. #NextChapter If this help my cleaners were Donna and Leah.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113136178084007975127", "name": "Mariel Morris", "time": 1402336572192, "rating": 5.0, "text": "Stephanie always make sure my apartment is cleaned thoroughly each month. She has a great attitude  and always work the FULL 3 hours without taking breaks and wasting time. In the near future I would like to see more later appointment options.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108275023047912605165", "name": "Brianna Hera", "time": 1483081973697, "rating": 5.0, "text": "So happy to say here that I have made the right choice. Been away from home for so long chasing a college degree and working here in AU and it's the first time that I felt cleanliness like being at home. The ECC girls cleaned my room and entire apartment unit spotless like my mama did. Thank you, ECC.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103318462852348940635", "name": "Nikki Dictson", "time": 1502818102259, "rating": 5.0, "text": "Expert Cleaning Concepts is the Best Cleaning Service! The ladies work hard the entire time and always have a smile, while they do a fantastic job cleaning your house.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107848434492046120628", "name": "Samson", "time": 1518114372913, "rating": 5.0, "text": "I requested for a quick clean up of my room in the university, they came on time and the job was wow. My friends came around and gave good comments too. I will order your services again when next they come back to Ashburn.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118425714014203837363", "name": "JILL Yates", "time": 1374848594639, "rating": 5.0, "text": "I can't say enough about the ladies that cleaned my parents home and the job that they did.  They took so much time making sure that everything was spotless and were so pleasant to work with.  I had the deep scrub cleaning and highly recommend them.  I am about to use them again for a new home that my son bought.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106209724040989279245", "name": "linda lulu", "time": 1531700001184, "rating": 5.0, "text": "The Cleaners, Shandra and A’Jah, were very friendly and rendered excellent services. I highly recommend their cleaning services!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102628049821551295426", "name": "Leonard Davis", "time": 1461446918403, "rating": 5.0, "text": "Great experience. Milan and Kay were sent to my residence in auburn. Both were very mannerable, fast paced, and knowledgeable. I would recommend this company to all friends and family.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110976598699256692798", "name": "Sapphira Glemaud", "time": 1510159847444, "rating": 5.0, "text": "Expert Cleaning Concepts has been so helpful! The are friendly, and do a great job! Easy to work and great staff!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109959029412277311481", "name": "Robert Moore", "time": 1401390805396, "rating": 1.0, "text": "They wont show up, hope your not on a timeline!!!\n\nAfter talking me into not using somebody else......\nNow I have to figure out how to get this stuff done before the realtor and potential buyers get here.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104522017529299006958", "name": "Kaitlynn Griffith", "time": 1444177429731, "rating": 5.0, "text": "Great communication up until my scheduled cleaning, during, and after... My home was cleaned thoroughly and I highly recommend this company to anyone looking for any type of cleaning service!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108741892956220787308", "name": "Maurice Maynard", "time": 1468427556550, "rating": 5.0, "text": "My parents have been using EEC for years. Now, they are cleaning my apartment once a month. So far, so good!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101720240630427836575", "name": "Sweetest Taboo", "time": 1493679427529, "rating": 4.0, "text": "The office staff is very friendly. I filled out an online form and Shan called me back within 7-10 minutes. LOL Whew! That was fast. Earlier that day I contacted 2 other cleaning companies and no one called me back. :-(  Well, I made the right choice. I LOVE Cierra and Stephanie. I will use them again within a few months.\n\nGreat job! I did give them a tip.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114805257130833004862", "name": "Ashley Castellanos", "time": 1510082317862, "rating": 5.0, "text": "Always do a great job when they come to clean my apartment which is sometimes not the easiest. Also some of the nicest people I know and can't wait to have them back!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107319579532920140158", "name": "craig milbry", "time": 1476486074075, "rating": 5.0, "text": "Great on time friendly and did a spectacular job I will recommend them", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109812373624233462276", "name": "Alexia Frazier", "time": 1476118000644, "rating": 5.0, "text": "Just had my home cleaned for the 3rd time by ECC !! Can't wait to see them again in 2 weeks !! Thanks for such a clean home !!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112602673595764642087", "name": "Malcolm Waller", "time": 1531536502731, "rating": 5.0, "text": "Complete and a very professional service , I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114200510035851251593", "name": "April Nicole Baldwin", "time": 1440797083657, "rating": 2.0, "text": "I am a recent college graduate who resides in Tuskegee, AL (about 20 mins from Auburn). I work two jobs (6 days out of the week) and have been in the process of moving for almost a month now. I want to have my apartment deep cleaned before I move my belongings in. When I called yesterday to set up the appointment, the service award great! Quick and easy to schedule. However today when the appointment was scheduled to take place between 12 and 4 pm,  I received no call to let me know that someone was on their way by 3:30. I called the 334 number twice; no one answered. I went to their website and   contact Sunny, the online chat window saying that no one had contacted me. She said that a representative would be right with me. Someone called maybe ten mins later to say that THEY HAD TO CANCEL THE APPOINTMENT. THEY SAID THAT ONE OF THE CLEANERS HAD A BAD EXPERIENCE IN THE AREA AND WASNT COMFORTBALE COMING OUT. These sentiments are fine and dandy but I WAS GIVEN NO PRIOR NOTIFICATION THAT MY APPONTMENT WAS CANCELLED. Not a good way to conduct business.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103017026143909547504", "name": "Stewart Tucker", "time": 1456878281987, "rating": 5.0, "text": "Great and reliable service. Friendly owner and home-like staff.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103683150031052602923", "name": "Andrew Carlson", "time": 1483993839210, "rating": 5.0, "text": "They are quick and easy and they get the job done.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108983120423545411580", "name": "Service AtYourFingertips", "time": 1457011804689, "rating": 5.0, "text": "Professional and works fast definitely would recommend trying", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103811149479830548007", "name": "Marques Johnson", "time": 1504714195419, "rating": 5.0, "text": "Excellent services provided! Friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109980234675059941930", "name": "Kev Nelson", "time": 1484244944360, "rating": 5.0, "text": "Outstanding Service! Will do business again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116804740643912465772", "name": "Sherry Grady", "time": 1583104764825, "rating": 5.0, "text": "Amazing company!", "pics": null, "resp": {"time": 1583169633453, "text": "It was our pleasure Mrs. Grady, thank you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105643398145437006129", "name": "Chris Welcher", "time": 1453639011352, "rating": 2.0, "text": "They came in started to clean then told us we don't do this and we don't do that for the price I expected a whole lot more would not use them again", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100711150458318956129", "name": "B Wynn", "time": 1517428826493, "rating": 5.0, "text": "Great friendly servicce!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115324876343662504455", "name": "Stephanie Young", "time": 1483999873845, "rating": 5.0, "text": "Very pleased with my services!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107426788892051884179", "name": "Ambee Lockhart", "time": 1580444273998, "rating": 5.0, "text": "Great service!!!!I was so speechless!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103932921099262004821", "name": "Harry Williams", "time": 1505748185173, "rating": 5.0, "text": "Excellent service.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112186263054173495166", "name": "Shea McCutchen", "time": 1498329377905, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105643398145437006129", "name": "Chris Welcher", "time": 1453639011352, "rating": 2.0, "text": "They came in started to clean then told us we don't do this and we don't do that for the price I expected a whole lot more would not use them again", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116420244137357543862", "name": "Bekki Humphreys", "time": 1616123499137, "rating": 5.0, "text": "Darnell, was amazing to deal with on scheduling. I had originally called for a service they did not provide. He took time out of his day to phone me back and provide contacts for other local businesses who could help me. Shortly after, we were able to work with them again on another contract. They provided carpet cleaning and tile cleaning on that job. The tech phoned beforehand and was very polite and professional. The homeowner called us afterwards to tell us how happy they were with not only the service they provided but with how polite and kind the tech was!  How refreshing is that?  I would not hesitate to use or refer them again!  Thank you for a job well done and customer service that exceeded my expectations!", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "106237215284503393265", "name": "Ann Ferrante", "time": 1619356673762, "rating": 5.0, "text": "Mom's very happy with her clean carpets.", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "110145176384895131099", "name": "Penny Gunter", "time": 1574709299938, "rating": 5.0, "text": "Excellent customer service and easy scheduling around renters. I highly recommend Deep South Floor care.", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "107882962382502180460", "name": "Susan Flowers", "time": 1376583872339, "rating": 5.0, "text": "Just had the guys from Deep South Floor Care leave my residence...I had them do living room, hallways, bedrooms, plus 2 chairs....I am TOTALLY AMAZED!!! They did a fantastic job, were VERY professional, and paid such attention to detail!! Highly recommend them for your flooring needs--as well as upholstery cleaning!!  Rates are more than reasonable and i am just at a loss for words on what a difference they made for my home!! Thank you so very much for the excellent service Deep South Floor Care!", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "115080367339247446630", "name": "melinda thompson", "time": 1614177220639, "rating": 5.0, "text": "Very friendly bunch!", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "103233750565246896475", "name": "Gene Montecchie", "time": 1533438781460, "rating": 5.0, "text": "Best carpet and tile cleaning company in the area. We've contracted out several jobs to them. Some small some large. Always friendly, prompt and professional!", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "100352440977357832117", "name": "Luna Beach Properties, LLC", "time": 1375885947013, "rating": 5.0, "text": "I own a vacation rental company here on the Alabama Gulf Coast and have been using Deep South exclusively for over 2 years.  The Owner and staff of the company are great to work with, prompt, and professional.  I typically schedule my carpet and upholstery cleaning between tenants, however occasionally they have to enter during a reservation and all of my tenants have been pleased with their performance!", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
{"user_id": "109695274182298254790", "name": "Cliff Buelow", "time": 1434131264414, "rating": 5.0, "text": "We just had our carpets and some furniture cleaned and also had a mold check done.  Deep South did a great job and the entire crew was good to work with.  I will definitely use them again and highly recommend them to all.", "pics": null, "resp": null, "gmap_id": "0x889a1039d59edb87:0xbb9f72643efea9a9"}
