{"user_id": "102857782809998609351", "name": "Scott Stafford", "time": 1502151952560, "rating": 5.0, "text": "Painted Bluff is not an easily accessed park. I know that seems to be a recurring theme with the places I post. It is not really a park at all. It is one of the most sacred sites in the South for Native Americans. It is owned by the Tennessee Valley Authority. Over the past few decades, The Painted Bluff has been visited by many Archaeologists who have declared it to hold one of the highest concentrations of ancient Native American artwork that has received protection from the elements by the high overhanging limestone and sandstone cliffs and is now receiving protection from the T.V.A. who will impose a hefty fine and jail time to anyone caught rock climbing, repelling, or looting the area. I am not sure if it received its name from the art work or from all of the colors in minerals that run down the cliff face like megalithic abstract art. The bluff faces almost due south so it provided a sun drenched Winter haven for the natives. Geographically, it is an important location because it is where a large mountain chain meets the mighty Tennessee River. At its highest point, it is 1000 feet above the river. The most impressive part of it (see photos) is a ledge that wraps the bluff about 100 feet above the river and ranges in width from 10' to 20', which gives the impression that it was once a well traveled path before the days that motorized vehicles could take us over the mountains. From the old maps I have studied, it could very well have been a well worn part of the trail of tears. Since it is less than 2 miles from the Guntersville Dam, the river meets it with a high current that has slowly chipped away at the mountain for thousands of years. Before the  dam was built, there was even more current barreling down Appalachia. At the base of the bluff you can see where a large boulder , the size of 2 or 3 houses, fell off the mountain , into the water. It is above this boulder, where you can see cave like formations on the cliff face that were once inside the mountain. Just down stream from this boulder is one of the only locations to dock a kayak or canoe. If you tried to tie off a larger boat here, the swift current would bang it against large rocks every time another boat passes. As stated before, this place is well protected. It usually takes your visiting fee in blood. The large stones below the water line are so slippery, they will take your feet out from under you so fast that even the best water boots are no match for them. Be extremely careful and respectful of this place. Every foot step demands your full attention.", "pics": null, "resp": null, "gmap_id": "0x886208242daef9b1:0x3a07cf2be0e786e4"}
