{"user_id": "114386229643322950030", "name": "Marissa Gray", "time": 1620687230819, "rating": 5.0, "text": "I completed the \"exhausted to energized\" program for the entire 28 days. I got great nutrition advice and guidance from Elliot. I felt like I truly got a custom fitted program to suit my lifestyle and body type. This program is a must if you need to kick start your journey to wellness. I am so thankful for everything I have learned and the welcoming \"come as you are\" environment. I also got great coaching on my form from taking classes with Jordan. The coaching alone is worth every penny.", "pics": null, "resp": {"time": 1620691630215, "text": "Thank you for the awesome review Marissa. We loved coaching you and having you as a member of the community!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108431653036663182849", "name": "Tabitha Eldridge", "time": 1617731285552, "rating": 5.0, "text": "Live ready fitness is a great gym for beginners and professionals alike. The coaches are great at finding what works for you and offer the best advice whether it be something to do with nutrition or with an alternative work out. The environment is friendly and vibrant. The classes are hard work but worth it. I highly recommend to anyone ready to learn and put in work!", "pics": null, "resp": null, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "104225158991119273813", "name": "Cody Abbey", "time": 1615573196672, "rating": 5.0, "text": "Elliot is an incredible coach. His knowledge, leadership, and mentorship will quickly assist anyone in ascending to the highest version of themselves. Anyone considering joining this program will join an environment that caters to the maximum growth of the mental/physical wellbeing of any individual!", "pics": null, "resp": {"time": 1617284273133, "text": "Cody thank you so much for the review. You help us to ascend to higher version of ourselves as well. Thank you again!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "100994938055288720195", "name": "Lisa Fountain", "time": 1600871330093, "rating": 5.0, "text": "I met gym owner, Elliott Quinones, about 8 years ago. I was impressed with his knowledge and ability in the area of health and fitness. Elliott is all about community. He's played a huge role in helping me establish my non-profit, Scarlett's Closet . He's even a member of my board.\nLast year, after attending one of the fundraisers Live Ready hosts for us annually, I saw pictures of myself at the event and realized I needed to take control of my life and be the healthiest version of Lisa I can be. I started doing workouts in my home and making better food choices. By May of this year, I'd lost 41Lbs, but the scales had stopped moving. I reached out to Elliott and he told me I was most likely in a calorie deficit.  I recall my response; I laughed at him. He encouraged me to sign up for  a \"Love to Eat Challenge\" Through this challenge, I was taught what to eat and how my plate should look. I am happy to report that I won the challenge and to date, I have lost 64lbs. I am wearing the smallest clothes I've ever worn as an adult. I recently had surgery and  Elliott has asked me to start training with him once my Doctor clears me to do so.  In the past, I would have said, \"No way.\" Now, I have the confidence I need to accept the challenge.\nIf you are looking to make positive changes in your life, I urge you to contact Elliott and his team. They are not only the best at what they do, but some of the nicest and most encouraging people you will ever meet. You won't feel pressured or intimidated. I am grateful for all their help and encouragement. I've never felt better. Isn't it time you took the first step to a healthier you? call them today!\nLisa P. Fountain, Founder\nScarlett's Closet", "pics": null, "resp": {"time": 1617284647921, "text": "Thank you Lisa. We love and appreciate you very much and the entire staff could not be more proud of you."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111086362665601498961", "name": "Nina Fletcher", "time": 1602528480248, "rating": 5.0, "text": "Upon arriving in Columbus, I was looking for a gym that would be mindful of past injuries and would help me build up to a healthy place.   Having been a gymnast I deal with a lot of neck issues and was worried I would not find a place that could help me work with through them. Thus, I spent a lot of time researching different options in the area and several individuals recommended Live Ready Fitness.  So I took a leap of faith and I scheduled a consultation.  I walked away feeling optimistic about their one-on-one approach.  I started working with Coach Elliott who has been instrumental in helping me make strides in my personal health journey. They have not only worked with my injury but also have shown me ways to make it better. Overall, I highly suggest you see Coach Elliott at Live Ready Fitness (or anyone of the amazing Live Ready staff!) if you are looking to make a change and interested in working with an all-star staff that provides the utmost competence!", "pics": null, "resp": {"time": 1617284600681, "text": "Thank you Nina! We appreciate you trusting us with your health. You are an All-Star client!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "107299731371495355114", "name": "Fonda Board", "time": 1609447061202, "rating": 5.0, "text": "I came from your regular “Globo gym\", and let me tell you, I have never experienced a workout like this. It is challenging in the best way possible. Coach Elliott not only walked me through how to do every movement, but he also explained best nutrition practices, and taught me how to approach each workout with a purpose. The entire team and the community are so nice and were very welcoming. Since I’m coming to a new city with no friends that was very important to me. This has been an overall great experience.", "pics": null, "resp": {"time": 1617284422549, "text": "Fonda, we are so excited you allowed us to help you reach your goals and even more excited that you have a community of friends now!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "109044070283296400954", "name": "Heidi Cummings", "time": 1600443630741, "rating": 5.0, "text": "As someone who has worked in fitness for the last 8 years, I can say with confidence that Live Ready Fitness is the best gym in the Columbus/Phenix City area. Elliott has taken the time to become highly educated in all things fitness and nutrition, and he has built a professional, world class team of coaches around himself. Elliott invests in his employees, so that they can all collectively invest in their members. If you're in the area, do yourself a favor and try out Live Ready Fitness. Guarantee you won't regret it.", "pics": null, "resp": {"time": 1600798191462, "text": "Thank you for the amazing review. We are so lucky to have you as part of the team and community."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "105113653461296016232", "name": "Chase Etheridge", "time": 1613526718587, "rating": 5.0, "text": "This place will seriously get you in shape. I’ve lost 20 lbs and feel better than ever!", "pics": null, "resp": {"time": 1617284327916, "text": "Thank you Chase! We see the change in you and love it!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "117927060279939149817", "name": "Rebecca Jungman", "time": 1596830812329, "rating": 5.0, "text": "I waited to join Live Ready because the price of the gym is a little higher, but honestly after the first session, I realized they are worth every penny. The care and attention Elliott and his team give is unmatched. They truly care about every one of the people they work with. Oh and bonus the facility is amazing! I absolutely recommend joining this family, because that is exactly who you become to the coaches and fellow athletes.", "pics": null, "resp": {"time": 1600798404596, "text": "Thank you Rebecca. We truly appreciate our medical professionals and are honored to help take care of them because you all deserve it! Thank you again for being part of our community!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "104139549124711395380", "name": "Stephanie Swoger", "time": 1600797232446, "rating": 5.0, "text": "If you think that you are too injured to workout you are wrong. I have been recommended to have two knee replacements and a shoulder replacement (after one has already failed).  I was in constant pain. I had given up and being a former member of Live Ready and seeing all the new programs they had started I thought this is my last hope. Coach Elliott was completely honest with me and said there were no guarantees but he thought that he could help. After three sessions a week for the last month I already move better, see strength gains and my knees hurt significantly less. That is only outweighed by the fact that THIS TRULY IS THE BEST HOUR OF MY DAY. The coaches and community have so much care for one another it is inspiring. Everyday is new challenge but I am incredibly excited for what the future holds.", "pics": null, "resp": {"time": 1600798144115, "text": "Thank you, Stephanie Swoger. It is such a pleasure being able to work with you and seeing the amazing progress you have been making. The team and I are committed to getting you to your healthy happy place! Thank you again!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "101082735705390426901", "name": "Stephanie Hawkins", "time": 1602796015861, "rating": 5.0, "text": "Mom’s who don’t think they can do it, I am here to tell you that you can. I have twin toddlers, I was not eating enough food to keep my energy up throughout the day up and somewhere I lost myself. Coach Samantha and the Live Ready team changed that. After just a few sessions, my body started to change, my mood and sleep was so much better, and my confidence soared. My husband even noticed the change in me. I feel unstoppable and can do things for myself and my family that I didn’t ever think I could do. If you are hesitant and think it is not possible, SEE COACH SAMANTHA, she truly cares about her clients!Take back control of your life.", "pics": null, "resp": {"time": 1617284534232, "text": "Stephanie you are an inspiration to moms and people everywhere! Seeing that kind of change in someone fires us up!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "103227992240279174487", "name": "Andrew Pate", "time": 1588191184802, "rating": 5.0, "text": "I will state that even know my time here was short. The staff of coaches are super supportive, knowledgeable, and dedicated to their team of clients.\n\nKnow that they have gone above and beyond in these difficult times. Providing continuous support and training with creativity.\n\nOverall I would highly refer this gym to each and every individual I meet. You will not be disappointed.\n\nBig Shoutout to Coach Sam, she is awesome. Very knowledgeable and has a keen ability to apply what’s most effective for any limitations you might have with your physical aptitude.", "pics": null, "resp": {"time": 1600798441042, "text": "Thank you Andrew. We are glad we could make an impact in such a short time. Please reach out if we can ever help you with anything!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "116524602457502282858", "name": "Carli Culpepper", "time": 1596833137623, "rating": 5.0, "text": "My knee pain was so bad I honestly thought I would never be able to do some of the things I loved again. It was affecting my workout, my job and my entire state of mine. Within 4 weeks of working with Coach Elliott and the Live Ready Fitness team I was pain free and back to living my life again. Elliott and his team are absolutely amazing. If you have joint pain go, see them!", "pics": null, "resp": {"time": 1600798352741, "text": "Thank you Carli! We are so happy we could help but it is is always so much easier when we have a fantastic client like yourself!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "101245048342810602460", "name": "Sabrina Robertson", "time": 1580742700075, "rating": 5.0, "text": "I was searching for something to help me get my weight under control and stumbled upon an ad for CrossFit Deprivation on Facebook. They were doing a 6 week challenge and that sounded like a great jump start. I worked with one of the coaches and she suggested just giving it a try. I did and I completely fell in love with the whole experience. The workouts were challenging but could always be modified to fit me and what I was able to do and they were always different. The community was so supportive and encouraging that I wanted to go back everyday for a new challenge. They helped me with nutrition and have taught me how to feel good by eating to fuel my body's performance and feeling good about how I look has been a pleasant side effect of trusting that process. I have gained confidence, motivation, strength, and friends. It's been 2 years now and I wouldn't want to go anywhere else. This place is like a second home and the people are like family. If you are a human and need help with health or fitness, this is the place to go! It's so much more than a gym! Give it a try and you will fall in love with it, too!", "pics": null, "resp": {"time": 1600798605854, "text": "Thank you Sabrina. You truly are such an impactful member of our community and have grown so much as well as helping us grow as coaches. Thank you again!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "101829971403035980959", "name": "Kayla Brossard [Student]", "time": 1597346898426, "rating": 5.0, "text": "Ya’ll I hated working out! And when I tried I would always feel some sort of pain in my knees and hips. I also always felt lost when I went to a gym. Elliott and the Live Ready team have changed my tune. Within 4 weeks my knee pain was gone. Not only that but, the workouts keep me interested and I feel so accomplished after. I can already see changes in my body as well! I am so excited to see what I can do and how I feel over the next few months. DO NOT WAIT. IT WILL CHANGE YOUR LIFE. #ConfidentAF #LiveReady", "pics": null, "resp": {"time": 1600798274714, "text": "Thank you Kayla! We had so much fun taking you through foundations and can't wait to see your progress in class!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "104440799821795226810", "name": "Kurt F", "time": 1569416892708, "rating": 5.0, "text": "Excellent facility.  Staff is not only very knowledgeable, but extremely approachable you can feel that they care about your process just as much as you do.\n\nMy experience through the PT sessions was one of tailoring it to my ability and my schedule it didn’t just feel like some walk through you had to complete to get to the next level.\n\nIf your looking for a place to feel welcome and to be challenged, you’ve found the right place.", "pics": null, "resp": {"time": 1569461365770, "text": "Thank Kurt! We are so pumped to have you in classes and as a part of our community. Thank you for trusting us with your health, wellness and fitness. We look forward to crushing some goals with you."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "105656404628516820507", "name": "Taylor Strawder", "time": 1570539142026, "rating": 5.0, "text": "Hands down the best gym I’ve ever joined. I came to my first class a little over a year ago and was scared at first but the coaches work with every and anyone and they have made my experience with CrossFit AWESOME. The coaches always do their absolute best to make sure we are performing the movements correctly and most importantly safely. This gym has definitely taught  me I can do a lot more physically then I ever thought I could and I will forever be grateful for all the help from these amazing people!", "pics": null, "resp": {"time": 1570638187833, "text": "Thank you so much for the review Taylor! We will forever be grateful for the kind words. It is so awesome seeing your progress through your fitness journey and we all look forward to seeing you continue to kill it!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "103809351838702986269", "name": "David Anderson", "time": 1585099071536, "rating": 5.0, "text": "Elliott has a unique and elite approach to fitness. Whether your goals are general wellness or higher levels of performance Elliott and the other coaches will be able to accommodate. I have been to CrossFit gyms on 6 continents and I have never seen this model or been so catered to my needs. Elliott is a positive coach that has an understanding of each individual’s fitness goals and how you can achieve them. I am currently an athlete at CFD and cannot speak highly enough about the coaches or facility.", "pics": null, "resp": {"time": 1600798517801, "text": "Thanks David. We truly appreciate the review and love watching you absolutely crush it in and outside of the gym."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "117604165026626808981", "name": "vicki ijames", "time": 1583879464438, "rating": 5.0, "text": "I really respect the coaching staff with Crossfit Deprivation. They pay attention to safety and which is so important in Crossfit. If you have a pain or an injury, the coaching staff ensures that athletes are going to workout safely without further injury.  I appreciate coaching I've received and the personal attention to my injuries and training needs. The staff is cohesive and work together as a team and is such a welcomed experience!", "pics": null, "resp": {"time": 1600798551606, "text": "Thank you Vicki. Coming from an incredible athlete like yourself that means alot. We appreciate you!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111925385067674754689", "name": "Thomas", "time": 1568332324991, "rating": 5.0, "text": "One of the most professional businesses.  Best coaches I have worked  with Sam and Jacqueline are awesome.  I give them 2 thumbs up👍👍", "pics": null, "resp": {"time": 1568392435218, "text": "Thomas thank you for that absolutely awesome review. We look forward to helping you crush all of your goals moving forward!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "100661631522464726009", "name": "Thestayathomepawmom", "time": 1561903408349, "rating": 5.0, "text": "This is an amazing gym and community! The coaches at the gym are there for you 110%, there is never any judgment, only people cheering you on and helping you be successful and reach your goals. You get a coach for life and Allison Shiver is my girl! She knows her stuff, is funny, kind and genuinely there for you. You not only get an amazing coach with her but a great friend. It doesn't matter your skill level this place will challenge you in the best ways! If you have any doubts go see coach Alli, she'll change your mind 😉", "pics": null, "resp": {"time": 1569461667248, "text": "Thank you so much for the love! We love being your coaches and friends for life."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "104156595155013881457", "name": "Hillary Stamey", "time": 1550519976392, "rating": 5.0, "text": "CrossFit Deprivation is the best gym that I have ever walked into. The positive attitude and sense of community is absolutely contagious. The staff and coaches are kind and attentive. They work along side you, encouraging you, and pushing you to reach your full potential. I decided to participate in a weight-loss challenge on a whim and have found a place that I have come to love. Put in the work and give it a chance, this place will change your life.", "pics": null, "resp": {"time": 1617284895182, "text": "Thank you so much Hillary. Working with clients like you changes our life as well!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "109741067876038940789", "name": "Britney Moffett", "time": 1559757702365, "rating": 5.0, "text": "I’m so glad I joined! I’ve never done Crossfit before and I love it because it feels like one big team/family. The workouts can be challenging, but that’s expected. The meal plan is something that I can definitely stick with and the team is so helpful. I will definitely continue after the 6 week challenge!", "pics": null, "resp": {"time": 1617284693367, "text": "Thank you for the review Britney! We are glad we could help and thank. you for being part of the family!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "103390294595915098665", "name": "gregory walters", "time": 1547044151885, "rating": 5.0, "text": "I love this place, it’s one of the best decisions I have made in a long time. The staff/coaches are amazing. Every workout gets broken down step by step before the start of every workout. All the coaches are super approachable and knowledgeable. Everyone gets treated with respect, and it’s a judgement free environment!", "pics": null, "resp": {"time": 1547655233789, "text": "Thank you so much for this absolutely amazing review Gregory. We love having you as a part of this community and look forward to working with you. We work so hard because of people like you!\n\n-CFD Team"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "117405758118205175509", "name": "D. Neely", "time": 1515292626682, "rating": 4.0, "text": "I participated in the 6 week challenge and I loved every minute of it. The staff is very knowledgeable and motivated to helping you reach your goals.  Not only is the staff/trainers awesome the atmosphere is amazing and very positive. The members are just as encouraging and supportive. I would recommend this gym to any and everyone!", "pics": null, "resp": {"time": 1515533034836, "text": "Congrats on your 6 Week Challenge, Deej -- isn't it a great feeling? We're so glad you joined us. We hope to see you again soon! -Elliott Q, Owner"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "110426323330229753526", "name": "Emily Clymer", "time": 1572979520074, "rating": 5.0, "text": "Seriously one of the best gyms I’ve ever been to! Super personalized and everyone is crazy friendly and supportive!", "pics": null, "resp": {"time": 1600798657792, "text": "Thank you Emily. You have been such an incredible addition to our community we feel like w should be thanking you!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "100579627719920530412", "name": "Jayson Teague", "time": 1518962446223, "rating": 5.0, "text": "This place amazing.  It is a real personable experience to work out here.  Every class time has multiple coaches that actually take the time to coach and not just watch you workout. I did the 6 week challenge there and became a member afterwards.  Great place and family.", "pics": null, "resp": {"time": 1518963091457, "text": "Thank you so much for the awesome review Jayson, though I think it should say I crushed the 6 week challenge there and stayed as a member. :-). We are so happy to have you as part of the community and we look forward to help you achieving your goals not only in fitness but in life! Keep on killing it and we look forward to seeing your progress!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "109730173678558038742", "name": "Brian McNally", "time": 1467831644338, "rating": 5.0, "text": "CrossFit Deprivation is a phenomenal Box with world class facilities and friendly and knowledgeable coaches. Coach Elliott's programming is top notch. My fellow athletes and I are consistently improving our form, strength, and mastery of the more complex skills. Our Box is very family friendly and you will not find a better facility, available classes, and programs for the price!!!", "pics": null, "resp": {"time": 1492536253971, "text": "Thank for the great review! You will always be a part of the CFD family."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "112170070063920754621", "name": "Avery Mclean", "time": 1518834319514, "rating": 5.0, "text": "I just finished my 6 week challenge and I have nothing but amazing things to say about this gym. When the coaches say trust the process that could not be more sound advice. It doesn't matter if this is your first time in the gym or if you are athletic they will treat you with dignity and respect every moment. I am excited at my progress and I can honestly say Deprivation is worth your time. The coaches are helpful and very knowledgeable and can fine tune a plan that will help you reach maximum success! If you haven't signed up you are missing out!", "pics": null, "resp": {"time": 1518877886843, "text": "Thank you so much for the awesome review! We absolutely loved working with you and thank you for allowing us to be your guides on this fitness journey!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "114359840358527518683", "name": "Johran Bethea", "time": 1554753594369, "rating": 5.0, "text": "I did the 6-week challenge. Crossfit Deprivation is a wonderful place. The coaches keep you motivated and are very attentive and knowledgeable. They also break down every excercise step by step before the workout so you know exactly what to do and provide plenty of modifications for people of all fitness levels.", "pics": null, "resp": {"time": 1617284729583, "text": "Thank you Johran. You are a wonderful client!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111937336948805806863", "name": "William Kinsey", "time": 1544211436118, "rating": 5.0, "text": "I was traveling to Columbus and did a drop in at Crossfit Deprivation.  It was a fantastic experience.  Coach Daniel was the 5:30am instructor and he was outstanding.  He made me feel welcome and was very attentive during the workout by giving me tips to improve my form/performance.  I really appreciated this.  The box is amazing.  It is very large and has a lot of equipment.  I travel to Columbus quite a bit on business and have worked out at other gyms in the area.  Crossfit Deprivation is by far the best.", "pics": null, "resp": {"time": 1547655552484, "text": "Thank you William for the absolutely stellar review. We are committed to helping every athlete that steps foot through our doors and making sure that they have a home when they come visit. We very much look forward to seeing you again.\n\n-CFD Staff"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "112212679397813837274", "name": "James McKnight", "time": 1567103341221, "rating": 5.0, "text": "Crossfit Deprivation is the best crossfit gym I have ever been to in 10 years of crossfitting around the world and is worth every penny.  Whether you are an elite athlete looking to eek out the next level of advanced skills and fitness, or  total couch potato, CFD will program for you.\n\nYou will get detailed personalized food (I won’t call it diet) planning that will help you lose the weight while barely noticing it; they will refine and adjust the plan for YOU!\n\nThe coaches are locked on for your workout and they will not let you get away with bad form on anything.  How many times have you seen a coach make up the warm up as they go?  Not here.  The warm ups are carefully designed to get you ready to do the workout of the day.\n\nAbove all, this place will make you feel like a member of a community that is fun and serious about fitness the moment you walk in the door.  We have a special gym in the Columbus and Phenix City area and you do not want to miss out on this place.", "pics": null, "resp": {"time": 1569461465548, "text": "Jim thank you 1000 times for those word. You and your wife are such and amazing part of this community and it would not be what it is without you. We look forward to working towards continued health for many years to come! Thank you again!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "102451871134493068474", "name": "Brianna Netzinger", "time": 1516896738922, "rating": 5.0, "text": "The BEST Coaching staff and overall community... AND ITS HUGE!!!\n\nI used to be leery of Crossfit in general but I decided to join anyways because nothing else was working out for me since I left the military. I am so happy with my decision to start because this is more than just a gym, it is a family. <3", "pics": null, "resp": {"time": 1516989315849, "text": "Many thanks for this review, Brianna! We're glad that you found a great fit in your post-military fitness career. We look forward to seeing you again soon! -Elliott Q, Owner"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "101539668054541898610", "name": "Joey Kitt", "time": 1554486651132, "rating": 5.0, "text": "I did a 6-week challenge here. CFD is a great place with awesome people and amazing coaches who keep you motivated.", "pics": null, "resp": {"time": 1617284755526, "text": "Thank you for the review Joey. We always greatly appreciate it!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "100793498984290831949", "name": "Little Slips", "time": 1459962802377, "rating": 5.0, "text": "Definitely THE best gym around! Great atmosphere and amazing and supportive coaches. What I like most is how they basically do the work for you, I show up, my workout is written and explained to me and I have an amazing group of people to workout with and motivate me. Not to mention the coaches there are like your own personal trainer who are eager to help you reach your goals. They also offer open gym all day AND  CHILDCARE during certain times which my kids love. CFD is for all levels of fitness and have a FREE Workout every Saturday at 9 with childcare for anyone wanting to try it out!!  I just love this place <3", "pics": null, "resp": {"time": 1492535934200, "text": "Thanks for the review lucky! You will always be huge part of this gym and watching you grow as an athlete has been an amazing experience for the CFD team."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "115480244436691325577", "name": "Thaddeus Skaggs", "time": 1499184318491, "rating": 3.0, "text": "Positive atmosphere and everything you want from a CrossFit gym. 3 stars, because $120 a month is the most steep price I think I've ever seen from a gym. That's $1440 for a year. I think what turned me away was the amount of willingness to work with folks like myself, whom are rarely here due to work. It was pretty clear that $120 was the price and nothing less than military orders would change that. Even then the offer sounded less than ideal. So, that's the business side.\n\nThe workout side of this facility seemed... Alright. The facility was great as were the staff and customer personalities and support. Going back to the money, I definitely don't believe the training I saw warranted the price. I saw more flexion in lower back than I care to see-not just from young/new members. My fear of CrossFit gyms is always seeing atrocious form, and although that wasn't the case here (form wasn't... Terrible...) It still wasn't good enough for the hefty price. I could get a personal coach for the same and get precise, individual training for less money and same or better quality.", "pics": null, "resp": {"time": 1507482201039, "text": "We are so sorry to hear that you do not agree with the price we charge. We strive to make our service/coaching worth every penny you pay. However we feel it is a fair price considering you get a planned workout and coaching daily, access to the facility all day, mobility classes, access to Wodify, a one on one and group session with a coach, nutrition advice/planning and any clinics we run are free to you as a member. We also realize that people’s form are less then perfect but everyone comes in moving different, with different mobility problems and different degrees of fitness and athleticism. Some of those people take years of work to make the smallest change but I assure you that our coaches work tirelessly to do so and our athletes make dramatic improvements in quality of movement and life! We would love to have you come visit again and check us out but if not we appreciate the review and feedback and we will continue to work to make the gym the best place possible!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "117321363910804059052", "name": "paula pritchett", "time": 1571027714696, "rating": 5.0, "text": "Great staff & great workout", "pics": null, "resp": {"time": 1600798673859, "text": "Thank you for the review Paula!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "102200203233046940241", "name": "Brittany Ward", "time": 1461379280078, "rating": 5.0, "text": "Amazing and very knowledgeable coaches. I love the atmosphere and the people. No matter what your fitness level you should definitely come give this box a try.", "pics": null, "resp": {"time": 1492535843777, "text": "Thank you for the Review! We love having you and it's a pleasure seeing your daily progress and positive attitude!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "113387991832537664516", "name": "Liz Wise", "time": 1473715876189, "rating": 5.0, "text": "I used to feel very intimidated about going to a new gym by myself.  I was worried that I would be lost and look stupid but the coaches and members were so welcoming and supportive, I was worried for nothing. Now I feel very comfortable there, so comfortable that I can walk into open gym and do the workouts by myself when I need that flexibility.   It is MY gym, my place to work and push myself as hard as I can and when I think I cant, the coaches and other members help me push myself. Love that place and its people! <3 I highly recommend Crossfit Deprivation to anyone that is not just looking for a gym but an actual community of people invested in your success.", "pics": null, "resp": {"time": 1492535548301, "text": "Thank you for the Review Jett!. We love having you as part of our community and are so happy that you can call this place home. Athletes like you is one of the many things that makes our facility great!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "102693569663023451640", "name": "Cody 1256", "time": 1513033871551, "rating": 1.0, "text": "Set up an appointment for the free 6 week challenge. They wait till the end of there pitch then tell you there is a $500 deposit to keep you accountable. The place is probably good but I hate high pressure sales tactics and won't do business with a place that does this bait and switch.", "pics": null, "resp": {"time": 1513191259843, "text": "Thank you for your review, Cody -- we do appreciate your input. I am sorry that you feel that way but the challenge is absolutely free if you commit to it and use the tools we give you. We have an extremely high success rate with over 90% of the challengers becoming full time members because of the amazing results they see. We genuinely want to help people and try to get them to get out of their own way and see that they can live a healthy lifestyle. But again we always appreciate feedback no matter what it is. So thank you for taking the time to write a review! -Elliott Q, Owner"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "109395824953547947010", "name": "Benjamin Bunn", "time": 1461178250590, "rating": 5.0, "text": "I've worked with the head coach and owner (Elliot) in the past. Great coach with a real passion for the sport of CrossFit, he's also a pretty damn good athlete! Fun community and a huge facility. Go check em out!", "pics": null, "resp": {"time": 1492535879609, "text": "Thanks for the review! Don't forget to drop in when you are in town!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "102515229864188693029", "name": "Daniel Lecour", "time": 1459116075423, "rating": 5.0, "text": "Great coaches, awesome workouts, and everyone is supportive of eachother no matter your fitness level. Also, the child care is great and my kids love going. A great environment to make friends and get in shape.", "pics": null, "resp": {"time": 1492536157565, "text": "Thank you for the review! You will always have a second home here."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "116198764585115876400", "name": "Chelsea Navara", "time": 1462276994615, "rating": 5.0, "text": "I could not be happier at this box. Excellent programming and I have seen tremendous results in myself and others. There's no need to feel intimidated because everyone is so welcoming and encouraging, I've met some amazing people here. Every workout can be modified to meet your needs. What truly makes this box so great is not how huge it is, but the awesome coaches. Every coach is fully dedicated to making sure you get the most out of each class. Not only are they making sure we are safe and effective throughout our movements, but care about our process and make huge efforts to follow up on it. It means a lot to have the coaches and or fellow athletes/friends/family get just as excited for an improvement as you do. I would recommend this box to anyone as it is for everyone no matter your fitness level or age. Come get your long term fitness goals started at crossfit deprivation!!", "pics": null, "resp": {"time": 1492536443966, "text": "Thank you for the review! You are a big part of CFD and we can't imagine the gym being the same without your hard work , dedication and drive inspiring us all to be better."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "114868767603201165836", "name": "Dexter Morgan", "time": 1531499139799, "rating": 1.0, "text": "Deprivation should be ashamed of theirselves. I saw an ad on Facebook for a free six week course. I accepted the ad and made the “appointment” to start the course. It turned that it was actually a lecture not an assessment and it wasn’t just me but room full of people. Then after listening to the one hour lecture that explained how the people at this gym had found the “magic” to help you lose weight when you had failed on your own they dropped the bombshell of its free but it’s $599 down and you get your money back if you are successful. That’s not free!!!!! They are an example of why the fitness industry has a bad name. I’m sure they are capable competent coaches. But, that doesn’t mean they are allowed to lie to get people in the door. If I could give zero stars I would. I’m ashamed that I was fooled by your ad.", "pics": null, "resp": {"time": 1531502865618, "text": "Hey Dexter. I am very sorry to hear that you feel fooled but the program itself is very very effective and we have changed 100's if not 1000's of lives doing this program. The program is free if you commit to it and do what the coaches are telling you and many people take advantage of that fact. We also understand that the program is not for everyone and that is completely O.K. We thank you so much for taking the time out of your day to come check us out and we appreciate any and all feedback. I wish you all the best on your fitness journey!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "104986175159156073447", "name": "anthony judge", "time": 1540502338611, "rating": 5.0, "text": "Awesome bunch of people, felt very welcome dropping in here for a few days. Great coaches, facility and community.", "pics": null, "resp": {"time": 1547655717765, "text": "Thank you Anthony. We are so glad that you enjoyed your experience here because we try so hard to ensure everyone feels welcomed. We look forward to seeing you again some day soon.\n\n-CFD Team"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "116999821373804154929", "name": "Teysha Thomas", "time": 1523704510759, "rating": 5.0, "text": "I LOVE THIS PLACE! The trainers are awesome and everyone is very friendly!", "pics": null, "resp": {"time": 1523906711208, "text": "Thank you Teysha! We lobe you too and it is people like you that make this place amazing."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "117974011522053020464", "name": "Sarah McGrew", "time": 1543258354969, "rating": 5.0, "text": "After being a “CrossFit hater” for years, I decided to finally give it a shot during a six-week challenge a few months ago. I’m thankful every day that I saw the ad on Facebook and decided to give Cross Fit Deprivation a shot. From my first day at the gym, I was welcomed by staff and members with smiles and excitement and it has continued every day since. Elliott has put together an amazing team of coaches that focus on form and are able to scale any movement as needed based on each individual’s abilities. They are not only an incredible coaching staff with diverse backgrounds but great human beings as well, who have fostered an environment in the gym full of positivity and encouragement. Whether you’re a seasoned athlete, have been working out for years, or never done a push-up or lifted weights in your life - there’s a place for everyone at CFD, definitely the best facility with the best staff in the area.", "pics": null, "resp": {"time": 1547655622423, "text": "Sarah! You have become such a huge part on this community and team. We appreciate this review and your presence so so much. All I can say is Thank you, Thank you, Thank you!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111642438255137151486", "name": "Ruby Heintzelman", "time": 1462287990068, "rating": 5.0, "text": "This gym so where my transition into Crossfit began and I couldn't be more thrilled with the progress I'm making due to the amazing coaches. Every day I look forward to coming back and seeing everyone working so hard together.. Couldn't imagine working out anywhere else!", "pics": null, "resp": {"time": 1492536386131, "text": "Thank you for the awesome review! You will always have a place at our gym and so glad we could help you with your transition into CrossFit and Powerlifting!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "112549470182464125766", "name": "Adam Farmer", "time": 1469148658436, "rating": 5.0, "text": "I regularly travel to the Ft. Benning area for work and CrossFit Deprivation is a must for me. Very friendly environment from both the Athletes and the Coaches. Being a Coach myself, I find it refreshing to go other places and get coached. CF Deprivation makes that an even more enjoyable experience. Very attentive and knowledgable, coaching cues are always on point and they spread themselves throughout the class wonderfully. Can't wait to get back down to Georgia!!!! I recommend y'all to everyone!", "pics": null, "resp": {"time": 1492535734581, "text": "Thank your the review and recommendations! You will always have place here Adam."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "115067437050669323747", "name": "Trevor Hull", "time": 1499908360436, "rating": 5.0, "text": "Great community, good programming. I'm seeing good results after only a few months of regular attendance.", "pics": null, "resp": {"time": 1507482334263, "text": "Thanks Trevor! Glad to have you as part of the CFD community and we have noticed your results as well! Can’t wait to see where you are in a couple more months!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "107838841671069091507", "name": "Glasha Redding", "time": 1549202325816, "rating": 5.0, "text": "I can't wait to get started", "pics": null, "resp": {"time": 1617284914410, "text": "We couldn't wait either!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "106877442421264785855", "name": "Amber Richter", "time": 1467735186775, "rating": 5.0, "text": "Crossfit Deprivation is the best in the area! The coaches are knowledgeable, and so positive! The programming works- and the coaches celebrate your accomplishments with you! Love this gym!!", "pics": null, "resp": {"time": 1492536291586, "text": "Thank you for the review! We love that you always give us a reason to celebrate!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "115616790918272249767", "name": "Austin", "time": 1481112539741, "rating": 5.0, "text": "This place is massive. Great people, tons of equipment, definitely a great place for new/old/newbie/novice alike! Thanks Elliott!", "pics": null, "resp": {"time": 1492535459707, "text": "Thank you Austin! Look forward to seeing you again soon."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111623754858672173948", "name": "M. Riz", "time": 1462762734942, "rating": 5.0, "text": "Huge gym. Versatile coaches. Excellent equipment. Community of all levels of fitness. You can Crossfit or powerlift or train for any type of military school or challenge you want. I worked out here for three years and am sad to move away. Highly recommended.", "pics": null, "resp": {"time": 1492536322922, "text": "Thank you for the excellent review. We miss you guys!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "103466801758282896018", "name": "Brad Nelms", "time": 1524423778840, "rating": 5.0, "text": "I enjoyed every second of interaction with CFD. I did the 6 week challenge about 7 months ago and not only met, but exceeded my personal goals. Although I am no longer a member, due to work/financial complications, I would recommend this gym to anyone! I do what I can at home and still jave maintained my nutrition. Eliott and his AWESOME coaches took me from a size 38 to a 32. It feels good to be 46 and wear the same waist size you wore in High School. You get tons of 1 on 1 instruction on everything from nutrition to technique. If you have the money it’s worth EVERY penny. I miss CFD tremendously and if financial stresses ever resolve you can bet I’ll be back! It will truly change your life!!!", "pics": null, "resp": {"time": 1524439423340, "text": "Thanks for the awesome review Brad! We definitely miss you but we are still soooo proud of your accomplishments during your time at CFD!! We can't wait to see you back here. You will always be part of the family."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111298269720147724742", "name": "Daniel Parker", "time": 1459134665309, "rating": 5.0, "text": "CFD is a great box that offers so much more than the other local box. The coaches do a great job at working with you to ensure proper form and technique. You will see great gains from the programming. Great place for family and friends to build new frienships. I recommend Crossfit Deprivation to everyone.", "pics": null, "resp": {"time": 1492535991082, "text": "Thank you for the review. Your positive attitude is truly infectious and continues to make this place better and better"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "111081926314704430209", "name": "Brandon Oliver", "time": 1468478264246, "rating": 5.0, "text": "Great coaches and awesome training. The services provided are well worth the investment and the presence of child care, nutrition counseling/planning, in addition to mobility WODs really help CFD to provide a holistic environment for improving health, fitness, and overall wellness.", "pics": null, "resp": {"time": 1492536222990, "text": "Thank you for the great review. Your constant thirst for knowledge and work ethic continues to inspire the CFD team and community"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "105934052840641759833", "name": "Michael Beres", "time": 1461693920259, "rating": 5.0, "text": "Crossfit Deprivation is top notch!! As a Chiropractor people are always asking why I do Crossfit.  They always follow it up with aren't you afraid of hurting yourself.  I quickly follow up that I feel that the exercise you get while doing crossfit is the only exercise routine where you are working all parts of your body.  BUT the key to staying injury free is finding a box like Deprivation where the coaching is the best.  Elliott knows his stuff and you will not only get in shape but be prepared to gain muscle and get stronger.", "pics": null, "resp": {"time": 1492536508111, "text": "Thanks for the review Doc. And thank you for the continued support of our community."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "106373732640325169325", "name": "Pat McLendon", "time": 1461973009323, "rating": 5.0, "text": "This place is what a good Crossfit gym should be. Great people, fantastic coaching, high energy in a supportive environment for all fitness levels.", "pics": null, "resp": {"time": 1492536470267, "text": "Thanks for the review Doc. It is a pleasure seeing you come in and you always brighten our day!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "115596973599986794243", "name": "Chris", "time": 1471125903007, "rating": 5.0, "text": "My second home for nearly 3 years.  Met many great friends here.", "pics": null, "resp": {"time": 1492535635744, "text": "Let's go for 3 more years and many more great friends!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108587147850066025396", "name": "Patricia Dixon", "time": 1500828785591, "rating": 5.0, "text": "The Coaches are great, the community of athletes is awesome and it's affordable.", "pics": null, "resp": {"time": 1507482268596, "text": "Thank you Pat! You have been such a blessing to our gym. Your daily motivation smiles and motivation is an inspiration to so many."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "101086015415385849518", "name": "John Gailey", "time": 1507467509878, "rating": 1.0, "text": "As a member of the military I had to go on leave and thus wasnt properly informed of how the freeze account works. While on leave I was charged again for another month (paying month to month) but thought account was frozen. After contacting the owner( former Army NCO), he didnt care, wouldnt give refund for his miscommunication, and essentislly stole $280 from me; I only got to work out for 5 days for $280.\n\nSTAY AWAY FROM THIS PLACE IF YOU ARE ACTIVE DUTY MILITARY.", "pics": null, "resp": {"time": 1507481586886, "text": "John I am sorry that you feel this way about our facility. We work everyday to improve our communication with members about the gym and it’s policies. We did however exchange emails about your options to cancel or freeze and because you did not answer back the charge went through. I also offered to freeze your account after you were charged since you said you would be back from leave and wanted to work out and you said no to just cancel you out giving up your month that we offered you. We normally do not freeze for anything less then a month and I still offered this to you understanding you were in a tough situation. Again, I am sorry it didn’t work out but we are huge supporters of the military and we have adjusted policies to benefit military persons as much as we can. Thank you for coming to our facility for the short duration and I wish you the best moving forward"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "118292655075540097142", "name": "Regina Dozier", "time": 1515614609798, "rating": 5.0, "text": "Great staff. Love this place", "pics": null, "resp": {"time": 1515722122933, "text": "We appreciate you taking the time to leave us those stars, Regina. Don't hesitate to reach out if you ever need anything. -Elliott Q, Owner"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "115990265302687944250", "name": "Lex Egea", "time": 1461617300247, "rating": 5.0, "text": "Elliott used to be a member at my old gym and I knew immediately he was going to be a great CrossFitter and probably become a coach sooner than later.  Anything I told him to do he did it and then some.  Once he became a coach he dove into the books and online literature to learn and teach people the right way.  Now he's a successful box owner running one the biggest facilities in the southeast.\nNot only does he have the certifications to coach but he can back it up by coaching and demonstrating it all to you.  Top notch coaching at CFD and people who really care about YOU! Don't settle for less; go to CFD for the best/safest experience of CrossFit you can get in the Columbus/Phenix City area. Prepare for all the heart and soul you can get here because you're going to need to give it right back.", "pics": null, "resp": {"time": 1492535800418, "text": "Thank you for the awesome review! You started a lot of this team down this path and you will always have a second home here!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108570480921232596928", "name": "Natana Chaney", "time": 1469751019272, "rating": 5.0, "text": "Crossfit Deprivation has the most inviting and family friendly atmosphere. People are genuinely kind and caring. The coaches are devoted to seeing improvement in their athletes as well as each other. Crossfit is all about the community that embodies it and other crossfit gyms in the area can't hold a candle to that of Crossfit Deprivation. It's been a privilege of mine to be apart of the legacy that is being built here.", "pics": null, "resp": {"time": 1492535693184, "text": "Thank you for the review! It's been a privilege having you as part of the CFD team!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "106561780208389654182", "name": "Laura Murphy", "time": 1514683940805, "rating": 5.0, "text": "Just started my crossfit journey. All the coaches are super helpful and inspirational.", "pics": null, "resp": {"time": 1515023452943, "text": "We're so excited to be on this journey with you, Laura! Thanks for choosing us. We'll always be here for you. -Elliott Q, Owner"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "116273252693964242950", "name": "Joshua Williams", "time": 1490666627146, "rating": 5.0, "text": "Great coaching staff, they really care about everyone that walks through the door. They push you to do your best without being pushy.", "pics": null, "resp": {"time": 1492535425046, "text": "Thank you for the review! We are so glad you joined our community and it is amazing to see the progress you and Brittany have made since joining. You continue to be an example for new and old members."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108104898544510421368", "name": "Bridget Fitzsimmons", "time": 1546278065397, "rating": 5.0, "text": "Love the staff and programming here!", "pics": null, "resp": {"time": 1547655397209, "text": "Thanks for the 5 stars. We appreciate it so much and we love you!\n\n-CFD team"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108490298915173626565", "name": "Debra Carter", "time": 1509748891395, "rating": 5.0, "text": "Hard work but feel great afterwards", "pics": null, "resp": {"time": 1513445375032, "text": "We love hearing this, Debra! Thanks so much for working out with us. We hope to see you again soon. -Elliott Q, Owner"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108634748875046335902", "name": "Patricia Adams", "time": 1565360621728, "rating": 2.0, "text": "The only thing free is the speech they give you, as they try to convince you to pay a lot of money", "pics": null, "resp": {"time": 1569461606795, "text": "Sorry to hear that you did not see the value of what we offer. I hope that we were able to at the very least send you to a place that could help you with what you were looking for. At the end of the day our goal is to bring health and wellness to everyone no matter where you end up. Good luck with your fitness journey"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "103626907982808073514", "name": "Sharon Hoskinson", "time": 1565467263695, "rating": 5.0, "text": "It was really 😎 inside the gym", "pics": null, "resp": {"time": 1569461501669, "text": "Thank you! We take pride in our facility and glad that you got to see that"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "105334155564651315864", "name": "Timothy Grantham", "time": 1533099779491, "rating": 3.0, "text": "Typical 3 tooth services", "pics": null, "resp": {"time": 1533133379294, "text": "Thanks for the review Timothy. We always appreciate any and all feedback. We would love to hear your thoughts on what it would take to get us to a 5 star review! Feel free to talk to any of the staff to let us know. Thank you for checking out and being a part of the gym!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "107059520019191662722", "name": "robert williams", "time": 1537554318391, "rating": 5.0, "text": "Coaches are second to none.", "pics": null, "resp": {"time": 1547655776909, "text": "Thank you for the 5 stars! You are a second to none athlete!\n\n-CFD Staff"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "110449349755662628136", "name": "Iris Blaylock", "time": 1508260635042, "rating": 2.0, "text": "Signed up for the 6 week challenge..will see how it goes", "pics": null, "resp": {"time": 1508265998580, "text": "Get ready for a life changing experience Iris!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "104476398471357774895", "name": "Wendy Hall", "time": 1531863048836, "rating": 5.0, "text": "Love this place, the coaches, and the community.", "pics": null, "resp": {"time": 1531944315227, "text": "We love you!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "108587169255852910484", "name": "Melony Whitlock", "time": 1553482722089, "rating": 3.0, "text": "A little pricey for my taste", "pics": null, "resp": {"time": 1617284862751, "text": "Melony, thank you for your feedback. We always appreciate honest opinions about what we offer. Hopefully one day you can partake in one of our programs!"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "102864511782093805734", "name": "Jeff Mcgee", "time": 1531635622411, "rating": 1.0, "text": "Scam, plain and simple.", "pics": null, "resp": {"time": 1531944415957, "text": "Hey Jeff thanks for the review. I would love to talk to talk to you about why you think we are running a scam. We always look for feedback on how we can improve our products/service. I am sorry that we were not a fit for you and wish you the best on your fitness journey."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "105928326499871094395", "name": "Southern Ga Peach", "time": 1539578391657, "rating": 5.0, "text": "Wonderful staff", "pics": null, "resp": {"time": 1547655739460, "text": "Thank you for the awesome review\n\n-CFD Staff"}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "112036699809025569060", "name": "Luz Karakozian", "time": 1528709574468, "rating": 2.0, "text": "Not welcoming I guess be my nationality", "pics": null, "resp": {"time": 1528812099503, "text": "Luz I am very sorry to hear you felt unwelcome at our facility. We truly strive to make sure every single person that walks in feels like they are part of the family. I can assure you that we do not welcome or unwelcome people based on there nationality so again I am extremely apologetic if for some reason you felt that way. I would love to talk to you and see if you would give us a second chance to prove that we are who we say we are or at least let us know how we can improve. If not I completely understand and hope you find a place that fits for you! Thank you."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
{"user_id": "116680651620978428830", "name": "Migdalia Marrero", "time": 1529357884534, "rating": 5.0, "text": "(Translated by Google) My daughter-in-law and my granddaughter work out there, very good.\n\n(Original)\nMi yerna y mi nieta se ejercitan alli, muy bueno.", "pics": null, "resp": {"time": 1617284959997, "text": "Migdalia, thank you so much for the kind words and glad your family lies it here."}, "gmap_id": "0x888ccde715d0237f:0x6886b89a9489510f"}
