{"user_id": "115487945553266250704", "name": "michael hamlett", "time": 1629473783647, "rating": 5.0, "text": "I love coffee from this place.  Highly recommend trying the Malawi.", "pics": null, "resp": null, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "110293460970172684481", "name": "Stephanie Lemke", "time": 1620738060608, "rating": 5.0, "text": "Best Coffee EVER (I am a coffee 'holic) So enjoying it.  Will be back while I am here. Thank you💗", "pics": null, "resp": {"time": 1620748456955, "text": "Thanks Stephanie! Brightened our day to serve you! 🙂"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "110772547742884840854", "name": "Sheri Turner Fowler", "time": 1597680136623, "rating": 5.0, "text": "I love the mocha latte I got here! Also it’s a “mom & pop” coffee shop and it has a comfortable, pleasant atmosphere. To be honest I am thankful to have an alternative to *St———*! 💪🏼", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM87W9dtI8coE4frfNQDbHDAPRRW0O8X_0irYKT=w150-h150-k-no-p"]}], "resp": {"time": 1597684559960, "text": "Happy to have another satisfied 5 Star customer! Thank you and we look forward to seeing you often! Blessings ~ Sandy & Trish"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "106840581521849366191", "name": "Vega Foster", "time": 1617212003366, "rating": 5.0, "text": "The coffee is fantastic, but the kind and thoughtful service is even better! Southern hospitality is abundant :)", "pics": null, "resp": {"time": 1617215990294, "text": "Thank you so much!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "115000293919333243654", "name": "Roxan Pagasian", "time": 1611583478308, "rating": 5.0, "text": "Small and cozy place with efficient service. The food was excellent. Both bagels were top of our visit!", "pics": null, "resp": null, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "109350710946679344531", "name": "Bill McCown", "time": 1602623961312, "rating": 5.0, "text": "I visited Toomer's Coffee for the first time last week.  It was truly an enjoyable experience.  My \"to go\" cup was perfect - bold but balanced.  The bag of whole bean coffee that I purchase was very high quality.  Additionally, I enjoyed the visit with the owners.", "pics": null, "resp": {"time": 1610543949358, "text": "Thanks!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "107454110433794106193", "name": "Julie Nelson", "time": 1614110658616, "rating": 5.0, "text": "Loved the coffee, and the cookies are to die for! I'll be back", "pics": null, "resp": {"time": 1614111675384, "text": "Thanks Julie! Look forward to your next visit!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "110386407943993917899", "name": "Skulls Williams", "time": 1584023223239, "rating": 5.0, "text": "My wife stops in from time to time and brings me coffee to work. They sell an amazing product. I got their keto coffee this morning and it was made perfectly.", "pics": null, "resp": {"time": 1588272095651, "text": "Thanks! We make them the same way we drink them. Cheers."}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "108391405809161534761", "name": "Brad Donnelly", "time": 1490997948222, "rating": 5.0, "text": "Really smooth delicious one of a kind taste! Truly excellent roasting and custom techniques used to attain excellent coffee. Coffee beans come from Ethiopia and other Rain Forrest countries to give you the very best bean to be brewed into a little cup of heaven!\n\nI know I have watched Sandy in their little roasting shop in Opelika and have seen first hand the roasting expertise that Sandy uses in customizing these wonderful coffee blends.\n\nI love the Auburn City Blend it is wonderful!  If you have not tried Toomer's Coffees you are missing out on a real one of kind custom blended coffee!  Treat yourself to a couple of pounds of each of their blends you will never go back to another coffee brand.", "pics": null, "resp": {"time": 1574205014219, "text": "Go Brad! Thanks!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "102118831361664343116", "name": "Pollyanna Brannan", "time": 1490973110362, "rating": 5.0, "text": "First time I had their coffee I knew it was different and in a GREAT WAY!! I met the owners and have to assume that their time spent living in South America is where they learned good coffee and why it's important to use direct trade coffee beans - truly ethically sourced coffee beans\nI love that it is family owned and made in Alabama because I think it is important to buy local when you can and the product is quality. I even quizzes them to find out details that are important and found that they make sure it is low acid, infrared roasted!!!!!  That to me is great customer service putting the special effort into \"doing it right!!!\" Having fast inexpensive shipping is a bonus!!! <wink> but all of this makes me love the brand. Had to share!! How often does some one slow down to share a positive?! Not enough so I wanted to make sure I shared this one because they earned it!", "pics": null, "resp": {"time": 1574205035710, "text": "Thanks Pollyanna!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "108445942261397860475", "name": "Viann Whitten", "time": 1492045169532, "rating": 5.0, "text": "Toomer's Coffee Roasters is awesome! Mr. and Mrs. Toomer lived in South America so they know coffee. Many people have given up drinking coffee due to stomach sensitivity but you don't have to anymore! Toomer's Coffee Roasters uses an Infrared coffee roaster so no more bitter taste and no high acid, just smooth wonderful coffee. Toomer's Coffee Roasters has cheap fast shipping too. Love this company. Best kept secret in Auburn, Alabama.", "pics": null, "resp": {"time": 1574277196083, "text": "Thanks Vivian"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "108596835436132813122", "name": "Logan Moore", "time": 1574102110649, "rating": 5.0, "text": "Toomers Coffee is phenomenal! The best coffee in Alabama let alone Auburn /Opelika area! Sandy and Trish have been around the world to hone their craft and have brought a world class roastery to Opelika! If you are in town for ballgames or shopping their new store front is very close to tiger town and totally worth the stop in! Best brewed coffee ever! Auburn City Blend, Snickerdoodle, Vermont Maple But...everything they do is great!", "pics": null, "resp": {"time": 1574107266507, "text": "Thank you! You're very kind."}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "108851691479674173482", "name": "JOE LEOS", "time": 1574170749123, "rating": 5.0, "text": "I had the joy of speaking with the owner Toomer's Coffee about the different coffees and their tastes. I bought the following coffees Auburn City Blend, Colombian Supremo and Ethiopian Yigacheffe Aricha Gedio. The coffees were all wonderful in taste and aroma but our favorite is Auburn City Blend.  Please take time to drop by and pick up some of the best local coffees Toomer's Coffee has to offer.", "pics": null, "resp": {"time": 1574175217766, "text": "Thank you Joe for your affirming words! It's a pleasure to do what we do and serve those like you. Blessings."}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "113226861600562263445", "name": "Dan McNiff", "time": 1565103918365, "rating": 5.0, "text": "Great coffee and great people.  We have been looking for a strong local roaster, I believe we just found them!", "pics": null, "resp": {"time": 1565105515176, "text": "Thanks Dan! Enjoyed meeting you guys!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "102488385010963583129", "name": "Daria Monroe", "time": 1563464994966, "rating": 5.0, "text": "Toomer’s Coffee is delicious! Our entire office drinks their coffee each morning.", "pics": null, "resp": {"time": 1563468813853, "text": "Thank you Daria! You're a joy to serve."}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "104778947224889496560", "name": "Vickie Arnold", "time": 1572444010375, "rating": 5.0, "text": "Best coffee in town, friendly owners! So glad you opened a shop so I can still get my white chocolate mocha.", "pics": null, "resp": {"time": 1572448785452, "text": "Thanks Vickie, so good to reconnect with you. We are happy to have our new espresso machine too!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "103527667123973670629", "name": "Emily Malecky", "time": 1491333731034, "rating": 5.0, "text": "Excellent flavor. I perfect cup of coffee. Love the care that is put into this high quality roasting.", "pics": null, "resp": null, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "104323334569231265238", "name": "Roger Smalligan", "time": 1529376129139, "rating": 5.0, "text": "Great tasting coffee, fast shipping, And I  like that they buy from groups that are socially responsible.", "pics": null, "resp": {"time": 1529378804978, "text": "Thanks Roger!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "109691805474446511185", "name": "Sarah Toomer", "time": 1490998952626, "rating": 5.0, "text": "Great coffee! I use this coffee in my bakery and at home. Excellent quality and service.", "pics": null, "resp": {"time": 1574205049383, "text": "Thank you Sarah"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "111483494150434997240", "name": "Sharon Peer-Howell", "time": 1491002880411, "rating": 5.0, "text": "I love going to Toomers Coffee, I love the concept of a family owned small business and the small batch roasting is amazing.  One of our favorites is the Costa Rican Tarraszu.  It has a nice smooth taste not like some other big chains where you get that almost burnt taste.  I also like that they ethically source all their beans.  The service is efficient and friendly.", "pics": null, "resp": {"time": 1574204992028, "text": "Thank you Sharon!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "110033418424063146499", "name": "Chris Young", "time": 1567812914534, "rating": 5.0, "text": "Outstanding quality and very knowledgeable owners!", "pics": null, "resp": {"time": 1574175331108, "text": "Thanks Chris. We've known each other a long time and you are always so kind."}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "116250735055185788179", "name": "Larry DiChiara", "time": 1491228164676, "rating": 5.0, "text": "I have been a habitual coffee drinker set in his ways, until I drank Toomer's special roasted Coffee. I am now switching to Toomer's as my coffee-of-choice..", "pics": null, "resp": {"time": 1574204974471, "text": "Thanks Larry!"}, "gmap_id": "0x888ced3a186551a5:0x83093a772fb27e97"}
{"user_id": "101830776166903575991", "name": "Tom Sigg", "time": 1627395167164, "rating": 5.0, "text": "Fast unload load time. Took only an hour.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109959898700032897135", "name": "David Riddle", "time": 1621358621741, "rating": 1.0, "text": "Requested water delivery and received the following email.\n\nYour delivery request has been received. Someone will contact you shortly.\n\nThank you!\nThe Crystal Mountain Water Team\n\n27 days later and no response.", "pics": null, "resp": {"time": 1621434945341, "text": "Hey David,\nThank you for bringing to our attention that we have a problem with that feature on our website!  We would love to have your business please give us a call at 256-922-1114 or H2Oinfo@crystalmtnwater.com"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "113043117462598329929", "name": "R Trev", "time": 1615235631066, "rating": 4.0, "text": "After having many problems with Crystal Springs we signed up with Crystal Mountain and have been very pleased. The purified water tastes nice and customer service is efficient with great southern charm.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "110452765338849326426", "name": "Becca Sadriyev", "time": 1575995982106, "rating": 5.0, "text": "Amazing customer service from this Company. After a disappointing end to service with another company, this one stepped up and has been a blessing to work with. Highly recommended.", "pics": null, "resp": {"time": 1575927765076, "text": "Hey Becca! Please call our office at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "105601092823382899743", "name": "Paul Burns", "time": 1538758922920, "rating": 3.0, "text": "I've had two accounts for many years.  I think it's been around 9 years.  Have one account at work, and had one account at home.  I had to cancel the home account because the delivery schedule changed almost every month.  I would get random deliveries, or not get a delivery at all.  Sometimes my empty bottles would sit outside for a month.  I just couldn't keep storing empties until I hit the delivery lottery.  My work account has been great, though.  And the customer service has been pretty good.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "101818726358864003325", "name": "Mike S", "time": 1575917816880, "rating": 1.0, "text": "Been out of water for a week now. We have called twice and they said they would be out the next day and never show up. Now when you call they go straight to voicemail.", "pics": null, "resp": {"time": 1575921605031, "text": "Hey Mike ! Please give our office a call at 256-922-1114"}, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "116291234765140819717", "name": "Georgia Benford", "time": 1565513010104, "rating": 5.0, "text": "Water is like drinking figi and that's great for me so smooth", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "106582216621092552488", "name": "Jon Owings", "time": 1520862963183, "rating": 5.0, "text": "used them for home delivery almost 20 years, rare misdeliveries which are quickly corrected, essentially good service and product.  My experience has been good overall.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "109946469646131369499", "name": "Regina League", "time": 1527605505933, "rating": 2.0, "text": "My office has been a customer for over a year now. In the last few months their customer service has declined drastically.  As of today we have waited 1 week for our delivery of distilled water.  Something to make things easier for us, has turned out to be just as difficult has our making a trip to the market for water ourselves. Very disappointing.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "112817813134674707628", "name": "eli williams", "time": 1340876052243, "rating": 2.0, "text": "I am a 53 ft tractor trailer driver and this place is one of the worse getting into.  Do not try to enter from Madison Pike try Governors.  Once inside industrial park, watch for low hanging trees, branches, etc. Bldg 7 is in the very rear. Horrible location for 53ft tractor trailer deliveries.", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
{"user_id": "115929849669038795983", "name": "I FULLENWIDER", "time": 1554917225316, "rating": 3.0, "text": "Their products are very  expensive", "pics": null, "resp": null, "gmap_id": "0x88626ebceb0c611b:0x481ffadc0e44f8af"}
