{"user_id": "108258429408500284374", "name": "juan ruiz", "time": 1620858381234, "rating": 5.0, "text": "Nice people here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNGC-6oAUbOIbAl5uotHrf3AkGHO01SZTZU57Xa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "105284196589395097210", "name": "AAron Finch", "time": 1597792008186, "rating": 5.0, "text": "I go to this facility 3-4 times a day.  Sometimes it can get crowded with few, if any, spots to drop a trailer but the office personnel are very friendly and usually come up with viable solutions.  During those crowded times, patience is key to making your visit as smooth and easy as possible.", "pics": null, "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "116129985941383313361", "name": "My Ru", "time": 1609809315285, "rating": 5.0, "text": "Friendly  people and fast loads.", "pics": null, "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "102309784324922107995", "name": "Kevin Brozoski", "time": 1585602813723, "rating": 3.0, "text": "I think usda needs more help to do inspections on chicken because it holds up the workers to load trailers and for us drivers not to run out of time", "pics": null, "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "107954106682546815074", "name": "J K", "time": 1589263481661, "rating": 1.0, "text": "If there was a possibility do a negative 5 star they would deserve it 4:30 p.m. appointment didnt start loading until 12 a.m. in the morning got told at 8:30 pm got the load got passed for the USDA inspection that they would start loading me soon.", "pics": null, "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "104519707945686454943", "name": "Taylor Tucker", "time": 1600748882220, "rating": 1.0, "text": "Very unprofessional, why make appointments only to make the driver wait 7 hrs. Complete lack of respect and responsibility. Zero stars and total embodiment of what our country lacks, pay me but I only do the minimum.", "pics": null, "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "109120520244144842285", "name": "Edward jr Sampson", "time": 1582919070832, "rating": 5.0, "text": "I drive in park that m/t refer pick up loaded one I don't have to talk to no one lets ride..🚛💨💨💨", "pics": null, "resp": null, "gmap_id": "0x8892939d647e3bf9:0x33f75c4fd9c1fee4"}
{"user_id": "107780862989386003619", "name": "Mark Arnold", "time": 1574292643655, "rating": 5.0, "text": "Easy to get in and out of, even pulling a trailer. 24 hour access is nice. Clean units with a variety of sizes", "pics": null, "resp": null, "gmap_id": "0x8862c9bf23c80dd3:0x2f3a53179e42f853"}
{"user_id": "103418890484421840122", "name": "Keri Pickering", "time": 1624092335100, "rating": 2.0, "text": "Cost to much", "pics": null, "resp": null, "gmap_id": "0x8862c9bf23c80dd3:0x2f3a53179e42f853"}
{"user_id": "103148705346720888050", "name": "Ruth Godwin", "time": 1628880108286, "rating": 5.0, "text": "Midgard Self Storage is well-managed, clean and has generous access hours and courteous, helpful staff. They also give clear comments as to rules and protocol.", "pics": null, "resp": {"time": 1628892274955, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star rating for the courteous, helpful, thorough customer service in providing a clean, secure facility for your possessions.  Thank you  for sharing your very positive experience with the courteous and helpful team from the lease explanation to a rapid move in process at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "116097071972717025405", "name": "Paige Thornton", "time": 1627942004932, "rating": 5.0, "text": "We currently lease 4 units at Midgard Storage , 1015 North Glendale Avenue in Florence, Alabama. Your manager, Dave Weaver, is one of the strongest reasons we have stayed with you and gone from one to four.\nHe is always willing to work with us on anything. It is like we are part of the same company. He trains his people the same way. He is a jewel. We hope you recognize the extraordinary person you have, and we thank you!\nPaige Thornton. Designer\nBeth Lane\nDesign Assistant", "pics": null, "resp": {"time": 1628060785617, "text": "Dear Most Valued Guest, Dave and the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama sincerely thank you for for your continued and expanded usage of our clean, secure facility.  Thank you for taking your valuable business time to give the highest 5 star experience rating for the professional customer-oriented service Dave consistently provides in meeting your company's self-storage needs and thank you for noting Dave's training of his staff.  Dave has been doing this beginning in Florida and we appreciate you noting his outstanding, professional management abilities. Thank you again for sharing your consistent, positive experience with Dave, the growing team and the many benefits available at Midgard Self Storage on Glendale Street in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "116722901285287559430", "name": "Blair Thornton", "time": 1627940769561, "rating": 5.0, "text": "Re:  Employee Karah Henry at your 1015 North Glendale Street in  Florence, Alabama location, we at The French Basket would like to give a high recommendation to this employee.  She greets you with a smile every time and is always willing to assist in any way she can.  We use four units at this location for our Design Business.  She certainly makes our job easier\nThanks to your hiring of this employee, we would certainly recommend the use of this facility for any type of business.\n\nThank you,\nPaige Thornton,\nDesigner\nBeth Lane\nDesign Assistant", "pics": null, "resp": {"time": 1627952989686, "text": "Dear Most Valued Guest, Karah and the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama sincerely thank you for taking your valuable time from your successful business to give the highest 5 star experience rating for Karah's consistent, professional customer service always with a smile in meeting your business needs in every way possible and that is why Karah is the Facility Manager at Midgard Self Storage.  Thank you so much for sharing your very satisfying experience with Karah's outstanding customer service in every way at Midgard Self Storage in Florence Alabama and thank you for your confidence placed in Karah's management."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "108992951962496234430", "name": "Jennifer", "time": 1627430242251, "rating": 5.0, "text": "Super friendly and helpful employees! They were great when I called with questions and even more helpful in person. Greeted me as soon as I walked in. Very helpful and accommodating. Very secure and clean facility as well.", "pics": null, "resp": {"time": 1627521829141, "text": "Dear Most Valued Guest, the super helpful team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for taking your valuable time to give the highest 5 star experience rating for being provided friendly, helpful and professional customer service in answering your questions beginning with a phone call to the time you walked in with a warm welcome.  Thank you for giving the team the opportunity to provide a clean, secure facility for your possessions.  We appreciate serving you as our Guest at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "115476460360757016417", "name": "Lauren Walden", "time": 1628094383659, "rating": 5.0, "text": "Clean facilities. Easy sign up. 24 hour access available if wanted. Reasonable prices. Carts available for transporting from your car to your unit. Definitely recommend!!", "pics": null, "resp": {"time": 1628121946168, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star experience rating in meeting your storage needs providing carts for use in a clean, secure facility for your possessions.  Thank you for sharing  your terrific experience and for your recommendation of Midgard Self Storage in Florence Alabama.  We truly appreciate serving you as our Guest!"}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "107157416162815893850", "name": "John Burnett", "time": 1625243085659, "rating": 5.0, "text": "Friendly, fast ,and too the point I highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNdYnK4lVmV2HrGuvgWZAqKYPt25lvbiGRbOKEb=w150-h150-k-no-p"]}], "resp": {"time": 1625278893578, "text": "Thank you for sharing your experience with the team at Midgard Self Storage at 1015 North Glendale Street in Florence Alabama. We are happy to hear from you, and look forward to continuing to meet your self-storage and/or UHAUL needs."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "112571062650284039880", "name": "Katlin Parham", "time": 1622145827533, "rating": 5.0, "text": "The facility is very clean, organized, and safe. Dave made moving in so much easier! Will definitely patronize this business again!", "pics": null, "resp": {"time": 1622165970732, "text": "Dear Katlin, Dave and the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star experience rating for efficient, professional customer service in making sure that the stress was handled in getting you easily moved in the the best, clean and secure self-storage unit.  Thank you for sharing your terrific customer service and facility experience at Midgard Self Storage on Glendale Street in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "113736638023461508808", "name": "Savannah Stults", "time": 1622152096526, "rating": 5.0, "text": "Move in was a super quick and easy process. This place takes pride in their security! The man at the front desk was super helpful and was able to answer all of my questions!", "pics": null, "resp": {"time": 1622165828298, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star experience rating for professional, efficient very helpful customer service in making sure the move in process was quick and easy for you in providing the right size, clean, secure and well lit unit to meet your self-storage needs.  Thank you for sharing your terrific experience with the team and the many benefits available at Midgard Self Storage in Glendale Street in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "102514992003362001603", "name": "Trent Putman", "time": 1618713740774, "rating": 5.0, "text": "I showed up no notice and didn't have an exact idea of the size I needed. Karah was patient and went ahead and took me to three available rooms and let me decide from there. Then she helped me arrange a truck drop-off to save me money when I move, which I had no idea was an option. Incredible.", "pics": null, "resp": {"time": 1618716003239, "text": "Dear Most Valued Customer, Karah and the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you so much for taking your valuable moving time to give the highest 5 star experience rating and kind comments regarding professional, patient and knowledgeable customer care including assisting you in saving money for your UHAUL truck drop off.  We are happy that you were able to get the correct sized clean, secure self-storage unit for your needs as well as having the added benefit of 24 hour 7 day a week access to your possessions.  Thank you so much for sharing your incredible experience with Karah's professional customer care and the many benefits available at Midgard Self Storage in Florence Alabama.  We truly appreciate the opportunity to meet your UHAUL and self-storage needs."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "113158919853691192377", "name": "Poseidon Master", "time": 1614689028553, "rating": 5.0, "text": "I have visited U-hauls throughout the Shoals area and in many different states and I can now conclusively say that Karah at this location is bar none the best manager at any U-haul location that I have visited in over 15 years of having rented from U-haul.  She consistently goes out of her way to ensure that the customer has a pleasant experience and a smooth transaction with no task being considered too lowly for a manager to perform doing everything from skillfully handling U-hauls computer systems in record time, to even offering to help me to hook up a trailer in the rain!  If U-haul does not promote her to the corporate team soon, it will be a huge mistake on their part.\n\nI also have to mention Britney at this location who I have known for just a little less time than Kara.  Britney goes above and beyond in every transaction to see to it that my rental is in tip top shape and consistently has been first on the scene to help me to unhitch my trailer as soon as I arrive.  Brittney has the skills the knowledge, the personality to keep this location running like a greased wheel as a manager when Kara is promoted to corporate so U-haul what are you waiting for.\n\nI will have to recruit both of these amazing workers myself if your team doesn't choose quickly to make use of their amazing potential. I would consider the customer service at this U-haul location with these two team members to be the absolute best in the entire Shoals area. They are both a shining example of the customer service that this town is so desperately lacking.  It is rare to stumble across one worker like Brittney who enjoys what she does and does it well, it is even more rare to find a manager like Kara who does the same all while maintaining a productive and pleasant workplace for her team!\n\nWhen you visit this place, tell them Lee sent you!", "pics": null, "resp": {"time": 1612338405943, "text": "Dear Most Valued Customer, Karah and Brittany  of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama truly thank you for taking your valuable move time to not only award the highest 5 star experience rating for \"over the to\", consistent customer service in meeting your UHUAL needs in a rapid, accurate manner, but for your kind comments regarding honest, helpful customer care in a productive, pleasant environment assisting you in unhitching your trailer as soon as you arrive at the facility.  Your comments are greatly appreciated and so true as to it being rare to find such terrific customer care as given by Karah and Brittany.  Thank you so much for sharing your very satisfying experience with the team at Midgard Self Storage in Florence."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "109601185580891677028", "name": "Hailey K", "time": 1611431718501, "rating": 5.0, "text": "The facility is very secure and staff is friendly. They have moving dollies available to move things into your unit as well as a utility elevator. The storage area can't be accessed unless you have a code, units have locks, and there are cameras. I definitely trust that my belongings will be safe there.", "pics": null, "resp": {"time": 1611481416406, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for taking your valuable move time to give the highest 5 star experience rating for friendly, experienced customer service, site cleanliness and terrific security with your own keypad codes, locks, cameras and more and the added convenience of 24 hour 7 day a week access to your protected possessions as well as UHAUL trucks.  Thank you for sharing your terrific experience with the staff and security found at Midgard Self Storage on Glendale Street in Florence."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "111214843184232041645", "name": "Dwandre Parker", "time": 1626886937189, "rating": 5.0, "text": "The customer service was great, and it was a pleasure dealing with the employees!!", "pics": null, "resp": {"time": 1626912527427, "text": "Dear Most Valued Customer, the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star experience for great, professional and pleasant customer service in meeting your needs.  Thank you so much for sharing your satisfying customer service experience with the team and benefits available at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "109759562266168198000", "name": "Amy G", "time": 1609610723539, "rating": 5.0, "text": "Friendly service, excellent facilities, and very well-maintained. Highly recommended for all storage or U-haul rental needs. Easy to access, automatic lighting, carts and dollies available for use, but the managers/employees really make the experience great.", "pics": null, "resp": {"time": 1628241065897, "text": "Dear Amy G, the team of Midgard Self Storage located in Florence Alabama thank you for sharing your terrific UHAUL experience and look forward to meeting your needs again in the future."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "113023257823926635207", "name": "18 to Life", "time": 1611081969100, "rating": 5.0, "text": "Awesome staff and very helpful! Managed to get the best deal in town for a tow dolly. Highly recommend!!!", "pics": null, "resp": {"time": 1628240775692, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thankyou for sharing your terrific UHAUL experience and for your high recommendation.  We look forward to meeting your needs again soon."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "109042897361304313784", "name": "Leticia Luevano", "time": 1609860677548, "rating": 5.0, "text": "Karah was excellent. She was friendly, explained everything, and was extremely patient when our card kept getting declined and we were on the phone with the bank. This was one part of the moving experience that wasn't stressful.", "pics": null, "resp": {"time": 1609909048318, "text": "Dear Leticia, Karah and the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for taking valuable moving time to give the highest 5 star experience rating for helpful, explanatory customer care, site cleanliness, security and the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL trucks.  Thank you so much for sharing your terrific and helpful experience with Karah during a stressful time."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "117295859108665708406", "name": "Andrew Crowe", "time": 1609343806801, "rating": 5.0, "text": "I had a mishap that caused some of my blankets to go missing. The staff was understanding and gave me time to return them all.\n\nEveryone is extremely friendly and patient. If I ever need to move again I will be doing business with them for sure.", "pics": null, "resp": {"time": 1609389236152, "text": "Dear Andrew,  the team at Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thankyou for taking valuable move time to award the highest 5 star experience rating for outstanding, considerate customer service in assisting you in your move.  Thank you so much for your kind comments and we are most happy that we were able to meet your moving needs."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "112839137614955257056", "name": "Mechanic Unknown", "time": 1606917105377, "rating": 5.0, "text": "Super nice and clean facility. Awesome and friendly staff! I would highly recommend. Karah and Brittany are extremely helpful and make the whole process very easy.", "pics": null, "resp": {"time": 1606955373549, "text": "Dear Most Valued Guest, Karah and Brittany of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you so much for taking valuable move time to give the highest 5 star rating and for your kind comments regarding awesome, extremely helpful customer care offering clean and secure self-storage units to meet your needs with the added convenience of 24 hour 7 day a week access to your possessions.  Thank you so much for sharing your terrific experience and for your kind recommendation."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "105361589308394514316", "name": "David Weaver", "time": 1600873549969, "rating": 5.0, "text": "Spectacular Storage Facility!  Super clean! Super easy and convenient!  One stop shop with uhaul truck rental, clean storage unit and all the moving supplies I needed they had as well!  Staff is so nice and helpful!  They went above and beyond for us! I highly recommend this place!  Will be the only place I ever use for future needs!  Thanks again!", "pics": null, "resp": {"time": 1600920932605, "text": "Dear David,  the staff of Midgard Self Storage located at 1015 Glendale Street in Florence, Alabama sincerely thank you for taking valuable time from your move to award the highest 5 star experience rating for outstanding assistance the staff provides, UHAUL trucks and a complete line of moving/packing supplies, site cleanliness, security and the convenience of 24 hour 7 day a week access to your possessions.   Thank you so much for your kind recommendation and comments regarding the terrific staff and spectacular Midgard Self Storage-storage facility."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "114378057113404303776", "name": "Stephanie T", "time": 1611931350782, "rating": 5.0, "text": "Friendly and helpful staff. Karah is great! I highly recommend Midgard.", "pics": null, "resp": {"time": 1611986640517, "text": "Good Morning Stephanie, Karah and the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you so much for taking your valuable time to give the highest 5 star experience rating for friendly, helpful and great customer service, site cleanliness, security and the added convenience of 24 hour 7 day a week access to your possessions and UHAUL trucks.  Thank you so much for sharing your terrific experience with Karah's terrific customer care and the many benefits available to you at Midgard Self Storage in Florence."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "111403108372139951095", "name": "Lemyen Pughs", "time": 1613942621038, "rating": 5.0, "text": "Hi my name is jermale weathington.  The staff at this particular storage place are great. To be specific there's a lady by the name of karah she was the most nicest caring and understanding woman I've ever met . She took care of me in a very professional manner.  I was amazed honestly. To sum it all up if i ever need a place to store things or if i know someone that needs to store things ill visit back and refer people just because of her smile and her attitude thanks karah", "pics": null, "resp": {"time": 1628240436805, "text": "Dear Most Valued Guest, Karah and the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for giving the highest 5 star experience rating for Karah's outstanding, professional and caring customer service in meeting your every needs.  Thank you so much for sharing your very satisfying experience at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "103328906595108070893", "name": "Jamie Blair", "time": 1614796367195, "rating": 5.0, "text": "Super helpful and professional.  Karah did a fantastic job!!!", "pics": null, "resp": {"time": 1614872794293, "text": "Dear Jamie, Karah and the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you for taking your valuable time to give the highest 5 star experience rating for helpful, professional and fantastic customer service in meeting your self-storage needs with a clean facility, security and the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL trucks.  Thank you so much for sharing your fantastic experience with Karah's customer service at Midgard Self Storage in Florence.  We appreciate the opportunity to be able to meet your self-storage needs."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "107787298357957455825", "name": "Debbie Dixon", "time": 1611599802131, "rating": 5.0, "text": "Dave, Karah and Brittany are top notch .....friendly and helpful I highly recommend..", "pics": null, "resp": {"time": 1628240705945, "text": "Dear Debbie, Dave, Karah and Brittany thank you for your kind comments regarding the outstanding customer service provided at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "105093819669992155139", "name": "Pia Sweeney", "time": 1628619099897, "rating": 5.0, "text": "Very clean with video survelance!", "pics": null, "resp": {"time": 1628641321311, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for giving the highest 5 star experience rating for outstanding, professional assistance in providing a clean, secure facility with video coverage for your possessions.  Thank you very much for sharing your terrific experience with the team and the many benefits available at Midgard Self Storage on Glendale Street in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "100695839620570717888", "name": "Vicki Broadfoot", "time": 1626965914748, "rating": 5.0, "text": "Very polite and helpful!", "pics": null, "resp": {"time": 1627342406893, "text": "Dear Most Valued Guest,  the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you for taking your valuable time in providing the highest 5 star experience rating for very polite, helpful customer service provided by our team.  Thank you for sharing your terrific customer service with the team at Midgard Self Storage in Florence, Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "103784232076349700688", "name": "Pearl Stewart", "time": 1603557094587, "rating": 5.0, "text": "Karah was awesome! She’s probably the coolest, calmest, and sweetest manager I’ve ever dealt with. She’s very honest, too. I will always recommend Midgard, because Karah will take great care of you.", "pics": null, "resp": {"time": 1603573880983, "text": "Dear Pearl, Karah and the staff of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama sincerely thank you for taking your valuable time to award the highest 5 star experience rating for Karah's outstanding, calm extremely helpful and honest customer care, site cleanliness, security and the added convenience of 24 hour7 day a week access to your possessions.  Thank you so much for sharing your terrific experience with Karah and your kind recommendation."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "108677887729026240804", "name": "Tami Bates", "time": 1611418428050, "rating": 5.0, "text": "The staff were very friendly and I got excellent service. I would recommend them to anyone.", "pics": null, "resp": {"time": 1611481659952, "text": "Dear Tami, the team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thankyou so much for taking your valuable time to give the highest 5 star experience rating for friendly, excellent customer service, site cleanliness, security and the added convenience of 24 hour 7 day a week access to your possessions and UHAUL trucks.  Thank you so much for sharing your terrific experience with the team at Midgard Self Storage on Glendale Street in Florence."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "114946701448735803664", "name": "brad haddock", "time": 1626114730564, "rating": 5.0, "text": "Very helpful and friendly", "pics": null, "resp": {"time": 1626138977626, "text": "Dear Brad, the team of Midgard Self Storage located at 1015 North Glendale Street in Florence Alabama thank you for taking valuable time to give the highest experience rating for very helpful, friendly and professional customer service in meeting your needs.  Thank you so much for sharing your outstanding experience with the team and benefits available at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "107031504669391082310", "name": "chefftko", "time": 1614300965668, "rating": 5.0, "text": "Very good experience", "pics": null, "resp": {"time": 1614304390159, "text": "Dear Valued Customer, the team of MIdgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you for taking valuable time to give the highest 5 star experience rating for very good customer service, site cleanliness, security and the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL trucks.  Thank you so much for your kind comments and sharing your very good experience at Midgard Self Storage in Florence.  We appreciate the opportunity to be of service to you."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "110281947673939246928", "name": "Christy Ticer", "time": 1614108310013, "rating": 5.0, "text": "Wonderful service and customer service", "pics": null, "resp": {"time": 1614132477794, "text": "Hello Christy.  The team of Midgard Self Storage located at 1015 Glendale Street in Florence Alabama thank you so much for taking your valuable time to give the highest 5 star experience rating for wonderful customer service, site cleanliness, security and the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL trucks. Thank you so much for your kind comments and sharing your wonderful experience at Midgard Self Storage in Florence."}, "gmap_id": "0x887d498a86766113:0xf82e11d29838e661"}
{"user_id": "105383782144747938038", "name": "Gary Early", "time": 1557644094074, "rating": 5.0, "text": "They have lots buildings nice buildings and might some space you know if someone was looking for storage, nice people.", "pics": null, "resp": {"time": 1559176845069, "text": "Thank you sir! we appreciate your business."}, "gmap_id": "0x888a885b3295853d:0x5e82bab5ce12118c"}
{"user_id": "112951058137294725262", "name": "Scotty Towe", "time": 1543386150776, "rating": 3.0, "text": "Didn't like to nasty and expensive", "pics": null, "resp": {"time": 1543691085561, "text": "I’m sorry to discredit your opinion, but according to my records you do not and have not ever rented a unit from us. Also, we keep our gates locked to keep non renters off of the premises. We have a very clean, very affordable, and very secure storage business. If you would like your opinion to be taken seriously, you should come and tour our facility for what it really is, and not for whatever you feel it is. If you have any questions feel free to call or text 706-346-5317."}, "gmap_id": "0x888a885b3295853d:0x5e82bab5ce12118c"}
{"user_id": "111426771043210681849", "name": "Melody Magnetti", "time": 1600649493471, "rating": 5.0, "text": "Very friendly people", "pics": null, "resp": null, "gmap_id": "0x888a885b3295853d:0x5e82bab5ce12118c"}
{"user_id": "117951975836743455329", "name": "Michelle Slayton", "time": 1520475800831, "rating": 5.0, "text": "Great folks with safe Service", "pics": null, "resp": {"time": 1559176910795, "text": "We want our customers to feel secure!"}, "gmap_id": "0x888a885b3295853d:0x5e82bab5ce12118c"}
{"user_id": "102383207171081284454", "name": "World peace Lover", "time": 1608124318676, "rating": 5.0, "text": "Very fast loading,friendly people.", "pics": null, "resp": null, "gmap_id": "0x88860241b889664f:0xe10f41a50052568a"}
{"user_id": "111574325591916223925", "name": "Scott Dunham", "time": 1558624235953, "rating": 5.0, "text": "Hey ,,any place that let's me park ,is a plus.  Nice old guy woke me up and loaded the wagon right away.", "pics": null, "resp": null, "gmap_id": "0x88860241b889664f:0xe10f41a50052568a"}
{"user_id": "111535965377631105819", "name": "Gerald Cassavaugh", "time": 1573171083279, "rating": 4.0, "text": "Its a great place", "pics": null, "resp": null, "gmap_id": "0x88860241b889664f:0xe10f41a50052568a"}
{"user_id": "109660925005852301737", "name": "Stephanie Engelsen", "time": 1621607164014, "rating": 5.0, "text": "This is a great place to get loaded. Check in girl is very sweet and cute. Doesn't take long at all to get loaded. There's even candy for put out for customers and their staff.", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "107030531880130471648", "name": "Dev Yah", "time": 1606506863747, "rating": 1.0, "text": "Nice staff. Takes hours to get loaded. Get A lot of damage or something missing sometimes. I can unstand waiting a little. It comes with being a driver. But the damage goods and stuff like that been done while loading needs to be worked on.", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "106422878444382124603", "name": "Puneet Kohli", "time": 1624702986251, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "109120520244144842285", "name": "Edward jr Sampson", "time": 1580901072872, "rating": 3.0, "text": "I don't hate gulf states just pack your patients bring a book to read or if you have a t.v watch some movies.", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "101282972932737901810", "name": "Ron Decker", "time": 1581960364284, "rating": 1.0, "text": "Dirty and run down. The worst I’ve ever seen. Smells like dead chicken. People are nice", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "113029750475846834586", "name": "Pedro Melgar", "time": 1596490907193, "rating": 5.0, "text": "Nice warehouse definitely would come back", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "101901622306315704177", "name": "JT Love", "time": 1574107417945, "rating": 3.0, "text": "Got me in an hr early. Has overnight parking. Faiely fast load time.", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "107954106682546815074", "name": "J K", "time": 1553097947566, "rating": 1.0, "text": "Moved from 5 stars to 1 star. My appointment time was at 8 am it's past 11 there response was like when they get around they will come get you. How it sounds to me is they will come get you when they feel like it was how it came acrosss", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "111111344361123526977", "name": "samuel gautier", "time": 1516499530780, "rating": 3.0, "text": "Overnight parking is okay just stay away from the dock doors check-in lady was really nice loading took some time broker told me the load was ready but no 2hrs waiting for a door", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "105161221917149446282", "name": "Kesar Singh", "time": 1579041230100, "rating": 5.0, "text": "Nice staff fast load", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "108697724465720694748", "name": "James Southall", "time": 1519339024805, "rating": 5.0, "text": "Excellent Cold Storage for semi truck loads fast Professional Service", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "111339922669843346998", "name": "Joshua King", "time": 1524575296724, "rating": 4.0, "text": "Extremely friendly, but loading is slow. Two hours for 18 pallets already staged.", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "114909864789749629169", "name": "KTB Photography", "time": 1603004547576, "rating": 5.0, "text": "Cold", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "111044582019537986036", "name": "Teofil Babiy", "time": 1589426293972, "rating": 1.0, "text": "Long time delay", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "115495450102997750196", "name": "Ashanti Lewis", "time": 1515252174819, "rating": 5.0, "text": "been working at this place for 6 years. needs improvements.", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "105459098012338233222", "name": "Be Safe", "time": 1540262722405, "rating": 5.0, "text": "Fast fast loading", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "113585244099556880571", "name": "Chris Williams", "time": 1572525228826, "rating": 3.0, "text": "Stinks there", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "116769277052409805629", "name": "Yu Po", "time": 1569042441407, "rating": 4.0, "text": "Drivers, unloading,  in-out 50 min", "pics": null, "resp": null, "gmap_id": "0x889294863251e59b:0x3663647190e7d5ea"}
{"user_id": "101982370343117666525", "name": "Diana Lynn Busacca", "time": 1616122339129, "rating": 5.0, "text": "Very well kept, clean and secured facility. On site bathroom. Good lighting throughout. Staff very friendly,  professional and personable.  Ive been using this storage facility for 2 plus years. Never a problem.  They make making a payment very easy and convenient either by phone during business hours or anytime on line. Temperature is always kept to keep your belongings in their best state. Worth the money and highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "116324244836026607314", "name": "Michael Thomason", "time": 1594967400856, "rating": 5.0, "text": "Nice and clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPs_71Ke4YhOwbJvrRUQZURgRA-dpLN8OfhOTAf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPs6PXbf0b-wYZ5EqLkeTDCbuPqlnD3a6FRZcOW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQ4koACdB_8zOmcFeCu_FPdRL83nSdK_mjB8eq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "105412364726480297539", "name": "Lealus Tucker", "time": 1624050624625, "rating": 5.0, "text": "I've been dealing with these folks for 10 years with no problem at all", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "117407136624951576912", "name": "Chris Meacham", "time": 1616931439741, "rating": 5.0, "text": "Great place! We currently have two units here.  Very friendly staff and units are very well taken care of.", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "105674939480184689059", "name": "Barbara Davidson", "time": 1619350718508, "rating": 1.0, "text": ". was booked up and Storage didn't get one but you need it real bad", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "115928585390700415691", "name": "Anita Winslow", "time": 1615305518073, "rating": 5.0, "text": "Reasonable rates and friendly service. We have used them for many years with no problems.", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "110134950093829249674", "name": "Trista Williams", "time": 1604779090318, "rating": 5.0, "text": "They got me in quickly and easily. If I need more storage again, then I will be using them again.", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "104824693173435307142", "name": "La Donna Griffin", "time": 1610489541455, "rating": 4.0, "text": "The lady is nice, also, can make payment by phone.", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "101538215248652419401", "name": "Melody Byrd", "time": 1622092628660, "rating": 3.0, "text": "No available units", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "110194195700724810341", "name": "Michael Sims", "time": 1556452463182, "rating": 5.0, "text": "Staff is awesome. They work hard to meet the needs of the customer as best as possible.. An to keep the place clean.", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "103968963996314488545", "name": "Bruce Dotson", "time": 1614400806451, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "106911007578434681973", "name": "sandra swearingen", "time": 1576442695094, "rating": 5.0, "text": "Love those girls", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "116510324012680639222", "name": "Justin Loyd", "time": 1585014447539, "rating": 5.0, "text": "Clean and tidy", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "105162396228220861886", "name": "Terry Alldredge", "time": 1549374559528, "rating": 5.0, "text": "Love the scenery", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "105493376276005196254", "name": "jimmy langley", "time": 1552350994508, "rating": 5.0, "text": "Very secure", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "111186701568791850714", "name": "Teresa Jump", "time": 1573667698836, "rating": 4.0, "text": "great people", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "100349434773865941401", "name": "Sandra Swearingen", "time": 1501113787731, "rating": 5.0, "text": "they are friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x8889ca4c93390c87:0x24e660e6646ec553"}
{"user_id": "101832155373319338368", "name": "Crow Bro", "time": 1623387250266, "rating": 5.0, "text": "I had never rented a storage unit before, and had SO many questions, but Courtney was absolutely amazing! She helped me through every step of the process, and answered all of my questions with professionalism, courtesy, and absolutely wonderful customer service. I am not storing anything that would necessarily be of much value to many people, but it still gave me a great sense of security knowing that she is always on site looking out for my belongings and those of other tenants. She made me feel very confident not only in her abilities in her job, but also in the care and respect that she shows to tenants at Midgard. She was super friendly, a great conversationalist, and definitely set the bar for any future self-storage experiences I may have in the future. She is an absolute gem!", "pics": null, "resp": {"time": 1623471132992, "text": "Dear Most Valued Guest, Courtney and the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you for taking your valuable time to give the highest 5 star experience rating for outstanding, courteous and professional customer service providing a quality, clean, secure self-storage facility in order to meet your self-storage needs.  Thank you for sharing your super friendly professional experience provided by Courtney in meeting your needs.  We truly appreciate the opportunity to be of service to you."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111267697836289403908", "name": "Tony Kimbrell", "time": 1604084187101, "rating": 5.0, "text": "We sold our house and needed an additional unit but the place we had our other unit had no vacancies then we found Midgard and they hooked us up with what we needed. The unit was clean and accessible pulling a trailer in and out of the property . The lady at the front desk was very friendly and very helpful , thanks again . Pictured is our unit I had just emptied out .", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM2IYwvWPTJK-XKu9MPEoGzA329DIJKrUKT-ZB8=w150-h150-k-no-p"]}], "resp": {"time": 1604115166770, "text": "Dear Tony, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama truly thank you for taking your valuable time to award the highest 5 star experience rating for true customer service in listening to and meeting your needs, site cleanliness, ease of entry/exit, and the added convenience of 24 hour 7 day a week access to your possessions.  We truly thank you so much for sharing your great experience with the staff and the benefits found at Midgard Self Storage."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "117845463942935913470", "name": "David Johnson", "time": 1621922119454, "rating": 4.0, "text": "Really nice staff and a rally nice, clean, well maintained facility. Also, have a large selection of UHAUL trucks. My only reason for not giving a 5 star is I think the price for parking a boat or RV on gravel is too high.", "pics": null, "resp": {"time": 1621950167348, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you for taking your valuable time to give a high experience rating for very accommodating, professional customer care, well maintained, clean and secure facility and ease of parking your boat/RV.  Thank you for your input as we make every effort to have very competitive prices in the area and exceed with well maintained and secure grounds and \"over the top\" customer service.  We do appreciate having you as our Guest."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116989196020648677068", "name": "LaKetta Williams", "time": 1619461406821, "rating": 5.0, "text": "As a first time mover, Courtney answered every question I had. She helped me have a seamless rental experience, and she was very knowledgeable and even gave some great moving tips! 10/10 would recommend!", "pics": null, "resp": {"time": 1619492955834, "text": "Dear Most Valued Guest, Courtney and the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you so much for taking your valuable moving time to give the highest 5 star experience rating for Courtney's knowledgeable, helpful customer service, seamless rental experience and professional advice regarding moving and storage tips.  Thank you for sharing your 10/10 experience with the professional customer care offered by Courtney as well as the many benefits available at Midgard Self Storage in Florence, Alabama.  We appreciate the opportunity to meet your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "112043089705747283370", "name": "Varus", "time": 1497108383911, "rating": 5.0, "text": "Have a small unit here, and a climate control at their facility on Mall DR. Prices are pretty good plus they offer move in deals. Very nice employees, good security and no bugs. 5-Stars.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOVUDDeuKhNVy88XAzjc91Rre7SKk2YrVRB3K4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPPZjVYQPPABK82V1v6OiL389yRcONCozFjSwE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxby6N1TbWYiKBV4DKai5PbAfPf4lLn1GFhbQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh-kiQULmxJYiPpKN2NopyT6bBFkW9IYuFd_k=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111019951790254810215", "name": "Case Robertson", "time": 1620768496479, "rating": 2.0, "text": "The staff is excellent but the company has a policy to not accept cash. I would stay with them because of the friendly staff but not accepting cash is un-American.", "pics": null, "resp": {"time": 1620832162800, "text": "Dear Case Robertson, we thank you for mentioning that Midgard does not take cash at this time.  The reason spans from the current COVID pandemic, thus keeping both our customers and employees safe from handling cash to safety at the facility with no cash on site.  We do apologize for your immediate inconvenience and appreciate your input and we appreciate you as our customer and will do everything possible to protect you, our employees and your possessions."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107035256455833354421", "name": "brooke rivera", "time": 1609628455116, "rating": 5.0, "text": "The Young ladies that took care of what I needed were very helpful kind and professional. They also got everything ready in a timely manner. I would recommend the facility it is clean and they have temperature control or outside units. I have a temperature unit and am very satisfied. It is also gated.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107029061235980921616", "name": "Low Down", "time": 1613695804191, "rating": 5.0, "text": "Leah great and by far the nicest person I've meet at this place Alex was a great guy to but he's gone so they done the right thing by letting Leah be next in line.she. is a great person. But on the other hand the other lady in the office with her is RUDE always got something rude to say about customers and she don't know them like that being rude don't get you customers people like Leah do keep up the good work leah", "pics": null, "resp": {"time": 1613698055772, "text": "Dear Pickels Mut, Leah and the building team at Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you for taking your valuable time to give us important input and the highest 5 star experience rating for Leah, site cleanliness, security and the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL trucks.  Thank you again for your input and for sharing your terrific experience with Leah at Midgard Self Storage in Florence.  We appreciate the opportunity to be of service in meeting your needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111361986340186850058", "name": "hazey daze", "time": 1617132246688, "rating": 5.0, "text": "Great experience courtney was wonderful Definitely will be recommending friends and family to use Midgard self storage for all of their storage needs ⭐⭐⭐⭐⭐", "pics": null, "resp": {"time": 1617157528573, "text": "Dear Most Valued Customer, Courtney and the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you for taking your valuable time to give the highest 5 star experience rating for wonderful, professional customer care, facility cleanliness and security and all with the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL trucks.  Thank you for sharing your great experience with terrific customer care offered by Courtney and the many benefits available at Midgard Self Storage in Florence, Alabama."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116597477804273878818", "name": "Heath Brown", "time": 1617469659864, "rating": 5.0, "text": "Great customer service and Leah was very helpful in determining which unit fit our needs.", "pics": null, "resp": {"time": 1617540354410, "text": "Dear Heath, Leah and the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you so much for taking your valuable time to give the highest 5 star experience rating for great and helpful customer service in determining the best size self-storage unit to fit your needs in a clean, secure facility with the added convenience of 24 hour 7 day a week access to your possessions as well as UHAUL equipment.  Thank you so much for sharing your experience with Leah's customer service at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "108268129720724289001", "name": "Karen Farmer", "time": 1613862094089, "rating": 5.0, "text": "Absolutely perfect.  Easy access, wonderful staff, and clean climate controlled building.", "pics": null, "resp": {"time": 1613890239561, "text": "Dear Most Valued Guest, the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star experience rating for outstanding customer care, easy access to your self-storage unit, site cleanliness, climate control, security all with the added convenience of 24 hour 7 day a week access to your possessions and UHAUL trucks.  Thank you so much for sharing your perfect experience with the team and sharing the many benefits available at Midgard Self Storage in Florence."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116206996404975049757", "name": "Jennifer Poss", "time": 1602510795548, "rating": 5.0, "text": "Leah is a great employee! She is very polite and helpful.  She deserves a raise! The location is very convenient and Leah was great in helping us out in a last minute situation.", "pics": null, "resp": {"time": 1602531707846, "text": "Dear Jennifer, Leah and the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama sincerely thank you for awarding the highest 5 star experience rating for polite, helpful customer service, conveniently located,  assisting you in a last minute situation.  Thank you so much for sharing your terrific experience with Leah and the Midgard Self Storage facility on Chisholm Road in Florence."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "112004318983542479541", "name": "Sonya Cox", "time": 1595550362441, "rating": 5.0, "text": "Very convenient location and 24 hour security monitoring. Easy access to enter. Leah, the front desk assistant is super friendly, sweet, helpful, courteous, and was able to answer all our questions. Would highly recommend this storage facility.", "pics": null, "resp": {"time": 1595556295929, "text": "Dear Sonya, Leah and the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama truly thank you for taking valuable time to award the highest 5 star experience rating for helpful, courteous customer service, answering all self-storage questions you have and providing the right self-storage unit in a clean, secure facility with 24 hour 7 day a week access to your possessions.  Thank you for sharing your terrific experience  with Leah and the staff of Midgard Self Storage and for you terrific recommendation."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "102559610187141987136", "name": "IS Tillman", "time": 1579056953464, "rating": 5.0, "text": "My experience was very pleasant. I had to make alternative arrangements with my storage needs and the Midgard staff came through in a big way. The whole process of renting the unit went smooth. They were helpful and attentive to making sure that I was satisfied with the unit. I appreciate the great customer service and friendliness of the staff. I will recommend them to my friends and family. Keep up the good work!!!", "pics": null, "resp": {"time": 1579095960530, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL sincerely than you for taking valuable time to award the highest 5 star experience rating for helpful, attentive great and friendly customer service, security, cleanliness and 24x7 access.  We really do appreciate your kind words regarding satisfaction with the service and self-storage facility as your recommendation is very important.  Thank you again and we will continue to do our very best to meet your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111505503222939934785", "name": "Jackie Ford", "time": 1607576300457, "rating": 5.0, "text": "I was greeted when i walked in. The lady was really nice and helpful.", "pics": null, "resp": {"time": 1607607779855, "text": "Dear Most Valued Guest, Leah and Courtney of Midgard Self Storage located at 4450 Chisholm Road Florence Alabama truly thank you for taking valuable time to give the highest 5 star experience rating for nice and helpful customer service.  Thank you so much for sharing your terrific experience with the team at Midgard Self Storage in Florence."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116488980277709963107", "name": "Frankie Dotson", "time": 1593976231124, "rating": 5.0, "text": "Chisholm road lot rents U-Haul and has plenty of storage space with never having an illegal disturbance. Safest place around and had me a great deal for an across state move. Check these guys out. Ask for the man named Jason for any questions.", "pics": null, "resp": {"time": 1594023832734, "text": "Dear Frankie, Jason and the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence, Alabama sincerely thank you for taking valuable time to award not only the highest experience rating for outstanding customer service in answering any self-storage questions you had, site cleanliness, terrific security and 24 hour 7 day a week access to your possessions, but also for your most kind words of recommendation.  Thank you for sharing your terrific experience.  We look forward to cotninuing to meet your self-storage needs in the same polite manner."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "103418890484421840122", "name": "Keri S", "time": 1624092039211, "rating": 1.0, "text": "Tried to over charge me", "pics": null, "resp": {"time": 1624148280335, "text": "Dear Keri S, our team has checked all records and cannot find that we have ever had the opportunity to be of service to you.  Please contact our office at your earliest convenience as we know you would appreciate the terrific, customer-focused service and outstanding clean and secure facility with highly competitive rates.  We look forward to meeting you."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116939698667124548355", "name": "Derek Wilson", "time": 1598635594817, "rating": 5.0, "text": "David was helpful making sure we had everything for our U-haul rental.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107593896605045242923", "name": "Kaleigh adams", "time": 1585976895859, "rating": 5.0, "text": "Amazing first U-haul rental! The guy was so helpful and explained everything very well! He also put the dolly in the truck and pulled it up from the spot for me! I would highly recommend this location to anyone looking to rent a U-haul!", "pics": null, "resp": {"time": 1589653015687, "text": "Dear Kaleigh,  the staff at Midgard Self Storage located at 4450 Chisholm Rd in Florence, AL sincerely thank you for awarding the highest 5 star experience rating for outstanding customer care in meeting your UHAUL needs and having the necessary equipment placed in your truck in order to meet your moving needs.  Thank you for permitting Midgard  to be your UHAUL dealer of choice.  We look forward to meeting your UHAUL as well as packing supply, locks, boxes and self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "108233846713384061752", "name": "Chandler Bridges", "time": 1561741101275, "rating": 5.0, "text": "Okay, let me start by saying I have moved many many times. I have also had storage units for over 25 years and in all sizes, shapes, and locations. This facility in little old Florence is by far the absolute best experience I have ever had. Not only with the storage units (clean, well lit, safe, 24 hour access), but also in that this location is a U-haul renter. I have rented 10 foot, 15 foot, and 26 foot trucks with ease multiple times from these nice folks in my two years here in Florence. Also, I have taken two 12 foot trailers and a 26 foot truck on one-way adventures. Every time the equipment is ready and the service is super fast. Alex the on-site manager is by far the nicest and most accommodating employee I have ever met at a place like this. It is always a pleasure to go in and see him. Leah, his competent co-worker, is equally as pleasant and adept at getting the job done for the customer with ease. I really can’t speak highly enough about the staff at this fantastic location. I hope if Alex ever leaves this job he would consider working for me, because I know and appreciate the value of an employee that not only cares about the customer’s business but also values the interactions with them as well. Well stocked, honest, considerate and caring sums up this Chisholm road location. They get my highest recommendation.", "pics": null, "resp": {"time": 1561743665642, "text": "Dear Most Valued Customer - the staff of Midgard Self Storage on Chisholm Road in Florence Alabama sincerely thank you for providing the highest rating for customer service, cleanliness, security and 24x7 access to your RV equipment.  We sincerely appreciate you as a customer and know you took valuable time to provide this highest review and very kind words.  They are most appreciated and we thank you and look forward to continuing to meet your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107147037382541257614", "name": "Jeff Franks", "time": 1595138526405, "rating": 5.0, "text": "Service was great had everything ready when I arrived. Will definitely use this service again of needed.", "pics": null, "resp": {"time": 1595179986013, "text": "Dear Jeff, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama sincerely thank you for taking valuable time to award the highest 5 star experience rating for quickly and efficiently meeting your needs when you arrived at our facility.  Thank you very much for sharing your kind words and we do look forward to servicing you for your UHAUL and/or secure, safe self-storage needs in the future."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111612727332285029026", "name": "Dustin F", "time": 1581445849178, "rating": 5.0, "text": "I had to rent a Uhaul quick and Midgard made it so easy. Leah was such a great help, but I have dealt with Jason before and he is great too. Beyond getting in an out in a matter of minutes, they had fresh coffee and cookies so that was a plus. I would definitely recommend Midgard to anyone!", "pics": null, "resp": {"time": 1581520824161, "text": "Dear Most Valued Customer, Leah and Jason of Midgard Self Storage located on Chisholm Rd in Florence, AL sincerely thank you for awarding the highest 5 star experience rating for quick, easy UHAUL lease up in a matter of minutes AND fresh coffee and cookies.  Thank you very much for your highest recommendation for the staff and Midgard Self Storage site in meeting your UHAUL needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "110894577934157773624", "name": "Kerry Shapiro", "time": 1583173034620, "rating": 5.0, "text": "I've been a happy customer of the Chisholm Rd. Midgard Storage facility for three years. Leah and Jason (and previously Alex) are great to work with and keep the property clean and accessible. Keep up the good work!", "pics": null, "resp": {"time": 1583200557149, "text": "Dear Most Valued Long-Term Guest, the staff of Midgard Self Storage located at 4450 Chisholm Rd in FLorence, AL sincerely thank you for awarding the highest 5 star experience rating for 3 years of terrific experience with Leah and Jason as well as Alex, terrific site cleanliness, security, and 24x7 accesibility as well.  We greatly appreciate serving you as a Midgard Self Storage customer and look forward to continuing to meet your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116056749067241433817", "name": "Michelle Taylor", "time": 1595621805027, "rating": 5.0, "text": "Excellent service. Thanks for helping me with storage during my renovation", "pics": null, "resp": {"time": 1595642511473, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence, Alabama sincerely thank you for awarding the highest 5 star experience rating for excellent customer service, site cleanliness, security and 24 hour 7 day a week access to your possessions.  We appreciate the opportunity to meet your needs during this renovation period and thank you very much for sharing your excellent experience."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "112736269731833861217", "name": "Drew Coleman", "time": 1584815740615, "rating": 5.0, "text": "Very helpful. Got to move everything in that day. It was quick and easy. Guy was super nice at the desk and answered all of my questions.", "pics": null, "resp": {"time": 1589656988045, "text": "Dear Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Rd in Florence, AL greatly appreciate taking valuable time to award the highest 5 star experience rating for great customer care, site cleanliness, security and a quick move in  to accommodate your needs.   Thank you so much for sharing your helpful experience."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111373180977367709136", "name": "Natalie Gambrell", "time": 1577019589547, "rating": 5.0, "text": "Great experience with Jason & Midgard storage. Reserving a unit was quick and easy, the facility was clean and in great condition. Jason was very professional and helpful. No complaints:)", "pics": null, "resp": {"time": 1577043915998, "text": "Dear Most Valued Guest, Jason and the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL, sincerely thank you for awarding the highest 5 star experience rating and taking valuable time to provide you most kind words regarding Jason's customer service done in a quick and easy manner, site cleanliness, security and 24x7 access.  Thank you again for your kind words of commendation regarding Jason and the Midgard Self Storage facility."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "109709315015272003031", "name": "terria hill", "time": 1595189239201, "rating": 5.0, "text": "A great place would highly recommend! Very helpful people!", "pics": null, "resp": {"time": 1595243903666, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence, Alabama sincerely thank you for taking valuable time to award the highest 5 star experience rating for very helpful customer service, site and UHAUL equipment cleanliness, security and 24 hour 7 day a week access to your possessions and UHAUL trucks and equipment.  Thank you so much for your recommendation.  The staff of Midgard Self Storage does look forward to continuing to meet your self-storage and/or UHAUL needs in the future."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "100938099507974290114", "name": "Chris Lee", "time": 1582407044259, "rating": 5.0, "text": "I had amazing experience today with Jason made my entire transition of moving alot smoother. I would highly recommend Midgard Self Storage.\n\nThanks Jason!", "pics": null, "resp": {"time": 1582425453078, "text": "Dear Most Valued Guest, Jason and the staff of Midgard Self Storage located at 4450 Chisholm Rd in Florence, AL sincerely thank you for awarding the highest 5 star experience rating for an amazing experience as Jason assisted your transition of moving smoother which is always stressful.  Thank you so much for your recommendation of Jason and Midgard Self Storage site cleanliness, security and 24x7 access.  We greatly appreciate you sharing your experience with ourselves and others."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "102281381260910507735", "name": "Andrew Franck", "time": 1576877004158, "rating": 5.0, "text": "Our entire experience was excellent. Jason took great care of us, answering every question and showing us multiple units to find one that best fit our needs. He was quite knowledge and helpful.", "pics": null, "resp": {"time": 1576954713399, "text": "Dear Most Valued Guest, Jason and the staff of Midgard Self Storage located at4450 Chisholm Rd, Florence, AL, sincerely thank you for awarding the highest 5 star experience rating for excellent customer service in making sure your self-storage need sizes are met, cleanliness, security and 24x7 access.  Your kind words regarding Jason are greatly appreciated.  We wish you a Very Happy Holiday season."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104363420349927914676", "name": "Luke Baxter", "time": 1582315724155, "rating": 5.0, "text": "Very pleasant to do business with! Jason was super nice and friendly! The office is very clean and inviting.", "pics": null, "resp": {"time": 1582338834785, "text": "Dear Most Valued Customer,  Jason and the staff of Midgard Self Storage located at 4450 Chishom Rd in Florence, Alabama sincerely thank you for awarding the highest 5 star experience rating for super nice, friendly customer care, site, both office and self-storage facility cleanliness, security and 24 hour 7 day a week access to your possessions.  Thank you very much for sharing your terrific experience with Jason and the Midgard Self Storage facility in meeting your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "112924815013981055912", "name": "Sinaca Butcher", "time": 1588697310620, "rating": 5.0, "text": "Leah was awesome they were very helpful I will come here for more services", "pics": null, "resp": {"time": 1589640135665, "text": "Dear Sinaca, Leah and the staff of Midgard Self Storage located at 4450 Chisholm Rd. in Florence AL sincerely thank you for taking your valuable time to award the highest 5 star experience rating for awesome customer service, security, site cleanliness and assistance with your moving needs.  We look forward to being the \"go to\" people for your services in the future whether it be locks or boxes and packing supplies, UHAUL equipment or self-storage."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111538775827097453978", "name": "Christine Brodhagen", "time": 1563058104071, "rating": 5.0, "text": "Alex and Leah are amazing!! They were able to find a perfect storage unit for my needs at a price in my budget. So nice and made the entire transaction smooth and quick.", "pics": null, "resp": {"time": 1563068387214, "text": "Dear Most Valued Customer - The staff of Midgard Self Storage located on Chisholm Road in Florence Alabama sincerely thank you for providing the highest rating for customer service, budget pricing, cleanliness, efficient and easy lease up experience and 24 hour 7 day a week access for your possessions.  Thank you very much for rating your self-storage experience the highest and especially for your very kind words regarding meeting your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104848751254963636672", "name": "Lance Duncan", "time": 1561509077591, "rating": 5.0, "text": "Alex and Leah are the best. Great customer service.  I use a storage unit for my work so I am there daily. Both Alex and Leah are always helpful and willing to help me with anything I need. From recieving packages, mailing out packages, courtesy calls when I receive something, I can't imagine any other facility being so conscious of my needs. The office and grounds are always immaculate. I would definitely recommend them for your storage needs.", "pics": null, "resp": {"time": 1561513162377, "text": "Dear valuded customer - the staff of Midgard Self Storage in Florence, Alabama sincerely thank you for providing the highest rating on customer service, cleanliness, security, 24x7 access and accepting  your packages.  We know you took valuable time to  provide this highest rating and such kind words and greatly appreciate the comments.  We look forward to continuing to serve you and sincerely thank you again."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "101525524295049038495", "name": "Lawrence Mora", "time": 1618677284533, "rating": 5.0, "text": "Quick and clean", "pics": null, "resp": {"time": 1618716492265, "text": "Dear Lawrence, the team of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama thank you for taking your valuable moving time to give the highest 5 star experience rating for quick, professional customer service in getting the right self-storage unit leased in a clean and secure facility with the added convenience of 24 hour 7 day a week access to your possession.  We truly appreciate the opportunity to meet your self-storage needs and thank you for sharing your positive experience at Midgard Self Storage in Florence Alabama."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "109867801705370185968", "name": "Lashunda Clark", "time": 1582395651318, "rating": 5.0, "text": "Jason and Leah are a strong team and they have such a great rep-ore with their customers, they are always willing to help in any way they can and they are very knowledgeable about haul and moving materials and storage! Highly recommended!", "pics": null, "resp": {"time": 1582425781944, "text": "Dear Most Valued Guest, Jason and Leah of Midgard Self Storage located at 4450 Chisholm Rd in Florence AL sincerely thank you for taking your valuable time to award the highest 5 star experience rating for terrific customer service assistance in assisting you with UHAUL equpment, moving materials and the correct self-storage unit in order to meet your needs.  The site cleanliness, security and 24x7 access adds more benefits to the decision you have made.  Thank you so much for the rating but most importantly for your words regarding the positive experience with Jason and Leah at Midgard Self Storage in Florence."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "105077051057386330609", "name": "Robin Lazenby", "time": 1579292533045, "rating": 5.0, "text": "The clerk was very helpful in getting us set up with a storage unit. We are downsizing from a house to an apartment, so it was been stressful trying to figure out what we want to take and where to put it. Thanks for the help!", "pics": null, "resp": {"time": 1579407470264, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL sincerely thank you for awarding the highest 5 star experience rating for outstanding helpfulness in providing the right size self-storage unit for your possessions.  We understand the stress of moving and are so glad we were able to assist.  The staff of Midgard Self Storage does listen to understand your needs and then are able to match our many benefits to meet your needs at Midgard Self Storage.   Thank you so much for your words of recommendation."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107508776834893431921", "name": "Danielle Aston", "time": 1582414410038, "rating": 5.0, "text": "Great experience!!  Thank you for making our storage and uhaul rental simple.  The fresh baked cookies were a pleasant sight after our 4th trip to load the unit!", "pics": null, "resp": {"time": 1582425173545, "text": "Dear Most Valued GUest, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence AL sincerely thank you for taking valuable time to award the highest 5 star experience rating for a great experience in customer service, assisting in providing the best self storage unit and UHAUL needs, site cleanliness, security, 24x7 access AND fresh baked cookies for you after a tiring move.  Thank you so very much for your rating and terrific experience description as it all is greatly appreciated.  AND, please come in and have a few more warm cookies !"}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "101438481074251247182", "name": "Lauren Tittle", "time": 1589321480921, "rating": 5.0, "text": "The customer experience was spectacular, completely satisfied with how I was treated. I’m going to use this Uhaul/storage facility for all me moving and storing needs!", "pics": null, "resp": {"time": 1589377835152, "text": "Dear Most Valued Customer, the staff of Midgard Self Storage located at 4450 Chisholm Rd in Florence AL truly thank you for taking your valuable time to award the highest 5 star experience rating for spectacular, completely satisfying customer service for your UHAUL and self-storage needs.  Thank you so much for sharing your experience and for your most kind words.  We sincerely appreciate you in every way."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "113046293102350855600", "name": "Melanie Cromwell", "time": 1587498091905, "rating": 5.0, "text": "Great friendly people.  Very clean property.  I I’ll be using again.", "pics": null, "resp": {"time": 1589649055656, "text": "Dear Melanie, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama truly thank you for taking valuable time to award the highest 5 star experience rating and for your kind words regarding friendly customer care, site cleanliness, security, 24 hour 7 day a week access to your possessions and available UHAUL equipment and packing supplies to meet your needs.  Thank you so much for sharing your terrific experience and kind words.  We do look forward to serving you again soon."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104664501638971421465", "name": "Hunter Sisti", "time": 1591123257573, "rating": 5.0, "text": "Very helpful, gave me good directions, helped with hitching my trailer and had exact hitch needed. Will use them again!", "pics": null, "resp": {"time": 1591173559680, "text": "Dear Hunter, the staff of Midgard Self Storage located at 4450 Cisholm Rd in Florence, AL sincerely thank you for taking valuable time to award the highest 5 star experience rating for very helpful customer service leasing your UHAUL trailer.  We are most happy to have met your UHAUL needs and helping with the hook up and directions.  Thank you so much for your recommendation and we look forward to meeting your UHAUL and/or self-storage needs in the future."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104601511622069477182", "name": "Kat Balga", "time": 1582806761462, "rating": 5.0, "text": "Leah was awesome. Helped me find the right size unit at a great price.", "pics": null, "resp": {"time": 1582857643744, "text": "Dear Kat, Leah and the staff of Midgard Self Storage located at 4450 CHisholm Rd in Florence, AL really do thank you for taking valuable time to award the highest 5 star experience rating for awesome customer service in assisting you in finding the right sized unit, site cleanliness,  security and 24x7 access to your possessions.  Thank you so much for sharing your terrific experience with Midgard Self Storage and others."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107127252181426326960", "name": "Justin Moore", "time": 1556227781505, "rating": 5.0, "text": "Great place to do buisness. The staff is very friendly and helpful. The customer service here is the best you will find anywhere. All facilities including the parking lot here are clean and well taken care of.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "108426312404237394473", "name": "Jennifer White", "time": 1564766898330, "rating": 5.0, "text": "I was able to get a storage unit the same day after another company tried to put me on a waiting list. Leah and Alex were so helpful and I would definitely recommend this company!", "pics": null, "resp": {"time": 1564774601051, "text": "Dear Most Valued Customer - Leah and Alex sincerely thank you for providing the highest rating experience for customer service, cleanliness, security and 24 hour 7 day a week access of your possessions.  We thank you for taking valuable time for providing this highest experience rating and thank you for your most kind words and recommendation of Midgard Self Storage.  Thank you for permitting Midgard to meet your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "106741330968702800300", "name": "Trinity Weaver", "time": 1572897370770, "rating": 5.0, "text": "Very polite and friendly. Very professional. Frank was very helpful and kind. Highly recommend.", "pics": null, "resp": {"time": 1573090397700, "text": "Dear Most Valued Customer, Frank and the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL, sincerely thank you for providing the highest 5 star experience rating for very polite, friendly and professional customer service, cleanliness, security and 24 hour 7 day a week access for your possessions.  Thank you so very much for providing the 5 star rating and especially for taking valuable time to provide such kind words regarding Frank."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "111477573477115318170", "name": "Brianna Green", "time": 1582732359624, "rating": 5.0, "text": "Jason was really helpful at meeting all of my needs and very friendly!", "pics": null, "resp": {"time": 1582791660035, "text": "Dear Brianna, Jason and the staff of Midgard Self Storage located at 4450 Chisholm Rd in Florence, AL sincerely thank you for giving a great shout out of the highest 5 star experience rating  for Jason's helpful, friendly customer care, site cleanliness, security and 24 hour 7 day a week access to your possessions.  Thank you for taking valuable time to share your terrific experience with Jason at Midgard Self Storage on Chisholm Rd in Florence."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "117597564120594430077", "name": "Tyler Brackin", "time": 1596314771821, "rating": 5.0, "text": "Very friendly staff, even let me use their water and hose to wash my motorcycle!", "pics": null, "resp": {"time": 1596367273597, "text": "Dear Tyler, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama truly thank you for taking valuable time to award the highest 5 star experience rating for friendly and helpful customer service in helping to keep your motorcycle safely and securely stored and providing water and a hose in order to wash your terrific cycle.  The 24 hour 7 day a week access gives easy in and out access to your cycle as well.  Thank you so much for sharing your terrific experience with the staff at Midgard Self Storage."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "103033269925038480923", "name": "The Relocation Moving Company", "time": 1576770631234, "rating": 5.0, "text": "As an owner of a moving company I have to rent trucks on a regular basis. I have had alot of unplesant experiances with uhaul employees in the area. My experiance here was night and day compared to what I am used to. If you need a truck and storage this is the place to go!", "pics": null, "resp": {"time": 1576788039625, "text": "Dear Most Valued UHAUL Customer, the staff of Midgard Self Storage sincerely thank you for awarding the highest 5 star experience rating regarding your UHAUL experience.  Taking your valuable time to provide the rating AND the kind words of commendation are greatly appreciated. We thank you for both and look forward to meeting your needs again in the future."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "109168000350281601982", "name": "Cassie Word", "time": 1568918987741, "rating": 5.0, "text": "Midgard has been a wonderful place for our storage needs. Staff is always very friend and helpful.", "pics": null, "resp": {"time": 1569031051813, "text": "Dear Most Valued Customer, the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL sincerely thank you for providing the highest 5 star experience rating for friendly, helpful customer service, cleanliness, security and 24 hour 7 day a week access for your possessions.  Thank you very much for taking valuable time to provide your most kind and appreciated comments."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104977482300533359136", "name": "Jheri Keener", "time": 1534548010929, "rating": 5.0, "text": "Had a pleasant experience getting my paperwork done for a unit today. Leah made everything very simple and fast! Would definitely recommend! Prices are great too.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104024909379810802738", "name": "Jerry Cox", "time": 1563809808347, "rating": 5.0, "text": "I went to this on Hwy 17 rented storage they was so kind nice help me in every way I be not looking around for any storage needs I need I be staying here", "pics": null, "resp": {"time": 1563834955108, "text": "Dear Most Valued Customer - The staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama sincerely thank you for your highest rating for customer service, cleanliness, security and 24 hour 7 day a week access for your possessions.  We thank you for your kind words and look forward to continuing to serve your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "115118396850870858815", "name": "brad crosslin", "time": 1564853475520, "rating": 5.0, "text": "Alex at midgard did an excellent job providing exactly what we needed at the most affordable rate I found in florence. We got a climate controlled unit for less than a outside unit. I highly recommended midgard for great service on a great unit at a great price.", "pics": null, "resp": {"time": 1564858738950, "text": "Dear Most Valued Customer - The staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama sincerely thank you for providing the highest experience rating for customer service, cleanliness, security and 24 hour 7 day a week access for your possessions.  Thank you for commenting on the excellent effort Alex made to meet your self-storage needs and for your kind comments on the terrific pricing offered."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104895438771666612965", "name": "David Hinton", "time": 1561044996413, "rating": 5.0, "text": "Great experence.  Alex was the best.  Would recommend to any and everyone", "pics": null, "resp": {"time": 1561077836598, "text": "Dear valued customer - the staff of Midgard Self Storage in Florence, Alabama sincerely thank you for providing the highest rating in customer service, security, safety, 24x7 access for your possessions.  Thank you for truly providing the opportunity for us to meet your self-storag eneeds."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "114342497561461591944", "name": "Nicole Harden", "time": 1532989565757, "rating": 5.0, "text": "Leah was amazing and extremely helpful. This was my second time visiting this location and each time was smooth sailing. I highly recommend this location when in need of a U-Haul or Storage Unit.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107520095668869076479", "name": "Nadia Stewart", "time": 1595099460867, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": {"time": 1595181431465, "text": "Dear Nadia, the staff of Midgard Self Storage located at 4450 Chisholm Road in Florence, Alabama truly thank you for taking valuable time to award the highest 5 star experience rating for great customer service, site and equipment cleanliness, security and 24 hour 7 day a week access to not only your possessions but also UHAUL equipment.  Thank you so much for sharing your experience.  The staff of Midgard looks forward to continuing to meet your UHAUL and/or self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "102938680872617825443", "name": "Stacey Barrientez", "time": 1515298073365, "rating": 4.0, "text": "Management was very polite and professional. They gave me a great deal on a unit. I was very impressed.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "105380962376180852548", "name": "Anthony Hester", "time": 1564612633880, "rating": 5.0, "text": "Leah and Alex are PHENOMENAL to work with! Highly recommend!", "pics": null, "resp": {"time": 1564673141050, "text": "Dear Most Valuable Customer - The staff of Midgard Self Storage located at 4450 Chisholm Road in Florence Alabama sincerely thank you for providing the highest rating for your experience with customer service, cleanliness, security, 24 hour 7 day a  week access and especially your kind comments regarding Leah and Alex.  Thank you for giving us the opportunity to meet your self-storage needs and thank you for your recommendation.  We look forward to service your self-storage needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "117798482719228170547", "name": "Timothy Hollis", "time": 1572721476939, "rating": 5.0, "text": "Great friendly and helpful people.", "pics": null, "resp": {"time": 1572902374935, "text": "Dear Most Valued Customer, the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL, sincerely thank you for providing the highest 5 star experience rating for great, friendly and helpful customer service, cleanliness, security and 24 hour 7 day a week access for your possessions.  Your valuable time in telling others about your terrific experience and your kind words are greatly appreciated."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "112411880898818200874", "name": "Tiffany Sellers", "time": 1587854050036, "rating": 5.0, "text": "Friendly and very helpful staff", "pics": null, "resp": {"time": 1589642556164, "text": "Dear Tiffany, the staff of Midgard Self Storage located at 4450  Chisholm Rd in Florence, AL sincerely thank you for awarding the highest 5 star experience rating for friendly, helpful customer service, site cleanliness, security and 24 hour 7 day a week access to your possessions.  Thank you so much for taking valuable time to share your terrific experience with our staff and Midgard Self Storage site."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116033856744239222627", "name": "Fg Wireless", "time": 1576967766139, "rating": 5.0, "text": "Great customer service! Thank you!", "pics": null, "resp": {"time": 1577041615162, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Rd, Florence, AL, sincerely thank you for awarding the highest 5 star experience rating for great customer service, cleanliness, security and 24x7 access.  We look forward to continuing to meet your self-storage and/or UHAUL needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "110382517076967048044", "name": "James Skinner", "time": 1512380739251, "rating": 5.0, "text": "Very clean, the staff helped me on what size storage unit would be best for me. Great team! They gave me a great move in deal!", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "106592515323023427729", "name": "JJ Hibbard", "time": 1584813214375, "rating": 5.0, "text": "So far so good", "pics": null, "resp": {"time": 1589656139646, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage located at 4450 Chisholm Rd in Florence, AL sincerely thank you for awarding the highest 5 star experience rating for great customer care, security, site cleanliness and 24 hour 7 day a week access to your possessions.  Thank you so much for sharing your experience so far and we will continue to work to meet your needs as time goes by."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "113446473129321623517", "name": "Penny Holt", "time": 1586986169230, "rating": 5.0, "text": "Very nice and friendly", "pics": null, "resp": {"time": 1589650645551, "text": "Dear Penny,  the staff of Midgard Self Storage located at 4450 Chisholm Rd in Florence AL sincerely thank you for taking your valuable time to award the highest 5 star experience rating for very nice and friendly customer care, site cleanliness, security and 24x7 access to your possessions.  Thank you so much for sharing your great experience with the people and Midgard Self Storage facility and we look forward to continuing to meet your self-storage, packing supplies and UHAUL needs."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "102397747573179217575", "name": "LaTara Hogan", "time": 1548616976997, "rating": 5.0, "text": "The customer service is great! I would recommend them to everyone who needs storage or uhaul.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "107763563826807888380", "name": "Terry Cox", "time": 1558574969107, "rating": 5.0, "text": "Great place and great staff wourderful people. 👍", "pics": null, "resp": {"time": 1558262362794, "text": "Dear valued self-storage customer, the staff sincerely thanks you for your positive,m kind comments regarding our positive customer service effort toward meeting your needs over the past four years.   We will continue to strive to do so and greatly appreciate your comments."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "108746012475728873153", "name": "Tamiko Patterson", "time": 1539641242332, "rating": 5.0, "text": "Property area is very clean. It's secure. Staff is very nice and professional", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "109343200305848110372", "name": "Dena Wilson", "time": 1537644443623, "rating": 5.0, "text": "I can't say enough good about this place. Alex Lerman is the epitomy of customer service and an asset to your company! He helped in a stressful situation (the place I initally went to pick up my Uhaul reservation didn't have it and wasn't going to offer help).  He not only made this pickup easy, he made a drop off suggestion that saved me money. He was such a pleasant example of how you should treat people. I would highly recommend this place for any uhaul and storage needs! Thanks to Midguard and to Alex for saving the day for us! We will use you guys again for sure!", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "101623327718115926612", "name": "Kara Schneck", "time": 1526831705359, "rating": 4.0, "text": "The staff at the Chisholm Rd. location are fantastic.  They have gone above and beyond with helping mew with my storage needs.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "106852638849376173468", "name": "Matt Golden", "time": 1580494469284, "rating": 5.0, "text": "Great service !", "pics": null, "resp": {"time": 1580506568317, "text": "Dear Most Valued Guest, the staff of Midgard Self Storage sincerley thanks you for providing the highest 5 star experience rating for great customer service, site cleanliness and security and 24x7 access.  Sharing your experience is greatly appreciated and we thank you again for your comments."}, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "112455885322925853919", "name": "rex Rickard", "time": 1499542586870, "rating": 4.0, "text": "I feel that my belongings are safe and the staff is very friendly", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "104043499759727097166", "name": "Terry Cox", "time": 1546721026503, "rating": 5.0, "text": "Great manager and help", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "101155636800060550779", "name": "Patel Rohit", "time": 1515457774006, "rating": 3.0, "text": "Good place", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "117640843223810756486", "name": "Don Bencheated", "time": 1548501070350, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "116953712771805333800", "name": "Julie Venturi", "time": 1531178054826, "rating": 2.0, "text": "Rented a uhaul from there was told it would be 20 plus 14 for insurance got back told it would be 80 cause they charge mileage too and we had to fill it up also.", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
{"user_id": "117773902056939734075", "name": "terry cox", "time": 1510361249628, "rating": 1.0, "text": "Half star", "pics": null, "resp": null, "gmap_id": "0x887d37a35be8c003:0x3e3f802d786faa6"}
