{"user_id": "103565235111767708364", "name": "Amber Mellen", "time": 1618112551118, "rating": 1.0, "text": "WORST HOSPITAL EVER!! DO NOT GO HERE. I was visiting Atmore from Pensacola with severe kidney issues. I asked several times for pain medicine to subside my pain, and they wouldn't give it to me. Instead, they made me sit and cry in pain, and told me I needed to provide a urine sample to see if I qualify for pain meds. They were very rude and judgmental. They make you feel unwanted and like a drug addict when all you are waiting is something to ease your pain, and I would've even been okay with ibuprofen, but they wouldn't even give me that.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "102111374122645396878", "name": "Dalton", "time": 1604517377551, "rating": 5.0, "text": "Very kind, and respectful doctors. I went in here, and im still in here at the time of writing (in ICU) but so far I have 0 complaints about any of the doctors. They have all been very kind, and friendly, and beyond helpful in this hard time for me. Thank you so much to my local little hospital, keep it up!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "112649767747141768965", "name": "Valerie Vallejo", "time": 1624820194728, "rating": 1.0, "text": "10/10 would not recommend", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "107536980347795865487", "name": "Adrienne Winand", "time": 1600732423671, "rating": 1.0, "text": "Worst hospital I've ever been in. Went to the E.R. for a gastritis flare.  Gave me some liquid med that helped but left with no prescription and just a referral.  Waste of time and money.  4 hours later I'm back to feeling just as bad as when I went.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "101236877479627953251", "name": "Stephanie Still", "time": 1602867955494, "rating": 5.0, "text": "My son had a four wheeler accident on May 19th 2019 the doctors were very peaceful he said let them know thank you for all y’all did and they said most people are dead or paralyzed he is neither Praise God !!!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "112987068257396235684", "name": "Heather Weaver", "time": 1564248312061, "rating": 2.0, "text": "Oh gosh, is it a bad thing that I'm the first to rate this hospital? 😶 Thank goodness I use other hospitals other than this one. Most nurses are helpful, but some of those doctors need to trade salaries with the nurses. Not a very clean place either. Sanitation has always been a huge issue!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "100470670867275401867", "name": "Heather Ryals", "time": 1569768550804, "rating": 5.0, "text": "Super great doctor that was there on 9/29/2019 @1am.  Very well mannered and great bed side manner.  The nurse there was super nice and provided great services as well.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "116227998870424074047", "name": "Callie Smith", "time": 1554737046409, "rating": 1.0, "text": "Horrible experience every time. They make you feel worse than you already feel being in the ER. They have no care, the staff talk among each other  about other members of the staff instead of assisting patients. They plan their weekends talk about lost animals and put you last. They treat you like a total stranger instead of someone who is sick. I absolutely hate this place and if I would have been aware of where i was being taken to in my condition I would have suggested somewhere else immediately..", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "113314582423623406298", "name": "Wendy Burgess", "time": 1557982656506, "rating": 5.0, "text": "I was recently admitted to this hospital and I had nothing but an awesome experience all the way around. From the housekeeper's, dietary, lab techs, and cna's to the nurses and doctors. Even anesthesia during my unexpected surgery and the recovery nurses were wonderful. They were all very attentive to my needs and checked on me regularly and made me feel like they cared. The nurses would come in at the beginning of their shifts and introduce themselves and were there for me all through each shift, no matter what I needed. And the doctors were like clockwork rounding early.  I never had to wonder when the dr was going to come see me because they were there every morning to see me at the same time and let me know what was going on with my care, test results, etc. I couldn't have chosen a better hospital to have to be in for 4 full days. I can not thank the staff enough for the quality of care they provided. I would definitely recommend anyone to go there.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "109100561332099071475", "name": "Korrell Penn", "time": 1529957817677, "rating": 5.0, "text": "The entire staff in the ER took great care of me.... Best county hospital I've ever been to", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "103500314376642813728", "name": "Karen Thomas", "time": 1537292726570, "rating": 5.0, "text": "Really good place everyone was so nice and all of them know what the were doing very clean and helpful.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "115667400354677789515", "name": "Terri Watkins", "time": 1481934121112, "rating": 5.0, "text": "I have been Hospitalized here twice in the last couple of months and have had 2 visits to the ER, each experience was great, from the Drs. on call Dr. Macbeth and Dr. Jon Yoder, both went above and beyond trying to get to the bottom of my problem and they did! The whole ER staff was very caring and concerned and I have no complaints at all! The entire Hospital staff was very accommodating and showed true concern from the Lab employees to the ICU staff! If applicable I would give a bigger rating......awesome service!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "101252104237900806144", "name": "C D", "time": 1537927822880, "rating": 1.0, "text": "Worst hospital experience ever!\nLike another person wrote, you walk in with an ailment, but will be treated for something completely different.\nIn my case I was seriously bruised up from an accident. Dr. Elizabeth Bataglia came back a couple of minutes after a urine sample was taken and told me that I didn't have any injuries from the accident but that they would treat me for an STD instead, right in front of my fiancé!\n\nWe went to a different health care provider a few days later, who also took urine samples from the both of us.\nThey said they would send it off to a lab to get a correct result.\nIt came back negative!\n\nWe have been together for years, so how could I have an STD according to Dr. Bataglia but not according to the lab?!?!\nObviously someone (the staff, nurses or doctor) made a serious mistake in giving me an incorrect diagnosis, and simply being diagnosed with an STD is an embarrassment in itself!\n\nThis hospital and their personnel should be ashamed of themselves for not taking patients nor their health seriously!\n\nThat was the last time we went to this hospital. Ever!\nThey don't have to worry about us coming back.\nWe will be going to a different health care provider from now on!\n\nUnless you want an incorrect diagnosis, Stay Away from Atmore Community Hospital!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "113783262478969999140", "name": "PoBoyFlowCHE", "time": 1484601760443, "rating": 1.0, "text": "Took my fiancee to the ER a few days after being released from a better hospital due to kidney failure from a severe infection. The staff is rude, unprofessional, and they do not seem to care if they help you it all. Seems like they just want to get you out instead of taking time to actually investigate and treat your ailment. I walked outside to make a phone call to my fiancee's family to inform them that she was sick again, and when I came back in the lady at the front desk rolled her eyes and very rudely stated I was not allowed to see her per hospital rules. So if you have a loved one dying don't expect to be able to say goodbye in the emergency room at this hospital.\n\nAll in all a very negative experience and she didn't receive any treatment at all. In my opinion you are better off taking your loved one or yourself down to Mobile or Pensacola if you have an emergency and the time to get there.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "107520691850368556167", "name": "Colleen Papajohn", "time": 1497849869519, "rating": 1.0, "text": "TERRIBLE PLACE I WOULDN'T EVEN TAKE MY DOG THERE U WALK IN WITH ONE PROBLEM AND WALK OUT WITH A DIAGNOSIS OF SOMETHING THAT HAS NOTHING TO DO WITH YOUR PROBLEM, MOST OF THE NURSES AND DR.S ARE RUDE AND DUMB AS HELL THEY HAVE NO BEDSIDE MANNERS THEY DONT LISTEN WHEN U TRY AND EXPLAIN WHATS WRONG AMD WHAT YOUR PAIN IS THEY JUST DONT CARE! IT IS LITERALLY A BANDAID HOSPITAL THAT'LL PUT IT ON THE WRONG WOUND!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "104798025482186424286", "name": "jonathan cofield", "time": 1462212093059, "rating": 1.0, "text": "Wish I could give it a lower rating than 1 star. WORST hospital ever! took my mom in, the nurses were rude. One nurse even made the statement,\" you are wearing me out tonight..\" All because my mom had seizure and she didnt even think nothing of it. Doctor did not help her. She was extremely weak. Did not run sufficient tests. She couldnt even walk when we took her in. This is a 75 yr old woman we are talking about. And they didnt even try to see if she could walk. It was like they didnt believe us. NEVER NEVER AGAIN!! Took her to Sacred Heart. WAY better hospital!!!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "102934478236746502378", "name": "Debbie Rutherford", "time": 1512671230310, "rating": 4.0, "text": "I want to ask a question. So many are bad mouthing ACH, then why do you  keep going back?Bet you did not get you know that pain medicine that starts with a d.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "109785195777128424322", "name": "Tracy Smith", "time": 1490674657696, "rating": 1.0, "text": "This is the third time I have been to ER at this hospital.  Everytime has been a minimum of a 3 hour wait just to be triaged. This is the worst hospital that I have ever been to. Need more doctors on duty or at least on call when things get this backed up.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "111366702297748293359", "name": "Darneshia Moore", "time": 1508367642109, "rating": 1.0, "text": "Horrible Service! I've been here since 2:30 no one has seen me! My blood pressure is 207/116. People that came in behind me have been seen. DONOT come to this hospital!", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "110541148867714779518", "name": "mashanda green", "time": 1515796665701, "rating": 5.0, "text": "I was put on a swing  bed program and it was aweful.", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "100046601652779986466", "name": "erin cole", "time": 1550429563552, "rating": 1.0, "text": "Dirty .....", "pics": null, "resp": null, "gmap_id": "0x88907998ee07cf8d:0x9f926255c051bdfe"}
{"user_id": "104705409160209525966", "name": "Belinda Powell", "time": 1625184121304, "rating": 5.0, "text": "They are absolutely delightful , all the lady’s and Gentle men are respectful and considerate and completely compassionate about the patient . I love the support  ,care and respect  that I receive every time my appointment  comes around some places need to take note from them on how to treat patients , My Doctors and the nurses are respectful to everyone not treating ppl like they on a lower level than them . The language is child friendly , and respectful I love love love them for this . Not judging or belittling.. not like some unprofessional places in  the  Birmingham west  side jealous and hateful God blessed them . I have to love even my enemy’s ..", "pics": null, "resp": {"time": 1572746215630, "text": "Hello Belinda,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116131471534004476185", "name": "Virgobeauty", "time": 1627489510127, "rating": 1.0, "text": "Dr. Ashford delivered all three of my children and I’ve been going to him for years. Since 2009. However, the last few times I’ve been have not been the same. Extra staff has been added.  The front desk still the same , but the nurses, cnas that call you in the back are not friendly ,  vibe and attitude not right for a doctor’s office.   Today , like the last two times ; I waited an hour and a half to go in the back. The CNA that called me back..... eyes rolling like she had a problem and didn’t want to be there.   The back is too crowded, and unprofessional. Nurses everywhere but still slow. Really don’t feel like a doctors office at all. Not going back , changing my doctor. I rather go to the health department.", "pics": null, "resp": {"time": 1627494363567, "text": "Thank you for providing your feedback and letting us know about this issue, Virgobeauty. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110592661797571807111", "name": "Randy Calle", "time": 1619570290008, "rating": 5.0, "text": "To have been injected with the conjecture of the Lord's grace manifested in the form of a Covid-19 vaccine was an absolute blessing to say the least. It isn't the end of this journey for us all together and for this personal being given it is a 2 part cure to the disruptive plague which has been with us for far too long. The time has come to pass for us to unite and invite the infinite wisdom and knowledge which we have been eternally grateful for.", "pics": null, "resp": {"time": 1619574543372, "text": "Thank you so much for your kind words, Randy. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105014558835486466474", "name": "June Pridmore", "time": 1616716581641, "rating": 5.0, "text": "I had my second vaccine yesterday at the Bessemer Civic Center. Both times the people were extremely friendly, fast and organized. I could not imagine how any type of mass vaccinations could possibly be that organized! I was pleasantly surprised each time! GREAT JOB!!!!!! I’ve told everyone I know about the experience! You guys ROCK!", "pics": null, "resp": {"time": 1616720583735, "text": "Thank you so much for your kind words, June. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114166797675341015559", "name": "QUEEN Martin", "time": 1616544923841, "rating": 5.0, "text": "The people were professional and courteous. They were efficient at getting each person checked in, vaccinated, and out again. And I must commend  the ladies administering the shots. You barely knew that you were getting a shot! The nurses were just that good!\n\nThank you, Cahaba Medical Care, for a job well done!!!!!", "pics": null, "resp": {"time": 1616549162762, "text": "Thank you so much for your kind words, Queen. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "107627825886098559902", "name": "Meshia", "time": 1626227254603, "rating": 1.0, "text": "If I could have done this review without giving any stars, I would have. But, this star is for LaTory Franks. She really deserves all 5, but this review is not about her. Dr. Ashford has been my gynecologist for more than 10 years, so needless to say, I trusted him. He performed a surgery on me that in turned almost took my life, because he continued to diagnose me inaccurately from the pain I was having after the surgery. I ended up with sepsis, diverticulitis, and an ostomy bag. I have never had any marks on my body, not even my stomach, but after Dr. Ashford's surgery, my stomach looks like a train track with connect the dots around it. This sent me into a depressed state. I have to see this every day when I look at myself.\nAfter which he had no remorse or concern for. He was always nice until he did something wrong. He acts as if he is some type of god with people lives in his hand. But, everyone has to answer to THE MOST HIGH GOD!! I would definitely not refer my worst enemy, let along family, friends, or associates to him or cahaba medical. Even after I did my grievance report concerning this issue, and was notified that his attorneys told him to contact me, to this day, nothing has been done, and, no one from cahaba medical has contacted me since, because they don't care either.", "pics": null, "resp": {"time": 1626231558057, "text": "Thank you for providing your feedback and letting us know about this issue, Meshia. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106505709520390958454", "name": "Marilynn Sharpe", "time": 1624065479271, "rating": 5.0, "text": "AWESOME EXPERIENCE WITH MY NEW DOCTOR,  DR.L FRANKZ SHE'Z VERY THOROUGH ND COULD ASK FOR A BETTER PHYSICIAN , THANK U CAHABA MEDICAL CARE", "pics": null, "resp": {"time": 1624069742478, "text": "Thank you so much for your kind words, Marilynn. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104773847877512050068", "name": "Brian Broadnax", "time": 1615638049311, "rating": 5.0, "text": "My experience was amazing. The staff was friendly, fast, and efficient. I had an appointment and they were right on time. I was in and out in no time. Keep up the good work you guys!", "pics": null, "resp": {"time": 1615642324003, "text": "Thank you so much for your kind words, Brian. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116454047909972093166", "name": "Olivia C Washington", "time": 1616543610667, "rating": 5.0, "text": "Everyone and everything went perfectly smooth for us‼️ The staff was very friendly and professional, on both visits, showing tender care❣️We were blessed with our experience!", "pics": null, "resp": {"time": 1616547843408, "text": "Thank you so much for your kind words, Olivia C. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100014635517612719757", "name": "Jo Ann W", "time": 1616025381025, "rating": 5.0, "text": "everyone was very organized and carried themselves in a professional manner with a smile on their face from the time. I arrived until a left what a great day I had meeting people like them", "pics": null, "resp": {"time": 1616029084547, "text": "Thank you so much for your kind words, Jo Ann. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "107465228932074422760", "name": "Cori Goodwin", "time": 1619111296549, "rating": 5.0, "text": "Well clean and nice people. Great place to go if you have no health insurance.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111231201405363696895", "name": "Gary Bice", "time": 1614991923851, "rating": 5.0, "text": "This was a visit for the covid vaccine and was a very pleasant experience. Greeted by a professional person who began explaining this process signed in and went to the table received the vaccine waited the 15min and left. Appointment was on time in and out, easy.", "pics": null, "resp": {"time": 1614996184208, "text": "Thank you so much for your kind words, Gary. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112545171972120548157", "name": "Josiah Gleason", "time": 1619617694584, "rating": 5.0, "text": "Quick and easy vaccination process. Willing to work with me to schedule both vaccinations", "pics": null, "resp": {"time": 1619621943272, "text": "Thank you so much for your kind words, Josiah. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104934741437071147091", "name": "Glenda Megginson", "time": 1615340982015, "rating": 5.0, "text": "Cahaba medical group were very profession\nand carried out the entire vaccination\nexperience at the Cooprer Green Community\nCenter with excellence. A very organized operation.\nThanks", "pics": null, "resp": {"time": 1615345208251, "text": "Thank you so much for your kind words, Glenda. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115663129174902723179", "name": "Jan Weisberg", "time": 1614182329098, "rating": 5.0, "text": "Cahaba Medical has been working with BSC during the pandemic providing testing services for faculty, staff, and students.  They have been very efficient and made the process very easy for us.   The vaccination process was outstanding as well.", "pics": null, "resp": {"time": 1614183426486, "text": "Thank you so much for your kind words, Jan. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110898915658275185402", "name": "Alease Sims", "time": 1616558083885, "rating": 5.0, "text": "Service was efficient. Workers and volunteers were polite. Greater Shiloh Baptist Church was a central community location.", "pics": null, "resp": {"time": 1616562424676, "text": "Thank you so much for your kind words, Alease. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106175091723077185489", "name": "Harold D", "time": 1616430075465, "rating": 5.0, "text": "The Cahaba Medical COVID vaccination team is a well planned,  and detail oriented group.  I received my second vaccination recently.  There was no long waiting periods at all.  They verified my eligibility,  identity, and then administered the vaccine.   I stayed in the waiting area for 20 minutes, and then returned to work.   I have shared the Cahaba Medical Care website with everyone who has asked me about a local COVID vaccination opportunity.", "pics": null, "resp": {"time": 1616434333910, "text": "Thank you so much for your kind words, Harold. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100354091638332300692", "name": "L H", "time": 1615074723476, "rating": 5.0, "text": "My Experience with Cahaba Medical Care has been a very great experience.  The staff was very professional and personal.  That means a lot today in times that we are living in.", "pics": null, "resp": {"time": 1615078982447, "text": "Thank you so much for your kind words, L. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100553114415829373627", "name": "Epathia Lockett", "time": 1616610432512, "rating": 5.0, "text": "I feel  Cahaba medical  care foundation, have done,great job  with team  up with  Greater Shiloh Missionary  Baptist  church,  thank  you pastor, for what, you done for  our,family  know  I can come  back to church  think, you Jesus.", "pics": null, "resp": {"time": 1616614684416, "text": "Thank you so much for your kind words, Epathia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112913230242696964535", "name": "Demetrice Smith", "time": 1622764113979, "rating": 4.0, "text": "It was good  I didn't  experience,  any bad side effects. But I gotta cee what last shot do", "pics": null, "resp": {"time": 1622770324864, "text": "Thank you for providing your feedback and letting us know about this issue, Demetrice. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115386001423095701672", "name": "Mary Williams", "time": 1616716884210, "rating": 5.0, "text": "Service was great.  The nurses were friendly and professional.  I apprecate the work that the nurses do. Thank you so much for the vaccine.", "pics": null, "resp": {"time": 1616721123610, "text": "Thank you so much for your kind words, Mary. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113673504093483805606", "name": "Debra Stevens", "time": 1616200800290, "rating": 5.0, "text": "This was for my covid vaccine. The process was quick and easy. The medical staff was very friendly. Thanks so much", "pics": null, "resp": {"time": 1616218073770, "text": "Thank you so much for your kind words, Debra. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116296082255838347237", "name": "Lydia Turnipseed", "time": 1619653876225, "rating": 5.0, "text": "Courteous and efficient staff. Pleased with overall experience. Thank you.", "pics": null, "resp": {"time": 1619658183996, "text": "Thank you so much for your kind words, Lydia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "118338885865243606016", "name": "Sandra Harris", "time": 1617147813907, "rating": 5.0, "text": "We received our COVID vaccine with Cahaba Medical.  Employees couldn’t have been any nicer or helpful. Very grateful to have found them as our vaccine provider.", "pics": null, "resp": {"time": 1617152103409, "text": "Thank you so much for your kind words, Sandra. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100939790121557372580", "name": "Audrey Vaughn", "time": 1614475427875, "rating": 5.0, "text": "Everything ran smoothly and professionally.  The staff was organized and methodical in delivering the vaccine.  Thank you for working in partnership to bring this to our community.", "pics": null, "resp": {"time": 1614479703431, "text": "Thank you so much for your kind words, Audrey. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "108745154023593314342", "name": "Carmanita Monroe", "time": 1615212897474, "rating": 5.0, "text": "The COVID-19 vaccination event at our school was well organized and done safely. The staff was professional and friendly. I would recommend Cahaba Medical Care.", "pics": null, "resp": {"time": 1615217164401, "text": "Thank you so much for your kind words, Carmanita. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "108797649337013205711", "name": "RaNetta Underwood", "time": 1616898487508, "rating": 5.0, "text": "Very friendly and professional staff. I received both of my covid vaccines at the Bessemer City High School and both times I had a good experience. Thank you for being of service to the community!", "pics": null, "resp": {"time": 1616896563825, "text": "Thank you so much for your kind words, Ranetta. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109573103716178062097", "name": "Quana C", "time": 1616544035193, "rating": 4.0, "text": "This clinic distributed Covid vaccines, & with the exceptions of issues with scheduling that weren’t clearly communicated they did a great job. The staff was nice and accommodating, and they got you in and out.", "pics": null, "resp": {"time": 1616548263716, "text": "Thank you for providing your feedback and letting us know about this issue, Quana. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105285396610755529211", "name": "Alyssa Rushton", "time": 1617115948279, "rating": 5.0, "text": "Cahaba Medical came to BCHS to administer our vaccinations. My first experience with their staff was amazing. The nurse was extremely polite and answered all of my questions. The second nurse seemed to be a bit dismissive of my questions and would not give me eye contact. I am sure after vaccinating so many employees in one day it became routine to her. However, I would like to express my gratitude to the staff that took the time to show care and concern. I know it is not an easy task, and I had no side effects with the 1st round and very little to none with the 2nd round. I appreciate their staff for being so accommodating to the needs of our school system.  I have lost 2 people that are very dear to me since March of 2020 due to COVID-19. One was a 75 year old mother and grandmother, and another dear friend younger than myself. I appreciate the opportunity to be vaccinated during this scary time.", "pics": null, "resp": {"time": 1617120244163, "text": "Thank you so much for your kind words, Alyssa. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117488643854900877103", "name": "Cecile Baker", "time": 1614306083379, "rating": 5.0, "text": "Received my first COVID vaccine here.  So very organized!  Everyone did such a wonderful job.  Thank you!!", "pics": null, "resp": {"time": 1614310322547, "text": "Thank you so much for your kind words, Cecile. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "102653617697921375021", "name": "tondry wright", "time": 1616724809276, "rating": 5.0, "text": "I went to the Bessemer Civic Center the staff was professional and helpful thank You for the nurses and staff that you placed in my neighborhood", "pics": null, "resp": {"time": 1616729043291, "text": "Thank you so much for your kind words, Tondry. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106783799657351236602", "name": "Marsha Butler", "time": 1615074863996, "rating": 5.0, "text": "Very organized and professional. Received my first Covid shot with comfort knowing I was in good hands.", "pics": null, "resp": {"time": 1615078982600, "text": "Thank you so much for your kind words, Marsha. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106953817200340644481", "name": "Barbara Carter", "time": 1614383907000, "rating": 4.0, "text": "My experience was great. Did have symptoms the night of receiving the vaccine. They have resolved today.\nThanks", "pics": null, "resp": {"time": 1614388203403, "text": "Hello Barbara,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "108612109124928626879", "name": "Charles Morris", "time": 1616231507560, "rating": 5.0, "text": "Went smoothly.   Thank you.\n\nThe second dose was even faster.  Thanks!", "pics": null, "resp": {"time": 1614439022308, "text": "Thank you so much for your kind words, Charles. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115674391934972069547", "name": "Latrice Jackson", "time": 1614366143235, "rating": 5.0, "text": "The vaccination process on Feb 24, 2021 was well organized. We received prompt service and the staff were courteous and professional during the entire process.", "pics": null, "resp": {"time": 1614370391662, "text": "Thank you so much for your kind words, Latrice. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "102166296912694484681", "name": "Tonya Thompson-Wilson", "time": 1614329418891, "rating": 5.0, "text": "Quick service. Great customer service  in and out with no problem. Staff awesome 😘", "pics": null, "resp": {"time": 1614333664225, "text": "Thank you so much for your kind words, Tonya. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110602513979908736643", "name": "Patricia Bentley", "time": 1616947776473, "rating": 5.0, "text": "I got my first vaccine and l was nervous but I was made to feel special by the kind words and the friendliness they shown.", "pics": null, "resp": {"time": 1616952003332, "text": "Thank you so much for your kind words, Patricia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115723762799613947232", "name": "Kim Rodgers", "time": 1616554375121, "rating": 5.0, "text": "The staff was friendly and professional. They were courteous. Everything was done as expected. Any questions I had were answered.", "pics": null, "resp": {"time": 1616558642620, "text": "Thank you so much for your kind words, Kim. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "103512493023050468718", "name": "Karen Keller", "time": 1619225870795, "rating": 5.0, "text": "We went for our first covid shot. Wasn’t sure what to expect but the staff that was running this facility was awesome. They took time to answer our questions and concerns. We were in and out in less than 30 minutes. Will definitely recommend this group to anyone needing covid shots or any other medical treatment.", "pics": null, "resp": {"time": 1619230143748, "text": "Thank you so much for your kind words, Karen. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105522545533639860412", "name": "Jenny P3084", "time": 1612320996208, "rating": 5.0, "text": "This is the best place for care. The wait time to see the Dr. Is quick. The staff and Dr. Smith is so kind.", "pics": null, "resp": {"time": 1612325209320, "text": "Thank you so much for your kind words, Jenny. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112814083113294794190", "name": "Jerri Haslem", "time": 1614297330480, "rating": 5.0, "text": "Great Service! Courteous, organized, and prepared.. Which makes for a professional pleasant experience.", "pics": null, "resp": {"time": 1614301562879, "text": "Thank you so much for your kind words, Jerri. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101941668055572392238", "name": "Monique Bibbs", "time": 1616721279742, "rating": 4.0, "text": "Cahaba service was good. Only reason they aren't receiving a 5 star rating is because the check-in emails for the 2nd dose of the vaccine stated two different places other than the original location and failed to notify patients of their error causing people to drive locations where they were not giving the vaccine", "pics": null, "resp": {"time": 1616725504853, "text": "Thank you for providing your feedback and letting us know about this issue, Monique. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111276886091948734466", "name": "Candra Bethune", "time": 1618049618001, "rating": 5.0, "text": "I highly recommend Cahaba Medical! They were efficient, professional, and friendly.", "pics": null, "resp": {"time": 1618053845416, "text": "Thank you so much for your kind words, Candra. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114276205541795783316", "name": "Shandi Woodard", "time": 1614729168285, "rating": 5.0, "text": "The staff was friendly, professional and everything moved very quickly and efficiently! From my car to the observance area, I was done in 15 minutes. I would recommend them to anyone for a COVID vaccine source.", "pics": null, "resp": {"time": 1614733443718, "text": "Thank you so much for your kind words, Shandi. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104197484308296771995", "name": "Valerie Sherrod", "time": 1616546267635, "rating": 5.0, "text": "The staff was very kind and nice. The vaccine process was well organized.", "pics": null, "resp": {"time": 1616550423814, "text": "Thank you so much for your kind words, Valerie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111078317262581993121", "name": "Brenda Austin", "time": 1618613578715, "rating": 5.0, "text": "It was very experienced... The service was great.", "pics": null, "resp": {"time": 1618617843137, "text": "Thank you so much for your kind words, Brenda. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113965123937834125888", "name": "Mohammad Syed", "time": 1616243113086, "rating": 5.0, "text": "All staff members of Cahaba Medical Care were highly trained and professional. I received the best service", "pics": null, "resp": {"time": 1614395223383, "text": "Thank you so much for your kind words, Mohammad. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116775051430463288683", "name": "Sandra Roach", "time": 1616682187753, "rating": 5.0, "text": "I had a great experience ,very professional,staff.Thank you to the staff, and well done$!", "pics": null, "resp": {"time": 1616687103216, "text": "Thank you so much for your kind words, Sandra. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115988427748701515249", "name": "Nash Mresh", "time": 1613782578411, "rating": 5.0, "text": "Friendly and helpfull staff & doctors. God bless you for the good care you provided me and many others i believe🙏", "pics": null, "resp": {"time": 1613786522112, "text": "Thank you so much for your kind words, Nash. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112488092239067348760", "name": "Kimberly Sales", "time": 1614729294437, "rating": 5.0, "text": "My experience was very good from beginning to end. Very professional and organized.", "pics": null, "resp": {"time": 1614733444308, "text": "Thank you so much for your kind words, Kimberly. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112664912113474566026", "name": "Pam Henderson", "time": 1614297616099, "rating": 5.0, "text": "Well organized and efficient. Made me feel comfortable through the whole process.", "pics": null, "resp": {"time": 1614301862368, "text": "Thank you so much for your kind words, Pam. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117289441880694683462", "name": "Mattie Hawkins", "time": 1614300172668, "rating": 5.0, "text": "The workers treated us with utmost respect and was very helpful.Overall everything went smoothly and in a timely manner.", "pics": null, "resp": {"time": 1614304442409, "text": "Thank you so much for your kind words, Mattie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100545535031972900480", "name": "Eloyd Gooden", "time": 1614477220401, "rating": 4.0, "text": "I had a pleasant experience with the technicians and medical professionals of Cahaba Medical Care during my COVID vaccine.The entire process was professional and quick.", "pics": null, "resp": {"time": 1614481443535, "text": "Thank you so much for your kind words, Eloyd. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101553336300106575153", "name": "jimfgo", "time": 1614405592818, "rating": 5.0, "text": "My first COVID shot went very fast. Everyone was so professional and helpful.", "pics": null, "resp": {"time": 1614409863802, "text": "Thank you so much for your kind words, Jimfgo. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112473875488212770453", "name": "Roosevelt Heath", "time": 1613692090345, "rating": 5.0, "text": "Friendly staff and speedy service not a long waiting time before going to the back for your check up", "pics": null, "resp": {"time": 1613696308660, "text": "Thank you so much for your kind words, Roosevelt. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111883225225993697435", "name": "Sandra Mitchell", "time": 1617739547217, "rating": 4.0, "text": "Received vaccine for covid19 at site in bessemer. Entire process was seamlesss- from registration to time at site. Staff was friendly and v ery professional!\nMade this experience comfortable.", "pics": null, "resp": {"time": 1615083722038, "text": "Thank you so much for your kind words, Sandra. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115903742288522033811", "name": "Tim Wormley", "time": 1615345230964, "rating": 4.0, "text": "Went for COVID-19 vaccine.....Moved fast.. Everyone was nice!!!! Shot was painless", "pics": null, "resp": {"time": 1615349405851, "text": "Thank you so much for your kind words, Tim. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "103872407676109298799", "name": "Georgia Brown", "time": 1615954447046, "rating": 5.0, "text": "I would rate this a five ( the highest) because everyone was nice, organized.\nThank you for your kind services during this time of fear for me.", "pics": null, "resp": {"time": 1615958704279, "text": "Thank you so much for your kind words, Georgia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109331489887978707929", "name": "Cecelia Hubbard", "time": 1614383662498, "rating": 5.0, "text": "The staff was very polite and made me feel comfortable while getting my shot.", "pics": null, "resp": {"time": 1614387903820, "text": "Thank you so much for your kind words, Cecelia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104225462769560747713", "name": "Brandon Garrett", "time": 1616025565291, "rating": 5.0, "text": "I went to receive my 1st vaccine and was pleasantly surprised by the quick service.", "pics": null, "resp": {"time": 1616029803539, "text": "Thank you so much for your kind words, Brandon. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101929560565919633398", "name": "James Knighton", "time": 1614469232389, "rating": 4.0, "text": "My experience with Cahaba Medical Care - Ensley was very good. The staff was very professional , friendly and knowledgeable of the Pfizer- BioNTech COVID- 19 Vaccine. Looking forward to my 2nd shot in March.", "pics": null, "resp": {"time": 1614473464176, "text": "Thank you so much for your kind words, James. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112009275783189595322", "name": "Elizabeth Gregory", "time": 1614908952403, "rating": 5.0, "text": "Well organized vaccinations. All staff were very nice", "pics": null, "resp": {"time": 1614913203335, "text": "Thank you so much for your kind words, Elizabeth. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105466751072018329795", "name": "Carla Brown", "time": 1614383375540, "rating": 5.0, "text": "Process was easy, staff friendly but professional.  Provided information as needed.", "pics": null, "resp": {"time": 1614387604450, "text": "Thank you so much for your kind words, Carla. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111982287463929761691", "name": "Dea Walls", "time": 1614820003493, "rating": 4.0, "text": "Once I got to the correct place, I was fine.  It was a little confusion there because it was so busy but nothing major.", "pics": null, "resp": {"time": 1614824282201, "text": "Thank you so much for your kind words, Dea. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101527627452567015494", "name": "carrie harrington", "time": 1614816089179, "rating": 5.0, "text": "I recieved my vaccine 03/2/21 the event was  well organized and process went  rapidly. Thanks .", "pics": null, "resp": {"time": 1614819722453, "text": "Thank you for taking the time to rate our services!\n\nCheers!\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117348817334498042039", "name": "Chris Terrell", "time": 1614210668789, "rating": 5.0, "text": "Very nice and friendly staff especially the young lady who gave me the vaccine.", "pics": null, "resp": {"time": 1614214923178, "text": "Thank you so much for your kind words, Chris. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "102707608842200157849", "name": "Sylvia McCain-Edwards", "time": 1614813321222, "rating": 5.0, "text": "The staff was very nice and helpful and quick. Thank you for the service.", "pics": null, "resp": {"time": 1614817383909, "text": "Thank you so much for your kind words, Sylvia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113587548761220288699", "name": "Larry Cockrell", "time": 1614297972377, "rating": 5.0, "text": "The process was seamless. The staff was very helpful and professional.", "pics": null, "resp": {"time": 1614302043829, "text": "Thank you so much for your kind words, Larry. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "103054443828824206260", "name": "Glenda M", "time": 1616761883617, "rating": 5.0, "text": "Very professional. Excellent, clean, spacious and fast service! The staff was so very kind!!!", "pics": null, "resp": {"time": 1616766122936, "text": "Thank you so much for your kind words, Glenda. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116054968630308897081", "name": "Cynthia Ward", "time": 1615122403954, "rating": 5.0, "text": "My Covid-19 vaccination experience went well. The staff was pleasant and efficient, even when the crowd was large.", "pics": null, "resp": {"time": 1615126683839, "text": "Thank you so much for your kind words, Cynthia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105647777927424877643", "name": "Jennifer Jackson", "time": 1597968582218, "rating": 5.0, "text": "My Experience at Cahaba Medical Care was AWESOME! Great Doctor and Nurses. Concerns of My Care made me feel they cared about what was going on with me. Wasn't a rush and go like most Doctor's offices. Just want to say Thanks and will most definitely recommend to my friends.", "pics": null, "resp": {"time": 1598049912761, "text": "Thank you so much for your kind words, Jennifer. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110466325763286330977", "name": "kim sadler", "time": 1610592440581, "rating": 5.0, "text": "The staff was very friendly it was clean and I didnt have to wait very long at all..over all a great experience...", "pics": null, "resp": {"time": 1610596665960, "text": "Thank you so much for your kind words, Kim. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114721884039379093330", "name": "Lisa Rivers", "time": 1616952377448, "rating": 5.0, "text": "Very Fast Service, Very Professional, Very Nice People!\nVery Organized!", "pics": null, "resp": {"time": 1616956503054, "text": "Thank you so much for your kind words, Lisa. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "102144598388387684374", "name": "George McConico", "time": 1615374371897, "rating": 5.0, "text": "Everything was organize and  went really smoothly, and the staff was really nice people.", "pics": null, "resp": {"time": 1615379165328, "text": "Thank you so much for your kind words, George. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115569681102483893855", "name": "Black Beauty", "time": 1620864628124, "rating": 5.0, "text": "My visit was quick and the staff was professional.", "pics": null, "resp": {"time": 1620868863054, "text": "Thank you so much for your kind words, Black. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106266152727856977028", "name": "Betty Woods", "time": 1616965548502, "rating": 5.0, "text": "I had my Covid-19 shots at the Bessemer Civic Center.  The staff was very professional and friendly. Thanks to all of you from the signing in to getting the shots.", "pics": null, "resp": {"time": 1616969824568, "text": "Thank you so much for your kind words, Betty. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101358511260727859608", "name": "Georgia waugh", "time": 1619665870953, "rating": 5.0, "text": "Had my second one yesterday nice", "pics": null, "resp": {"time": 1619658423840, "text": "Thank you for taking the time to rate our services!\n\nCheers!\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116648217689282764091", "name": "Vanessa Cartet", "time": 1614791683870, "rating": 5.0, "text": "Thanks so much! Everything went so well and so organized!!! Feeling Blessed!!!", "pics": null, "resp": {"time": 1614880442723, "text": "Thank you so much for your kind words, Vanessa. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109860763988223568176", "name": "Willa Mcneal", "time": 1616725794885, "rating": 5.0, "text": "Caring professionals who are very good at what they do.", "pics": null, "resp": {"time": 1616111403473, "text": "Thank you for taking the time to rate our services!\n\nCheers!\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100315496835175158910", "name": "Alfedo Acoff", "time": 1616629758069, "rating": 5.0, "text": "They were very professional and it was quick and easy.", "pics": null, "resp": {"time": 1616634004554, "text": "Thank you so much for your kind words, Alfedo. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110508449351500509290", "name": "Buddy Parker", "time": 1616202050112, "rating": 5.0, "text": "They were the nicest, sweetest people ever - thank you -", "pics": null, "resp": {"time": 1616217985484, "text": "Thank you so much for your kind words, Buddy. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109167885146081230412", "name": "roy henderson", "time": 1614614922671, "rating": 5.0, "text": "Got a covid 19 shot and all is well waiting for second shot, will see!", "pics": null, "resp": {"time": 1615314774141, "text": "Thank you so much for your kind words, Roy. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117232074670862429484", "name": "Theresa Hatcher", "time": 1615085898819, "rating": 5.0, "text": "Awesome,professional and quickly done,staff was ready and prepared and in order", "pics": null, "resp": {"time": 1615090142617, "text": "Thank you so much for your kind words, Theresa. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105494903008590192400", "name": "latasha jackson", "time": 1606649923965, "rating": 5.0, "text": "They handle my needs with care and we're very nice I recommend cahaba medical", "pics": null, "resp": {"time": 1606654147172, "text": "Thank you so much for your kind words, Latasha. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "103139562784782223842", "name": "Brenda Jackson", "time": 1615074883226, "rating": 4.0, "text": "My experience was great I had no problem a,little soreness where the shot was giving .", "pics": null, "resp": {"time": 1615079102566, "text": "Hello Brenda,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101794392491195687019", "name": "Mario Jones", "time": 1615608748141, "rating": 5.0, "text": "Speedy service, friendly staff, awesome  Experience!!", "pics": null, "resp": {"time": 1615612983676, "text": "Thank you so much for your kind words, Mario. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "107012347088605571744", "name": "Stanley Fleming", "time": 1607043652403, "rating": 4.0, "text": "Staff  at cabana are great, you're in and out, just one problem for me, why do I have to do labs every 3 months, because I hate being stuck", "pics": null, "resp": {"time": 1607066225092, "text": "Thank you for providing your feedback and letting us know about this issue, Stanley. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100651963946672968513", "name": "Dee M", "time": 1597890034947, "rating": 5.0, "text": "All the staff that works there were very polite and helpful even the doctors and since I been going there it only takes maybe 5 mins to see a doctor & they do get you in and out", "pics": null, "resp": {"time": 1594448598563, "text": "Thank you for taking the time to rate our services!\n\nCheers!\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "108863249425145378230", "name": "DeeDee Anderson", "time": 1577231092845, "rating": 5.0, "text": "First time going yesterday (Dec 23, 2019) and it was an amazing experience! Everyone was so nice from the receptionist to the nurses, doctors, and lab personnel. The process was quick and easy and it wasn't a long wait time to be seen. I definitely recommend!!", "pics": null, "resp": {"time": 1577259908307, "text": "Hello Deedee,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110098500104950262981", "name": "Lillie Butler", "time": 1596153929220, "rating": 5.0, "text": "My experience was very nice .\nThe staff worker was very nice and professional.they went out of their way to help you ln every way they can.it will be worth my time to come again if needed.", "pics": null, "resp": {"time": 1596230141760, "text": "Thank you so much for your kind words, Lillie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105567579681972719757", "name": "Magaly Torres de Cardenas", "time": 1610746251609, "rating": 4.0, "text": "Is good. The attention is excellent", "pics": null, "resp": {"time": 1611051930937, "text": "Thank you so much for your kind words, Magaly Torres De. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116085307570008975730", "name": "M. Cottrell", "time": 1614385151410, "rating": 5.0, "text": "Professional. Friendly. Timely. Appreciated.", "pics": null, "resp": {"time": 1614389405117, "text": "Thank you so much for your kind words, M.. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104564902918424589556", "name": "Willie Floyd", "time": 1620950312506, "rating": 5.0, "text": "It was fantastic.", "pics": null, "resp": {"time": 1620954544220, "text": "Thank you so much for your kind words, Willie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104568730104757752537", "name": "Tywanda Ginwright", "time": 1590957263215, "rating": 5.0, "text": "So much respect coming from the front counter including the nurses the labs even the management staffing so it's very much home I enjoy my doctor visitsanytime that the nurses and the doctors listen to what you say you know it's an awesome place", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114378757445699436831", "name": "Goff Family", "time": 1579218711783, "rating": 1.0, "text": "This place is horrible.  I have been recently diagnosed with diabetes, and they can’t even get my medical records from the hospital to give me my proper medication.  My doctor has failed to call in my meds to my pharmacy for two days.  I have a severely infected ear, and they won’t refer me to a specialist.  My ear has been closed shut for 3 weeks.  I’m going to find another doctor.  Hopefully one that can tell me which type diabetic I am, and help me hear, again.", "pics": null, "resp": {"time": 1579274713966, "text": "Thank you for providing your feedback and letting us know about this issue, Goff. We set a high standard for ourselves and are truly sorry to hear that standard was not met in your interaction with us. Please get in touch with us on (205) 788-5164 and we'd be happy to help you out.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "107903622324236790573", "name": "Audrey mayes boykin", "time": 1595640205239, "rating": 5.0, "text": "Staff nice my dr was nice none of the staff was disrespectful like some other dr places be", "pics": null, "resp": {"time": 1595684763700, "text": "Thank you so much for your kind words, Audrey Mayes. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113870819955941654465", "name": "Rapheal King", "time": 1599959709705, "rating": 5.0, "text": "Great Doctors great customer service friendly family atmosphere", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111824514496508397404", "name": "Kristal Hayes", "time": 1561553140921, "rating": 5.0, "text": "I’ve been going here since July/August 2014 and I love it. From the doctors,lab techs,pct’s and front desk staff they’re all great people. They make you feel comfortable from the moment you walk through the door until you end. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101963619023785297219", "name": "Chris Long", "time": 1614378337765, "rating": 5.0, "text": "Friendly, caring nurses.", "pics": null, "resp": {"time": 1614382563892, "text": "Thank you so much for your kind words, Chris. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109862450954386763957", "name": "Donna Scott", "time": 1616425817258, "rating": 5.0, "text": "Well organized.", "pics": null, "resp": {"time": 1616430066008, "text": "Thank you so much for your kind words, Donna. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104963318863254831239", "name": "Charles Carrick", "time": 1583625193735, "rating": 5.0, "text": "I had a really good visit every one was polite the doctor I am seeing is awesome she listens to me and what I need to say I trusted her right away I'm really impressed", "pics": null, "resp": {"time": 1583631846074, "text": "Hello Charles,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109380812457310887709", "name": "Bryan Blankenship", "time": 1599873461009, "rating": 5.0, "text": "Dr. Frank is TRULY THE BEST. I feel she truly cares about her patient's health.\n\n10 STARS *.*.*.*.*.*.*.*.*.*", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104207402246569630114", "name": "Rose E FX", "time": 1606955138412, "rating": 5.0, "text": "Everyone is so nice and accommodating thanks Cahaba", "pics": null, "resp": {"time": 1606959350466, "text": "Thank you so much for your kind words, Rose'. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "103512036924211530971", "name": "Alicia G Warren", "time": 1575604722510, "rating": 5.0, "text": "Dr. Ashford is the best.... Been going to him since 2014 and he delivered all 4 of my boys in 2015, 2016, 2017 and 2018..... He's so good, I kept going back😂🤣😂😂", "pics": null, "resp": {"time": 1575665327305, "text": "Hello Alicia G,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116857007798589398949", "name": "Mike Bell", "time": 1614297391984, "rating": 5.0, "text": "Very good and quick", "pics": null, "resp": {"time": 1614301622191, "text": "Thank you so much for your kind words, Mike. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112031252969201704531", "name": "Oneofakind", "time": 1565200380752, "rating": 1.0, "text": "My experience here was horrible to say the least. After being placed in a room going on two hours they had forgotten I was back there I had to call to the front desk. They said my chart had ended up on the other side. The staff is definitely a reflection of the location hood/ ghetto. When it comes to your profession you would think they would be alot more professional. Definitely will not be going back. If this was a vet I wouldn't refer my pet.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100398137027437001592", "name": "Dana McBrayer", "time": 1549301058709, "rating": 5.0, "text": "I have now been to this facility twice. Both times I've been, I was treated with nothing but respect. They were very prompt. I never had to wait long for anyone or test.  All of my questions were answered thoroughly.  They are very friendly and kind. I just had a wonderful experience all the way around.  I feel like they are very thorough, and they truly care about my health, they're not just hurting me through like cattle. Love yhis place", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111238870167602672803", "name": "Caprice Stover", "time": 1553104462027, "rating": 5.0, "text": "Dr Preston is the absolute best I love her... she listens to you whole heartedly you don't feel like your with just a  doctor it's like being with someone who genuinely cares for you.\n- Caprice Wilson", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "108176049091423274798", "name": "the sisters", "time": 1619221658637, "rating": 5.0, "text": "Fantastic.", "pics": null, "resp": {"time": 1619225883232, "text": "Thank you so much for your kind words, The. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105733688440889631680", "name": "Nakeshia Mosley", "time": 1563491392740, "rating": 5.0, "text": "I've only had one visit, bit I'm looking forward to many,many more to come. The staff is super friendly and welcoming an I just love Cleo!", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104064294910123645212", "name": "Tammy Duren", "time": 1555683516625, "rating": 5.0, "text": "It was a really good visit. First time there. Everyone was so very nice and caring. I can actually say that I enjoyed my visit.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112869480666425354045", "name": "Feona Harris", "time": 1607473009708, "rating": 5.0, "text": "I love the Medical Personnel,they are great!!!!", "pics": null, "resp": {"time": 1607557556770, "text": "Thank you so much for your kind words, Feona. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "102490581311892644796", "name": "Amiee Newsome", "time": 1574294789735, "rating": 5.0, "text": "Can't even believe I was treated with kindness, empathy,  and respect  as a uninsured patient.  I'm so grateful for this office!", "pics": null, "resp": {"time": 1574324594389, "text": "Thank you so much for your kind words, Amiee. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113876404054215593057", "name": "Kathy Smith", "time": 1615506516481, "rating": 5.0, "text": "Fast and efficient", "pics": null, "resp": {"time": 1615510743627, "text": "Thank you so much for your kind words, Kathy. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116103480224465706117", "name": "Gwen Angry", "time": 1614481815967, "rating": 5.0, "text": "Wonderful experience", "pics": null, "resp": {"time": 1614486063702, "text": "Thank you so much for your kind words, Gwen. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116854703402909601299", "name": "Carla Kendrick", "time": 1551841289808, "rating": 4.0, "text": "Great PA- Latorya Franks!\nShe sits down and takes her time explaining. She gets it! Very patient and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116213104737755990523", "name": "Valesea Todd", "time": 1622007552440, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1622011802823, "text": "Thank you so much for your kind words, Valesea. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117068701778898144388", "name": "Lexus LaPortiaye Lush", "time": 1556497163958, "rating": 5.0, "text": "Love my doctors office. Mrs.Loretta always keeps it real & helps you feel better.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116894857495600814281", "name": "Tenise Smith", "time": 1568247409288, "rating": 5.0, "text": "I love Cahaba I love the staff there they are always welcoming to anyone that walks in and they are always friendly.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105548993714880736069", "name": "Karti Asih", "time": 1573796232611, "rating": 5.0, "text": "Friendly doctors and nurses. Me & my family we love to go there, they always solved our problems.", "pics": null, "resp": {"time": 1572807182063, "text": "Thank you so much for your kind words, Karti. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113268739070500685137", "name": "KAP Truth", "time": 1599697399288, "rating": 5.0, "text": "Great staff . Great service .", "pics": null, "resp": {"time": 1599717688202, "text": "Thank you so much for your kind words, Jay. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "113398541914502842702", "name": "Dawn Wilson", "time": 1548979875881, "rating": 5.0, "text": "LaTorya Franks PA-C she is Awesome❤️\nIf you want someone very dependable and friendly but knows their knowledge about the Body...She is Your Doc!", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "118073187160713752295", "name": "Kandee Avea", "time": 1561506896134, "rating": 5.0, "text": "The most friendly best staff ever im extremly satisfied with this place if i could give it 10 stars i def. Would", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112579335403748726370", "name": "James Garner", "time": 1554940528291, "rating": 5.0, "text": "Great healthcare does exist. I had a wonderful experience at Cahaba Medical Care.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "103045204898290518540", "name": "LaDonna M.", "time": 1557949383362, "rating": 4.0, "text": "I was pleased with the staff an Dr. Ashford. I would recommend Dr. Ashford OBGYN very professional.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111494689261970973928", "name": "Ashaley Jackson", "time": 1554352327263, "rating": 5.0, "text": "First time there & it felt as if my daughter had been going there for years! Wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116474943880300463391", "name": "Monecka Parker", "time": 1553730576719, "rating": 5.0, "text": "Everyone is always nice and professional. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117160894870113016575", "name": "Eliza Williams", "time": 1574381499820, "rating": 5.0, "text": "Blood was drawn with no problem great nurse in lab", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106715862765476711186", "name": "Kelli M.", "time": 1563568962042, "rating": 1.0, "text": "If I could give 0 stars I would. The staff is very unprofessional when it comes to dealing with patients health. Tori is unconcerned with the needs of patients, and you can tell everyone there just shows up for a check", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104705409544224439121", "name": "jamela johnson", "time": 1552695942076, "rating": 5.0, "text": "Staff was really friendly and my app didn't take long.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114262709875825882598", "name": "Quinnettriea Mcmeans", "time": 1547602454047, "rating": 3.0, "text": "Doctors and practitioner nurses are great. They have wonderful adittudes when answering and asking you question. However one your assisting nurses ( the nurses that take your weight) has a very nasty adittude that comes off very rude and unprofessional to your environment.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101869654729603273486", "name": "Cherita Cheatham", "time": 1616824193102, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1616828462668, "text": "Thank you so much for your kind words, Cherita. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110819241947008369878", "name": "Hattie Holmes-Anderson", "time": 1614988247798, "rating": 5.0, "text": "Very professional and friendly", "pics": null, "resp": {"time": 1614992523707, "text": "Thank you so much for your kind words, Hattie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104762590232385197064", "name": "Chanel Armstong", "time": 1533071328560, "rating": 1.0, "text": "DONT DO IT!! Went to Doctor L. Franks for fertility treatment was successful came in office with bleeding. Called first was advised to come into office got there rushed to back only to be told as she looked didnt check blood pressure i was in pain she looks at me and says you need to go to hospital, thats why i called first. Front desk personnel was great they care more then the two doctors do.Nevertheless i suffered a miscarriage and never went back. Just has no emotional support did not care and it shows..", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "116385856503060828729", "name": "Twyla Coleman", "time": 1554249962966, "rating": 5.0, "text": "Doctor Ashford is amazing thanks for all yall did for me🙌", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101910467853219648338", "name": "Sharon Jenkins", "time": 1538622957331, "rating": 5.0, "text": "Was planning on finding a new gynecologist since they moved from the hospital to ensley due to not being familiar with the area and parking is not always easy, but everyone at this location from the sweet woman at the sign in desk to the nurses and doctors are absolutely amazing! Everyone is always kind, helpful, the doctors do not mind if you have a million questions, they'll answer them all with a smile, dr Ashford and dr Preston are seriously amazing!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105214252365809489688", "name": "Mary Murphy", "time": 1548375468675, "rating": 5.0, "text": "The staff is very professional,and caring. I have told my family & friends.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109179626098844692960", "name": "Kenyatta Williams", "time": 1618098598845, "rating": 5.0, "text": "I love this place", "pics": null, "resp": {"time": 1598677374538, "text": "Thank you so much for your kind words, Kenyatta. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "111424181302034904308", "name": "Alfred Foster", "time": 1614391095884, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1614395343725, "text": "Thank you so much for your kind words, Alfred. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114874609899516456764", "name": "Samuel S. Rainer, Jr.", "time": 1612396282708, "rating": 5.0, "text": "Very professional nurses", "pics": null, "resp": {"time": 1612400475878, "text": "Thank you so much for your kind words, Samuel. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101947740141508645107", "name": "Lanisa Fincher", "time": 1556409006786, "rating": 5.0, "text": ".Franks &Gamble Are The Best!..", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101880810064129512828", "name": "Tiffany Threatt", "time": 1552445014169, "rating": 5.0, "text": "Very good place and wonderful medical personnel.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "114589135409354919385", "name": "wanda ward", "time": 1546736838610, "rating": 5.0, "text": "The worker are very polite to their patients", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "112388304110658391521", "name": "Mary George", "time": 1546734191885, "rating": 5.0, "text": "The clerk was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104153179408980651750", "name": "Ebony Stewart", "time": 1556323301564, "rating": 5.0, "text": "The staff is wonderful.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "115214605582590321637", "name": "Lillian Burton", "time": 1524505494603, "rating": 5.0, "text": "Great service and staff.", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "117735665524503222263", "name": "Asia Heard", "time": 1535144488702, "rating": 5.0, "text": "Wonderful doctors and staff", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "100166958481426959235", "name": "star light", "time": 1549757227164, "rating": 5.0, "text": "Everyone was so nice", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "109899601935289802155", "name": "Lyric Maliha", "time": 1564765462508, "rating": 5.0, "text": "Fast , friendly, and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "101635348663825435682", "name": "Terry Person", "time": 1546732700256, "rating": 5.0, "text": "Good business", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "104323091170463048425", "name": "Onisha Tood", "time": 1563584948034, "rating": 4.0, "text": "Everyone is very friendly", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "105158526745205317782", "name": "Jimmy Savage", "time": 1626825925343, "rating": 5.0, "text": "😁😁", "pics": null, "resp": {"time": 1626830162332, "text": "Thank you for taking the time to rate our services!\n\nCheers!\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "106868948029660581474", "name": "Jorge jair Tinoco", "time": 1620949707461, "rating": 5.0, "text": "(Translated by Google) A great service\n\n(Original)\nUn gran sevicio", "pics": null, "resp": {"time": 1620953945809, "text": "Thank you so much for your kind words, Jorge Jair. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "102948855901949897317", "name": "uriel nava", "time": 1627783919558, "rating": 5.0, "text": "(Translated by Google) Excellent attention from all staff\n\n(Original)\nExcelente atención de todo el personal", "pics": null, "resp": {"time": 1627788182338, "text": "Thank you so much for your kind words, Uriel. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110422119829164029956", "name": "Nayeli Blanco", "time": 1626861190568, "rating": 5.0, "text": "Muy buen servicio respetuosos", "pics": null, "resp": {"time": 1626865263215, "text": "Thank you so much for your kind words, Nayeli. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care"}, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "118417505172532962898", "name": "Fabio Agudelo", "time": 1551748675368, "rating": 5.0, "text": "(Translated by Google) All very well\n\n(Original)\nTodo muy bien", "pics": null, "resp": null, "gmap_id": "0x88891d8ca86d669f:0x2760c8b29e1bebae"}
{"user_id": "110299208685129450775", "name": "debbie franklin", "time": 1626513739940, "rating": 1.0, "text": "This clinic should be held accountable for the lives they have destroyed...during a 9 month period my appointments were continually being canceled even though they were well aware I had been in the hospital and had to return to the hospital because of these cancellations. Even the ER doctors couldn’t understand why they wouldn’t even authorize a needed test and never ordered a single blood, urine test or a scan for a 50+ year old woman who was suffering from severe abdominal pain that after numerous attempts to see a doctor was finally diagnosed by DCH hospital with advanced ovarian cancer that spread all over the abdomen. The pharmacy couldn’t even get Maude Whatley to authorize basic blood pressure and stomach meds. The first thing the ER doctor asked me was how I could not know something serious was wrong.... I did know, I just couldn’t get a single test done in this place. Hopefully justice will be served because it’s certainly not fair that the ones responsible can just continue with their lives without consequences!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "104024009477267531345", "name": "Austin Blair", "time": 1626105011981, "rating": 1.0, "text": "One of the worst clinics I’ve unfortunately had the opportunity to visit. No one operates the phones, it’s near impossible to actually get on the phone with an actual HUMAN working there. Then when you do get a hold of someone, they “transfer” you to voicemail by hanging up! If you have an appointment, it doesn’t matter, you won’t been seen until 2 hours after it’s start time. Then you’ll be waiting for 45 minutes in a room because the doctor “forgot!” to come by. I was prescribed a medication that gave me SEVERE side effects, and when I called this office for help they gave me nothing. I couldn’t even get a call back from the doctor that prescribed me this medication after leaving a message with the clinic, all the while I’m vomiting and had diarrhea to no end. I will never be going back.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "107937794163598955657", "name": "Crystal Spencerfe5tgv8", "time": 1599486346458, "rating": 5.0, "text": "Awesome place for service! You have passionate providers and staff! There is no other place in town that will offer the amount of services along with the gratitude this place has! I would choose this place every time! They will help you with all your needs, if they can’t, they will get you where you need to be!! Literally the best place in town!! I love this place, it’s like a family!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "103085305732027940177", "name": "Каtya Olhovitska", "time": 1603927124613, "rating": 2.0, "text": "They are position like a low-cost clinic! I called them and explained my situation, woman on reception was rude and gave the phone for other worker. They asked income for our family, and they never said the amount, in the end I arrived at the clinic and she charged $ 275 for an x-ray and examination.  This is awesome how huge it is! I do not understand why it was necessary to ask our income over the phone!  if you still need to go to the clinic, we wasted our time ..", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "108679753649463568986", "name": "Rose Buffer", "time": 1603208143464, "rating": 5.0, "text": "Great service at Whatley!! My wait time for Dr. Hill (Podiatrist) is ALWAYS  timely.  Dr. Hill is efficient and she is caring.  Initial apprehensions were unnecessary!  Staff, doctors, wait time and service compare nicely to all of my other medical visits!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "116422645931699833032", "name": "C. Garrett", "time": 1577483927449, "rating": 3.0, "text": "Overall not a bad office visit. The staff was helpful and concerned and took me as a walk-in when the walk-in list was already ridiculous.  However, all the good was trumped by the 4 HOUR wait time (I was a walk-in). 3 hrs was spent in waiting room and another hour spent in the back. To sum it up, good doctors, excellent nurse staff, and great desk personnel, but only go here if you don't mind an excessive wait.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "112072351092012917523", "name": "Mamak Coe", "time": 1597966803126, "rating": 3.0, "text": "Dr. Luckey is one of the best doctors I’ve had. They’ve really improved on the waiting time.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "109305485196193522065", "name": "Mo Money", "time": 1608748692591, "rating": 1.0, "text": "Very unpleasant and unprofessional lady at the sign in desk is the rudest most obtuse disgusting attitude filled person I have ever seen in my life definitely going to call and report her she needs to be fired IMMEDIATELY !!!!!!!  I'll see to it with every and anything she is fired", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "117016416435746292571", "name": "Bre Cruckshank", "time": 1606153776586, "rating": 1.0, "text": "They don’t answer the phone", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "111346926895095397381", "name": "Gladys Daniels", "time": 1601411996832, "rating": 1.0, "text": "Sitting here with my sister who had a 3:00 appointment and it is now 3:36..We arrived at 2:36..My problem is why give someone a special time to be there only to be made to wait almost a hour pass your appointed time..", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "108354937874189686817", "name": "Jenesis Thomas", "time": 1531253321090, "rating": 5.0, "text": "You’re not going to have any luck calling, but once you are there they are great! They are extremely caring and listen! Some even gave personal comparisons and methods that helped them. Nurses and front desk people were extremely kind and make you feel at home! I was in and out within an hour!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "114454600416216186553", "name": "Scott Lollar", "time": 1599009885510, "rating": 2.0, "text": "They never get my meds right\nThey call in the wrong ones are they dont call all of  them in its crazy", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "110941109864463412115", "name": "CW R", "time": 1602784470900, "rating": 1.0, "text": "With appointment, 2.5 hours in the waiting room. Another hour in the back while employees have lunch. Disgraceful.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "100228308467727257009", "name": "Baybeegirl86", "time": 1571157395972, "rating": 1.0, "text": "The WORST place to get medical care. The DOCTORS aren't the problem, it's the ADMINISTRATION. Have to go back and forth with them to get a prescription refill. Placed on hold for 20 mins while phone was ringing.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "101096551133740860215", "name": "Jessika Horne", "time": 1559274209972, "rating": 1.0, "text": "Dr luckey was helpful. Waited 45 minutes after my appointment for a drs excuse from our nurse, Tonya, who said she’d bring it to the waiting area. Got tired of being ignored and left without it. Wouldn’t recommend unless absolutely necessary.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "112535132338326311082", "name": "Tiffiny Channell", "time": 1532566128653, "rating": 5.0, "text": "I have had two horrible teeth that have been bothering me for years. I have also had nothing but bad experiences with dentists my while childhood causing me to gain a phobia of a dentist. But today I did a walk in at Maude whatley and they helped me over come this. Great nurses as well as dentests.they took great care of me and I thank them all. I will definitely be going back and would recommend them to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "113270756521626573378", "name": "Hunter Fikes", "time": 1505836521464, "rating": 1.0, "text": "Some of the workers there are rude as it gets.... had one lady while I was trying to finish what I had to say over the phone interrupting me several times being nasty about an appt that was made and was missed informed me on and they swear up and down they didn't make a mistake sorry to say we are all humans and we all make mistakes but just own up to it don't give your customers lip and attitude that's not good customer service at all so glad I'm moving and won't have to ever deal with this unorganized institution I suggest you go to Birmingham if you want good service and people that actually care about there patients....", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "111330288517077213147", "name": "India Lukas", "time": 1515106085300, "rating": 5.0, "text": "Dr. Luckey is fabulous! The wait time is long but the services performed by Dr. Luckey makes it worth while! Best Dr. I've ever had! Some of the other staff members are rude though so just treat people as they treat you.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "100289768079889561750", "name": "Betty Fields", "time": 1548722226413, "rating": 1.0, "text": "Slowest place ever, only good thing is pricing for uninsured. Roaches crawling around the floor. After waiting 4 hours the doctor left without seeing me.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "111841839647145372622", "name": "lulu's wonderland", "time": 1539961622168, "rating": 1.0, "text": "Youlll wait forever !!!! Even if u have an appointment 😖😖makes me mad becuase all the staffs aint working hard enough back there sipping on coffee", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "103344518564562265305", "name": "Julie Johnson", "time": 1513697073367, "rating": 1.0, "text": "I  would not recommend Maude Whatley to anyone wanting a  Dr to help you get on disability. They act as if they listen to you about your health problems but when they have to fill a report to disability tbey don't give a complete enough report. Either that or they lie on tbe report and say you don't have enough problems to not work. I have been denied my disability 4 times because of Maude Whatley.  I  will never again use their services.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "117986380138278093664", "name": "Haley Brand", "time": 1501355251860, "rating": 2.0, "text": "They are nice and quick but I have been waiting three days for my prescription to be called in and they still haven't called it in!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "104858804834073050800", "name": "Kinyetta Williams", "time": 1506435425996, "rating": 1.0, "text": "Poor service! Never see same doctor. When you get refill on medication never give correct dosage.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "114016891018074668984", "name": "Jonathan Christian", "time": 1540554261479, "rating": 2.0, "text": "I went and I didn't get the attention I needed to address my pain issue. I guess there seemed to be a problem that day.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "116483675256237760481", "name": "T Smith", "time": 1563222589358, "rating": 1.0, "text": "I'm calling them right now.  The telephone has rung for three to four minutes before anyone answered.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "110075922311451999121", "name": "Niconico nii", "time": 1610379593290, "rating": 1.0, "text": "Cant answer phone", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "112953854456009257980", "name": "Sami Alshammari", "time": 1554301300679, "rating": 1.0, "text": "My wife had depo shot but they didn’t discuss the side effects of it", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "103139954602688314658", "name": "Lanicole Chandler", "time": 1548699182755, "rating": 1.0, "text": "Here now n been here since 8:30a.m and they still haven’t called my sister to the back n it’s now 12:12pm bad service", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "106672085186916631327", "name": "Sterling Dozier (ShadowFlame275)", "time": 1581442637240, "rating": 1.0, "text": "Had a 9:00am appointment, and was still in the lobby at 11:30", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "110820974316655291606", "name": "Tywanna Jones", "time": 1534512556974, "rating": 1.0, "text": "DO NOT GO HERE UNLESS YOU ARE EXTREMELY DESPERATE!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "118008522954866945543", "name": "Steve Millwood", "time": 1449664115182, "rating": 5.0, "text": "Hey my mouth is killing me it cheap enough to get both teeth pulled that hurt instead of just one ..I LOVE IT..thank you Maude", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "103295748615258390620", "name": "Jeremiah Reece", "time": 1531429170111, "rating": 2.0, "text": "They take all day to see you even with an appointment and they forget to call in medication", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "113080431452546669932", "name": "senea tubbs", "time": 1542232806728, "rating": 1.0, "text": "NEVER go unless you have 3 hours to wait,even if you arrive 20 minutes early for an appointment.I HATE going there .Its unprofessional,nasty,unorganized,horrible staff.I can't think of anything good about this place.It should be a veterinarians office not a place for people.Actually not even that because I am sure animals won't get good treatment there either.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "104975796021878274945", "name": "Cheryl Cook", "time": 1568062208989, "rating": 1.0, "text": "Slow and incompetent!", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "100954458478056685365", "name": "C Miller", "time": 1549578483016, "rating": 1.0, "text": "Too long for appointments and referrals.", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "102505194482185375735", "name": "Mary Mary", "time": 1533054377599, "rating": 5.0, "text": "(Translated by Google) better clinic is recommended\n\n(Original)\nmejor clínic es recomendable", "pics": null, "resp": null, "gmap_id": "0x888602fd970aa691:0xa8b64a33bdb81aa4"}
{"user_id": "102807234754651307149", "name": "tammy pickett", "time": 1620777915758, "rating": 5.0, "text": "i love Cahaba Medical Care in Centreville Al!\nI have been using this doctors office for around five or six years! the staff is friendly and polite !\nI have to have certain days and hours that i can make my appointments on and they  always work with me to accommodate my work schedule! they are all great people ! And\nthe doctors and nurses are amazing !  My Dr is leaving in July( Brooke Carrol- she is amazing and i will truly miss her-I understand that she wants to further her career but she also is making sure that i will be taken care of by another Doctor! I have not meet my new Dr yet  but I trust her to find me another great one! Also Dr.Shelly waits is an amazing Dr.Also! she was my first Doctor there many years ago! So when I say that these Doctors and nurses and all the staff take care you-I mean it from the bottom of my heart! Thank you to all the staff at Cahaba Medical Care in Centreville Alabama", "pics": null, "resp": {"time": 1620782163106, "text": "Thank you so much for your kind words, Tammy. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117247676829105124595", "name": "Jessica Tejada", "time": 1621581392914, "rating": 5.0, "text": "I absolutely love Cahaba medical care in Centreville, all staff members are very sweet and do everything they can to make you feel comfortable and welcomed. Mrs yartins is absolutely the best ✋ hands down! I do not want to go anywhere else but here for my medical needs.. and I highly recommend to anyone seeking a doctor and loving environment", "pics": null, "resp": {"time": 1621655223404, "text": "Thank you so much for your kind words, Jessica. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "106246456039856992631", "name": "Jessica Chavez", "time": 1618703667515, "rating": 5.0, "text": "This place is the best... very attentive and quick to get you in and out in a timely manner... very recommended to everyone... I’ll be going there for all my medical needs. They really care about your needs and are on one on one perspectives... they take their time with you and are very concerned about fixing your problems... highly recommended!!!!", "pics": null, "resp": {"time": 1618707905842, "text": "Thank you so much for your kind words, Jessica. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "115360460420758315558", "name": "Cynthia Bertolone", "time": 1617840280660, "rating": 5.0, "text": "I love coming here to get my medical care.? I don’t have insurance but Cahaba medical care works with your income. I don’t wait long and I am taking care of immediately. In & out swiftly.", "pics": null, "resp": {"time": 1617844322644, "text": "Thank you so much for your kind words, Cynthia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102102457483227865307", "name": "Bobbie Markham", "time": 1618099020341, "rating": 5.0, "text": "The staff is so great.  Everyone I came in contact  with was so nice and caring. I’m very happy I made my vaccination appointment here. I would recommend to anyone!", "pics": null, "resp": {"time": 1615743004076, "text": "Thank you for taking the time to rate our services!\n\nCheers!\nCahaba Medical Care"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105009960706083782846", "name": "Tina Roberts", "time": 1618962884483, "rating": 5.0, "text": "My husband and I traveled from the Birmingham area and it was a great experience. This was the first available so we took the appointment. The place was clean, well run, and the people were all professional and polite. I would do it again. Yes,  we will be there for the second shot.", "pics": null, "resp": {"time": 1618967223134, "text": "Thank you so much for your kind words, Tina. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116897457287828692805", "name": "JoAnn McNamee", "time": 1621960100305, "rating": 5.0, "text": "The staff was very nice. Nurses were great in telling me exactly what they were doing with the test I had done.", "pics": null, "resp": {"time": 1621964344392, "text": "Thank you so much for your kind words, Joann. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102720742474417794472", "name": "Anthony Hardin", "time": 1620320792601, "rating": 5.0, "text": "The staff at CMC - Centreville was absolutely fantastic!  From start to finish, the experience was truly pleasant.  I appreciate them so much!", "pics": null, "resp": {"time": 1620325024322, "text": "Thank you so much for your kind words, Anthony. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101205499824823530689", "name": "DAWG FEVER 247", "time": 1620231108401, "rating": 5.0, "text": "There pretty good. Love there sliding scale as well", "pics": null, "resp": {"time": 1620235382117, "text": "Thank you so much for your kind words, Georgia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "110276400262631753030", "name": "Denice Stone", "time": 1608380995844, "rating": 5.0, "text": "Everyone was amazing and very professional! Dr. Elizabeth Lee was great! Very informative and took her time to make sure, I was comfortable leaving with the best care. Thank you! I Highly recommend Cahaba Medical Care in Centreville for outstanding quality of care 💗", "pics": null, "resp": {"time": 1608385143985, "text": "Thank you so much for your kind words, Denice. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104300971276718995329", "name": "Danielle Peterson", "time": 1616025726436, "rating": 5.0, "text": "Cahaba Medical Care was excellent with pre-Covid vaccine information and registration.  Checked in easily to the center; very little wait, and nurses/staff answered all questions.  Great first experience!", "pics": null, "resp": {"time": 1616029982310, "text": "Thank you so much for your kind words, Danielle. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105251377820399830343", "name": "John Hughes", "time": 1615610460555, "rating": 5.0, "text": "They were very fast and professional. I got my Covid vaccine and was on my way again swiftly. Thanks!", "pics": null, "resp": {"time": 1615614722281, "text": "Thank you so much for your kind words, John. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111474155391881489622", "name": "Germaine Steele", "time": 1616286173383, "rating": 5.0, "text": "The whole process from scheduling to administrating the vaccine was simple and convenient.  The staff was courteous and professional.", "pics": null, "resp": {"time": 1616290443973, "text": "Thank you so much for your kind words, Germaine. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "112165459630095840869", "name": "Karen Underwood", "time": 1618533715773, "rating": 5.0, "text": "Dr. Elizabeth Lee is a great listener. She hears your problems and includes you in the plan making to better your health. She is very patient and kind.", "pics": null, "resp": {"time": 1613534316758, "text": "Thank you so much for your kind words, Karen. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "110695410498019815068", "name": "Patty DeFee", "time": 1615727604912, "rating": 5.0, "text": "Received the COVID vaccine Friday. Very efficient drive thru operation.  Staff was friendly, professional and knowledgeable.  Thank you!", "pics": null, "resp": {"time": 1615731843410, "text": "Thank you so much for your kind words, Patty. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "109804066279585070857", "name": "Barry Smith", "time": 1616121596716, "rating": 5.0, "text": "The staff was courteous and professional. Everything was very efficient and well organized.", "pics": null, "resp": {"time": 1616125866238, "text": "Thank you so much for your kind words, Barry. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "100142352876989694265", "name": "Annie Lackey", "time": 1619880732251, "rating": 5.0, "text": "Not always prompt but good service.", "pics": null, "resp": {"time": 1619885043926, "text": "Thank you so much for your kind words, Annie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103751883748878450765", "name": "Linda Yarbrough", "time": 1618076603480, "rating": 5.0, "text": "Staff was informative, efficient and kind. I received my COVID vaccine with no wait no worries.", "pics": null, "resp": {"time": 1618080663009, "text": "Thank you so much for your kind words, Linda. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116345026708839808061", "name": "Judy Dempsey", "time": 1619009046750, "rating": 5.0, "text": "Everyone there is so kind and do a great job.💕", "pics": null, "resp": {"time": 1619013302958, "text": "Thank you so much for your kind words, Judy. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103240478345672525992", "name": "Gena Latham", "time": 1617321491867, "rating": 5.0, "text": "The staff were all friendly and polite, the wait time was short and Dr. Hamilton was caring and thorough. I plan to make them my primary care physicians.", "pics": null, "resp": {"time": 1617325742700, "text": "Thank you so much for your kind words, Gena. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101020465935729998702", "name": "Gary Mims", "time": 1608780283364, "rating": 4.0, "text": "Very nice and professional staff.. doctors are very knowledgeable and do everything they can to make sure you're healthy and get medical treatment needed when not.", "pics": null, "resp": {"time": 1608784498781, "text": "Thank you for providing your feedback and letting us know about this issue, Gary. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104131707165823073619", "name": "Cris Gates", "time": 1605229065863, "rating": 5.0, "text": "Staff are caring, professional and pleasant. Service is prompt. Elizabeth Lee, MD is thorough, listens and discusses options and makes care decisions with you.  I’ve been very impressed so far and would recommend trying Cahaba Medical Care in Centreville for yourself.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101907566466854167030", "name": "m watkins", "time": 1612569149744, "rating": 5.0, "text": "i was able to get covid vaccine appointment smoothly and have received the first one.  smooth parking lot set up that was on time and professional", "pics": null, "resp": {"time": 1612573339951, "text": "Thank you so much for your kind words, M. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "108686809435328868810", "name": "natasha pennington", "time": 1615176023150, "rating": 5.0, "text": "I have to make an appt. every 3 months to have lab work done and then an appt.1 week later to see the nurse practitioner to go over that lab work and discuss how I'm doing with my back pain.\nAll of my appt.'s up to date have went very smoothly. The staff has always been very nice and helpful, I'm usually called to the back very quickly and the nurse practitioner (April Yartins) is super friendly, discusses everything pertaining to your visit and answers any questions you may have and then finishes your visit up and gets you out of there in a very timely manner.", "pics": null, "resp": {"time": 1615180262858, "text": "Thank you so much for your kind words, Natasha. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117036059162737299912", "name": "Felicia Thomas", "time": 1611501579317, "rating": 5.0, "text": "The office staff are very helpful and kind.  The doctors and staff really listen to what I have to say and they take time to do a  through check up. I am in and out of the office in no time.", "pics": null, "resp": {"time": 1611505799214, "text": "Thank you so much for your kind words, Felicia. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101073228764857921707", "name": "Twanda White", "time": 1613000988864, "rating": 5.0, "text": "Dr. Lashandra Walter is awesome. She’s very precise and so nice.", "pics": null, "resp": {"time": 1613005221712, "text": "Thank you so much for your kind words, Twanda. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "108971231921197590977", "name": "Connie Holland", "time": 1603496857687, "rating": 5.0, "text": "The people working there was so nice and so sweet. They did everything possible to help me and made me feel cared  for. I wish every place was as nice as they were.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "113469976746721002594", "name": "Traci Silloway", "time": 1606261805054, "rating": 5.0, "text": "I saw Dr. Whiten and she not only listened to me but she was genuinely concerned about me and my healthcare and well-being.  She is going to help me and I feel relieved for the first time in months.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "115391471925609450392", "name": "Chelsea Spears", "time": 1615835260784, "rating": 5.0, "text": "great clinic, friendly and got my vaccine in a quickly matter.", "pics": null, "resp": {"time": 1615839483074, "text": "Thank you so much for your kind words, Chelsea. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "114289970734493472496", "name": "Will Norton", "time": 1618455127348, "rating": 5.0, "text": "Impressive care and timely service!  I will be back for sure!", "pics": null, "resp": {"time": 1618459444771, "text": "Thank you so much for your kind words, Will. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117323053190006654766", "name": "Joseph DeFee", "time": 1615812212181, "rating": 5.0, "text": "Very efficient, informative, and polite group of professionals. It was a very good experience.", "pics": null, "resp": {"time": 1615816443027, "text": "Thank you so much for your kind words, Joseph. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102241514271877776368", "name": "Wilder Adkins", "time": 1615649275447, "rating": 5.0, "text": "They were polite and professional. I was in and out in about 30 minutes.", "pics": null, "resp": {"time": 1615653122884, "text": "Thank you so much for your kind words, Wilder. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111270782187633330724", "name": "Electa Jackson", "time": 1605738602212, "rating": 2.0, "text": "You never know who you're going to see. They have changed my doctor a few times without even a phone call. Also, you make an appointment for 3:30 and it's an hour to an hour and a half before you're seen. After 4 yrs I think I need a new doctors office! Beyond frustrated!", "pics": null, "resp": {"time": 1605339079296, "text": "Thank you for providing your feedback and letting us know about this issue, Electa. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "114517302354828115757", "name": "Lance LaFoy", "time": 1613093160431, "rating": 5.0, "text": "Everyone was very kind. My NP Mrs Yartins was very knowledgeable.i would very much recommend.", "pics": null, "resp": {"time": 1613097377828, "text": "Thank you so much for your kind words, Lance. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102260754350566570775", "name": "Grayson Wright", "time": 1619310195858, "rating": 5.0, "text": "Easy vaccination process and nice staff!", "pics": null, "resp": {"time": 1619314443075, "text": "Thank you so much for your kind words, Grayson. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "108033912109616301144", "name": "Darrell Stone", "time": 1597684187953, "rating": 5.0, "text": "I had a fantastic  at this place. We enjoyed the wonderful atmosphere and the meals. The staff members were super amiable. I am content we eventually decided to try this restaurant.", "pics": null, "resp": {"time": 1597763738606, "text": "Thank you so much for your kind words, Darrell. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117396161419146594867", "name": "Don Marchant", "time": 1611791962508, "rating": 5.0, "text": "Prompt, professional and personable.  Great lab experience.", "pics": null, "resp": {"time": 1611796158008, "text": "Thank you so much for your kind words, Don. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "115970939346314408382", "name": "Alisha Seeley", "time": 1606284981801, "rating": 5.0, "text": "I had my first visit at this location recently. The staff was very very friendly and my wait time was very short. I absolutely love the Nurse Practitioner Yartins that I have followed from Calera. She is absolutely the most sweetest and caring medical professional that I have ever met! She is very thorough, takes her time to understand and makes sure that I understand the route we are taking with my care. I highly recommend this practice and NP Yartins.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116662634671490231513", "name": "Rebecca Erickson", "time": 1619353423824, "rating": 4.0, "text": "They are friendly. Went for me second shot Friday and the to of the needle was bent. Hurt like heck. The lady looked when she pulled it out and saw it was bent.", "pics": null, "resp": {"time": 1619357703438, "text": "Thank you for providing your feedback and letting us know about this issue, Rebecca. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111448980398838729565", "name": "Kandi White", "time": 1604624677703, "rating": 5.0, "text": "This was by far the best visit I have experienced with any staff and medical professionals. This will be my go to from now on!! They care and it shows!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103353746256966250949", "name": "Kimberly Payne", "time": 1595116627430, "rating": 5.0, "text": "I was very impressed with my first visit to Cahaba Medical Care!  The staff was very friendly and professional, and great care was taken with sanitization and social distancing.  The nurse practitioner I saw was very helpful.  I would not hesitate to return!", "pics": null, "resp": {"time": 1595134858069, "text": "Hello Kimberly,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105887734343651331324", "name": "michael moreland", "time": 1618359259995, "rating": 5.0, "text": "Very professional friendly staff .", "pics": null, "resp": {"time": 1618363503434, "text": "Thank you so much for your kind words, Michael. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "108458233754064707796", "name": "Keith Hobson", "time": 1612482768631, "rating": 5.0, "text": "All nurses & doctors were prompt, personalble & eager to help with directions & questions", "pics": null, "resp": {"time": 1612486993888, "text": "Thank you so much for your kind words, Keith. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111327306185900622989", "name": "Calem Strother", "time": 1620776960279, "rating": 4.0, "text": "Excellent very nice and welcoming", "pics": null, "resp": {"time": 1620781203714, "text": "Thank you for providing your feedback and letting us know about this issue, Calem. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103274483711228451406", "name": "Jacob Nash", "time": 1599781663446, "rating": 5.0, "text": "Amazing place clean and very nice people. Love my doc.", "pics": null, "resp": {"time": 1599788737904, "text": "Thank you so much for your kind words, Jacob. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "114768712612284838913", "name": "Tracy Coleman", "time": 1597363859214, "rating": 5.0, "text": "Dr Clark is the best. So glad I switched to cabana medical. Dr. Claek listens to you and addresses the problem with you she cares about her patients. She rocks!!!", "pics": null, "resp": {"time": 1574965963324, "text": "Thank you so much for your kind words, True. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "112942812085509635910", "name": "Jessica Tejada", "time": 1605011857172, "rating": 5.0, "text": "Staff and doctors are very polite! Absolutely love mrs yartins", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116416309229203465123", "name": "Julie Callaway", "time": 1616631040104, "rating": 5.0, "text": "Efficient,  professional and friendly.", "pics": null, "resp": {"time": 1616635322769, "text": "Thank you so much for your kind words, Julie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "110830703670545471542", "name": "Debbie Jethroe", "time": 1616638560987, "rating": 4.0, "text": "Staff was very nice!", "pics": null, "resp": {"time": 1616642822329, "text": "Thank you for providing your feedback and letting us know about this issue, Debbie. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101113635273547876621", "name": "Bill Palmer", "time": 1575508823546, "rating": 5.0, "text": "Some of the nicest people I have ever met or had dealings with.   A very professional and caring clinic.  How often do you find that in today's world.  I drive 4 plus hours one way to go to this doctors office... That should say ALL I need to say.", "pics": null, "resp": {"time": 1575586240374, "text": "Hello Bill,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "100588864802410624239", "name": "Tonya Bigham", "time": 1597254886752, "rating": 1.0, "text": "Worst doctors office I've ever visted. In search of somewhere new to go and this place popped up. Last visit I had there I told the doctor I had light sensitivity from fluorescent lights. He never heard never heard of such a thing. My pregnancy they refused to let me see the Dr. Waits. They wanted me to see a nurse practitioner. My 1st pregnancy after trying for 10 years I wanted a real doctor so I left and went to Dr. Partlow and Poist office . Best decision ever.", "pics": null, "resp": {"time": 1597311922349, "text": "Thank you for providing your feedback and letting us know about this issue, Tonya. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "118159286675571017290", "name": "Elaine Griffin", "time": 1574025795486, "rating": 5.0, "text": "This was my first time seeing Dr. Bishop and I was very pleased with her. She’s a very sweet doctor and made me feel very comfortable discussing my medical issues. Thank you guys for providing our community with competent, qualified and caring doctors.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107134526270568101198", "name": "larry wilson", "time": 1614394983527, "rating": 5.0, "text": "Excellent care and consideration.", "pics": null, "resp": {"time": 1614399243988, "text": "Thank you so much for your kind words, Larry. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "114613112320780855563", "name": "Donna Headley", "time": 1617407676826, "rating": 5.0, "text": "The nurses were professional yet friendly.", "pics": null, "resp": {"time": 1617411964075, "text": "Thank you so much for your kind words, Donna. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "110710236078371349835", "name": "Angel Carter", "time": 1612399324223, "rating": 5.0, "text": "Very professional  friendly and fast", "pics": null, "resp": {"time": 1612403546129, "text": "Thank you so much for your kind words, Angel. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116309530996653014205", "name": "Ceiara Blevins", "time": 1603240389249, "rating": 5.0, "text": "Love them everyone is so nice, i should have came to this place with my other kids...", "pics": null, "resp": {"time": 1593177726019, "text": "Thank you so much for your kind words, Ceiara. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "106046796795835251372", "name": "Ellen Potts", "time": 1617759268852, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": {"time": 1617763503061, "text": "Thank you so much for your kind words, Ellen. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117139117334855862552", "name": "Quinton P. Young III", "time": 1562983333634, "rating": 5.0, "text": "Fast appointment, excellent service I didn't wait at all past when my appointment was scheduled. My Doctor was exceptional in that he didn't hurry or rush his examination of my medical issues. I feel very confident in the care I was given. I gave an overall 5 stars and I hardly ever give that rating. But I'll be honest I was shocked at how well I felt about the care I was given considering my previous experience with USA medical healthcare. I would highly recommend Cahaba Medical Clinic to anyone seeking medical attention.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103993270331205892343", "name": "Kimberly Cottingham", "time": 1595981424385, "rating": 5.0, "text": "The nurses and doctors there are helpful to any questions you have!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "100637908457938188969", "name": "Paige Catherine", "time": 1596766674579, "rating": 5.0, "text": "Amazing doctors office and very nice people everyone is helpful!", "pics": null, "resp": {"time": 1596859259080, "text": "Thank you so much for your kind words, Paige. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107595695115094416538", "name": "Lisa Williams", "time": 1603509934238, "rating": 5.0, "text": "Great experience,great service, no wait time", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116873081799651813861", "name": "Rachael S Hight", "time": 1557401610118, "rating": 5.0, "text": "Hello, I'm Rachael H., my experience with Bibb Medical Center Hospital was Great! The folks here treated me with the utmost respect and care. I'd recommend this hospital above others. I appreciate their kindness toward me. Thanks so much to the whole Crew!! Keep up the good work,  and Blessings to All, RH ❤", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "109533650848835116502", "name": "Sarah Humphrey", "time": 1594597687075, "rating": 5.0, "text": "Great every time! Thank yall for all yall do!", "pics": null, "resp": {"time": 1594621865959, "text": "Hello Sarah,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103707567071443450907", "name": "Tish Hathaway", "time": 1599433000104, "rating": 5.0, "text": "I love my CMC Dr. Whiten!", "pics": null, "resp": {"time": 1599464733079, "text": "Thank you so much for your kind words, Tish. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111978841062892126863", "name": "Kay Lightsey", "time": 1591228215974, "rating": 5.0, "text": "I LOVE Dr. Bishop wouldn’t use anyone else‼️‼️", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104229377943109371775", "name": "Janet Dunn", "time": 1615810097285, "rating": 3.0, "text": "Wait  time needs improvement.", "pics": null, "resp": {"time": 1615814406469, "text": "Thank you for providing your feedback and letting us know about this issue, Janet. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. We apologize for any extended wait time that you experienced.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111508045067031300368", "name": "Patrick Gleaton", "time": 1579612968716, "rating": 5.0, "text": "New Doctor, Zeb Akers. Very good! Takes the time to talk about anything that I need to talk about, and tries to put everything into plain and simple terms. Great personality. Enjoy having him as my new Doctor!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107853557603551983092", "name": "Sunny Harmon", "time": 1567124902696, "rating": 5.0, "text": "I was there for lab work. I waited less than 5 minutes and the technicians are always friendly and professional and always get me on the first stick and have never hurt me. (I’m am often a difficult stick). I love the staff in the lab and at Cahaba Medical!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116478651211595048182", "name": "Natalie Orum", "time": 1618455445153, "rating": 5.0, "text": "Very friendly and professional.", "pics": null, "resp": {"time": 1618459683250, "text": "Thank you so much for your kind words, Natalie. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104384487896787334882", "name": "Carolyn Koop", "time": 1552006779707, "rating": 5.0, "text": "We are very fortunate to have a facility such as this in our community.  Everyone from the front desk to the nurses and doctors are very courteous and knowledgeable.  I've been using this office for 4 years now,and wouldn't dream of going anywhere else for my healthcare.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107539666917388606885", "name": "Crystal Allen", "time": 1562120970950, "rating": 5.0, "text": "Dr. Richardson is an Amazing doctor. I suffer from anxiety and he makes it easy to open up! I'd recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "115455870954012330519", "name": "SM Parrish", "time": 1576064764855, "rating": 5.0, "text": "I visited clinic to pick up a package but the asked to see the doctor as a walkup because I was having problems catching my breath. Within 5 mins of going back I am hooked up to an oxygen machine and am being loaded back into the car with the doctor who is riding over to the ER with us where she had called and told them we we on the way, so I was admitted as soon as I arrived. This was two days ago. I had never visited this clinic before, but I am a patient at their Maplesville Clinic. I realize now that all of these special people treat their clients with respect and care regardless of which branch they may be working at. Great job! What a great company!", "pics": null, "resp": {"time": 1576118923481, "text": "Hello Sm,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111286318802206058832", "name": "Devon Owens", "time": 1611879600350, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1611883807752, "text": "Thank you so much for your kind words, Devon. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105181538425548811253", "name": "Danny C.", "time": 1550264648346, "rating": 5.0, "text": "The ladies at Cahaba Medical are so kind and caring. The last time I went I was getting labs drawn, and being very much not okay with needles and stuff, and also being under a lot of stress situationally, I started crying. Everybody was very concerned and kind to me.\n\nThey care about you and remember you as a person. They treat everyone with personal compassion.\n\nThanks, y'all.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "106012627085397162168", "name": "Donna Simmons", "time": 1576716139567, "rating": 5.0, "text": "Again I was treated professionally and with respect and kindness I am very pleased with all of the knowledge that  all doctors have diagnosed me . I would highly recommend  CAHABA MEDICAL to everyone . God sent them to BIBB COUNTY GOD THANK YOU AND BLESS ALL OF MANY DIFFERENT DEVOTIONED PERSONS WHO MAKE ALL OF FAMILY OF CAHABA MEDICAL . I LOVE THEM ALL !!! 💓", "pics": null, "resp": {"time": 1576744025976, "text": "Hello Donna,\n\nThank you for choosing Cahaba Medical! We appreciate your kind words.\n\nHave a wonderful day,\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "118099027425382513120", "name": "Rebecca Godwin", "time": 1567942248617, "rating": 5.0, "text": "Had a good experience, The staff was very friendly and helpful, We didn't have any wait time,", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107135641882092132057", "name": "Kael Wilfrey", "time": 1560562947480, "rating": 5.0, "text": "The staff are professional and involved,  and they're well-organized. My only complaint would be  how hard it is to get them to communicate with a pharmacy when there are prescription errors.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107474843013971336969", "name": "Kristen Smith", "time": 1563352796212, "rating": 5.0, "text": "Love Dr Richardson. He explained meds very well. Very glad I found this practice.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101456678283854731711", "name": "Heather Busby", "time": 1570938996370, "rating": 5.0, "text": "Warm caring people.  Definitely recommend", "pics": null, "resp": {"time": 1572977702004, "text": "Thank you so much for your kind words, Heather. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "115727404840470063663", "name": "Sheila Beam", "time": 1559348579867, "rating": 5.0, "text": "Service was friendly and fast. Diagnosis was good and felt better within a short period of time.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107429596555102941011", "name": "James Cruso", "time": 1567818448959, "rating": 5.0, "text": "Very good Staff and all employees the Doctor's are the best.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105598989255171769317", "name": "Maggie Melendez", "time": 1550794983719, "rating": 5.0, "text": "Fast and friendly staff.  Claire Ahalt is a great doctor she genuinely listens and cares.  A lil bit of a drive for me but worth it.  They have a pharmacy ,lab -work, and for everything else a hospital behind them.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "111120015451989172003", "name": "Latisha Anderson", "time": 1575765476742, "rating": 5.0, "text": "Great customer service in a timely manor. Thanks!", "pics": null, "resp": {"time": 1575852067501, "text": "Thank you so much for your kind words, Latisha. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101396462360620375838", "name": "Skylark Russell", "time": 1550621616681, "rating": 5.0, "text": "I was very happy with the way they showed concern about me and my health. I feel like i made a great choice on making cahaba medical my perminate doctor", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117535243374168046382", "name": "Lylah Purifoy", "time": 1565303060567, "rating": 1.0, "text": "My family and I will not be returning for care from this facility. The staff is filled with untrained interns that are shadowing and have not been accepted into nursing school. I went to receive two shots for my four year old and get immunization records for pre-k. My child was held down by 6 people and given 4 shots at the same time. The 8th person in the room was a doctor who would not let me hold my 4 year olds hand or calm my 8 year old son with autism down when he was panicking from his brothers screams. My 8 year old was the 9th person in the room. (The very disappointed parent)I was the 10th person in the room. After having this traumatic experience happen to my kids. I sat in the lobby for an extra 20 minutes waiting with my frightened and aggravated children waiting for immunizations record.\nI spent 4 hours in this facility and did not receive the care and services my family deserved.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1607418016511, "rating": 3.0, "text": "Nice employees", "pics": null, "resp": {"time": 1607422257343, "text": "Thank you for providing your feedback and letting us know about this issue, Anthony. We set a high standard for ourselves and are truly sorry to hear that this standard was not met in your interaction with us. In an effort to resolve any issues that you may have had, someone from our office will be reaching out to you.\n\nThank you!\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "110412077293328622775", "name": "Robin Boatner", "time": 1561768891972, "rating": 5.0, "text": "Everyone was kind, showed great concern for my situation! Professional. Meeting my needs!\nThank you,\nRobin Miller", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104629409183379808018", "name": "Dinah Hollingshead", "time": 1553819880535, "rating": 4.0, "text": "Cahaba Medical Care has energetic and professional staff that attempt to make your visit as easy as possible.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102053013140989879469", "name": "Kathy Litton", "time": 1549544082378, "rating": 5.0, "text": "Always have a pleasant visit. Everyone is very professional and nice.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "109848580117882436151", "name": "Janet Mathis", "time": 1620955530569, "rating": 5.0, "text": "I have been seeing Dr. Yartins for over a year now.  I have had 4 different Doctors since 2015 when I started using Cahaba Medical Center and by far,  Dr. Yartins is the Best Doctor I have had.\nShe will give you as much time as you need,  she gives 110% in every way possible.  Dr. Yartins has been so great at helping me with my issues,  she worked so very hard to find me the best medication for my sweating and all of my other issues.\nI can't say enough wonderful things about her. I look forward to my visits with her.\nThank you Dr. Yartins for being such a awesome person.", "pics": null, "resp": {"time": 1621022643691, "text": "Thank you so much for your kind words, Janet. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105472296078976335538", "name": "Sherry Childers", "time": 1546564698992, "rating": 5.0, "text": "We have always gotten great care at Cahaba and this visit was no different.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "104921091085043025372", "name": "Joe Nevels", "time": 1549151749346, "rating": 5.0, "text": "Dr. Josh Eldrege is really good and listens to his patients. I pray he is always there for his patients.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "105802404364774954916", "name": "Paul", "time": 1569026055085, "rating": 5.0, "text": "Great, attentive care and wonderful staff. Dr Hyer is exceptional!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "113230422394114295965", "name": "Brenda Bradford", "time": 1546566725435, "rating": 5.0, "text": "Love love love Dr. Bishop at Cahaba Medical Care!! She was so attentive, and caring! 💕", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "113458245567429051947", "name": "Ranea Hathcock", "time": 1564703537220, "rating": 5.0, "text": "Everyone is so nice and friendly, family like atmosphere", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "115391889793640740151", "name": "Kacey D", "time": 1504229889482, "rating": 5.0, "text": "Love everyone there. But, My doc is Shelley Waits and I absolutely love her to death and we will be moving to Birmingham with her!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "116070759614630878140", "name": "Sonja Dorough", "time": 1550067147745, "rating": 5.0, "text": "very satisfied with Cahaba Medical Care in Centreville, AL.  They always attend to my needs and the needs of my family.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "106064703265924891546", "name": "Tommy Ratcliff", "time": 1554769335921, "rating": 5.0, "text": "The staff was kind and helpful and would recommend them to others", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117945463471724604687", "name": "Terry Duncan", "time": 1558552353141, "rating": 2.0, "text": "There is no privacy and/or confidentiality. If you go here be aware that your medical problems and history will be discussed/known by the whole town.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "110585684388050854704", "name": "Tracie Tilley", "time": 1549158021780, "rating": 5.0, "text": "Been going here for years and they are always friendly, professional and caring.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "114417344357957402955", "name": "Toni Smith", "time": 1479323290561, "rating": 4.0, "text": "Love this place, doctors or great. And if you don't like that one doctor you can request another doctor.  They work with you if your on a limited income.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102799139982412493476", "name": "Deanna Lawley", "time": 1561939605673, "rating": 1.0, "text": "Should take a little more time when coming into the room to listen to what you're patient has to say,most dr actually sit down and talk with there patients not stand with there arms propped up and looking like your just ready to leave the room as soon as you enter.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "109510340810867433391", "name": "Ray Cameron", "time": 1565899829289, "rating": 5.0, "text": "Doctors and Staff are friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117787000489867803497", "name": "Sherry Holland", "time": 1569025248721, "rating": 5.0, "text": "They're always awesome and was able to squeeze my son in for an appointment when he was really sick", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "112161664116563876695", "name": "Andrea Hales", "time": 1489687830887, "rating": 4.0, "text": "They always try their best to help me out. If they can't do certain tests they refer you to someone who can. They will exercise everything possible to find the problem", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "114568470810551641907", "name": "Google User", "time": 1481083314252, "rating": 1.0, "text": "My regular Dr is never in so whenever I see another Dr I am always told I need to come back and see my regular Dr.  So yet again today was a waste of time and money. Please go somewhere else so you will get the care you need and deserve.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "113604569648211805580", "name": "John David Williamson", "time": 1488243783294, "rating": 5.0, "text": "Great doctors, great staff. Wonderful place to get medical care.", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "112975015683332015511", "name": "Emotional developent kids Taken From their mother", "time": 1565878215701, "rating": 3.0, "text": "Had some issues with fax no one could figure out what was going on finally had to call supervisor to find out she was a lot of help thanks susie", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "109243922468152155310", "name": "TyreAsia Gale", "time": 1551253896145, "rating": 5.0, "text": "Very caring health care providers!!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "107998988689533560158", "name": "Jason Stevens", "time": 1485840898669, "rating": 5.0, "text": "Excellent doctors providing quality health care", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "102348225579866560962", "name": "Geraldine Green", "time": 1557179354013, "rating": 1.0, "text": "Waited over a hour to have blood drawn...NOT happy!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "103179291396333064909", "name": "Amanda Seward", "time": 1490376938970, "rating": 5.0, "text": "Awesome staff awesome atmosphere..", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "117483858854775358968", "name": "Joseph Cox", "time": 1513614818642, "rating": 5.0, "text": "Quick and helpful - Thanks, Dr. Smith!", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "113248571446444248379", "name": "Google User", "time": 1477568484131, "rating": 1.0, "text": "This is not a real doctor's office they can only tell you if your sick My wife went and had very high blood pressure they didn't treat her because her doctor wasn't in told her to go home and lay down and rest what a joke of a place Maybe because she had real insurance and not Obamacare go to\nBrentwood Animal Hospital you will be treated better", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "101459448253979873473", "name": "William Seward", "time": 1481177861004, "rating": 5.0, "text": "Had a very good office visit", "pics": null, "resp": null, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
{"user_id": "106112128661068169378", "name": "Giovani Cano", "time": 1614644770268, "rating": 5.0, "text": "(Translated by Google) Excellent service, really professional people. !!!!\n\n(Original)\nExcelente servicio,  personas realmente profesionales.!!!!", "pics": null, "resp": {"time": 1614649023445, "text": "Thank you so much for your kind words, Giovani. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nCahaba Medical Care - Centreville"}, "gmap_id": "0x888f36ac02e46211:0x1c4bffcd211a26ec"}
