{"user_id": "100562186329956044322", "name": "Sarah Antonelli", "time": 1630075830265, "rating": 5.0, "text": "We had All Safe Inspections inspect four houses for us.  Doug was very timely, professional, and his reports were very detailed.  He did a great job.", "pics": null, "resp": {"time": 1630175154086, "text": "Thank you Sarah for the review and kind words."}, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "109629247999484870101", "name": "Malcolm Jacobs", "time": 1609371661922, "rating": 5.0, "text": "Very informative, Doug did a great job.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "115818931647662559323", "name": "Michael Matheny", "time": 1569588627230, "rating": 5.0, "text": "If you want thorough and professional service.....Doug is your guy. He works for the homeowners best interest and is safety conscience. I highly recommend him for all your inspection needs!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "102862379235376780378", "name": "Diesel Alegrand", "time": 1568410232276, "rating": 5.0, "text": "A big thank you to Chris for doing my home inspection. Chris was incredibly responding to The timing of the inspection and was very detailed. I would highly recommend using allsafe  services for your home Inspection. 👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "105121331409730241866", "name": "Christina Patterson", "time": 1559166647590, "rating": 5.0, "text": "Doug was \"hands down\" a great help with our home and structural inspections. He was very professional, thorough, prompt and kind. I highly recommend him to anyone. Thanks for all of your help.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "105804226500707038098", "name": "Al Bradford", "time": 1532442387610, "rating": 5.0, "text": "All Safe Inspections provided assistance in determining the condition of homes, under consideration for purchase, that would not be visible or identifiable to the buyer. Items were identified in either a positive or negative light for the buyer. Doug Thornton, inspector,chief was extremely easy to work with and made the inspection process clear and understandable. I will definitely recommend All Safe Inspections to all my friends and family desiring to purchase a home in the Montgomery, Alabama area.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "111072128514318301084", "name": "Rob Anderson", "time": 1538163870486, "rating": 5.0, "text": "Mr. Thornton was incredibly responsive to all my emails, very thorough, and priced reasonably. I would highly recommend using his services for your home inspection needs!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "107497760964233445597", "name": "Kayla J Brown", "time": 1532536122212, "rating": 5.0, "text": "I was referred to use Doug Thornton as my home inspector by a coworker and was not disappointed. He was very thorough in his report and helped me negotiate items to be fixed in my home before purchase. Definitely would recommend him!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "112436989812886881297", "name": "Hannah Thornton", "time": 1569637598705, "rating": 5.0, "text": "Best inspector your find in the tri-county area!", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "108270056495968577919", "name": "J M", "time": 1566263011568, "rating": 5.0, "text": "We've used this company for several homes. Very thorough and complete with aerial pics.", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "109711361592251142133", "name": "Alicia Da Twincesses Mommy", "time": 1526745589233, "rating": 5.0, "text": "Friendly, Detailed, and Thorough", "pics": null, "resp": null, "gmap_id": "0x888c2980a9135641:0xfa1463ebdf52a295"}
{"user_id": "117654515076987398610", "name": "Haley Coltharp", "time": 1627397205834, "rating": 5.0, "text": "Great experience with Riaan inspecting our house. HIGHLY RECOMMEND!! Professional and timely.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112344829251245289863", "name": "Connie Pugh", "time": 1629128067490, "rating": 5.0, "text": "Thank you for your SERVICE. I will follow up as suggested before doing any further testing.\nYour services were Excellently provided, and beyond HELPFUL!!!\n\"Your quality of services and professional qualities are extremely hard to find these days!!!\"\nThank you. Connie Pugh", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103456969172649054439", "name": "Lori Nettleingham", "time": 1618267427556, "rating": 5.0, "text": "One of the most detailed and thorough home inspections I have ever had done. The report was completed within hours of inspection being done. Pictures helped to explain potential issues. Very easy to understand.  Excellent job. Would not hesitate to use again.", "pics": null, "resp": {"time": 1619435041330, "text": "Thank you so very much! It was a pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104334990006671570595", "name": "Melanie Shong Helm", "time": 1619376483950, "rating": 5.0, "text": "Quality, thoroughness, exceptional use of technology and expertise on inspecting new roof for leaks, water intrusions and thermal imaging as well as new construction. I called and the very next day he was out to my home. He spent over 3.5 hours looking at every concern I had. He was not biased either toward me or toward the original contractor- he was honest - based on knowledge and skill. I would not hesitate to recommend or use his services again!!", "pics": null, "resp": {"time": 1619434976787, "text": "Thank you so very much for taking the time to review us! We really appreciate it and it was a pleasure working with you!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112051721162388191003", "name": "Charise Barlow", "time": 1621278950419, "rating": 5.0, "text": "Hired this company to do a pre-purchase inspection after a recommendation from a colleague. Scheduling the inspection was easy to do. The site was clear and easy to understand. Super professional and delivered a fantastically detailed report same day. 10 out of 10 would highly recommend.", "pics": null, "resp": {"time": 1624754522095, "text": "Thank you so very much for taking the time to share your experience. It is greatly appreciated and we wish you all the very best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102687400650900743745", "name": "David McCune", "time": 1619633822853, "rating": 5.0, "text": "Great experience with Home Boss/Riann. Showed up on time. He was very thorough in his inspection.  The report was emailed to me within an hour after the inspection was finished. I will now be able to make an informed decision as to whether to buy this house and feel confident in my decision.", "pics": null, "resp": {"time": 1619785162185, "text": "Thank you so very much Mr.McCune for taking the time to leave us a review. We really appreciate it and it was a pleasure conducting your inspection. Wishing you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "110396343362163884057", "name": "vicky Harris", "time": 1624163367417, "rating": 5.0, "text": "Riaan answered all my questions quickly and thoroughly.  Excellent service!", "pics": null, "resp": {"time": 1624754219744, "text": "Thank you so very much for taking the time to review our service. It was pleasure doing your inspection and we wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117994935870514988181", "name": "Gabriel De Moske", "time": 1628622342597, "rating": 5.0, "text": "Highly recommended on all aspects of service. Had a short closing date and was able to schedule an inspection quickly on the company's online scheduler. Inspection was very thorough, the inspector allowed us to be present, and went over the report in-person, which not all inspectors will do. This allowed me to look at the flagged issues with the inspector present instead of trying to find the locations myself or just looking at a photo. Inspector advised me that an extra service I had paid for in advance was not necessary and refunded the extra charge.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115277465908155636079", "name": "Jefferson P Mostellar", "time": 1624051547104, "rating": 5.0, "text": "Riaan was Awesome! He was very thorough and professional. Would use again and highly recommend!", "pics": null, "resp": {"time": 1624754276352, "text": "Mr.Mostellar. Thank you so much for taking the time to share your experience. I is greatly appreciated. We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115283524921437738210", "name": "Randolph Young", "time": 1627505325476, "rating": 5.0, "text": "He is by far the most thorough, paying attention to every detail. If buying a home or even selling, you can’t go wrong using Home Boss.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104002021948195748732", "name": "Kent Sumrall", "time": 1618341637404, "rating": 5.0, "text": "Riaan was great. Communication was clear, service was courteous, inspection was thorough and final report was a huge asset during the home sale transaction. He also took the time to verbally explain the issues in lay language.  Highly recommend him.", "pics": null, "resp": {"time": 1619435018882, "text": "Thank you so very much! It was pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101802334317426087366", "name": "Ben Kaminsky", "time": 1615740333864, "rating": 5.0, "text": "This was my first time using Home Boss for a home inspection. They were competitively priced and offered a very thorough inspection with a great detailed report the same day. They were on time and worked efficiently to complete the inspection in a tight time window. I particularly liked the use of a moisture meter and laser thermometer to accurately measure moisture levels and temperatures of various systems and points around the house. They throughly inspected the attic and even walked the entire roof. All points of concern and interest were clearly documented with pictures and verbiage to ensure clarity. All major systems were also accurately measured and assessed with pictures and ages provided. Very impressed and I would highly recommend!", "pics": null, "resp": {"time": 1615745263671, "text": "Thank you very much Mr.Kaminsky. Great appreciate the review and it was a pleasure conducting your inspection"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103840872481049601733", "name": "brian entrekin", "time": 1619444231945, "rating": 5.0, "text": "Riaan did an excellent job with our home inspection.  I would highly recommend using him for your home inspection.  It was a thorough inspection and helpful for us to make a home purchase decision.\n\nBrian", "pics": null, "resp": {"time": 1619492325106, "text": "Thank you so much! It was a pleasure doing your inspection and I wish you all the best"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116896122260044283748", "name": "Amanda Webb", "time": 1620147812835, "rating": 5.0, "text": "Riaan came out and did an inspection on a property we are buying. He was extremely thorough and provided a detailed description with an amazingly fast turn around!! HIGHLY RECOMMEND!!", "pics": null, "resp": {"time": 1620148493991, "text": "Thank you so very much Mrs.Webb. We greatly appreciate that you took the time to leave us a review! We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117780807445193071023", "name": "Ron Jaster", "time": 1617098154876, "rating": 5.0, "text": "Home Boss report was exceptionally detail with pictures of every minor issue as well so that I can fix each item.  He was thorough and excessible to answer all my questions.  Highly recommended.", "pics": null, "resp": {"time": 1617157601254, "text": "Thank you so very much! It was a pleasure conducting your inspection and we wish you all the success going forward!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115651896604835717124", "name": "Connor Hubbard", "time": 1626875029372, "rating": 5.0, "text": "Riaan is my go to for home inspections. I've used him for two different homes now and working with him is extremely pleasant. He is great at communicating, he does high quality work, he is very affordable, and all and all just a quality hard working guy. If you need a home inspection in the Mobile County area, Riaan is the man for the job.", "pics": null, "resp": {"time": 1626875712889, "text": "Connor! Thank you Sir! I’ve enjoyed working with you! I wish you all the best going forward!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101287226958044403653", "name": "Kristen Sarowski", "time": 1627393982935, "rating": 5.0, "text": "Riaan was prompt and efficient. He was very friendly and explained everything he was doing and all of his findings and made sure I understood everything. His report was delivered the same day, as promised, and his prices were very reasonable. I absolutely recommend him and will use him again, if I need another home inspection.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112277397755465418932", "name": "Chris Fuchs", "time": 1622911182678, "rating": 5.0, "text": "Riaan did a fantastic job inspecting our new house! He really took his time and went above and beyond. Highly recommend!", "pics": null, "resp": {"time": 1624754358305, "text": "Mr.Fuchs. Thank you for taking the time to share your experience. It is greatly appreciated and we wish you and Mrs.Fuchs the very best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112213484904213333323", "name": "Joseph Cormier", "time": 1625624860655, "rating": 5.0, "text": "Top-notch service, extremely thorough inspection and a report of his findings was submitted to me almost immediately upon finishing the inspection. Given price, service and dependability I would very highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102217406576994318074", "name": "Virginia M. O'Brien", "time": 1615815973305, "rating": 5.0, "text": "Riaan with Home Boss was extremely thorough and excellent to work with. He stayed well after business hours to go over every inch of the house we were looking to purchase. He was very helpful and knowledgeable and I would recommend him to everybody", "pics": null, "resp": {"time": 1616434649881, "text": "Thank you so very much! It was a pleasure doing your inspection and we wish you all the best for the future."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103759072201698711268", "name": "Danielle Deak", "time": 1617477991935, "rating": 5.0, "text": "Riaan did a very thorough job.  He really took the time to explain his findings.  Would definitely use again.", "pics": null, "resp": {"time": 1617478651901, "text": "Thank you covert much! It was a pleasure doing your inspection and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "107479134737157309021", "name": "Steve Chumney", "time": 1624705709730, "rating": 5.0, "text": "Riaan’s inspection was top notch, thorough and the best I’ve ever seen. He answered every question with sincerity, passion and very professional at all times. I’ll definitely will be using Riaan again for future businesses.", "pics": null, "resp": {"time": 1624754070885, "text": "Mr.Chumney. Thank you so much for taking the time to share your experience. It is greatly appreciated. We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104758390435307751300", "name": "Kelly Smithson", "time": 1619789622478, "rating": 5.0, "text": "Provided very extensive and informative report for our home inspection. Would definitely use again!", "pics": null, "resp": {"time": 1619955884105, "text": "Thank you so very much! It was a pleasure conducting your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "108503384766192151644", "name": "M Hof", "time": 1616174149135, "rating": 5.0, "text": "First rate inspection.  Very thorough.  Shared results of inspection  on site then emailed a copy of the report.  very satisfied.  Mr. du Plessis was on time and took the time to do a proper job then shard with us the results", "pics": null, "resp": {"time": 1616434609640, "text": "Thank you so very much! It was a pleasure conducting your inspection and we wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "108472381069353244772", "name": "Racheal Harold", "time": 1604697156002, "rating": 5.0, "text": "Home Boss did a very thorough job of inspecting the property I was looking into buying. Took lots of pictures and made sure to have all the details written down. Was available for any questions about the inspection. I have had multiple friends who bought a house and said their inspection wasn’t as thorough or good. So I am 100% satisfied and would suggest any of my friends to use Home Boss.", "pics": null, "resp": {"time": 1604697876037, "text": "Mrs. Harold, we thank you so much for taking the time in reviewing our service and it was a pleasure doing your inspection. We wish you and your family everything of the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111853673525320494827", "name": "Jonathan Threlkeld", "time": 1625178294550, "rating": 5.0, "text": "Riaan was fantastic! Very thorough and professional. He took his time to explain everything to us and made sure we were informed in every step of the process. Would definitely use his services again in the future and I highly recommend him to anyone needing an inspection.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104992527825631061711", "name": "Danny Hilburn", "time": 1616619132656, "rating": 5.0, "text": "Riaan did an amazing job for us.  He was incredibly thorough and his report gave us the opportunity to have several items repaired prior to closing.  The repairs were well more than the cost of the inspection, so the value provided was fantastic.  I would absolutely work with Riaan again and will be referring him to my friends moving into town this summer.  Thanks!", "pics": null, "resp": {"time": 1617023647927, "text": "Thank you so very much Mr.Hilburn! It was pleasure doing your inspection and we wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104678443301418133901", "name": "Gary Burgess", "time": 1620238563489, "rating": 5.0, "text": "I have used Riaan twice for prepurchase home inspections. He is an excellent, thorough and professional home inspector. He has saved me thousands of dollars through his analysis of existing and potential problems. His reports are very concise and were recieved the same day. I recommend his services highly.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111081687777941772334", "name": "Samuel Barber", "time": 1626096037117, "rating": 5.0, "text": "Riaan was timely, professional, and personable. He takes the time to show you every detail you may be concerned about when purchasing a home. I highly recommend his services, he is easy to work with and I feel confident about the inspection he performed. He is honest, will give you an educated assessment of the property, and won't hold anything back at the expense of the seller. If you get his services, he will do his job. 10/10 without a doubt.", "pics": null, "resp": {"time": 1626105258659, "text": "Thank you so very much for taking the time to review our service. We really appreciate it and it was great working with you! We wish you and your family all the very best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "107272448528027030355", "name": "Finaldy Gmail", "time": 1624766828542, "rating": 4.0, "text": "Diligent work. True professionals. Will use them again.", "pics": null, "resp": {"time": 1620925743164, "text": "Thank you so very much! It was a pleasure doing your inspections."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114972571366280989215", "name": "Evan Jones", "time": 1620395052283, "rating": 5.0, "text": "Wish I could give more stars.....  Mr Riann Duplesis did a very detailed inspection on home i was gonna purchase, sadly I back out because of the deficiencies he found. He saved me a ton problems and I would recommend any and everyone for Home Boss services... current looking for another home to purchase and I will request Mr. Riann again for my inspection", "pics": null, "resp": {"time": 1620431146180, "text": "Thank you so very much for taking the time to review our services. It was pleasure doing your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116949229397206104118", "name": "donald best", "time": 1610511602362, "rating": 5.0, "text": "We used Home Boss of Mobile County recently twice after recent property investments. The inspector, Riaan was prompt, professional and by far the most thorough inspector I have come across. He was able to crawl into a very tight crawl space and located a very serious structure issue we had no idea was there. I just can't say enough about this company. 100 stars!", "pics": null, "resp": {"time": 1610513287425, "text": "Thank you so very much. It was a pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101412146789069549962", "name": "Sushil Monteiro-Pai", "time": 1614714808249, "rating": 5.0, "text": "Inspected a home I am buying. Did an awesome job, very meticulous and spent a good 4 hours for approx 2100 sq feet. Very sattisfied.", "pics": null, "resp": {"time": 1619435061633, "text": "Thank you so very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "108263086365924883837", "name": "LeAnne Bolton", "time": 1608388733259, "rating": 5.0, "text": "They provide prompt,  professional service. I’m a first time home buyer and Riann made the home inspection process a breeze. He took the time to explain everything to me and provided a very thorough written report (within an hour or so of the actual inspection). 10/10 recommend", "pics": null, "resp": {"time": 1608413665514, "text": "Thank you so very much for taking the time to write a review. We really appreciate it and it was a pleasure doing your inspection. We wish you all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103765356306928833416", "name": "Caryn Lott", "time": 1613329471448, "rating": 5.0, "text": "We had a great experience with Home Boss, very detailed and quick to get us our report. Highly recommend!!", "pics": null, "resp": {"time": 1613390960716, "text": "Thank you so very much Mrs.Lott for taking the time to leave us a review. It is greatly appreciated and it was a pleasure doing your inspection! We wish you and and Mr.Lott all the best!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "110766541720874916556", "name": "Ali Raza", "time": 1612530399825, "rating": 5.0, "text": "Very thorough inspection of commercial property  and detailed report.  Highly recommend!", "pics": null, "resp": {"time": 1612539622085, "text": "Thank you Mr.Raza. It was a pleasure doing your inspection."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115530814440838385482", "name": "mike b", "time": 1608236281827, "rating": 5.0, "text": "Riaan was awesome! He was punctual, friendly, communicative and very thorough. I would 100% recommend him for any home inspections needs!", "pics": null, "resp": {"time": 1608243846165, "text": "Thank you for taking the time in reviewing our service. It was our pleasure doing your inspection and I really enjoyed our conversation in the attic😎. Congratulations on a great Home."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "113616867725975797873", "name": "Brittany Schroeder", "time": 1601744720980, "rating": 5.0, "text": "Riann was incredibly helpful and professional. I had him do a home inspection for a home I am purchasing and he not only provided a thorough inspection at a good price, but also provided pictures and was available to answer any questions I had on spot whenever I called him. I then asked for a reinspection after a hurricane hit during the buying process and he was able to do that for an even more reasonable price and was incredibly thorough and helpful then as well. I had a great experience that felt personal and thoughtful and would recommend him to anyone in need.", "pics": null, "resp": {"time": 1601750589834, "text": "Brittany, thank you very much for taking the time to write a review. It is very much appreciated. We wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101681086516563263545", "name": "Stephanie James", "time": 1603304029272, "rating": 5.0, "text": "I experienced Great Customer Service from Home Boss Inspection, from the time that I made my initial request to the final report. Riaan was the inspector on site, he answered all of my questions. Very kind, thorough and polite! Would absolutely recommend!", "pics": null, "resp": {"time": 1603537905215, "text": "Thank you so very much Mrs.James for your kind words! We appreciate you taking the time to leave us a review! I love your house!!  It’s awesome!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114287050619161625191", "name": "Fran Haas", "time": 1608819311268, "rating": 5.0, "text": "I am extremely happy with the home inspection that was completed by Riaan at Home Boss. The inspection was very thorough and informative. Highly recommend Riaan for your home inspection needs.", "pics": null, "resp": {"time": 1608903745728, "text": "Thank you so very much Fran! It was a pleasure doing your home inspection and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "100605816895313515138", "name": "Reed Rogers", "time": 1604876316531, "rating": 5.0, "text": "Riaan was very detailed in his inspection and his reports look exceptional.  They are easy to read and they come in the same day as the inspection.  Riaan is very professional and knowledgeable!  Excellent job!", "pics": null, "resp": {"time": 1604883574605, "text": "Thank you Mr. Rogers for taking the time leaving us a review. We appreciate it very much and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "100913622620102850146", "name": "Andrea Birchfield", "time": 1603052169558, "rating": 5.0, "text": "Riann was extremely through and highly professional with my home inspection. Answered all my questions. Would definitely recommend.", "pics": null, "resp": {"time": 1603049253199, "text": "Thank you so much Andrea . It was a pleasure doing your inspection and congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111473811047584456867", "name": "Jody Cantey", "time": 1607567975817, "rating": 5.0, "text": "Riaan did a great job on our pre-purchase full home inspection. He spent hours in and out of the home giving us excellent information and confidence in our purchase!", "pics": null, "resp": {"time": 1607570102272, "text": "Thank you so very much for taking the time to write a review and we really appreciate it! Congratulations on a beautiful home and welcome to Alabama!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116365040613347993132", "name": "Deborah Tolbert", "time": 1601399415161, "rating": 5.0, "text": "Riaan is great to work with!  He provided a thorough and detailed report which we were looking for prior to renovating a home. Would highly recommend!", "pics": null, "resp": {"time": 1601400841811, "text": "Thank you so very much Deborah. It was a pleasure meeting you and I enjoyed working with you!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104611758935171263773", "name": "Seth Thomas", "time": 1596209651981, "rating": 5.0, "text": "Riaan was incredible! Was very prompt with updates and paid attention to details when inspecting my new home! Even went out for a follow up with the seller to show him what needed to be done. I will definitely use Home Boss in the future.", "pics": null, "resp": {"time": 1596214076613, "text": "Mr. Thomas thank you so very much for taking the time to leave a review! It was a pleasure doing your inspection and I love your new home! Congratulations!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111273631407967715128", "name": "Stephanie Manley", "time": 1595269248562, "rating": 5.0, "text": "Thank you Home Boss! Very, very thorough! If you want a quick inspection, this is not them. They take their time! The inspector even got on the roof and it was a 3 story home!!! So very impressed. Highly,highly recommend!!! Riaan is the best inspector there is!", "pics": null, "resp": {"time": 1595269934866, "text": "Thank you very much Mrs.Manley. Congratulations on a beautiful home!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "111962756695886699805", "name": "Courtney du Plessis", "time": 1595003905872, "rating": 5.0, "text": "Very professional and courteous.  Referred to other homeowners because the service  is top notch. Very thorough inspection and got the report same day. Highly recommend!", "pics": null, "resp": {"time": 1595013504702, "text": "Thank you very much for taking the time to write a review about your experience. Congratulations on your new home!!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "100779633776935103803", "name": "Mimi M", "time": 1603043312656, "rating": 5.0, "text": "Riaan was very responsive, very thorough and extremely helpful. HomeBoss came highly recommended by numerous people since we are new to the Eastern Shore area. We are very happy wi5 the results and 100% will recommend.", "pics": null, "resp": {"time": 1603049162824, "text": "Thank you so very much for taking the time to write a review. We appreciate it very much. It was a pleasure doing your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "107060435635694768926", "name": "stephanie powe", "time": 1591794685960, "rating": 5.0, "text": "I was very pleased with the details of my extremely thorough pre-purchase report. Both pictures and descriptions of potential issues were outlined throughout a very organized and easy to follow outline of each part of the home. Working on a tight timeline, I was elated to have my appointment and report delivered in such a timely manner. Excellent value for the work done. I can see Riaan's attention to even the smallest details. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104383841895248377437", "name": "Ryan McClaren", "time": 1595268573871, "rating": 5.0, "text": "This is my 3rd inspection with Home Boss of Mobile County. The inspector Riann(sp) is the most thorough and professional I have ever experienced and I use to be in real estate, so I have across many. There is nobody out there that does an inspection like they do. If you want to be sure you are making the correct investment, call them! Thank you so much Home Boss!!!", "pics": null, "resp": {"time": 1595269903020, "text": "Thank you so much! it was a pleasure doing your inspections!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116009501799102424753", "name": "Tate Marcinkowski", "time": 1593011273441, "rating": 5.0, "text": "The Home Boss team was amazing. They are incredibly knowledgeable and thorough. Just want you want when buying a new home.\nThank you Home Boss team,\nTate", "pics": null, "resp": {"time": 1593014959177, "text": "Thank you so much! It was our pleasure doing your inspection. We appreciate you taking the time and leaving us review!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "109630336829377150644", "name": "nrbnab", "time": 1614641206646, "rating": 5.0, "text": "On time and very thorough.", "pics": null, "resp": {"time": 1619955991296, "text": "Thank you so very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117301069661084503569", "name": "reacticorn life", "time": 1606765522100, "rating": 5.0, "text": "Very detailed. Awesome service", "pics": null, "resp": {"time": 1606777052375, "text": "Thank you so very much for taking the time leaving us a review. We really do appreciate it and it was a pleasure doing your inspection. Good luck with all your future endeavors."}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "109224734086100434095", "name": "James West", "time": 1590977152967, "rating": 5.0, "text": "We have purchased two homes, this is our third and this is the most thorough inspection that we've had. Professional, was able to do the inspection within 72 hours, because we were behind in our planning. Thank you Home Boss!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102387425628427595998", "name": "Jimmie Newton", "time": 1596746411784, "rating": 5.0, "text": "Riaan is the ultimate professional! He is extremely thorough, on time and is the expert in home inspections and testing!", "pics": null, "resp": {"time": 1596758649486, "text": "We appreciate you taking the time out of your day to leave us a review. We appreciate you very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "117816267794968952552", "name": "Barkley Gannon", "time": 1596550164228, "rating": 5.0, "text": "When it comes to home inspectinos, I highly reccomend Home Boss. Riaan is as professional as they come. His first priority is the care of the client.", "pics": null, "resp": {"time": 1596552256704, "text": "Thank you very much for taking the time to leave a review! We appreciate it very much!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102799636767441709335", "name": "Jeff Unfried", "time": 1617022353221, "rating": 5.0, "text": "Very timely and thorough", "pics": null, "resp": {"time": 1617023594503, "text": "Thank you Mr.Unfired. It was a pleasure doing your inspection. We wish you all the best for the future!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "116878066850820362353", "name": "Conyers Coupland", "time": 1594659488009, "rating": 5.0, "text": "Great detail and value. Recommend highly.", "pics": null, "resp": {"time": 1594663151757, "text": "Thank you so much. It was a pleasure doing your inspection. Congrats on a beautiful home"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "105269068346298469232", "name": "Warren Alexander", "time": 1597938559544, "rating": 5.0, "text": "riann was very proffesional and was very complete on his inspection!!!", "pics": null, "resp": {"time": 1598659674074, "text": "Thank you very much for taking the time to review us! It was a pleasure doing your inspection!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103432763156738430983", "name": "Brian Nichols", "time": 1574718726443, "rating": 5.0, "text": "Riaan is very thorough Home Inspector.  One of the best in the business. I highly recommend him. Very courteous and very professional.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "105171329057125211691", "name": "Nader Salibi", "time": 1574827240029, "rating": 5.0, "text": "Riaan is extremely professional and has excellent work ethics. Very punctual and prompt. Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103116957147123624100", "name": "Leigh Hill", "time": 1589210039109, "rating": 5.0, "text": "Riann was very thorough and answered all of my questions. I had the report the same day.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114253017092932881957", "name": "Ricky Armond", "time": 1589417867256, "rating": 5.0, "text": "Riian is very thorough and very professional and very down to earth highly recommend.", "pics": null, "resp": {"time": 1589421837436, "text": "Thank you so very much. It was a pleasure doing your inspection. Thank you for taking the time to write a review. It means a lot"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "114098075710437789329", "name": "Heather", "time": 1574958858038, "rating": 5.0, "text": "Riaan was very nice. He seems to know his stuff and is informative. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "102455454359048849912", "name": "Brent Nichols", "time": 1574719571638, "rating": 5.0, "text": "Would give 6 stars if I could.. Great Inspector", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "103625352959212237292", "name": "Carol Eppes", "time": 1574954676966, "rating": 5.0, "text": "These guys are top notch! I would not use anyone else!!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "104457668696561184301", "name": "Angela Jones", "time": 1587329708321, "rating": 5.0, "text": "Excellent communication and thorough inspection!", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "112349721231394061036", "name": "A Moore", "time": 1574720886109, "rating": 5.0, "text": "Highly recommend.... the accent is to die for...", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "115255835515989417821", "name": "Smooth Home Sales", "time": 1554301260799, "rating": 5.0, "text": "Excellent inspection Service, Highly Recommended", "pics": null, "resp": null, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "118216436091841939329", "name": "Rebecca Reibling", "time": 1594308931896, "rating": 5.0, "text": "Great Job", "pics": null, "resp": {"time": 1594315095702, "text": "Thank you so very much for taking the time to review our business!"}, "gmap_id": "0x889a3f9ad80f2b3d:0xb7f6da56c6cef17d"}
{"user_id": "101859268672020264920", "name": "mjwinal", "time": 1627215556391, "rating": 5.0, "text": "Called Adams Home Inspections to help with inspection for water intrusion, I could not locate source of intrusion.\nI was very pleased - as Russ was very helpful to locate & identify both source & cause, discussed several options for repair plan & cost estimates. Priced very reasonably, Russ was very professional, knowledgeable, and enjoyable to work with. Adams Inspections is 5-star inspection and I will definitely call again when needed.", "pics": null, "resp": null, "gmap_id": "0x88891f5000000001:0xf86f4ccc18d977f8"}
{"user_id": "108945532883774435203", "name": "Angela Armstrong", "time": 1453068465980, "rating": 5.0, "text": "Russ is very professional and extremely thorough. He is also very personable. He took the time to walk us through his inspection, explaining the major points and answered all our questions. His services are well worth the money! Would recommend him to anyone buying a home or office.", "pics": null, "resp": null, "gmap_id": "0x88891f5000000001:0xf86f4ccc18d977f8"}
{"user_id": "100183309559967745529", "name": "John Harbert", "time": 1456242559634, "rating": 5.0, "text": "Great professional service and on very short notice. I needed a home evaluated the day it went to market and I was unable to be there. He was on time, thorough and very professional. He was also flexible in giving me a quick opinion and overview over the phone before sending the full report with pictures. I would highly recommend Russ for any home inspection needs!", "pics": null, "resp": null, "gmap_id": "0x88891f5000000001:0xf86f4ccc18d977f8"}
{"user_id": "111141214621605640459", "name": "Robert M Taylor", "time": 1455581011714, "rating": 5.0, "text": "Great choice! Excellent website with very detailed information so I could make my choice of home inspectors. His comprehensive and very detailed inspection was thorough far beyond my expectations. His extensive knowledge and professional expertise allowed me to make knowledgable decisions and he was willing to take time to explains his findings. I will use him again and his prices was affordable.  And competitive.", "pics": null, "resp": null, "gmap_id": "0x88891f5000000001:0xf86f4ccc18d977f8"}
{"user_id": "100452165769725727520", "name": "Johnathan Johnson", "time": 1456323817648, "rating": 5.0, "text": "Professional and extremely thorough. It was a pleasure to work with Russ. I would recommend him to anyone needing a home inspection!", "pics": null, "resp": null, "gmap_id": "0x88891f5000000001:0xf86f4ccc18d977f8"}
{"user_id": "103561641192724642547", "name": "Steven Patterson (Realtor at eXp Realty)", "time": 1451796887915, "rating": 5.0, "text": "Great service. Russ came out on New Year's Day to inspect the home my wife Tatiana, and I are planning on buying. He did a very thorough job, and explained everything. He has some advanced technology to help him perform his work. We received our inspection report in less than a day, and it is very clear and easy to read. We are planning on using it to address some issues Russ found, when we speak with the builder. The price was very reasonable, and he offers an excellent guarantee on his work. I am a realtor with RealtySouth in Gardendale, and Russ is definitely on my list of people to refer when my clients need a professional.", "pics": null, "resp": null, "gmap_id": "0x88891f5000000001:0xf86f4ccc18d977f8"}
{"user_id": "113343094086521107594", "name": "Nancy Gonzalez", "time": 1624470137861, "rating": 5.0, "text": "We used Jason and Edmond as our home inspector twice already. They were extremely thorough, very knowledgeable and helpful. They educated us on what some issues can lead to. Both Jason and Edmond are very professional, kind and great at what they do. I strongly recommend them both! I was very pleased with their services. No matter how tight, dirty or high the area might be they need to inspect, you'll see them getting in or climbing up to get you the proper inspection!", "pics": null, "resp": {"time": 1624580510562, "text": "Nancy we appreciate you allowing us to help you with two inspections. We hope you enjoy your nee home and the memories ahead."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "114324545732787263159", "name": "Kimberly Francis", "time": 1626035638256, "rating": 5.0, "text": "Jason was very precise, and informative. He explained everything he found during the inspection, plus was able to show us pictures of the areas of concern. He took the time to explain the problem areas, and things to watch for in the future. We received the report within 20 minutes of leaving the home we are purchasing . I would highly recommend Jason, and would definitely use him again.", "pics": null, "resp": {"time": 1627082081466, "text": "Kimberly I appreciate you taking the time to leave that review. I enjoyed taking care of your home inspection and meeting you. Congratulations on your home"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "112349856570044844122", "name": "Martin Taylor", "time": 1627315865192, "rating": 5.0, "text": "On time, quick, and thorough. After four home purchases in the last 10 years, this was the easiest inspection process I’ve experienced.", "pics": null, "resp": {"time": 1627520305288, "text": "I greatly appreciate the great review martin. It was pleasure to earn your business"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "114541806676739880299", "name": "Thomas Cernota", "time": 1625192044941, "rating": 5.0, "text": "Jason did a thorough real estate inspection of the Condo we planned to purchase. The inspection report was provided to us within 2 hours of the inspection. We had questions on items in the inspection report and were able to contact Jason directly to discuss. I highly recommend using National Property Inspections Birmingham.", "pics": null, "resp": {"time": 1625193111933, "text": "Thomas thank you and hope you enjoy the condo. It was a pleasure speaking with you. Let me know if you have any further questions."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "113049862876432034689", "name": "Matthew Rowley", "time": 1624376837783, "rating": 5.0, "text": "They provided a buyers inspection for a home I am going to be buying.  They were very prompt with generating the report and more importantly they made themselves available to go over the full report with me over the phone.  I was able to ask a ton of questions and get answers so that I was comfortable moving forward with the purchase.  Excellent experience.", "pics": null, "resp": {"time": 1624580367847, "text": "Matthew thanks so much for that great review and feedback. It was great speaking with you and congratulations on your new home"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "104149746561447267743", "name": "auburnrn2003", "time": 1623883761091, "rating": 5.0, "text": "He gave a great report with pictures and explained it all. Really responsive. A lot of detail. Program he used allows you to make a list of things you want to ask to have fixed. Highly recommend!", "pics": null, "resp": {"time": 1624201131697, "text": "Thank you for your great feedback and we appreciated being able to assist you during your home buying process."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "116581797894571054500", "name": "Casimiro Ivan Madarang", "time": 1614349627347, "rating": 5.0, "text": "I am impressed with Jason’s attention to details during the home inspection.  He inspected an older home with a crawl space and he addressed all concerns on safety and maintenance thoroughly.   He took time in explaining his report on the same day.     I also liked how it was easy to send a repair request through the ‘e-report’.   He was professional to answer my call later that day to finish the discussion of the report.   I will highly recommend Jason.", "pics": null, "resp": {"time": 1614434835824, "text": "Casimiro it was pleasure meeting you. We appreciate your trust in us to handle a big decision in purchasing a home and if you ever have any questions or need another property inspected please let us know."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "118019708579087670387", "name": "Pam LaGrone", "time": 1624732650132, "rating": 5.0, "text": "Pre-purchase inspection. Jason arrived early and was thorough with his inspection. He noted things we had observed and many we hadn’t. He spent time with us going over his report and showing us different concerns when he finished his inspection. We had his final report with pictures within an hour.", "pics": null, "resp": {"time": 1624844519716, "text": "Thank you pam for your feedback and i appreciate the opportunity to earn your business."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "117810108623501712420", "name": "Robert Bryant", "time": 1616016412118, "rating": 5.0, "text": "Jason did an amazing job! He was extremely thorough and detailed with his work. The knowledge, professionalism, and courtesy he treated me and my wife with was above and beyond anything we ever expected. We would recommend this company's business to anyone that need their services.", "pics": null, "resp": {"time": 1616071239500, "text": "Thank you robert. I appreciate the feedback and it was great to meet you and your wife. If you need anything don’t hesitate to call."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "117169274305201162227", "name": "Victoria Fitzgerald", "time": 1616170669875, "rating": 5.0, "text": "Jason responded to our request for a pre-purchase inspection within the afternoon and conducted the inspection the next day. He was thorough and timely, the best part is his website is set up to be super user friendly and displays detailed Findings including pictures and explanations. He categorized them so you know immediately how many safety issues vs maintenance issues you might have in your potential new home and you can export the concerns directly into an email for negotiation between buyer and seller or their agents. Fantastic service and interface! I recommend him to everyone who is buying a home in the Birmingham, Hoover area!", "pics": null, "resp": {"time": 1616638806879, "text": "Victoria thank you for this great feedback. We are glad you enjoyed the NPI experience. It was great to meet you and hope you enjoy your new home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "107229067839548799314", "name": "Darby Nash", "time": 1621127006014, "rating": 5.0, "text": "Jason at NPI is reliable and a great home inspector. I have used his services twice when under contract on two houses. Thanks to Jason, I was able to easily negotiate and plan accordingly.", "pics": null, "resp": {"time": 1621692654122, "text": "Darby i appreciate it and glad you were able to find a home in this crazy market. Thanks for allowing us the opportunity twice to assist with your purchase"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "114600029331621613616", "name": "Cori Williams", "time": 1618248200490, "rating": 5.0, "text": "Jason was wonderful on the inspection! He was very helpful to explain what everything meant and answered all of our questions we had. He followed up right away! I would highly recommend National Property Inspections!", "pics": null, "resp": {"time": 1619185883048, "text": "Thank you Cor! We appreciate the feedback and allowing us to be a part of your hone buying process."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "111898144452494225982", "name": "Ashley D", "time": 1623529139277, "rating": 5.0, "text": "I was impressed by the professionalism and quality of service. I will definitely be recommending them and using them in the future", "pics": null, "resp": {"time": 1623553383394, "text": "Thank you ashley for taking the time to review us. We appreciate your business and it was a pleasure meeting you."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "101941824896638488692", "name": "Susan", "time": 1626406407917, "rating": 5.0, "text": "Very professional and detailed report. Highly recommend!", "pics": null, "resp": {"time": 1627082121992, "text": "Thank you susan we greatly appreciate your business."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "111909026347124300719", "name": "Manas M", "time": 1613056910583, "rating": 5.0, "text": "Jason did an excellent job of inspecting a property for us which we have never seen personally. He covered all aspects of the house and took ample photos to give us a good idea of what repairs/fixups are needed.\nHe was timely and very responsive to all questions we had during and after the inspection.\nDefinitely recommend to anyone looking for a reliable and responsive home inspector.", "pics": null, "resp": {"time": 1613083409767, "text": "Mana I appreciate that great feedback and hate we didn’t get to meet in person. If you ever have any questions please give me a call."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "113268674987615285720", "name": "r&k almgren", "time": 1615079934799, "rating": 5.0, "text": "We are relocated from Washington to Birmingham and when we decided on a house to purchase, NPI (specifically Jason) was able to do a very thorough inspection of the residence in less than 24 hours and outside their normal working hours.  Jason was very flexible to an early morning inspection; he covered the report with us and answered all our questions and concerns;  but above all he was very professional and friendly throughout the process.  The report was easy to navigate and the recommendations coincided with what was seen and explained to us by Jason.  We would highly recommend NPI and Jason to anybody purchasing a new home or needing a professional home inspection.", "pics": null, "resp": {"time": 1615139742858, "text": "Robert was great to meet you and your wife and inspect the beautiful home. Hope y’all enjoy your new home and the many memories to come. Safe travels during your move."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "116169403672316613260", "name": "Brad Carpenter", "time": 1623540800982, "rating": 5.0, "text": "Jason and his team are thorough and professional, exactly what you want when purchasing a home.", "pics": null, "resp": {"time": 1623553320575, "text": "Brad we appreciate your feedback and it was great to meet you. Thanks for allowing us the opportunity to assist with your home purchase"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "101895446164351401353", "name": "Zac Bowen", "time": 1615914215660, "rating": 5.0, "text": "I had my home inspected by NPI Birmingham and was incredibly impressed with the service I received. The inspection was thorough and the report is incredibly well laid out and available online very soon after the inspection was completed. At the inspection Jason went over the report in great detail and explained everything that I did not understand (as a first time home buyer this was quite a few of the items).\n\nAdditionally, there were multiple delays in the construction of my home that required the inspection date to be delayed multiple times (some with _very_ little notice). Jason was incredibly patient with us and his flexibility allowed us to get the inspection and necessary repairs done without having to delay the closing date yet again.\n\nIf I ever need another inspection done on a home in the Birmingham area I will be using NPI Birmingham again!", "pics": null, "resp": {"time": 1616071027909, "text": "Zac I appreciate the great review. I’m glad you finally get to move in. Great house in a great area. Congratulations on your first home!"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "117688346391681555818", "name": "Hailey Payne", "time": 1618373640019, "rating": 5.0, "text": "Jason was great. He checked out everything and made appropriate recommendations", "pics": null, "resp": {"time": 1619185958497, "text": "Thank you hailey for taking the time to review. It was a pleasure meeting you."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "104343331847549955310", "name": "Holly Fitz", "time": 1623687503835, "rating": 5.0, "text": "NPI performed a Radon Test on short notice for a home purchase. Very professional and great service.", "pics": null, "resp": {"time": 1623688287637, "text": "Thank you holly for your review and congratulations on the purchase of your home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "101069104923841144628", "name": "Michaele Hooper", "time": 1612228941747, "rating": 5.0, "text": "Jason did a great job explaining everything that needed work before I purchased the home. My schedule changed and I had to reschedule our appointment and he was able to work with me. Will use him again if need be.", "pics": null, "resp": {"time": 1612298789579, "text": "Michaele it was a pleasure meeting you having the opportunity to help you during the home buying process. We love to help in the future if needed. Thank you"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "112166646851509237102", "name": "Wyatt Young", "time": 1607999282261, "rating": 5.0, "text": "Jason was awesome.  He had clear and excellent communication both before, during and after the inspection.  The report was well put together and easy to use.  I would contact him again for an inspection without hesitation.", "pics": null, "resp": {"time": 1608609278067, "text": "Thanks again Wyatt for your reviews. It was great meeting your family and hope you enjoy your new home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105780509635555709058", "name": "Victor Darley", "time": 1615559634748, "rating": 5.0, "text": "Outstanding service within 24 hours. Knowledgeable, professional and very thorough-great help in making decisions about the property.", "pics": null, "resp": {"time": 1615591648579, "text": "Thank you victor for the opportunity and appreciate you taking them time to leave us a review. Let us know if we can be of any service in the future."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "103694339064825927625", "name": "Jeff Fortenberry", "time": 1614653430678, "rating": 5.0, "text": "Performed pre-purchase inspections on two different properties. Great work! Detailed and very helpful!", "pics": null, "resp": {"time": 1614813786640, "text": "It was great seeing you again and honored we got to assist you with another inspection. Thanks for taking the time to leave a review. We appreciate it."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "112794025817197730943", "name": "Robert Werner OG", "time": 1617321423921, "rating": 5.0, "text": "Had an inspection of condo I'm buying and the inspection was very good. They found things I would never even have thought of.", "pics": null, "resp": {"time": 1618004357468, "text": "Thank you robert we appreciate the opportunity."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "114913486140903647057", "name": "Ellen Nabors", "time": 1603251839920, "rating": 5.0, "text": "We used Jason as our home inspector for a house we have under contract. His inspection was so thorough and informative. It was well written and easy to understand. Quality work for a great value. Will recommend this team to anyone needing an inspection.", "pics": null, "resp": {"time": 1603281653555, "text": "Ellen we appreciate the feedback. Thanks you for allowing us to inspect your home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105511536085597406722", "name": "Yvette Coutino", "time": 1603659332630, "rating": 5.0, "text": "Jason was the inspector for our new home. He was very thorough on explaining every detail of what he found during his inspection. I also really liked the app/site where I was able to see every detail of the inspection and further explanation on what needed to be fixed! I highly recommend Jason and his Team!", "pics": null, "resp": {"time": 1603667479370, "text": "Yvette it was great meeting you. Thank you so much for the feedback. We greatly appreciate your business."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "103346337335900303081", "name": "CARLOS SMITH", "time": 1617748652039, "rating": 5.0, "text": "I highly recommend National Property Inspection for anyone who’s looking for a thorough and professional inspection", "pics": null, "resp": {"time": 1618004386669, "text": "Carlos thank you and it was a pleasure meeting you"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "109536189184114112911", "name": "Rocky Brasseale", "time": 1597163353050, "rating": 5.0, "text": "Jason and his team are excellent home inspection service providers. He was thorough with his inspection, explaining every detail during the process. He answered all of our questions and concerns. Always on time and completed inspection in a timely manner. I would definitely recommend Jason to anyone in the market for a home inspection. Great experience and would definitely do business with again in the future.", "pics": null, "resp": {"time": 1597165593415, "text": "Rocky it was great meeting the both of you and being a part of your home buying process. Please let us know if we can ever assist you in the future."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "108500616582248366020", "name": "LMH", "time": 1596548716329, "rating": 5.0, "text": "Jason was great to work with. He was quick to schedule our inspection, quick to complete the inspection & very thorough with the work that he did. He made the process of home buying much easier by giving us a clear game plan of how to form the repair addendum. It was a pleasure to work with Jason & I would highly suggest him to anyone looking to purchase a house.", "pics": null, "resp": {"time": 1597098965411, "text": "Thank you so much for the review. We appreciate you taking the time to leave the review and the kind words. It was great meeting you and congratulations on the home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "106490021162946503007", "name": "Keren McElvy", "time": 1616973191164, "rating": 5.0, "text": "I was so impressed-very thorough and helpful!", "pics": null, "resp": {"time": 1617103678451, "text": "Keren thank you for your review. It was a pleasure meeting you. Let us know if we can assist in you in the future."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "116335681119980965753", "name": "Jennifer Hill", "time": 1594224911608, "rating": 5.0, "text": "We had a very good experience with Jason. He was very through with our home inspection although I do wish he had ran the dishwasher a full cycle, I realize that is probably not standard but perhaps should be. Overall we were very happy we chose NPI  and should the need arise will use them again also would  recommend them to everyone !!!", "pics": null, "resp": null, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105730226797469978906", "name": "Floyd May", "time": 1596983418138, "rating": 5.0, "text": "Jason Yarborough was great. Prompt and very informative. Did an excellent inspection. Went over all aspects of his inspection with my wife and myself. I definitely recommend his inspection service to every one.", "pics": null, "resp": {"time": 1596987504147, "text": "Thank you for your review Floyd and it was great to meet your family!"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "106519695231994731833", "name": "Jason Baker", "time": 1591922483173, "rating": 5.0, "text": "Cannot say enough about Jason and the NPI Birmingham team. He is one of the best inspectors in the area. His inspections and reports are FIRST class. Best of all, he is a fun person to work with. Highly recommend him for any and all inspection needs.", "pics": null, "resp": {"time": 1591928365882, "text": "Thanks Jason we appreciate your feedback. It was a pleasure meeting you and your family. Hope you and your family make many great memories in your beautiful home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105949082518556530428", "name": "Kelsey Qu", "time": 1604003647020, "rating": 5.0, "text": "Jason who inspected the house I was under contract to purchase was fantastic! He is very knowledgeable, very through, and I believe he had my best interest in mind. Definitely recommend to anyone who needs a home inspection!!!", "pics": null, "resp": {"time": 1604112343803, "text": "Thank you Kelsey for your kind words and our top priority is always our clients best interest. Hope you enjoy your new home and the many memories ahead."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "110257302334810107799", "name": "Teresa Tsui", "time": 1594226317398, "rating": 5.0, "text": "Excellent and thorough inspection. Jason took his time and was very diligent in his process. Explained the results and helped us make informed decisions based on his review.", "pics": null, "resp": {"time": 1592534835721, "text": "Thanks Teresa I appreciate your review."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105862120732217747940", "name": "Connie Bradford", "time": 1612546116578, "rating": 5.0, "text": "He were very professional and explain everything well!!", "pics": null, "resp": {"time": 1613083346653, "text": "Thank you Connie for the feedback. Please let anyone else know who needs inspection. Thank you for allowing us to help you during the home buying process."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "111814470186856447428", "name": "Patti Henderson", "time": 1579547065304, "rating": 5.0, "text": "Love working with Jason! He has done several home inspections for my clients - always on time - always thorough. Love his reports too - very easy to read AND they're \"interactive\" making it easy to send repair requests. The extra time and follow up he spends with my clients is above and beyond! On top of that, his prices are very fair!! I would highly recommend Jason!", "pics": null, "resp": {"time": 1579576770015, "text": "Patti I have thoroughly enjoyed working with each and every client you have sent our way. We appreciate your trust in us and can’t thank you enough."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "106612577696894529755", "name": "Thomas & Jennifer Pickard", "time": 1586204567567, "rating": 5.0, "text": "Jason was fantastic.  The inspection report was detailed and we received it in a timely manner.  Simply a pleasure to work with. Thank you Jason! I will be highly recommending you.", "pics": null, "resp": {"time": 1589685158093, "text": "I enjoyed meeting the both of you. Thank you for your business we greatly appreciate it."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105808076036912341035", "name": "Calvin Frazier", "time": 1581019088441, "rating": 5.0, "text": "Great guy-answers his phone and was able to get my inspection done same day-very professional and thorough. Took the time to answer LOTS of questions from my wife and I. Going to pay him to do follow up once items noted are repaired. GREAT communication.", "pics": null, "resp": {"time": 1581101693153, "text": "Calvin thank you for your kind words and great meeting you and your wife. You found a great home in the best area."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "110585645957706430389", "name": "Benjamin Hedden", "time": 1592321902546, "rating": 5.0, "text": "Jason is a very experienced inspector that has great prices. Jason not only does a great job on finding the potential problems but he gives explanations on how to solve the problems, which helps with peace of mind.\n\nI would recommend Jason to anyone in the Birmingham area.", "pics": null, "resp": {"time": 1592328789921, "text": "Benjamin it’s always a pleasure working wit you sir. Thanks for your kind words. Let me know if you ever have any questions."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "114563125993480962817", "name": "samantha jones", "time": 1602253917452, "rating": 5.0, "text": "Super professional, clear and detailed report of a thorough inspection. Highly recommend!", "pics": null, "resp": {"time": 1602263779015, "text": "Thank you Samantha, it was a pleasure to have the opportunity to earn your business."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "100075470343672960300", "name": "Jonathan Teesdale", "time": 1585530794556, "rating": 5.0, "text": "Jason is thorough and provides a great online report, which makes things so easy to communicate to your realtor and the seller. He went over the top to do a second inspection after many house repairs had been requested before closing. Thank you, Jason!", "pics": null, "resp": {"time": 1589684820445, "text": "Thanks Jonathan we appreciate the review. Sorry it took so long to get back to you but google just allowed the reviews to post. It was a pleasure working with you and congratulations on your home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "105437904688843795652", "name": "Shea Callahan", "time": 1578424916689, "rating": 5.0, "text": "Professional, thorough, exceptional service by Jason. He went above and beyond anything I have ever experienced when having a home inspected. Nothing to worry about with Jason. I highly recommend Jason and will only use him with any future inspections needed.", "pics": null, "resp": {"time": 1578425279888, "text": "Shea thank you for your kind words. It was a pleasure meeting you."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "113604834333024864431", "name": "Russell Shamburger", "time": 1588997888873, "rating": 5.0, "text": "Jason was great to work with. Very thorough in his inspection and offered insights to help bring awareness to issues. Also scheduled our pool inspection during the same time he was onsite.", "pics": null, "resp": {"time": 1590149310324, "text": "Thanks Russell for the feedback. The home was beautiful and a great area."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "112113522101076133081", "name": "Terrell Avery", "time": 1585518580932, "rating": 4.0, "text": "Jason was very helpful and professional. He really gave us some great advice about the results we had. Will be using him again.", "pics": null, "resp": {"time": 1590149426539, "text": "Thanks Terrell, congratulations on your new home"}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "115387062415130752974", "name": "Benjamin Nsiah", "time": 1584300126463, "rating": 5.0, "text": "I highly recommend this company and especially inspector Jason Yarbrough. This company uses the latest technology and inspection reports are very detailed. Mr Yarbrough showed up almost an hr earlier, did the inspection, and sat with me for more than one hr to explain to me every single item that he inspected. I was able to receive my inspection report just 15 minutes after completion.The report was so detailed that I plan on using the items he checked as guide for all my future repairs.", "pics": null, "resp": {"time": 1584304881449, "text": "I appreciate the review and the great feedback Benjamin. I hope you and your family make some great memories in the beautiful house you chose."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "115440096534042769176", "name": "Ryan Alvarez", "time": 1598968063669, "rating": 5.0, "text": "Mr. Jason was Very professional, and knowledgeable, he provided me with exceptional service, I highly recommend Mr. Jason.", "pics": null, "resp": {"time": 1596561774233, "text": "Thanks for all the kind words and a great referral."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "110586659176641743233", "name": "Victor Moncada", "time": 1583638655360, "rating": 5.0, "text": "Highly recommended, super professional, with previous bad experiences in purchasing a home that was not properly inspected, we are extremely please with Jason's job, his inspection let us know problems the property had we could not see or know without his help. His report was professional and easy to understand. A pleasure to work with him.", "pics": null, "resp": {"time": 1583645083403, "text": "Victor, I truly appreciate those kind words. We appreciate the opportunity to help with your investment."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "115594384278397426555", "name": "Ami Fritzemeier", "time": 1580760607972, "rating": 5.0, "text": "So pleased with such a thorough inspection. Answered all of our questions and showed us everything we needed to see! Will definitely use in the future if needed!", "pics": null, "resp": {"time": 1580777420990, "text": "Thank you Amy. It was a pleasure meeting you and congratulations on your new home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "107381488563847369859", "name": "Patsy Hartley", "time": 1584387187032, "rating": 5.0, "text": "Very thorough inspection from a professional. I feel much more relaxed about the quality of my home and feel that I won't miss any crucial problems.", "pics": null, "resp": {"time": 1584388833325, "text": "Thank you patsy for your review! We are glad you were happy with the inspection and that you have confidence in your home purchase moving forward."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "113222575617202506874", "name": "bryan miller", "time": 1603659691146, "rating": 5.0, "text": "Very thorough inspection on my recent home purchase", "pics": null, "resp": {"time": 1603667581529, "text": "Thank you Bryan. We appreciate you and the opportunity to earn your business. Enjoy your new home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "108254736033205077910", "name": "B Pruitt", "time": 1598029671964, "rating": 5.0, "text": "Jason was very thorough and professional. Thank you for your services", "pics": null, "resp": {"time": 1598053017202, "text": "Mr Pruitt I truly appreciate the kind words and it was a pleasure meeting you."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "109487738499828493835", "name": "Luke Seale", "time": 1585526159437, "rating": 5.0, "text": "Very thorough. Highly recommend their services for first-time home buyers!", "pics": null, "resp": {"time": 1589684900713, "text": "Thanks Luke, it was great to meet you. Enjoy your home and many memories ahead."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "101704242892409292128", "name": "Kelsea Nassif", "time": 1581362497698, "rating": 5.0, "text": "So easy. I've never had an inspector sit down with me and go through each item on the report. Jason was so helpful!", "pics": null, "resp": {"time": 1581373023092, "text": "Kelsea I hope you and your fur baby enjoy your new home. Don’t hesitate to call if you have any questions."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "109895456419844375728", "name": "Caleb Coffman", "time": 1578419815327, "rating": 5.0, "text": "Excellent attention to detail for a property inspection, responds fast, very professional. This is probably the best inspector/ inspection experience we’ve had in years.", "pics": null, "resp": {"time": 1578425158087, "text": "Thank you Caleb for taking the time to do a review and such kind words we greatly appreciate it. Congratulations on your home."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "101385359146308111570", "name": "Dana Walker", "time": 1587841581371, "rating": 5.0, "text": "Very professional and addressed every concern or question I had.  Knows his job throughly.", "pics": null, "resp": {"time": 1589685269596, "text": "Thank you Dana for your review. Enjoyed working with you."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "116505683302520052560", "name": "Cory Nichols", "time": 1583183552942, "rating": 5.0, "text": "Very happy. Jason did a very nice job checking everything in the home.", "pics": null, "resp": {"time": 1583196400459, "text": "Thanks Cory it was a pleasure meeting you. That was a beautiful home in a great area."}, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "107780674831128554531", "name": "JESSICA FULMER", "time": 1565016969606, "rating": 5.0, "text": "Professional, honest, and precise! Had a wonderful experience and would highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "115957882040265301899", "name": "Holly Thomason", "time": 1564960044516, "rating": 5.0, "text": "Great couple to work with! Super professional!", "pics": null, "resp": null, "gmap_id": "0x888941782c3a3a2b:0x7bf428c413982041"}
{"user_id": "107127727231377505165", "name": "James Shivers", "time": 1532466069445, "rating": 5.0, "text": "Super nice guy, excellent service, and very knowledgeable.  Kent walked me around during the home inspection and showed me exactly what he was looking for and why it was important, for a first time home buyer that was very beneficial.  Full report was provided to me the very next day with everything we went over. Very pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x888924095c16d943:0xcc5b31d642ded947"}
{"user_id": "104818768450478360464", "name": "Minela Rivera", "time": 1556911387230, "rating": 5.0, "text": "Kent is super nice, knowledgeable, works quickly and thoroughly and is competitive with pricing. I would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888924095c16d943:0xcc5b31d642ded947"}
{"user_id": "101918243766517396422", "name": "Alex Illas", "time": 1607861439705, "rating": 5.0, "text": "We used Alliance to inspect a home we wanted to purchase.  The whole team was kind, professional, thorough, and punctual.  Their reports were timely and easy to comprehend.   Extremely satisfied with Alliance.", "pics": null, "resp": {"time": 1607035437134, "text": "Thanks so much for your feedback Alex! Let us know if we can do anything else for you!"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "110236983598064080915", "name": "Stephean Grimes", "time": 1613509762459, "rating": 5.0, "text": "I have used Alliance for three inspections. Their team is very thorough with every aspect in the inspection process, and quick to deliver the full report.", "pics": null, "resp": {"time": 1607018962852, "text": "Hi Stephean,\nWe appreciate you and look forward to working with you in the future!  We appreciate you choosing AIS for your 3 inspections we have performed for you and an Air Quality Test.  Thank you very much for the kind 5 star review! Take care and stay safe!"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "106370402314901171701", "name": "William Tompkins", "time": 1557107477444, "rating": 5.0, "text": "The father and son team of home inspectors at Alliance Inspection Services (AIS) were very thorough and comprehensive in their inspection of the older home we are considering buying.   They took their time in explaining their findings and did so in a way that was clear and relatively easy to understand.  This was very important to us since neither my wife, nor I, are very knowledgeable about home appliances, electrical equipment, plumbing, heating, cooling systems, etc.    I would wholeheartedly recommend AIS to my friends and  family in need of a home inspection.  Outstanding !!  Thanks AIS.", "pics": null, "resp": {"time": 1557237380095, "text": "Thanks so much Mr. Tompkins!"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "105091915341715248329", "name": "Patty Bailey", "time": 1588867707847, "rating": 5.0, "text": "I love using Alliance! They are prompt, professional and perform a great inspection!", "pics": null, "resp": {"time": 1591117177084, "text": "Thank you so much Patty! We enjoy working with you as well and appreciate your business ethics.  You do care."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "101493358219150503723", "name": "Garrett Fine", "time": 1544474414452, "rating": 5.0, "text": "This is the 3rd home the Mears team has inspected for me. They have done a fantastic job in all 3 inspections! The reports are thorough with great photos so it is easy to understand and communicate any items found. They are prompt, friendly, and professional. Highly reccomended!", "pics": null, "resp": {"time": 1544475502887, "text": "Mr. Fine thank you for the positive review!  We appreciate you taking time to let us know. We are here for you if you need us.  Happy Holidays to you and your family! Bridget Mears"}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "114601732710259288924", "name": "Donna Taylor", "time": 1475695606361, "rating": 5.0, "text": "I have referred Steve and Bridgette to numerous clients that need a thorough home inspection (They inspected mine too).  They have always been in constant contact with me - even on Sunday!  I recommend Steve and Bridgette to anyone who is looking for a home inspection which is detailed and precise!  I also like the fact that they provide a Home Warranty of 18 months for the price of 12, and the Recall Check they provide.  You just can't go wrong having them on your side!", "pics": null, "resp": {"time": 1591117674275, "text": "Donna we thank you for the review and also working with your clients.  We hope you are doing well and staying safe."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "105706691395861902143", "name": "Jack Keeling", "time": 1520090021052, "rating": 5.0, "text": "Very professional and courteous in explaining what they were doing and what it meant. They did a very thorough job of checking everything. They were very nice people.", "pics": null, "resp": {"time": 1532965105606, "text": "Thank you Mr. Keeling!  We appreciate you.  Let us know if we can be of further service in the future."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
{"user_id": "102632414601158435958", "name": "Good Citizen (Good Citizen)", "time": 1556643074780, "rating": 2.0, "text": "Inspection report was good, process was fast and price was fair.\nHowever, they sell your phone number and you get calls day and night from security companies claiming to be partners with alliance.", "pics": null, "resp": {"time": 1556650720052, "text": "Thank you for the positive comment about our inspection, feedback is valuable to us. We apologize about the calls you are receiving and assure you we do not sell your information.  However, we do offer a free concierge service with vendors we represent that you may have opted in on. Please feel free to call us at 251-382-1653 so that we can assist removing you from this service."}, "gmap_id": "0x889a43346d646df7:0xa2632f28afe28865"}
