{"user_id": "110844249088221693702", "name": "KATRINA TIMMONS", "time": 1627065258502, "rating": 5.0, "text": "Ela is AMAZING!!! Shes patient and handled our 3 month old extremely well. Her set up is awesome and she pays attention to detail. She is definitely an expert in her craft and I STRONGLY recommend her for family photos. I will be booking with her again soon. :-)", "pics": null, "resp": {"time": 1627089170135, "text": "Thank you so much I really enjoyed your Beautiful family."}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "102107425186354908289", "name": "Brittany Jackson", "time": 1626053054858, "rating": 5.0, "text": "Jennifer was simply amazing!\nFrom the music to the hospitality to the talent as a photographer this experience was definitely a 5 star!\n\nI’m going to book with her again very soon I recommend you all do the same!!", "pics": null, "resp": {"time": 1626057957246, "text": "Thank you So much"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "118057519421241869547", "name": "Cecilia Sides", "time": 1626447498590, "rating": 5.0, "text": "Mrs Jennifer did an amazing job on my pictures and I loved the way she cooperates with me!!! She was so easy to talk to about anything concerning the pictures!!! We definitely did a great job on picking her to do my pictures I love them", "pics": null, "resp": {"time": 1626060578087, "text": "Thanks you"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "105886387353852636841", "name": "Jasmine Rogers", "time": 1619327047380, "rating": 5.0, "text": "Jennifer is so wonderful to work with. She is so professional and talented. I have never met such a wonderful beauty. She really makes you feel beautiful behind that lens. Always on time and respectful. I would book her always.😘", "pics": null, "resp": {"time": 1622172262005, "text": "Thank you Doing your photo shoot we had so much fun"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "107862265965270548263", "name": "Jay Mayne", "time": 1626119142775, "rating": 5.0, "text": "She was great with my daughter and very professional if you need photos and you don't use her your making a big mistake.", "pics": null, "resp": null, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "102111115247313298085", "name": "LaToya King", "time": 1628255250861, "rating": 5.0, "text": "Jennifer and her team are AMAZING! Very professional and efficient!", "pics": null, "resp": null, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "103129269729316538048", "name": "Armin Schevey", "time": 1612847948709, "rating": 5.0, "text": "ABSOLUTELY Wonderful photographer. She brings life to every moment she captures with her camera.  How does she do it? With her heart because she treats you like family.  Who better to capture the happy moments in life than family.", "pics": null, "resp": {"time": 1615517870953, "text": "Thanks you"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "108629329415181205291", "name": "Bonner Spradley", "time": 1612840984208, "rating": 5.0, "text": "She has to be the best photographer ii have ever worked with. My daughter will never smile in pictures but the pictures she took she was smiling in every single one. Fantastic job at a great price.", "pics": null, "resp": {"time": 1615517886025, "text": "Thanks you"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "107463963221632518805", "name": "C S", "time": 1615809116955, "rating": 4.0, "text": "Loved working with Jennifer. She was punctual for the event and delivered the photos promptly.", "pics": null, "resp": {"time": 1615894111638, "text": "Thanks you"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "102692608368680804372", "name": "Rita Hipps", "time": 1612842157853, "rating": 5.0, "text": "Jennifer does a great job she takes alot of pictures to make sure she gets the right pose it is always hard to pick the best one because they all turn out great!\nRita", "pics": null, "resp": {"time": 1615517861988, "text": "Thanks you so much"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "112404988241705832408", "name": "maryschevey Schevey", "time": 1612840917260, "rating": 5.0, "text": "Great Family pictures fast and friendly.", "pics": null, "resp": {"time": 1615517895625, "text": "Thanks you"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "108241541121313171353", "name": "Kayla Ellison", "time": 1612896435800, "rating": 5.0, "text": "takes the most beautiful pictures.", "pics": null, "resp": {"time": 1615517799457, "text": "Thanks you"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "117164876179075472477", "name": "Tanja Murphy", "time": 1624190106615, "rating": 5.0, "text": "Funny & fun!", "pics": null, "resp": {"time": 1615517820807, "text": "Thanks yes we had fun"}, "gmap_id": "0x888e8347d970337b:0x255d7daba38e7dae"}
{"user_id": "108337761754114165185", "name": "Kathrina O’Rear", "time": 1529665103427, "rating": 5.0, "text": "Daphne is amazing with my children and is so patient with my many requests. The quality of her work and the time she puts into it makes you feel like you are her only client. Highly recommended", "pics": null, "resp": {"time": 1529666129119, "text": "I love your babies Kathrina! And we love decorating your walls with their sweet smiles! Thank you!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "106297561396507338913", "name": "Amanda McDonald", "time": 1529581895234, "rating": 5.0, "text": "Daphne is amazing to work with. She is fantastic with newborns and very patient. I would highly recommend her!!! If you are on the fence about it, well don’t be. She also is very flexible and wants the customer to have a meaning experience. Her pictures turn out amazing, so book your session today!", "pics": null, "resp": {"time": 1529585337959, "text": "Thank you so much Amanda! I appreciate you trusting our studio with your sweet family!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "104486560424049856601", "name": "S C", "time": 1542529976429, "rating": 5.0, "text": "The Santa experience is the best ever! She had an “elf” greet my toddler at the door and walk her to Santa! It was so magical! Daphne is the best!", "pics": null, "resp": null, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "111540885788589919739", "name": "Destiny Patrick", "time": 1490709406468, "rating": 5.0, "text": "We love Ellenburg! Her work is absolutely astonishing. If you are look for top quality works of art, then look no farther.", "pics": null, "resp": null, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "102048349985298364345", "name": "Teresa Chapman", "time": 1527103201318, "rating": 5.0, "text": "Daphne is so professional and such a treat to work with!! She knows just how to capture the moment/personality through her photos.. She is absolutely the best!! Thank you for my awesome pics!!", "pics": null, "resp": {"time": 1527103871425, "text": "You are so welcome!! I love it when you stop by the studio :-) You need to bring me your NEW beautiful daughter!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "100464392156891343094", "name": "Monica Sprague", "time": 1529590307142, "rating": 5.0, "text": "I have nothing but good things to say about Ellenburg Photography! Daphne is so patient, especially with kids, and she is amazingly talented! She is always willing to go above and beyond to get that perfect portrait you want. She also provides a very clean and cozy environment in her studio! I have never been disappointed, and with that being said, I HIGHLY recommend her! 😊", "pics": null, "resp": {"time": 1529593318530, "text": "Thank you Monica! Kisses to little man from me ❤️"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "111453632459552564215", "name": "Ariel Chavez", "time": 1473350800010, "rating": 5.0, "text": "Daphne is an excellent photographer. Her studio is so inviting and perfect for those little ones. She is THE BEST baby photographer I know. She goes out of her way to make your pictures look wonderful. Professional work and great personality, highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "103696508086058400523", "name": "natholie parker", "time": 1529693022400, "rating": 5.0, "text": "Daphne is so sweet and does AMAZING work!!  WE LOVE DAPHNE!! She took our youngest daughter, Courtney's Senior Portraits, and they were incredible! She was so easy to work with, and she had wonderful props (hats, jewelry, etc.) to use if we wanted. From inside her studio, to going to downtown Mobile, you'll be glad you chose Ellenburg Photography!", "pics": null, "resp": {"time": 1529698630936, "text": "Thank you so much! I appreciate you Parker family!❤️"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "110473092366525305101", "name": "Evan AuCoin", "time": 1529582959835, "rating": 5.0, "text": "Daphne has been doing photographing my family for 2 years.  She has done 2 books from the delivery room to there first birthdays. It’s one of our most prized possessions that we own.  She’s always been super nice and very easy to talk to and get along with.  We love her and and encourage anyone who is thinking about getting photos made to definitely go see  Ellenburg Photography!!", "pics": null, "resp": {"time": 1529585460342, "text": "Thanks Evan! I love your family :-)"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "111648202607423882947", "name": "Shina Wilson", "time": 1521800306912, "rating": 5.0, "text": "Mrs. Daphne is the best, hands down! Our monthly package didn’t disappoint and our precious photos are wonderful memories that will last us a lifetime. I’m so thankful for her kindness and most of all her patience! Being new parents, she made everything super simple and enjoyable! I recommend her to anyone looking to capture a sweet moment in life to remember forever!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOSXlh3GvjstFCnD5aWNEA2vFbhtwEXQr_6GIui=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMlfy5Ak_Yzxmt0JJQmoojE44TNVU-55d_ZYWCM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOmz1wGfqncHNDEq44SmdPKjWEuK_F1W4I0LszC=w150-h150-k-no-p"]}], "resp": {"time": 1521803620845, "text": "Thank you so much Shina! Maya is a perfect doll. It was an honor to photograph her every Month during her first BIG Year!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "108532248353221307389", "name": "Amber Gatewood", "time": 1521794631006, "rating": 5.0, "text": "Daphne is absolutely wonderful and I wish we would’ve met her sooner to have even more wonderful portraits done! She was so great with our son, had a wonderful attitude throughout our session (and before and after!) and you can tell she truly loves what she does. I will most definitely be using Daphne for future professional photos! Everyone on my family thoroughly enjoyed the experience we had with her. A great attitude goes a long way. NO complaints at all about Mrs. Daphne! She made a somewhat stressful situation (because babies are so unpredictable) so easy. Plus, she has super cute props...even for boys!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPGHyeV9tlbF1ILxuYY9LR8VW8S_yMeSWioID3f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpl-SEH7qzn97FaYt8cuKY3X9k1u2RusLQWOXW=w150-h150-k-no-p"]}], "resp": {"time": 1521803537580, "text": "Thank you Amber for your kind words! Jacob is such a treat to photograph. Those chubby cheeks are the cutest!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "101534419599401789167", "name": "Kelly DeFord", "time": 1473293001580, "rating": 5.0, "text": "Daphne at Ellenburg Photography is 2nd to NONE!  She has changed the photography experience into something extraordinary.  With talents beyond a regular photographer she should be called a \"baby whisperer.\"  All of my girls love her.  No one but Daphne will ever photograph our family again! From the very moment my granddaughter breathed her first breath, Daphne has been recording her life.  She is a special kind of amazing. My family deserves her kind of perfection and I will settle for nothing less.", "pics": null, "resp": {"time": 1473329315357, "text": "Thank you Kelly. It is such a joy to watch your sweet grand babies grow into beautiful young girls. I really appreciate you trusting us with something so important. :-) We love what we do and we love your girls!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "105494927138144592977", "name": "Kasey Aucoin", "time": 1490798101298, "rating": 5.0, "text": "Daphne has been photographing my little girl since the day she was born. I won't use anyone else for pictures ever again. She always has amazing quality, and is always so calm and patient with my little one! Daphne is the best there is.", "pics": null, "resp": null, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "105463314914374228784", "name": "Victoria Rowan", "time": 1521913113200, "rating": 5.0, "text": "Absolutely incredible photos and experience ! Daphne is so patient and has a real heart for the kids. Her work always exceeds my expectations and we are so excited to have her for our photos !", "pics": null, "resp": {"time": 1521936867061, "text": "Thank you so much Victoria! We love watching James grow. You have such a beautiful family - I'm the lucky one."}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "101151037540041562860", "name": "danielle robinson", "time": 1529582758976, "rating": 5.0, "text": "I’ve known Daphne much of my life from childhood on- years ago when I needed a photographer she lmk she was building a portfolio and would love to have help building it- knowing Daphne and her creativity it was No brainer! If you’re looking for a fun, time with fabulous pictures book with Ellenburg! What does it say when I need pictures done and  up how far the drive is from Louisiana?", "pics": null, "resp": {"time": 1529585414600, "text": "Thank you Danielle! It was so much fun to photograph your giant crew!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "112085801887764066591", "name": "Laurye Brunson - Roberts Brothers", "time": 1473293966801, "rating": 5.0, "text": "Daphne photographed my son for his Senior Portraits and we were blown away!!  She has an eye for capturing the most comfortable and candid photos.  My son had a blast and this Mama was so pleased!  She has also done professional headshots for me in my business and the quality of her work was beyond compare.  She has helped me take my business to a whole new level!", "pics": null, "resp": {"time": 1473329454140, "text": "Thank you so much Laurye! I really appreciate you coming back to us over and over again for such a fun variety of the things. We loved photographing Lucas and doing your head shots and making your marketing. I can't wait to see all the great things Lucas will do! We appreciate you!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "107925453839599426018", "name": "Lisa Teggart", "time": 1473293767809, "rating": 5.0, "text": "Daphne has created a wonderful environment in her beautiful studio!  She is passionate about what she does and it SHOWS!!!", "pics": null, "resp": {"time": 1473329346233, "text": "Thank you Lisa!!"}, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "114519396561702509783", "name": "Jessica Squires", "time": 1490292670387, "rating": 5.0, "text": "Amazing photographer and breathetaking work! Very professional work. I highly recommend for pregnant mothers, new borns, couples photos, graduation, holidays! Everything! She has amazing props and is the best photographer in the Mobile area!!!", "pics": null, "resp": null, "gmap_id": "0x889af87be25ec141:0xe1d6f69c6f3f13eb"}
{"user_id": "109298565385829908994", "name": "Brittney Malone", "time": 1588388544141, "rating": 5.0, "text": "Working with Nick and his team is always an amazing experience! Nick has created amazing promo videos for my business and also captured many special moments for my family! I never have to worry what the end result will be because he always takes my crazy ideas and turns them into the perfect work of art! You will not be disappointed choosing Nick Frontiero Productions to capture all the specials moments!", "pics": null, "resp": {"time": 1589486084547, "text": "We have loved getting to be there for your business journey and through your family growing! You are family! We love you and are so thankful for you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "101433340818095207307", "name": "Danielle Vannoy", "time": 1497495001647, "rating": 5.0, "text": "Nick Frontiero is an extremely talented photographer and it truly shows when he is in the zone searching for the perfect light and angle so that he can capture special moments. He and his wonderful team, Jenna, Susan, and Shannon, made our wedding day fun and turned what could be monotonous photos into an artistic and enjoyable experience. They were extremely professional and friendly and could make even the most camera shy person feel comfortable. We appreciate their hard work and dedication and could not imagine having anyone else shoot our special day! Our pictures turned out so amazing! Nick takes time to meticulously pick the best photos from your special day and edit them to perfection. If you want a way to preserve your wedding day so that you can share it with your family and friends for years to come, then he's your guy. My husband and I opted to not get a videographer, and after getting our photos back from Nick, I know that we didn't make a mistake in doing so because he made sure to capture everything! NFP is the bomb!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNIoAOi4BiFwtwCk93jHJB-v_VodVr4Ti6ZMDVC=w150-h150-k-no-p"]}], "resp": {"time": 1590691090404, "text": "Thank you so much Danielle!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "106407239975206507935", "name": "Christopher Stitcher", "time": 1607187070375, "rating": 5.0, "text": "Best photographer in the river region and beyond! Great team and always a fantastic product!", "pics": null, "resp": {"time": 1607359013553, "text": "Thanks so much Chris 🙏 It was great getting to see you and the family this past Saturday! Can’t wait to share your portraits with Santa!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116709788052479615166", "name": "Lauren Williams", "time": 1588384252140, "rating": 5.0, "text": "Nick and Kayla were so wonderful to work with! They were SO patient with my 2week old for newborn pictures and our family portrays as well! Nick has such a creative eye and has such a talent for capturing the most special moments.", "pics": null, "resp": {"time": 1589486011920, "text": "We are so thankful we got to work with you and your sweet family! Thank you so much Lauren!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109787875678780773216", "name": "Sarah Bryan", "time": 1497548634989, "rating": 5.0, "text": "Nick Frontiero is such a wonderful photographer truly devoted to his passion for art. He brought to life every aspect of our wedding day and then some. I could not have asked for better quality photos. I am still in awe that he captured some of the most personal and sacred moments of the day in such a wonderful light. We will cherish these photos forever. What I loved most about Nick's photos are the \"in the moment\" pictures that he captures. Looking back through our photos, we were able to completely relive the day and look at moments we did not see on our wedding day. We received so many photos I had no idea were taken and we are so thankful to have them. He is incredibly professional and has many options for packages. I was pleased with his work from beginning to end as he went above and beyond. I highly encourage any bride to book Nick ASAP! You will not regret it! I truly do not have enough words to describe how grateful I am for Nick Frontiero Productions. Absolutely amazing!", "pics": null, "resp": {"time": 1590691360466, "text": "It was such a pleasure! Thanks so much for having me capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "115071144720415604565", "name": "Lyndsey J.", "time": 1499135436967, "rating": 5.0, "text": "It's difficult to put into words what an incredible experience we had with Nick and his team throughout our wedding journey. From our first meeting up to our wedding day, Nick was more than we could have asked for in a photographer. Having beautiful images that not only captured our special day but would be forever keepsakes was incredibly important and a big factor in why we selected Nick Frontiero Photography. Nick and his team captured the fine arts style I had been dreaming of while still incorporating those classic, traditional shots. Their amazing skill set is displayed in all of our wedding day images. We were blown away by the attention to detail, creativity, and the little mementos included from our special day. Not to mention, Nick's use of film along with digital really gave the unique styling we had been looking for in a photographer.\n\nA big THANK YOU to Nick, Jenna, and Shannon for helping make our wedding day truly magical and something we will remember for a lifetime.", "pics": null, "resp": {"time": 1590690609374, "text": "We are so grateful you chose us to capture such a special time in your life! It truly means the world to us."}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116166918661193739883", "name": "Lance Mauldin", "time": 1499807614831, "rating": 5.0, "text": "Nick and his staff were incredible to work with to capture all the images for our special day.  My wife and I were blown away by the quality of the pictures and Nick's unique ability to capture special moments that we will treasure for a lifetime.  I would highly recommend Nick to anyone looking for someone that will work with you, help put you at ease, and capture the most brilliant images you could imagine.  We appreciate everything Nick did for us, and will be using him in the future for any other photography needs.", "pics": null, "resp": {"time": 1590690562944, "text": "So glad I could be part of your special day! It truly means the world to me to capture such special moments for your family!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104521342252243684277", "name": "Stephanie Sims", "time": 1497531391862, "rating": 5.0, "text": "Leading up to my wedding I searched & searched for photographers. I wanted one that would think outside the box & be able to capture the most memorable moments on my special day, however I found SO MUCH MORE with Nick! He was professional, a ton of fun to work with & he need little to no direction. He created a vision for me took the lead and my now husband & I followed. Our engagement & wedding photos are beyond amazing to say the least! I remember the day I received my wedding album, I cried as I turned detailed page after page.\n\nI was completely blown away at how he took that one day & transformed it into a piece of art!!! I appreciated how hard he & his team members worked on the day of the wedding. When you hire someone to do a job & after they have completed the job you find it hard to put in words how satisfied & pleased you are with that individual, that's when you know you made the right decision!!!!", "pics": null, "resp": {"time": 1590691392319, "text": "I'm so glad you loved it so much! I appreciate you so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109645526839109944854", "name": "Keeper58 Bibb", "time": 1498336287616, "rating": 5.0, "text": "Nick is absolutely amazing. He is very creative and always get the best shots. Him and his staff captured the best moments in our wedding. I look forward to working with him on other projects. By the way, our engagement photos were amazing and we are still getting compliments on them.", "pics": null, "resp": {"time": 1590691220786, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "114062734109470476802", "name": "Courtland Bibb", "time": 1604419116592, "rating": 5.0, "text": "The staff is helpful and great", "pics": null, "resp": {"time": 1605895121621, "text": "Thanks so much Courtl Bi for the review! Serving people with the highest excellence is definitely our aim! So glad you had a great experience!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107945904108671241724", "name": "Skyler Shirley", "time": 1497535775139, "rating": 5.0, "text": "Nick is an awesome photographer! He was my photographer for my wedding and it was the best decision I made. He takes time to learn exactly what it is you want and goes above and beyond to meet those expectations. I recommend him to anyone who ask me about a photographer for any occasion. He is the best!!", "pics": null, "resp": {"time": 1590702302369, "text": "It was truly an incredible day! I was honored you chose me to capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "111890651726256002920", "name": "Casey Stephenson", "time": 1497497770093, "rating": 5.0, "text": "Nick is the absolute BEST in his field! He becomes personally involved in your session and is sure to capture your individuality. Nick will always be my photographer, and I can promise you won't regret using him to capture your special occasions !", "pics": null, "resp": {"time": 1590691075864, "text": "Thanks so much Casey!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "113876076560476358105", "name": "Chantal Hopkins", "time": 1497562357092, "rating": 5.0, "text": "Our experience working with Nick was beyond OUTSTANDING!  Nick is very professional and personable.  He made our engagement session so much fun!!  He also captured every single moment our of wedding day and the quality of our photos are the absolute best.", "pics": null, "resp": {"time": 1590691321424, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "112955100617682591642", "name": "Jillian Ziemanski", "time": 1497620968651, "rating": 5.0, "text": "Nick and his team were perfectly professional while still maintaining a relaxed atmosphere. They captured every moment of our wedding day flawlessly! Our photos tell a beautiful story, and we're so thankful that we chose Nick as our photographer!", "pics": null, "resp": {"time": 1590691242311, "text": "Thanks so much Jillian! It was a pleasure!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116403716739192401006", "name": "Chase Watford", "time": 1497531959584, "rating": 5.0, "text": "There are absolutely not enough words to describe how thankful I am to have chosen Nick Frontiero Productions and his team to capture our day. I had a friend who used Nick and knew immediately i wanted to use him for our wedding day. Not only are his pictures absolutely gorgeous , but he goes above and beyond to give his brides exactly what they ask for. We did not know eachother before the wedding process, but now Nick and his wife Jackie are some of my most cherished friends. Nick brings a full team to shoot on the wedding day and i seriously felt like a celebrity with an entourage. There is not one moment of our day that they did not capture. I am forever grateful for this guy and his insanely cool photography skills. You will NOT regret booking Nick Frontiero Productions for your event. I can't wait to use him again for maternity and family photos one day!\nMuch Love,\nLindsey Watford", "pics": null, "resp": {"time": 1590691414566, "text": "It was such a pleasure! Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116968254954101198083", "name": "Lauren Hoepfner", "time": 1503093568128, "rating": 5.0, "text": "I cannot say enough good things about Nick and his team! Nick helped us to design a wedding package that worked the best for us and fit our budget. We wanted to do a lot of our pictures before the ceremony, and Nick worked with us to get everything figured out. He put together a detailed timeline for the wedding day, so we knew exactly who needed to be where and when. He and his team were so incredible to work with and captured absolutely amazing pictures of our entire wedding day. Nick also has 2 Polaroid cameras and took polaroids throughout the day. At the end of the night, he presented us with a beautiful wooden box with our names on it, full of all of the polaroids he had taken that day!! It was such an awesome surprise to have at the end of the night, and we loved getting to see a sneak peek of our wedding pictures. When our final photos came, they were PERFECT!! Thanks Nick and team for being the best and helping make our wedding day so much fun!! Y'all are the best!!", "pics": null, "resp": {"time": 1590690499843, "text": "We are so glad to be part of your special day!! We are so grateful!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "108447198262550732644", "name": "Elizabeth Wells", "time": 1497542527695, "rating": 5.0, "text": "Nick and his team were great to work with through the planning process and the day of our wedding. He took beautiful photos of the wedding and we'd definitely recommend him to a couple looking for a photographer.", "pics": null, "resp": {"time": 1590702242449, "text": "It was an honor you chose me to capture your special day! Thanks so much!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "118360194249319202501", "name": "Natalie Rowell", "time": 1497498547843, "rating": 5.0, "text": "Nick is an amazing photographer and is just as awesome of a person! Very professional and fun! He makes the experience very comfortable and produces amazing images! He will not disappoint!", "pics": null, "resp": {"time": 1590691102608, "text": "Thanks so much Natalie!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109753910865605205735", "name": "Meredith Moseley", "time": 1497527011479, "rating": 5.0, "text": "Nick did our Senior Portraits and we were and still are in love with our images, Nick was very easy to work with, very affordable and FUN! I can't wait to have my grandson's growth captured!", "pics": null, "resp": {"time": 1590691117347, "text": "So glad we got to capture those memories!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107856030216026223930", "name": "Haley Daniel", "time": 1497964717408, "rating": 5.0, "text": "He did AMAZING on our engagement pictures, wedding pictures, and wedding album!!!!! We love him!!! So glad we used Nick to capture moments that we will have forever :)", "pics": null, "resp": {"time": 1590690690490, "text": "Hey Haley! It was such an honor getting to share such special moments with you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104487008235926237871", "name": "Jenna Garrett", "time": 1497803506600, "rating": 5.0, "text": "From the moment NFP started popping up, I've admired Nick's photography style - so booking him for my wedding was already a given! I've seen Nick in action, and final products, but I was speechless when I finally got into our gallery! He captured so much emotion and happiness authentically, with each image providing an excellent reminder of each individual moments of our day. One of my favorite parts of the day was getting a box of polaroids at the end of the night - along with the film shots later. He can take any space/venue and make it look elegant - even our small backyard ceremony! You can choose a photographer who's style you like, or choose a photographer who's style constantly evolves and adapts with each individual wedding. All the weddings Nick has photographed look amazing, but I don't think you fully appreciate the talent until you see yourself captured by it. He's laid-back, focused, and actually a pretty stealthy photographer. NFP is an investment worth making if you want beautiful memories captured to last a lifetime!", "pics": null, "resp": {"time": 1590690765069, "text": "Hey Jenna! It was truly an honor getting to capture your beautiful day! You've become family! and we love you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107494047355578223892", "name": "Jessica Bowers @ Georgia's Home Team Realty", "time": 1617417635882, "rating": 5.0, "text": "Flip always does a wonderful job with my listing photos. He is flexible with our scheduling and delivers the photos very quickly. Love his work!", "pics": null, "resp": null, "gmap_id": "0x88f3e153d97083d9:0x8b6acecc8802237d"}
{"user_id": "100700128831571640633", "name": "Barbara R. Ledbetter", "time": 1610591371774, "rating": 5.0, "text": "I highly recommend this Photographer. He is exceptionally professional and photography is excellent.", "pics": null, "resp": {"time": 1610629316989, "text": "Thank you so much!"}, "gmap_id": "0x88f3e153d97083d9:0x8b6acecc8802237d"}
{"user_id": "114071280539050523907", "name": "Damon Andrews", "time": 1614428669751, "rating": 5.0, "text": "My Go To Real Estate Photographer!", "pics": null, "resp": null, "gmap_id": "0x88f3e153d97083d9:0x8b6acecc8802237d"}
{"user_id": "109063509380306769237", "name": "Matthew Reis", "time": 1563808295475, "rating": 5.0, "text": "Very professional, punctual, and high quality work.", "pics": null, "resp": null, "gmap_id": "0x88f3e153d97083d9:0x8b6acecc8802237d"}
{"user_id": "110620217594569393760", "name": "Brian Panos", "time": 1606160812290, "rating": 5.0, "text": "A level of professionalism I did not think possible in a small town in Alabama. The staff was did such a good job, my family can't stop talking about it. I strongly urge anyone who needs professional photography for your family or business to use yellowhammer photography.", "pics": null, "resp": null, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102743907362060309011", "name": "ELIZABETH TOLBERT", "time": 1562952309557, "rating": 5.0, "text": "Thank you Yellowhammer Photography- you guys are the BEST!\nI can always count on Beth and Joel to provide me with beautiful photos and an overall great experience.\n👍🏼👍🏼Highly recommended", "pics": null, "resp": {"time": 1562979836675, "text": "Thank you for the review. We had so much fun working with you and your family the other day and look forward to working with you again in the future."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102665349064096526769", "name": "Jacob Smith", "time": 1562943702792, "rating": 5.0, "text": "Yellowhammer Photography is a phenomenal company. We have used them for everything from a single photo to our wedding pictures, and everything in between. Joel and Beth are not only extremely talented, but they are wonderful people. We will never use another photographer, no matter what we are needing or where we are.", "pics": null, "resp": {"time": 1562947876197, "text": "Thank you so much for the kind words. We always love it when we get a chance to work with you guys. We look forward to working with you again in the future."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102151979056391604805", "name": "Benard Tamburello", "time": 1562990467234, "rating": 5.0, "text": "Beth and Joel have been covering the food scene of all my restaurants for over half a decade now! They offer amazing professional commercial photography with an easy going approach. Their attention to detail really shows in our food and beverage photos. We will continue to use them again in the future as we love their competitive pricing!!", "pics": null, "resp": {"time": 1563111406348, "text": "Thank you for the review! We always look forward to each time we get to work with you and your teams. The AMAZING food and atmosphere you provide in your restaurants make our job so much easier. And it’s always nice to get some awesome samples. 😃 Looking forward to our next session."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102934541034554985685", "name": "Brianna Tamburello", "time": 1562989611534, "rating": 5.0, "text": "Beth and Joel offer amazing quality pictures with a professional experience and competitive pricing. Their attention to detail is top notch! Their creativity and keen eye made our wedding picture experience at Sloss Furnaces perfection! We will book them again and again for years to come.", "pics": null, "resp": {"time": 1563110762550, "text": "Thank you for the review. We LOVED working with you guys on your unique wedding shoot. We always love it when someone has an out of the box idea that we are able to make happen, and yours was super FUN! We hope to work with you guys again soon."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "112590073010885746340", "name": "Traci Vice", "time": 1562949374413, "rating": 5.0, "text": "Yellowhammer Photography has been our family's photographer for years. Joel and Beth are a pleasure to work with! They are thorough, very professional and an overall delight to be around. We genuinely look forward to working with them every single time.\nThrough the years we have had family portraits, my daughters wedding (when he did weddings) and both of my daughters senior portraits. He has also made head-shots for a couple of pageants. All were beautifully edited. Beth and Joel work together to come up with realistic poses that are very natural and flattering for all!\nWe would never consider looking anywhere else for a photographer- Yellowhammer is the best you can get- I can't say enough great things about them!", "pics": null, "resp": {"time": 1562951724358, "text": "Thank you so much for this review. We really LOVE working with you guys and always look forward to the next time you may have a milestone requiring photographing. Your family is beautiful and wonderful people and we are just so happy that we have been allowed to capture some of these special moments for you guys!"}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "104960201953346248195", "name": "Tina Butts", "time": 1563017100379, "rating": 1.0, "text": "After using Joel on two occasions to do photos for me and my family, I booked a Maternity Session more than 3 months in advance. During that time, I texted him to gain an understanding of what the cost would be. He asked a few questions and then never got back with me. Since I had used him on 2 other occasions (most recently 9 months ago) and his prices were reasonable... and this session would be no more work than the previous sessions, I didn't press the issue and figured we would just discuss it later. Well..when I texted him a month before the event to confirm my date, he mentioned he noticed he had never responded to my text regarding the price.  After asking a few more questions he came back with a price of $800?!?!?!??? This is almost as much as I paid for my wedding pictures and they were ABSOLUTELY GORGEOUS with tons of editing (much better than any session that we had with Joel). I have spoken with several licensed photographers since this time and NONE of them charge anywhere near this high. Going price for this type of session was $150-450 for a 1-2 hr session and digital photos (Max). Unfortunately this put me in a real bind because now it was extremely hard to find another photographer that was available for my date. Joel mentioned he would come down to $550...but this was still higher than \"average\". This high pricing also was not in line with the pricing on his website. Although he did not have Maternity specifically listed, he had Engagement Sessions for the same length of time (2 hr session and digital photos) for $400 and this was synonymous to my requested session since it would be only me and my husband for a couple of hours. Given that he put me in such a stressful bind at an already stressful time in my life, I would definitely NOT recommend him. I tried to work out the pricing with him to be more reasonable and even explained my issue of having troubles finding someone else this late...but he was unwilling to work with me...even though he knew that it was his fault because he never answered my text regarding pricing 3+ months ago. Do yourself a favor...use someone who responds to text messages and honors pricing listed on their website. At a minimum,  select someone who is willing to take responsibility when they make a mistake...that unfortunately does not appear to be Joel at Yellowhammer. :(", "pics": null, "resp": {"time": 1562982443833, "text": "Thanks for taking the time to share your feedback. We have always enjoyed working with you and your family and are glad you were so pleased with our work in the past that you decided to reach out to us for your maternity session. While we strive to accommodate almost any budget, we understand that sometimes that does not work out. While we do offer lower-priced photography collections, those price points do not include the digital copies of edited photographs that you requested. We hope you were able to use one of the many photographers we recommended, who may be able to offer a lower price point. Thanks again for your business, and we wish you all the best in the future."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "114202600638391906208", "name": "Elena Kulpa", "time": 1624545266333, "rating": 5.0, "text": "Changing States and starting my career back up in Real Estate meant also changing my entire team, choosing the \"right\" photographer is vital in this industry.  I was referred at least 5 photographers and Joe was the first to answer my call.  His adaptability and getting your vision in the first shot is impressive!  Pixel Joe is \"TOP NOTCH\" and is why he is my ONLY choice for photographer in North Alabama. Like they say \" if it's not broke why fix it.\" Give him a call, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1624461173930, "rating": 5.0, "text": "Fun and educational! Much appreciated!", "pics": null, "resp": {"time": 1624510833125, "text": "Thanks for coming Steve!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110220400279779925575", "name": "christina hall", "time": 1622943504536, "rating": 5.0, "text": "Absolutely the best place for any venue needs!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103803003022946061253", "name": "Thomas Lawless", "time": 1603760874439, "rating": 5.0, "text": "This dude took exactly what I had in my head for my business and made it happen. I couldn’t be more happy with the quality and appearance of the photos I needed.\n\nAbsolutely phenomenal", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104143428204887567216", "name": "Steven L Payne", "time": 1624510184769, "rating": 5.0, "text": "Super nice setup!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "109102795672237195901", "name": "KAavalon", "time": 1569680089254, "rating": 5.0, "text": "My husband and I hired Joe for our wedding 8/31 to do a highlight video. Joe was AMAZING!!! He assisted us through the whole process helping us select the moments we wanted to capture. He gave us a beautiful video while staying within our budget. He is professional and personable. We had our DJ drop out at the last minute and he assisted us with finding a new one, DJ Scott Blakely was AWESOME!  I highly recommend Joe and Scott and I would definitely hire them again!!! Thank you both so much for helping us make our wedding a party and helping create a beautiful keepsake!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114884731954220746471", "name": "Kimberly Holmes", "time": 1518198801133, "rating": 5.0, "text": "Joe was Fantastic and easy to work with. Never once got frustrated with us and always had a smile. You can definitely tell Joe is passionate about his work. He did a Fabulous job with our whole team!! I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114854941382840784237", "name": "Nadine Wormsbacher", "time": 1532815473298, "rating": 5.0, "text": "Joe is a gifted photographer and videographer. He thinks  outside the typical box to create videos and images that are unique and memorable. He created a beautiful video of my horses and farm; he used his drone and the camera that lets him move with the horses and not jiggle. He’s very professional and easy to work with. Although I’d recommend him for anything image related, after seeing my video, I think he would be especially great for outdoor weddings or events.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "113882969702963035749", "name": "John Wood", "time": 1517184820924, "rating": 5.0, "text": "Joe took some headshots for myself and my staff that came out great! Joe had a lot of great tips for posing and took care to always get the best shots he could. Joe's studio was top notch as well as his professionalism and his abilities! Highly recommend!", "pics": null, "resp": {"time": 1517239829093, "text": "Thanks John I enjoyed it. You have an amazing staff and I know you guys will be an amazing all state branch! If anyone needs insurance call these guys!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "107012675560021782345", "name": "Tye Watson", "time": 1505707424106, "rating": 5.0, "text": "Highly creative photos- he can add any theme to create a magical scene. His videos are above the top. Love his work. Would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1533649441699, "rating": 5.0, "text": "Joe is the doctor of photography.  He has an eye for the picture and knows the camera like nobody!  Whether it's a headshot, sports action shot or wedding I highly recommend using his vision!  He is also great at making movies so if you'd like to watch that game or wedding over and over he can make it happen!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1532729877812, "rating": 5.0, "text": "Joe Bullock is an excellent photographer! From headshots to engagement photos to promotional videos, Joe's work is top notch. He is professional and gives 200% to everything he does 📸🎥", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100096560547750047679", "name": "Brandon Saraceni", "time": 1503714516052, "rating": 5.0, "text": "Joe took some photographs via his drone for me on a roof inspection. He was on time and very professional. I will definitely hire him again. Thanks Joe.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "117225640691016339924", "name": "Lauren Schippers", "time": 1505675033074, "rating": 5.0, "text": "Joe is very professional and took some amazing photos for a friend of mines engagement announcements. They turned out beautiful!!!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110793175651707402605", "name": "ERICA PRICE", "time": 1508082460020, "rating": 5.0, "text": "Pixel Joe's photography did a great job for us and I will definitely hire him again! Thanks so much pixel Joe!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108934058374010077336", "name": "Rachel Harchanko", "time": 1532907622867, "rating": 5.0, "text": "Pixel Joe did my head shots for me. Joe was an absolute pleasure to deal with. I was so thrilled with the finished photos.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100468113882323669988", "name": "Kayla Bullock", "time": 1506294828302, "rating": 5.0, "text": "Joe did a great job with our family pictures and getting 3 wild boys to smile!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
