{"user_id": "104234933839882058974", "name": "George Glass", "time": 1621548929410, "rating": 5.0, "text": "Great people at counter", "pics": null, "resp": null, "gmap_id": "0x888e81bb4ef2d179:0x8541a4a147fdcbae"}
{"user_id": "108818400034133832183", "name": "Bob Frick", "time": 1533585436678, "rating": 5.0, "text": "Can't live without them!!\nWe cooling now.", "pics": null, "resp": null, "gmap_id": "0x888e81bb4ef2d179:0x8541a4a147fdcbae"}
{"user_id": "113651479048336240524", "name": "Shari Smith", "time": 1600116288206, "rating": 5.0, "text": "Our company, the National Service Cooperative, has worked with Jones McLeod for over 25 years.  They represent our organization in all of Alabama.  The reason that they are the Premier Service Provider for us is because of their commitment to excellence and to customer service.  With ever service call they perform, they send trained technicians with the parts needed to complete the repairs.  Their management team, led by Chris McLeod, is the best there is.  You are in the best hands when you select Jones McLeod!!", "pics": null, "resp": {"time": 1600173750346, "text": "Shari, Jones-McLeod is so thankful to have worked with the National Service Cooperative for all those years. Jones-McLeod loves taking care of all your commercial appliance service needs, whether it is in a restaurant, school, church, hospital, or any other facility with a commercial kitchen. So thankful for our partnership!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "117724235928976755066", "name": "Bob Collier", "time": 1614377005410, "rating": 5.0, "text": "Jones-McLeod are really convenient for the services that they offer. Their rates are competitive with anyone, their response time is good, and the office manager, Pat, is super friendly and helpful.", "pics": null, "resp": {"time": 1614379465284, "text": "Bob, thank you for the kind words. We at Jones-McLeod are very grateful for the opportunities to continue to earn your business! Thank you!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1614744947363, "rating": 5.0, "text": "Staff was good and new what they were doing", "pics": null, "resp": {"time": 1614784859470, "text": "Hoyt, thank you for the kind words. Please let us know if you need help with any of your commercial appliance parts and service needs. thank you!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "112894296067233723694", "name": "jessica Chen", "time": 1598055590668, "rating": 1.0, "text": "We had service with them several times, they were wonderful but last time they came couldn’t found what is problem with fryer and fryer just back working normal when they come so they just left doesn’t charge anything, I was appreciate they came even they didn’t do anything. But today my fryer don’t work again, I called up there and ask for service, they just told me can’t do any service for us no more, I asked why is there any reason to make y’all to do this to me? They just kept saying sorry we can’t do any service for you no more. I don’t really understand so I questioning him why? He told me he don’t want to argue with me, just they don’t service us no more. Wow..\n\nThat’s ridiculous. First, we never yelled out anybody . Second we gave you guys credit card info to trust you guys to charge us for service. Third the last time service which is couple days ago he couldn’t find the problem for the fryer So I asked him before he leave what if the fryer stop working again, he told me just call office for service. Then I ask him how about the charge? He answered he will not charge me this time but he doesn’t know if his boss going to charge or not. So I will just say thanks to him because I knew there is a fee for came out.  But I don’t think I will have a problem with you guys to collet the bills. You might need to talk to who came for the service first. Maybe they were lying for some reason.", "pics": null, "resp": {"time": 1598041798733, "text": "Mr. Chen, as we explained we can no longer render you service due to the fact that on multiple visits to your establishment we have had a difficult time getting paid for our services and our technicians and dispatchers have been yelled out on each occasion. Our rates were explained in advance and the technician clearly explained what was needed to repair the equipment prior to doing the repair. We were given the go ahead to proceed with the repair, but when the repair was complete the technician was told he would not be paid for the parts or service. Therefore we can no longer provide service to you. We will not send our technicians into that environment again."}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "117202087865196998209", "name": "Derek Landry", "time": 1598643803960, "rating": 5.0, "text": "Great and friendly staff, very Knowledgeable. would give 10 stars if i could. will definitely be a repeat customer.", "pics": null, "resp": {"time": 1599081865350, "text": "Thank you for the kind words. Jones-McLeod Montgomery is always happy to be at your service!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "103705861119340225481", "name": "Randall Phillips", "time": 1586441304856, "rating": 5.0, "text": "The very best service company we have ever used. Kept me informed on what all was going on at the job-site and worked well with our customer at the job site and got the job done and everyone happy. Well be using this company again and future projects.", "pics": null, "resp": null, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "115622766621942721308", "name": "Sarah Barnett", "time": 1513019939776, "rating": 5.0, "text": "Pat is so easy to work with!! I loved doing business with this company and will be a returning customer. They are fast, dependable and kind. Highly recommend.", "pics": null, "resp": {"time": 1534543880078, "text": "Sarah, thank you for your business and your kind words about Pat!"}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "104697244657038436492", "name": "Ozzy Doner", "time": 1540098717281, "rating": 1.0, "text": "Scammers!!! First the Service technician was just for 1h 20 minutes at my store and the second time he was just 35 Minutes here. The Part he replaced was $ 158,- he told me. They charged me almost $1300!!! For what???? Never ever again. And this goes straight to our attorney. I got Cameras in my Store.", "pics": null, "resp": {"time": 1565116826102, "text": "Mr. Doner, sorry, but we did not provide you service out of our Montgomery office."}, "gmap_id": "0x888c2bb81677b8e1:0xfb06d9389264bcb7"}
{"user_id": "106832065758346559535", "name": "Johnny Morris", "time": 1621185911265, "rating": 5.0, "text": "Great food and service!", "pics": null, "resp": null, "gmap_id": "0x8888416b92281691:0x572f56de4645702f"}
{"user_id": "109104789845431984784", "name": "C J", "time": 1581997487201, "rating": 5.0, "text": "Isaac and his crew did a great job at my house. Installed an AC and ran the duct work.\nTOP QUALITY WORK and great guys. They explained everything and did a solid job.\n\nThis is who you want to use.", "pics": null, "resp": null, "gmap_id": "0x8888416b92281691:0x572f56de4645702f"}
{"user_id": "102042957452620332949", "name": "Mike Ramey", "time": 1565397317594, "rating": 5.0, "text": "We appreciated their quick response, reasonable rates and friendly technician", "pics": null, "resp": null, "gmap_id": "0x8888416b92281691:0x572f56de4645702f"}
{"user_id": "103232557902804565726", "name": "windi rosson", "time": 1597247379746, "rating": 3.0, "text": "Initially installed our new unit with no problems in 2015. When we called for our yearly maintenance, no one ever showed up. We did this twice and then gave up on them, and changed out filters out ourselves.\nAfter a few years we started to have issues with the unit not cooling, and blowing fuses and lost power to our thermostat.  Tech came out and checked voltage, and changed a fuse. They charged us 1.5 hours of labor, for a 20 min fix.\nThe issues above persisted and we called to have them come out for repairs again. The techs arrived and  tested voltage and various things but could not find the issue. It was my husband who discovered a wire that was cut and causing a short. The techs fixed that, and also cleaned the coils thoroughly on the unit.\nWe are still having some issues with our unit not cooling properly which were brought up in the first visit, but since the issue hadn’t happened that much over the course of the past 5 years the tech didn’t think it required any further investigating.\nThey will charge you for the techs coming from Opelika, however my husband talked to the tech and they were already in Columbus, had just finished a service call and were heading to our house. When my husband brought this up for Mr. Farnell, he stated that they had to include for fair wear and tear on their vehicles.\nTried to bill extra hours for labor, good thing I noted the time when they arrived and when they left, plus we had a rain storm that stopped all work for the duration of the storm.\nCharged us for fuses, that we provided since the tech didn’t have any.\nMy husband called the office to challenge the charges on the bill and did negotiate them with Mr. Farnell, who agreed that something were charged/done in error.\nAs small business owners, we try to utilize other small business owners when possible. We have spent over $10k with this company (for the new unit and repairs) and after this experience will never use them again. It’s a shame that they let lack of communication, over billing and erroneous charges ruin their business relationship with customers.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "104755342013659567585", "name": "Nicole Finley", "time": 1602882095412, "rating": 5.0, "text": "Highly recommend Farnell!! They have been overly helpful with any issues we've had with our system that came with the home we purchased. And our tech, Mason, is TOP NOTCH!!! Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "110940826703645076429", "name": "Wendi Weimar", "time": 1587525015481, "rating": 5.0, "text": "Farnell Mechanical did fantastic work at my house.  They fixed a messed up system and now its great!!!!  The entire staff was professional and patient.  They were SO thoughtful and took great care to protect my elderly mother.  It was such a piece of mind during this Covid-19 outbreak.  Great JOB!!!!!  If you need any heating or ac work, please consider Farnell Mechanical", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "114310566416455003417", "name": "Vickie Schweinfurth", "time": 1606647304663, "rating": 5.0, "text": "Cody was very professional.  He is a great asset to your company.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "104013541903600401511", "name": "Gaines McClinton", "time": 1574103165386, "rating": 5.0, "text": "I called Farnell Mechanical Friday afternoon  November 15, 2019 to report a furnace trouble code that showed-up on my thermostat.  Technicians Austin and Jordan came to our home that same afternoon, identified the cause of the trouble, and corrected it.  They were both very professional, polite and courteous, answered all of my questions,  showed me what caused the furnace code and explained what they did to correct it.  I give them a 5 star rating and recommend them to anyone contacting Farnell for furnace and air conditioner maintenance.  They represented Farnell Mechanical well.", "pics": null, "resp": {"time": 1575896362477, "text": "Thank you for your business. I will be sure to praise Austin and Jordan. Tommy Farnell"}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "101310480693663939344", "name": "BRIAN BERNSTEIN", "time": 1579571274105, "rating": 5.0, "text": "Farnell recently installed a new system in my home. Salesman that quoted me was great. Install crew was polite professional and experts at what they do. Excellent experience and very pleased with my new system.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "106691352192512310697", "name": "Eric Anderson", "time": 1573094534461, "rating": 5.0, "text": "November 6 2019 Austin and Jordan were 2 young fabulous young men very respectful with a lot of promise for the future of the company concerning the services preformed on our unit today. I recommend these 2 young anytime", "pics": null, "resp": {"time": 1575896561351, "text": "Thank you for your business. Good to hear Austin and Jordan are taking care of customers. I will be sure to praise them."}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "102908040172870501424", "name": "Eve Brantley", "time": 1590695887771, "rating": 4.0, "text": "Very appreciative of Farnell and the efficient work by Austin to get our A/C running again!", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "117911387071731427985", "name": "Jennifer Waldrop", "time": 1583196185672, "rating": 5.0, "text": "Always prompt and very informative. They have worked on several of our industrial kitchen appliances at work and are always prodeasional. They arevoutrl go to repair people for sure.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "101755798776509350151", "name": "Sushi Hero", "time": 1592228812273, "rating": 5.0, "text": "We have been using this company and they are all great!", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "109054431433776896838", "name": "Yvonne Watkins", "time": 1567048881787, "rating": 5.0, "text": "First of all I would like to Thank Farnell Mechanical Company for sending the crew that installed my system. STEVE...Hunter & Devon...You did not dissapoint. You treated my home with care & you were efficient as well as very professional. You all were personable & Courteous. As a Customer I could not have asked for more.  This Company should hang on to these guys because a Company is only as good as the people who run it. These guys were Awesome!!  Thanks again. I had pictures but there is not a link that allows me tp post them.", "pics": null, "resp": {"time": 1567082516443, "text": "Thank you so much for your business and the feedback!!! If you would like to share some pictures you can send them through Facebook or to info.aub@farnellac.net Tommy Farnell"}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "106773293223010901301", "name": "Tommy Waldrop", "time": 1604099560520, "rating": 1.0, "text": "Did not go there.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "103524929279503673259", "name": "Christopher Ceman", "time": 1506031217458, "rating": 5.0, "text": "Every step of replacing our entire HVAC system was a pleasure with them. A much better estimate than from any other company I contacted, the work was done in two days, and we paid on the nose exactly what we were quoted. It's hard to do any better than that. Highly recommended.", "pics": null, "resp": {"time": 1508327403217, "text": "Christopher,\nIt was great to meet you and great to work with you. As a token for leaving this incredible review I am issuing you a free (5\" MERV 10 Filter ). This will be done on your free Energy Savings Agreement visit around 09/18/2018 date. The filter should last 1 year giving you 2 years of no hassle filtration.\n\nThanks again,\nTommy Farnell\nOwner"}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "108471250644842587331", "name": "WILL OBRIEN", "time": 1401395427410, "rating": 5.0, "text": "I have been doing business with Farnell Heating & Air Conditioning Co., for more than 8 years. They have replaced 2 complete heating & a/c systems for me, as well as 2 major heating system repairs, that several other heating & a/c companies had failed to figure out, after several expensive calls, over a period of 5 or 6 years. They have also done weekend emergency a/c repairs for me that took until 3 am, on a very hot summer night. Most recently (yesterday, 5/28/14, actually) they replaced an old water heater, in a very difficult attic location, in spite of a 3 hr. delay, while the Auburn City Water Dep't cut a very large root away from the shut-off valve at the meter, so that the water could be shut off; and the old water heater could be removed, and the new one installed. They waited, patiently, through the whole delay.\n\nThrough all of my experience with Farnell, I have dealt with at least 10 of their service men. From my point of view, as a repeat customer, it would be virtually impossible to find, and hire, better men, than those I have encountered, whenever Farnell was doing work for me. They are, without exception, always on time, very hard working, well-mannered, friendly, and very good at what they do. I have never had a single bad experience with Farnell or their people!!! They're just good people, and I actually trust them. They have never given me any reason not to.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "116692624679609243188", "name": "Shirley Dennison", "time": 1601342352852, "rating": 3.0, "text": "Have good and friendly service", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "111380929383607280892", "name": "gale Hunter", "time": 1523040687516, "rating": 1.0, "text": "My mother was charged 971.00 to replace a 30 gal gas AO Smith hot water heater.  Lowe's retail price is 479.00.  Parts were 127.00 The rest was labor which totaled $1500.00  This is just too much after checking with other companies.  She is elderly (88) and just needed hot water.  For all of you who read this inform your elderly parents to call you before they agree to such outrageous charges.  We will  not recommend this company at all.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "104110536483969049255", "name": "schaufyman", "time": 1560820310778, "rating": 1.0, "text": "One of this companies drivers cut me off and slammed on his brakes purposely. We called the company as this type of unsafe driving should be punished by the owner, but they had chose to NOT respond. They are irresponsible and completely unworthy of concern while driving a company vehicle.", "pics": null, "resp": {"time": 1561390787260, "text": "This is Tommy Farnell (owner). I apologize for this. I have been out of town and just was made aware of the situation today 6-24-19. You called our answering service on 6-15-19. I arrived back to work on 6-24-19. We do have meetings about driving and this type of behavior is not tolerated. Again I apologize and there will be repercussions for this behavior."}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "105940779700450568022", "name": "Julia Upton", "time": 1364092726718, "rating": 5.0, "text": "I'm not sure what this lady experienced, but I have been MORE than pleased with their services!  They have been more than helpful and have come out on service calls countless times!  Every tech was more than friendly and eager to help with our problems.  They even followed up with us after a couple weeks!!", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "107384935056656622739", "name": "Meg Milligan", "time": 1500042605510, "rating": 5.0, "text": "Farnell installed a Lennox HVAC unit at my house in Auburn.  I was very satisfied with the installation and it continues to effectively cool my home in the hot Alabama summers.  Highly recommend the knowledgeable team at Farnell and am proud to support a locally owned business.", "pics": null, "resp": {"time": 1500043748305, "text": "Thank you very much for your kind review and we look forward to continuing to service your equipment to ensure it stays in peek performance year round."}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "106422077676673249909", "name": "Robert Grantham", "time": 1512819440613, "rating": 5.0, "text": "Outstanding customer service, professional office staff. I needed help with my residential unit and they came right over.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "103101661235308410703", "name": "Mary Wynne Kling", "time": 1358893965228, "rating": 2.0, "text": "The only reason to use this company is if you love shelling out hundreds of dollars, but don't care if your HVAC system ever actually works. I have now \"enjoyed\" EIGHT visits to my home by Farnell employees written them almost $1500 in checks, had multiple parts replaced (some I am now certain were not faulty to begin with), vacuumed gallons and gallons of water out of my attic, paid Alabama power $500 two months in a row (turns out the compressor was dying and it took Farnell five or six visits to figure that out), and yet I am sweltering through my second consecutive weekend without AirConditioning. Today was the first time we've heard from a manager, who only informed us that \"there are no managers in town to help you this weekend\" and \"we can send someone out, but I don't know if you'll have to pay for a service call or not, it depends on if it's because of something we did.\" OF COURSE it's because of something you did. Your employees spend more time in my house than I do. Don't waste your time with this bunch.\nUPDATE 1/22/2013: Today I was contacted by the owner of this business asking me to remove this review. In Farnell's defense after I first posted this review some attempts were made to rectify the problems we were having. Today when the owner contacted me I attempted to remind him that there was still work they'd promised to do that had never been completed (repainting of a ceiling they damaged in August). Instead of offering to make the repair the owner became extremely rude. Cut me off mid sentence, wouldn't let me finish talking, and talked over me; insisting that he didn't know anything about this issue and that I needed to remove my review. It rapidly reached a point that I hung up the phone. There are some extremely poor customer service issues at play here, and I'd steer clear of doing any business with this company in the future.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "102589041959447973851", "name": "haley barkley", "time": 1508258779731, "rating": 5.0, "text": "this company is amazing and the staff is awesome. very professional company.", "pics": null, "resp": {"time": 1508326066791, "text": "Thank you so much for the review."}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "114405183904803466106", "name": "Holli Thomas", "time": 1486489262920, "rating": 5.0, "text": "Great Company! Great Techs! Great Installers!", "pics": null, "resp": {"time": 1486500227186, "text": "Thank you."}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "117971708413924607247", "name": "Oscar Fernandez", "time": 1583422831406, "rating": 4.0, "text": "Very friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "108521540708059508463", "name": "Martin Hrtanek", "time": 1486153410779, "rating": 1.0, "text": "Very rude and arrogant people", "pics": null, "resp": {"time": 1486500191054, "text": "This is not a customer....this is a truck driver that blocked the entire facility and refused to move. So we are sorry for being rude...but most all drivers have common courtesy and not block two businesses from entering and leaving."}, "gmap_id": "0x888ced510f4e5937:0x5a5209b4bcf2a4ea"}
{"user_id": "101558054600025158520", "name": "Jordan Singleton", "time": 1623099158020, "rating": 5.0, "text": "I spoke with Paul midway through the day and he was kind enough to fit me in their schedule! The technician that came by, Dale, was friendly, professional, and worked very quickly. He went above and beyond by checking my outside unit under an umbrella since a rainstorm cropped up right after he arrived, and was mindful enough not to track mud back into my trailer. He had the part needed to fix the unit on his truck; so about 2 hours after picking up the phone I'm sitting in a cool, comfortable house. Pricing is fair and actually less than what I was expecting to pay.\nIt's great to see a local business offering such quality service, and I'm glad to know who to call the next time I have an HVAC issue or need regular maintenance.", "pics": null, "resp": {"time": 1624362968197, "text": "Jordan thank you so much for the kind words. Sounds like Dale really raised the bar. Our goal everyday is to serve our customers in the best possible way. Thanks Paul Potter."}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "105634547790582443611", "name": "Cecilia Green", "time": 1621083812598, "rating": 5.0, "text": "Metro Climate Systems crew are very professional and respectful. My A/C is blowing air like never before. My landlord had to call 3 or 4 different companies to fix my A/C and they finally found the perfect match. I recommend Metro Climate Systems because they fixed my A/C! And also they're professional, friendly, respectful, and on time. It's too hot outside to not have a cool house.", "pics": null, "resp": {"time": 1621084690516, "text": "Mrs Green we were glad to help. Great customers like you make this job fulfilling and enjoyable. Paul."}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "114050383537069673038", "name": "Hannah Kirk", "time": 1621437936964, "rating": 5.0, "text": "Paul is a very up front , honest guy that does great hvac work! 10/10 recommend!", "pics": null, "resp": {"time": 1621566104108, "text": "Thank you so much. Your house turned out so nice."}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "108934406164495307592", "name": "Jo Ann Bishop", "time": 1611009704355, "rating": 5.0, "text": "Paul always goes above and beyond when we have a problem. When we call him he comes right out and sees what the problem is and doesn't leave until he fixes whatever is wrong.  He's friendly and dependable. We very highly recommend him for your A/C and heating needs.", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "106781368308377349651", "name": "don hinze", "time": 1610498413827, "rating": 5.0, "text": "Paul was on time and friendly, easy to work with. He understood untimely and costly repairs can be a setback and seemed fair in his pricing. I always appreciate dealing with honest people that treat people fair!  Thanks Paul!", "pics": null, "resp": {"time": 1610978044354, "text": "Thanks Don we like working for customers like you.Cheers"}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "114158822162003536110", "name": "Leif Espelund", "time": 1589806285955, "rating": 5.0, "text": "Paul and his associate responded quickly to our call. We have a very old A/C compressor unit that, while still running, has gotten very loud. I appreciate that Paul recommended some options for making it quieter and didn't just suggest that we need to buy a new system. We had him replace the fan and motor, which definitely made a difference and will allow us to postpone the big investment a bit longer.", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "103535033451405808647", "name": "Ron Booth", "time": 1593183275118, "rating": 5.0, "text": "I discovered Metro Climate Systems with an Internet search along with several others. Paul responded immediately! He came out to my Mother's house and quickly diagnosed the problem and gave me a very reasonable estimate that happened to be the lowest. We gave Paul's company the job and the work was professional, quick and high quality! I live in Atlanta and My Mother (who is 90 years old) lives in Columbus, so finding a company to trust was highly important to me. Paul spoke to my Mother and she said he was very nice and personable.  I strongly recommend Metro Climate Systems to anyone that has to replace their HVAC unit. I am very pleased with their work!!!", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "105602494944328735349", "name": "Angela C", "time": 1605110446401, "rating": 5.0, "text": "They are very knowledgeable,  professional, punctual and not to forget reasonable.  Their prices can't be beat! I don't trust anyone else to work on my HVAC.", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "110878459306743041684", "name": "Stephanie Hutchinson", "time": 1566260824118, "rating": 5.0, "text": "I give Paul and his crew a 5 star. They are very professional and work in a timely matter. My air unit was cooling .I called to schedule for the next day but he was like no we will be there soon as possible. They came and fixed the issue and now my home is like ice. I recommend this company any day.", "pics": null, "resp": {"time": 1566382057589, "text": "Thanks Stephanie we appreciate it."}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "117974355057386940511", "name": "Kenneth Ingram", "time": 1556328490005, "rating": 5.0, "text": "Really great work from a great crew.  Paul and his associates make you feel like family while giving you the best service possible for a great price. I wish all businesses would take care of you like these guys!", "pics": null, "resp": {"time": 1556535525069, "text": "Thanks Ken"}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "105988283350760220484", "name": "Jeffery George", "time": 1581114530300, "rating": 5.0, "text": "Quality and very professional. Paul s team replaced our entire system in our home here in the Overlook  neighborhood in Columbus, Ga. Fast seevice. Excellent job. Thanks Paul.", "pics": null, "resp": {"time": 1581120402099, "text": "Jeffery we really appreciate the job and the review. Please thank Mrs.  Shannon for us as well.  Paul. P"}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "110810756996976647093", "name": "Glenn Ware", "time": 1545951109461, "rating": 5.0, "text": "Great guys and very professional... Did a great  job quicker than expected... Would recommend to anyone... Thank you for keeping me updated through out the process.. . It was a pleasure doing business with you.", "pics": null, "resp": {"time": 1574771033438, "text": "Glen thanks for your trust."}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "107602205900381285792", "name": "Curt Stephens", "time": 1566433183283, "rating": 5.0, "text": "Paul has serviced my house a couple of times now & has done a great job. He is quick to get out & repair your system to keep you comfortable. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "111208118796739878543", "name": "paul potter", "time": 1558445169765, "rating": 5.0, "text": "Honest reliable service. Right Scott Hamil?   I spoke with you the day after we rushed over to your house and fixed the problem. You were happy and were suppose to pay your bill like you had said that you were going to do. today is 5/21/19 and its still not paid. It is very costly to run company trucks up and down the road each day.And hire great technicians. The bill reflects a 75  transportation fee and our company rate of 75 dollars as well. the part was 28 dollars at my cost.  You knew this Scott.  I do not know anything about your fan motor going out . It had to be two days later because I spoke with you the following day and you were thankful and praising us for getting you from the 90 degree heat.  I really doubt your fan motor went out Scott. If it did then you should have called and we would have came back and replaced it. And added it to your bill that has yet to get paid.   I have never met you personally but though that you were a nice person on the phone. Then I read the lies you have wrote about my company.I do not appreciate it one bit Scott.  I am very disappointed and will be praying for you. Metro Climate Systems GUARANTEES every job we do Scott. I will put 15 years of my reputation on it. Scott pay your bill .", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "103280155090122358204", "name": "Tim Thompson", "time": 1572739508938, "rating": 5.0, "text": "Service technicians were knowledgeable. Solved wiring and control issues. Will use again.", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "117725004709720589230", "name": "Peter Judkins", "time": 1416865040570, "rating": 5.0, "text": "Outstanding furnace repairs in Valley, AL! I just want to say thank you to you and your staff for the great service that you have given us over the last year. It has been a pleasure to do business with you and your team. Everyone was great to work with, and we took comfort in the fact that we didn’t have to worry – everything was done timely and professionally, and you kept us informed of what was happening. Thanks for heating repair!", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "101374912185895240708", "name": "brett rupert", "time": 1538672182448, "rating": 5.0, "text": "Highly qualified, prompt service and great prices. I would recommend them to anyone in need of an A/C tune-up or complete replacement.", "pics": null, "resp": null, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "104033352725708529577", "name": "Chennan Xue", "time": 1556896254261, "rating": 5.0, "text": "Professional. Fast. Reliable.", "pics": null, "resp": {"time": 1574771008006, "text": "Thanks mr. Xue I feel honored having a customer like you."}, "gmap_id": "0x888cbb587404ae01:0x91ea6a4dfe910c5a"}
{"user_id": "109821840205617824562", "name": "Mark Black", "time": 1614864481406, "rating": 5.0, "text": "They do my maintenance are on time are they will call good people good price", "pics": null, "resp": null, "gmap_id": "0x888a3eceac4d96a1:0x4f002f871e3a8189"}
{"user_id": "116545941046793453086", "name": "Cody Boos", "time": 1604167195789, "rating": 5.0, "text": "Ive been with them for over a year. Love my job and the people i work with. Its a family atmosphere and they treat us with respect and you feel valued as a employee .", "pics": null, "resp": null, "gmap_id": "0x888a3eceac4d96a1:0x4f002f871e3a8189"}
{"user_id": "116212296441715458265", "name": "Phillip Fikes", "time": 1597973213252, "rating": 5.0, "text": "Very fast and great prices! Will definitely be using them from now on.", "pics": null, "resp": null, "gmap_id": "0x888a3eceac4d96a1:0x4f002f871e3a8189"}
{"user_id": "116398307023566995766", "name": "Adam Steele", "time": 1607362107155, "rating": 5.0, "text": "Done a great job and a fair price !", "pics": null, "resp": null, "gmap_id": "0x888a3eceac4d96a1:0x4f002f871e3a8189"}
{"user_id": "113909580564331987965", "name": "ChopinLover", "time": 1610724921954, "rating": 5.0, "text": "Very professional with great value", "pics": null, "resp": null, "gmap_id": "0x888a3eceac4d96a1:0x4f002f871e3a8189"}
{"user_id": "103964149178724822798", "name": "J316", "time": 1410198169562, "rating": 5.0, "text": "A year or so ago I had them replace my gas furnace under my house. They installed a MayTag unit that has an incredible warranty period. I like the unit so far with zero issues and the installation was done very well. They seem like good folks. Today a friend had them come out and repair her outside airconditioner. Phil was very knowledgeable, thorough and nice, did a great job. I would highly recommend these folks for and repairs or installation you may have.", "pics": null, "resp": null, "gmap_id": "0x888a3eceac4d96a1:0x4f002f871e3a8189"}
{"user_id": "101833257674157182849", "name": "Alex Donaldson", "time": 1621594137671, "rating": 5.0, "text": "I would HIGHLY recommend Polar Bear Services for any and all cooling and heating needs. Mr William Weller and his son bring years of incredible experience in this industry - and both individuals provide service with the highest of quality and customer care. During my most recent repair service, I was made informed of the stages of progress throughout the entirety of the process and I very much appreciated the clarity into the repairs being provided. The repair work was performed after hours and while my kids were asleep, which required agility in performing the services to not disturb anyone - and I very much appreciated the kindness shown as this undoubtedly make the job more challenging. If you are in need of repairs, or a new unit, I would not consider anyone else other than Polar Bear Services.", "pics": null, "resp": {"time": 1621596276345, "text": "Thank you very much for the kind words, call us anytime you have a issue.  We appreciate you as a customer.  William"}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "108579767971872313765", "name": "Virginia A", "time": 1598631335130, "rating": 5.0, "text": "Very polite and friendly technician, service was prompt and easy to setup, with a convenient digital invoice at the end. Really affordable for commercial service too. Will definitely use this company in the future!", "pics": null, "resp": {"time": 1598869657775, "text": "Thank you very much for the review."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "106938590083667564713", "name": "Regina Evans-Barrentine", "time": 1605724612032, "rating": 5.0, "text": "My husband has been piecemealing our 30 yr old HVAC unit for 8 years and finally, the heat condenser rusted out, clogged up to the point carbon monoxide was present.  We shut the unit down and have been riding it out for a few weeks without heat or air not wanting to spend a lot of money going into 'Winter 2020' during a pandemic.  Now it is getting down into the 30's, so we made the calls...  The moment I contacted Polar Bear Services, Billy Weller, the owner responded.  I told him what was going on, what we needed and wanted from the type of unit to warranties. Mr Weller gave us a quote and offered several payment options.  We had other quotes to compare this to and Polar Bear was by far the most affordable for the exact same system. We chose Polar Bear and Mr Weller had his crew here the following morning to replace the entire system.  The technicians were on time, very polite, professional, know what they're doing AND they replaced the old single-wall pipes to double-wall getting us up to Code too.  I strongly recommend Billy Weller & Polar Bear Services... I give Polar Bear an A+!", "pics": null, "resp": {"time": 1605747769788, "text": "Thank you so much for the praise, we are excited have earned you as a customer.  Enjoy your new system and call us anytime..."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "101656988701849184254", "name": "Chase Fowler", "time": 1615987233096, "rating": 5.0, "text": "Wonderful company. Took care of my issues within a day.", "pics": null, "resp": null, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "100764520219409728140", "name": "Tamika Johnson", "time": 1592655872115, "rating": 5.0, "text": "We had a issue with our system not cooling and had several companies come out for a quote.  Polar Bear services was the cheapest quote by far and had the install completed the next morning.  The techs did a great job and I would highly recommend them.  Thanks Polar Bear....", "pics": null, "resp": null, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "103886813974128055939", "name": "Kathy Egsieker", "time": 1579822786981, "rating": 5.0, "text": "I was very pleased with Polar Bear Services.  I had a new heating and air system put in.  The price was better than other places I called.  The service men were very courteous and clean cut.  I would highly recommend them!!", "pics": null, "resp": {"time": 1580926840727, "text": "Thank you for the positive review, call us if you need anything.,"}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "103408619625704099548", "name": "TOM EICHHORN", "time": 1580873523927, "rating": 5.0, "text": "I have used Polar Bear for over 10 years. They provide prompt, honest and reliable service. I have recommended them to many friends and neighbors and they always deliver! If you need a company that provides value and service after the sale, you should call Polar Bear..", "pics": null, "resp": {"time": 1580926446449, "text": "Thank you for being a valued customer, do not hesitate to call us if you ever need anything."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "103232427254896618029", "name": "Roxanne Corbett", "time": 1580417606637, "rating": 5.0, "text": "I am writing this review as both a customer of Polar Bear AND as a business owner that has referred Polar Bear to many of my own clients over the years.  I am very picky about which contractors I refer, and I can tell you that I always feel confident about sharing Polar Bear's info with my clients and friends.  They are honest, do great work, and have helped save my clients, as well as my own household, a lot of money over the years.  This is a very trustworthy company, and they work hard to have a good reputation in the community.  I can highly recommend them for any residential or commercial HVAC service work and/or installations.", "pics": null, "resp": {"time": 1580926751545, "text": "Thank you for the great review, and it is a pleasure taking care of EXP Realty.  Roxanne Corbett is one of the best realtors out there."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "118057237057206879479", "name": "Bill Corbett", "time": 1580436518263, "rating": 5.0, "text": "As one of the only Master Inspection Companies in the state of Alabama, we recommend Polar Bear Services. They break the typical mold with many HVAC companies who put the \"con\" in con-tractor. The team at Polar Bear is knowledgeable, trustworthy and professional. We use them on our private residence as well as our client's homes!", "pics": null, "resp": {"time": 1580926677652, "text": "Thank you for the positive review, you are the best inspection company in the business and highly recommend Magic City home Inspections for any new home buyer."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "115846026166335566843", "name": "Melanie Edwards", "time": 1581113413033, "rating": 5.0, "text": "Polar Bear is the best!  They offer great prices and are so easy to work with!  They are quick to respond and always on time. The technicians are polite and friendly.", "pics": null, "resp": {"time": 1581119031849, "text": "Thank you so much for the compliment.  If you ever need anything, dont hesitate to call us..."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "115379642987209443914", "name": "Candice Glover", "time": 1581126893555, "rating": 5.0, "text": "A great, honest company ran by a hard working man that cares for his employees and makes sure all the technicians are well trained and certified. The technicians are professional and friendly and do a great job. I would recommend to everyone!", "pics": null, "resp": null, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "117139372523754787675", "name": "Jodie Campbell", "time": 1580388280491, "rating": 5.0, "text": "We were having issues with our AC not working and we called Polar Bear to come out and check the problem. As soon as the tech arrived, he looked at my unit and immediately saw the problem. He fixed our unit that day and we haven’t had any issues since. The tech was very knowledgeable and very timely! Would recommend this company to anyone!", "pics": null, "resp": {"time": 1580926772960, "text": "Thank you for the positive review, call us if you ever need anything."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "107141588685328123378", "name": "Jim Harpole", "time": 1580922235026, "rating": 5.0, "text": "Polar Bear has serviced my old units and then replaced them both as they failed. They are responsive and their install prices can't be beat (I checked a lot of prices). The Trane systems they install are great. They can also give you a price over the phone for a standard installation.\n\nHighly recommended!", "pics": null, "resp": {"time": 1580926350358, "text": "Thank you for the kind words, do not hesitate to call us if you ever need anything...  William"}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "115165567566103279537", "name": "Frank Patel", "time": 1590685438363, "rating": 1.0, "text": "I was very disappointed. I has called in to fix my commerical air conditioning unit. The owner son came and look at it. He put $1100 worth of freon and told me it had a leak. It took him that long to figure out it had a leak. And made me paid for it . And they charge way to much for that freon compare to other companies.", "pics": null, "resp": {"time": 1590692009990, "text": "We have no record of frank patel in our system or 1100.00 worth of freon in our system.  Also, our techs do not do work that is not authorized by the customer.  You are welcome to call us to discuss this.  497-2327"}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "100430519978248252239", "name": "Lisa Bennett", "time": 1579983853055, "rating": 5.0, "text": "They were so nice and helpful! Polar Bear came right out when I needed them to. I will definitely use them every time from now on!", "pics": null, "resp": {"time": 1580926818832, "text": "Thank you for the positive review,  call us if you need us."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "111528271863856993422", "name": "Joey Westover", "time": 1580566753049, "rating": 5.0, "text": "Quality work, great service and reasonable prices. We had a problem that stumped some other company but Polar Bear fixed it!", "pics": null, "resp": {"time": 1580745379121, "text": "Thank you Joey - We are glad we could resolve your issue fast! Please let us know if you need anything else."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "110695325107580322387", "name": "nicky johnson", "time": 1581533280352, "rating": 5.0, "text": "Hired Polar Bear for a issue another company had quoted at over 1000.00 to repair. The tech from  Polar Bear came out and fixed the problem, and it wasn't even the correct problem the first company had said it was.  We are very happy with their service and would use Polar bear again.  They saved us a lot of money...", "pics": null, "resp": null, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "112164331535381577259", "name": "Danny D'Armond", "time": 1559171795290, "rating": 5.0, "text": "Unbelievable service and company! I called in the later hours of the day and they showed up within 30 minutes! Jamal was very professional and had our ac unit fixed within 2 hours! We have an older house and they were able to have the parts to fix everything! I highly recommend this company and would give them 10 stars if google would let me!", "pics": null, "resp": {"time": 1580747299334, "text": "Thank you Danny for the great review, please don't hesitate to call us if you ever need anything."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "105474474868326636829", "name": "Victor Olivas", "time": 1577302731550, "rating": 1.0, "text": "Techs are pretty clueless about repairs.  I almost trashed a perfectly good air curtain refrigerator.  Im so glad I got a second opinion.", "pics": null, "resp": {"time": 1579647360639, "text": "We apologize that you were not happy with our service.  I was not able to find your name in our data base to review the invoice.  Could it have been under a business name? We would love the opportunity to talk with you regarding the issues as mentioned.  Thank you"}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "107035140932368318054", "name": "Sydney Williams", "time": 1580511590814, "rating": 5.0, "text": "Polar Bear did a great job for us.. Definitely would recommend them to others...", "pics": null, "resp": {"time": 1580745424273, "text": "Thank you Sydney for the 5 star review!  Please let us know if you need anything else."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "117006456013494024217", "name": "Chad Mosley", "time": 1580340703087, "rating": 5.0, "text": "Was referred to this company by a friend, they arrived when they said they would and price was very reasonable. Would highly recommend them.", "pics": null, "resp": {"time": 1580747042913, "text": "Thank you for the review, call us if you ever need anything."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "100220738240436512399", "name": "Courtney Parrish", "time": 1562885739492, "rating": 1.0, "text": "My fiancé and I just recently bought a house. We called Polar Bear services to come out to check our ac unit because of something to do with our inspection. They said everything was fine. A week later, the temperature in the house starts rising so we call them out to look at it again. First, they told us they’d be out in a few hours since no one was home at the time. They call my fiancé back a couple minutes later and say they are at the house waiting on us and he proceeds to tell the guy he told someone on the phone no one was there for at least another hour. The service guy got angry with us because of poor communication within the company. Then, the service guy proceeds to tell me it’s because the unit “might” be low on Freon. He never looked at the system in the basement, just outside so I don’t know how he got an accurate solution.  He charged us for the most expensive Freon (he only used 1 lb) and $99 for less than an hour of service. Needless to say, it was a complete waste of time and money because the problem was ongoing and we had another company come out a few days later. That company was able to tell us the problem right away which the other guy would have, maybe, known had he looked at the system in the basement. Needless to say, the Polar Bear services guy didn’t seem to know what he was doing but had no problem charging an unnecessary, large amount of money. We will not be using this company again.", "pics": null, "resp": {"time": 1579647647499, "text": "I am sorry that you were not happy with your experience with Polar Bear Services.  I reviewed your invoice and saw where the tech had added one pound of R22 to your system to achieve his pressures.  We were unaware of your dissatisfaction with our services and would like the opportunity to talk to you.  Thank you."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "101283738336353847827", "name": "Sam Knight", "time": 1580774902232, "rating": 5.0, "text": "Very pleased with the install and the technicians\nWe’re great", "pics": null, "resp": {"time": 1580926573903, "text": "Thank you for the positive review, do not hesitate to call us if you ever need anything."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "101956503738807768192", "name": "Will F", "time": 1543818475115, "rating": 5.0, "text": "Replaced the duct work and registers throughout the house, and a new HVAC with additional returns.  Prices were better than most and they did a great job.  Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "106228085695552404043", "name": "Courtney Gilliland", "time": 1543458455968, "rating": 5.0, "text": "Polar bear had to come and service my unit recently, they were very timely and professional. They fixed the problem in an appropriate amount of time and the price was very reasonable!! We will be calling them for any other issues!! Great company!", "pics": null, "resp": null, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "100466613025618320330", "name": "Joseph Rogers", "time": 1579989162228, "rating": 5.0, "text": "We called and immediately spoke to someone who sent a tech to take a look at our heating/air unit.\nUp and running!", "pics": null, "resp": {"time": 1580926799378, "text": "It was a pleasure taking care of your needs, don't hesitate to call us if you ever need anything."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "114711189962216791268", "name": "k Harris", "time": 1530908844539, "rating": 1.0, "text": "$3850 + $79.99 wasted!!!!! Our AC stopped working and we were advised we need a coil and condensor replaced. The fee for that was $3850. A month later the ac went back to blowing hot air. We called for PB to come back out and the technician stated a part was loose and needed to be replaced from the first service job and we would not be charged. That fixed it for about another month or two. The next technician stated a frog short circuited the system and he removed it and the ac went back to blowing like it should for another couple weeks. Every visit after the alleged frog incident has been one excuse after the other. We're doing renovations and were told the filters needed to be changed more frequently and the house would cool down. We continued to change them weekly and still no luck. We called yet again to advise of the continuing problem only to be charged $79.99 for them to clean the coils and blame the filters. The AC still continued to blow hot air and then the attic began to leak. So ANOTHER call was made. The technician stated the coils were frozen and that the ac needed to be turned off and to change the filter again (at this point we're already changing it weekly and have completed the renovations). The house still didnt cool down and the ac was still leaking. Another call was made the same day (as a leaking attic is urgent and ruining the ceiling) the technician returned and said the coil was shooting out water (ya think!!!! That's why we called in the first place!) had they bothered to look and not blame it on the filter they would have discovered it on the first visit. So the technician fixes the leak and says give it time, the house will cool. Guess what, it's still not cooling!!! So we wait a week (we work and can't keep taking off for someone to come out) and call them back out. The technician now states the roof doesnt have enough vents  and the attic door is off centered and that is what's causing the house not to cool. He said he tweaked something and give it a minute and it will cool. He also states he was advised to charge for coming out. What is there to charge for? The house is still hot, the temperature is steady rising as I type, and the original problem has not been fixed. They're basically grasping  at straws at this point and have run out of probable excuses.  Be prepared to throw away $4000 plus dollars and live in heat if you use this company. Currently in search of another AC company.", "pics": null, "resp": {"time": 1580747420287, "text": "We are sorry to hear about your experience, we would appreciate if you could call us to discuss this and see if we could resolve your problems."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "103534633757809076695", "name": "Bill Al Hamdeh", "time": 1567215594959, "rating": 5.0, "text": "Good service with good timing", "pics": null, "resp": {"time": 1580747110817, "text": "Thank you Bill for the review, if you ever need anything please do not hesitate to call us."}, "gmap_id": "0x88890cca7bea44a9:0x5936eb57f8e3cdef"}
{"user_id": "103549760271612502696", "name": "Sue Watson", "time": 1598064903417, "rating": 5.0, "text": "I called at 5:05 Friday afternoon, not daring to believe I’d get anything but an answering machine.  Instead, I got the owner who said he’d have someone here shortly. Minutes later, the talented technician arrived.  He was here until after 7, never complaining once.  I have a cool house and a new appreciation for customer service!", "pics": null, "resp": null, "gmap_id": "0x888c9358e3ba24ef:0xb751f2ca72d87b67"}
{"user_id": "100290867287176367001", "name": "Grace Lowery", "time": 1561484896003, "rating": 5.0, "text": "Came to help us with our janky ac unit, and helped us learn how not to break it again. He was super nice and polite, and didn’t talk down to me. Our power bills have dropped a good $75 per month in the summer. Excellent company with some very skilled folk.", "pics": null, "resp": null, "gmap_id": "0x888c9358e3ba24ef:0xb751f2ca72d87b67"}
{"user_id": "111491746092800773341", "name": "Blake L", "time": 1497905608584, "rating": 5.0, "text": "Steve and his crew are absolutely amazing! My husband and I rent a home in Opelika and they came to replace some of the duct work and the unit itself. They were nothing but professional and treated us like we were the customer VS just \"The renters\" as you get with a lot of places. One technician even vacuumed my floors where they completed the work and made me double check that they had left nothing dirty behind. I would highly recommend them and will be using them when we get our permanent home as well! -Thanks Steve and crew!!", "pics": null, "resp": null, "gmap_id": "0x888c9358e3ba24ef:0xb751f2ca72d87b67"}
{"user_id": "113551276230156274442", "name": "Chole Jinnie Seol", "time": 1539836560425, "rating": 1.0, "text": "the worst experience with this company", "pics": null, "resp": null, "gmap_id": "0x888c9358e3ba24ef:0xb751f2ca72d87b67"}
{"user_id": "100453742074267234398", "name": "Clay Edwards", "time": 1615931713996, "rating": 5.0, "text": "Reliable, and competent service techs when it comes to any kind of ice machine.", "pics": null, "resp": null, "gmap_id": "0x8892ecdf0bb6c601:0x237a0d93b0de4596"}
