{"user_id": "117431907371612435736", "name": "Tim Howard", "time": 1629488557252, "rating": 5.0, "text": "Extraordinary, exceptional professional skilled technical service, prompt and timely without excuses or delays, proactive communication and responsive to any inquiries, above all extremely ethical and honest who does what he says and more with quality, care, and concern at very fair reasonable charges. Cannot say enough positive about my experience here. Highly recommend to anyone.  Can't see myself ever going anywhere else.  5 Stars is truly not enough to relate my experience or recommendation here.", "pics": null, "resp": {"time": 1629494237195, "text": "Thank you sir, you are too kind!!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "107092584547621588157", "name": "Megan Rimkus", "time": 1621533334235, "rating": 5.0, "text": "Very nice and helpful\nDefinitely recommend!", "pics": null, "resp": {"time": 1629494686257, "text": "Thank you!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "109679533976898773656", "name": "NANCY STUART", "time": 1600732428547, "rating": 5.0, "text": "CS computer Repair is a gem! Great service and amazing repair. CS Computer Repair is the Best! Worth the drive from anywhere!", "pics": null, "resp": {"time": 1610338050177, "text": "Thank you Nancy!!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "117533693521791188327", "name": "John Hallam", "time": 1611184166386, "rating": 5.0, "text": "If you have computer problems,  this is the place to get them fixed. My humble opinion.", "pics": null, "resp": {"time": 1629494689142, "text": "Thank you!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "113094200947012487159", "name": "Richard Young", "time": 1556921218570, "rating": 5.0, "text": "Had what I thought was a major issue with my laptop.  After Chad looked at my computer he called and said it would be an easy fix that would save me money.  Extremely quick turnaround with outstanding customer service!  Highly recommend! 5 STAR RATING!", "pics": null, "resp": {"time": 1581868830176, "text": "Thank you sooo much!! Great brags!! Look forward to your next issue :)"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "109031019951570301892", "name": "Judy huggins", "time": 1582239447942, "rating": 5.0, "text": "Chad is my first choice when it comes to repairs for my computer! He is very intelligent and knowledgable and I wouldn't think of going any other place! Thanks so much for the quick turn around Chad!!", "pics": null, "resp": {"time": 1582243731571, "text": "Thank you!! You are more than welcome. I hope this fixes you up for another 3 years!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "101894832955816079630", "name": "Bobbie Masters", "time": 1599750722372, "rating": 5.0, "text": "Chad is the best. Give him a call.", "pics": null, "resp": {"time": 1599754384104, "text": "Thank You"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "116443158753171517265", "name": "Fred Lanting", "time": 1581697180208, "rating": 5.0, "text": "Chad works faster than I can think, but is a lifesaver to this old pen-&-pencil guy!  If you are lost in the woods and can't tell north from west, and wonder how to avoid the bears and skunks, Chad's the boy scout to call !", "pics": null, "resp": {"time": 1581868679615, "text": "Thank you for the stars Mr. Lanting. We're always here for you."}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "104914699709614385181", "name": "Ronald Lynch", "time": 1585107432092, "rating": 5.0, "text": "Chad Sanders has always done our laptop work. Setup our wifi's printers. I trust him 100%", "pics": null, "resp": {"time": 1590598954087, "text": "Thank you so much Mr. Lynch.  We appreciate your business."}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "117463326213837516738", "name": "Robert Cox", "time": 1546374310397, "rating": 5.0, "text": "Chad did a fantastic job very quickly diagnosing and repairing a new computer rig my son built up, and all at a fair price with solid communication throughout the process. He is a first class professional.", "pics": null, "resp": {"time": 1548789726916, "text": "Thank you soo much"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "110542811040760995079", "name": "Cole Benefield", "time": 1552358915839, "rating": 5.0, "text": "Chad repaired my laptop issue; replaced HD, restored, and cleaned, faster than I could get back to pick it up. (Less than a day).  All for an extremely reasonable price. I will not look anywhere else for my computer needs.", "pics": null, "resp": {"time": 1552366905745, "text": "Thank you soo much !! And for the stars!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "114927327662810382262", "name": "Eric Johanson", "time": 1544204224155, "rating": 5.0, "text": "Chad has taken care of issues on several of my computers. They run great now! Awesome service, my highest recommendation!", "pics": null, "resp": {"time": 1545082989510, "text": "Thank you sooo much!!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "109340829956709534620", "name": "Merideth Williamson", "time": 1585107531167, "rating": 5.0, "text": "Chad knows his stuff! He saved lost files for me, fixed the virus I got and didnt charge me much.", "pics": null, "resp": {"time": 1590599451782, "text": "Thank you. We are so happy we could be there to help you."}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "116785958181987306445", "name": "Patricia James", "time": 1585107651834, "rating": 5.0, "text": "Networking our printers and file share server in just a couple of hours, complete without having to rewire. We are now wireless and secure. Thnk you Chad Sanders You have our vote!!", "pics": null, "resp": {"time": 1590599360969, "text": "Thank you so much . If you need us we are happy to assist  you with your needs."}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "107638193953968736957", "name": "James Capshaw", "time": 1553705544546, "rating": 5.0, "text": "I was having computer issues.  CS Computer Repair services corrected my problems and I had my computer back in 3 hours.  Thanks for the great service.", "pics": null, "resp": {"time": 1555363369485, "text": "Hey Thanks James!!!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1587392267999, "rating": 5.0, "text": "Great work...fast response", "pics": null, "resp": {"time": 1590599068555, "text": "Thank you Mr. Dunnavant. We're glad we could help."}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "106781902455001542918", "name": "Thomas Weiss", "time": 1564514857150, "rating": 5.0, "text": "shoulders and head Better than the rest imo", "pics": null, "resp": {"time": 1552616368441, "text": "Thank You So Much for the stars"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "115088105762868696619", "name": "Herald Jones", "time": 1548790201476, "rating": 5.0, "text": "We use him even on our new devices. Comes out and sets everything up vor a very reasonable price!", "pics": null, "resp": {"time": 1552616400712, "text": "Thank You"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "110436442795919995652", "name": "William Rutherford", "time": 1580613815704, "rating": 5.0, "text": "Thank you Chad!", "pics": null, "resp": {"time": 1581868761569, "text": "Thank you for the stars!! We're always here for you!"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "114325858468085645537", "name": "Venita Shirley", "time": 1499907802463, "rating": 5.0, "text": "Works on our computers and is very knowledgeable and helpful!!!", "pics": null, "resp": {"time": 1534640236039, "text": "Thank you"}, "gmap_id": "0x8889e5d35d517133:0x31e44b09e0cf4f55"}
{"user_id": "115420156037973058693", "name": "Stacie Gilham", "time": 1610558642104, "rating": 1.0, "text": "After setting up my laptop, I was unable to change any settings requiring an administrator password due to Yeltek having themselves as the administrator.i emailed them an no response. I called and had a return called stating I could use my laptop without the administrator password. That is true, under the guest account they set up for me. I want full control over the laptop I purchased, not for Yeltek to have any account on it. I have since sent another email requesting the administrator password and left two more messages due to no one ever there answering the phone. Still no response. Bad service. I wouldn't recommend this company to anyone.", "pics": null, "resp": {"time": 1619652684700, "text": "The laptop was invoiced to Kennedy Galvanizing. YELTEK has reached several times to their office (Allen) and called Dollie/Stacie at home. We have spoken to Dollie (Stacie grandmother) and asked for her to contact us. We have attempted to guide Dollie over the phone what she needs to do. We have recommended dropping the device by the office to make this small change. We have not received follow up from Dollie or Stacie."}, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "114829167387459644792", "name": "Matt 34 Ronald Holloway", "time": 1544845215774, "rating": 1.0, "text": "Haven't been", "pics": null, "resp": null, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "106805795004778065305", "name": "Bess Wood", "time": 1580906676133, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "105588510705567563559", "name": "Vicki Morris", "time": 1629080444432, "rating": 5.0, "text": "This team is very knowledgeable about cyber security, and they are dedicated to sharing their insight with the entrepreneurial community. The company’s CEO, Jamie Miller, very graciously volunteers his time by delivering informative and engaging seminars for our technology focused networking group, RISE. We highly recommend the Mission Multiplier team.\n\n-Vicki Morris for R.I.S.E.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107034948609897467895", "name": "Nisheeth Agrawal", "time": 1629126811414, "rating": 5.0, "text": "Mission Multiplier is an outstanding company providing great service in our community and nationally. Jamie Miller is always willing to step up to promote security in our community. He takes time to listen to his customers and provides the best solution.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100147647911267833947", "name": "Matthew Lewis", "time": 1629120635377, "rating": 5.0, "text": "Mission Multiplier has been a wonderful company to work for. I have worked for them for the past nine months, and it has been an absolute pleasure. Jamie Miller, the CEO, goes above and beyond in every way imaginable. He has been a crucial part in helping me grow in my role at Mission Multiplier, and is dedicated to providing for the needs of his customers.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115386005592007264164", "name": "K Lamb", "time": 1629131235070, "rating": 5.0, "text": "Mission Multiplier provided outstanding Cybersecurity and Risk Management support to our team supporting NASA - Marshall Space Flight Center. The Mission Multiplier teammates were very professional, engaged in continuous learning and supporting the client's mission.\n\nJamie Miller is a people-first leader and has what it takes to recruit, train, and equip professionals to support a wide array or client engagements. I would also recommend taking a look at their MARS Suite product for providing a clear picture of Cybersecurity status and Risk Posture.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107309222857998095217", "name": "Rish Wood", "time": 1629059024680, "rating": 5.0, "text": "I have never seen such security capabilities in one sensor. My colleagues in cyber are going to hear about Mission Multiplier’s network security product. It is outstanding, period.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "112443048352261387274", "name": "Adam Stephens", "time": 1618336813221, "rating": 5.0, "text": "I don’t know that you can find a finer guy than Jamie Miller anywhere in Huntsville... as dedicated a leader as I’ve ever encountered. You can absolutely trust that Jamie and his team at Mission Multiplier will stop at nothing to make sure you’re cyber-secure. You can sleep easy at night when you’ve got them watching your back.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "101422040376000709528", "name": "John Reed", "time": 1618335805695, "rating": 5.0, "text": "I have had the privilege of working with Jamie Miller and his team for the past couple of years. I have been extremely impressed with their team dynamics and collaborative approach as they develop products and solutions pertaining to everything Cyber Security. I am looking forward to continuing to work with them now and in the future.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115821787009983001468", "name": "Tina Cerullo", "time": 1618404602963, "rating": 5.0, "text": "Mission Multiplier has been one of the best companies I have had the pleasure to work with over the past 4 years. From the business/financial side, they have always been very professional, responsive and helpful in all aspects of the job. I look forward to a continuing relationship!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111573835021358067377", "name": "Lea Cahoon", "time": 1618499670907, "rating": 5.0, "text": "Mission Multiplier is a very professional and knowledgeable company. Jamie Miller is a stand up guy and leads his team exceptionally!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106652511385302327972", "name": "Ben Denton", "time": 1618435031942, "rating": 5.0, "text": "Really great company with top leadership. Love that they give back to the community!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106390971567146577509", "name": "Mav Rick", "time": 1621608659231, "rating": 5.0, "text": "Very professional and highly capable company with friendly and caring staff. Love doing business with this team.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105361346575269195956", "name": "Lenny Aupperlee", "time": 1613755986432, "rating": 5.0, "text": "In working with Mission Multiplier the level of professionalism and responsiveness was outstanding. They are a go to partner with regards to their work ethics and being able to deliver mission critical solutions.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104227466060819868886", "name": "Brian Lynn", "time": 1598474852149, "rating": 5.0, "text": "Great company!  A team that really believes in what they do.  Mission Multiplier’s team of professionals are always a pleasure to work and collaborate with. I have personally worked with Mission Multiplier on several projects and can confirm first-hand that their dedication, professionalism, and their ability to understand the challenges and develop top-notch innovative solutions is outstanding. I highly recommend Mission Multiplier and look forward to working with the Mission Multiplier team on future projects.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115813992793843123901", "name": "Cassie B", "time": 1618410925171, "rating": 5.0, "text": "Fantastic company. Great people to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "114914613716128112436", "name": "Kevin Repa", "time": 1599065566427, "rating": 5.0, "text": "Mission Multiplier is at the forefront of cybersecurity and great company to work with.  Jamie has built an outstanding team and innovative technologies that can help customers protect their data and systems. In addition, the company is all about ‘giving back’ by contributing to and supporting various local non-profit organizations.  An outstanding company in all respects.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100020360387591352619", "name": "Steven Lloyd", "time": 1598448174353, "rating": 5.0, "text": "The business relationship that has developed between Mission Multiplier and All Points is outstanding. I have had the great opportunity to work very closely with Jamie and his team, witness the phenomenal growth and progress that they have made as a business, and as key member of the community.  Mission Multiplier provides an excellent model of how a small business can make huge impacts!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "109110372081978288489", "name": "Josh Daniels", "time": 1604350658076, "rating": 5.0, "text": "Mission Multiplier is a global business that operates with integrity and a focus of improving the quality of life for its community's stakeholders.  The shadow that its CEO, Jamie Miller,  casts is one of excellence, cultural competence and an innovative spirit which results in an exemplary team and customer focused operations.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107434482445402861371", "name": "David Lefort", "time": 1596829264210, "rating": 5.0, "text": "I've known Mission Multiplier's CEO, Jamie Miller, for more than 20 years, and I find him to be among the most ethical and innovative businessmen I've ever met. He's spoken multiple times at Compliance Week's keystone conference for senior compliance and cybersecurity professionals and is truly a subject matter expert. I also love that his company is made up of employees who have a stake in the success of the venture ... that's what makes it a special organization.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "114624720189605792688", "name": "Johnny Hall", "time": 1596720432128, "rating": 5.0, "text": "The team at Mission Multiplier is top notch. They are cybersecurity experts in every aspect. In addition, they are forward leaning in innovations and a highly professional organization. All members of the team are personally committed to excellence and helping their clients be as successful as possible. We at All Points are working with MM on a regular basis and we are finding new customers and expanding current work at NASA and DOD. They are a leader in Huntsville and in the cyber field at large.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105661008013919425625", "name": "Leigh Ann Pierce", "time": 1604527598185, "rating": 5.0, "text": "I've watched the growth of Mission Multiplier since its inception and witnessed the hard work Jamie and his team perform daily.  Jamie and his team are dedicated, knowledgeable and passionate about the service they provide.  Great company to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115462152938497558145", "name": "Courtney Langham", "time": 1598891357455, "rating": 5.0, "text": "Mission Multiplier is one of the best companies that I have worked for.  I have had the pleasure to work for Jamie Miller over the last 4+ years and have witnessed his growth and professionalism first hand.  His style of leadership is second to none and the Mission Multiplier team members mirrors his dedication to satisfying the needs of his business partners.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102954863842082229154", "name": "Juliet Fletcher", "time": 1596804152192, "rating": 5.0, "text": "What a super team to work with! Mission Multiplier's team of experts makes easy work of solving dynamic and complex cybersecurity problems and challenges. Jamie and his team are dedicated, hard working, innovative, and a pleasure to collaborate with. Their understanding of the challenges faced by businesses trying to protect their assets is grounded in their experience and knowledge. I highly recommend Mission Multiplier.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115121401893760241564", "name": "Brandon Artis", "time": 1604423826601, "rating": 5.0, "text": "Mission Multiplier is an incredible company to work for, very professional and responsive. They are charitable and very involved with the community. 11/10 would recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104685810161965618184", "name": "Ken Phillips", "time": 1618344966537, "rating": 5.0, "text": "Mission Multiplier is an outstanding company that is doing exceptional work for the federal government.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111911850492135989832", "name": "Chase Hall", "time": 1604441824667, "rating": 5.0, "text": "Mission Multiplier has been an exceptional company and has been willing to step out and help its community and other businesses. I would highly recommend working with them!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "110221625988003991158", "name": "Morgan Thomas", "time": 1594394172906, "rating": 5.0, "text": "Working with Mission Multiplier was a great experience. The whole team was professional, friendly, and knowledgeable. The time spent working with them included a welcoming atmosphere and an inviting company culture. Couldn’t recommend them more!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100805439980606406650", "name": "Mike Johnston", "time": 1596729951868, "rating": 5.0, "text": "The team and leadership at Mission Multiplier is outstanding.  They have skills and expertise to meet every need, and they provide innovative solutions.  They are also very invested in their community, and they support other businesses in many creative ways.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111926026178591566929", "name": "Kraig Tersigni", "time": 1584116665433, "rating": 5.0, "text": "The work available at Mission Multiplier is constantly challenging and evolving. This type of environment has open so many doors for me to grow professionally. I can't thank Jamie Miller and all my co-workers enough for giving me the opportunity take my career to the next level. It has been an exciting ride and I continue to look ahead to the future of what Mission Multiplier has in store.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108006492431977914738", "name": "Raymond Corriveau", "time": 1596748693533, "rating": 5.0, "text": "I have found the team at Mission Multiplier to be extremely professional and responsive. The take great care in their work and are dedicated to delivering quality products and services. Highly recommended...", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "101675083957324330607", "name": "Adam Hays", "time": 1604352843911, "rating": 5.0, "text": "Amazing company!  Mission Multiplier is constantly working towards the betterment of the industry they work in, the employees they truly care for, and most importantly, the community around them!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115182799090202321225", "name": "Jason Dinkins", "time": 1586611937900, "rating": 5.0, "text": "I've had the pleasure to work along side of these folks for many years.  Their focus and ability to deliver are second to none.  The Saturn-i VPN solution is the best I have ever used and the implementation has allowed seamless access to remote systems.  Their people are top notch and very professional.  I highly recommend Mission Multiplier because of their focused approach on delivering capable solutions for a wide range of needs.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115508867016190110542", "name": "Leigh Christian", "time": 1594728296620, "rating": 5.0, "text": "Mission Multiplier is one of the top companies I know providing Cyber Security Services!  They are also a treasured member of our community and so supportive of many organizations!  They give back to their community and are servant leaders!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105275735919737857603", "name": "Christy Sanders", "time": 1597263158290, "rating": 5.0, "text": "Mission Multiplier's team is top notch.  They are professional and spend the one on one time that is needed to get a quality product across the board.  EvoTech is thankful for Mission Multiplier's teamwork mentality and excellent product!", "pics": null, "resp": {"time": 1597356753180, "text": "Thank you so much Christy for your kind words.  We really enjoyed working with you and the entire team at EvoTech"}, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "112485836100709309518", "name": "Mark Wensyel", "time": 1604349162238, "rating": 5.0, "text": "Mission Multiplier is a fantastic Cyber Small Business.  The Company has innovative ideas and great community involvement.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105639643052520706886", "name": "Britt Snyder", "time": 1598528884233, "rating": 5.0, "text": "What a super team to work with! Mission Multiplier's team of experts makes easy work of solving dynamic and complex cyber security problems and challenges. The entire team is amazing to work with and the products that have been produced are top level and work just as they say", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116236475828112441008", "name": "Tracey Fagan", "time": 1598453280122, "rating": 5.0, "text": "Mission Multiplier is a very dedicated Hub Zone business in Huntsville. Jamie Miller and his team are very talented in the field of Cyber Security. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104122571866247163873", "name": "Red Sage", "time": 1598541991708, "rating": 5.0, "text": "Mission Multiplier is a wonderful company in Huntsville providing innovative cyber technology solutions. The company's leadership is forward-thinking and very involved in community organizations with a focus on cyber.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105470210020756214533", "name": "Peter Lenzner", "time": 1586532783998, "rating": 5.0, "text": "Mission Multiplier is a terrific company.  They provide comprehensive cybersecurity services that protect mission critical systems and data through powerful data analytics capabilities to ensure the Government’s assets and networks provide the highest level of security for their users and data.  Jamie Miller is innovative technical masterpiece and exceptional leader.  I am happy to give them a well deserving recommendation.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104052476331788469934", "name": "Deanna Justice", "time": 1591235604439, "rating": 5.0, "text": "In my 18+ years in the Security Industry, Mission Multiplier is hands down, one of the best Cyber Security groups I've had the pleasure to work with. Professional, knowledgeable, and always ahead of the curve. Jamie Miller has built an impressive cross-functional team.", "pics": null, "resp": {"time": 1591239769485, "text": "Thank you for your kind words Deanna.  It is really our pleasure to work with exceptional clients like yourself!"}, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116486151308994962919", "name": "Jimmy Kilgore", "time": 1587659207126, "rating": 5.0, "text": "In my 20 years of working in the private sector, Mission Multiplier has been the absolute best of the companies to have worked for. It is almost more like a family business than a corporation. To have been selected to become part of the team was truly a blessing.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "117359512879696216468", "name": "Judy Hobbs", "time": 1598969626409, "rating": 5.0, "text": "Love working with the Mission Multiplier Team. They go above and beyond to help and contribute to any job at hand. Jamie and the Mission Multiplier team do it all with professionalism and positive attitudes.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "110525242526831374560", "name": "John Degory", "time": 1590503646851, "rating": 5.0, "text": "I am very impressed with the Mission Multiplier team and pleased to be part of in my consulting role.  Having worked with many technology companies I am impressed with the talent and how the team collaborates allowing for the best of class solutions and products to be developed.  Engaging the customer or end-user early on, as part of their process,  also offers a collaboration that is directly reflected in all end products.  I look forward to our ongoing relationship with the team as we grow the company and our product offerings.\n\nJohn Degory\nFounding Partner\nJD Technology Solutions, LLC", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100159929200308907103", "name": "Richard L Nichols", "time": 1590505084111, "rating": 5.0, "text": "I've had the pleasure to work along side of these the employees of MI for many years.  They are focused and deliver quality work.  MI's employees are always professional and helpful.  I recommend Mission Multiplier their ability to deliver and focus on customer service.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "103884259181861421054", "name": "Ed Scarborough", "time": 1598624014599, "rating": 5.0, "text": "Mission Multiplier is truly a small business having a large impact to the enterprise security of today's companies and our Government. New technology insertion into today's environments is the \"Mission\" in Mission Multiplier.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108698600039796280056", "name": "Justin Pierce", "time": 1582857188970, "rating": 5.0, "text": "If you live in Huntsville, AL, and your field is cybersecurity, you must consider a career at Mission Multiplier. Barring their many awards as a company, most recently the 2019 Technology Business of the year, and their mission to give back to the community, what truly stands out is how much they care about their employees. In short, no glass ceilings, great benefits, and genuine care for how you want to develop in one of the fastest-growing fields in the world.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "118046262530881075371", "name": "Gabby Harris", "time": 1583779322066, "rating": 5.0, "text": "Mission Multiplier is an amazing company to work for. Since the beginning of my career with company they are family oriented and care about what you are passionate about. If you're looking for a career job and a great company to call home, I certainly suggest reaching out to the Mission Multiplier team!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108813009603894737773", "name": "Brandon Dean", "time": 1582911694026, "rating": 5.0, "text": "Mission Multiplier has been a great company to work for since the very beginning. I've watched the team grow and the company provide fantastic cybersecurity services and tools to all sorts of clients. I'm excited to see where the company goes in the years to come.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116541440182652464678", "name": "Jarrod Hardy", "time": 1604937679235, "rating": 5.0, "text": "Mission Multiplier is a great role modle and we're lucky to have them in the Huntsville area.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116329681049260098404", "name": "Gaines Gravlee", "time": 1596809229014, "rating": 5.0, "text": "The MM Team are not only the premier cybersecurity experts but they are committed to excellence in every aspect of the organization.  Whether your requirements include CMMC, DFARS, RMF, HIPPA, etc. their focus on client success and professionalism is unmatched.  They are knowledgeable and innovative and have become a key business partner for our company.  You also can’t help but be drawn to Jamie’s vision and passion for cybersecurity and the thoughtful way he has structured community support within the company.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108422692653406740512", "name": "Jim Miller", "time": 1582862490627, "rating": 5.0, "text": "Mission Multiplier has an outstanding team of cyber security professionals who are experts in this extremely critical industry. The company is well managed and provides valuable solutions to its customers within a highly ethical and comprehensive framework.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "109093037398670914360", "name": "K C", "time": 1598899949958, "rating": 5.0, "text": "Mission Multiplier have talented cyber security professionals that are dedicated to meet their customers needs.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106064574543880202430", "name": "Melissa Burgee", "time": 1586533583625, "rating": 5.0, "text": "I've worked with Jamie Miller and Mission Multiplier's team for several year's.  It has always been a pleasure working with a professional and capable company!  I look forward to our future association in the upcoming years!!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "101995092516293238382", "name": "Cameron Case", "time": 1590501409639, "rating": 5.0, "text": "Some of the most professional and capable people I have had the pleasure to work with. They are HIGHLY responsive to customer needs and requests.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100129316811665578286", "name": "Cam Bob", "time": 1590435713422, "rating": 5.0, "text": "We work with Mission Multiplier, who provide comprehensive cybersecurity services that protect mission critical systems and data through powerful analytics tools.  I highly recommend this company", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102381540003066152701", "name": "G “Big Kahuna” S", "time": 1586532819437, "rating": 5.0, "text": "I have known Jamie Miller for over 5 years and he has brought together a team of top notch professionals who fully understand cybersecurity and the challenges this creates for our customers and country.  You can guarantee Jamie is on email 24/7, I don't think he ever sleeps.  Highly recommend Mission Multiplier and team for your cybersecurity needs.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111256029775558964189", "name": "Kevin Brown", "time": 1586534282661, "rating": 5.0, "text": "Mission Multiplier has been an tremendous business partner. Their expertise in cybersecurity technology and incredible work ethic has repeatedly proven invaluable in pursuit of business growth opportunities.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115891706930956686301", "name": "Kurt Weidenthal", "time": 1586541123962, "rating": 5.0, "text": "Our cyber focused mentor-protégé relationship has set a phenomenal standard for all of DOD and NASA....thanks to Jamie and his dedicated team!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115134988410600263076", "name": "Maggy Floeter", "time": 1590500659112, "rating": 5.0, "text": "Mission Multiplier is a premier IT CyberSecurity company that brings best practices and a unique approach to protecting its customers from IT vulnerabilities. Their repeatable QC and review procedures ensure that they always meet and often exceed our expectations. As a subcontractor on our MITS II contract, MM deployed two in-house developed cyber security tools at NASA’s Marshall Space Flight Center, the MARS (Monitoring, Assessment, Reporting, and Security) Box and MI:COP (Common Operating Picture). These tools have been a huge boon to MSFC and are currently being looked at by the entire NASA Agency for Agency-wide deployment! I highly recommend Mission Multiplier!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115011104568754280274", "name": "Katy Standridge", "time": 1594232446950, "rating": 5.0, "text": "Excellent company, super friendly staff!!!! Staff is very hard working.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100967285339909682533", "name": "Jason Hough", "time": 1585162276534, "rating": 5.0, "text": "Highly professional and knowledgeable team of cyber security experts.  If you are in need of a tool or service in order to enhance your cyber security poster or ensure compliance with new government requirements (RMF, CMMC, HIPAA, FINRA, etc.) This is your one stop shop for everything Cyber Security related. If you are a company that is trying to allow your employees to telework during these trying times, and are having issues making that happen, not only easily for your employees but also keeping security in mind for your proprietary information the Mission Multiplier Saturn-i appliance is definitely something to look at. It can build a complete ruleset around remote access, allowing your employees to telework with ease while make sure they keep themselves as well as your company safe while doing so....", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "113678186266750226379", "name": "Hunter Bullard", "time": 1594251046152, "rating": 5.0, "text": "Great company. Full of a lot of hard workers.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "113498735454160329746", "name": "Debra Lynn Doty", "time": 1594239509777, "rating": 5.0, "text": ".Great company. Really hard workers.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "114601049847260073509", "name": "Anna Ferry", "time": 1557174388080, "rating": 5.0, "text": "Mission Multiplier is so helpful! Patrick provided me with excellent customer service and I look forward to working with them in the future!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107139307274664481069", "name": "Island Hunter", "time": 1596803025234, "rating": 5.0, "text": "Had the pleasure of working with Jamie Miller and his team for the past couple years. Mission Multiplier is the \"Go-To\" company for Cyber Security tools and services.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106899825025236378278", "name": "Rod Doty", "time": 1594306325322, "rating": 5.0, "text": "Wonderful company and extremely dedicated staff.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105926169102465331697", "name": "Chris Hutto", "time": 1533653880524, "rating": 5.0, "text": "The MARS Box provides all the benefits of an ISSO in a small, affordable package.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105374878322647140500", "name": "Camron Pourhassani", "time": 1530039151974, "rating": 5.0, "text": "If you need RMF, DFARS, or any other assistance related to Cybersecurity, without a doubt, the best company to do it!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102485918336474571389", "name": "SUSAN BRANHAM", "time": 1594254454513, "rating": 5.0, "text": "Great company with awesome employees", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "109467883444169988256", "name": "Joshua Doty", "time": 1594342701752, "rating": 5.0, "text": "The Staff is wonderful.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105660360200543724566", "name": "pam pinyan", "time": 1594148735060, "rating": 5.0, "text": "Very good company", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111124611826151840654", "name": "Noah Pinyan", "time": 1527620541962, "rating": 5.0, "text": "There is no better organization to do business with than Mission Multiplier!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100625235396536429778", "name": "Chris Langford", "time": 1567521490706, "rating": 5.0, "text": "Stealth Group delivers cybersecurity insights shaped by years of industry experience, not just theory.\nThey bring both breadth and depth of capability, allowing them to offer end-to-end services, from assessment to forensics and everything in between.\nThey are vendor agnostic, enabling them to focus on your unique business and operational needs without making you feel that they are trying to hit some 3rd party vendor's sales quota.\nMost importantly their culture is rooted in integrity and accountability, with delivering quality to their customers being their top priority.", "pics": null, "resp": null, "gmap_id": "0x88626fb21c5ff2a5:0x37349723df8636bb"}
{"user_id": "115175620667620029009", "name": "Timothy Yeager", "time": 1567550382949, "rating": 5.0, "text": "Chris, Robert and Dasha have been a great help to us in getting our Cyber Security compliance in order. They are very knowledgeable about every detail that must be addressed. We have just begun, but I feel sure that things are going to go well as we work thru the effort.", "pics": null, "resp": null, "gmap_id": "0x88626fb21c5ff2a5:0x37349723df8636bb"}
{"user_id": "102375574718358183106", "name": "Emmy Leberte", "time": 1567190830502, "rating": 5.0, "text": "Stealth Group is a great cyber security company! These experts work with your business goals in mind - delivering you tailored solutions to your problems.", "pics": null, "resp": null, "gmap_id": "0x88626fb21c5ff2a5:0x37349723df8636bb"}
{"user_id": "106556295615079947381", "name": "Jackie Starck", "time": 1567522992008, "rating": 5.0, "text": "Fantastic team of cybersecurity professionals! They provide unparalleled expertise for all of your cybersecurity needs.", "pics": null, "resp": null, "gmap_id": "0x88626fb21c5ff2a5:0x37349723df8636bb"}
{"user_id": "106903445117802686455", "name": "David Kresheck", "time": 1564802789359, "rating": 5.0, "text": "Cybersecurity experts.  Protect your enterprise from unwanted attacks.", "pics": null, "resp": null, "gmap_id": "0x88626fb21c5ff2a5:0x37349723df8636bb"}
{"user_id": "106715100463653810868", "name": "Ian D. Owens", "time": 1589501644507, "rating": 5.0, "text": "Hinson recently provided excellent service for my residential project at a very competitive price. I would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88929366038136ad:0x8ab6c4a474fb15aa"}
{"user_id": "109749649322500934776", "name": "Ginger Lewis", "time": 1616340224593, "rating": 5.0, "text": "I pick up Wish orders here sometimes. The owners are super friendly. The wife makes jewelry from some of the parts from inside old computers! Very unique and very affordable! Lots of extras in this hidden gem! 😉", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "102839186506109901060", "name": "Mary Moore", "time": 1615902562194, "rating": 4.0, "text": "I brought in my Dell laptop as I could not get it out of an \"infinite boot loop\" or \"infinite restart.\" I ended up getting a new laptop and a data transfer. I interacted with all three team members listed on the site and they were all friendly and professional. The building is clean and organized.\n\nHowever, I dropped it off at noon on a Thursday for it to be tested as they believed it was something else. The receipt/contract sheet I was given said 1-2 business days, but it ended up being 7 before they got to my computer, not counting Sunday. By this point I had already purchased a new laptop and decided I just wanted a data transfer. This was my first time using this business so I have no idea if this is indicative of the average wait period. I know they experienced property damage recently due to the snow storm and I would imagine that would set their workflow back a good bit. I like to give people the benefit of doubt.\n\nThey also sell a wide variety of new and used electronic products and when I went in the first time they even had a lot of unrelated merchandise jewelry, stickers, etc.\n\n4/5 overall good experience. I normally don't leave reviews but I was impressed enough by this.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107649955092493806197", "name": "Jarmarcus Lewis", "time": 1616787318624, "rating": 1.0, "text": "Tervor was very condescending with his remarks about my role as a customer. I did not feel that he valued my business. He offered other places that I take my business instead of assuring that my product would be repaired in the timely manner. I am sure that Tervor will not miss my one repair job, and his business will continue on.  However, ever customer is important to some businesses and I will spend my money at them.", "pics": null, "resp": {"time": 1616792528594, "text": "My grandfather had a saying, \"when you tell half truths, you deal in all lies.\"\n\nI did call you, left a voicemail, saying that I didnt appreciate the way you spoke with my staff, and that your system had been here only 8 Business Days, when the repair time clearly posted at time of drop off was 10 business days. I told you that based on that you would have your system with Saturday or Monday, but in your review you state I didn't assure you when it would be repaired \"in a timely manner\", however I did tell you when, and it was timely based on the posted repair wait at time of drop off.\n\nYou state I offered other places, that is possibly the only true part of your review. I offered the other places around that could get to your repair if the wait wasn't doable for you.\n\nYou stated you was a \"manager of a big box store\" and that you \"worked for AT&T\" and that you don't treat a customer like this. To which I informed you I was \"not a big box store, and I wouldn't let anyone treat my employee's wrongly.\"\n\nUpon further looking into this, another lie came out. You are not a manager at AT&T, just a sales person. I know this, cause our business has over 55 lines with AT&T.\n\nI hope you take this opportunity to learn to treat people the way you want to be treated, cause if you treat my staff improperly, I will call you out."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "118429967109990391085", "name": "Barry Reding", "time": 1606366345948, "rating": 1.0, "text": "My son took his computer to these people last Saturday. The technician told him the problem was most likely to he power supply and showed him the power supply that was needed. My son saw the price tag on the power supply read $80. Today (Wednesday) at 3pm my son went to pick up the computer because they hadn’t fixed it. They require a $35 deposit and would not give him the money back because it is non refundable. They did no work to the computer. I found this shady to say the least given the fact they did no work. I called and after being passed off to four different people I questioned the deposit. I was told by all four people that the deposit was necessary because people bring their computers there and never come to pick them up. I pointed out that was not the case here. I then asked if I could come there and purchase the power supply for $80 minus the $35 that had already been paid. At first the answer was yes you can do that but we won’t guarantee the part. I said I was fine with that. As the conversation progressed and I pressed for a solid answer on the purchase person number four (apparently the top of the ladder there) he began to to fish tail. He said power supplies can range in price. I reminded him the technician actually showed the power supply to my son that was needed for his computer. The price tag said $80. He said you can bring the computer back and we will look at it before the EOB today. At this point I wouldn’t trust these people to hold a penny. Person number four hung up me. It’s a scam. Stay away from these people.", "pics": null, "resp": {"time": 1606368218119, "text": "Your system was dropped off on Saturday.  There is a sign clearly posted that it is currently 3 business days before a technician gets to your repair.  You choose to come pick up your system before the technician got to it on the 3rd business day (it was the next item on his list to work on for the record).  You spoke with 3 separate people when you asked for a refund on the non-refundable deposit every customer pays at drop off.  All 3 offered to have you bring the system back with no additional deposit for the technician to work on the system.  The technician even offered to work on the system immediately if you brought it back in today.  You refused.  One of the owners agreed to your request that the deposit be applied to purchase of a power supply, even though there is no verification that a power supply will fix the system.  This did not satisfy you either.  Services have been offered multiple times.  The bench fee is clearly covered at drop off and with signs on the counter at drop off.  If you had chosen to bring the system back, the $35 bench fee would be applied to your over all bill.  No one from our store told you to come pick up your system, what was wrong with it, or that we could not fix it.  We still offered you services that you choose to refuse.\n\nThe offers were made by multiple employees as well as one of the owners. All calls are recorded and the offers were recorded as well. The security video and audio is available upon request. And the offer still stands, you are welcome to bring it back in or apply the deposit to anything in store, same as owner offered on phone."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107788992048689611417", "name": "Addison Pace", "time": 1599780204535, "rating": 5.0, "text": "The Next Generation Staff is fantastic! They are always helpful, professional, and honest! I’ve bought computers from and sold computers to Trevor and each experience has been great. Additionally, they will do everything in their power to make sure that you get a great deal, love your products, and receive excellent customer service. I will never go anywhere else!", "pics": null, "resp": {"time": 1599784566457, "text": "Thank you so much! We try to have the product selection you would expect in large stores, with the knowledge you would expect from IT departments in large corporations,  and the friendliness you would find in the small \"mom and pop\" stores of yester-year.\n\nWe strive for 100% satisfaction from every client, at every interaction.  We want you to become family, and I hope you feel you have.\n\nThank you for your trust and support! One day, maybe, you will get to teach one of our little ones in high school!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "100436392171734280277", "name": "Flea Bag", "time": 1602180415698, "rating": 5.0, "text": "Came in today because my PC would not POST. The guys there were very friendly, professional, knowledgeable, and had an eagerness to figure out the problem. My PC was quickly fixed, even had its cables managed for me, and I had a great experience! I definitely now know the place I will always go and recommend to my friends. 10/10", "pics": null, "resp": {"time": 1602181435474, "text": "Thank you so much for the opportunity to help you out! We enjoy making our customers happy, making sure things are done properly, and making sure our customers are running at full capacity.  Thank you again!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "108465100469550498308", "name": "Colleen Beahm", "time": 1620374629549, "rating": 5.0, "text": "Very helpful. You can drop off old computers to be recycled there.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "109916958818177401503", "name": "William Bishop", "time": 1611606249558, "rating": 5.0, "text": "Great service and very friendly employees. They fixing my laptop quick and the cost was inexpensive.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "101998012388594996965", "name": "Randall's Collision", "time": 1606877621451, "rating": 5.0, "text": "Excellent technicians, excellent products.  Always there when we need them.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "101184614049870749200", "name": "Debbie Pesta", "time": 1608020416519, "rating": 5.0, "text": "They are very kind and helpful, she went beyond what she needed to do to help me. I will go back.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "116719014892982741465", "name": "Roger M", "time": 1581690391503, "rating": 5.0, "text": "We had or server go down due to a power supply fault. I took the unit to them and they quickly replaced the power supply and we were up an running within 2 hours. Once it was fixed we were able to make bills and continue shipping all with minimal down time. That says allot. Great job!", "pics": null, "resp": {"time": 1578932968809, "text": "Thank you Roger! We hope you are happy with everything.  If we can help you let us know. Trevor said he will be responding that email later today."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107481881867302542781", "name": "Mark Derwin", "time": 1627870940965, "rating": 3.0, "text": "Not too many computers", "pics": null, "resp": {"time": 1627872413269, "text": "We are currently working to improve our stock, however,  with the nationwide shortage of microprocessors, resulting in  outrageous prices of graphics cards, it us hard for a small business to keep a large inventory.  Sorry for the inconvenience."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "117524090120831789990", "name": "Serena you", "time": 1594202387757, "rating": 5.0, "text": "I drive from tupelo mississippi to do business with this family,  they are friendly,  helpful,  kind, hardworking,  very VERY knowledgeable and professional,  and a pleasure to do business with. Also very VERY big on answering any questions in a fast and timely manner,  and after care is fantastic!!!", "pics": null, "resp": {"time": 1606345871936, "text": "Thank you so much, Serena!  We love our customers and strive to offer the best service possible."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "114491280090484746575", "name": "Malcolm Jelks", "time": 1594217468993, "rating": 5.0, "text": "Great people .Every time we need something They come right out to our shop and take care of us  . far better price than anyone else", "pics": null, "resp": {"time": 1606345828037, "text": "Thank you, Malcolm!  We appreciate it.  We enjoy working with y'all."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107602350265591796378", "name": "Aaron Lindsey", "time": 1593297100966, "rating": 1.0, "text": "Would not recommend them. I called to see about having them build a gaming pc for me. I was having to wait for the funds but figured why not touch base & see if this was something they could do. He said he could. A week later I called back to schedule an appointment for going over what I wanted in the build. I told the person on the phone I had talked with Trevor about it last week and now have the funds for the build. She rudely told me i needed to schedule an appointment. I thought to myself does this person not understand that's what I'm trying to do? I just said nevermind I will order one on the net. Which I did through iBuyPower.com They lost business because of the bad attitude of the person who answered the phone They gave off a better than you attitude. I honestly wanted to use a local business to help the area economy during the Covid-19 pandemic. To bad I didn't get to", "pics": null, "resp": {"time": 1593302358696, "text": "Aaron, this is Trevor.  I attempted to contact you after you spoke to Lakin via facebook, never did anyone, other than myself speak to you over the phone. You blocked our business account and wouldnt answer personal messages. I have screenshots and will be glad to send them to you.\n\nThe person you talked to on Facebook didnt know you wanted to set up and appointment and was suggesting you did. She had not been the one dealing with you and didnt know we had talked.\n\nWe attempted to contact you several times to fix this and you wouldnt respond,  and blocked the message where I was talking to you.\n\nI am sorry you feel she was rude, however she didnt know and was suggesting an appointment to save you time. Please check your messages as you can see I personally tried to talk to you."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "111503206592614747907", "name": "Harold Brock", "time": 1586554195366, "rating": 1.0, "text": "Worst experience at a computer store ever!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHvNLe_BhVwQlcFZUEBOpgNTmfplupXj9ti9Ay=w150-h150-k-no-p"]}], "resp": {"time": 1591913967985, "text": "We apologize to Mr. Brock that he didn't understand we couldn't purchase an item he brought in without proper documentation. After it was provided we paid him in full the agreed amount.\n\nLater we were forced to no trespass the customer and file police reports due to continued harassment and threats.\n\nWe strive to earn a good review always, but sometimes it is impossible. We can not purchase good without proper ID to make sure devices are not stolen."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "110369778471249516245", "name": "Chris Royster", "time": 1594167149990, "rating": 5.0, "text": "Great service and friendly atmosphere. They are very helpful.", "pics": null, "resp": {"time": 1599784726855, "text": "We are always happy to help you Chris, even if it to give you bad news that your phone is dead. Thank you for your continued support!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "113065774965372845480", "name": "Mike Parker", "time": 1598368692311, "rating": 5.0, "text": "Great job on the PS4.......Thanks Alot !!!", "pics": null, "resp": {"time": 1599784608363, "text": "Thank you for the opportunity to serve you! Game on, and as always, stay nerdy!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "110555457212260497519", "name": "Amy Ballard", "time": 1594168591629, "rating": 5.0, "text": "You can not find a better computer shop or customer service anywhere and the fact it is a family owned and operated business makes it even BETTER!", "pics": null, "resp": {"time": 1606345914891, "text": "Thank you, Amy!  We appreciate it."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "108629252613041934875", "name": "Jim Fisher", "time": 1597163068855, "rating": 5.0, "text": "They are good folks who know their stuff.", "pics": null, "resp": {"time": 1599784680487, "text": "Thanks Jim! We try to always have an answer, and if we don't, we will find it. Thank you for allowing us to serve you!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "115590499393001473766", "name": "NoOne NeedsToKnow", "time": 1562262135632, "rating": 5.0, "text": "AWESOME Service! Great Prices! Fast, Dependable, and all around Great! Recommend 1000%", "pics": null, "resp": {"time": 1591914017931, "text": "Thank you for your reommendation!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "114119725940719698696", "name": "Next Gen", "time": 1625004919522, "rating": 5.0, "text": "we will help", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "111883607480997200821", "name": "Vicki potts", "time": 1579940246675, "rating": 5.0, "text": "Wonderful customer service and convenient location for \"Wish\" item pick-ups.  Thank  you", "pics": null, "resp": {"time": 1591913993061, "text": "Thank you Mrs. Vicki. We try to always give 100% to our customers."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "115833420259092629632", "name": "Johnny Keeton", "time": 1608513202713, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "100025869824767431863", "name": "Jeff Papisan", "time": 1597234024377, "rating": 5.0, "text": "Great people great service", "pics": null, "resp": {"time": 1599784632859, "text": "Thanks Jeff, we always look forward to serving you and your business!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "112518571751499723966", "name": "Allison England", "time": 1588092610713, "rating": 1.0, "text": "Stay Away, I took my repair in over 2 months ago. He told me parts are over seas. He is never open, does not answer the phone, ignores my calls. Thief!", "pics": null, "resp": {"time": 1591913793209, "text": "We apologize that you feel we could do something to get parts here faster. Due to the COVID19 Pandemic, lock downs, and shutdowns in our Country as well as in many companies’ factories are in, such as China and Japan, parts have become hard to get. When they do arrive, they must clear customs. Normal shipping from overseas is 2-4 weeks, without any delays. We work as hard as possible to keep our customers happy, however some things are out of our control. Shipping is one.\n\nAs far as phone calls, our office is manned Mon-Fri 9AM-6PM, there is an auto attendant and Voice Mail should we be on other line. We also have email available on our drop off forms for customers to contact. If you have any questions please email me at info@nextgencomputers.net.\n\nPlease also give me the name your repair is registered in, as we do not have anything in the name \"Allison England\" and I will be glad to look into why it took so long."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "109016355660117298515", "name": "Brad Davidson", "time": 1593837182441, "rating": 1.0, "text": "Children in business! unprofessional,", "pics": null, "resp": {"time": 1594165189854, "text": "We are a small business that is FAMILY owned. With the current COVID19 crisis there is no other options if we want to work than to bring our children to our office. Furthermore, we believe it is important to instill in them a good work ethic so they can learn they have to work for what they want, and not expect it to be handed to them.\n\nOur technicians are 100% certified, and as such, all adults. Children being here doesn't change our business practices or our ability to serve clients. It only shows the world, what a TRUE family owned business is!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "101093239002143980579", "name": "Pamela Mcclure", "time": 1579041801040, "rating": 5.0, "text": "Very helpful and very friendly", "pics": null, "resp": {"time": 1579045466527, "text": "Thank you Pamela!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "108212530109695075344", "name": "FuzyWazaBear", "time": 1578886267365, "rating": 1.0, "text": "Hidden fees and abnormally high prices", "pics": null, "resp": {"time": 1570056471720, "text": "I'm sorry you feel that you had hidden fees and high prices. If you can elaborate about this we will attempt to right any wrongs that have been made. However we do not have any sale or repairs listed under your name, so please let me know what name it was in and what the issues was."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "104966717927345297174", "name": "Jason Viator", "time": 1563459034207, "rating": 5.0, "text": "GSI is a company on the move. They are a top notch integrator and industrial cabling provider for the gulf area. Their customer base includes large corporations as well as local companies that trust them implicitly with their access control and monitoring. Good people make it what it is....and it is amazing!", "pics": null, "resp": null, "gmap_id": "0x889a421f6bd99fa7:0x83825efe8dad03dd"}
{"user_id": "112960055637066914844", "name": "Crystal Kilpatrick", "time": 1560882934705, "rating": 5.0, "text": "A lot of negative reviews are outdated and from upset past employees. GSI has greatly improved as of late with a stronger and much more skilled team. Positive changes are happening that have improved the business overall!", "pics": null, "resp": null, "gmap_id": "0x889a421f6bd99fa7:0x83825efe8dad03dd"}
{"user_id": "104323982559728533613", "name": "Bryan Goodrich", "time": 1564612590152, "rating": 5.0, "text": "I was recently employed by GSI for a short time, unfortunately, a family situation forced me to relocate. While I was employed at GSI I received an invaluable amount of training and support. I feel GSI is cultivating a very professional and family oriented culture. GSI strives for excellence as a company and encourages thier employees to do the same.", "pics": null, "resp": {"time": 1572972119256, "text": "Thanks for the kind words Bryan - you're missed!"}, "gmap_id": "0x889a421f6bd99fa7:0x83825efe8dad03dd"}
{"user_id": "111991525010161229202", "name": "Jackie Jolliffe", "time": 1514489013947, "rating": 5.0, "text": "Dropped off some goodies for ians coworkers for christmas", "pics": null, "resp": null, "gmap_id": "0x889a421f6bd99fa7:0x83825efe8dad03dd"}
{"user_id": "100942002854352751344", "name": "Fred Butler", "time": 1490376446276, "rating": 5.0, "text": "Great Local Security Company, Can meet or exceed all your Security needs,", "pics": null, "resp": null, "gmap_id": "0x889a421f6bd99fa7:0x83825efe8dad03dd"}
{"user_id": "105142050938273994298", "name": "Fred Butler", "time": 1505265577662, "rating": 1.0, "text": "Momma said if you dont have nothing nice to say. Keep it to yourself.", "pics": null, "resp": null, "gmap_id": "0x889a421f6bd99fa7:0x83825efe8dad03dd"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1598969945701, "rating": 5.0, "text": "Great team that helps this small business owner in my weakest area....The IT department!", "pics": null, "resp": null, "gmap_id": "0x88626b9aadf196a7:0xfc9408f730627ac3"}
{"user_id": "115520996708899284368", "name": "wendy pope", "time": 1544634107971, "rating": 5.0, "text": "very responsive and knowledgeable, maintains our network security", "pics": null, "resp": null, "gmap_id": "0x88626b9aadf196a7:0xfc9408f730627ac3"}
{"user_id": "108186464398084406194", "name": "Latrice D (Dr. A)", "time": 1618403274936, "rating": 5.0, "text": "If I could rate Networx Computer Technologies 10 stars I would. The experience from the price and speed of repair was the best. They also allowed me to pick up my Mac Book a little later than closing time. I highly recommend them. You will not be disappointed.", "pics": null, "resp": {"time": 1618408569274, "text": "It was a pleasure to work for you. As a small business we understand that it is you the client who allow us to provide for our families and we do not take that for granted. Thank you so much for taking the time to review us!"}, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "104171440849750177930", "name": "Larry Watkins", "time": 1622674779495, "rating": 5.0, "text": "Dropped off my sons HP, he had erased the software on it. Very friendly, Jason helped us and explained the process. So far, great experience!", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "109939548905425672274", "name": "Theodore Swift", "time": 1610755166944, "rating": 5.0, "text": "Great service! I brought in a wire that had been cut to see if they could find me a replacement. They spliced it together within 20 minutes and charged me a VERY reasonable amount.  I highly recommend this shop. I will be using them for all my future computer troubles.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "109892131233081895270", "name": "k alexis", "time": 1602986028471, "rating": 5.0, "text": "This review is long overdue. Things got so crazy with COVID, so I did not get around to leaving a review. They were so kind, professional, and communicative. They fixed my daughter's 2018 Mac that was water damaged under the trackpad, which had further caused the keyboard to stop working. We thought it could not be fixed. They were honest, quick, and let us know every step of the way what was going on. They also did not try to charge us an arm and a leg. The laptop is now good as new, if not better. They are great, honest people. I will always trust them for repairs and whatever else. Go to them and you will not be disappointed.", "pics": null, "resp": {"time": 1608218347223, "text": "We appreciate you allowing us to work for you. We strive to always remember that you all are the reason we get to work!"}, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "108688959861225299822", "name": "VelvetCoatedWonder", "time": 1601944830322, "rating": 5.0, "text": "I have gone to this place every time my laptop has broken. They have great turn around time, are very responsive, and are so kind. Their prices are also very fair and when I was a broke undergrad I really appreciated that (and now as a broke young adult I still appreciate it!!)", "pics": null, "resp": {"time": 1608218553947, "text": "Ah yes, the days of ramen noodles. We remember those days and do our best to provide the quickest repairs at a reasonable price. Thank you for your review! It means a lot to us."}, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "112650754500627021526", "name": "Paul Arceo", "time": 1607179702753, "rating": 4.0, "text": "I had took a pc with them so they could fix it and they did fix it but there was one problem one of their workers threw away my sides glass panel. And now I can see all of the parts. But I can’t have my pc with the parts sticking out because my little brother will touch the inside of my pc and destroy it. 😡🤬", "pics": null, "resp": {"time": 1608218263524, "text": "Thanks for your review Mr. Arceo. I do recall your situation and what happened is your side panel was mistakenly sorted to be recycled. We explained what happened to you and even compensated you for the side. Please get with us and we will be happy to replace your case at no cost.  Thanks!"}, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "114307826159656619823", "name": "Christopher Stevenss", "time": 1612656006320, "rating": 1.0, "text": "I took my laptop in for hinge replacement and my 128 SSD, 8 GB RAM card and LAN connector were missing. They still charged me for the \"repair\" and my laptop still has missing pieces.", "pics": null, "resp": {"time": 1612657060781, "text": "Please give us a call during business hours. We do not have a record of your name in our work order system. Thank you."}, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "108239583217617419257", "name": "Bill Niblett", "time": 1605228795847, "rating": 5.0, "text": "Awesome guys. There super friendly and very knowledgeable.", "pics": null, "resp": {"time": 1608218285054, "text": "Thank you! It is always great to work for you!"}, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "105393472922562725715", "name": "Graham Rowland", "time": 1580048632761, "rating": 5.0, "text": "Knowledgeable, fast, and honest. Probably could have taken me for a fortune, but gave me an honest assessment and charged a very fair price. They discussed options, ordered the right part, and installed quickly. And were very friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "113648587949732142173", "name": "William Blackburn", "time": 1585762701611, "rating": 5.0, "text": "I rarely write reviews of companies, but this company did an outstanding job in repairing my computer.\n\nI'd been having consistent trouble with my computer for quite some time and had tried to repair the issue I was having multiple times. While I am not a computer expert, the issue was centered around my wi-fi and appeared to be one of significant complexity.\n\nI had previously asked a popular, nation-wide computer repair service to repair the issue and they failed to do so multiple times. I decided to call Networx Computer Technologies to see if they could get the issue sorted out and I am happy to report that they cleared up the issue very quickly and for a very reasonable price.\n\nThis organization has my full faith and the professionalism that they have shown me was simply outstanding and easily among the best I have experienced in this arena.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "117630691361924437800", "name": "Elliott Knight", "time": 1561657417440, "rating": 5.0, "text": "Best computer techs you could ask for. I have been here multiple times and they have always solved my issues very quickly. They don't overcharge and always treat you with respect.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "114962976475842023679", "name": "Caleb Higdon", "time": 1586204518553, "rating": 3.0, "text": "I had a problem with my PC that I couldn't figure out. I built my PC and I know what I'm doing, I only took it to them because i hoped the actual professionals could find the problem. I dropped it off and told them a little about the problem and they told me they shoot for 24-48hr repairs and there was a $30 minimum diagnostics fee. I agreed and left. They did the same troubleshooting things that I did and came to the same conclusion I did: a new motherboard would fix the problem. I accepted my fate. That was on Friday. On Monday I called and asked if there were anymore developments. They said the motherboard was the issue and that I could pick it up. I asked if the 30 dollars included tax. They said because it was an extended diagnostics period that the fee was now 45, to which I never agreed. I paid it anyway and when I got home I realized a fan was disconnected and so was my RGB LED strip. They didnt put them back the way I left it. On top of that, the pin header for the strip was bent and it snapped off when I tried putting it back in. I booted my system up using a different CPU and it worked fine, only I kept getting some error that wasn't there before. The broken pin and the error wasn't their fault, but they should've plugged the fan and strip back in and properly informed me  about the price hike from 30 to 45 dollars before I agreed to their terms. 3 stars because of the problems mentioned but I wont drop it down worse because I dont know how they could have fixed my computer. They certainly didn't make it better, though. The customer service was good.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "108313927825632809197", "name": "Kevin Crowley", "time": 1551445242979, "rating": 5.0, "text": "Glad that Networx was willing to attempt to repair my motherboard. All other computer repair places I called in the area refused to attempt it.\n\nWish them all the best and will consider them first if I ever need computer services.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "117397963616598706607", "name": "cathley Brown", "time": 1591413357456, "rating": 4.0, "text": "Good Services. They are fully cooperative .", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "105986132755786066605", "name": "Stephen Moss", "time": 1549137457743, "rating": 5.0, "text": "These guys know their hardware. I am so glad to have them nearby if I need items that are not available in a non tech area like Alabaster. I'm used to Atlanta where I can get anything and they have been a lifesaver.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "114677942972265918377", "name": "Joseph Gregory", "time": 1463609846575, "rating": 5.0, "text": "I've worked with Marshall at Networx for probably about 10 years now.  Both for business and personal computing/networking/tech needs.  Always very pleasant, helpful, and knowledgeable.  Responds promptly to my requests.  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "113243231911880238545", "name": "Bill Tiemann", "time": 1527459890931, "rating": 4.0, "text": "I was very happy with the service I got here. They fixed my computer problem with a 24 hour turnaround time at what I consider a very affordable price. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "113138737928512116702", "name": "Tara Doaks", "time": 1396047426169, "rating": 5.0, "text": "I am a couponing mother and when my computer stopped working Jason had it fixed in no time! My computer now works excellently and is much faster than before. Jason kept great communication with me during the process. He was very kind and the office was nice and neat. I HIGHLY recommend. Thanks Jason\n\n-Tara C.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "113138737928512116702", "name": "Tara Doaks", "time": 1396047426169, "rating": 5.0, "text": "I am a couponing mother and when my computer stopped working Jason had it fixed in no time! My computer now works excellently and is much faster than before. Jason kept great communication with me during the process. He was very kind and the office was nice and neat. I HIGHLY recommend. Thanks Jason\n\n-Tara C.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "112824527949319826347", "name": "Todd Sobel", "time": 1438959783314, "rating": 5.0, "text": "These guys are great.  They work fast and did a great job on my computer.  I will use them again.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "110259848055947670706", "name": "Tish Weaster", "time": 1503611072830, "rating": 5.0, "text": "Excellent service - fast, knowledgeable and cost effective.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "103125248201686865833", "name": "Andy", "time": 1539379695675, "rating": 5.0, "text": "Quick service for corrupted system files. $80\nI could not perform any admin functions.", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "101438074138547090303", "name": "Rance Harvey", "time": 1429978294869, "rating": 5.0, "text": "Fixed laptop in timely fashion and for a great price", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "102952333149707808552", "name": "Constance Green", "time": 1536579620240, "rating": 3.0, "text": "They were very helpful with my computer questions", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "115333227771387682942", "name": "Tim Scott", "time": 1563933171678, "rating": 5.0, "text": "Very professional group who took care of my computer problems!", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "112370090733357167934", "name": "Steve Morris", "time": 1565909112997, "rating": 5.0, "text": "Great guys", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "104895177234477396469", "name": "Joe Crow", "time": 1479216792192, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": null, "gmap_id": "0x8889243d635c14c5:0x94dae1d420dfda8d"}
{"user_id": "114316320240783092086", "name": "Kelley Maddox", "time": 1599493828031, "rating": 5.0, "text": "I would highly recommend Chad for computer repairs!! Great quality work!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1512081888387, "rating": 4.0, "text": "Expert computer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOb4o7Pl6B41IsF05mUyN6pNMcGIw21TcGSrsgT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-eM7wOMXP8ls0r_vy5B-gcQU4XGdQinEQRlO5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzbSCDa8CCzRz1HbXLlHRnf2b8wZWXWweKdXbQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7gOj2mg0fBooHDB1e3IwLHUDtfjLRai-oiMja=w150-h150-k-no-p"]}], "resp": {"time": 1581047109385, "text": "Thanks!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102223213652406025901", "name": "Tina Brady", "time": 1599495586731, "rating": 5.0, "text": "He has always taken care of our computer issues! He is fast & does a great job!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "114985357054336860642", "name": "James Ellett", "time": 1599493682197, "rating": 5.0, "text": "I’ve used Chad many times. Always satisfied.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "114807225875482294327", "name": "Garrett Griffin", "time": 1587083440399, "rating": 5.0, "text": "He was very good with me and helping me determine issues with my gaming PC. He has been nothing but kind and helpful and I would recommend anyone to him any day. He doesn’t charge a lot, it’s a very fair price.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "115731831952409389288", "name": "Keosha Lenormand", "time": 1578594854462, "rating": 5.0, "text": "Very helpful and honest. Amazing prices. Definitely recommend!", "pics": null, "resp": {"time": 1581046973221, "text": "Thank you, Keosha!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "115615865282520100090", "name": "Louise Cherry", "time": 1523031736256, "rating": 5.0, "text": "I needed a chip taken off a board for my card window, and another one soldered on.  He did the soldering and called within two hours. He wanted to see if the new chip on the board worked, his work enabled me to roll a window up and down and saved me big dollars that the dealer would have charged to put in a new part.  Dealers do not repair those type of items.  I am glad I called him, he is a nice young man and does great work. Highly recommend this business.", "pics": null, "resp": {"time": 1581047127785, "text": "Thank you, Louise!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "113482756587232415039", "name": "Charlotte Ursery", "time": 1562521348320, "rating": 5.0, "text": "Chad is awesome the owner of the place he wasn't even open today but he took the time out of his day to come to the shop and fix my iPhone he is very reasonably priced and very friendly anybody needs phone repairs speaker repair cell phone repair anyting electronic he is the person you should go to wonderful service and great work", "pics": null, "resp": {"time": 1581047069390, "text": "Thank you, Charlotte!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100135678258820513115", "name": "Kelly Bishop", "time": 1557166524844, "rating": 5.0, "text": "I was told by another company my tablet could not be repaired and I would have to purchase a new one but Chad was able to fix it and save my photos.  He has also updated my personal home computer and removed the viruses.  I would highly recommend Chad for your pc repairs.", "pics": null, "resp": {"time": 1581047079050, "text": "Thank you, Kelly!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "106456759762771725845", "name": "Debbie Smith", "time": 1580323227424, "rating": 5.0, "text": "Quick, Professional and Very Reasonable Prices...", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "108910540900240218942", "name": "Harland Underhill", "time": 1485825420374, "rating": 1.0, "text": "Yesterday a friend sent me a link with a dire caveat that I'm probably not going to like this but I should see it. I open the link and lo and behold there is my wife, in all her glory, but with nothing else on. Now I've seen this picture before, she took it herself with my own personal phone. No where has this picture ever been shared, sent, or even seen by another soul other than myself. That is until I took my phone to get the battery taken care of at CH PC Repair.\n\nNow I understand that this is partly my fault for leaving that picture on my phone, I accept that. I had honestly forgotten that it was on there. But I had incorrectly assumed that my personal data would remain personal while my phone was in Chad's possession, but apparently that isn't the case.\n\nWhile the battery was fixed, I've now got to live with the fact that there are not so tasteful pictures of my wife out there for the world to see thanks to some perv PC repairman. If you for some reason desire to use this child for any repair work, make sure your data is extra secure or you wipe your memory card/hard drive before you take it to him. I'm over being mad at this, I'm just disgusted that there are people still like this out there in the world.", "pics": null, "resp": {"time": 1486566093960, "text": "Hello, Harland Underhill. I am having trouble reaching you.. I do not understand why you left such a review about me, and my business. I work extremely hard, and I take pride in my business. I would not do something of this matter. What would I benefit from this? nothing, nothing good at all. I am a man of integrity. I am known for the good work I do, and honestness."}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "117436945797970504746", "name": "Jason Williams", "time": 1527694339461, "rating": 1.0, "text": "This guy is awful.  No patience, no respect, no apologies when he screws up.  Everything is on his demands, but never his fault.  Respect is free, try giving it away sometime.\n\nDon't believe his stories.  He complained in LESS than a week - regarding a shipment originating in Canada - which were the terms he agreed to when he purchased (and also mirrored by the eBay shipping expected time).  But mistakes happen - all I needed was for him to say 'Sorry, my mistake'...  But he couldn't do that - preferring to say that he would be leaving negative feedback (for something he was completely wrong about).  Fortunately I had not shipped the part yet, as I was going to be in the US shortly, and able to do a much quicker & more secure USPS shipment...  But once you threaten negative feedback over something that you're wrong about, and are repeatedly unable to understand that you're in the wrong - damn right I'm canceling that order.  I have the right to \"fire\" a customer who is not conducting themselves appropriately.\n\nMost notable is the fact that negative feedback was left for me, and it took ~5 minutes for the eBay rep to review the details and get it taken down.  His complaints to eBay have resulted in absolutely zero effect on my account.  Clearly he was in the wrong in every part of this transaction, and he has YET to take responsibility or apologize for his errors.  I would not trust him to act in an appropriate manner in any facet of business, therefore this review is perfectly valid based on the lack of professionalism he has shown.", "pics": null, "resp": {"time": 1526479650586, "text": "I purchased an item from this guy on ebay(viridel75) Paid May, 3rd. I complained that it wasn't shipped May, 12th. He canceled the sale without me agreeing. Keeps blaming me for his mistakes. Knows nothing about respect!, Now harassing me?.. Reported to ebay."}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "109591382378310162559", "name": "Catherine Wells", "time": 1539197097078, "rating": 5.0, "text": "Chad is great! Highly recommend him. Thank you for being so helpful and honest.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1536169343913, "rating": 5.0, "text": "So glad I took my computer to Chad to have it repaired. He was helpful and kind. Repaired my computer quickly, and didn't charge some astronomical price!", "pics": null, "resp": {"time": 1581047097320, "text": "Thank you, Renee!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "113311719726002515422", "name": "Kelly Joiner", "time": 1491969329753, "rating": 5.0, "text": "Chad is a super nice young man ànd did a great job geatting rid of a virus buried in my laptop. Was extra accommodating to get it back within a day to meet my needs. Stayed in contact and let me know when it was ready. ;Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102397905705357537904", "name": "Carla Hardin", "time": 1539119126457, "rating": 1.0, "text": "Momma had a Samsung Galaxy s6 that just needed a new battery.  Ordered a battery from Amazon and they couldn't get the back of the phone off.  So they call the Verizon retail store in hazel green and the girl told her to take it to ch pc repair and he would do it.  My mothers phone worked FINE when she took it in there.  She could do anything and everything on her phone.  When she went to pick it up the phone would not even turn on.   He said he tried both old and new battery and it still wouldn't come on.  So he took the screen off and put it on another phone and the screen works.  So he is saying that the mother board is messed up.  He can check it out BUT he'd have to charge her to do it.  Momma said he really messed the back up,  like it was melted!!  I met her up there and his attitude is  basically \"screw you \".  He insisted that the phone was not working when she took it in.  I asked him why he didn't call her and tell her and he said because she didnt leave a number.  To which my reply is \"when you work in customer service like this it is your responsibility to get a number so you can get in touch with the person\". He is a total jerk!!  He takes ZERO responsibility for his screw ups.  Said he was not going to make it right.  But he did tell her that he'd buy the phone from her when she bought a new one.  Then he threatened to call the cops on us \"because it was after hours, he was closed and we wouldn't leave\".  He never asked us to leave, period.  He brags about how much money he makes per year and all of his vehicles and house is paid for.  Good for him.  I dont give a 🐁but what he has and doesn't have.  And now Marina tells us that her stepfather took a phone to him that was kinda messed up and was going to get the guy to repair it.  When he went to pick the phone up or really was messed up!!!", "pics": null, "resp": {"time": 1539369673755, "text": "Carla,\n\nThis issue is between me, and my client Pam Lanford. You came into my office, clearly disgruntled. You then continued to talk over me without giving me a chance to respond or explain the situation.\n\nPam visited my store with her device, which she believed to have a battery issue. She provided an aftermarket battery and had explained that an attempt was made, using a hairdryer, to open the casing and replace the battery, prior to me looking at the device. When the device was dropped off, I was in the middle of an extensive repair, as well as having a conversation with a different client. Not only that, but the device was dropped off quickly, without any contact information, and with very few details.\n\nI replaced the battery with the after-market battery she provided and then attempted to boot up the device, but to no avail. I investigated further but was unable to find a solution. Pam then arrived to pick up her device, and she was, understandably, very upset to find it not working. She wanted it in working order right then and there, and while I understand her sentiments, I can only do so much so quickly. I needed more time to troubleshoot and determine the problem and possible solution, but she would not allow it. I was even willing to reimburse her with a fair value for her device.\n\nI have been in business for more than 10 years now. I work hard every day, and I like to think that I am very good at what I do. I manage hundreds of computers monthly, and I repair and fix many devices daily (thousands of devices yearly). I can remove a device's back/screen in a few minutes with simply a bit of heat and some playing cards, and I have never had any issues. I would never damage a device intentionally. I treat all repairs as if they were my own. That being said, mistakes can (and do) happen as there are many risks involved with these repairs, but I do my best to make things right. To me, it's not just about collecting payment for the services I provide—although that is necessary for me to stay in business and provide for my family. It's about building long-term relationships with my clients, and I deeply enjoy helping and providing knowledge to my clients.\n\nThis is the first complaint I have received with the BBB, and I would truly like to resolve the issue, and have the opportunity to change your outlook on me and your experience with my business. CH PC Repair is my business—it has my name in it, a fact that I am proud of and would never change.\n\nSincerely,\nChad Harbin\nCH PC Repair"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100440554831365751805", "name": "Sandy Thrower", "time": 1463513434765, "rating": 5.0, "text": "Great and fast service.  Chad tackled the problem of a serious virus on my computer and was able to resolve it faster than I thought he would be able to.  I would highly recommend him and his computer repair service.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100181192580830469853", "name": "Tommy B", "time": 1518560685710, "rating": 5.0, "text": "One of the most dependable and honest businesses that I know of and their prices are good", "pics": null, "resp": {"time": 1581047118905, "text": "Thank you, Tommy!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "116070430570399990003", "name": "Bert Wiggers", "time": 1533658387994, "rating": 5.0, "text": "Does great work", "pics": null, "resp": {"time": 1581047153158, "text": "Thank you!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "110827897021780926439", "name": "dale stinnett", "time": 1550825729152, "rating": 5.0, "text": "Thanks 😘", "pics": null, "resp": {"time": 1550853935432, "text": "Hey you!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "107608350551647559068", "name": "Presley Thornton", "time": 1529682088649, "rating": 5.0, "text": "Thanks!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "112439074065538567652", "name": "Chad Harbin", "time": 1486566193580, "rating": 5.0, "text": "I am the owner.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102833086902583306951", "name": "Mary Hutchens", "time": 1529254777981, "rating": 5.0, "text": "He put a front on my phone in about 15 minutes now my phone looks new", "pics": null, "resp": {"time": 1581047144030, "text": "Thanks!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
