{"user_id": "118188707050056204879", "name": "Charles Morris", "time": 1626643114815, "rating": 5.0, "text": "I have used this service twice. They always fix my computer issue and communicate updates regularly. The fees are reasonable with fast turnaround times.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "114635528198292226242", "name": "Chowel Weldparts", "time": 1626905497795, "rating": 5.0, "text": "They are trustworthy. Working with honesty and integrity, and don't play with the price. Best computer Repair service", "pics": null, "resp": {"time": 1626963727267, "text": "Thanks for the kind words"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104367783278629684174", "name": "Keojuana Brown", "time": 1621145836441, "rating": 5.0, "text": "Very helpful. I came for what I was looking for. They gave great customer service experience to us.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106828815093298042237", "name": "Miss Sherry", "time": 1609443693459, "rating": 5.0, "text": "The staff have been nothing but  diligent, courteous,  and helpful in getting my PC fixed. And they helped me previously with a battery on a old PC I had. I'm wating til they give me a update,  but I'm rest assured they will get the job done! I highly recommend their services!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106165996828813654261", "name": "Dana Dunn", "time": 1595527997912, "rating": 5.0, "text": "Great staff, reasonable prices very thorough. Highly recommend if you need repairs. Although my system couldn't be fixed they tried very hard.", "pics": null, "resp": {"time": 1595533670539, "text": "Thank you!! We look forward to working with you in the future"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "105272263773641748430", "name": "Walsh Walsh", "time": 1595626446933, "rating": 5.0, "text": "5 ⭐️ service and repair. I can’t say enough positives about Tyler and the staff at  MCS. Very professional, kind, fast repair and didn’t charge for things he could have. I trust him completely with my family’s computer needs. Strongly recommended.", "pics": null, "resp": {"time": 1595863868163, "text": "Thanks for the review. We look forward to doing business with you in the future."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104158153633682136481", "name": "Brian K", "time": 1596642815688, "rating": 5.0, "text": "These folks do great work. Repaired 3 of my laptops. New drives, loaded the software and  working great.", "pics": null, "resp": {"time": 1596652358648, "text": "Thanks Brian.. we appreciate your business"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "107723384696261323128", "name": "Eddie Johnson", "time": 1611550237126, "rating": 5.0, "text": "They were friendly, knowledgeable, and fast. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108265857938358232153", "name": "cooper NXG", "time": 1598150428273, "rating": 1.0, "text": "very poor quality and overpriced. know exactly what you need and how much it cost in average before you go or you getting scammed.", "pics": null, "resp": {"time": 1598269778440, "text": "We replace parts with the same that comes in your original equipment. The cost is based on your part and its cost. We are one of the cheapest repairs around."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "105941647258845569047", "name": "Dean Koslofsky", "time": 1566852128137, "rating": 5.0, "text": "Very nice office. Service was very good they seemed very knowledgeable and were able to take care of my issues. Pricing was also very reasonable.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111988228527052758292", "name": "Haskell Rhett", "time": 1479922515985, "rating": 5.0, "text": "Fantastic service!  I have just moved to Montgomery and was very lucky to find this group.  Their location is convenient.  The staff is friendly and extremely knowledgeable.  They communicate the issues in a way that is easy to understand.  They were prompt.  They found the problem immediately and resolved the difficulty with ease.  They are willing to do whatever you need.  I have used many different computer service businesses over time.  This organization was easily the best I ever used.  I highly, highly, recommend Montgomery Computer Service for any of your service or maintenance needs.  You will not be disappointed. Outstanding!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106569744843860042622", "name": "Wanda Reynolds", "time": 1592500604254, "rating": 5.0, "text": "They are always helpful and are able to get what I need in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106858707675970847958", "name": "Amber Kilcrease", "time": 1560876384317, "rating": 5.0, "text": "I cannot express how pleased and satisfied I am. Great service definitely went above and beyond to take care of me! Thank you Montgomery Computer Service !!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112720682467269087775", "name": "Orlando Hardman", "time": 1532636944084, "rating": 1.0, "text": "On 7/26/2018 approximately 1:15 pm I brought my laptop computer in to see if I could get it repaired. Due to a lack of parking area I almost had an accident with an older driver. We were both backing up. I stop once I saw the other driver.  My concern was the fact that I observed a gentle man sitting about 30 feet away in front of the computer store watching.  Once I entered the store, I ask him did he see what was about to happen. He indicated that he did. Then he stated that people have accidents all the time.  I decided to take my business somewhere else because his lack of concern for a welfare of a potential customer. Besides he indicated that he did not need the business when I ask him.  I can not speak about how well they repair computers, I will leave that to the others who have comments.  I just wanted to share my personal experience.", "pics": null, "resp": {"time": 1536854415972, "text": "Sorry for the parking issues, we work hard to fix computers. So unfortunately we do not spend time parking cars."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111611133086853556981", "name": "Carrie Yates", "time": 1536766124173, "rating": 5.0, "text": "I've been a customer for over a year now, and the owner and staff have come through like a champion on every occasion, every single time, no matter the size or scope of my issue. Every question is answered quickly and accurately, every single product is researched and compared, and every service performed is done with my needs in mind. Honest recommendations are always made, and hours are convenient. The staff is easy to reach, communicates clearly and extraordinarily effectively, and prices are very reasonable. I have yet to find an occasion where this company disappoints, nor do I expect to.", "pics": null, "resp": {"time": 1536853443689, "text": "Thank you so much!"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110173018959234519675", "name": "Rachael L", "time": 1557942497542, "rating": 5.0, "text": "Mr. Stuart has assisted us both on the business and consumer side. Great experience!  Friendly, fast, thorough, transparent along with great pricing.  Will definitely do business with Montgomery Computer Services again!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117950204595413202983", "name": "william “brian” brooks", "time": 1599273490909, "rating": 1.0, "text": "i bought a intel mother board from this place last week and after trying 2 cpu's and 2 different sets of ram  the board never put out video  is completely useless", "pics": null, "resp": {"time": 1599314062340, "text": "We offer warranty on what we sell. If it doesnt work you can always bring it back for a refund or replacement."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110020593242094537621", "name": "Sidney Alene Coker", "time": 1564531869284, "rating": 5.0, "text": "I’m a middle school teacher and writer who tries heavily on my computer for work. My charging port was damaged and was melting charger tips, and only worked if I positioned the charging cord just so, usually with the tip supported by a pen or book on my desk. I had it repaired before at a since closed establishment that did what can only be described as a hack job. Because of these things I was extremely picky about where to take my business, and was checking the reviews for all local computer repair shops when I found this business.\n\nNot only did they fix my computer in less than 24 hours, they listened to my concerns and explained what they would do to prevent the charging port coming loose again. The customer service was fantastic, the repair was perfect, and I cannot recommend this business enough. Their prices are extremely fair, especially considering the quality of service and repair, and the turnaround time made the price even more worth it.\n\nThank you so much!", "pics": null, "resp": {"time": 1564533396371, "text": "Thank you!!"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "116875182937828511843", "name": "John Jelli", "time": 1540907198299, "rating": 5.0, "text": "Just an excellent overall experience. Great customer service, reasonable prices, and greased-lightning turnaround time. Seriously, the turnaround was so fast I was suspicious; but no, they're just that good!", "pics": null, "resp": {"time": 1540907866027, "text": "Thanks John!!!"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "116930809255974603104", "name": "Javan Rampersad", "time": 1569538006203, "rating": 3.0, "text": "Extremely professional and knowledgeable about computer hardware. Diagnosed my issue with my new CPU and motherboard, recommended what I should get, and will put it together for me once my parts come in (for the listed price, of course, which is extremely fair for the work put in). I could not recommend this business more.\n\nEdit: Lowered to three stars. Open and closing times extremely misleading. Advertised to close at 6pm, but I've arrived about five times now between 5:00-5:20pm with no one who can help me being there. However, my original review still stands.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "103465969870900319830", "name": "Kay Wilson", "time": 1480708096341, "rating": 5.0, "text": "I would recommend Tyler to anyone.  He knows what he is doing.  He is knowledgeable and experienced.  He is professional.  His rates are reasonable.  He worked on 3 of our desk top computers he did good work and we are very pleased!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117970055533357067295", "name": "Ron Culbreth", "time": 1561839015198, "rating": 5.0, "text": "I called Tyler and his team from Florida service my 87-year-old mother's desktop in Montgomery.  Tyler suggested that because the tower is heavy (plus I like to limit her driving as much as possible) that they come pick it up, make the necessary repairs and he said they could have it back that same day. Plus I know my Mom would not know how to make all the connections - AND I wanted them to see why her wireless printer wasn't working. That was a Friday morning when I called.  They picked it up at noon and returned 3ish and fixed her printer.  She had 137 incidents of malware !  She had let a phone scammer access her computer and he had her bank account info.  We caught it in time.  Tyler installed some security software.  All for I thought was a ridiculously low price.  Thank you so much.  Restored my peace of mind and my faith in good working folks of Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117155713020964732473", "name": "Larry Summons", "time": 1592998579741, "rating": 5.0, "text": "Went to have my computer checked out and the tech immediately knew what was wrong. We talked about upgrades and he even suggested a seller of a new graphics card, long story short he installed the new part and the upgrades at a VERY fair price!!!! I will return here in the future do yourself a favor and follow suit", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106366253149453994723", "name": "Joseph Bamburg", "time": 1530319417437, "rating": 5.0, "text": "Turn around was extremely quick, service was very reasonably priced (especially compared to big box stores, I think Best Buy was going to charge me double what they did) and everyone I worked with in there was fun to talk with while waiting for the service to finish.\n\nAlso of note, much better timing when you're on a time crunch (absolute necessity to have the computer for bar prep). If I had relied on Geek Squad warranty, I'd be without a computer for three days. Took my computer in, diagnosed the problems in thirty minutes, ordered a part, installed said part, and did some updates in an hour and a half at most. While I was in there waiting during the servicing, had some great conversations. 10/10 hope I won't need them again but if I do will use them in a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113249236413180660227", "name": "Elizabeth Reeves", "time": 1560883143554, "rating": 5.0, "text": "Thank you Montgomery Computer Service for being Awesome, Great service, Great prices, Great people. I highly recommend you guys to everybody!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112461543244306757001", "name": "Ashley Wood", "time": 1560875105796, "rating": 5.0, "text": "A+ Service, Friendly Knowledgeable staff and  great prices. You won’t be disappointed", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106478301293966037265", "name": "Tina Halbert", "time": 1560875910746, "rating": 5.0, "text": "I can't say enough great things about this place! Knowledgeable staff who go above and beyond, reasonable pricing, and quick service. Help is just a text or phone call away. Thanks, Montgomery Computer Services, LLC!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "105884382190109525984", "name": "Nicholas Bruno", "time": 1560886228438, "rating": 5.0, "text": "Needed a computer screen for our business , he delivered it immediately and the price was amazing !! Great service will definitely use this business in the future. Thank you again guys", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "100758037114321527080", "name": "S.M. Huron-Dixon", "time": 1508980489793, "rating": 5.0, "text": "Great and experienced person. Best Buy said my motherboard was FRIED needed new computer. Googled found these guys, and easy peasy snip and snap. My laptop fixed in under 10 minutes.   Whoop whoop.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113518054764502723292", "name": "Anissa Perkins", "time": 1474998536163, "rating": 5.0, "text": "AMAZING! Guys who worked there actually knew what they were talking about, prices were reasonable, and customer service was perfect. I totally recommend this place. Friendly environment and fast service. Will definitely come back if I ever needed any computer repairs.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "109712014418191325096", "name": "Taylor Burck", "time": 1544130102873, "rating": 5.0, "text": "Can't say enough good things - My experience,  the mouse or cursor on my laptop had been jumping all over the screen to the point where I had no control over the actions of my mouse. I thought the trackpad may have been damaged on my laptop. I took my computer in, someone saw me right away. They worked on my laptop for about 15 minutes, installed some new drivers, $25, in and out and my computer has been working perfect for over a week now. For my experience,  a 15 minute, $25 trip fixed my laptop right up. Will come back again and again for any more issues I may have.", "pics": null, "resp": {"time": 1544130912865, "text": "Thank you Taylor"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108066320156800365392", "name": "Takira Savage", "time": 1520990458388, "rating": 5.0, "text": "The guys here are very friendly! The first time my laptop had issues, it went back to doing the same thing. However, they took it back and fixed it. Also, their prices are very affordable. I definitely recommend them to everyone!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104855205551316954805", "name": "Boston Waitforit", "time": 1560892122200, "rating": 5.0, "text": "I highly recommend going here for all your laptop needs. Great and friendly service!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "109249578225919340768", "name": "Shirley Burton", "time": 1488403215448, "rating": 5.0, "text": "I have used Montgomery Computer Services on at least three different occasions for repair work. Their work is fast and efficient with very reasonable pricing. Take your computer-related issues here BEFORE going to the bigger store.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108330282429620563527", "name": "BIG STAR TAVERN", "time": 1560874837747, "rating": 5.0, "text": "Highly recommend very knowledgeable staff great work and fast turnaround time, hands on in helping the community sponsorships and non profits", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113432947393353958661", "name": "Kristi Fuller", "time": 1496797853679, "rating": 5.0, "text": "If you are a small business struggling with your computer system, call them.  They had us back up and running in no time.  They are quick, reasonable and efficient.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110908060458546973743", "name": "Nathan Chong", "time": 1595258859910, "rating": 1.0, "text": "Made appointment for on site service but never show or contact back.\n\nReply: We apologize, but we do not have any contact information for you.\n\nI have left detail contact information with Roger Both for my father's number and myself including the location of the site.", "pics": null, "resp": {"time": 1595254718553, "text": "Your father refused the service when we arrived at his location ."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111685234210363899616", "name": "Sharonda Bonner", "time": 1457553223286, "rating": 5.0, "text": "Tyler came into our office today and replace our back up battery. Tyler was very friendly and efficient. I would recommend him for any tech issues or problems. Thanks Ty.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106879978270542861968", "name": "Cynthia Brown", "time": 1485556309131, "rating": 5.0, "text": "He was just a phone call away.  He was professional, courteous and knowledgeable.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108531075121144316715", "name": "Frances oates", "time": 1532626261275, "rating": 5.0, "text": "Great service and pricing very reasonable.. I was in and out in less than 30 minutes..Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "101405594476809467627", "name": "Peter Deegan", "time": 1519953031634, "rating": 5.0, "text": "Friendly and knowledgeable folks who fixed my small laptop problem quickly and with care.  Could not have asked for more.  Thanks v. much.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104555221795758276191", "name": "Leisa Ashley", "time": 1560885536459, "rating": 5.0, "text": "Expert service with a friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104806689802016156366", "name": "Jack Harrington", "time": 1487980956563, "rating": 5.0, "text": "Very, Very pleased with the service. I have used this business several times and Tyler really cares about his customers. Will continue to use as needed.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "101489041950663591518", "name": "CZn NewAr", "time": 1523997213707, "rating": 5.0, "text": "I am a student and due to some reason i broke screen of my laptop...i went here to fix it and i was surprised they fixed my laptop within 10 minutes..i wish i could give an extra star to rate them...i highly recommened everyone to visit there..keep up the good work\np.s: office depot where i bought it told me it will cost $599 dollar to fix...my laptop price is $499 and they told me i had to pay $599 to fix the screen", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111937429600991022562", "name": "Gregory Adams", "time": 1539627235479, "rating": 5.0, "text": "Good friendly service 100 in my book good place for computer problem", "pics": null, "resp": {"time": 1539649756895, "text": "Thank you"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "102368648292687824590", "name": "Christy Huff", "time": 1538011915019, "rating": 5.0, "text": "Great prices...fast work...amazing people...", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112455541344920401810", "name": "Jim Benefield", "time": 1555001087759, "rating": 4.0, "text": "Very nice and helpful staff.", "pics": null, "resp": {"time": 1555016804536, "text": "Thank you"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117742671038885837551", "name": "G Kay Norris", "time": 1580513881769, "rating": 5.0, "text": "Friendly and capable.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106991314674904129131", "name": "Chip Gentry", "time": 1480384600915, "rating": 5.0, "text": "Great Service and an excellent staff", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112910178869529194049", "name": "KENNETH NELSON", "time": 1537963132343, "rating": 3.0, "text": "Overcharged for a tube of thermal paste. 5 for one when Amazon had them at 5 tubes for 5 dollars.", "pics": null, "resp": {"time": 1560544189881, "text": "Next Time Order them from Amazon ...and wait 2 or 3 days"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112679237983857830544", "name": "Brigitte polk", "time": 1518526750127, "rating": 5.0, "text": "Professional and stand behind their work.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "115474369599763970241", "name": "Ruan Brits", "time": 1557590549340, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113528090579295402460", "name": "Tammy Evans", "time": 1560877876733, "rating": 5.0, "text": "I have had many problems with my computer & he's always been right there to help me out in fixing it couldn't for nothing else out if him thanks again", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110204201903849936623", "name": "Miss Jackson", "time": 1564273296375, "rating": 1.0, "text": "Disappointed. Disturbed.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104757779375503390395", "name": "Adam Beams", "time": 1580866253262, "rating": 5.0, "text": "I can’t say enough on the professionalism, service, knowledge of their product and pricing of ROYAL OFFICE EQUIPMENT. Greg and Dusty were amazing. They delivered the copier the same day as promised and stayed late to make sure everything was set up and working. The system works great and our office is highly satisfied. They had the best price and guarantee. Don’t look any further if you are in need of a copier company!  This is the way business is supposed to be. Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888e81986cdee765:0x62c69879fecf3681"}
{"user_id": "107339957173018340897", "name": "Hoyt Middleton", "time": 1609165592273, "rating": 5.0, "text": "Very knowledgeable about the products they sell and amazing customer service", "pics": null, "resp": null, "gmap_id": "0x888e81986cdee765:0x62c69879fecf3681"}
{"user_id": "109217094427497241517", "name": "Johnny Adams", "time": 1623464580778, "rating": 5.0, "text": "Friendly service.", "pics": null, "resp": null, "gmap_id": "0x888e81986cdee765:0x62c69879fecf3681"}
{"user_id": "107068443614558852815", "name": "HOYT MIDDLETON", "time": 1554391187634, "rating": 5.0, "text": "Always professional and going out of their way to help", "pics": null, "resp": null, "gmap_id": "0x888e81986cdee765:0x62c69879fecf3681"}
{"user_id": "102499151619153709184", "name": "Ali [ ]", "time": 1512059842518, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x888e81986cdee765:0x62c69879fecf3681"}
{"user_id": "102421511356525010762", "name": "Paul Foshee", "time": 1512004501464, "rating": 5.0, "text": "Where every customer is appreciated!!", "pics": null, "resp": null, "gmap_id": "0x888e81986cdee765:0x62c69879fecf3681"}
{"user_id": "103945019961749012093", "name": "Catalina Irizarry", "time": 1620956164237, "rating": 5.0, "text": "Although they were not able to help with my issue, the staff was more than happy to listen and give me ideas on how to proceed next.", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "117155675860078055780", "name": "Mercedes Ziegler", "time": 1591028330839, "rating": 5.0, "text": "The best customer service I've ever received, and my old Macbook is working like new. Will definitely return if I have any other issues. Very affordable service as well!", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "107955162354942975031", "name": "Shirley Camp", "time": 1617184079180, "rating": 5.0, "text": "Great 👍", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "113909644116917861014", "name": "Tye Campbell", "time": 1515700372682, "rating": 5.0, "text": "Fantastic store. My friend took her Mac to a big store (you can probably guess which one), and they told her that her hard drive had melted. That sounded fishy to me so I took it to The Core, and the only thing wrong with it is that it needed the operating system reinstalled. Easy fix, and great service!", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "104812402122563483062", "name": "Takishia Tillman", "time": 1509045046137, "rating": 5.0, "text": "They are the best!! My moms phone updated and her watch wouldn’t connect back to it , we took it to T-Mobile they couldn’t fix it so we contacted Apple and they wanted to schedule an appointment so I googled some places and saw this one we walked in the staff was beyond friendly they fixed it with no problem!!!! I I recommend this place to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "108743695839241733261", "name": "Alexa Carlisle", "time": 1438128161346, "rating": 5.0, "text": "FANTASTIC service! Chase has helped my husband and I several times. My computer completely died and I didn't think it could be fixed. He called and said he thought he could get it working again, and now it's as good as new! They have also advised me over the phone for no cost when I thought I had a virus. I definitely recommend using The Core for ANY Apple needs.", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "100188037977290029508", "name": "Amanda Hendrix", "time": 1524758011986, "rating": 5.0, "text": "Let me tell you about The Core, you guys. They are dependable, knowledgable, and flat out rockstars! Our business uses them for all of our technology needs. We have team members all over the country and they have been more than gracious to support each of us. As we continue to grow, I hope that they will continue to grow. I honestly like working with them better than a corporate Apple location. Other big retailers are always crowded and take days, sometimes weeks to get help. The Core isn't just another retailer, they actually know their stuff. They are actually focused on helping people grow their businesses. If your business needs any sort of devices... The Core is the way to go.", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "116023439196906040553", "name": "Kelsey Watson", "time": 1472333325782, "rating": 5.0, "text": "These people rock!!!! Best service I have had since I have been in Tuscaloosa! They really know what they are talking about and have been able to fix all the problems with my laptop I have thrown at them. Don't go anywhere else! (especially not the ferg for you college students)", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "111129655977608731660", "name": "Julie Reed", "time": 1420037064064, "rating": 5.0, "text": "I can't say enough good things about The Core.  The staff is very knowledgable and friendly.  They go the extra mile to help you.  Rob is wonderful.  He spent a lot of time helping me with my problem and was patient and friendly the whole time.  They have always had the products that I needed and could always identify what I needed when I really didn't know what is was called. I will always go to The Core for all of my Apple needs.", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "107474664261742734036", "name": "Elizabeth Monk", "time": 1418947254210, "rating": 5.0, "text": "So helpful, friendly, professional, and knowledgeable. I bought my computer here, and had an excellent experience here.\n\nHighly recommended!", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "103866327402676725002", "name": "Michelle johnson", "time": 1463955953829, "rating": 5.0, "text": "I went there for them to help unlock\nAn I pad my granddaughter locked\nThey were GREAT and so helpful\nI will go there with all my apple products.  If you have a problem with any I pads or phones or computer I suggest you contact them\nNow my granddaughter has her I pad and can watch her videos and listen to music and play her games\nThank you for your hel", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "104712634189518735745", "name": "Elliott Salls", "time": 1410967505177, "rating": 1.0, "text": "Took over 3 days to diagnose the problem. When diagnosed, I was told Apple had risen the price of Hard Drive power cables and that I needed a new Hard Drive and the anticipated cost would exceed $300. I was never contacted by The Core and I made every phone call to receive information regarding MY Mac Book. SLOW, SLOW, SLOW...they're there to expedite the process, not slow it down. After being told 3x's that my Hard Drive power cable would arrive the \"next day\", I was fed up with the process and proceeded to take my Mac Book to the University Supe Store, Apple Store (located in the Ferguson Center, at The University of Alabama)...and it was fixed in less than 4hours. Oh yea, and the final cost was only $40 for a new Hard Drive power cable and the installation. The actual Hard Drive was discovered...sorry The Core you're Apple privileges should be revoked strictly on your customer service, not to mention your \"knowledge\" of Apple products.", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "103125511857535853714", "name": "Jay Hamilton", "time": 1446587896223, "rating": 2.0, "text": "I'm not saying that their actual service in person is lacking. I've actually heard great things about their store. However, I tried on multiple occassions to call them, and email them, and I couldn't get a response. I couldn't find time in my schedule to actually drive to their store, so this was pretty frustrating  I ended up taking my iMac issues to the SupeStore on UA's campus and they fixed my hard drive in a day.", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "108378783446821599701", "name": "Margaret Teare", "time": 1383060840678, "rating": 5.0, "text": "Great staff with incredible knowledge! Don't buy your equipment ANYWHERE else whether you are a company or an individual in West Alabama. Buying printers, computers, including Mac related products at their subsidiary, The Core, costs the same as buying at Best Buy, Staples, The Iphone Clinic, except you get to avoid set up problems, software and hardware conflicts and unnecessary downtime.\n\nIts owner, Tuscom, AND The Core, is THE ONLY CERTIFIED Mac Reseller and SERVICE PROVIDER, in Tuscaloosa and Northport. Do not take your iPhone, iPad, Macbook Pro, Macbook Air to anyone else because if that company messes up your equipment a certified service provider CANNOT fix it legally. Just because the company has Iphone or Mac in its name, does mean that company is legally allowed to work on Mac products. Don't be fooled!\n\nThey troubleshot my Mac (for free) and uploaded my software and files to my new Mac for the same price as buying the computer. As my business grows, I will buy EVERYTHING from them. Run, don't walk, and sign up with these guys if you own a business, small or big. You will save so much money and headaches as you grow.   The employees will NEVER sell you anything you don't need AND will answer any question you have, whether, you are a tech newbie or a pro, in language that mirrors your level of knowledge. That kind of integrity is priceless.\n\nRob is great!", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "104229971752348137125", "name": "Jake William", "time": 1503715411434, "rating": 5.0, "text": "great staff and workers always friendly to me", "pics": null, "resp": null, "gmap_id": "0x8888a806d736a039:0xa4ebfd31be62d644"}
{"user_id": "102199980404199858886", "name": "Randy Hodnett", "time": 1619652161995, "rating": 5.0, "text": "This place is awesome! Always willing to help, very knowledgeable, professional.  They are prepay but pricing is fare and you won't regret doing business here. Covid has them backed up but in my opinion it was worth the wait.  Resolved all my issues.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "115550673897550928941", "name": "GEORGIA MCWHORTER", "time": 1620329278428, "rating": 5.0, "text": "I had purchased a laptop from Walmart that had some issues. I took the laptop, my tablet, and my cellphone in for the doctor to check out and setup my email to sync on all three.   At my request the tech explained to me his opinion on the laptop I had purchased.  I decided to return the laptop in favor of a laptop on the sales floor at computer doctor.\n\nMy experience here was professional, knowledgeable, good quality products, and fair pricing.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "100972076791560875406", "name": "Denise Jarrett Norcross", "time": 1612213165085, "rating": 5.0, "text": "Great communication and explanation of options - saved over 17 years of memories! Will highly recommend and I will definitely use again if need arises!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "106387538720096882700", "name": "Gerald Wilson", "time": 1614126761672, "rating": 5.0, "text": "Second time using Computer Doctor and am very satisfied. I recommend his services.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "100274480395455949611", "name": "Shari Holcomb", "time": 1602518899168, "rating": 5.0, "text": "I have used Computer Doctor for over 9 years!   Great company!   Great Christian owner!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "100472023574484979922", "name": "Joe Griswold", "time": 1588648151904, "rating": 5.0, "text": "I've used this store for almost  8 years and they always known how to resolve my issues.  I can honestly say that in my 8 years of doing business with this place, there has not been one issue that they failed to resolve.  I'm happy to make the 20 minute drive to computer doctor because I confident that when I pickup my device it will be done right.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "114761972102308704881", "name": "Roger Ingram", "time": 1574290013284, "rating": 5.0, "text": "The owner is very well educated in repairs. I took my computer in for repair and the owner told me what the issue was before even performing  diagnostics.  I checked it in and was pretty shocked to find out upon my return that he was absolutely correct with his over the counter assessment. Just happy to have my laptop back and its working great !", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "115900027927485798645", "name": "Brenda Patterson", "time": 1590512389829, "rating": 5.0, "text": "Bought a computer from this place and I am very happy with the service and the purchase of my computer.   Staff is very polite and professional.  Great place to do business.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "103750287991735433189", "name": "Bill Rogers", "time": 1568923513794, "rating": 5.0, "text": "Very professionally staffed repair shop.  Staff is very knowledgeable and help me resolve my issues.  Also educated me on  new technology which help me save money on my cable and phone bill.   You wont go wrong with this place.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "110967727171531343071", "name": "Clementine McGinnis", "time": 1547823774917, "rating": 5.0, "text": "I am a committed customer of Computer Doctor and have been for approximately 5 years.  The services provided has been nothing less than outstanding.  The least positive feedback I can provide has to do with the ability to contact for updates on services or receive direct feedback without reaching out to the source.  However; this is a very \"busy\" company and it is understood that all phone calls cannot be answered or returned immediately.  My previous and current experience with Computer Doctor has been very satisfying.  My recommendation is most definitely a \"five star\".", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "111735203388413313713", "name": "Yarquitta Webster", "time": 1587592107942, "rating": 5.0, "text": "My computer got hacked with a scammer attempting exploit money from me.  I took my laptop to the computer doctor and they disinfected my laptop and got me up and running again.   Great place to do business.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "111530798814044955857", "name": "Elsagondo Wells", "time": 1560200657813, "rating": 5.0, "text": "What can I say more?   I read the reviews before using this repair shop and decided to give them my business.  All I can say, the 5 star reviews are not fake! These guys know more about technology than anywhere else I've been. After Best Buy told me my motherboard was fried, Computer Doctor repaired my motherboard issue in the local shop and did not have to send anything offsite.  Its good to have a local shop that can repair electronics in-house.  I'm a customer for life!!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "118111100821827665804", "name": "Judy Denham", "time": 1565197664989, "rating": 5.0, "text": "Took my laptop in because it would not power on.  The doctor know what the problem was from his years of experience.  He advised me that the laptop is indeed powering on but there is no display.  He quoted me a price to repair the motherboard and told me I could pickup the next day.  I appreciate his knowledge and professionalism.  This place is well worth the visit and if I ever need any other word performed I will choose computer doctor again.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "107119384742767773660", "name": "Judy Ruffer", "time": 1574453526850, "rating": 5.0, "text": "I brought my computer to have it upgraded to windows 10.  In addition I spoke with them about  an email problem I was having with my spectrum email account.  I was not able to send or receive emails on my iPad, my Apple Watch, or my desktop computer.  I was advised that the issue was with me using an old Bright house email account.  The doctor took time to explain that when spectrum took over bright house, the  mail servers changed and i would need to be set up with the new settings.  He figured it all out and configured the proper setting on both my iPad and my Apple watch, and stated he would do the same on my desktop once its upgraded.  I love this place, they go above and beyond to satisfy the customer.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "116066434114761031687", "name": "Walter Yarn", "time": 1559770620570, "rating": 5.0, "text": "These guys are great and they really know technology.  They stay backed up with work so sometimes repair times can be a little longer. But the customer service is great and the work performed is well worth the wait.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "111487595717374846018", "name": "Gay Moseley", "time": 1544112070257, "rating": 5.0, "text": "I am a first time customer of computer doctor. I was referred by a friend who had a good experience.  I must say I too am very pleased with the service received.   Took some time to resolve my issue I assume because they are so busy.  I did notice a sign up stating that repair times were longer then normal due to a heavy work load.  I'm happy, excellent service.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "106351430829327779223", "name": "jamacia rudolph", "time": 1574464732624, "rating": 1.0, "text": "Horrible service I had an appointment and he kept giving me the run around changing  the time. He said he was leaving church and was only a few minutes away that turned into over an hour. I went elsewhere and was given much better service in a timely manner.", "pics": null, "resp": {"time": 1574459123721, "text": "This person has never done business with our company. People are so petty. Example:   if we are out on a service call and have a note on the door stating such, is it fair to leave us a negative review when you didnt have an appointment?  So how can you judge our service if you never contracted our service.  I guess this generation is doing what I refer to as  \"Drive By\" reviews.  Furthermore, in 15 years not one of our locations have ever been open on Sunday :-)"}, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "105272395544038599260", "name": "Jeanelle Andrews", "time": 1572907459649, "rating": 5.0, "text": "They were backed up with work and it took about 10 days, but it was well worth the wait.  They are professional,  knowledgeable and  were able to recover all my data and transfer it all to my new tablet.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "115086193292568657984", "name": "Jess Sullivan", "time": 1575488121149, "rating": 5.0, "text": "This man does very good work! I would recommend him to everyone who needs work done on computers,at great prices.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "110476545851251905213", "name": "Alysha Lee", "time": 1551129352161, "rating": 5.0, "text": "Amazing customer service! While I was visiting my laptop completely crashed and I needed it back up for work, Found this place and was happy I did. Got my laptop fixed in a timely manner and for a decent price.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "107673615730786013105", "name": "John Myers", "time": 1557422391631, "rating": 5.0, "text": "Hired the doctor to pick up my computer and get it straightened out. All I know is it was not running right.   His team picked it up and within a week it was returned to me with all issues resolved.  I'm grateful for such  knowledgeable and professional folks you can trust.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "103735659574069128150", "name": "David Lovering", "time": 1546201763967, "rating": 5.0, "text": "They were very helpful over the phone and in person. The doctor went out of his way to try to help us with our problem. He even had to leave the Wetumpka store to find something to help us and come back and try it out. Really above and beyond what a business has to do for its customers. The part didn't work and he didn't charge for the trial and error. Super impressed with the courtesy and respect of this first class business!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "115166229633860712518", "name": "Mark Hayden", "time": 1506549806203, "rating": 5.0, "text": "Quality service.\nHe is knows his stuff.\nHe accurately describes and prices services BEFORE rendering them.\nExcellent attention to detail.\nNo its not free.\nIt is reasonably priced.\n\nDr Mark Hayden MD PC", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "114168339525039839516", "name": "CookieMan2015", "time": 1537219336500, "rating": 1.0, "text": "Awful Service. Tried to get my computer fixed there and as I was trying to pay their reader wouldn't take my card and so i left and got my computer fixed elsewhere (at a much cheaper price as well) and when i got home I find that my card got charged $100 by these guys. I went back to ask for my money back but they just pointed at their no refund sign called me a liar and said that it did go through and said that I have $100 in store credit now that I didn't even ask for. How are these people still in business? They are not BBB accredited and they have a bunch of fake reviews about how good they are. Its amazing how all the people who left positive reviews have only one review on google ever while all the negative ones have multiple.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "117428961905150633835", "name": "Gloria Shepherd", "time": 1539899682740, "rating": 5.0, "text": "I've been using this place for the past 8 years and have never left a review. I've experienced nothing but excellent customer service and workmanship. I decided to leave a review now because the owner advised me of others who are attempting to discredit the company with fake negative reviews.  There have been many computer repair shops that I have seen come and go,  but computer doctor has been the longest running store in our area and I know its because of the knowledge and professional service rendered.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "117615119963228818378", "name": "E Marie", "time": 1509504403612, "rating": 5.0, "text": "Been using James Moore for years; with my personal computers and with the electronics at our machine shop. He has come out to our location several times. Great and honest. Pricing seems to be reasonable, which is why I usually only send business to his business.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "107361223675558706195", "name": "Peggy Dozier", "time": 1525389168830, "rating": 5.0, "text": "Great place to do business. Took my computer in for evaluation and the technician was very honest and knowledgeable.  My issues was resolved and I recommend others to do business here", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "113522801384603113879", "name": "Elroy Aadson", "time": 1553293117508, "rating": 5.0, "text": "Professional staff, fair, honest, and doesn't mind working with you until the job is done right.  I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "102292949422492720477", "name": "Loretta Pawlus", "time": 1544199594564, "rating": 5.0, "text": "We lost access to our email accounts , and also locked out of one of our computers user accounts.  Took it to the doctor and all was fix in just two days.  I'm a happy customer and will refer this company to my friends.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "103480249851528941298", "name": "Justin Chia", "time": 1547306433047, "rating": 5.0, "text": "I always fix my own computer when hardware is not working both desktop and laptop. However, some of other things are too tedious to deal with particularly laptop system. I sent one of my laptops to Computer Doctor (James) to take put the new HP Spectre x360  13-4003dx display (no bezel) on a display cover replacing the old one. He has done a very good job and consistently keep me updated. He will explain things to me upfront too. Fee is also reasonable unlike some other places from what I read and heard. If you have something you want to fix but just don't have time to deal and instead watching YouTube for hours you can simply  send your system to Comouter Doctor.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "108556137602176973777", "name": "Janice Warren", "time": 1583512790853, "rating": 5.0, "text": "Knows what he is doing and there when you need service.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "101272391573299214471", "name": "James Streeter", "time": 1527919094604, "rating": 5.0, "text": "While visiting from Mississippi I decided to contact  a few computer stores  in search for a refurbished MacBook Pro.  I'm glad I contacted computer doctor.  The staff is professional and very knowledgeable.  Had just what I needed and got it for a great price.  I'm from a small town, and believe me I've seen my share of so called computer repair stores.   I didn't expect to find what is no doubt a well organized and professional computer store in a small town like Wetumpka.  Based on what I've seen elsewhere, the city should be proud of computer doctor", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "106702529795425991638", "name": "Joshuah Noel", "time": 1537216311883, "rating": 1.0, "text": "These guys are overpriced, unreliable, and will scam you out of your money. Brought my computer to get it checked and fixed. $175 dollars later they tell me its unfixable. Next i need data Transferred from one sd card to another and they wanna charge $100 for just that. Office depot charges $50. They charge you upfront as well and have a big NO REFUNDS sign behind them so if you swipe your card and try to cancel your order as your standing there they will NOT give it back even if you didn't use them for anything. Got scammed out of over $200 here cause they can't fix things.\n\nIn closing, go LITERALLY anywhere else before you go to these guys. It'll be cheaper, it'll be more reliable, and if they can't fix it more than likely they'll give you your money back. I know for a fact Office Depot will, Best Buy will, and Geek Squad will.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "112666853446969645464", "name": "Ryan Stephenson", "time": 1521098555224, "rating": 5.0, "text": "I've used Computer Doctor on two separate occasions, on two different Mac computers. Both times, I wasn't sure what was wrong, but I needed it fixed quick. I called Computer Doctor and explained that I used these computers for work and it was extremely urgent to get them back up and running. They came out that afternoon, tested it to see what was wrong. They quoted me a price and said they would have it for me the next day.  And as promised, I was up and running the next day. Both times, they helped me out of a serious jam and I will call them again if another computer problem comes up.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "116711113481426779750", "name": "Lori Sies", "time": 1523630752998, "rating": 5.0, "text": "Very professional.  Laptop failed and they recovered the data.  Very reasonable on  prices.   Purchased a refurbished one and I love it.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "105602659402510295173", "name": "Ricky Henderson", "time": 1496274628319, "rating": 5.0, "text": "My tablet wasn't acting right, and i had a problem with my email.  Took it to computer doctor and within 24 hours I had my tablet back and it was working again just as before. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "116878430420788799287", "name": "Terry Goodson", "time": 1473919624080, "rating": 1.0, "text": "Terrible service. I had to pay $150 for him to look at my computer. Then I had to pay $450 before he would repair it. Over 9 months later, he had not repaired my computer. I finally had it returned to me un-repaired, and I still have not received my refund. I've left numerous messages, and he still hasn't contacted me. I'm am now preparing to take him to court. I will also file a report with the Better Business Bureau.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "115777241649920434148", "name": "Karen Stacey", "time": 1529094154974, "rating": 5.0, "text": "Highly recommend. James goes above and beyond what I had expected.  The wait was worth it for my computer to be fixed.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "114028709745265271281", "name": "Hoke Kerns", "time": 1533320704181, "rating": 5.0, "text": "Good company to do business with.  They came out to my house and had my problem fixed. They did have to return the next day to re-visit one final problem but Im happy with the out come.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "117530715810072138914", "name": "S. Tibbs", "time": 1522271223696, "rating": 5.0, "text": "Great repair shop.  Got locked out of my ipad and took it here to get it unlocked.  Took a few days but the company is very professional and they got the job done.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "108849192967277079897", "name": "Jessie McClellan", "time": 1526965353418, "rating": 5.0, "text": "Had email problems and the doctor had me straightened out in no time. Professional staff and a top notch 5 star business.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "117665421855410351840", "name": "Michael DeVine", "time": 1467385911100, "rating": 5.0, "text": "Everything was done quickly and as I requested. Can't ask for more than that.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "111168099855538946917", "name": "Mike Warren", "time": 1487356911389, "rating": 5.0, "text": "Had a problem with my gmail account not  syncing on my verizon tablet.   Took it to verizon and they could not get gmail configured to work on the device.  I then took it in to computer doctor,  left it for one hour and they had the gmail account working and syncing properly.  Service was great !!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "113256212603788344055", "name": "James Moore", "time": 1480900271589, "rating": 5.0, "text": "Great Place to do business, top quality support team.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "112090202832388313245", "name": "Sue Witcher", "time": 1513357990275, "rating": 5.0, "text": "I would highly recommend the Computer Doctor for any problems you have with a computer or laptop, be it software or hardware problems.", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "116220421317383349355", "name": "Fredia Richardson", "time": 1540430901387, "rating": 5.0, "text": "Great company that provides professional and knowledgeable service", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "112484800957412826545", "name": "Emily Doss", "time": 1537288450251, "rating": 1.0, "text": "Drove an hour to get computer fixed. We called a head of time and they were gone. Said they could help us in 45 mins but that would waste our whole day. 2 hours wasted.", "pics": null, "resp": {"time": 1537290967609, "text": "You called yesterday and inquired about our services.  However, YOU DID NOT MAKE AN APPOINTMENT FOR TODAY.  Had you made an appointment we would have available to accommodate you. Another customer called for an on-site service call and we were out taking care of that customer. It's customers like you that we have no desire to do business with in the first place, who take advantage of the system and leave negative reviews when you haven't done your part. We make no apologies for our actions as we were out servicing a customer who deserved service"}, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "105540525794398182061", "name": "Grace Pilgrim", "time": 1578949024899, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "116736321485348578969", "name": "Saundra Moore", "time": 1519943692204, "rating": 5.0, "text": "Great setserv", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "116025723000978982344", "name": "rodsalyn patrick", "time": 1519758666601, "rating": 5.0, "text": "Went above and beyond , I Came in and he fixed my laptop right away!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "101007744932347571867", "name": "Carol wright", "time": 1519395808950, "rating": 3.0, "text": "Seldom anyone there, but when he is, he is very helpful.", "pics": null, "resp": {"time": 1519403177303, "text": "Mr Wright, I am ashamed of your comment. To give my company 3 stars just because we are not sitting around waiting on your arrival is not fair. Has it ever dawned on you that we are not sitting around twiddling our thumbs, we are not at the bowling alley having fun, we are not at a social party ,  we are working even when we are not at the store location. It's called out on a service call.\n\nWe have a sign permanently posted to the front door that states if we are not at the store please call the number listed and a rep will arrive to assist you within 15 minutes.  We have been at this location for 10 years, during that 10-year tenure my records show that we have service your computer needs just two times once in 2013 and once in 2014. Here it is 2018 that you show up and leave a negative review because you arrive one or two times and there's no one at the store to assist you. During our 10-year tenure there have been computer stores that have come and gone however we have survived, and the reason why we survived is because we do good work and most people obey the sign that is posted on the door.\n\nIf they come and we're not present they follow the instructions they simply pick up their cell phone dial the number listed and Presto a representative arrives within 15 minutes just as stated. You have been most unfair in your review, has it ever dawned on you that we are the only full service retail computer store that's in operation in Wetumpka also within a 20 to 30 mile radius? Shouldn't that alone tell you that we are busy and there will be times when we're not at the store?  You do know that we have a telephone number that most people call, even to make appointments.\n\nDid you pick up the phone and call us to inquire about where we are what we're doing? All of the previous years that we've service you, you've never taken the time to say anything good let alone take the time to leave a positive review.  But here it is after 10 years of service you choose to leave a 3 star review not in regard to our work or the quality of work,  but you leave a 3 star review all because you arrived and no one was at the location, and you failed to pick up the phone call call.\n\nWe service residental and business customers alike, and we provide house calls and onsite service to both. When a business calls us and states there main business computer is down, we setup an onsite service call leave the store even at times when no one will be left to service the store. Why do we do this?  Its not personal its just business.  There is more money to be made in one business service call then there is for us to sit in the store waiting on residential customers to find the time to bring there computer in.   For you to reply to our absence as thow we are out on lake martin fishing rather than taking care of business is certianly not fair judgment. The good book says \"Judge not lest you be judged, for the same measure in which you judge others, you will be judged\".\n\nMaybe the next time a solicitor comes to your residential door in an attempt to sell you a product and you're not home, maybe that's solicitor should log on to Google and leave you a negative review. Not based on the fact that you didn't buy his product, but a negative review based solely on the fact that you were not even home.\n\nIn closing, I would like for you to exercise your right to choose another store to do business with.  Best Buy would be the closest and is only 45 miles away from your residence.  I just can't see the logic in us continuing to service someone who has Judged us so unfairly. If you would like to discuss this matter further, our phone number has been the same now for 10 years. I hope you have a better day."}, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "101063455191554682539", "name": "Shane Donovan", "time": 1479894491334, "rating": 5.0, "text": "Great Service !!!", "pics": null, "resp": null, "gmap_id": "0x888c2694964e20c1:0x7e27f6a2f3473c19"}
{"user_id": "114316320240783092086", "name": "Kelley Maddox", "time": 1599493828031, "rating": 5.0, "text": "I would highly recommend Chad for computer repairs!! Great quality work!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1512081888387, "rating": 4.0, "text": "Expert computer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOb4o7Pl6B41IsF05mUyN6pNMcGIw21TcGSrsgT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-eM7wOMXP8ls0r_vy5B-gcQU4XGdQinEQRlO5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzbSCDa8CCzRz1HbXLlHRnf2b8wZWXWweKdXbQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7gOj2mg0fBooHDB1e3IwLHUDtfjLRai-oiMja=w150-h150-k-no-p"]}], "resp": {"time": 1581047109385, "text": "Thanks!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102223213652406025901", "name": "Tina Brady", "time": 1599495586731, "rating": 5.0, "text": "He has always taken care of our computer issues! He is fast & does a great job!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "114985357054336860642", "name": "James Ellett", "time": 1599493682197, "rating": 5.0, "text": "I’ve used Chad many times. Always satisfied.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "114807225875482294327", "name": "Garrett Griffin", "time": 1587083440399, "rating": 5.0, "text": "He was very good with me and helping me determine issues with my gaming PC. He has been nothing but kind and helpful and I would recommend anyone to him any day. He doesn’t charge a lot, it’s a very fair price.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "115731831952409389288", "name": "Keosha Lenormand", "time": 1578594854462, "rating": 5.0, "text": "Very helpful and honest. Amazing prices. Definitely recommend!", "pics": null, "resp": {"time": 1581046973221, "text": "Thank you, Keosha!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "115615865282520100090", "name": "Louise Cherry", "time": 1523031736256, "rating": 5.0, "text": "I needed a chip taken off a board for my card window, and another one soldered on.  He did the soldering and called within two hours. He wanted to see if the new chip on the board worked, his work enabled me to roll a window up and down and saved me big dollars that the dealer would have charged to put in a new part.  Dealers do not repair those type of items.  I am glad I called him, he is a nice young man and does great work. Highly recommend this business.", "pics": null, "resp": {"time": 1581047127785, "text": "Thank you, Louise!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "113482756587232415039", "name": "Charlotte Ursery", "time": 1562521348320, "rating": 5.0, "text": "Chad is awesome the owner of the place he wasn't even open today but he took the time out of his day to come to the shop and fix my iPhone he is very reasonably priced and very friendly anybody needs phone repairs speaker repair cell phone repair anyting electronic he is the person you should go to wonderful service and great work", "pics": null, "resp": {"time": 1581047069390, "text": "Thank you, Charlotte!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100135678258820513115", "name": "Kelly Bishop", "time": 1557166524844, "rating": 5.0, "text": "I was told by another company my tablet could not be repaired and I would have to purchase a new one but Chad was able to fix it and save my photos.  He has also updated my personal home computer and removed the viruses.  I would highly recommend Chad for your pc repairs.", "pics": null, "resp": {"time": 1581047079050, "text": "Thank you, Kelly!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "106456759762771725845", "name": "Debbie Smith", "time": 1580323227424, "rating": 5.0, "text": "Quick, Professional and Very Reasonable Prices...", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "108910540900240218942", "name": "Harland Underhill", "time": 1485825420374, "rating": 1.0, "text": "Yesterday a friend sent me a link with a dire caveat that I'm probably not going to like this but I should see it. I open the link and lo and behold there is my wife, in all her glory, but with nothing else on. Now I've seen this picture before, she took it herself with my own personal phone. No where has this picture ever been shared, sent, or even seen by another soul other than myself. That is until I took my phone to get the battery taken care of at CH PC Repair.\n\nNow I understand that this is partly my fault for leaving that picture on my phone, I accept that. I had honestly forgotten that it was on there. But I had incorrectly assumed that my personal data would remain personal while my phone was in Chad's possession, but apparently that isn't the case.\n\nWhile the battery was fixed, I've now got to live with the fact that there are not so tasteful pictures of my wife out there for the world to see thanks to some perv PC repairman. If you for some reason desire to use this child for any repair work, make sure your data is extra secure or you wipe your memory card/hard drive before you take it to him. I'm over being mad at this, I'm just disgusted that there are people still like this out there in the world.", "pics": null, "resp": {"time": 1486566093960, "text": "Hello, Harland Underhill. I am having trouble reaching you.. I do not understand why you left such a review about me, and my business. I work extremely hard, and I take pride in my business. I would not do something of this matter. What would I benefit from this? nothing, nothing good at all. I am a man of integrity. I am known for the good work I do, and honestness."}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "117436945797970504746", "name": "Jason Williams", "time": 1527694339461, "rating": 1.0, "text": "This guy is awful.  No patience, no respect, no apologies when he screws up.  Everything is on his demands, but never his fault.  Respect is free, try giving it away sometime.\n\nDon't believe his stories.  He complained in LESS than a week - regarding a shipment originating in Canada - which were the terms he agreed to when he purchased (and also mirrored by the eBay shipping expected time).  But mistakes happen - all I needed was for him to say 'Sorry, my mistake'...  But he couldn't do that - preferring to say that he would be leaving negative feedback (for something he was completely wrong about).  Fortunately I had not shipped the part yet, as I was going to be in the US shortly, and able to do a much quicker & more secure USPS shipment...  But once you threaten negative feedback over something that you're wrong about, and are repeatedly unable to understand that you're in the wrong - damn right I'm canceling that order.  I have the right to \"fire\" a customer who is not conducting themselves appropriately.\n\nMost notable is the fact that negative feedback was left for me, and it took ~5 minutes for the eBay rep to review the details and get it taken down.  His complaints to eBay have resulted in absolutely zero effect on my account.  Clearly he was in the wrong in every part of this transaction, and he has YET to take responsibility or apologize for his errors.  I would not trust him to act in an appropriate manner in any facet of business, therefore this review is perfectly valid based on the lack of professionalism he has shown.", "pics": null, "resp": {"time": 1526479650586, "text": "I purchased an item from this guy on ebay(viridel75) Paid May, 3rd. I complained that it wasn't shipped May, 12th. He canceled the sale without me agreeing. Keeps blaming me for his mistakes. Knows nothing about respect!, Now harassing me?.. Reported to ebay."}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "109591382378310162559", "name": "Catherine Wells", "time": 1539197097078, "rating": 5.0, "text": "Chad is great! Highly recommend him. Thank you for being so helpful and honest.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1536169343913, "rating": 5.0, "text": "So glad I took my computer to Chad to have it repaired. He was helpful and kind. Repaired my computer quickly, and didn't charge some astronomical price!", "pics": null, "resp": {"time": 1581047097320, "text": "Thank you, Renee!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "113311719726002515422", "name": "Kelly Joiner", "time": 1491969329753, "rating": 5.0, "text": "Chad is a super nice young man ànd did a great job geatting rid of a virus buried in my laptop. Was extra accommodating to get it back within a day to meet my needs. Stayed in contact and let me know when it was ready. ;Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102397905705357537904", "name": "Carla Hardin", "time": 1539119126457, "rating": 1.0, "text": "Momma had a Samsung Galaxy s6 that just needed a new battery.  Ordered a battery from Amazon and they couldn't get the back of the phone off.  So they call the Verizon retail store in hazel green and the girl told her to take it to ch pc repair and he would do it.  My mothers phone worked FINE when she took it in there.  She could do anything and everything on her phone.  When she went to pick it up the phone would not even turn on.   He said he tried both old and new battery and it still wouldn't come on.  So he took the screen off and put it on another phone and the screen works.  So he is saying that the mother board is messed up.  He can check it out BUT he'd have to charge her to do it.  Momma said he really messed the back up,  like it was melted!!  I met her up there and his attitude is  basically \"screw you \".  He insisted that the phone was not working when she took it in.  I asked him why he didn't call her and tell her and he said because she didnt leave a number.  To which my reply is \"when you work in customer service like this it is your responsibility to get a number so you can get in touch with the person\". He is a total jerk!!  He takes ZERO responsibility for his screw ups.  Said he was not going to make it right.  But he did tell her that he'd buy the phone from her when she bought a new one.  Then he threatened to call the cops on us \"because it was after hours, he was closed and we wouldn't leave\".  He never asked us to leave, period.  He brags about how much money he makes per year and all of his vehicles and house is paid for.  Good for him.  I dont give a 🐁but what he has and doesn't have.  And now Marina tells us that her stepfather took a phone to him that was kinda messed up and was going to get the guy to repair it.  When he went to pick the phone up or really was messed up!!!", "pics": null, "resp": {"time": 1539369673755, "text": "Carla,\n\nThis issue is between me, and my client Pam Lanford. You came into my office, clearly disgruntled. You then continued to talk over me without giving me a chance to respond or explain the situation.\n\nPam visited my store with her device, which she believed to have a battery issue. She provided an aftermarket battery and had explained that an attempt was made, using a hairdryer, to open the casing and replace the battery, prior to me looking at the device. When the device was dropped off, I was in the middle of an extensive repair, as well as having a conversation with a different client. Not only that, but the device was dropped off quickly, without any contact information, and with very few details.\n\nI replaced the battery with the after-market battery she provided and then attempted to boot up the device, but to no avail. I investigated further but was unable to find a solution. Pam then arrived to pick up her device, and she was, understandably, very upset to find it not working. She wanted it in working order right then and there, and while I understand her sentiments, I can only do so much so quickly. I needed more time to troubleshoot and determine the problem and possible solution, but she would not allow it. I was even willing to reimburse her with a fair value for her device.\n\nI have been in business for more than 10 years now. I work hard every day, and I like to think that I am very good at what I do. I manage hundreds of computers monthly, and I repair and fix many devices daily (thousands of devices yearly). I can remove a device's back/screen in a few minutes with simply a bit of heat and some playing cards, and I have never had any issues. I would never damage a device intentionally. I treat all repairs as if they were my own. That being said, mistakes can (and do) happen as there are many risks involved with these repairs, but I do my best to make things right. To me, it's not just about collecting payment for the services I provide—although that is necessary for me to stay in business and provide for my family. It's about building long-term relationships with my clients, and I deeply enjoy helping and providing knowledge to my clients.\n\nThis is the first complaint I have received with the BBB, and I would truly like to resolve the issue, and have the opportunity to change your outlook on me and your experience with my business. CH PC Repair is my business—it has my name in it, a fact that I am proud of and would never change.\n\nSincerely,\nChad Harbin\nCH PC Repair"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100440554831365751805", "name": "Sandy Thrower", "time": 1463513434765, "rating": 5.0, "text": "Great and fast service.  Chad tackled the problem of a serious virus on my computer and was able to resolve it faster than I thought he would be able to.  I would highly recommend him and his computer repair service.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100181192580830469853", "name": "Tommy B", "time": 1518560685710, "rating": 5.0, "text": "One of the most dependable and honest businesses that I know of and their prices are good", "pics": null, "resp": {"time": 1581047118905, "text": "Thank you, Tommy!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "116070430570399990003", "name": "Bert Wiggers", "time": 1533658387994, "rating": 5.0, "text": "Does great work", "pics": null, "resp": {"time": 1581047153158, "text": "Thank you!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "110827897021780926439", "name": "dale stinnett", "time": 1550825729152, "rating": 5.0, "text": "Thanks 😘", "pics": null, "resp": {"time": 1550853935432, "text": "Hey you!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "107608350551647559068", "name": "Presley Thornton", "time": 1529682088649, "rating": 5.0, "text": "Thanks!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "112439074065538567652", "name": "Chad Harbin", "time": 1486566193580, "rating": 5.0, "text": "I am the owner.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102833086902583306951", "name": "Mary Hutchens", "time": 1529254777981, "rating": 5.0, "text": "He put a front on my phone in about 15 minutes now my phone looks new", "pics": null, "resp": {"time": 1581047144030, "text": "Thanks!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
