{"user_id": "116616345492093566843", "name": "BSA Queen Goddess", "time": 1628985029356, "rating": 5.0, "text": "I would highly recommend Gaget Works Mobile the best in Eufuala Alabama you don’t have to wait they pick up your computer repair what ever you needed fix in record time.  Gaget Works Mobie made my day I didn’t have to travel far to fix my MacBook Pro when an Apple consultant messed my computer up in the lst place  and wanted me to travel far to repair it and Thx 2 Gadget Works Mobile my computer is up & running and they give you knowledgeable tips about your computer and the price is right! Not like Apple they want to rip you off 😫 Thx Gadget Works Mobile U R The Best In Eufuala Alabama Your Honesty & Professionalism is what won me over Thx You Soooo Very Much 4 Getting me Back Up & Running with my MacBook Pro Shame on U Apple Gaget Works Mobile is The Real Deal 4 Real Much GRATITUDE!!!🥰", "pics": null, "resp": {"time": 1628985851361, "text": "Thank you for choosing us. We are glad to see you back up and running in only a few hours."}, "gmap_id": "0x888d470ebc8656e3:0x47251198a27b1c2d"}
{"user_id": "104024449358518482303", "name": "jodee young", "time": 1538772103533, "rating": 5.0, "text": "Good and fast service can answer any questions you have.", "pics": null, "resp": {"time": 1538776839698, "text": "Thank you. We are always here to help."}, "gmap_id": "0x888d470ebc8656e3:0x47251198a27b1c2d"}
{"user_id": "105525687465179150740", "name": "Nilansh Upadhyay", "time": 1541016835672, "rating": 5.0, "text": "Fastest service\nGreat for price", "pics": null, "resp": {"time": 1541019802239, "text": "Thank you"}, "gmap_id": "0x888d470ebc8656e3:0x47251198a27b1c2d"}
{"user_id": "115796799753705679247", "name": "Chris Kelly", "time": 1494965605750, "rating": 5.0, "text": "great and fast service", "pics": null, "resp": null, "gmap_id": "0x888d470ebc8656e3:0x47251198a27b1c2d"}
{"user_id": "108325541143971407909", "name": "Linda Mott (LMOTT)", "time": 1620148139644, "rating": 4.0, "text": "Very nice couple. Fair prices.", "pics": null, "resp": null, "gmap_id": "0x88921fd6ea2cb587:0x2a8e180758a6ee9f"}
{"user_id": "108394260378761272991", "name": "tax avengers", "time": 1548884132458, "rating": 5.0, "text": "Great experiences!! Very nice,  professional and knowledgeable would recommend them to everyone and I will be using them again", "pics": null, "resp": null, "gmap_id": "0x888cf31dbaec9d89:0x7d9ba9c820b36469"}
{"user_id": "108067026283151488532", "name": "Luke Johnson", "time": 1566485028683, "rating": 5.0, "text": "Excellent IT services.", "pics": null, "resp": null, "gmap_id": "0x888cf31dbaec9d89:0x7d9ba9c820b36469"}
{"user_id": "114832114120547924440", "name": "Otilio Rodriguez", "time": 1627734993693, "rating": 5.0, "text": "Fairhope PC did an excellent job in resolving technical issues with my laptop.  They were very professional and knowledgeable in the work they do.  I Had my laptop back within a week, and its working like it suppose to.  I highly recommend this shop for all your PC and Laptop issues and updates..", "pics": null, "resp": {"time": 1627760680054, "text": "Thank you Otilio!!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "103301781441239757274", "name": "Allen Johnson", "time": 1626888158561, "rating": 5.0, "text": "I wasn't sure where to go in our area and found the guys at Fairhope PC.  Small office but right on Fairhope Ave. so be careful not to miss them.  So knowledgeable and prompt.  I had a few challenges and they knocked it out in no time.  Super nice and personal service.  Thought it would take a few days and had all my equipment back in a day and they even did a nice job of follow up with me.  Loved the experience with these guys and glad to have their top notch support and so convenient when needed.", "pics": null, "resp": {"time": 1626889468471, "text": "Thanks Allen! I appreciate your kind words and we're always happy to help!\n\nRegards,\nJudge Keeler"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "101552646563653579272", "name": "Barry Simpson", "time": 1622677963148, "rating": 5.0, "text": "Received excellent service on my desktop computer from Dylan. They are very reasonable with their rates. Highly recommend them!", "pics": null, "resp": {"time": 1622683752159, "text": "Thank you Barry, glad we were able to help!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "100330315702963341285", "name": "Sandra Hill", "time": 1620411358744, "rating": 5.0, "text": "Judge Keeler and his employees are extremely helpful and courteous. I have used them several times and have received the same excellent service at reasonable rates.\nI've recommended Fairhope PC to several friends and they also are pleased with the polite and professional way they conduct business.\nSandy", "pics": null, "resp": {"time": 1620412033259, "text": "Thanks Sandra we're always happy to help!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "108473958684908989736", "name": "Brenda Brooks", "time": 1621718132755, "rating": 5.0, "text": "I totally trust these guys with all of my PC needs! They really know their stuff! Dylan put a new processor in my laptop and did a lot of detailed work, now I love the way my laptop performs! Thank you Dylan!", "pics": null, "resp": {"time": 1622729809769, "text": "Thanks Brenda! I'm glad we were able to help."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "112219567385981520745", "name": "Ron Buttarazzi", "time": 1620323996468, "rating": 5.0, "text": "Both Judge and Dylan were very responsive to my needs ; went out of their way to assure I was satisfied with every aspect of the installation.\nI was very happy with the quality of service and their professionalism !", "pics": null, "resp": {"time": 1620412049509, "text": "Thanks Ron!!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "106044944722216265766", "name": "Karen Myrick", "time": 1614434976839, "rating": 5.0, "text": "I have no worries about all that I do not know and will never know about what makes my magic computer work because of the brilliant technicians at Fairhope PC and their patience in communicating the problems I occasionally run into with my computer. They are so reliable with their service that I don’t have to feel frustration. I also appreciate how upfront they are about costs and alternative choices for repair solutions.", "pics": null, "resp": {"time": 1614882808148, "text": "Thank you Karen! I am grateful for your kind words. We are always happy to help!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "101008550641251314889", "name": "Jefrrey Nordling", "time": 1607447971806, "rating": 5.0, "text": "I highly recommend Fairhope PC! Even though my request was a small one, they handled it professionally and at a good value. If I need their help in the future, I would not hesitate to give them a call!", "pics": null, "resp": {"time": 1607449125082, "text": "Thanks Jefrrey!!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "103218452697895260004", "name": "Lance Lamb", "time": 1604531328123, "rating": 5.0, "text": "Brought our Mac in because it was running extremely slow. The guys at Fairhope PC were very helpful! They let me know exactly what was going on and made repairs quickly and at a reasonable rate. Highly recommend!", "pics": null, "resp": {"time": 1604532712477, "text": "Thanks Lance! It was our pleasure, please let us know if there's ever anything else we can help with.\nJudge Keeler"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "114759100969860775646", "name": "Randal Wright", "time": 1611691323353, "rating": 5.0, "text": "Excellent service and Dylan did a suberb job of explaining the work and costs that might need to be done.  Fortunately the CPU just needed a new hard drive and the cost was much less than anticipated.  Thrilled with quality of work.", "pics": null, "resp": {"time": 1611694790739, "text": "Thanks Randal! I'm glad we were able to help you out"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "104689773781425832672", "name": "Becky Springer", "time": 1605719976610, "rating": 5.0, "text": "Judge and Dillon go above and beyond to help with all PC needs.  If your someone that struggles with technology, this is the right place to call.  You will be so happy with their service!  Thanks guys!!", "pics": null, "resp": {"time": 1605739214789, "text": "Thanks Becky! It's always my pleasure to help you out\n-Judge Keeler"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "102328046533975462025", "name": "Dru Burgess", "time": 1605618748548, "rating": 5.0, "text": "I have been using Fairhope PC for almost 5 years now.  They are always timely, professional and helpful.  I have recommended them to friends and will continue to do so.  Thanks Judge and Dylan!", "pics": null, "resp": {"time": 1605620087841, "text": "Thanks Dru, its always our pleasure to help!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "108426892688725360007", "name": "Tim Lazaris", "time": 1612399214241, "rating": 5.0, "text": "Dillion was very patient and helpful!!! Fixed my computer and set me up with a back up device. Will be customer for life!!!", "pics": null, "resp": {"time": 1612457570380, "text": "Thanks Tim, we're always happy to help!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "104955015917988304690", "name": "Deborah Jantz", "time": 1604185572535, "rating": 5.0, "text": "Fairhope PC was super responsive and kind! My laptop was not repairable, through no fault of theirs, but they even waived the diagnostic fee! I was very pleased with their service!", "pics": null, "resp": {"time": 1605802115959, "text": "Thanks Deborah! Please let us know if there's ever anything we can help you with."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "105064843457071358641", "name": "DX", "time": 1611695003024, "rating": 5.0, "text": "They were quick in discerning my problem and their plan for resolution was cost effective and executed promptly. Goto guys for computer related in Fairhope!", "pics": null, "resp": {"time": 1611696632823, "text": "Thanks Doug! It's always our pleasure"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "113004986926335585076", "name": "Michael Stodard", "time": 1606845872143, "rating": 5.0, "text": "The staff at Fairhope PC has always been professional / courteous and helpful in keeping our computers functioning at 100%, but also willing to guide me in not spending money on repairs that would work, but might not be the most cost-effective solution - which I appreciate.", "pics": null, "resp": {"time": 1606858533299, "text": "Thank you for the positive review Michael. We look forward to helping you again in the future!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "111387764929259795040", "name": "Michele Bennett", "time": 1605641610705, "rating": 5.0, "text": "I got in to have my MacBook serviced. These two gentlemen could not have been more helpful. They will become my go-to Computer Service Company ! Excellent job ! Excellent Service !", "pics": null, "resp": {"time": 1605642428313, "text": "Very happy to hear it Michele! I look forward to helping you again in the future."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "105183905249565289992", "name": "Angela Waters", "time": 1592605662530, "rating": 5.0, "text": "Judge and Dylan are very professional, extremely knowledgeable & prompt!  They ran a test on my computer & Dylan called to discuss the issues, what options were available & the cost.  He also listened to what my preferences were and combined it all to give me back a fast, updated, working computer. Dylan went so far as to offer his help (remotely) to get my printer back online & connected to my computer, but I had the disc & was able to do it.  Fairhope PC is definitely top notch!!", "pics": null, "resp": {"time": 1605802147041, "text": "Thank you Angela! We're always happy to help."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "102081682683822644159", "name": "Barclay Godwin", "time": 1604693045348, "rating": 5.0, "text": "I was very pleased with my service at Fairhope PC. I did not have a recommendation for them, but we are in a small town that is growing quickly, if the service or quality of a business is not excellent, that business doesn't last long! They were in business when I arrived 4 years ago, so I thought \"they must be good\". They are!\nThey quickly diagnosed the problem with my laptop, called me with a price, made the repairs and returned it to me in a couple of days!", "pics": null, "resp": {"time": 1604694719337, "text": "Thanks Barclay!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "117312571249207371934", "name": "Cary Bean", "time": 1603735337048, "rating": 5.0, "text": "We had recently purchased a headset microphone that wasn't working with our computer. The staff diagnosed the problem and gave us several alternatives, at different prices, to fix the issue. we were very pleased with the results!", "pics": null, "resp": {"time": 1603849191348, "text": "Thanks so much for your kind words. So happy we were able to help!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "113329398641881986220", "name": "Steven Friedenberg", "time": 1625758647167, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1625759303478, "text": "Thanks Steven!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "112641907725052625150", "name": "Jerry Lawson", "time": 1612461132422, "rating": 5.0, "text": "The team at Fairhope PC was very professional and knowledgeable.\nthe fixed my daughters MAC. I will take my ASUS there when its time.", "pics": null, "resp": {"time": 1612461899730, "text": "Thanks Jerry!!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "114572081706729434931", "name": "Carol G", "time": 1593717002061, "rating": 5.0, "text": "We have used these guys, Judge and Dylan, for sometime with consistent positive results.  They are extremely responsive and courteous and we always feel it is $ well spent.  AND, they will tell you promptly if they cannot resolve your issue.....we recommend!", "pics": null, "resp": {"time": 1603849207959, "text": "Thanks for your kind words!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "113380934735503624713", "name": "Roger Wettlaufer", "time": 1612608997633, "rating": 5.0, "text": "They did a good job of transferring files from old computer to new one. Price was fair.", "pics": null, "resp": {"time": 1614200083305, "text": "Thanks Roger!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "107365884695369524413", "name": "Dan S", "time": 1586352413943, "rating": 5.0, "text": "Wanted to say that I own Tech Solution LLC down in Gulf Shores. We are competitors, but I called them in need of some thermal paste for a clients computer and they supplied it with no problems and a fair price. There are very few tech businesses willing to help other tech businesses around. Judge - If you ever need something or have a tech problem you need to talk through, don't hesitate to reach out!", "pics": null, "resp": {"time": 1604602156934, "text": "(Translated by Google) Thanks Dan!\n\n(Original)\nThanks Dan!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "109915758001302619145", "name": "Nick Merchant", "time": 1605743152460, "rating": 5.0, "text": "Excellent, speedy service and very fairly priced.", "pics": null, "resp": {"time": 1605802082036, "text": "Thanks Nick! We're always happy to help."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "104826106123466243749", "name": "Brenda Megel", "time": 1573324831152, "rating": 5.0, "text": "What an honest and well run computer repair shop. My work laptop was stuck on a Windows 10 update and had a few other small glitches. The guys here explained how they would look into things and what they could do. They called the next day with a diagnosis and a plan. It was repaired very quickly. I then had a couple crashes after the repairs and they told me to bring it back in. This happened twice. They updated a few more drivers at no additional cost. Both in a days turnaround.\n\nI then took in my Surface as I thought it was overheating. They tested it that very day, and said that it wasn't really overheating, but they put a program on it where I could monitor the internal temperature - and didn't charge me a dime! The cost to repair my work laptop was very reasonable, and as said I brought it back twice and they didn't charge anything. Very knowledgeable guys, very polite and curtious and very professional. I highly recommend them!", "pics": null, "resp": {"time": 1605802202529, "text": "Thank you Brenda!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "104019080639385038996", "name": "Gary Wasko", "time": 1608840578173, "rating": 5.0, "text": "Real nice people giving service", "pics": null, "resp": {"time": 1607449105269, "text": "Thanks Gary!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "112046731480786632186", "name": "Jeremy Wells", "time": 1591909676150, "rating": 5.0, "text": "Very nice and very helpful.  They have a great sense of communication with their customers.", "pics": null, "resp": {"time": 1605802166386, "text": "Thanks Jeremy. Please let us know if there's ever anything we can help you with."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "100810038903714417503", "name": "Lauren Bowling", "time": 1576271135148, "rating": 5.0, "text": "Everyone at Fairhope PC was so courteous and informative when I brought them my damaged laptop. They told me exactly what was wrong but did not force any repairs and respected all of my requests. They are professional, efficient, and very polite. I won’t take my laptop anywhere else!", "pics": null, "resp": {"time": 1605802194612, "text": "Thanks Lauren!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "114279496331752800531", "name": "James Brock", "time": 1612358002847, "rating": 5.0, "text": "Knowledgeable, friendly, efficient.", "pics": null, "resp": {"time": 1612367747235, "text": "Thanks James!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "115434608573849687241", "name": "Joey Campbell", "time": 1558632773012, "rating": 5.0, "text": "These guys are the absolute best.  I was helped as soon as I walked in the door despite them being busy.  They were knowledgeable and friendly.  I will always use these guys going forward.  Do yourself a favor and check them out.", "pics": null, "resp": {"time": 1558633502487, "text": "Thanks Joey! It was my pleasure to get you sorted and hope to help you again in the future.\n\nJudge Keeler\nFairhope PC"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "117267945399501001191", "name": "Martha Muscat", "time": 1618612675793, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": {"time": 1620155422979, "text": "Thanks Mrs.Muscat!!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "100901836873228436075", "name": "Jeannie Woodall", "time": 1570973062335, "rating": 5.0, "text": "Very quick to respond to the problem, , thorough and extremely helpful with my business needs.", "pics": null, "resp": {"time": 1605802209031, "text": "Thanks Jeannie!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "115402868408863009033", "name": "AKiwi69", "time": 1531258190435, "rating": 5.0, "text": "PC broke brought it in and it is working better than brand new.  Judge did an amazing job with the repairs.  Highly recommend.", "pics": null, "resp": {"time": 1531259337614, "text": "Wow, thanks! Glad you are happy with the service!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "111089213147067672030", "name": "Amanda Johnston", "time": 1551903420878, "rating": 5.0, "text": "Superb customer service. Very helpful. Honest and dependable.", "pics": null, "resp": {"time": 1605802245092, "text": "Thank you Amanda!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "104831848187834489531", "name": "Susan Bliss Pearce", "time": 1567554183588, "rating": 5.0, "text": "Absolutely the best service and expertise!", "pics": null, "resp": {"time": 1605802217123, "text": "Thanks Susan!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "117453124595888091961", "name": "Liz Wharton", "time": 1533064058831, "rating": 5.0, "text": "My Macbook hard drive crashed! I underestimated the damage... Judge Keeler. IT Support for the shop looked it over and let me know the hard drive was a goner. Judge replaced the hard drive and did a masterful job of retrieving data from the dead drive. Professional, friendly service. I trust these folks to handle even the biggest job.", "pics": null, "resp": {"time": 1533064718713, "text": "Thanks Liz! I'm glad we were able to get you back up and running!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "110044969002632886988", "name": "Carolyn Kidd", "time": 1555770813733, "rating": 5.0, "text": "I brought my MacBook Pro to fairhope pc with a specific problem. When they were unable to resolve my problem Judge refunded my money.  He also called and explained why the problem occurred.", "pics": null, "resp": {"time": 1605802237486, "text": "Thanks Carolyn!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "111773753875224947437", "name": "Jason Ellison", "time": 1566075033869, "rating": 5.0, "text": "Trustworthy local shop.", "pics": null, "resp": {"time": 1605802225583, "text": "Thanks Jason!!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "108576964382745011235", "name": "Drake Roberts", "time": 1539961017539, "rating": 1.0, "text": "Just left this place never been till now I came in looking for a Lenovo laptop charger and the man behind the counter said he doesn't know if he had any new and said he was not sure if he had any used and suggested Walmart\nDidn't even make an attempt to check only said he wasn't sure then auggsugge I go elsewhere I got the feeling I was bothering him just by being a customer would not recommend and will never be back", "pics": null, "resp": {"time": 1539964910559, "text": "Thanks for your review. I just reviewed the recording to be sure you were helped as best as possible. We are a repair shop, and as such are unable to carry every different brand and model adapter. Dylan knew right off the bat that we do not carry the new Lenovo adapter you were searching for. We have in shop adapters that we use for repairs, he should have been more clear about his response. He also recommended Walmart, because he was trying to help you find the adapter. He gave you a card and asked you to keep us in mind in case you had anything we could help you with. Sorry you felt like he was dismissive, but we simply did not have what you were looking for. Best of luck on your search."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "103207106000917058150", "name": "David Hill", "time": 1558192106208, "rating": 1.0, "text": "Strictly about getting as much of your money for as little as possible.Deceptive and highly overpriced.Be sure you already know what's wrong before you bring your Pc there,if not they'll make it worse before making it better and charge 3 Times as much as original problem should have been.", "pics": null, "resp": {"time": 1558193911884, "text": "Hi Stranger! Are you sure you left a review for the correct business? I have no record of you in my system, and I can assure you I would be aware of any such interaction as the one you described. I would love to hear from you, we do our best to correct any situation. 2519294609\n\nAlso, if you're able to provide me with the time that you interacted with my techs, I'll be sure to review any phone calls or video of the shop to make sure our high standards are being met. I'm having trouble understanding your review for a few reasons -\n\n1- I have no documented interactions with you and am unable to reach you.\n2- We NEVER charge for anything without the customers approval.\n3- We always take into account the value of the equipment brought to us so we can justify the cost of repair. Unfortunately, a lot of equipment brought in for repair is not worth the cost of repair. We decline to repair a lot of equipment. In these situations we offer alternative solutions such as migrating to a new computer, or providing a backup so you can purchase equipment elsewhere.\n4- There is another business in the area with a very similar name that has caused confusion in the past. I cannot speak to the quality of the work they perform, I just know we have been mistaken for them quite often.\n\nStill looking forward to speaking with you personally and clearing up any confusion.\nJudge Keeler - 251.929.4609"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "102896381789092900832", "name": "Gulf Bay Photography", "time": 1512781392733, "rating": 1.0, "text": "I dropped off a pc due to freezing on monday night. They had it all week and picked it up on friday night. They stated it was the second hard drive causing the issues and all was perfect. I got home tonight plugged it in and froze up within 1 minute. How do you have a pc a whole week and the first minute I get it plugged back in the pc freezes again? Something is wrong and the problem was not diagnosed properly.", "pics": null, "resp": {"time": 1513629788911, "text": "Thanks for your review Ben. Ive followed up several times and not heard back from you. I apologize for the time frame, hope you were able to find the help you were looking for."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "110847475125745504906", "name": "Ron M", "time": 1503180055458, "rating": 5.0, "text": "Prompt, professional service at a reasonable price.", "pics": null, "resp": {"time": 1605802259172, "text": "Thanks Ron!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "108361279242275275204", "name": "david truedale", "time": 1498251853996, "rating": 5.0, "text": "So i had alot of problems with the motherboard and helped me narrow it down to being the prongs on the motherboard, at the end day it was the help i needed. #Willusethemagain", "pics": null, "resp": {"time": 1498252367767, "text": "Thanks David! Looking forward to hearing back from you when you're up and running."}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "112977397783382884839", "name": "Kim Tracey ella", "time": 1506882979533, "rating": 5.0, "text": "The best problem fixers ever!!!!", "pics": null, "resp": {"time": 1605802253686, "text": "Thanks Kim!"}, "gmap_id": "0x889a408f8f37090b:0xfb8ff6d4ddff1f46"}
{"user_id": "105772557537792872993", "name": "Joshua Pemberton", "time": 1627615786273, "rating": 5.0, "text": "I would like to say that if you ever need any computer work done, give this man a call. This is coming from a computer tech and I know what quality service looks like and this guy is it! I have been working on systems since 1991 and the professionalism is a breath of fresh air. Talking on the phone or in person, you get a great since that he actually cares and interacts with you in a caring and understanding manor. The customer service is fantastic. Thank you for helping me with obtaining a video card for one of my customers on such short notice. You rock man and hope to do more business with you in the future!", "pics": null, "resp": {"time": 1628092251526, "text": "Joshua,\nthanks for the kind words\nappreciate your business sir."}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110993937713811232186", "name": "Thomas Foster", "time": 1628170938001, "rating": 5.0, "text": "PC Tech has again renewed our belief in the importance of small businesses.  The team is knowledgeable, competent and caring. The technological expertise is evident and appreciated. Thank you for a great experience in the purchase of our new computer!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100211190655447282839", "name": "Bud McInnis", "time": 1628621825328, "rating": 5.0, "text": "been using for a number of years.  Very satisfied with all my dealings.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117527949797732697284", "name": "Sandra Shortt", "time": 1626206039094, "rating": 5.0, "text": "I was given an accurate estimate and time line on when my computer would be complete and I had my computer back with the repairs that were needed when I was told I would have it.  Great folks to work with!", "pics": null, "resp": {"time": 1626371068981, "text": "Ms, shortt\nthanks 4 your review\nglad we could help\nIf you need us   just click or call\nthanks"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110182071482942703517", "name": "robzilla60", "time": 1611896399673, "rating": 5.0, "text": "These folks are top-notch. They are up front with their capabilities and technical knowledge. It is a Mom and Pop operation and Sean and his wife both do tech stuff. Very fast with diagnosis and letting the customer know his options and what those options will cost. It's so much better than dealing with the 'corporate techies'. They are quick about it as well, having my system back up and running in only 3 days. They are very personable and friendly and don't charge an arm and a leg for their services. They are a small American business operation, and I will support them with my business the next time I have a computer issue. They beat the 'BIG' guys hands down!!! GREAT JOB Y'ALL!", "pics": null, "resp": {"time": 1611931194872, "text": "hey rob\nthanks for ur business\nglad we could help u sir\nwe'll be here when u need us\nthanks again😎"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116701269371225770468", "name": "GARY DOSS", "time": 1625225586276, "rating": 5.0, "text": "I had a laptop issue  .Very fast  and  great service .Brought it in on a Monday and was complete and out Thursday  the same week .Explained everything they did and showed me the new features and how it operated .Very good service and quality work . Very satisfied.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103019393513382836879", "name": "Lynn Ash", "time": 1628178196793, "rating": 5.0, "text": "Techs provide great friendly service.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114838047357076054516", "name": "Katie Peterson", "time": 1622155817854, "rating": 5.0, "text": "Great work and fast turn around. Very pleased with the service. Definitely would recommend to anyone who needs computer fixed or worked on", "pics": null, "resp": {"time": 1622642897593, "text": "katie thank u so much for your business\nglad we could resolve your issues\nthank you"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111559957535204676333", "name": "Pamela Williams", "time": 1625681797203, "rating": 5.0, "text": "I want to commend Shawn of PC Computer Services for the excellent service he gave me. Any future problems and I will be contacting him again.", "pics": null, "resp": {"time": 1626371203774, "text": "thank you pam for your review\nglad we was able to help you mam"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114772344357770018503", "name": "Debra Owens", "time": 1623936746161, "rating": 5.0, "text": "Lost sound on TV.  Took it in and had it fixed within a few days. Excellent customer service!", "pics": null, "resp": {"time": 1624283419639, "text": "thanks\nglad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102017469282885174590", "name": "Leon Meadows", "time": 1627057511628, "rating": 5.0, "text": "fantastic place to have ur machine repaired", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "105452883894134330156", "name": "Jason Krasinski", "time": 1615327317066, "rating": 5.0, "text": "They seemed very knowledgeable, and very responsive. Service was pretty quick and they kept me updated the whole time.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111376928807868669698", "name": "Roberta Brewer", "time": 1628096422722, "rating": 5.0, "text": "The tech was very knowledgeable and professional.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111932911948950498540", "name": "Coby Evans", "time": 1607975861421, "rating": 5.0, "text": "Great service all around. I was prepared to not have my MacBook for a few weeks but PC Tech was able to diagnose the problem, have parts shipped and fully repaired back to 100% within a week! I’ll be recommending this place to anyone that needs any computer tech repairs from now on. Support this local business!", "pics": null, "resp": {"time": 1608060491320, "text": "coby\nglad we could help\nif u need us just call  click or stop by\nthanks 4 you business 😊😎"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111696300737104394670", "name": "Sean Warnock", "time": 1606169240362, "rating": 5.0, "text": "Great experience! I highly recommend taking your computer here, he walked me through the issues and helped determining best prices for replacement parts! Would absolutely use him again.", "pics": null, "resp": {"time": 1606232144798, "text": "hey sean\nappreciate the review  glad we could help\nthanks for ur business"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "118175164815318619973", "name": "Lauren Johnson", "time": 1624149878179, "rating": 5.0, "text": "They were very polite and worked me in quickly!!", "pics": null, "resp": {"time": 1624283400515, "text": "thanks for your business Lauren"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116284905390195008174", "name": "joey saunders", "time": 1612985435155, "rating": 5.0, "text": "Techs was great patient and very helpful. He was very busy but took time to help. See him with your issues.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104212402154238133340", "name": "Dane Pridgen", "time": 1591995164593, "rating": 5.0, "text": "My experience with this company is first-rate. I have an older iMac that was in need of servicing and it was done to perfection. I am writing the review from it right now! The owner gave every discount available without my even having to ask. He even offered to service the fans on the back of this thing quarterly free of charge. I will definitely do business with him again and tell everyone I know of this tremendous service - which extended the life of this great product. That is priceless to this thrifty soul! Thank you PC Tech!", "pics": null, "resp": {"time": 1592333116160, "text": "Mr Dane\nalways a pleasure take care  and look forward to helping you in the future.."}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111643498696466951751", "name": "Kristina Goins", "time": 1592409190228, "rating": 5.0, "text": "These guys are wonderful!  I highly recommend.  Not only did they find the problem with my computer, but they didn't try to charge me an arm and a leg.  I will be bringing all my computer problems to them.  They are such nice guys.", "pics": null, "resp": {"time": 1592583151152, "text": "glad we could help fix u up\nlook forward to helping you in the future\nthanks"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110078077318855463799", "name": "Stacy Kriser", "time": 1599835423629, "rating": 5.0, "text": "I highly recommend PC Tech, they were very professional and and quick and efficient, they communicated quickly and help educated me on my computer issues. they were easy to work with. i highly recommend them with all your computer needs.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103540362146250199561", "name": "Wesley Grubbs", "time": 1611767318358, "rating": 5.0, "text": "Great prompt service. Always willing to help.", "pics": null, "resp": {"time": 1611931225743, "text": "thank wesley\nglad u are ready to go"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113136128900043144037", "name": "From The Den with John Garrett", "time": 1610649832414, "rating": 5.0, "text": "excellent! great service-- very helpful. put my mind at ease.\n\nupdate:  RECENTLY PURCHASED ANOTHER MACHINE ( JANUARY 2021 ) -- AND IT WAS READY 5 DAYS BEFORE THEY SAID IT WOULD BE. WORKS BEAUTIFULLY-- VERY FRIENDLY PEOPLE-- -- I DONT WANT TO LEARN HOW TO FIX COMPUTERS-- I JUST WANT THEM TO WORK WITHOUT ISSUES-- AND PC TECH AGAIN PUT MY MIND AT EASE-- I REALLY APPRECIATE THEM-- WILL STAY WITH THEM FROM NOW ON--", "pics": null, "resp": {"time": 1592333157473, "text": "glad we could assist you sir\nthanks"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107044879087445821822", "name": "Tammy Middleton", "time": 1604672164322, "rating": 5.0, "text": "I got a virus on my computer and they were very quick to fix the computer and install security services on multiple devices.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101705640808835534115", "name": "D000E", "time": 1592928870655, "rating": 5.0, "text": "Best service in our area. Clear and honest pricing with no deceptive sales tactics. This is now my first and only stop for my MacBook issues. They saved me $400.00 and gave me another solution. Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101363903155336379352", "name": "Chris Foley", "time": 1586820554607, "rating": 5.0, "text": "Can't say enough about how happy I am with these folks. HP Laptop from 2012 finally gave up, but the didn't give up on the Laptop. New (Improved) hard drive AND he was able to recover all my files. Had it back to me in under a week. Anyone that depends on a computer for work understands how important it is to have your equipment back and running better than ever.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102641957455970018866", "name": "Davaul Blackmon", "time": 1587585937368, "rating": 5.0, "text": "Service was very good and the process was super easy for a reasonable price. Most pc places asked me for $500-600 to replace my hard drive and he did it for much less. He was also very easy going And hospitable. Would definitely recommend to anyone needing PC repairs.", "pics": null, "resp": {"time": 1589548224813, "text": "Its always a pleasure glad we could fix all needs\nRemember. We. R just a phone call away\nThanks!!!"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101704561877030077937", "name": "Tamika Stewart", "time": 1628017781440, "rating": 5.0, "text": "Wonderful service.", "pics": null, "resp": {"time": 1628092184002, "text": "Tamika,\nthanks for the review\nglad we could assist u\nthanks for your business😊"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109865345661131736873", "name": "Jimmy Davis", "time": 1598479837546, "rating": 5.0, "text": "PC Tech has had all my business for the last 7 years and I would not even think about using anyone else. Honest, Hard working and the sharpest Computer People  I have ever used.", "pics": null, "resp": {"time": 1598483666665, "text": "Thank u for the review.  Glad we can continue to fix all ur issues"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117604281925956167508", "name": "Hope Odom", "time": 1581528186130, "rating": 5.0, "text": "update 2/12/20\nfantastic once again\nI would highly recommend this company for any of your computer needs. They really helped me out. They went above and beyond what any other company would have done. It is a family and locally owned business which makes a huge difference. I myself,   being a business owner for 22 years,  can honestly say I have never had the type of customer service that I receive there.  It s nice to know there are still people left in this world who truly care. . Their prices are very reasonable too!!! Way to go PC Tech!!!! Thank you so much!!!", "pics": null, "resp": {"time": 1560784714491, "text": "thank u hope for the review!!!\nglad computer is up and running smooth again\nif u need us   we are just a call Or text away\nTHANKS"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117943448669215230929", "name": "Rick Wilkins", "time": 1560966951959, "rating": 5.0, "text": "PC Tech is a great company. They are super fast and have excellent customer service. I have utilized their service several times with different computers and nothing has stumped them. They fixed the laptop incredible fast and since it didn't require parts they didn't even charge me.\nPC Tech is a small business, but that doesn't stop them from offering solid and quick service.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108352181523712674712", "name": "Russell Reiter", "time": 1611088779440, "rating": 5.0, "text": "Excellent service, fast turnaround and professional quality work!", "pics": null, "resp": {"time": 1611931243583, "text": "appreciate ur business"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107296839654906610577", "name": "Jim Norris", "time": 1592926516802, "rating": 5.0, "text": "Professional service. Enjoyed working with this business. I would recommend this company to others.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114294376889274371683", "name": "Mike Goss", "time": 1580149029153, "rating": 5.0, "text": "Very happy with the service received.  Have used PC Tech on several occasions and have always been completely satisfied with the customer service and prices.  Goes out of his way to provide first class service.", "pics": null, "resp": {"time": 1580152865129, "text": "Mike.   Its always a pleasure    glad we could fix all ur pc needs\nRemember. We.  R just a phone call away\nThanks!!!"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106309626725889935760", "name": "Carol Rheingans", "time": 1591126775152, "rating": 5.0, "text": "Shawn has been promptly available when I need help with managing my technology issues at my business. He is my \"go-to\" person when my computer malfunctions or I don't understand how to properly use the programs  that are necessary for my business.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111231569420566176550", "name": "Leslie Wood", "time": 1569085983053, "rating": 5.0, "text": "Highly recommend. I got a custom built computer for my specific needs in editing. Holy cow, it was fast! I was able to edit in LR in a quarter of the time that it used to take me. They’re nice, relatable, friendly, great communication, great quality!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116853046139151364267", "name": "MaryBeth Winter", "time": 1567018193043, "rating": 5.0, "text": "I had horrible luck and dropped my iMac, cracking the screen as I was unpacking from our move. PC Tech Computer Repair was the second place I called after a store in Enterprise, AL told me they were the closest place that repaired Apple Computers. The employees at PC Tech Repair displayed genuine customer service. They were kind, honest, fair, and repaired my computer in a timely manner. The screen they ordered to fix my computer was cracked worse than my original, they promptly called me and communicated that it would take longer to repair because they had to order an additional and have it shipped. I appreciated this communication so much!  Upon pick up, I came in with my 1 year old and the guy even helped to carry my repaired computer to my car! I will be using PC Tech Repair for any of my future tech needs and will definitely be recommending them to friends! Their customer service was phenomenal (which is what truly matters!)", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102950307073080893832", "name": "Onyx Cutts", "time": 1603988175894, "rating": 5.0, "text": "Quick and friendly service. Came in for PS4 repair.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101316098258069990923", "name": "Norma Hoshor", "time": 1580444407500, "rating": 5.0, "text": "Great service, kept me informed every step of the way working on my laptop. Fair pricing.  Thank you.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "105645890549618297531", "name": "Carolyn Smith", "time": 1581818393374, "rating": 5.0, "text": "So glad to find someone that could help me with my Apple MacBook Pro. Knowledgeable people that are friendly and wants to please their customers. Keep the discounts coming!!! Hope to know I can go in any time if I have any problems or just some computer knowledge.", "pics": null, "resp": {"time": 1581954783685, "text": "thank u carolyn  glad we could help you with your  pc & macbook pro\nit was a pleasure serving you😁😁😎"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109441457551595740698", "name": "Brittany DeJardin", "time": 1543528787134, "rating": 5.0, "text": "Very thankful I came across this place. I am beyond satisfied with how friendly/knowledgeable they are. Great service, time, and price! Will definitely come back if I ever have another computer issue and would highly recommend them to anyone needing help with their gadgets!", "pics": null, "resp": {"time": 1550081465453, "text": "thanks brittany\nlook foward to helping u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100134680318352841906", "name": "Ashley Spivey", "time": 1588294810219, "rating": 5.0, "text": "My sons ps4 was not working correctly and they fixed it quickly and everyone was very friendly ! I definitely recommend them and will use them again if I need them on any other repairs.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100852535101913113810", "name": "Jo Truran", "time": 1612805018576, "rating": 5.0, "text": "Very helpful-a life saver", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116656687966738959951", "name": "Tonia Anderson", "time": 1530832376020, "rating": 5.0, "text": "I was having issues with my laptop. I decided to call these awesome folks. Didn't regret it at all. Awesome customer service very friendly. Explained to me in detail as to what had to be done to fix my computer. Gave me a reasonable date as to when they would have my computer ready and actually called two days earlier to tell me it was ready. Very courteous and sufficient with their work and reasonable pricing. Highly recommend to anyone!", "pics": null, "resp": {"time": 1531154488086, "text": "thanks tonia\nglad we could help you"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110158815165439209521", "name": "Raze Rocket", "time": 1595955323861, "rating": 5.0, "text": "brought my laptop in and within a few days he called and said he was about to look at it, then the next day said he had it fixed. all done for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100049476327160407017", "name": "Priscilla Driver", "time": 1602002617716, "rating": 5.0, "text": "Shawn did a great job as always!  Thank you Shawn!", "pics": null, "resp": {"time": 1602601764059, "text": "thanks for your 20 years of continued business  😎"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110969330729133675773", "name": "Tyla Holloway", "time": 1596824897115, "rating": 5.0, "text": "Fair and honest prices!  Fixed my computer quickly!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102523747005941588737", "name": "Allen Gray", "time": 1559438455046, "rating": 5.0, "text": "This man and his wife ate just awesome took my computer in and a few days I had it back running fantastic. Will actually answer questions you have unlike others. I'll be doing more business with him no doubt. Thanks a ton guys", "pics": null, "resp": {"time": 1559655865184, "text": "allen\nit was a pleasure helping u sir"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103819987246626859928", "name": "Julie Engle", "time": 1549387388947, "rating": 5.0, "text": "Great experience. Took my 8 year old computer in because it died. Was given many options in multiple price points to get a working computer. I was given honest, straightforward answers to all of my questions. Would highly recommend for customer service,  price,  and  computer help.", "pics": null, "resp": {"time": 1550081369510, "text": "thanks julie   glad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117096005009690409267", "name": "jonathan trammell", "time": 1557846006862, "rating": 5.0, "text": "pc tech showed up on time and took care of our printer problems. Very easy to work with and made sure everything was fine and working before he left. reasonable prices and great service . Would recommend to anyone business or personal", "pics": null, "resp": {"time": 1558039816496, "text": "Mr. Trammell it was a pleasure sir\nGlad u back up and printing"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104007179371454186314", "name": "Larry Flippo", "time": 1624550272456, "rating": 5.0, "text": "fast repair", "pics": null, "resp": {"time": 1624625624962, "text": "hey Larry  we appreciate ur business\nglad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113264292371497762566", "name": "Ian Evans", "time": 1589309254586, "rating": 5.0, "text": "Absolute stand out establishment. Helped me with my m.2 issues in lightning speed", "pics": null, "resp": {"time": 1589548111916, "text": "Its always a pleasure glad we could fix all ur pc needs\nRemember. We. R just a phone call away\nThanks!!!"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "118205738423251083280", "name": "Debbie Fowler", "time": 1601652653286, "rating": 5.0, "text": "Very honest, professional and very helpful!  Thank you PC Tech Computers!!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100181168869628678732", "name": "Ruth Avant", "time": 1543348375490, "rating": 5.0, "text": "Very friendly and knowledgeable people to do business with. We were well satisfied with the service, price and the timely manner it took for\nour computer work.\nWe will surely go back for any computer work  we might need and also\nrecommend them to anyone needing computer services.", "pics": null, "resp": {"time": 1550081490087, "text": "thank u ruth"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101429652919560735518", "name": "Rosaland Harrison", "time": 1590602612893, "rating": 5.0, "text": "Very pleased with the repair and guidance provided.  Mr. PC Tech is down to earth and affordable.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111135364223606520293", "name": "Ronnie", "time": 1571682122675, "rating": 5.0, "text": "Very nice, easy going and answered all of my questions, and got things done in a timely manner. Very happy with the service! Thanks again! :)", "pics": null, "resp": {"time": 1571683087723, "text": "thank u so much!!!\nremember we are just a click or call away if u need us\nthanks for the review 😊😊🎈🎈😁"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111717439577281736393", "name": "Gina Baxley", "time": 1590163582794, "rating": 5.0, "text": "Highly recommend!! Friendly fast service and very knowledgeable!! Thank you for saving my life!!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108235508684542365532", "name": "donna shifra", "time": 1574120588997, "rating": 5.0, "text": "I highly recommend PC tech. Trust-worthy, Friendly, Fast, Efficient and Reasonable.  They go above and beyond to help get you up and running again quickly.  Do not hesitate to use their services.", "pics": null, "resp": {"time": 1558039637376, "text": "Thank u donna.  It was a pleasure doing buisness with u\nWe look foward to assisting u in the future.\nRemember we are just a phone call away😁😁😀"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115169849906364049563", "name": "Ronnie Surber", "time": 1580485183393, "rating": 5.0, "text": "Very fast and does not overcharge.  Provided a detailed problem statement with my external hardrives.  Gets back to you when you leave after hour messages.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115164470505346916965", "name": "Peppermint Gecko", "time": 1592851490671, "rating": 5.0, "text": "I messed up my motherboard pretty badly and he fixed it for a great price, five stars", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106516779275160368967", "name": "Houston Davis", "time": 1550025770776, "rating": 5.0, "text": "I took our two laptops to PC Tech after seeing their advertisement. I could not be more pleased with their service. They were very knowledgeable, professional and friendly. They first consulted with me and then removed all the things on the laptops that should not be on there. Both work like new now. I highly recommend them.", "pics": null, "resp": {"time": 1550081426665, "text": "thank u houston\nlook foward to helping u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104146035925368745325", "name": "Clyde Isom", "time": 1613749775400, "rating": 5.0, "text": "outstanding place  and techs.", "pics": null, "resp": {"time": 1624625670485, "text": "thanks clyde\nglad we fixed u up again"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102339471947787305028", "name": "John David Boone", "time": 1603733478118, "rating": 5.0, "text": "As good as they come.  They did the work on my office computers, and did it fast.  Easy to work with, reasonable prices.  I have them on speed dial.  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103016759909635848384", "name": "Sandra Wilkening", "time": 1617903773019, "rating": 5.0, "text": "quality techs excellent", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "105447116446465475962", "name": "Rex Bonner", "time": 1583863046278, "rating": 5.0, "text": "Best in the business.    Fixed me right up\nPc runs better than new", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "118277879343667448954", "name": "Donnie Smith", "time": 1540305861115, "rating": 5.0, "text": "I have had computer repair done here for many years, they are friendly have great service and timely service. Recently purchased a desktop from them works great. Recommend them to everyone who needs computer service.", "pics": null, "resp": {"time": 1540311428779, "text": "thanks. Mr Donnie  glad we could resolve all your needs😊😊"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116844546740321253081", "name": "Greg Hill", "time": 1551381780383, "rating": 5.0, "text": "I found P.C. Tech to  be fast in repairing my ASUS laptop. Called me before any work was started. Very honest.  Gave me a fair price. very satisfied. Will use them again. If need be.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112200088773950944417", "name": "Ryan", "time": 1565279945167, "rating": 5.0, "text": "Took my PC in to have the MOBO replaced. They got it done very quickly and for a very reasonable price. Great customer service and pleasant people. Would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109588918903284787659", "name": "Isaac Davis", "time": 1523888730907, "rating": 5.0, "text": "The staff here are very friendly and knowledgeable. They offered the best pricing around and fixed my laptop incredibly fast. I will most certainly return for any future work I need done.", "pics": null, "resp": {"time": 1523890858343, "text": "Thanks isaac. Glad we could assist u in ur needs🤠"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103628842678447847290", "name": "June Lewis", "time": 1594655408801, "rating": 5.0, "text": "Knew WHEN he was arriving.  Was friendly, answered any questions I had, and never made me feel he was in a hurry to get to the \"next job.\"", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102781158660925699440", "name": "Lisa Baldwin", "time": 1556588291616, "rating": 5.0, "text": "I took my laptop for repair. They were very friendly, professional and efficient. I highly recommend them! Excellent customer service.", "pics": null, "resp": {"time": 1556628609194, "text": "thanks u lisa  appreciate ur business😊"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104350119657591416633", "name": "Alexis Shaw", "time": 1580234370740, "rating": 5.0, "text": "very satisfied with PC Tech,  this is the 3rd pc fixed and we are very Satisfied with the service we received....Shawn thank you........\nDothan Southside Auto Sales\n..", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115073952739744210508", "name": "Catherine Veneziano", "time": 1507150733722, "rating": 5.0, "text": "They were friendly and sweet which made me feel great.  There service was great. I would recommend them to anyone who has computer problems, to see them first. They helped me in so many ways. Thank you so much.", "pics": null, "resp": {"time": 1507567654914, "text": "glad we could kelp you catherine\nthanks for your buisness."}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115427123518755696229", "name": "Leo Breckenridge", "time": 1542307955178, "rating": 5.0, "text": "Great customer service - very personable!  Did a great job, on time and at a fair price.  Recommend Highly", "pics": null, "resp": {"time": 1542640202695, "text": "thank u sir\nhappy to assist u :-)"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111964215071064182833", "name": "Ronnie Pierson", "time": 1482438342905, "rating": 5.0, "text": "This was my first time using PC Tech Computer Services and I must say I was very pleased with the service and friendliness. I got the laptop back ahead of the promised time and at a fair price. I will have no problem recommending this company and definitely will be using them again.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110506538668257946884", "name": "Keya Ginn", "time": 1487337441114, "rating": 5.0, "text": "Went in to see about my phone and within the second I walked in he and his wife were very welcoming and showed so much hospitality. It took no longer than two hours for my phone to get fixed. Speedy service and great customer service. Love them!", "pics": null, "resp": {"time": 1487338626132, "text": "keya,\nThanks for ur business glad we could help u with ur iphone"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113008726891610121541", "name": "Jerry Mcallister", "time": 1585839884087, "rating": 5.0, "text": "best there is folks\ncontinues to deliver top service\nwhenever i need them", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101417785808466358948", "name": "Barbara jackson", "time": 1492184498160, "rating": 5.0, "text": "Cleaned my computer, installed virus protection.  They picked up computer from my house which for me worth paying extra.   Returned it less than 48 hours, repaired.  So far, so good.  They are friendly, and best of all, are here in Dothan!  Just  a phone call away!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114743910793352592225", "name": "Tina Rodgers", "time": 1540514178370, "rating": 5.0, "text": "First time using this place.  I am satisfied with the work and especially satisfied with how fast I got an estimate and then the call my computer was ready!  I will recommend using this business to anyone that asks.", "pics": null, "resp": {"time": 1540565067053, "text": "tina thank u it was a pleaasure\nglad we could get ur laptop up and running QUICK"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110965365965801869397", "name": "Frederic Lecut", "time": 1534560059632, "rating": 5.0, "text": "Professional, fast, friendly. The y quickly figured out what was wrong with y computer (24 hours) called me to tell me and asked if I wanted to spend the money, within 48 hours my computer was ready to go.\nI highly recommend them for all computer maintenance or repair .", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109776117407373965442", "name": "Joseph Aldrich", "time": 1531176816916, "rating": 5.0, "text": "Excellent work and friendly service!  They repaired my laptop for a good price within a reasonable time frame.  I would recommend them to a friend and will repeat my business with them in the future.", "pics": null, "resp": {"time": 1532440327767, "text": "thank u   joseph"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "118067100859366093244", "name": "Gip Kingry", "time": 1537803283831, "rating": 5.0, "text": "Good people to work with. Great service! My computer runs so much faster. I will use them next time>", "pics": null, "resp": {"time": 1540311468145, "text": "thanks for the review\nmr gip"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110760314217010801191", "name": "Christopher Loftis", "time": 1523384945992, "rating": 5.0, "text": "I am a warranty holder serviced by PC Tech Computers. My video card went bad and the owner was able to repair my machine within a week. He also replaced a case fan that was going bad of which I was completely unaware. He saved me time and enabled me to resume my schedule of heavy computer use.  The availability of a nearby and excellent service provider for my machine has been a great thing that has saved me hundreds of dollars in parts and labor. I cannot help but heavily recommend PC Tech Computers.", "pics": null, "resp": {"time": 1523395831854, "text": "Thank u.  Glad we could assist u\n😁"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108662425267522013536", "name": "gordon clement", "time": 1578491532434, "rating": 5.0, "text": "top of the food chain\nbest my family has ever used\nthanks  pctech", "pics": null, "resp": {"time": 1581954852553, "text": "ms clement   always great to assist u sir"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115592061722005413904", "name": "Ti M", "time": 1586801028555, "rating": 5.0, "text": "My laptop repair was quicker than expected at a good price.", "pics": null, "resp": {"time": 1589548170064, "text": "glad we could fix you up"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110576678853208395637", "name": "Ed Simmons", "time": 1530231069943, "rating": 5.0, "text": "I have been there multiple times due to PC and harddrive problems. Every time that I have gone to see them, it was an excellent experience. Their knowledge of computers are the best in town, along with their personality and professionalism is top notch. I highly recommend them for your PC repairs", "pics": null, "resp": {"time": 1530232278719, "text": "Thanks u sir\nGlad we can assist u on each trip"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107368872213661596169", "name": "Jo Hopkins", "time": 1476904658652, "rating": 5.0, "text": "I bought a new computer from PC Tech about a year ago and it has worked great.  I recently took it in for routine service (annual).  It was ready at the promised time at a fair price. Five stars.", "pics": null, "resp": {"time": 1477424416532, "text": "Thanks.  Look foward to seeing u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113756609845266807063", "name": "Jamey Vibbert", "time": 1507563809818, "rating": 5.0, "text": "I've had PC Tech work on my computers for over 15 years. I have found the owner Shawn to be one of the most knowledgeable people in the Wiregrass.  My computers never sit for weeks with me having to call and check the status. He always gives me a follow-up in a few days, but in most cases within 24 hours. Can't find a better price in this area. I would highly recommend his company for both personal and professional needs.", "pics": null, "resp": {"time": 1507567570994, "text": "thanks for the review sir.\nglad we can assist u any time of day or night\njust call and we will be there.\nlook forward to serving u in the future :-)"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "105487863168081603585", "name": "Andy Morrow (Purpose Life Skills)", "time": 1525922006132, "rating": 5.0, "text": "Honest. Fixed my office's issues. No pressure for anything \"additional\". And, btw, it only took a day. I can't promise that is what the time-frame always is. I would recommend them to any small business.", "pics": null, "resp": {"time": 1526308214628, "text": "glad we could help u sir"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107250883156247481485", "name": "Owen Moreland", "time": 1567093514631, "rating": 5.0, "text": "our service with this company has been A1\n110%. We recommend them to friends.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102379806337819628581", "name": "sandy jones", "time": 1544636899851, "rating": 5.0, "text": "I have been a customer for the last fifteen years. They are great people and sincerely care about doing the best job possible. Doing business with someone you trust; is a real plus! I would highly recommend them for both your personal and business computer needs.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117639338825390969062", "name": "Duke Drage", "time": 1535472156206, "rating": 5.0, "text": "Nice customer service! Affordable prices. I will be back if I have any issues.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109598471052687161414", "name": "bobby price", "time": 1559156503777, "rating": 5.0, "text": "Been doing business with them at PCTech for years.  He does all my computer work snd  does excellent work.  I have purchased 3 computers over 12 years!!!  They do ;the work right the first time.", "pics": null, "resp": {"time": 1559655885158, "text": "bobby\nglad u r running"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110051084463964169598", "name": "Sam Casey", "time": 1591878665541, "rating": 5.0, "text": "Outstanding Place\nalways fixed right\nthanks Mr Pctech", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115816314916111752320", "name": "Danielle Yeomans", "time": 1573586571617, "rating": 5.0, "text": "Would definitely recommend! Fast service, knowledgeable, and all around nice guy!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106432032876098348278", "name": "Haley Middlebrooks", "time": 1532411543313, "rating": 5.0, "text": "Really good people there got my computer back in less than a week and got it a day earlier then I was told I would get it. Would definitely recommend and will from now on be going there for all my tech needs", "pics": null, "resp": {"time": 1532440261365, "text": "glad we could help u with ur macbook needs"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "105390802169681310696", "name": "Gertis Matlock", "time": 1553014325385, "rating": 5.0, "text": "friendly people, willing to help. reasonably priced, will call them for all my computer needs.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117486289682511654000", "name": "Casey Cannon", "time": 1507036181030, "rating": 1.0, "text": "I decided to go to PC Tech due to the positive feedback I saw on google reviews. I had an issue with my computer charge port so I dropped it off to get it diagnosed for repair. I was later told it was the DC jack needing replaced and the repair would cost 150.00. I was blown away at the price so I decided to think on it. Shawn told me the part alone cost 50 dollars. I told him I would rather look around for another computer and I would like to pick up my computer. He told me come on by and pick it up the following day. A few days later I decided to pull it apart and see how detailed the work was. As I took it apart I noticed there was no hard drive in it. I called Shawn as he proceeded to say that that happens sometimes and his kid must have forgot to put it back in when they were looking for the issue. Additionally I found the part on eBay new for less than 20 dolllars. Not to mention the fact that the diagnoses when they originally took it apart would have been an extra screw to replace the DC jack which he tried charging me another 100 bucks. All together a very bad experience and I would rather avoid this place at all cost.", "pics": null, "resp": {"time": 1507037043493, "text": "sir we dont use ebay parts\nsorry for the drive being left out\neverybody makes mistakes\nand the diagnoses you was informed about up front\nu did not have to leave it'\nsorry for ur inconvenience"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108378158380956754068", "name": "BRUCE JONES", "time": 1464806117209, "rating": 5.0, "text": "I had PC Tech build me a custom built computer. they were great with finding out my needs, staying within my budget. The pc has been running for 3 years. Only one problem a virus,which they fixed. I picked my computer up the next day.I am very happy with them. Their work is world class, and they are customer oriented.", "pics": null, "resp": {"time": 1464806082764, "text": "glad we could help u Sir\n\nstay virus free with PCTech   :))"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113594734378050566429", "name": "Beckie Parker Ruediger", "time": 1496949542690, "rating": 5.0, "text": "Excellent repair on my laptop and they finished ahead of time. Very, very nice people. I will definitely use them again.", "pics": null, "resp": {"time": 1499883194421, "text": "Thank you\nGlad we. Could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "118034126766526717651", "name": "Rodney Swanson", "time": 1551302521593, "rating": 5.0, "text": "Fantastic service. Did exactly what I wanted and gave me options. Good Job!!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113761895577526177775", "name": "Reed DeVane", "time": 1578505861533, "rating": 5.0, "text": "been using PC Tech  for about 10 years. Has fast and great service.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "118262955428097866941", "name": "Michael Barron", "time": 1518060254325, "rating": 5.0, "text": "Really appreciate the hard work. Called me as soon as was finished, gave me a fair price. Earned my business any time I need computer work.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100006687918276002700", "name": "Bobby Price", "time": 1467136059657, "rating": 5.0, "text": "Been using PC Tech for many years and have been happy with their service.  I've always been able  to count on them to fix it right the FIRST TIME.  You don't always get that kind of service just from anywhere.  When I need computer work to be done, I can always count on PC Tech!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109570712341822117727", "name": "Tabor Pest Control", "time": 1466696599136, "rating": 5.0, "text": "Tabor Pest Control has used Shawn (Pc Tech) for several years. He has built several computers for us and taken care of numerous computer issues for our company.  Shawn and his staff are very efficient and knowledgeable. We would highly recommend PC Tech", "pics": null, "resp": {"time": 1477424510008, "text": "Its been a pleasure to help with all ur pc needs\nThanks"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106645757058838666152", "name": "Brenan Vonier", "time": 1543370479259, "rating": 5.0, "text": "Local to the area. Super fast turn around and great customer service. No work was done to my pc without me authorizing it first. Have recommended to coworkers and friends. Will be the only pc tech I use going forward.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103841406590918962201", "name": "Robyn Metcalfe", "time": 1532186826168, "rating": 5.0, "text": "I have had several computers fixed and have always received the best price and turn around time.  They went above and beyond to help me with an issue I had with my Apple phone, better customer service too!", "pics": null, "resp": {"time": 1532440304782, "text": "thanks Robyn    glad to always be a help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109841401144954254906", "name": "Matthew Butler", "time": 1523901895171, "rating": 5.0, "text": "Had to use this place twice and both times they provided premium service. Great place and great people. I would recommend pc tech to everyone.", "pics": null, "resp": {"time": 1523909734195, "text": "Thanks. Glad we could help SLIM😁"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109823345966286506146", "name": "Kelly Klein", "time": 1482341052924, "rating": 5.0, "text": "My work computer crashed and they did an excellence job clearing the virus and restoring the data. Very professional. Turn around was great. I will use them again.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107773222920204824597", "name": "Richard Cooper", "time": 1568921676556, "rating": 5.0, "text": "Great Customer service and great prices. Will be my go to from now on.", "pics": null, "resp": {"time": 1568925047825, "text": "Thank for the review\nit was a pleaseure working with you 😁😁😁👍"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113155802352793195052", "name": "Rose Stephens", "time": 1557257222398, "rating": 5.0, "text": "A very great and professional service. Be proud of him and his lovely wife.", "pics": null, "resp": {"time": 1558039861221, "text": "Thank u rosa call or click if u need us"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101172074481596439933", "name": "Robby Register", "time": 1542102304877, "rating": 5.0, "text": "Had them replace my power supply on my gaming rig. Quick, fast service. Would highly recommend", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102401541135347948910", "name": "Philip Earwood", "time": 1515012148122, "rating": 5.0, "text": "Customer service here is fantastic. I was called back after my initial call didn’t connect due to other customers on the line. Additionally, I was contacted daily through my service in order to be informed of the progress and receive advice by the knowledgeable staff.  I know where I’ll take my devices when I need service or repairs on my equipment. These guys were great.\n\nAdditionally, i had my iMac (all in one cpu) repaired here. Others told me they were not allowed to take them apart.  They fix smart phone screens at awesome prices too.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109007641231656153776", "name": "Daniel Whillock", "time": 1600199700039, "rating": 5.0, "text": "best in the business\nthanks pctech", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115829410746858911795", "name": "Krista Dailey", "time": 1492868508713, "rating": 5.0, "text": "BEST SERVICE EVER. I took my laptop in, IT HAD to be fixed the same day as I work out of town and this was my last day here.Not only did he fix my computer within a few hours, HE STAYED LATE FOR ME BC I WASN'T able to return and pick it up before he closed for the day. My stress level went way down bc he repaired my laptop so quickly and did not charge me a fortune to do so. I would highly recommend PC Tech and will definitely got there for all my pc needs in the future.", "pics": null, "resp": {"time": 1492872788344, "text": "Thanks krista glad we. Could help\n\nHope to see u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117040166942759291174", "name": "Tracy Tabor", "time": 1530916867127, "rating": 5.0, "text": "Mr. McAdams is the best. Give him a try and see for yourself. He is fast, friendly and does an awesome job.", "pics": null, "resp": {"time": 1532440352811, "text": "glad we help u  ms T"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115211389099496695577", "name": "Bob Hendrix", "time": 1524580330544, "rating": 5.0, "text": "PCTech is awesome in every facet of  the .business. They are very knowledgeable  & can answer all your questions.I highly recommend their services.", "pics": null, "resp": {"time": 1524585604207, "text": "thank u bob"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104754296735846037158", "name": "Julian Steed", "time": 1530214871597, "rating": 5.0, "text": "Took my pc to find out which part was faulty so I could repair it at home. Diagnosis took less than 24 hours and got my new power supply coming in already. Great people behind this business with great personalities and attitudes, unlike some other pc repair places here.", "pics": null, "resp": {"time": 1533819832713, "text": "glad we got u back running"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109356628155264407053", "name": "Dan Parker", "time": 1483728639367, "rating": 5.0, "text": "Amazing service by fair, honest people.  My technically-challenged dad needed his computer checked.  They fixed the problem quickly at a very reasonable price.  THANK YOU!!!!", "pics": null, "resp": {"time": 1485790116047, "text": "(Translated by Google) Thanks and\n\n(Original)\nThanks dan"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101140290611757901167", "name": "Charles Johnson", "time": 1563897843762, "rating": 5.0, "text": "PC Tech has been more than helpful setting up my new PC and transferal  has been excellant", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111299353976559658319", "name": "doug hancock", "time": 1599156084456, "rating": 5.0, "text": "great service  enjoyable visit", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113690136746180502351", "name": "Ron Sealock", "time": 1550085657445, "rating": 5.0, "text": "very good.  seems know his way around a computer, I'm  considering  a long term relationship with his company.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110729940816366984876", "name": "hcwa authority", "time": 1557323850251, "rating": 5.0, "text": "Fantastic service. Always available when we need help with something.", "pics": null, "resp": {"time": 1559655960351, "text": "thank 4 ur business"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116875061476207365511", "name": "michael bush", "time": 1575995001107, "rating": 5.0, "text": "Amazing Technicians !!!\nBest I've  Ever Used\nExcellent Customer Service    A+++++++", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "105390077920087552919", "name": "Jeff Mizzell", "time": 1521748648145, "rating": 5.0, "text": "This is the best shop in town, by far.  I am always pleased at the service and price.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113062206445789381814", "name": "Steve Good", "time": 1554129486812, "rating": 5.0, "text": "Very satisfied with the service and friendly folks. Fair price", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104282889221250512705", "name": "dan wood", "time": 1458602933771, "rating": 5.0, "text": "Bought a computer while on vacation and was heartbroken after it broke 3 days later.. When i got my computer back from the shop it worked perfect for me and the price was very fair for the work and parts my computer needed. The owner was very knowledgeable and friendly. I will definitely bring my computer back if i have any further issues.\nD. Wood", "pics": null, "resp": {"time": 1458650785426, "text": "Glad we could help u sir\nlook forward in seeing u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109369566129120405235", "name": "David Cosma", "time": 1556653664418, "rating": 5.0, "text": "Excellent service and speed.  Highly recommended!", "pics": null, "resp": {"time": 1556736596792, "text": "thank u sir glad we could help with ur pc  needs"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108292793070482557177", "name": "Mike Hamilton", "time": 1469027151749, "rating": 5.0, "text": "PC Tech was very helpful, courteous, and repairs were made quickly. I have used numerous PC repair companies in Dothan and PC Tech stands out among the best. Highly recommend PC Tech for computer needs.", "pics": null, "resp": {"time": 1469032218889, "text": "thank  u\nlooking forward to helping u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109034652830224601543", "name": "ralph solomon", "time": 1543594967273, "rating": 5.0, "text": "best in the business  will always use PcTech\ngets it done right .  folks this place is like the Ace of spades", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103575216517355798575", "name": "James Treadwell", "time": 1553712483951, "rating": 5.0, "text": "PC Tech Computer Services ARE THE BEST TECH BUSINESS IN  DOTHAN. There customer service is amazing, like the whole family was soooooo nice. My Ps4 was having a problem were it would run hot and turn off every time i played call of duty.  I started freaking out  because nobody else in dothan would fix it because they did not work on that specific problem or not at all. So no GEEK SQUAD, GAMESTOP,  IFIXIT none of them but PC Tech Computer Services did. They told me to bring it in to look at it and they easily diagnosed the problem and fixed it immediately. I would definitely recommend them, they were awesome.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107088412124284652531", "name": "Mike Medlen", "time": 1483636521641, "rating": 5.0, "text": "Excellent support both in office and home. All problems resolved  in a timely manner. Will use in the future if needed with out reservations.\nMike", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103823840566490240208", "name": "Armand Miller", "time": 1485998575903, "rating": 5.0, "text": "Great people and even greater and faster service! Would recommend any and everybody get their computers/laptops  serviced at PC Tech. Oh and for those not so computer-literate they are about to start offering classes so call and secure your spot ASAP.", "pics": null, "resp": {"time": 1486042194974, "text": "thanks for ur business\nglad we could help u"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106005453884335052729", "name": "Gloria Peters", "time": 1558453644748, "rating": 5.0, "text": "First time user, will be telling my friends about Shawn. answered all qustions, very nice  great personality.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106389106095950133438", "name": "RT THOMAS", "time": 1606159422976, "rating": 5.0, "text": "Very knowledgeable and helpful", "pics": null, "resp": {"time": 1606232222698, "text": "mr   thomas\nalways a pleasure sir\nappreciate ur continue business"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109699577153398188076", "name": "Margie Wade", "time": 1521226531247, "rating": 5.0, "text": "very nice hard working people such  conscientious folks. try them you will enjoy them and their service.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100532839169467065875", "name": "Edward Knobeloch", "time": 1544035710020, "rating": 5.0, "text": "Very prompt and friendly service, resolved my issues within 24 hours. Good people!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112404964859999480587", "name": "gordon clement", "time": 1536165545154, "rating": 5.0, "text": "best place  by far\nu cant find a better pc repair shop than pc tech\nthey are quick,friendly,and very professional   they go over and beyond for customers to  fix it Right\nwill be my shop of choice :-)", "pics": null, "resp": {"time": 1540311505879, "text": "mr gordon\nthank u glad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112172579891355119694", "name": "Sabrina Dyck", "time": 1506445095145, "rating": 5.0, "text": "Great service! Helped me recover all of my files from my corrupted USB drive. I will definitely use them again.", "pics": null, "resp": {"time": 1506536183974, "text": "thank u so much\nglad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111806355883864838776", "name": "judy grant", "time": 1549385597361, "rating": 5.0, "text": "cleaned all the malware from my machine and tuned it up\nexcellent people", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107355032877688937839", "name": "harry b", "time": 1584550829841, "rating": 5.0, "text": "update 3/16/2020 Been using still the best for over 16 years now\nWould not even think about using anyone else\nBest place within 300 miles of dothan  i am a truck driver\nbeen using pc tech for over 15 years  most honest and friendly people you will ever meet  always fixes it Right The First Time :-))  give em a try u will see.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111100182087602061083", "name": "danny ward", "time": 1542729329363, "rating": 5.0, "text": "great place   fixed my desktop quick, fast, reliable, honest\nfriendly  will be our family's shop of choice", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107063305520419177010", "name": "Beverly Wright", "time": 1558969797811, "rating": 5.0, "text": "Great service! Fast and reliable.", "pics": null, "resp": {"time": 1558972645903, "text": "thank u beverly\nit was a pleasure!!!!!!!😁😁"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115723415049776191686", "name": "MandAs LLC (dba:WicksburgMiniStorage)", "time": 1526582596275, "rating": 5.0, "text": "Shawn and Sharyn are great! We are repeat offenders! Seem to be prone to breaking Laptops again and again! Thankfully Shawn knows exactly what is needed. Sharyn keeps me calm (LOL) and always assures me that it will work out. The price that I pay is always better than losing everything or buying a new one. Thanks PC Tech you guys are the best!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112298313356404063137", "name": "bumgahdna", "time": 1531758420213, "rating": 5.0, "text": "Very reasonable pricing. Fix a p4 bios issue now my multicade is back up and running! Thanks!", "pics": null, "resp": {"time": 1531851218373, "text": "glad we got you back running"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116281888555238899352", "name": "Daryl Wesley", "time": 1577123757635, "rating": 5.0, "text": "great customer  service  all these years", "pics": null, "resp": {"time": 1581954895355, "text": "Daryl\nthanks for your business\nremember   we are just a click or call away"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102935485951569624506", "name": "RONNY MOBLEY", "time": 1559597853647, "rating": 5.0, "text": "Attentive to needs and time.  Used Shawn for years.", "pics": null, "resp": {"time": 1559655838346, "text": "thanks  ronny glad u are up and running"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110952161793558966900", "name": "Mc stabs", "time": 1524145618026, "rating": 5.0, "text": "Amazing! dude hooked me up right and gave me the part i need for my m.2 drive! Would take my stuff back!", "pics": null, "resp": {"time": 1524585517536, "text": "glad we could help u sir"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108769521997440966220", "name": "Jean Cobb", "time": 1472047419724, "rating": 5.0, "text": "Ive always used PC Tech for computer repairs. Great Service!!  Friendly service!! I wouldnt trust anyone else for computer service.", "pics": null, "resp": {"time": 1472055884154, "text": "glad we could assist you"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108630655334886009077", "name": "John Gormley", "time": 1467853136886, "rating": 5.0, "text": "PC Tech is my \"go to\" place wheneverI have any computer problem or question. They have built several desktop systems for me, one of which is still in use after 20 plus years.\nI have purchased several laptops from them and always know I am getting the best deal and immediate service should I ever need it.\nPC Tech is 'da bomb'!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114912700077220019583", "name": "larry mckenzie", "time": 1540575330342, "rating": 5.0, "text": "Great service always have had good work at a very reasonable price", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111932474629848240718", "name": "Bill Stiver", "time": 1477326215418, "rating": 5.0, "text": "I am very satisfied with PC Tech; they are fast and reliable. I highly recommend them!", "pics": null, "resp": {"time": 1477424388216, "text": "Glad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109437324723221253610", "name": "Cassie Hovey", "time": 1532382549517, "rating": 5.0, "text": "Super friendly! Quick and inexpensive! Definitely recommend!", "pics": null, "resp": {"time": 1533819880435, "text": "thanks  cassie"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115379584878938578725", "name": "Taylor Coleman", "time": 1467755466559, "rating": 5.0, "text": "Great service and friendly staff. All around great place to have your computer worked on!!!!", "pics": null, "resp": {"time": 1467759801186, "text": "Thank u sir"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100357953096477187938", "name": "Hillary Jackson", "time": 1469201090035, "rating": 5.0, "text": "The PC Tech Computer Service guys are heaven sent, I have been to them twice for service and I'm very pleased with their great work; and plus they are the most nicest people to talk with. I will forever be a customer and hope to bring them more.", "pics": null, "resp": {"time": 1473898155395, "text": "Thank u hillary"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108290583882641668197", "name": "Southern Man Barbershop", "time": 1543929699154, "rating": 5.0, "text": "Best computer repair around, wouldn't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109897496738504250278", "name": "Jeffrey Hall", "time": 1489689272200, "rating": 5.0, "text": "They did a good job at a fair price. A lot easier than fooling with a tech over the phone.", "pics": null, "resp": {"time": 1489692990508, "text": "Thank u.    Gladd we could resolve all of ur needs"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106109988502235261687", "name": "sue keekey", "time": 1465584782743, "rating": 5.0, "text": "Have done business with PC TECH for over twenty years and find them to be here for me anytime of day, night, holiday or weekends.  Work is professional and reasonable with excellent quality.", "pics": null, "resp": {"time": 1465823596542, "text": "Glad we can help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107227098665924559172", "name": "Don Hand", "time": 1476195358486, "rating": 5.0, "text": "Great place to have your computer repaired.  Fast and fair in all respects.", "pics": null, "resp": {"time": 1477424450677, "text": "Thanks don.  Glad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106161984346593645312", "name": "Jimmy Davis", "time": 1465488008120, "rating": 5.0, "text": "I have used PC Tech for about 6 years now, for new laptops and repair. Their prices are very far. I would not even think of using anyone else.", "pics": null, "resp": {"time": 1465489478505, "text": "Thank u mr davis\nGlad we can help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117811908226482720718", "name": "InfamousStryfe", "time": 1485712109922, "rating": 5.0, "text": "told them what i needed the computer for gaming and streaming they worked with me the whole time and i have a great computer for my youtube projects now thanks to these guys!!", "pics": null, "resp": {"time": 1485790092043, "text": "glad we could help\nhave a fun time youtubing :-)"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109812902949018782429", "name": "Dr. Walter Sims", "time": 1499882293168, "rating": 5.0, "text": "Totally awesome....installed new ram and a hard drive in my iMac!!!!!! Got done ahead of schedule. Will refer to my fan base!!!!\n\nGreat customer service!!!!!\n\nDr. Sims", "pics": null, "resp": {"time": 1500300347403, "text": "sir,\nglad we could help resolve all your imac needs\nthanks for your buisness"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115071003536864528729", "name": "Frank Pippin", "time": 1469026691535, "rating": 5.0, "text": "I needed a DVD burner for my computer an IDE a ribbon style connection and he had one on his shelf I didn't have any money with me and he told me to try it if it worked I could pay him the next day. The DVD burner worked and went to pay him and was treated very professionally, Would recommend PC Tech for fair and honest service", "pics": null, "resp": {"time": 1469032237128, "text": "thank  u\nlooking forward to helping u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104860918708763592933", "name": "Gayle Chadek", "time": 1518641603145, "rating": 5.0, "text": "Very fast turnaround. I'll be doing business with you again.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113162522270941775829", "name": "Kate Bishop", "time": 1486415061683, "rating": 5.0, "text": "Quick and reliable for phone repair!!\nReasonably priced and nicest folks in the biz", "pics": null, "resp": {"time": 1487338712164, "text": "Kate,\nallways a pleasure\nThanks for ur business"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103714404154207205945", "name": "Earl Jernigan", "time": 1467139372750, "rating": 5.0, "text": "I have been a customer of PCTech for many years and have always received excellenr service. They are always available when I need them. I would rate them AAA.", "pics": null, "resp": {"time": 1467142102159, "text": "Thank u for the review\nWhen u need   Just call"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101147176327746510331", "name": "David Lavoie", "time": 1454085156556, "rating": 5.0, "text": "I was nervous, being my first time taking my work laptop to a shop, but these guys delivered!  I had a shattered bezel that presented a questionable situation.  I knew and expected that my machine could be there several days or so, but they called me back in less than 24 hours, first thing the next morning.  I can't speak for how competitive their prices are, but the bill didn't hurt my feelings.  I will go back to this place for my next pc service need and hopefully will never have to shop for a pc repair shop again.  Thank you PC Tech.", "pics": null, "resp": {"time": 1454259625992, "text": "Glad we could help you david.  Look foward to serving you in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104319953340031011814", "name": "Amy Bass", "time": 1551796196336, "rating": 5.0, "text": "Very knowledgeable, fast, trustworthy, and fair prices - highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109137680705885812813", "name": "Scott Dunham", "time": 1477416895906, "rating": 5.0, "text": "PC Tech has been doing my computer work for years now and I have nothing but good to say.  He is always to help & goes the extra mile for me regularly.", "pics": null, "resp": {"time": 1477424372101, "text": "Glad we can always assist u\nThanks"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117311196534890119130", "name": "Ryan Mills", "time": 1549378372788, "rating": 5.0, "text": "Great service. Got me out of a jam", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108585675990235487293", "name": "Elaine Onley", "time": 1563810321818, "rating": 5.0, "text": "best in the business\nA+++++\nfixed me up really fast", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109338040612158751366", "name": "BEBE Stein", "time": 1544039646822, "rating": 5.0, "text": "Always comes to the rescue for all  our computer problems!! Great service, good people!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107303595751177913056", "name": "Faplin aplin", "time": 1604514432708, "rating": 4.0, "text": "excellent service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111373861304850183316", "name": "The Cottages", "time": 1534366793443, "rating": 5.0, "text": "Went out of their way to deliver a solution to our problem.  Will definitely use them again!", "pics": null, "resp": {"time": 1534440331285, "text": "glad we helped out with your situation on ur computer.\nlook forward to helping u in the future :-))\nthanks"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102736602003976796947", "name": "K L", "time": 1513807072533, "rating": 4.0, "text": "Quick and speedy service.  Got me back up and running without costing me too much.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108894543663705873640", "name": "Kelly Johnson", "time": 1465254077124, "rating": 5.0, "text": "Tech came after hours. Problem solved in less than 15 minutes. I highly recommend this company.", "pics": null, "resp": {"time": 1465254489464, "text": "Glad we could be a service no matter the time we will respond\nThank u for ur buisness"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107288215178294811756", "name": "buford fortson", "time": 1487380756323, "rating": 5.0, "text": "best service i ever experienced  from pctech computer repair Dothan al recommend  it to everybody", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100943786050127482314", "name": "Don Adams", "time": 1535552467067, "rating": 5.0, "text": "fast service and reasonable prices", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114038180900791968958", "name": "joe culpepper", "time": 1548353295470, "rating": 5.0, "text": "great service on time great price", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108873503803556459016", "name": "Kristy Trusty", "time": 1473896671599, "rating": 5.0, "text": "My phone's screen broke and I couldn't wait to have it fixed. PC Tech fixed it asap and it was just like new! Can't beat the service.\n\nKristy", "pics": null, "resp": {"time": 1474387524413, "text": "Thank u kristy"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110182869871222256782", "name": "ray jenkins", "time": 1544715467394, "rating": 5.0, "text": "Greatest service I have ever received!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113646125998228750069", "name": "Jimmie Jones", "time": 1618417174845, "rating": 5.0, "text": "update 4/14/21   the greatest pc shop i have ever been to.\nI haven't ever found another computer repair shop that could do everything I ask without question, and if you want to be treated like family this is the place to go", "pics": null, "resp": {"time": 1519225585052, "text": "thank u sir\nlook forward to helping u in the future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104735479783160761931", "name": "Jenna Holster", "time": 1524583699885, "rating": 5.0, "text": "Arrived promptly and took care of the problem. Great customer service!", "pics": null, "resp": {"time": 1524585566748, "text": "thank u jenna\nglad we could assist u"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111363966071152323693", "name": "randall english", "time": 1487612655934, "rating": 5.0, "text": "Great timely service! Will do business with again! Thanks PCTech!", "pics": null, "resp": {"time": 1487626834574, "text": "Glad we could help u sir\nThanks for ur business"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108348143741128418034", "name": "william shirling", "time": 1543344791791, "rating": 5.0, "text": "OUSTANDING PLACE   QUALITY AT ITS BEST", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112240435776345498478", "name": "sammy richards", "time": 1551987901402, "rating": 5.0, "text": ".This is a great  machine. Love it.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108641151411449929347", "name": "Mary Hall", "time": 1469042205672, "rating": 5.0, "text": "We have just tried them for our first time. They seem knowledgeable and offered good service.", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113207769070881702275", "name": "Nic Reagan", "time": 1517000411640, "rating": 5.0, "text": "Took my dad’s computer in after he stuck a magnet to the side and damaged the hard drive. The computer contained years of family photos and PC Tech retrieved our photos and got us up and running again. All within 24 hours. Thanks!", "pics": null, "resp": {"time": 1518094460178, "text": "Thank u.   Glad we could assist u sir"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115998210269089034323", "name": "Leslie Ann", "time": 1484671019062, "rating": 1.0, "text": "I called to get an estimate. And they guy was being a total jerk on the phone. He said he had to see the laptop and such and I live like 45 mins away.I offered to give the model number he snapped at me and said no, no I will not. I had 2 others give me an estimate. Very rude person, glad I did not take my business here", "pics": null, "resp": {"time": 1484671554739, "text": "Mam sorry u feel that way. All our calls are recorded and the tech was not rude. We dont give estimates on phone so we can give best price possible.  This will be sent to google for review on ur account.\nThanks for calling"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104156323379225695788", "name": "Brittany Gibson", "time": 1538579162141, "rating": 5.0, "text": "Fantastic, anything I need, I get...fast!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113827449591000837518", "name": "thomas mitchell", "time": 1578670422819, "rating": 5.0, "text": "outstanding place\nfriendly techs", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113419611465232283508", "name": "Helen Jordan", "time": 1622205625092, "rating": 5.0, "text": "friendly people\nexcellent service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109665144193649123379", "name": "James Aman", "time": 1548792113059, "rating": 5.0, "text": "great service friendly folks to deal with", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113639698475744080763", "name": "Desmond Douglas", "time": 1553609454928, "rating": 5.0, "text": "Great service and very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102324139706336042597", "name": "carol smith", "time": 1503423039647, "rating": 5.0, "text": "Best Within 500 Miles Of Dothan", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "102434444317905658946", "name": "PRISCILLA BUSH", "time": 1465581093699, "rating": 5.0, "text": "FAST AND RELIABLE SERVICE!!! ALWAYS THERE WHEN WE NEED THEM!", "pics": null, "resp": {"time": 1467759851397, "text": "Glad we were able to assist u"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100453529074097363540", "name": "Ronald Renz", "time": 1506457279144, "rating": 5.0, "text": "knowledgable, answered all my questions", "pics": null, "resp": {"time": 1506536247482, "text": "ronald it was a pleasure serving you\nlook forward to seeing you again\nthank you."}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110336951925418423261", "name": "Bobbie Williams", "time": 1605025882047, "rating": 5.0, "text": "excellent friendly people", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100021647872225265559", "name": "Chris Mathison", "time": 1530127653979, "rating": 5.0, "text": "nice people.  fixed my iMac    great!!!!!", "pics": null, "resp": {"time": 1533819863679, "text": "thank u chris\nlook foward to seeing u in future"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117696332709146396562", "name": "Leisa Manzella", "time": 1545337311602, "rating": 5.0, "text": "Fast, friendly, and honest! Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "103507517178266316088", "name": "gene crosby", "time": 1560877697918, "rating": 5.0, "text": "Great Company nice people", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117478877241009363552", "name": "Carl White", "time": 1551385832334, "rating": 5.0, "text": "excellent place and friendly staff", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "110155224665942147996", "name": "david rousseau", "time": 1559753634976, "rating": 5.0, "text": "great job   nice people", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112648988239157538707", "name": "thomas mitchell", "time": 1569258572868, "rating": 5.0, "text": "outstanding, great work, fantastic service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107670612503258944482", "name": "Thomas Phillips", "time": 1578057246802, "rating": 5.0, "text": "u want it fixed like a pro\nthis is the place 4 u", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "108643189676611492491", "name": "Albert Pennington", "time": 1575485526853, "rating": 5.0, "text": "super outstanding place", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112259919440511028901", "name": "Lynne Tures", "time": 1568391402618, "rating": 5.0, "text": "outstanding quality work", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115156266056950836449", "name": "derrill speller", "time": 1533060894043, "rating": 5.0, "text": "excellent people   fast repair", "pics": null, "resp": {"time": 1533819807368, "text": "glad we could help with ur pc needs\nthank you"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "106053073271496102896", "name": "Teeba Mancil", "time": 1547224334029, "rating": 5.0, "text": "great people to work with", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100264804437538462246", "name": "Keith Kuhl", "time": 1570118049184, "rating": 5.0, "text": "A+++++\nalways gets the job done\nsuper place", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112631465597061884494", "name": "Wendy Jay", "time": 1540868267991, "rating": 5.0, "text": "Shawn McAdams is a wizard in computer repair!!!", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116481154344739604420", "name": "Judy Grant", "time": 1580750367829, "rating": 5.0, "text": "Superb Place", "pics": null, "resp": {"time": 1581954805354, "text": "its was a pleasure  ms grant"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "114099180042531279954", "name": "gene crosby", "time": 1534875078404, "rating": 5.0, "text": "Great people\nGreat service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "117242053775778735844", "name": "Bobbie Baldwin", "time": 1534282466746, "rating": 5.0, "text": "Fast service and friendly", "pics": null, "resp": {"time": 1534344379482, "text": "thanks u bobbie for ur repeat business\nglad we could help u sir!"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "112209687375230370292", "name": "jill helms", "time": 1569256383261, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111963665364165022375", "name": "MACHELLDA S", "time": 1550086238154, "rating": 5.0, "text": "excellent work", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111053685199856359001", "name": "gc mcadams", "time": 1528997270727, "rating": 5.0, "text": "wonderfull", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "100768310268407035623", "name": "Ken Miller", "time": 1516985736489, "rating": 5.0, "text": "Experienced, knowledgeable, fast.", "pics": null, "resp": {"time": 1518094495632, "text": "Thanks for ur buisness"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "116835077054732913225", "name": "Billie Register", "time": 1556034109082, "rating": 5.0, "text": "great work", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113456372820734805663", "name": "Judy Fowler", "time": 1542389406993, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "115981389709707154889", "name": "david tarwacki", "time": 1529338419821, "rating": 5.0, "text": "great service", "pics": null, "resp": {"time": 1533819936836, "text": "glad we got u running\nthanks for ur buisness"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "107929125181360714609", "name": "Ron Sealock", "time": 1528722804087, "rating": 5.0, "text": "outstanding service", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "104758654864865852116", "name": "James Dew", "time": 1485272397840, "rating": 5.0, "text": "awesome place", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111247164525947828360", "name": "paul mayne", "time": 1551458659231, "rating": 5.0, "text": "fantastic", "pics": null, "resp": {"time": 1556628638323, "text": "thanks paul"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "101140943079390162286", "name": "Jeffrey Gwynne", "time": 1481126932073, "rating": 5.0, "text": "Fast, Excellent, Professional", "pics": null, "resp": {"time": 1481137224791, "text": "Thank u for ur buisness\nGlad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109155248237110979864", "name": "Dave Wiltshire", "time": 1550777537759, "rating": 5.0, "text": "fair people", "pics": null, "resp": null, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "113705122807791314778", "name": "Billy Snell", "time": 1515171272839, "rating": 3.0, "text": "Enough said", "pics": null, "resp": {"time": 1467759765094, "text": "It was a pleasure sir\nThanks for ur buisness"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "111361518814285479292", "name": "Judith Huey", "time": 1534267589532, "rating": 5.0, "text": "Fast Friendly Service !!!!!!!!!!!", "pics": null, "resp": {"time": 1534344460758, "text": "thanks you judith\nglad we could help"}, "gmap_id": "0x8892928318bc5bf3:0x74cb69ce96d94207"}
{"user_id": "109749649322500934776", "name": "Ginger Lewis", "time": 1616340224593, "rating": 5.0, "text": "I pick up Wish orders here sometimes. The owners are super friendly. The wife makes jewelry from some of the parts from inside old computers! Very unique and very affordable! Lots of extras in this hidden gem! 😉", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "102839186506109901060", "name": "Mary Moore", "time": 1615902562194, "rating": 4.0, "text": "I brought in my Dell laptop as I could not get it out of an \"infinite boot loop\" or \"infinite restart.\" I ended up getting a new laptop and a data transfer. I interacted with all three team members listed on the site and they were all friendly and professional. The building is clean and organized.\n\nHowever, I dropped it off at noon on a Thursday for it to be tested as they believed it was something else. The receipt/contract sheet I was given said 1-2 business days, but it ended up being 7 before they got to my computer, not counting Sunday. By this point I had already purchased a new laptop and decided I just wanted a data transfer. This was my first time using this business so I have no idea if this is indicative of the average wait period. I know they experienced property damage recently due to the snow storm and I would imagine that would set their workflow back a good bit. I like to give people the benefit of doubt.\n\nThey also sell a wide variety of new and used electronic products and when I went in the first time they even had a lot of unrelated merchandise jewelry, stickers, etc.\n\n4/5 overall good experience. I normally don't leave reviews but I was impressed enough by this.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107649955092493806197", "name": "Jarmarcus Lewis", "time": 1616787318624, "rating": 1.0, "text": "Tervor was very condescending with his remarks about my role as a customer. I did not feel that he valued my business. He offered other places that I take my business instead of assuring that my product would be repaired in the timely manner. I am sure that Tervor will not miss my one repair job, and his business will continue on.  However, ever customer is important to some businesses and I will spend my money at them.", "pics": null, "resp": {"time": 1616792528594, "text": "My grandfather had a saying, \"when you tell half truths, you deal in all lies.\"\n\nI did call you, left a voicemail, saying that I didnt appreciate the way you spoke with my staff, and that your system had been here only 8 Business Days, when the repair time clearly posted at time of drop off was 10 business days. I told you that based on that you would have your system with Saturday or Monday, but in your review you state I didn't assure you when it would be repaired \"in a timely manner\", however I did tell you when, and it was timely based on the posted repair wait at time of drop off.\n\nYou state I offered other places, that is possibly the only true part of your review. I offered the other places around that could get to your repair if the wait wasn't doable for you.\n\nYou stated you was a \"manager of a big box store\" and that you \"worked for AT&T\" and that you don't treat a customer like this. To which I informed you I was \"not a big box store, and I wouldn't let anyone treat my employee's wrongly.\"\n\nUpon further looking into this, another lie came out. You are not a manager at AT&T, just a sales person. I know this, cause our business has over 55 lines with AT&T.\n\nI hope you take this opportunity to learn to treat people the way you want to be treated, cause if you treat my staff improperly, I will call you out."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "118429967109990391085", "name": "Barry Reding", "time": 1606366345948, "rating": 1.0, "text": "My son took his computer to these people last Saturday. The technician told him the problem was most likely to he power supply and showed him the power supply that was needed. My son saw the price tag on the power supply read $80. Today (Wednesday) at 3pm my son went to pick up the computer because they hadn’t fixed it. They require a $35 deposit and would not give him the money back because it is non refundable. They did no work to the computer. I found this shady to say the least given the fact they did no work. I called and after being passed off to four different people I questioned the deposit. I was told by all four people that the deposit was necessary because people bring their computers there and never come to pick them up. I pointed out that was not the case here. I then asked if I could come there and purchase the power supply for $80 minus the $35 that had already been paid. At first the answer was yes you can do that but we won’t guarantee the part. I said I was fine with that. As the conversation progressed and I pressed for a solid answer on the purchase person number four (apparently the top of the ladder there) he began to to fish tail. He said power supplies can range in price. I reminded him the technician actually showed the power supply to my son that was needed for his computer. The price tag said $80. He said you can bring the computer back and we will look at it before the EOB today. At this point I wouldn’t trust these people to hold a penny. Person number four hung up me. It’s a scam. Stay away from these people.", "pics": null, "resp": {"time": 1606368218119, "text": "Your system was dropped off on Saturday.  There is a sign clearly posted that it is currently 3 business days before a technician gets to your repair.  You choose to come pick up your system before the technician got to it on the 3rd business day (it was the next item on his list to work on for the record).  You spoke with 3 separate people when you asked for a refund on the non-refundable deposit every customer pays at drop off.  All 3 offered to have you bring the system back with no additional deposit for the technician to work on the system.  The technician even offered to work on the system immediately if you brought it back in today.  You refused.  One of the owners agreed to your request that the deposit be applied to purchase of a power supply, even though there is no verification that a power supply will fix the system.  This did not satisfy you either.  Services have been offered multiple times.  The bench fee is clearly covered at drop off and with signs on the counter at drop off.  If you had chosen to bring the system back, the $35 bench fee would be applied to your over all bill.  No one from our store told you to come pick up your system, what was wrong with it, or that we could not fix it.  We still offered you services that you choose to refuse.\n\nThe offers were made by multiple employees as well as one of the owners. All calls are recorded and the offers were recorded as well. The security video and audio is available upon request. And the offer still stands, you are welcome to bring it back in or apply the deposit to anything in store, same as owner offered on phone."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107788992048689611417", "name": "Addison Pace", "time": 1599780204535, "rating": 5.0, "text": "The Next Generation Staff is fantastic! They are always helpful, professional, and honest! I’ve bought computers from and sold computers to Trevor and each experience has been great. Additionally, they will do everything in their power to make sure that you get a great deal, love your products, and receive excellent customer service. I will never go anywhere else!", "pics": null, "resp": {"time": 1599784566457, "text": "Thank you so much! We try to have the product selection you would expect in large stores, with the knowledge you would expect from IT departments in large corporations,  and the friendliness you would find in the small \"mom and pop\" stores of yester-year.\n\nWe strive for 100% satisfaction from every client, at every interaction.  We want you to become family, and I hope you feel you have.\n\nThank you for your trust and support! One day, maybe, you will get to teach one of our little ones in high school!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "100436392171734280277", "name": "Flea Bag", "time": 1602180415698, "rating": 5.0, "text": "Came in today because my PC would not POST. The guys there were very friendly, professional, knowledgeable, and had an eagerness to figure out the problem. My PC was quickly fixed, even had its cables managed for me, and I had a great experience! I definitely now know the place I will always go and recommend to my friends. 10/10", "pics": null, "resp": {"time": 1602181435474, "text": "Thank you so much for the opportunity to help you out! We enjoy making our customers happy, making sure things are done properly, and making sure our customers are running at full capacity.  Thank you again!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "108465100469550498308", "name": "Colleen Beahm", "time": 1620374629549, "rating": 5.0, "text": "Very helpful. You can drop off old computers to be recycled there.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "109916958818177401503", "name": "William Bishop", "time": 1611606249558, "rating": 5.0, "text": "Great service and very friendly employees. They fixing my laptop quick and the cost was inexpensive.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "101998012388594996965", "name": "Randall's Collision", "time": 1606877621451, "rating": 5.0, "text": "Excellent technicians, excellent products.  Always there when we need them.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "101184614049870749200", "name": "Debbie Pesta", "time": 1608020416519, "rating": 5.0, "text": "They are very kind and helpful, she went beyond what she needed to do to help me. I will go back.", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "116719014892982741465", "name": "Roger M", "time": 1581690391503, "rating": 5.0, "text": "We had or server go down due to a power supply fault. I took the unit to them and they quickly replaced the power supply and we were up an running within 2 hours. Once it was fixed we were able to make bills and continue shipping all with minimal down time. That says allot. Great job!", "pics": null, "resp": {"time": 1578932968809, "text": "Thank you Roger! We hope you are happy with everything.  If we can help you let us know. Trevor said he will be responding that email later today."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107481881867302542781", "name": "Mark Derwin", "time": 1627870940965, "rating": 3.0, "text": "Not too many computers", "pics": null, "resp": {"time": 1627872413269, "text": "We are currently working to improve our stock, however,  with the nationwide shortage of microprocessors, resulting in  outrageous prices of graphics cards, it us hard for a small business to keep a large inventory.  Sorry for the inconvenience."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "117524090120831789990", "name": "Serena you", "time": 1594202387757, "rating": 5.0, "text": "I drive from tupelo mississippi to do business with this family,  they are friendly,  helpful,  kind, hardworking,  very VERY knowledgeable and professional,  and a pleasure to do business with. Also very VERY big on answering any questions in a fast and timely manner,  and after care is fantastic!!!", "pics": null, "resp": {"time": 1606345871936, "text": "Thank you so much, Serena!  We love our customers and strive to offer the best service possible."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "114491280090484746575", "name": "Malcolm Jelks", "time": 1594217468993, "rating": 5.0, "text": "Great people .Every time we need something They come right out to our shop and take care of us  . far better price than anyone else", "pics": null, "resp": {"time": 1606345828037, "text": "Thank you, Malcolm!  We appreciate it.  We enjoy working with y'all."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "107602350265591796378", "name": "Aaron Lindsey", "time": 1593297100966, "rating": 1.0, "text": "Would not recommend them. I called to see about having them build a gaming pc for me. I was having to wait for the funds but figured why not touch base & see if this was something they could do. He said he could. A week later I called back to schedule an appointment for going over what I wanted in the build. I told the person on the phone I had talked with Trevor about it last week and now have the funds for the build. She rudely told me i needed to schedule an appointment. I thought to myself does this person not understand that's what I'm trying to do? I just said nevermind I will order one on the net. Which I did through iBuyPower.com They lost business because of the bad attitude of the person who answered the phone They gave off a better than you attitude. I honestly wanted to use a local business to help the area economy during the Covid-19 pandemic. To bad I didn't get to", "pics": null, "resp": {"time": 1593302358696, "text": "Aaron, this is Trevor.  I attempted to contact you after you spoke to Lakin via facebook, never did anyone, other than myself speak to you over the phone. You blocked our business account and wouldnt answer personal messages. I have screenshots and will be glad to send them to you.\n\nThe person you talked to on Facebook didnt know you wanted to set up and appointment and was suggesting you did. She had not been the one dealing with you and didnt know we had talked.\n\nWe attempted to contact you several times to fix this and you wouldnt respond,  and blocked the message where I was talking to you.\n\nI am sorry you feel she was rude, however she didnt know and was suggesting an appointment to save you time. Please check your messages as you can see I personally tried to talk to you."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "111503206592614747907", "name": "Harold Brock", "time": 1586554195366, "rating": 1.0, "text": "Worst experience at a computer store ever!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNHvNLe_BhVwQlcFZUEBOpgNTmfplupXj9ti9Ay=w150-h150-k-no-p"]}], "resp": {"time": 1591913967985, "text": "We apologize to Mr. Brock that he didn't understand we couldn't purchase an item he brought in without proper documentation. After it was provided we paid him in full the agreed amount.\n\nLater we were forced to no trespass the customer and file police reports due to continued harassment and threats.\n\nWe strive to earn a good review always, but sometimes it is impossible. We can not purchase good without proper ID to make sure devices are not stolen."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "110369778471249516245", "name": "Chris Royster", "time": 1594167149990, "rating": 5.0, "text": "Great service and friendly atmosphere. They are very helpful.", "pics": null, "resp": {"time": 1599784726855, "text": "We are always happy to help you Chris, even if it to give you bad news that your phone is dead. Thank you for your continued support!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "113065774965372845480", "name": "Mike Parker", "time": 1598368692311, "rating": 5.0, "text": "Great job on the PS4.......Thanks Alot !!!", "pics": null, "resp": {"time": 1599784608363, "text": "Thank you for the opportunity to serve you! Game on, and as always, stay nerdy!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "110555457212260497519", "name": "Amy Ballard", "time": 1594168591629, "rating": 5.0, "text": "You can not find a better computer shop or customer service anywhere and the fact it is a family owned and operated business makes it even BETTER!", "pics": null, "resp": {"time": 1606345914891, "text": "Thank you, Amy!  We appreciate it."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "108629252613041934875", "name": "Jim Fisher", "time": 1597163068855, "rating": 5.0, "text": "They are good folks who know their stuff.", "pics": null, "resp": {"time": 1599784680487, "text": "Thanks Jim! We try to always have an answer, and if we don't, we will find it. Thank you for allowing us to serve you!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "115590499393001473766", "name": "NoOne NeedsToKnow", "time": 1562262135632, "rating": 5.0, "text": "AWESOME Service! Great Prices! Fast, Dependable, and all around Great! Recommend 1000%", "pics": null, "resp": {"time": 1591914017931, "text": "Thank you for your reommendation!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "114119725940719698696", "name": "Next Gen", "time": 1625004919522, "rating": 5.0, "text": "we will help", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "111883607480997200821", "name": "Vicki potts", "time": 1579940246675, "rating": 5.0, "text": "Wonderful customer service and convenient location for \"Wish\" item pick-ups.  Thank  you", "pics": null, "resp": {"time": 1591913993061, "text": "Thank you Mrs. Vicki. We try to always give 100% to our customers."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "115833420259092629632", "name": "Johnny Keeton", "time": 1608513202713, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "100025869824767431863", "name": "Jeff Papisan", "time": 1597234024377, "rating": 5.0, "text": "Great people great service", "pics": null, "resp": {"time": 1599784632859, "text": "Thanks Jeff, we always look forward to serving you and your business!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "112518571751499723966", "name": "Allison England", "time": 1588092610713, "rating": 1.0, "text": "Stay Away, I took my repair in over 2 months ago. He told me parts are over seas. He is never open, does not answer the phone, ignores my calls. Thief!", "pics": null, "resp": {"time": 1591913793209, "text": "We apologize that you feel we could do something to get parts here faster. Due to the COVID19 Pandemic, lock downs, and shutdowns in our Country as well as in many companies’ factories are in, such as China and Japan, parts have become hard to get. When they do arrive, they must clear customs. Normal shipping from overseas is 2-4 weeks, without any delays. We work as hard as possible to keep our customers happy, however some things are out of our control. Shipping is one.\n\nAs far as phone calls, our office is manned Mon-Fri 9AM-6PM, there is an auto attendant and Voice Mail should we be on other line. We also have email available on our drop off forms for customers to contact. If you have any questions please email me at info@nextgencomputers.net.\n\nPlease also give me the name your repair is registered in, as we do not have anything in the name \"Allison England\" and I will be glad to look into why it took so long."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "109016355660117298515", "name": "Brad Davidson", "time": 1593837182441, "rating": 1.0, "text": "Children in business! unprofessional,", "pics": null, "resp": {"time": 1594165189854, "text": "We are a small business that is FAMILY owned. With the current COVID19 crisis there is no other options if we want to work than to bring our children to our office. Furthermore, we believe it is important to instill in them a good work ethic so they can learn they have to work for what they want, and not expect it to be handed to them.\n\nOur technicians are 100% certified, and as such, all adults. Children being here doesn't change our business practices or our ability to serve clients. It only shows the world, what a TRUE family owned business is!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "101093239002143980579", "name": "Pamela Mcclure", "time": 1579041801040, "rating": 5.0, "text": "Very helpful and very friendly", "pics": null, "resp": {"time": 1579045466527, "text": "Thank you Pamela!"}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "108212530109695075344", "name": "FuzyWazaBear", "time": 1578886267365, "rating": 1.0, "text": "Hidden fees and abnormally high prices", "pics": null, "resp": {"time": 1570056471720, "text": "I'm sorry you feel that you had hidden fees and high prices. If you can elaborate about this we will attempt to right any wrongs that have been made. However we do not have any sale or repairs listed under your name, so please let me know what name it was in and what the issues was."}, "gmap_id": "0x887d59c5e9b37975:0x3094c0808d7206dd"}
{"user_id": "118188707050056204879", "name": "Charles Morris", "time": 1626643114815, "rating": 5.0, "text": "I have used this service twice. They always fix my computer issue and communicate updates regularly. The fees are reasonable with fast turnaround times.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "114635528198292226242", "name": "Chowel Weldparts", "time": 1626905497795, "rating": 5.0, "text": "They are trustworthy. Working with honesty and integrity, and don't play with the price. Best computer Repair service", "pics": null, "resp": {"time": 1626963727267, "text": "Thanks for the kind words"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104367783278629684174", "name": "Keojuana Brown", "time": 1621145836441, "rating": 5.0, "text": "Very helpful. I came for what I was looking for. They gave great customer service experience to us.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106828815093298042237", "name": "Miss Sherry", "time": 1609443693459, "rating": 5.0, "text": "The staff have been nothing but  diligent, courteous,  and helpful in getting my PC fixed. And they helped me previously with a battery on a old PC I had. I'm wating til they give me a update,  but I'm rest assured they will get the job done! I highly recommend their services!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106165996828813654261", "name": "Dana Dunn", "time": 1595527997912, "rating": 5.0, "text": "Great staff, reasonable prices very thorough. Highly recommend if you need repairs. Although my system couldn't be fixed they tried very hard.", "pics": null, "resp": {"time": 1595533670539, "text": "Thank you!! We look forward to working with you in the future"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "105272263773641748430", "name": "Walsh Walsh", "time": 1595626446933, "rating": 5.0, "text": "5 ⭐️ service and repair. I can’t say enough positives about Tyler and the staff at  MCS. Very professional, kind, fast repair and didn’t charge for things he could have. I trust him completely with my family’s computer needs. Strongly recommended.", "pics": null, "resp": {"time": 1595863868163, "text": "Thanks for the review. We look forward to doing business with you in the future."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104158153633682136481", "name": "Brian K", "time": 1596642815688, "rating": 5.0, "text": "These folks do great work. Repaired 3 of my laptops. New drives, loaded the software and  working great.", "pics": null, "resp": {"time": 1596652358648, "text": "Thanks Brian.. we appreciate your business"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "107723384696261323128", "name": "Eddie Johnson", "time": 1611550237126, "rating": 5.0, "text": "They were friendly, knowledgeable, and fast. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108265857938358232153", "name": "cooper NXG", "time": 1598150428273, "rating": 1.0, "text": "very poor quality and overpriced. know exactly what you need and how much it cost in average before you go or you getting scammed.", "pics": null, "resp": {"time": 1598269778440, "text": "We replace parts with the same that comes in your original equipment. The cost is based on your part and its cost. We are one of the cheapest repairs around."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "105941647258845569047", "name": "Dean Koslofsky", "time": 1566852128137, "rating": 5.0, "text": "Very nice office. Service was very good they seemed very knowledgeable and were able to take care of my issues. Pricing was also very reasonable.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111988228527052758292", "name": "Haskell Rhett", "time": 1479922515985, "rating": 5.0, "text": "Fantastic service!  I have just moved to Montgomery and was very lucky to find this group.  Their location is convenient.  The staff is friendly and extremely knowledgeable.  They communicate the issues in a way that is easy to understand.  They were prompt.  They found the problem immediately and resolved the difficulty with ease.  They are willing to do whatever you need.  I have used many different computer service businesses over time.  This organization was easily the best I ever used.  I highly, highly, recommend Montgomery Computer Service for any of your service or maintenance needs.  You will not be disappointed. Outstanding!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106569744843860042622", "name": "Wanda Reynolds", "time": 1592500604254, "rating": 5.0, "text": "They are always helpful and are able to get what I need in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106858707675970847958", "name": "Amber Kilcrease", "time": 1560876384317, "rating": 5.0, "text": "I cannot express how pleased and satisfied I am. Great service definitely went above and beyond to take care of me! Thank you Montgomery Computer Service !!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112720682467269087775", "name": "Orlando Hardman", "time": 1532636944084, "rating": 1.0, "text": "On 7/26/2018 approximately 1:15 pm I brought my laptop computer in to see if I could get it repaired. Due to a lack of parking area I almost had an accident with an older driver. We were both backing up. I stop once I saw the other driver.  My concern was the fact that I observed a gentle man sitting about 30 feet away in front of the computer store watching.  Once I entered the store, I ask him did he see what was about to happen. He indicated that he did. Then he stated that people have accidents all the time.  I decided to take my business somewhere else because his lack of concern for a welfare of a potential customer. Besides he indicated that he did not need the business when I ask him.  I can not speak about how well they repair computers, I will leave that to the others who have comments.  I just wanted to share my personal experience.", "pics": null, "resp": {"time": 1536854415972, "text": "Sorry for the parking issues, we work hard to fix computers. So unfortunately we do not spend time parking cars."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111611133086853556981", "name": "Carrie Yates", "time": 1536766124173, "rating": 5.0, "text": "I've been a customer for over a year now, and the owner and staff have come through like a champion on every occasion, every single time, no matter the size or scope of my issue. Every question is answered quickly and accurately, every single product is researched and compared, and every service performed is done with my needs in mind. Honest recommendations are always made, and hours are convenient. The staff is easy to reach, communicates clearly and extraordinarily effectively, and prices are very reasonable. I have yet to find an occasion where this company disappoints, nor do I expect to.", "pics": null, "resp": {"time": 1536853443689, "text": "Thank you so much!"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110173018959234519675", "name": "Rachael L", "time": 1557942497542, "rating": 5.0, "text": "Mr. Stuart has assisted us both on the business and consumer side. Great experience!  Friendly, fast, thorough, transparent along with great pricing.  Will definitely do business with Montgomery Computer Services again!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117950204595413202983", "name": "william “brian” brooks", "time": 1599273490909, "rating": 1.0, "text": "i bought a intel mother board from this place last week and after trying 2 cpu's and 2 different sets of ram  the board never put out video  is completely useless", "pics": null, "resp": {"time": 1599314062340, "text": "We offer warranty on what we sell. If it doesnt work you can always bring it back for a refund or replacement."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110020593242094537621", "name": "Sidney Alene Coker", "time": 1564531869284, "rating": 5.0, "text": "I’m a middle school teacher and writer who tries heavily on my computer for work. My charging port was damaged and was melting charger tips, and only worked if I positioned the charging cord just so, usually with the tip supported by a pen or book on my desk. I had it repaired before at a since closed establishment that did what can only be described as a hack job. Because of these things I was extremely picky about where to take my business, and was checking the reviews for all local computer repair shops when I found this business.\n\nNot only did they fix my computer in less than 24 hours, they listened to my concerns and explained what they would do to prevent the charging port coming loose again. The customer service was fantastic, the repair was perfect, and I cannot recommend this business enough. Their prices are extremely fair, especially considering the quality of service and repair, and the turnaround time made the price even more worth it.\n\nThank you so much!", "pics": null, "resp": {"time": 1564533396371, "text": "Thank you!!"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "116875182937828511843", "name": "John Jelli", "time": 1540907198299, "rating": 5.0, "text": "Just an excellent overall experience. Great customer service, reasonable prices, and greased-lightning turnaround time. Seriously, the turnaround was so fast I was suspicious; but no, they're just that good!", "pics": null, "resp": {"time": 1540907866027, "text": "Thanks John!!!"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "116930809255974603104", "name": "Javan Rampersad", "time": 1569538006203, "rating": 3.0, "text": "Extremely professional and knowledgeable about computer hardware. Diagnosed my issue with my new CPU and motherboard, recommended what I should get, and will put it together for me once my parts come in (for the listed price, of course, which is extremely fair for the work put in). I could not recommend this business more.\n\nEdit: Lowered to three stars. Open and closing times extremely misleading. Advertised to close at 6pm, but I've arrived about five times now between 5:00-5:20pm with no one who can help me being there. However, my original review still stands.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "103465969870900319830", "name": "Kay Wilson", "time": 1480708096341, "rating": 5.0, "text": "I would recommend Tyler to anyone.  He knows what he is doing.  He is knowledgeable and experienced.  He is professional.  His rates are reasonable.  He worked on 3 of our desk top computers he did good work and we are very pleased!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117970055533357067295", "name": "Ron Culbreth", "time": 1561839015198, "rating": 5.0, "text": "I called Tyler and his team from Florida service my 87-year-old mother's desktop in Montgomery.  Tyler suggested that because the tower is heavy (plus I like to limit her driving as much as possible) that they come pick it up, make the necessary repairs and he said they could have it back that same day. Plus I know my Mom would not know how to make all the connections - AND I wanted them to see why her wireless printer wasn't working. That was a Friday morning when I called.  They picked it up at noon and returned 3ish and fixed her printer.  She had 137 incidents of malware !  She had let a phone scammer access her computer and he had her bank account info.  We caught it in time.  Tyler installed some security software.  All for I thought was a ridiculously low price.  Thank you so much.  Restored my peace of mind and my faith in good working folks of Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117155713020964732473", "name": "Larry Summons", "time": 1592998579741, "rating": 5.0, "text": "Went to have my computer checked out and the tech immediately knew what was wrong. We talked about upgrades and he even suggested a seller of a new graphics card, long story short he installed the new part and the upgrades at a VERY fair price!!!! I will return here in the future do yourself a favor and follow suit", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106366253149453994723", "name": "Joseph Bamburg", "time": 1530319417437, "rating": 5.0, "text": "Turn around was extremely quick, service was very reasonably priced (especially compared to big box stores, I think Best Buy was going to charge me double what they did) and everyone I worked with in there was fun to talk with while waiting for the service to finish.\n\nAlso of note, much better timing when you're on a time crunch (absolute necessity to have the computer for bar prep). If I had relied on Geek Squad warranty, I'd be without a computer for three days. Took my computer in, diagnosed the problems in thirty minutes, ordered a part, installed said part, and did some updates in an hour and a half at most. While I was in there waiting during the servicing, had some great conversations. 10/10 hope I won't need them again but if I do will use them in a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113249236413180660227", "name": "Elizabeth Reeves", "time": 1560883143554, "rating": 5.0, "text": "Thank you Montgomery Computer Service for being Awesome, Great service, Great prices, Great people. I highly recommend you guys to everybody!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112461543244306757001", "name": "Ashley Wood", "time": 1560875105796, "rating": 5.0, "text": "A+ Service, Friendly Knowledgeable staff and  great prices. You won’t be disappointed", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106478301293966037265", "name": "Tina Halbert", "time": 1560875910746, "rating": 5.0, "text": "I can't say enough great things about this place! Knowledgeable staff who go above and beyond, reasonable pricing, and quick service. Help is just a text or phone call away. Thanks, Montgomery Computer Services, LLC!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "105884382190109525984", "name": "Nicholas Bruno", "time": 1560886228438, "rating": 5.0, "text": "Needed a computer screen for our business , he delivered it immediately and the price was amazing !! Great service will definitely use this business in the future. Thank you again guys", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "100758037114321527080", "name": "S.M. Huron-Dixon", "time": 1508980489793, "rating": 5.0, "text": "Great and experienced person. Best Buy said my motherboard was FRIED needed new computer. Googled found these guys, and easy peasy snip and snap. My laptop fixed in under 10 minutes.   Whoop whoop.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113518054764502723292", "name": "Anissa Perkins", "time": 1474998536163, "rating": 5.0, "text": "AMAZING! Guys who worked there actually knew what they were talking about, prices were reasonable, and customer service was perfect. I totally recommend this place. Friendly environment and fast service. Will definitely come back if I ever needed any computer repairs.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "109712014418191325096", "name": "Taylor Burck", "time": 1544130102873, "rating": 5.0, "text": "Can't say enough good things - My experience,  the mouse or cursor on my laptop had been jumping all over the screen to the point where I had no control over the actions of my mouse. I thought the trackpad may have been damaged on my laptop. I took my computer in, someone saw me right away. They worked on my laptop for about 15 minutes, installed some new drivers, $25, in and out and my computer has been working perfect for over a week now. For my experience,  a 15 minute, $25 trip fixed my laptop right up. Will come back again and again for any more issues I may have.", "pics": null, "resp": {"time": 1544130912865, "text": "Thank you Taylor"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108066320156800365392", "name": "Takira Savage", "time": 1520990458388, "rating": 5.0, "text": "The guys here are very friendly! The first time my laptop had issues, it went back to doing the same thing. However, they took it back and fixed it. Also, their prices are very affordable. I definitely recommend them to everyone!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104855205551316954805", "name": "Boston Waitforit", "time": 1560892122200, "rating": 5.0, "text": "I highly recommend going here for all your laptop needs. Great and friendly service!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "109249578225919340768", "name": "Shirley Burton", "time": 1488403215448, "rating": 5.0, "text": "I have used Montgomery Computer Services on at least three different occasions for repair work. Their work is fast and efficient with very reasonable pricing. Take your computer-related issues here BEFORE going to the bigger store.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108330282429620563527", "name": "BIG STAR TAVERN", "time": 1560874837747, "rating": 5.0, "text": "Highly recommend very knowledgeable staff great work and fast turnaround time, hands on in helping the community sponsorships and non profits", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113432947393353958661", "name": "Kristi Fuller", "time": 1496797853679, "rating": 5.0, "text": "If you are a small business struggling with your computer system, call them.  They had us back up and running in no time.  They are quick, reasonable and efficient.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110908060458546973743", "name": "Nathan Chong", "time": 1595258859910, "rating": 1.0, "text": "Made appointment for on site service but never show or contact back.\n\nReply: We apologize, but we do not have any contact information for you.\n\nI have left detail contact information with Roger Both for my father's number and myself including the location of the site.", "pics": null, "resp": {"time": 1595254718553, "text": "Your father refused the service when we arrived at his location ."}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111685234210363899616", "name": "Sharonda Bonner", "time": 1457553223286, "rating": 5.0, "text": "Tyler came into our office today and replace our back up battery. Tyler was very friendly and efficient. I would recommend him for any tech issues or problems. Thanks Ty.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106879978270542861968", "name": "Cynthia Brown", "time": 1485556309131, "rating": 5.0, "text": "He was just a phone call away.  He was professional, courteous and knowledgeable.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "108531075121144316715", "name": "Frances oates", "time": 1532626261275, "rating": 5.0, "text": "Great service and pricing very reasonable.. I was in and out in less than 30 minutes..Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "101405594476809467627", "name": "Peter Deegan", "time": 1519953031634, "rating": 5.0, "text": "Friendly and knowledgeable folks who fixed my small laptop problem quickly and with care.  Could not have asked for more.  Thanks v. much.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104555221795758276191", "name": "Leisa Ashley", "time": 1560885536459, "rating": 5.0, "text": "Expert service with a friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "104806689802016156366", "name": "Jack Harrington", "time": 1487980956563, "rating": 5.0, "text": "Very, Very pleased with the service. I have used this business several times and Tyler really cares about his customers. Will continue to use as needed.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "101489041950663591518", "name": "CZn NewAr", "time": 1523997213707, "rating": 5.0, "text": "I am a student and due to some reason i broke screen of my laptop...i went here to fix it and i was surprised they fixed my laptop within 10 minutes..i wish i could give an extra star to rate them...i highly recommened everyone to visit there..keep up the good work\np.s: office depot where i bought it told me it will cost $599 dollar to fix...my laptop price is $499 and they told me i had to pay $599 to fix the screen", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "111937429600991022562", "name": "Gregory Adams", "time": 1539627235479, "rating": 5.0, "text": "Good friendly service 100 in my book good place for computer problem", "pics": null, "resp": {"time": 1539649756895, "text": "Thank you"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "102368648292687824590", "name": "Christy Huff", "time": 1538011915019, "rating": 5.0, "text": "Great prices...fast work...amazing people...", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112455541344920401810", "name": "Jim Benefield", "time": 1555001087759, "rating": 4.0, "text": "Very nice and helpful staff.", "pics": null, "resp": {"time": 1555016804536, "text": "Thank you"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "117742671038885837551", "name": "G Kay Norris", "time": 1580513881769, "rating": 5.0, "text": "Friendly and capable.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106991314674904129131", "name": "Chip Gentry", "time": 1480384600915, "rating": 5.0, "text": "Great Service and an excellent staff", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112910178869529194049", "name": "KENNETH NELSON", "time": 1537963132343, "rating": 3.0, "text": "Overcharged for a tube of thermal paste. 5 for one when Amazon had them at 5 tubes for 5 dollars.", "pics": null, "resp": {"time": 1560544189881, "text": "Next Time Order them from Amazon ...and wait 2 or 3 days"}, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "112679237983857830544", "name": "Brigitte polk", "time": 1518526750127, "rating": 5.0, "text": "Professional and stand behind their work.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "115474369599763970241", "name": "Ruan Brits", "time": 1557590549340, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "113528090579295402460", "name": "Tammy Evans", "time": 1560877876733, "rating": 5.0, "text": "I have had many problems with my computer & he's always been right there to help me out in fixing it couldn't for nothing else out if him thanks again", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "110204201903849936623", "name": "Miss Jackson", "time": 1564273296375, "rating": 1.0, "text": "Disappointed. Disturbed.", "pics": null, "resp": null, "gmap_id": "0x888c2a12651c5211:0x28b88f35ad007119"}
{"user_id": "106136789154274006789", "name": "Charlie Otwell", "time": 1535161215283, "rating": 4.0, "text": "Was in a hurry and received fast help and answers for a hard to find item.", "pics": null, "resp": null, "gmap_id": "0x889a4d6ae1ad5697:0xc02388c2cdaa96df"}
{"user_id": "117557367057952513957", "name": "Anna", "time": 1493842753452, "rating": 5.0, "text": "Rick is one of the most helpful businesmen on the Gulf Coast. He does quality work at a fair price and is very active in the community. He has been my computer guy since I got my first computer with Windows 95. I cannot recommend  him highly enough.", "pics": null, "resp": null, "gmap_id": "0x889a054404790bcf:0x3fdf03d8199f1828"}
{"user_id": "117422247382821157714", "name": "ID360 Media", "time": 1523619924196, "rating": 5.0, "text": "Rick and staff are very competent, customer driven computer repair experts. Rick diagnosed and completely fixed a major crash on my computer in a day. Brought in a sick computer in thr morning,  left with healthy computer in the afternoon.  Very reasonably priced as well.", "pics": null, "resp": null, "gmap_id": "0x889a054404790bcf:0x3fdf03d8199f1828"}
{"user_id": "105375271674639155243", "name": "K. Allen Foster", "time": 1544119857046, "rating": 5.0, "text": "Simply the best around in customer service, friendliness and fair prices.", "pics": null, "resp": null, "gmap_id": "0x889a054404790bcf:0x3fdf03d8199f1828"}
{"user_id": "112992198462507756462", "name": "Barbara Sparkman", "time": 1504740208374, "rating": 5.0, "text": "Mr. RICK AND YANCEY are so knowledgeable...The help me so much...", "pics": null, "resp": null, "gmap_id": "0x889a054404790bcf:0x3fdf03d8199f1828"}
{"user_id": "117086536395353742651", "name": "David Hoffman", "time": 1605493149776, "rating": 5.0, "text": "Honest and consistent. . My apologies, The customers not always right. And I damn sure was not!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOa_OQ_6kkCDotTvQ4LTkTAbSsK56iAoe8d2ceE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "101147072805753786603", "name": "Kelli Naeb", "time": 1616095935207, "rating": 5.0, "text": "My sister referred me to LA Computers and I was not disappointed. They were fast and friendly and reasonable.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "118357051367930485886", "name": "Marie Stewart", "time": 1626528032779, "rating": 5.0, "text": "Very helpful and very nice.", "pics": null, "resp": {"time": 1626538006369, "text": "Thank you Marie!"}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "108310897939160180468", "name": "Donna Rivera", "time": 1579019022338, "rating": 5.0, "text": "I was scared at first about taking my computer in to be worked on, but was soon feeling very good and knew I was in good hands. They fixed my computer put me back on track with a new word program so I could get back to business! Thanks so much guys!!", "pics": null, "resp": {"time": 1588183438731, "text": "Thank you Donna!"}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "110135696564577826463", "name": "Donna Riley-Lein", "time": 1604769331953, "rating": 5.0, "text": "Very friendly. Promises quick service", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "109010320011362354788", "name": "Casual Preparedness", "time": 1595392693572, "rating": 5.0, "text": "I Visited Today And Although My Phone Is Past A Point Of No Return To Repair, They Were Very Friendly.\nFive Stars 🌟 🌟 🌟 🌟🌟", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "117537846384129190195", "name": "patt courtney", "time": 1574130308125, "rating": 5.0, "text": "Professional, knowledgeable, excellent customer service.  Experts in their field & prompt service.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "107009083849316015403", "name": "Crystal Hester", "time": 1500754184318, "rating": 5.0, "text": "I have used LA Computers and Cellular for any issues that I have had regarding my phone's and my laptop for over a year now. The staff has always been helpful and taken care of any problems that I may have had with my devices. They are reasonably priced as well as super friendly. Anytime that I have had any type of question that can be answered on the phone they have always been as informative and helpful as they are able to be without me having to take my device in. I highly recommend this company to anyone in need of this type of service. I will continue to trust them with my devices in any future technology  issues that I may encounter.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "115661213151999431694", "name": "Melissa Casbar", "time": 1543606452304, "rating": 4.0, "text": "Nice professional personnel, great location in Foley. Plenty of parking space available and although they weren't able to help me out during my last visit, my first I had an iphone screen replaced and it worked until I dropped it and the screen plus home button popped completely off leaving the guts exposed. I don't think this is a repair person error per say but you can use your own judgement. Father and son operation which I thought was pretty cool, their dynamic is fun.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "117677700422925798021", "name": "Anna Jane Joyner", "time": 1557495076686, "rating": 5.0, "text": "The did a phenomenal job repairing the keyboard on my MAC laptop after water damage. It’s like new! And would have been far more costly to fix through Apple.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "116315117540632256627", "name": "Michael T Kelly", "time": 1574368227557, "rating": 5.0, "text": "They do a tremendous job !!!  I highly recommend any to them who have issues with their PCs !!!!!", "pics": null, "resp": {"time": 1574375369017, "text": "Thanks so much Michael!  You made our day!"}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "103980556459342985179", "name": "Jonah Lauermann", "time": 1619892452776, "rating": 5.0, "text": "Nice!", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "109413906966579935154", "name": "Jeff Gardner", "time": 1561153965153, "rating": 5.0, "text": "Friendly, knowledgeable staff who strive to assure that you receive 5-star service, are completely satisfied with your purchase and get the bet value for your money.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "113897033988887396431", "name": "Norm Payne", "time": 1556152591412, "rating": 5.0, "text": "They quickly got all my files off an old computer that would not power on. Saved my day.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "117193192199247727125", "name": "Chad Toner", "time": 1536949720416, "rating": 1.0, "text": "Charged me $30 just to look at my phone never contacted me back so called him a week later said he didn't get a chance to look at it so another week went by no call .... called him again  he said he couldn't fix it and had no idea what could be wrong with it and he doesn't know much about Samsung phones.... Really?  A cell phone repair shop that doesn't know how to work on a Samsung!!! Then he wouldn't refund the $30 said that was for diagnosing the phone he had no idea how to fix....", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "110713009636257335037", "name": "Brandon Silvia", "time": 1440948308231, "rating": 5.0, "text": "Great deals && able to fix almost anything you can throw at them. Best phone && computer repair company in Baldwin County.", "pics": null, "resp": {"time": 1469119284790, "text": "Thanks Brandon, for the great review.  Sorry it took so long to get back with you."}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "100817012402432351296", "name": "Anthony Roney II", "time": 1501795877996, "rating": 5.0, "text": "I highly recommend LACC. They had the cheapest price for the repairs for what was wrong with my phone and they were extremely knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "110532839279610703241", "name": "Preston Taylor", "time": 1574724624911, "rating": 3.0, "text": "Didnt answer within business hours", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "105325139967028599448", "name": "Tommy Turk", "time": 1561263042199, "rating": 2.0, "text": "Had to keep calling back and they couldn't fix my problem.", "pics": null, "resp": {"time": 1561407061446, "text": "We apologize for you bad experience, and we'd like to help. It sounds like you were asking for help over the phone, which sometimes isn't effective for fixing problems. If you could come by, we'd be more than happy to try to help you out."}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "105011180753731115439", "name": "James “Jay” Musgrove", "time": 1561243464602, "rating": 1.0, "text": "Stopped to see about selling my phone, no thanks. Asked if they could fix my phone - quote was high and not going to be timely. They had no inventory to choose from as far as phones or laptops for purchase. Also, the store was not presentable on the inside.", "pics": null, "resp": {"time": 1561386343618, "text": "I'm sorry that you had a bad time, but we really don't do much with retail, so we don't buy and sell much in the way of phones or computers; we are primarily focused on repairs. Also, I apologize that we couldn't fix your phone quickly, but if memory serves, you had a Samsung device that has an expensive screen; we don't stock them because of their price point."}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "104964761215020793854", "name": "Michael Beauchamp", "time": 1486007253673, "rating": 5.0, "text": "Been working with these guys for years.  I recommend them for PC and smart device repair.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "112992198462507756462", "name": "Barbara Sparkman", "time": 1562390581074, "rating": 5.0, "text": "Friendliest and helpful...Jonah", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "117391671372413098311", "name": "Victoria Wilson", "time": 1531620504011, "rating": 1.0, "text": "Carl, Jr. fails to acknowledge that \"the customer is always right\". LA Computers and Cellular have lost a long-time customer and all future referrals from me.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "113075354300045316206", "name": "Cindy Kinsey", "time": 1522957820688, "rating": 4.0, "text": "They are very nice and helpful", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "113592415044404881605", "name": "Dan Armstrong", "time": 1550719277913, "rating": 5.0, "text": "Good service.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "114692107079767085583", "name": "Mike Salter", "time": 1565459328093, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "116355623152549268758", "name": "ciel", "time": 1594908587918, "rating": 1.0, "text": "Rude", "pics": null, "resp": {"time": 1594913687317, "text": "We apologize that you had a bad experience. We take care in trying to please as many people here and around our community as we can and have for years. Perhaps you could touch base or stop by and give us a chance to rectify the situation ."}, "gmap_id": "0x889a0e0e67371a95:0x5948dbbf7ce8f2ca"}
{"user_id": "112223985601473858443", "name": "Ruth Horridge", "time": 1590931771347, "rating": 5.0, "text": "Awesome job on our website and local search submissions! Internet is faster at the house after only an hour and $50. Highly recommended.", "pics": null, "resp": {"time": 1590937264701, "text": "We appreciate the kind words!"}, "gmap_id": "0x8861d3dd2ca50ceb:0xdf0f9a72b14e713f"}
{"user_id": "105287502501371737686", "name": "Jon Greenwood", "time": 1590931128867, "rating": 5.0, "text": "Awesome service, on-time, and affordable!", "pics": null, "resp": {"time": 1590937248644, "text": "Thank you!"}, "gmap_id": "0x8861d3dd2ca50ceb:0xdf0f9a72b14e713f"}
{"user_id": "100880757615191942213", "name": "Sanchez Carter", "time": 1618404407509, "rating": 5.0, "text": "Very wonderful young lady. She helped me with fixing two of my highly used phones. Was fast and detailed in her work. I love it. Even left more devices for her. Told a few people about her work and practices. She definitely has my business because I damage a lot of electronics. Rather fix them than to buy more. She will be my first call and recommendation for anyone looking to get devices fixed!", "pics": null, "resp": {"time": 1618405083781, "text": "Thank you for the kind words!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "112407947971531737828", "name": "Jerry Shaddix", "time": 1618007361390, "rating": 5.0, "text": "I have used this business\nfor years and I find them to\nbe extremely knowledgeable\nand helpful, on any matter-THANKS-Jerry", "pics": null, "resp": {"time": 1618405118360, "text": "Thank you for the kind words! Glad that we could be of service."}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "103853495152410659690", "name": "Louis Ardovino", "time": 1593209677251, "rating": 5.0, "text": "Wow! Talk about helping people out!  I called thinking they repaired old receivers which they don't. I asked if she knew of anyone.  She took my number, found out some info and called me back to help me out. You never see that level of concern in businesses these days. This must be a fantastic place to do business!  Kudos!", "pics": null, "resp": {"time": 1593260370993, "text": "Thank you for the wonderful feedback it is definitely appreciated!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "110097107164164350840", "name": "Jacoby Chapman", "time": 1556313470684, "rating": 5.0, "text": "Always a great experience, Super friendly, Fast and Reasonably priced. Have used them on several occasions for repairs and have never been disappointed !!", "pics": null, "resp": {"time": 1556392013500, "text": "Thank you for the kind words Mr. Chapman!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "110514889571010501104", "name": "A Collum", "time": 1579621618365, "rating": 5.0, "text": "Awesome.  So patient with us unlearned computer users. Customer service second to none!!! Thanks.", "pics": null, "resp": {"time": 1580315035154, "text": "Thank you for the feedback!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "112504883268272090162", "name": "Frances", "time": 1584217751028, "rating": 5.0, "text": "Magnificent work! She knows her business!!", "pics": null, "resp": {"time": 1584456450977, "text": "Thank you for the wonderful feedback!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "107637008640163738025", "name": "Sue Nunn", "time": 1536759426370, "rating": 5.0, "text": "Excellent. Great repairs at excellent prices. Very personable.", "pics": null, "resp": {"time": 1555912405184, "text": "Thank you for the compliments, Mrs. Nunn!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "104810108285408880705", "name": "Santana", "time": 1509248933826, "rating": 5.0, "text": "Very respectful and willing to help every customer with a smile.", "pics": null, "resp": {"time": 1555912420564, "text": "Thank you for the review!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "113450326726338934813", "name": "Daniel Sinclair", "time": 1583004918368, "rating": 5.0, "text": "Great service.", "pics": null, "resp": {"time": 1583066413933, "text": "Thank you for the feedback!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "114820786045214331107", "name": "John kennedy", "time": 1584408838036, "rating": 5.0, "text": "The best", "pics": null, "resp": {"time": 1584456416118, "text": "Thank you for the kind words!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "113753713215263185172", "name": "Brenda Coleman", "time": 1558133117857, "rating": 5.0, "text": "Great place!", "pics": null, "resp": {"time": 1558509196822, "text": "Thank you for the kind words!"}, "gmap_id": "0x888c0b5d65f4c44f:0xc2d1dab2ed4f7df7"}
{"user_id": "104608710909311947627", "name": "Matt Mitcham", "time": 1601413998795, "rating": 4.0, "text": "Good people, great work.", "pics": null, "resp": null, "gmap_id": "0x88897d1812850c6f:0xed172cda2933742c"}
{"user_id": "108395955903567832175", "name": "sue achoo", "time": 1622217013134, "rating": 5.0, "text": "Professional work and value. Excellent support as well. They've earned our business and we're very pleased with the results of all their work.", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "111547672311427266562", "name": "Mitchell Pate", "time": 1620678358604, "rating": 4.0, "text": "Very friendly service and quick only took about a day to do what I needed.", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "116746015536068734905", "name": "Pam Kidd", "time": 1560803637088, "rating": 5.0, "text": "The technician is very friendly and helpful. His prices are better than competitive. He does great work and tells you exactly what was wrong and what he fixed. He also will let you know if he can't fox something or if it is worth fixing. He goes an extra step and saves as much as he can rather than expecting the customer to do it or charging extra for it. My daughter and mother use him and love him.", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "114439790521882004578", "name": "Bruce Spain", "time": 1523462710220, "rating": 5.0, "text": "An excellent vet. Great visit.", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "104512689305841284916", "name": "Kathy Duskin", "time": 1522360286097, "rating": 5.0, "text": "Everyone at computer partners was sooooo helpful and polite!", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "110159082007023448922", "name": "Jay Woodruff", "time": 1537290717755, "rating": 5.0, "text": "Did good", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "105229521092418670845", "name": "Randolph Millar", "time": 1512714899069, "rating": 5.0, "text": "Eric does a fine job.", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "111354531525587056362", "name": "Dustin Thompson", "time": 1508642414511, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8889c93c150c9c21:0x37e10dca65b3ef89"}
{"user_id": "101949974171143975901", "name": "Stacy Smith", "time": 1622467508218, "rating": 5.0, "text": "My wife's Grandfather is the owner great man. He will do everything he can to get you the best prices on new or used computer as well as on repairs. I used him before I met my wife and the quality of work is unbeatable.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "118205856970998227433", "name": "Jay Copeland", "time": 1623564584900, "rating": 5.0, "text": "The owner went above and beyond. I bought memory sticks and he took the time to check compatibility of the sticks, and made certain my system was operating correctly. I paid much less than if I had gotten them from eBay or Amazon.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "112779796599063603658", "name": "Lisa Marie Lyons", "time": 1619992907213, "rating": 5.0, "text": "I love the fact they recycle old TVs and computers.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "111459257107851597270", "name": "Kim Gray", "time": 1609468192064, "rating": 5.0, "text": "Great place to buy a laptop or desktop at awesome prices! Fixes problems fast! Overall best place to shop for electronic needs.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "110789410588128325362", "name": "Red Queen Tattoo", "time": 1601576298733, "rating": 5.0, "text": "These are good people here. Helped me understand what was needed and gave me a great deal for their time. I will visit them again if need rises.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "104227491578330377463", "name": "Jeff Clark", "time": 1616779685102, "rating": 5.0, "text": "Only decent place for computer work.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "113906334921350417283", "name": "OwenPug", "time": 1590976806860, "rating": 5.0, "text": "I was in need of a good computer and quickly!! Bobby helped me find the perfect computer for what I needed and at a great price. Dekalb Computers shows excellent customer service and I would recommend them to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "103155774805376796757", "name": "William Yates", "time": 1617136915508, "rating": 5.0, "text": "Fixed my computer while I waited", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "104506114270378900946", "name": "HitechRedneck Toby", "time": 1562716982305, "rating": 5.0, "text": "These guys really know what they're doing. They are the only ones I trust with my computer.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "113903011610956365092", "name": "Alan Benefield", "time": 1544722805246, "rating": 5.0, "text": "I have done a lot of business with them, they go out to help with any computer problem.  I have had some emergency breakdowns and they jumped right on the problem and I was back working.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "108834891410323320134", "name": "PlayWithMyDogg", "time": 1543086780193, "rating": 5.0, "text": "Thanks Bobby for the windows 10 usb sticks.", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "106051323266523996274", "name": "Phillip McCurdy", "time": 1563890195384, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8861d706322b7617:0x1bbf5ac2d4a60266"}
{"user_id": "112210019060242108254", "name": "R Wilson", "time": 1567451336783, "rating": 5.0, "text": "They have an outstanding staff at this company and it's obvious by the quality of their work they certainly know what they're doing.", "pics": null, "resp": null, "gmap_id": "0x886265fea7fbb5b1:0xad9c6acd98812e15"}
{"user_id": "109780025103533611052", "name": "cfi solutions", "time": 1509256357960, "rating": 5.0, "text": "Cyburity took over our IT after our previous person moved out of state. I cannot say enough good things about them. Since they took over managing our computers and network they have continually improved our setup. They regularly come in on the weekends and during the night to perform upgrades so that it doesn't impact our business. More recently they have been fully handling our DFARS (NIST 800-171) compliance without charging us anything extra, just included in the managed IT service we had already been getting. Definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x886265fea7fbb5b1:0xad9c6acd98812e15"}
{"user_id": "103420393787571495138", "name": "Freznuts", "time": 1623752172427, "rating": 5.0, "text": "Super helpful and professional! I was dubious about taking my PC anywhere for repair, but I'm so glad I did! I was stumped. If I have any other computer problems I'll be taking it back to The Computer Store. 10/10 recommend", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "107562302419175106092", "name": "Khalid AlOgbi", "time": 1605465742737, "rating": 5.0, "text": "Professional and friendly staff, they know what they're doing, upfront no surprises or games.  they  will walk the extra mile just to help you out!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOe-xDUBmqqwDSkYOESdkchiDOBakYlgBnQJ3_x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGLEpI5vEnhCPGJoVmWht3c0iPqRMpQC3WHMyF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPptYvey9mDwzjd0Ui0W9dGH3FnkID9LaE2ML5l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLAZV0qPMwoRDetHjAY-Ha8T5dKl1hlgzzJmIw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNIUc5liAn54a2EW3kHh3Q_mdey-HzrmZCOx2s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN9n8geNhWjBJpj5K6fyeOhTZazXux9UMgR1CPm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFWPKOEH9WFB3xWbCD-KpzBqA2dCLstRxolIdX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "106364287770363085758", "name": "Cary Reams", "time": 1617743189356, "rating": 5.0, "text": "Massive thumbs up to these guys!!! I had my second BSOD in two years - Richard, did a full data recovery for me - and reloaded everything - and my machine has NEVER run better!!! I am writing this review several months after Richard fixed my machine - and I promise - it has never run this well! Thank You!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "101061606170070397261", "name": "William Lockheed", "time": 1619602287277, "rating": 5.0, "text": "Ive been in IT for 15 years and needed a very specific replacement SSD for a MacBook, this SSD was used only in the late 2012-2013 Retina model MacBooks and even finding one on Amazon was extremely hard. This store had one IN STOCK for $200, exactly what Amazon charges for a general 1TB SSD. They saved the day and they didn't treat me like I was a moron when I called and asked for the part. The man that helped me was wonderful, stayed a little late on a Friday for me, and 100% saved my day and weekend. Go there to get your stuff fixed!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "100154633134993144641", "name": "Brenda Newton", "time": 1608745754503, "rating": 5.0, "text": "I was very impressed with this company. When I spoke to them on the phone they were very polite and very professional and they were extremely good at their job and did not charge us a fortune. Very considerate people!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "113207604513117644865", "name": "Ronnie Greenlee", "time": 1621437329721, "rating": 5.0, "text": "Paul was extremely helpful thank you Paul five stars", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "112518825104840911603", "name": "Diane Nguyen", "time": 1595973720573, "rating": 5.0, "text": "My laptop screen cracked and I brought it in to Richard based on all his great reviews. He was super friendly and professional. Such a nice man! He had my laptop finished within a couple days! Highly recommend him!!!!! Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "115518322671058559960", "name": "Gerald Burch", "time": 1610830522868, "rating": 5.0, "text": "The Computer Shop is tops in my book! I take all my computer needs and problems there! Service is great! They never push anything that is not needed!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "116501242097188273647", "name": "Robert Williams", "time": 1594907516193, "rating": 5.0, "text": "My computer had stopped working, It wouldn't even turn on anymore. I took it to the computer store and gave it to Richard. Few days later, he had it fixed and my computer was working like new. I strongly recommend this place. They are very professional and do good quality work.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "109493774612939186939", "name": "Landon Owen", "time": 1601500583799, "rating": 5.0, "text": "I went in, and the man inside immediately knew what was wrong with my laptop. While he waited for the part to come in to fix it, he loaned me a spare keyboard to use since mine was broken. When the part finally got in, he had my laptop fixed in an hour. Awesome place. Awesome staff. Awesome dog that roams around the store.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "117459205647267173843", "name": "David Nowlin", "time": 1604312660052, "rating": 5.0, "text": "100% trust in the repairs and upgrades that have been preformed. Full explanation of the problem and solution. After my first visit to the Computer Store I knew that I would not need to go anywhere else. Great professional experience", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "117524675568867763168", "name": "Karl Grimm", "time": 1607094377176, "rating": 5.0, "text": "Computer wasn't working this morning.  Very friendly staff got it repaired and back to me by that afternoon.  I will be back with all my computer needs.  FANTASTIC SERVICE!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "115744490451752425016", "name": "Brittany Morris", "time": 1589074312795, "rating": 5.0, "text": "Can not say enough kind things about this place!!\nWent to Apple in New Orleans and was told my MacBook Pro was not able to be fixed so I brought it in to the Computer Store to get a second opinion and it was fixable!\n\nHad another issue a couple years later and Richard was able to fix it with no problem!\n\nHe is a definitely the guy to see!!\nGreat prices & great service.\n10/10 recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "109627916074854245882", "name": "Laurie Craver", "time": 1599119360957, "rating": 5.0, "text": "What a great staff.  They are so knowledgeable, friendly, professional and trustworthy. I have used other repair shops before finding this one and they can either talk down to you or make you feel dumb for not understanding but not here, The Computer Store is the only place to go for your repair to your devices.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "114711759639798637837", "name": "Joe Lovelace", "time": 1617993900101, "rating": 5.0, "text": "Great to deal with, very good service.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "114922273539470813629", "name": "Travis Ellisor", "time": 1594861804462, "rating": 5.0, "text": "I took my computer to Mr. Richard after a lightning strike fried my hard drive. He was able to save all of my files, and set everything up on a better hard drive for me. I give him my highest possible recommendation!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "109165464399544157287", "name": "Chris Ford", "time": 1598371760063, "rating": 5.0, "text": "Extremely knowledge, very responsive with quick turnaround time for getting things fixed. I would highly recommend The Computer Store, they will take great care of you.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "105247962432448593672", "name": "Marilyn Gullette", "time": 1591292769556, "rating": 5.0, "text": "This is the to go place if you have an Apple computer that needs to be worked on.  They are very knowledgeable,  friendly,  honest,  professional, and trust worthy.  I highly recommend them.  I am very satisfied with the services they provided. Keep up the good work.!!!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "102660133386524851501", "name": "Jaime Mora", "time": 1594134654908, "rating": 5.0, "text": "I came in a hurry needing some ram for my computer. The gentleman who owns the store was very helpful and even put the ram in my computer for free. Very knowledgeable. I recommend it.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "116052932727545315040", "name": "Sean Grizzle", "time": 1588277455892, "rating": 5.0, "text": "I needed some keyboard work done on my MacBook.  Brought it in, couple of hours later the Computer Store had me ready to go.  Very knowledgeable and made quick work of it.  Nice shop, would highly recommend this place if you need any computer work done.  Reasonable rates as well.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "100848244466593117269", "name": "Sandria Murphy", "time": 1598469121340, "rating": 5.0, "text": "They are AMAZING!!!! I’m a college student and need my laptop almost all the time ! So when I got a crack into Mac book it took them NO TIME to fix it !!!! HIGHLY RECOMMENDED!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "107880620883534632654", "name": "Arlene Espino", "time": 1593637522851, "rating": 5.0, "text": "Mr. Richard did a great job in getting my computer fixed for me. He explained what need to be done and did it in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "110134346023240697333", "name": "Sarah Otts", "time": 1593550578150, "rating": 5.0, "text": "The Computer Store was so helpful and efficient when it came to fixing my MAC. His price was the best in town too. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "115355391669186741931", "name": "David Smith", "time": 1593513319357, "rating": 5.0, "text": "Have been using these guys for years and I would and do recommend them to anyone for all repairs. Thanks for the great work.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "101809960743531844212", "name": "Greta Sharp", "time": 1566502278590, "rating": 5.0, "text": "To say I'm pleased is a huge understatement. My laptop needed a new battery and a fan, a problem I thought would take days to solve. In less than three hours, I was good as new, ready to get back to work. The Computer Store is knowledgeable, efficient and customer friendly, as well as reasonably priced. I will definitely be back and I will be recommending The Computer Store to all my friends and colleagues.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "109970364888099599651", "name": "Daniel Sumrall", "time": 1588012641421, "rating": 5.0, "text": "Great place, friendly guy! Very knowledgeable,  immediately understood what I wanted, and went to work. Super fast ! Fairly priced, and worth every penny . Thanx computer store!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "103441315738920091893", "name": "Jonathan McConnell", "time": 1590673135333, "rating": 5.0, "text": "Richard is an absolute professional.  Incredibly nice guy and gets the job done.  I highly recommend \"The Computer Store.\"", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "114966123285922808057", "name": "Steve Horlebein", "time": 1569977884153, "rating": 5.0, "text": "Did a great job at replacing my MacBook screen, upgrading my hard drive, recovering my data and prior customization, and updating the memory chips.  All in one day!  Very impressive and professional.  Oh, did I mention they turned it around in less than 6 hours after they confirmed the special order parts had arrived?  Plus their shop dog is very sweet and gentle.  The upgrades were expensive due to the hardware costs, not their labor charges.\nI have over 30 years of professional I/T experience but am now happily retired and no longer have access to a lab with proper tools and other equipment to make the repairs/upgrades/restores myself.  Without hesitation I will return—they are now my default place to go for computer repairs.  I would recommend them to everyone I meet who might need such maintenance or repairs.  Even my favorite relatives!  Thanks!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "118121375769837540745", "name": "Michaela Rader", "time": 1578678729432, "rating": 5.0, "text": "The man that works here is so friendly and time efficient. His prices are straight-forward and he doesn’t try to sell you things you don’t need. I can’t recommend this place enough!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "106458059405413102764", "name": "Kearus Lang", "time": 1585408864520, "rating": 5.0, "text": "The man that works here is EXCELLENT !! Brought computer in to be fixed at 10 and he was finished at 10:15 I will always come back here love the customer service", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "104460667467550017581", "name": "Adam Hamilton", "time": 1575931952802, "rating": 5.0, "text": "Excellent, fast service. Come here for your Apple product needs. Courteous, knowledgeable, and good communication.  Conveniently located in West Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "101314249674839915992", "name": "TCB STUDIOS", "time": 1564509936646, "rating": 5.0, "text": "So I am a music producer and make a living on my computer. so it was very important that I get up and running asap. My Mac was running super slow once I upgraded to Mojave. I didn't know what to do. but then I came to the computer store and mr. Richard with his excellent customer service assured me that everything was going to be alright and sure enough within one day everything was back running better that normal. Great guy good knowledge would recommend anybody with computer problem to him.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "112901996972587567660", "name": "John Cauley", "time": 1596045156960, "rating": 5.0, "text": "Very helpful. Know they're stuff", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "106281803344004204395", "name": "Fred A", "time": 1560716362717, "rating": 5.0, "text": "He’s a great guy and has always taken care of any apple product I’ve sent his way. He has great communication. Don’t hesitate to take any of your machines, phones etc to him.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "115287981806669092517", "name": "SamBurger with cheese", "time": 1566912501460, "rating": 5.0, "text": "Wonderful service. I was in and out within 30 minutes. I had my iPhone 6 battery replaced. The price was great especially since it was the only iPhone battery repair servicer open at 8 am. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "100244879146634921374", "name": "Ronnie Fulton", "time": 1608771960108, "rating": 5.0, "text": "They seem to care about what problems your  computer  is having", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "116378441333912367616", "name": "Bobvilla 251", "time": 1578318927729, "rating": 1.0, "text": "Wouldn't even look at what I had. Simply said we don't do that.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "111847683506204985644", "name": "dreams chaser", "time": 1571402784087, "rating": 1.0, "text": "Do not believe the owner when he says you have a 6month warranty. Be sure to get this in writing. My computer stopped working a week after it was fixed and they owner wanted to charge me an additional $500.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "100787692593402289574", "name": "Richard Jumper", "time": 1515860181442, "rating": 5.0, "text": "I needed a replacement LCD for my older Dell laptop that my 1 year old destroyed when he decided to \"help daddy work\". This store had exactly what I needed on the shelf for a fair price. I was up and running in no time. Thanks again!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "106565810849669772503", "name": "MooreWorship", "time": 1504825504196, "rating": 5.0, "text": "Richard was my tech guy. He was very knowlegable and very helpful. I express the trouble I was having and He was able to diagnose my computer issue in minuets. The computer was fixed within a five hour time period. Amazing Timely Service!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "103564630950394468200", "name": "Marcus Agnew", "time": 1579362146972, "rating": 5.0, "text": "Great place fast, honest and very knowledgeable!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "115226888968103241109", "name": "Shauna Meiri", "time": 1521904434708, "rating": 5.0, "text": "Fixed my old MacBook Pro in a timely and efficient manner. Super friendly and helpful, they took the time to explain all the issues and I am so happy to have found them as we have just relocated to the area.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "108031652978987056460", "name": "Stephen Guy", "time": 1570730652257, "rating": 5.0, "text": "Great place. Very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "104619973433616464120", "name": "Beau Albanese", "time": 1304531657571, "rating": 5.0, "text": "Don't listen to all the other complainers out there.  I have been a customer there for a couple of years and always get excellent service.  If they don't have the part in stock that you need, they will usually get it the next day.  They are always professional and courteous.  I would recommend this store to anyone with a PC or Mac, but especially a mac.  They know what they are doing!!  Thanks for the awesome service guys!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "109848562741365614414", "name": "Dasheva Blackheart", "time": 1552395340403, "rating": 5.0, "text": "While they didnt have what we needed they opened 10 minutes early and sent us in the right direction. Love these guys.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "116449293498633612756", "name": "Nick Kline", "time": 1498009100690, "rating": 5.0, "text": "I thought it was hopeless for my computer, I gave up on it and had already bought a replacement. Then I was recommended this store from a Geek Squad employee. Got the diagnostic he said quote \"Your battery is swollen, it's like an acid bomb ready to burst\" 3 days later and it was back good as new with updated OS as well, these people are seriously experts and they will do cosmetics for free, I don't even remember his name, but I had 1 broken key on my keyboard and he replaced all of the to slick new keys. Super satisfactory and a decent price too.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "104253272098156802235", "name": "Dottie Lord", "time": 1401469382206, "rating": 5.0, "text": "These guys know their stuff!!! When my laptop decided on the \"blue screen of death\" as its final operation, they knew just what to do to get me up and running again. Very knowledgeable, courteous, and HONEST.  Grant even gave a bit of advice on another device that was malfunctioning, so that I wouldn't be out of pocket for a small issue, easily remedied at home. I would DEFINITELY recommend them to anyone who needs any computer repair. A+++++ service!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "102891138927639059471", "name": "Taylor Hurst", "time": 1549477739180, "rating": 5.0, "text": "I had my Macbook Air screen replaced by The Computer Store. They were helpful, fast, and fair with pricing!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "111186806448001024394", "name": "Marie Greenwell", "time": 1541524906621, "rating": 5.0, "text": "I am a college student and had shattered by laptop screen, took it in and they had it done within a few hours at a reasonable price. Great customer service and quick.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "107591269511149346443", "name": "Timothy Jensen", "time": 1529192167920, "rating": 5.0, "text": "Replaced the hard drive on my iMac using a new drive I bought on sale elsewhere and did the work within a couple of hours. Then, on another visit, Richard spent nearly an hour helping my wife and me diagnose another problem at no charge. I'll be back.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "114732739506559083052", "name": "William Hillman", "time": 1371858867952, "rating": 5.0, "text": "They were able to figure out what was wrong with my Macbook Pro within 12 business hours, gave me multiple options for repairs, and had it repaired within a weeks time. Great customer service! They were extremely helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "101668037774220543656", "name": "Laura Greer", "time": 1523730763660, "rating": 5.0, "text": "They have been more than helpful . Always fixing my problem in a very timely manner sometimes right on the spot . would definitely recommend ,", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "115079655347227035558", "name": "A Aydah", "time": 1384674116236, "rating": 5.0, "text": "Not sure why they have negative reviews they are real experts...  Very good customer service.  Very helpful", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "108592310783866953134", "name": "Brad Latta", "time": 1420564010016, "rating": 5.0, "text": "Great communication, and great experience. Fixed my MacBook Pro in one day. Will definitely use again!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "100904752755920816881", "name": "Aaron Wood", "time": 1358338862808, "rating": 5.0, "text": "These guys were quick and professional when troubleshooting the problem with my system. My MacBook pro had a failed logic board and I was in an out of there in 3 business days with data backed up.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "110089126637872905970", "name": "Kenisha Woods", "time": 1621615669865, "rating": 5.0, "text": "Everybody", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "101361159848980357659", "name": "Chad Terry", "time": 1423927964149, "rating": 5.0, "text": "I gotta give mad props to these guys.  My MacBook had a display issue.  With only a few days left on my Apple warranty, they fixed my display, and I could not be happier.  They also had MagSafe boards in stock that I got when a power surge cooked our power adapters.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "107238361394045226399", "name": "John Hammond", "time": 1466699921102, "rating": 5.0, "text": "Would totally recommend this company. Scott & Michelle are great!!\nSuper service", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "111489852517821226687", "name": "Samira Crabb", "time": 1457460199432, "rating": 1.0, "text": "Still waiting on my iPad from Apple to send in to them  for me just to get a new one since I have a warranty on it. They have poor communication skills. Everyday I to call to get results about my iPad when they said they would call themselves , but never did. It has been almost 2 weeks( I'm still waiting now ) if I would've known it was gone take this long, I wouldn't made a trip to Birmingham at the Apple Store and got the new iPad there.\n\nThe computer store are unorganized and they seem to always be lying about something and being sneaky. I just got a call yesterday saying my \"find my iPad\" was on so that stopped the process for me getting my iPad.  I clearly was in front of the employer who cut it off for me , and I saw her do it myself. So when the technician guy said other wise, I knew he was lying. Why does it take this long to look at a freaking iPad.\n\nI do not recommend at all ! Will never go back.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "101296211895038335447", "name": "Steven Harper", "time": 1404848013816, "rating": 5.0, "text": "The best place for all of your computer repair needs. They have true professionals on staff who know their stuff!", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "102832671140665815551", "name": "Ryan Caffee", "time": 1514298012806, "rating": 1.0, "text": "Computer store that's sold out of ram the day after Christmas, it seems after over five years of business they've still yet to discover how to stock for the holidays. May as well be a phone repair booth at the mall.", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "104186857667142205186", "name": "Abu Anas", "time": 1578815372929, "rating": 4.0, "text": "Convenient location", "pics": null, "resp": null, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "112250257064480544928", "name": "Bill Carp", "time": 1600363382322, "rating": 1.0, "text": "No answer", "pics": null, "resp": {"time": 1600384762811, "text": "Not a deserved 1Star:  Hurricane Sally took out our phones and power like so many other homes and businesses.\nFurthermore, our answering service is available in most cases and we 'ALWAYS' reply to left messages."}, "gmap_id": "0x889bb3174bfe7827:0x69d39af72abeb99"}
{"user_id": "114316320240783092086", "name": "Kelley Maddox", "time": 1599493828031, "rating": 5.0, "text": "I would highly recommend Chad for computer repairs!! Great quality work!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1512081888387, "rating": 4.0, "text": "Expert computer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOb4o7Pl6B41IsF05mUyN6pNMcGIw21TcGSrsgT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-eM7wOMXP8ls0r_vy5B-gcQU4XGdQinEQRlO5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzbSCDa8CCzRz1HbXLlHRnf2b8wZWXWweKdXbQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7gOj2mg0fBooHDB1e3IwLHUDtfjLRai-oiMja=w150-h150-k-no-p"]}], "resp": {"time": 1581047109385, "text": "Thanks!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102223213652406025901", "name": "Tina Brady", "time": 1599495586731, "rating": 5.0, "text": "He has always taken care of our computer issues! He is fast & does a great job!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "114985357054336860642", "name": "James Ellett", "time": 1599493682197, "rating": 5.0, "text": "I’ve used Chad many times. Always satisfied.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "114807225875482294327", "name": "Garrett Griffin", "time": 1587083440399, "rating": 5.0, "text": "He was very good with me and helping me determine issues with my gaming PC. He has been nothing but kind and helpful and I would recommend anyone to him any day. He doesn’t charge a lot, it’s a very fair price.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "115731831952409389288", "name": "Keosha Lenormand", "time": 1578594854462, "rating": 5.0, "text": "Very helpful and honest. Amazing prices. Definitely recommend!", "pics": null, "resp": {"time": 1581046973221, "text": "Thank you, Keosha!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "115615865282520100090", "name": "Louise Cherry", "time": 1523031736256, "rating": 5.0, "text": "I needed a chip taken off a board for my card window, and another one soldered on.  He did the soldering and called within two hours. He wanted to see if the new chip on the board worked, his work enabled me to roll a window up and down and saved me big dollars that the dealer would have charged to put in a new part.  Dealers do not repair those type of items.  I am glad I called him, he is a nice young man and does great work. Highly recommend this business.", "pics": null, "resp": {"time": 1581047127785, "text": "Thank you, Louise!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "113482756587232415039", "name": "Charlotte Ursery", "time": 1562521348320, "rating": 5.0, "text": "Chad is awesome the owner of the place he wasn't even open today but he took the time out of his day to come to the shop and fix my iPhone he is very reasonably priced and very friendly anybody needs phone repairs speaker repair cell phone repair anyting electronic he is the person you should go to wonderful service and great work", "pics": null, "resp": {"time": 1581047069390, "text": "Thank you, Charlotte!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100135678258820513115", "name": "Kelly Bishop", "time": 1557166524844, "rating": 5.0, "text": "I was told by another company my tablet could not be repaired and I would have to purchase a new one but Chad was able to fix it and save my photos.  He has also updated my personal home computer and removed the viruses.  I would highly recommend Chad for your pc repairs.", "pics": null, "resp": {"time": 1581047079050, "text": "Thank you, Kelly!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "106456759762771725845", "name": "Debbie Smith", "time": 1580323227424, "rating": 5.0, "text": "Quick, Professional and Very Reasonable Prices...", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "108910540900240218942", "name": "Harland Underhill", "time": 1485825420374, "rating": 1.0, "text": "Yesterday a friend sent me a link with a dire caveat that I'm probably not going to like this but I should see it. I open the link and lo and behold there is my wife, in all her glory, but with nothing else on. Now I've seen this picture before, she took it herself with my own personal phone. No where has this picture ever been shared, sent, or even seen by another soul other than myself. That is until I took my phone to get the battery taken care of at CH PC Repair.\n\nNow I understand that this is partly my fault for leaving that picture on my phone, I accept that. I had honestly forgotten that it was on there. But I had incorrectly assumed that my personal data would remain personal while my phone was in Chad's possession, but apparently that isn't the case.\n\nWhile the battery was fixed, I've now got to live with the fact that there are not so tasteful pictures of my wife out there for the world to see thanks to some perv PC repairman. If you for some reason desire to use this child for any repair work, make sure your data is extra secure or you wipe your memory card/hard drive before you take it to him. I'm over being mad at this, I'm just disgusted that there are people still like this out there in the world.", "pics": null, "resp": {"time": 1486566093960, "text": "Hello, Harland Underhill. I am having trouble reaching you.. I do not understand why you left such a review about me, and my business. I work extremely hard, and I take pride in my business. I would not do something of this matter. What would I benefit from this? nothing, nothing good at all. I am a man of integrity. I am known for the good work I do, and honestness."}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "117436945797970504746", "name": "Jason Williams", "time": 1527694339461, "rating": 1.0, "text": "This guy is awful.  No patience, no respect, no apologies when he screws up.  Everything is on his demands, but never his fault.  Respect is free, try giving it away sometime.\n\nDon't believe his stories.  He complained in LESS than a week - regarding a shipment originating in Canada - which were the terms he agreed to when he purchased (and also mirrored by the eBay shipping expected time).  But mistakes happen - all I needed was for him to say 'Sorry, my mistake'...  But he couldn't do that - preferring to say that he would be leaving negative feedback (for something he was completely wrong about).  Fortunately I had not shipped the part yet, as I was going to be in the US shortly, and able to do a much quicker & more secure USPS shipment...  But once you threaten negative feedback over something that you're wrong about, and are repeatedly unable to understand that you're in the wrong - damn right I'm canceling that order.  I have the right to \"fire\" a customer who is not conducting themselves appropriately.\n\nMost notable is the fact that negative feedback was left for me, and it took ~5 minutes for the eBay rep to review the details and get it taken down.  His complaints to eBay have resulted in absolutely zero effect on my account.  Clearly he was in the wrong in every part of this transaction, and he has YET to take responsibility or apologize for his errors.  I would not trust him to act in an appropriate manner in any facet of business, therefore this review is perfectly valid based on the lack of professionalism he has shown.", "pics": null, "resp": {"time": 1526479650586, "text": "I purchased an item from this guy on ebay(viridel75) Paid May, 3rd. I complained that it wasn't shipped May, 12th. He canceled the sale without me agreeing. Keeps blaming me for his mistakes. Knows nothing about respect!, Now harassing me?.. Reported to ebay."}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "109591382378310162559", "name": "Catherine Wells", "time": 1539197097078, "rating": 5.0, "text": "Chad is great! Highly recommend him. Thank you for being so helpful and honest.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1536169343913, "rating": 5.0, "text": "So glad I took my computer to Chad to have it repaired. He was helpful and kind. Repaired my computer quickly, and didn't charge some astronomical price!", "pics": null, "resp": {"time": 1581047097320, "text": "Thank you, Renee!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "113311719726002515422", "name": "Kelly Joiner", "time": 1491969329753, "rating": 5.0, "text": "Chad is a super nice young man ànd did a great job geatting rid of a virus buried in my laptop. Was extra accommodating to get it back within a day to meet my needs. Stayed in contact and let me know when it was ready. ;Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102397905705357537904", "name": "Carla Hardin", "time": 1539119126457, "rating": 1.0, "text": "Momma had a Samsung Galaxy s6 that just needed a new battery.  Ordered a battery from Amazon and they couldn't get the back of the phone off.  So they call the Verizon retail store in hazel green and the girl told her to take it to ch pc repair and he would do it.  My mothers phone worked FINE when she took it in there.  She could do anything and everything on her phone.  When she went to pick it up the phone would not even turn on.   He said he tried both old and new battery and it still wouldn't come on.  So he took the screen off and put it on another phone and the screen works.  So he is saying that the mother board is messed up.  He can check it out BUT he'd have to charge her to do it.  Momma said he really messed the back up,  like it was melted!!  I met her up there and his attitude is  basically \"screw you \".  He insisted that the phone was not working when she took it in.  I asked him why he didn't call her and tell her and he said because she didnt leave a number.  To which my reply is \"when you work in customer service like this it is your responsibility to get a number so you can get in touch with the person\". He is a total jerk!!  He takes ZERO responsibility for his screw ups.  Said he was not going to make it right.  But he did tell her that he'd buy the phone from her when she bought a new one.  Then he threatened to call the cops on us \"because it was after hours, he was closed and we wouldn't leave\".  He never asked us to leave, period.  He brags about how much money he makes per year and all of his vehicles and house is paid for.  Good for him.  I dont give a 🐁but what he has and doesn't have.  And now Marina tells us that her stepfather took a phone to him that was kinda messed up and was going to get the guy to repair it.  When he went to pick the phone up or really was messed up!!!", "pics": null, "resp": {"time": 1539369673755, "text": "Carla,\n\nThis issue is between me, and my client Pam Lanford. You came into my office, clearly disgruntled. You then continued to talk over me without giving me a chance to respond or explain the situation.\n\nPam visited my store with her device, which she believed to have a battery issue. She provided an aftermarket battery and had explained that an attempt was made, using a hairdryer, to open the casing and replace the battery, prior to me looking at the device. When the device was dropped off, I was in the middle of an extensive repair, as well as having a conversation with a different client. Not only that, but the device was dropped off quickly, without any contact information, and with very few details.\n\nI replaced the battery with the after-market battery she provided and then attempted to boot up the device, but to no avail. I investigated further but was unable to find a solution. Pam then arrived to pick up her device, and she was, understandably, very upset to find it not working. She wanted it in working order right then and there, and while I understand her sentiments, I can only do so much so quickly. I needed more time to troubleshoot and determine the problem and possible solution, but she would not allow it. I was even willing to reimburse her with a fair value for her device.\n\nI have been in business for more than 10 years now. I work hard every day, and I like to think that I am very good at what I do. I manage hundreds of computers monthly, and I repair and fix many devices daily (thousands of devices yearly). I can remove a device's back/screen in a few minutes with simply a bit of heat and some playing cards, and I have never had any issues. I would never damage a device intentionally. I treat all repairs as if they were my own. That being said, mistakes can (and do) happen as there are many risks involved with these repairs, but I do my best to make things right. To me, it's not just about collecting payment for the services I provide—although that is necessary for me to stay in business and provide for my family. It's about building long-term relationships with my clients, and I deeply enjoy helping and providing knowledge to my clients.\n\nThis is the first complaint I have received with the BBB, and I would truly like to resolve the issue, and have the opportunity to change your outlook on me and your experience with my business. CH PC Repair is my business—it has my name in it, a fact that I am proud of and would never change.\n\nSincerely,\nChad Harbin\nCH PC Repair"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100440554831365751805", "name": "Sandy Thrower", "time": 1463513434765, "rating": 5.0, "text": "Great and fast service.  Chad tackled the problem of a serious virus on my computer and was able to resolve it faster than I thought he would be able to.  I would highly recommend him and his computer repair service.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "100181192580830469853", "name": "Tommy B", "time": 1518560685710, "rating": 5.0, "text": "One of the most dependable and honest businesses that I know of and their prices are good", "pics": null, "resp": {"time": 1581047118905, "text": "Thank you, Tommy!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "116070430570399990003", "name": "Bert Wiggers", "time": 1533658387994, "rating": 5.0, "text": "Does great work", "pics": null, "resp": {"time": 1581047153158, "text": "Thank you!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "110827897021780926439", "name": "dale stinnett", "time": 1550825729152, "rating": 5.0, "text": "Thanks 😘", "pics": null, "resp": {"time": 1550853935432, "text": "Hey you!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "107608350551647559068", "name": "Presley Thornton", "time": 1529682088649, "rating": 5.0, "text": "Thanks!", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "112439074065538567652", "name": "Chad Harbin", "time": 1486566193580, "rating": 5.0, "text": "I am the owner.", "pics": null, "resp": null, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102833086902583306951", "name": "Mary Hutchens", "time": 1529254777981, "rating": 5.0, "text": "He put a front on my phone in about 15 minutes now my phone looks new", "pics": null, "resp": {"time": 1581047144030, "text": "Thanks!!"}, "gmap_id": "0x88623f52db6fed93:0x398f7a17a9216be3"}
{"user_id": "102787019948847241298", "name": "Curtis Tarver", "time": 1516201047089, "rating": 3.0, "text": "Okay", "pics": null, "resp": null, "gmap_id": "0x889288c99e6bb249:0xc76fe141c088fb19"}
{"user_id": "102685740170098795887", "name": "Diane Glover", "time": 1576002388565, "rating": 5.0, "text": "Good organizations to help them with Cerebral Palsy.", "pics": null, "resp": null, "gmap_id": "0x889a4d88cd7194b5:0x8889727d5d035e2"}
{"user_id": "105146497269145785989", "name": "Godfrey Vaughn", "time": 1606589683626, "rating": 5.0, "text": "Shaw Technology has been a great partner when it come to our Internet solution.  We have a 17,000 square foot building and we have used the proposed solution for about 3 years now.  I would recommend Shaw Tech for any commercial solution.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "100621269578363798278", "name": "Health Star", "time": 1596629160792, "rating": 5.0, "text": "Been doing business with the Brad Shaw and his team for years. Awesome people who are 100% committed to their clients.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "117302602031996986661", "name": "Kat Travis", "time": 1594216552148, "rating": 5.0, "text": "Best IT company hands down!! Channing Allen is very knowledgeable and patient.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "113246321056613466121", "name": "Tonya Locke", "time": 1562869559306, "rating": 5.0, "text": "Very helpful and an absolutely loveable staff. They have gotten us out of some pretty substantial situations and even some very minuscule situations. I would recommend 100 times.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "117182298530662596043", "name": "Ann Marie", "time": 1557334605411, "rating": 1.0, "text": "Terrible company. Management of this company aren’t good people they’re just money hungry and selfish. I’d give 0 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "109402575936866019377", "name": "Austin Lowman", "time": 1562869638495, "rating": 5.0, "text": "Staff are hard working and responsible. Fair prices for great service.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "104801217029580070430", "name": "Gale Masters", "time": 1435265988171, "rating": 5.0, "text": "Everyone at Wilson Shaw IT is very professional, and they are by far the best technology firm in Alabama. I would never work with another company again. Check them out if you ever need those types of services. They are all a real pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "105151040942013092136", "name": "Ryan Moore", "time": 1559653169959, "rating": 5.0, "text": "Very good people fast response love the staff", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "110350741286136686233", "name": "Scooter Leonard", "time": 1450405589481, "rating": 5.0, "text": "Wilson Shaw understands the current needs of its customers and is proactive in helping them reach their technology goals. They are excellent at evaluating your current systems and offering options for enhancements and improvement. They are focus on increasing our productivity and reducing our costs. I would highly recommend them to do the same for your company.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "104423773960235981332", "name": "Kyle Houghton", "time": 1439475061992, "rating": 5.0, "text": "I would highly recommend Wilson Shaw IT. They were able to help me out when I needed them.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "104375803916668101288", "name": "steve pauley", "time": 1504049860152, "rating": 1.0, "text": "Not very good at install or customer service. When they installed our Internet Eq they forgot to run the cable from the Eq  to the outside of the house to meet the cable company. Turned in to a mess to gert it run in and looks terrible. Also they wont come back to maintain the Eq after numerous phone calls. NOT RECOMMENDED for RESIDENTIAL service.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "111708904232464567394", "name": "Joel Miller", "time": 1453323766932, "rating": 5.0, "text": "The staff members from Wilson Shaw IT are fantastic and their follow through is even better. They took their time to explain everything to me and followed up the next week to make sure everything was still working well for us.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "102100310405850145287", "name": "Margaret Peters", "time": 1443617456071, "rating": 5.0, "text": "I have used services from Wilson Shaw IT for ten years. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "101653080087434584979", "name": "Teresa", "time": 1562169978923, "rating": 1.0, "text": "Brand new server. Up and down, up and down. Technicians are useless.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "108480587395293393681", "name": "Lawrence Daniel", "time": 1529586674430, "rating": 5.0, "text": "Great MSP.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "114691210921890979715", "name": "Vicky Lee", "time": 1515756860161, "rating": 5.0, "text": "Outstanding", "pics": null, "resp": null, "gmap_id": "0x888c2b7ca9f7855f:0x96c6c2b72ee81f8c"}
{"user_id": "102635338841794438587", "name": "B.J Killings", "time": 1582173049807, "rating": 4.0, "text": "He has a really good set up a lot of fish bait and live minnows you can't find them very often anymore reasonable prices and he's really nice", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "117236004234624846336", "name": "Debra Sue Loyd", "time": 1573959043655, "rating": 5.0, "text": "Small yet adequately stocked. Lots of bait, minnow, crickets, shiners worms... helpful and informative about the area.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "101526434571332780606", "name": "Gail Ezekiel", "time": 1590429823728, "rating": 1.0, "text": "Tony was rude. No signs showing where you could park.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "113090035060383097827", "name": "Julia Sibley", "time": 1602713432237, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "108445037632021071950", "name": "Nicole Maddox", "time": 1533940206420, "rating": 5.0, "text": "Great place. MR. Tony is is also great a fixing computers! He has helped me many times!", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "109830509533651058572", "name": "Grant Marcum", "time": 1572449855693, "rating": 5.0, "text": "Always great bait and tackle!", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "102638095437407082841", "name": "Brad Godwin", "time": 1549231693980, "rating": 5.0, "text": "Best place in gantt to get your bait", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "109832686344583413524", "name": "Jessica Byrd", "time": 1571518248134, "rating": 4.0, "text": "High quality worms.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "103023398907095825812", "name": "Ronnie Grissett", "time": 1563745555137, "rating": 4.0, "text": "Place for good bait..", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "110921894698890164272", "name": "T Moser", "time": 1555976793343, "rating": 5.0, "text": "Good friendly service.", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
{"user_id": "109344253013659175383", "name": "Rochele Turner", "time": 1511326098121, "rating": 5.0, "text": "My family owns it", "pics": null, "resp": null, "gmap_id": "0x8891e5f1e3b6c9a3:0xfaeb0c6dbfbe407d"}
