{"user_id": "108642134360776862145", "name": "Tim Caldwell", "time": 1594913323979, "rating": 5.0, "text": "Sawgrass is the absolute best in surveying and engineering consultants in Baldwin County and the greater Mobile area!!!  Excellent work,  excellent quality, excellent prices!!!", "pics": null, "resp": null, "gmap_id": "0x889a4b33d06c0f9f:0xd56ea6043a348357"}
{"user_id": "107171431534431389343", "name": "Rashad Lewis", "time": 1629876953295, "rating": 5.0, "text": "Help me Close on a House, would recommend", "pics": null, "resp": null, "gmap_id": "0x887d485e3310b3db:0xe94f33270f5b3cb5"}
{"user_id": "102801159367564725403", "name": "Eric Rickard", "time": 1612218373406, "rating": 5.0, "text": "Fast and very friendly. Will definitely recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x887d485e3310b3db:0xe94f33270f5b3cb5"}
{"user_id": "104595214909736186705", "name": "Tamika Ruffin", "time": 1600121804848, "rating": 1.0, "text": "BEWARE: We closed on July 8, 2020. We had just moved to AL from NC. We had no family here. And the timing was in the middle of COVID-19 when no childcare is available. We had to bring our four children with us. We decided to split up to watch the kids. My husband went in first. I went in second. When my husband came out alone, I handed him the keys to take the kids in our vehicle. I went into the office with Christopher to sign. He showed me the plot map and told me where to sign. I made the assumption since I was signing paperwork that it was accurate as it was based on our closing disclosure. Right on line 17, it says I was to be on the title. When we received our warranty deed in the mail this last friday, we called the attorney's office for the second time. The first time we called we spoke to Anna who told us she was going to get me added to the deed and it would be corrected. That was when I purchased the deed from the county a couple of weeks ago. She assured us it would be corrected. Therefore, when we received another one in the mail on Friday, we assumed it was the correct one. However, it was not. So we called ALS again. We talked to Shannon this time and was told I could not be on the loan because I was not on the sales contract. We had done this exact thing before in NC so that was strange. I asked for the law statue. Shannon said she did not know what it was. I said ok. I reached out to Veterans United because our closing disclosure from them said I was supposed to be on the deed. Mr. Morgan asked if I could call our closing agent back to see who he contacted from Veterans United who denied adding me to the loan as he stated because that was not their policy as they did it for us in NCs. I followed up with our closing agent Christopher with ALS to get the answers for Mr. Morgan. I was told by Christopher that he doesn't remember who or when he contacted Veterans United. I said so I am just taking your word for it? He said well I have the survivorship deed you can sign. I said I understand that. However, you said you reached out to Veterans United and they denied your request of adding me to the loan. He said well you sat at closing and just signed instead of asking questions. I said you are right because I trusted your office. In the midst of a pandemic, we are moving across country with four small children and no family. Our children were anxious as we had just drove 4 hours to get to his closing office that morning at 10am. I was never able to get the truth about the situation. Christopher with ALS was very unprofessional and lacked empathy for this mistake. I said I was going to write a review about our experience since he basically told us it was our fault for not reading what we signed. PLEASE DO NOT ASSUME THAT WHAT IS ON YOUR CLOSING DISCLOSURE IS WHAT YOU ARE SIGNING IN HIS OFFICE. Oh and he said he was going to tear up the survivorship deed we were supposed to pickup in the morning. Our realtor, Scott Smart, picked him and had never heard of this law before. I regret not looking at the reviews first. Christopher also threatened to have his attorney sent me a letter for writing an honest review of our experience. Can we really trust the good reviews?? Also, he mentioned us having all them kids at closing so he is remembered that when it had 45 days ago, but conveniently, he COULD NOT REMEMBER WHO OR WHEN HE CALLED VETERANS UNITED. He could NOT remember whether he explained to me what I was signing or not, either. PLEASE BE CAREFUL.", "pics": null, "resp": null, "gmap_id": "0x887d485e3310b3db:0xe94f33270f5b3cb5"}
{"user_id": "110448460628005652787", "name": "Gary Keeton", "time": 1571593555157, "rating": 5.0, "text": "Great people and easy process.", "pics": null, "resp": null, "gmap_id": "0x887d485e3310b3db:0xe94f33270f5b3cb5"}
{"user_id": "114141915961091992785", "name": "Red Tree Realty", "time": 1543604934112, "rating": 5.0, "text": "Chris and the crew are a great closing company. Always there for your Title and land service needs.", "pics": null, "resp": null, "gmap_id": "0x887d485e3310b3db:0xe94f33270f5b3cb5"}
{"user_id": "109667870078319639228", "name": "Shirley Neese", "time": 1541762218703, "rating": 5.0, "text": "Always have pleasant closing!", "pics": null, "resp": null, "gmap_id": "0x887d485e3310b3db:0xe94f33270f5b3cb5"}
{"user_id": "103729112499800925552", "name": "Keith Hall", "time": 1627849557814, "rating": 1.0, "text": "Laughed at me.  Don't have any sand", "pics": null, "resp": null, "gmap_id": "0x889a121f60642305:0x2cd2e58fc36bcd91"}
{"user_id": "117482013678129075277", "name": "derek beals", "time": 1523174092602, "rating": 5.0, "text": "Great company.  Great employees.  Best around.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNluSw3Fyr0qVyj2b6VODrtUMTUM84etgYsK2Cn=w150-h150-k-no-p"]}], "resp": {"time": 1541434865307, "text": "Thanks so much, Derek.  You're right - we have a fantastic team that loves making their customers happy!"}, "gmap_id": "0x889a121f60642305:0x2cd2e58fc36bcd91"}
{"user_id": "117396084251102243633", "name": "Michael Thompson", "time": 1563714494441, "rating": 4.0, "text": "I really love the lady behind the desk she was a sweetheart", "pics": null, "resp": null, "gmap_id": "0x889a121f60642305:0x2cd2e58fc36bcd91"}
{"user_id": "108280697258100229182", "name": "Kyle “Necronomikyle” Dockery", "time": 1574779651487, "rating": 5.0, "text": "This is a really nice place with some really friendly people and a pleasant view. For some reason Google will not lead you there correctly though", "pics": null, "resp": null, "gmap_id": "0x888923c347e391e7:0xe9dfaf229fe3aede"}
{"user_id": "108092536784205277650", "name": "Zigi Onye", "time": 1532196440572, "rating": 3.0, "text": "Just drove past", "pics": null, "resp": null, "gmap_id": "0x886269c95f021ec5:0x612efdcf127549e"}
{"user_id": "116195295034937013334", "name": "Michael Wistafke", "time": 1541051313012, "rating": 1.0, "text": "Just drove by", "pics": null, "resp": null, "gmap_id": "0x886269c95f021ec5:0x612efdcf127549e"}
{"user_id": "108013085212970854423", "name": "Shannon Ball", "time": 1628339767751, "rating": 1.0, "text": "Notice all good reviews are from employees?!  Hmmm\n\nRecruiter reached out and kept having to reschedule the call. Then after stating I’d be a great fit for this database administrator and mentioning other roles, even discussing salary - he went radio silent, for weeks now.\n\nLeading people on is very cruel and extremely unprofessional.  Says a lot about the company as a whole. You’re dealing with people’s lives here! I’m glad I didn’t get the job after seeing how they treat candidates.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107193861780684674434", "name": "Caitlin B", "time": 1623098360252, "rating": 1.0, "text": "Notice all of the 5 star reviews are from company employees...\n\nI have been on the same medication for 10+ years with no issues from my prior insurance company. After calling numerous times, spending hours on the phone, and getting a different answer from each rep, I was informed that my request was denied. Not because I didn’t have the correct diagnosis but because they are demanding I try a list of generic medications first. AKA they are too cheap to pay for my prescription. They do not care about withholding medication from you, they are just looking to save $$ wherever possible. STAY AWAY FROM RXBENEFITS.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108042295893953707024", "name": "Nathaniel Shaw", "time": 1625673202619, "rating": 1.0, "text": "Most complicated benefits/insurance company I have ever dealt with. I've dealth with 3 insurance companies through 3 different employers over the last 10 years. Favorite line for anyone in customer service is \"We are not set up for that.\" Gives me the feeling that RxBenefits is not set up to effectively conduct business the way the rest of their industry is. If you have any say so in the situation, avoid RxBenefits. Our company insurance is by far the best insurance I've ever had, their achilles heel is RxBenefits.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "111104141045360729147", "name": "Sydney Stein", "time": 1574098428404, "rating": 5.0, "text": "I just hit my one year with RxBenefits as my employer and I cannot express the gratitude I have for working at such an amazing company. They truly care about their employees because they take action to prove they care.\n\nI am fortunate enough to work remotely, which allows me the flexibility to maintain a busy lifestyle. RxBenefits has never made me feel separate being remote because the community within our company really comes together to make everyone feel welcome. When I visit the corporate office, I feel right at home with my peers and management, it's as if I never left from my previous visit.\n\nIf taking care of their employees wasn't enough, they also take tremendous care of their clients and members, making sure customer service is top notch, as well as making sure that everything they need is provided.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115142612461030199379", "name": "Kelly Franklin", "time": 1573656781610, "rating": 5.0, "text": "Two years ago I quite my at a fortune 100 company so that I could come work at RxBenefits.  It was the best decision I could have made.  They care deeply about their employees and show that through many different ways.  Whether it is through amazing health insurance benefits, fun competitions or giving us off on Black Friday every year so we can go shopping and spend time with our families!\n\nRxBenefits not only cares about their employees, they care about their clients and members as well.  They do whatever they can to please the clients and members.  They strive to be the best and it shows!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "103016142317091505473", "name": "Bill Weir", "time": 1573658706618, "rating": 5.0, "text": "RxBenefits has been an amazing place to work.  I have the opportunity to work remotely which allows extreme flexibility with family life especially with young kids in day care and school.  I have all the resources at my fingertips and the support is tremendous from my managers, HR and to IT.  I was nervous about leaving my previous job to come to a new company 8 months ago but now I am so glad I made the switch.  The company really values their employees and its growing at an incredible rate for good reason!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102529240688378395644", "name": "Suzanne Stone", "time": 1574183306278, "rating": 5.0, "text": "I was told that RxBenefits was a wonderful company to work for, so I left a company that I had been employed with for 10 years to join the RxB team. It was the BEST professional/career decision I have ever made!\n\nThis company truly cares about their employees and their clients. I have never been fortunate enough to work for a company that supports and encourages their employees the way they do....until now. Being employed with RxBenefits has been a blessing for me and my family. Happy, happy, happy to be a part of this wonderful company!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102532054207669776210", "name": "John (Jack) Meineke", "time": 1574173090930, "rating": 5.0, "text": "RxBenefits was my first job out of college and I am extremely grateful that they took a chance on me!  I was nervous to join the “real world” but after the first couple months I felt right at home!\nMy manager is extremely supportive, kind and genuinely cares about me as an individual. I have the most amazing work-life balance, even though my role is demanding. All the Senior team, including the CEO are approachable, helpful, caring and WORK HARD. Unlike many Senior teams they are all happy to help in anyway they can! I am lucky to be involved in such a forward thinking, ambitious company.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114323113255820361860", "name": "Adrianne Moultrie", "time": 1573597759122, "rating": 5.0, "text": "This is an awesome company with exceptional leaders.  RxBenefits is a family oriented company, and they take great care of their employees. From holiday parties, weddings/birthdays/baby showers, and even in tragic moments, RxBenefits make sure to embrace us and let us know that they are here for us just as we are for our clients. I feel great about how we serve our clients, and how we serve each other.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104885327268695015205", "name": "Monica Gindhart", "time": 1573676606829, "rating": 5.0, "text": "RxBenefits is a wonderful place to work. They truly understand the value of their employees and show it every day. Not only do they value their employees but they value their clients unlike any other company in the industry. Their unique approach to provide benefits to their clients sets them apart in the industry. I would highly recommend working for or working with RxBenefits.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109735034999403399599", "name": "Kelcei Chamberlain", "time": 1574176749917, "rating": 5.0, "text": "I am grateful and proud to be a part of RxBenefits.  Our company's leadership truly values each employee.  This appreciation motivates me to work harder and take pride in my work.  We are a family.  A family that cares about our customers, each other and our community.  You would be hard pressed to find a better group of people.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117868398172593345329", "name": "Jodi Jones", "time": 1573660558316, "rating": 5.0, "text": "I have worked at RxBenefits for almost three years and have personally experienced the culture that RxBenefits takes so much pride in. They offer competitive wages, flexible schedules and a positive work environment.  With the companies rapid growth, there is great opportunity for personal growth and development and I am proof of that. RxBenefits has provided me the opportunity to grow and expand my knowledge in four different areas since I started working for the company. I am very grateful for the opportunity to be part of the RxBenefits team!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "103292389759767759672", "name": "Madison Music", "time": 1573657160793, "rating": 5.0, "text": "RxBenefits is an amazing place to work. We have so much room for growth and opportunity. They are a family oriented company and they value every employee. I have been with RxBenefits for the past 10 years and I love it! Best place to work!!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114498869017230895408", "name": "Wendy Bruce", "time": 1574433438477, "rating": 5.0, "text": "RxBenefits is not just a company - it is a family.  The training and support you receive from both management and your co-workers is amazing. Everyone here truly wants you to succeed - just like family! But the best part is that since I have joined RxBenefits, I now enjoy real work-life balance.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108849480948784588212", "name": "Deepan vishnu", "time": 1574475519586, "rating": 5.0, "text": "Company is on track of consistent growth on business, latest technology improvements.\nBest management team.\nGood health insurance plans.\nOverall great place to work and learn.\nAlong with other employees and I am one of the happy employee to work here.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "103805960310479789671", "name": "Sarah Petty", "time": 1574106343249, "rating": 5.0, "text": "I joined the RxBenefits team in June 2019 it is the best professional decision I have made.  This is a great company to be apart of, from the top down everyone cares about each other and that is evident in the day to day interactions as well as decisions that are made which impact the work force.  The company is seeing tremendous growth and I am proud to tell others that I work at RxBenefits.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113530226664981871686", "name": "Cortney Newman", "time": 1574171346147, "rating": 5.0, "text": "I tell people all the time RxBenefits is the most genuine company to work for.  I have been here for 3 years.  I can truly say they care about each employee.  The encourage you to grow and help you achieve whatever goal you have within your career.  I LOVE this company!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114722440365004340832", "name": "Megan C", "time": 1574176184021, "rating": 5.0, "text": "I have been working for the company since September and it has been the best move in my professional career. RxBenefits truly cares for their employees and wants the best for everyone, professionally and personally. Everyone that I have encountered within the company has been wonderful and they push you to the be the best version of yourself! I highly recommend this company to anyone who is looking for a new career path!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104500689631919755298", "name": "matt ford", "time": 1573575697625, "rating": 5.0, "text": "RxBenefits is a wonderful place to work -- welcomed and included from day one into a team-oriented, collaborative group. In fact, I just told my wife and family how much \"I love my job\". It is also very exciting to experience the growth our company and value we bring to our customers.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "106556188389721584395", "name": "Nina Fuller", "time": 1573598191834, "rating": 5.0, "text": "RxBenefits is a great place to work. Only been here for 6 Fabulous months and the people are Awesome. On the first day they make you feel part of the family. Working in Client Service we are team oriented. Happy to come to work everyday to see what adventure we're having for the day.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114051021625661658965", "name": "Jeremy Kizzire", "time": 1573504864326, "rating": 5.0, "text": "RxBenefits has been my favorite place to work since I started my full-time career over 25 years ago. The teamwork and camaraderie are second-to-none. I could tell on my first day of work that this is a company that emphasizes training their employees and making sure they are fully-equipped to succeed. I enjoy coming to work every day and learning more from my teammates and managers.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "105851860162330316661", "name": "Kipzya Zlotkus", "time": 1574174380708, "rating": 5.0, "text": "Around 6 months ago I decided to leave my previous company that I had been at for almost 10 years.  It was a tough decision since I had so much history there. However, I found a new home right away at RxBenefits. My favorite thing about RxBenefits are the people, they have the best company culture I have ever experienced in my career.  My colleagues are team players and will always go the extra mile to ensure that we are providing excellent service to the groups we are onboarding. Additionally, the company is growing exponentially so there is a lot of room for career growth and advancement. Lastly, the company really cares about their employees and show us they value us by providing great benefits amongst other ways.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107145761173000133327", "name": "Jason Robinson", "time": 1574097139780, "rating": 5.0, "text": "RxBenefits is a fantastic place to work.  When I walked in the door the first day, everything was on-boarded including my laptop and access immediately.  The company provides \"swag\" to include RxBenefits backpack, free beverages, etc.  The type of work is challenging.  We are using the right tools to make a difference in the marketplace.  Best of all is that they employees are friendly which makes this a great place to work!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "100888937463841855589", "name": "Debra Fowler", "time": 1574435070287, "rating": 5.0, "text": "As one of the newer teammates to join RxBenefits, I am struck by a couple of key points - valuing the client, the broker and our teams,  going the extra mile to ensure the experience for clients and members are smooth and result in solutions that make their lives healthier, easier and their pharmacy benefits a better value while providing the right benefits at the right time at the right cost for members.\n\nAs far as taking care of it's teammates, I am struck by the acts of teamwork and recognition of the work it takes to serve our business.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113392337165455177632", "name": "Laura Leigh Etheridge", "time": 1574455174314, "rating": 5.0, "text": "I have been fortunate to work at RxBenefits for the past nine years.  Everyone in our organization contributes to the success of our company.  We are committed to doing what is best for our clients and work hard to ensure that they are taken care of.  Our leadership team is the absolute best and genuinely care about their employees.  Thank you RxB family!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109114877734484779653", "name": "Deidre Jenkins", "time": 1573656365999, "rating": 4.0, "text": "RxBenefits has the best work environment I have experienced. Our casual environment makes it easy to come in and perform your job well. Let me not forget that we offer some of the best savings out there for our clients.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102363363233985319538", "name": "Mike Moody", "time": 1573657100714, "rating": 5.0, "text": "I joined RxBenefits in June 2019 and can't believe that I found this company.  My recruiter worked on me for several months before we finally got things moving.  RxBenefits is everything the recruiter presented and then some.  The training is second to none and everyone in our company is fantastic.  No matter your position within the organization everyone you meet is willing to help you.  I can't say enough good times about the company and I'm blessed to be part of such a wonderful organization.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117776042819688726321", "name": "Shannon McAnulty", "time": 1574443454664, "rating": 5.0, "text": "One of my favorite things about working at RxBenefits is the brilliant (and fun!) people I get to collaborate with to bring effective and cost-saving solutions to our clients. We do things the right way, with value and integrity, and I think our clients and broker partners would agree. Leadership listens to feedback from employees to make our working environment one of the best in the business. Working remote can sometimes make you feel like you're on an island. RxB makes sure to keep everyone connected through technology and communication. We have fun and work hard. Easily the best opportunity I've had in my career thus far.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "100231034082932643488", "name": "Laura Kayvonfar", "time": 1574172801166, "rating": 5.0, "text": "A little less than two years ago I took a chance and left my position at another company. It was the best decision I have ever made. RxBenefits has not only given me a love for my job but an excellent career path for my future. Since starting at RxBenefits I have grown tremendously and moved up within the company. I was looking for a place to grow and stay and that is what I found! RxBenefits is a pharmacy consulting firm that specializes in customer and client care. Our white glove services focuses on not only the client but their employees to give all around service that you won't find anywhere else in the pharmacy benefit industry. RxBenefits cares for their employees as much as they do their clients which makes for a wonderful work environment. Happy employees make happy clients and RxBenefits has just that. Check it out and see what RxBenefits may be able to do for your team as well!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "101843752162913505882", "name": "Melissa Dienhart", "time": 1574276226175, "rating": 5.0, "text": "This company cares about its clients, members and employees.  They prove it everyday. From the top leadership on down they continue to demonstrate service and doing the right thing is a priority. The teamwork and supportive management have truly impressed me. I left a Fortune 50 company to come work at RxBenefits 6 months ago and could not be happier.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104543348183418857368", "name": "Nicole Jenkins", "time": 1573757035607, "rating": 5.0, "text": "RxBenefits truly goes above and beyond for their employees and their customers!  I have been with the company for 3 years and have never worked anywhere that could even hold a candle to RxB.  The benefits, flexibility, support from management, awesome co-workers and just the overall professional growth I have experienced are beyond comparison.  There is no doubt that I enjoy coming to work everyday and, as a bonus, we have a lot of fun too!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117578009581287823855", "name": "Lisa Shockley", "time": 1573656414408, "rating": 5.0, "text": "I have worked for 20 years in the pharmacy benefit management industry and I can truly say RxBenefits is THE best company I have worked with.  This company truly cares about making a positive difference and providing the utmost in service and industry knowledge to its' clients.  Additionally, they make it a point to take incredible care of their employees and always make us feel special and appreciated.  I am truly blessed to be a part of this organization!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115318374434999966449", "name": "Karleen Dietrich", "time": 1574172377355, "rating": 5.0, "text": "More than three years ago, I had the extreme pleasure of making the move to work at RxBenefits and I couldn't be happier. Great work environment, great colleagues, great values, and great leadership.  By far the best place to work -- and we've proven that by earning the Best Places to Work award multiple times.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104100371713648862076", "name": "mandi biershenk", "time": 1574173709864, "rating": 5.0, "text": "Having been an employee with RxBenefits for a short time, I cannot be more thankful for the team I have joined.  Upper management strives to make everyone feel important and like our jobs matter.  I truly enjoy working for such a giving company. They strive to do great things for the community as well as their employees!  I'm happy to be a part of the RxB Team!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113639809857397108180", "name": "Craig Cooper", "time": 1573509897488, "rating": 5.0, "text": "Family oriented company that provides all of the training and tools needed to succeed.  Employees are treated extremely well while hard work is recognized and appreciated.  This environment has helped build an awesome team of people that works hard to help RxBenefits deliver best-in-class service while also helping employers to control Rx spend.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109254996334425790447", "name": "Adam S b s SAE ax ex xsdedx", "time": 1573508546743, "rating": 5.0, "text": "RxBenefits is a fantastic place to work! I believe we provide a superior pharmacy solution that helps both our clients and our clients’ members. I have never been with a company with such a positive and supportive culture.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116180335229388380648", "name": "Austyn Martin", "time": 1573656108552, "rating": 5.0, "text": "I just started RxBenefits 3 months ago and it was the best decision I've ever made! The team was so helpful and welcoming. The atmosphere is so positive that I enjoy coming into work every day. I love the work our company does and the people involved!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "106796529546830216085", "name": "Luke Lombardo", "time": 1574448979354, "rating": 5.0, "text": "RxBenefits is a wonderful place to work. The environment is professional, and teamwork is encouraged. The company genuinely cares about their clients and their employees. RxBenefits offers superior service as a full-service pharmacy solutions firm. I’m proud to say I work for RxBenefits!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108504040538034592875", "name": "Rich Grote", "time": 1574451553949, "rating": 5.0, "text": "I have been in the PBM industry for over 10 years and having only worked for RxBenefits for 3 months, I can see why there are so many great reviews from employees. They have a great culture and the total team approach is what really stands out. A fantastic company to work for!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "118176332074948961647", "name": "Laura Puckett", "time": 1574097039283, "rating": 5.0, "text": "I have only very recently joined the RxBenefits team, but I have quickly learned what a wonderful company this place truly is. Though this certainly is a corporate office, I have never once felt like just another person at a desk. There is real effort made to celebrate team members as individuals, rather than just workers. RxBenefits places high importance on employee happiness, and with happier employees comes much better work.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109039131415887361347", "name": "Randy Mains", "time": 1573581990253, "rating": 5.0, "text": "The best place I've ever worked.  With 13 years PBM experience prior to joining the team I've never experienced the level of compassion, training, or focus from any other company.  They really take care of the employees and treat everyone like they're family.  Amazing place to work.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113081665562896263074", "name": "Leigh Thomas", "time": 1573506247684, "rating": 5.0, "text": "I started as a temp to permanent employee, and now I am permanent.  I really love the family atmosphere being an employee here.  The management are not only focused on profit, they are aware and actively make sure that their employees have a balance of work and life.  They don't just talk the talk, they walk the walk.  I plan to be here for the rest of my work career!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115073061426304161071", "name": "Penelope Perrigin", "time": 1574433202833, "rating": 5.0, "text": "Great Company!  Great Leadership!  Great Co-Workers!  Great Pharmacy Solution that helps both the Consultant and their Self-Insured Clients!  I am so grateful to be part of this organization!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "118430176799257222949", "name": "Jacob Ritchey", "time": 1573505649494, "rating": 5.0, "text": "Starting my role @ RxBenefits just over a year ago was the best career decision of my life. Working as an analyst for the business development team, I can see firsthand that we provide an exceptional experience for our EBC partners and their clients. Looking forward to many years to come, with this great team.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108470221096920454856", "name": "Tara Keith", "time": 1573505202129, "rating": 5.0, "text": "I just joined the RxBenefits team this year and I'm so glad that I did.  This company really appreciates their employees and makes them feel valued.  If you're looking for a new opportunity and would be proud to work for a company that believes in integrity, this is it.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116252972511858614760", "name": "Khaliha Ladd", "time": 1574178882740, "rating": 5.0, "text": "RxBenefits is an amazing place to work, a great culture! Everyone is very helpful and the company goes out of its way to show its appreciation of their employees. They provide you with the support, training and tools to be successful!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114327702706357239498", "name": "Sara Raven", "time": 1573830535731, "rating": 5.0, "text": "The RxBenefits culture is second to none and you truly feel like part of the family from day one. I was fortunate enough to become part of this team back in 2016, and it's been a refreshing experience to be a part of a team that not only promises but stands true to those promises we make to our clients and employees year after year.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104288971648909853722", "name": "Neal Parker", "time": 1573504285798, "rating": 5.0, "text": "RxBenefits is a great place to work! The company is committed to excellence for our clients, customers and employees. RxBenefits provides excellence in customer service to it's external and internal customers! It is truly a company that I would highly recommend to potential clients or to someone seeking a great employer!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102778054430434791396", "name": "Chantal Gerckens", "time": 1573655604178, "rating": 5.0, "text": "I am so excited to work for RxBenefits. Throughout my training and early days of being on board, I have found the staff and management to be very welcoming and helpful. The on boarding / training programs were so thorough and continue to be very useful. We have so many tools at our fingertips to assist our clients in trend management and cost saving opportunities. I am really looking forward to a long career at RxB!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "100489307166114292559", "name": "Kelly Dennis", "time": 1573504403317, "rating": 5.0, "text": "Proud (and lucky) to work for one of the best companies around, with some of the smartest, brightest, folks in the industry.  Love my work family and all that we do to help employers better manage their pharmacy spend while helping ensure members get the right drug at the right time!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "106599776176764169195", "name": "Mathew Davis", "time": 1574434421368, "rating": 5.0, "text": "Working at RxBenefits is awesome!  The people are energetic and motivated, the benefits are great, and everyone has a lot of fun.  Our company is growing and I'm excited about being a part of the bright future!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "111628606030516332580", "name": "Stephanie Carrozza", "time": 1574106201412, "rating": 5.0, "text": "I have been an employee at RxBenefits for 2 years, and I have had an excellent experience. The leadership team is very supportive in providing what is needed to support the success of the company and its employees. RxB has excellent benefits and perks, and is overall a very enjoyable place to work.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113883178320701599064", "name": "Jodi Monty", "time": 1574175436463, "rating": 5.0, "text": "RxBenefits is a great company to do business with! They take pride in providing the best service possible to all of their clients and members. They care deeply about their employees and that is reflected in the positive experiences clients and members can expect when working with RxBenefits.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108199581175750261099", "name": "Deondra Harris", "time": 1574171349410, "rating": 5.0, "text": "RxBenefits is the #1 job to have in Birmingham , The company is very caring towards its members and  employees. They show how much they care and how thankful they are to have us  in many different ways . Working for RxBenefits is like having a family away from home . So thankful to be apart of this great growing company..", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "103465584658301074437", "name": "Shawn Cox", "time": 1573503669819, "rating": 5.0, "text": "RxBenefits is hands down the best company I have ever worked for. Excellent salaries, excellent benefits, amazing people, and incredible leadership. I highly recommend RxBenefits as an employer and for its exceptional pharmacy benefits administration.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115150589479095692553", "name": "Mitchell Holt", "time": 1574174413084, "rating": 5.0, "text": "RxBenefits is an outstanding company.  Great work-life balance, benefits, and an unbelievable work environment with great managers that want you to succeed and grow.  Consistently ranked one of the best businesses in Birmingham to work for.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102066565730077835454", "name": "Shannyn Averyt", "time": 1574448376826, "rating": 5.0, "text": "RxBenefits is a great place to work.  I have only been here a week, but I can already tell that I have made a positive move toward a progressive career.  There is definitely room to grow in your career here and positive coworkers cheering you on to grow in which ever way you want.  I'm so glad I'm here.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117205757278530569038", "name": "Patti Gazella", "time": 1574175381297, "rating": 5.0, "text": "RxBenefits is a great place to work.  From my first day of training I felt like family.  I can't remember a time when I ever got thanked for \"choosing\" to work for a company from anyone let alone a senior executive.  Thank you RxB family for having faith in me and including me as one of your own!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "110041064657581898558", "name": "Jeffery Jones", "time": 1573570302964, "rating": 5.0, "text": "RxBenefits is a fantastic place to work!!  Watching this company grow has been exciting.  Truly an organization that cares about its employees and provides a great working environment.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115727939212634849975", "name": "Andrea Bone", "time": 1573756033966, "rating": 5.0, "text": "RxBenefits is an amazing company to work.  They truly show care, concern and respect to their employees everyday. They not only respect their employees they show that with their clients as well. Overall, this is wonderful company to work", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "112366622771115130975", "name": "Amber Hendrix", "time": 1573505964531, "rating": 5.0, "text": "RxBenefits is THE best place to work! We are treated like family here. Everyone is so nice and helpful. I cant believe I actually worked somewhere else before coming here!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117582838574958091703", "name": "June Cameron", "time": 1573598138190, "rating": 4.0, "text": "Client Service dept. is very professional and very helpful.  They were eager to assist with all my needs.  I would recommend this company to anyone.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107472745101054926845", "name": "Henry Thomas", "time": 1573500923075, "rating": 5.0, "text": "RxBenefits is a great company overall and a great place to work. This company really loves helping companies meet their goals and are constantly advocating for it's clients. I am proud to represent this company and see faces light up across the industry when I tell them this is my company. From charitable functions to pharmacy...this company gets \"it\".", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOmZfKtx6_gL-A6QYdQXljxc7XHXR7J5XOXEZ8Z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104426162768129626338", "name": "Janet Santoro", "time": 1573598070635, "rating": 5.0, "text": "This is the best company to work for!  We are very dedicated to our clients and members. We strive to provide excellent service and maintain a family friendly environment.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109055607188535541943", "name": "Chris Gilliam", "time": 1574433934130, "rating": 5.0, "text": "I have been at RxB for a year and half.  It is truly an amazing company. They care about their employees and work life balance. They continually  do what is right and not just try and make a profit. The environment is outstanding and the culture competes with anyone in Bimringham. I mean best place to work for several year by the Birmingham Business Journal.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116078268626204909031", "name": "Amanda Verschelde", "time": 1573680173422, "rating": 5.0, "text": "RxBenefits is a wonderful company to work for.  They value their employees and have the best interest of their clients in mind.  So happy to be a part of the team!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107266806196509233022", "name": "Meship Man", "time": 1573503368503, "rating": 5.0, "text": "RxBenefits is superior in service and pharmacy benefits administration. They have awesome employees and are extremely knowledgeable of the pharmacy benefits industry. Likewise, the analytics and business development teams always go above and beyond to provide consultative knowledge to their EBC partners.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "118201402480829656103", "name": "Breanna Wyatt", "time": 1573502973528, "rating": 5.0, "text": "I am an employee of RxBenefits, Inc. This company treats their employees AMAZINGLY. I have never worked at a company that cares about the well being of their employees like this. I enjoy coming to work!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "105923399468945119731", "name": "TRACIE ALTMAN", "time": 1574194093740, "rating": 5.0, "text": "I excitely started my career at RxBenefits in August 2008.   As, a young, up and coming leader in the pharmacy advisory industry,  RxBenefits was already providing stellar, ground breaking service.  Fast forward 11 years later... I am still here and just as excited. I take pride in being a part of the RxBenefits family and look forward to many more years as we contiune to grow and evolve while maintaining our core values. This is a great place to work!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114336047665995220322", "name": "Emily Bell", "time": 1574179903273, "rating": 5.0, "text": "RxBenefits was a company built on relationships, and that value has held true for over 25 years.  RxBenefits knows the value of investing in people and relationships.   I know RxBenefits cares about people by the way they treat their members, clients, business partners and employees.  As a pharmacist and healthcare professional, I am honored to be apart of an organization that cares for people by striving to keep the pharmacy benefit affordable for the community as a whole!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "103580524374795944431", "name": "Robyn Guest", "time": 1573658479099, "rating": 5.0, "text": "I have been with RxBenefits for 2&1/2 years and this was the best job move i have ever made. I love that RxBenefits truly cares about its employees and in turn we as employees care deeply about our customers and clients.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "110718167955332556326", "name": "Heather Mae", "time": 1573503496543, "rating": 5.0, "text": "I am currently an employee of this company and can say this is the best company I have worked for so far! They are a very professional yet relaxed company that creates a wonderful environment for their employees.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "111608224267772234469", "name": "Valerie C", "time": 1574443752613, "rating": 5.0, "text": "RxBenefits is a great company to work for and I am grateful and excited to be part of a company that is growing.  Our leadership believes that it is just as important to take care of its employees as it does its customers.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115143966074645281917", "name": "Sarah Knotts", "time": 1573660397816, "rating": 5.0, "text": "RxBenefits is an incredible example of what a Pharmacy Benefits Administrator could, and should be. It leads by example when it comes to quality of life and care for it's employees, and also by the all-encompassing support and quality of services that it offers to it's clients.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "118160301849328921728", "name": "Phoebe Waldrop", "time": 1573506149912, "rating": 5.0, "text": "I have been an employee with RxBenefits for 3 year this month. My Rxbenefits family has been super special and sup.portive for me and my family. I have felt the love and care since the passing of my\ndaughter a year ago. But not just that. The atmosphere the company provides is comfortable, positive and worry free with opportunity to grow and advance. I have been truly blessed to be a part of RxBenefits family", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "105616548610026778589", "name": "Katherine Hinton", "time": 1573661053321, "rating": 5.0, "text": "I have loved working for this company. As a pharmacist, I worked in a large retail chain for nearly 15 years and feared a change. It turned out to be the best decision to invigorate my passion for my field.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109437865535768128478", "name": "VANNA Zimmerman", "time": 1574433530321, "rating": 5.0, "text": "I have been an employee for 4 1/2 years, and I absolutely love what I do, the people, and the culture of this company.  They treat us as valued employees, and that is such a great trait for a company to have.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113775527082550845091", "name": "Brittany Amon", "time": 1574103857058, "rating": 5.0, "text": "Excellent work environment for both home office and remote positions! This company truly values their employees, trusts them to work hard, and fosters a sense of community even if you work from home. Thanks RxB!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104213453014934991171", "name": "Juli Arnwine", "time": 1574433428962, "rating": 5.0, "text": "I have worked for RxBenefits for 2.5 years.  I love the company!  I love the people I work with!  The leadership team honestly cares about their employees!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107158168743076012497", "name": "wyatt mccastle", "time": 1574443080680, "rating": 5.0, "text": "This is the best company I have ever worked for. Real genuine people who put all employees in a great position to succeed.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "109910134475428945024", "name": "Emily Mullinax", "time": 1573503825846, "rating": 5.0, "text": "RxBenefits is a great place to work. They are very family oriented and everyone is so nice! Love my job!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115408252275973297655", "name": "Brianne Price", "time": 1573567083255, "rating": 5.0, "text": "Have been at RxBenefits for 6 months now and have enjoyed every moment. The people in the office are always so pleasant and fun to work with.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "105704919378997829970", "name": "Sean Fant", "time": 1574435002502, "rating": 5.0, "text": "RxBenefits is a great place to to work. I am so grateful that I was able to join a company that has such a supportive and welcoming culture.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116144741108077647137", "name": "Jessie Johnson", "time": 1573656362133, "rating": 5.0, "text": "RxBenefits is a great place to work and even better partner for your pharmacy benefits! The positive influence that RxBenefit's is able to make in the market is one of a kind. I love my RxB family and coming into work every day.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114004849925831691107", "name": "kristie cornelius", "time": 1574185005063, "rating": 5.0, "text": "Awesome place to work. You cannot ask for better teammates, management and partners. This company looks out for its employee's and goes the extra mile. I could not ask for a better place to work.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108448931360990826273", "name": "Christie Battle", "time": 1573660552670, "rating": 5.0, "text": "RxBenefits is an amazing place to work!  Many perks and a great environment.  So thankful for this opportunity!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "106507041992856345912", "name": "Erin Threlkeld", "time": 1573591058704, "rating": 5.0, "text": "I have just started working here but can already tell this is a great company with great people! The culture here is amazing!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115050705674631223885", "name": "Carla Richards", "time": 1573657969067, "rating": 5.0, "text": "Working at RxBenefits has been a DREAM! It is such a fun working environment that also challenges you to become a better leader. I have nothing but fantastic things to say about RxBenefits!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113863047427273417908", "name": "Keith Sorg", "time": 1573503980153, "rating": 5.0, "text": "RxBenefits is an extremely welcoming company to work for. I've been here for just under a year, and my coworkers and company leaders are responsible, knowledgeable, and fun!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "106492282349589607988", "name": "Will Martin", "time": 1574176316890, "rating": 5.0, "text": "RxBenefits is by far the best place to work!! I really love how this family oriented company continues to amaze me with effort they put forth for all employees!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "103848218180830113309", "name": "Tender N", "time": 1573657165302, "rating": 5.0, "text": "Best company ever! Great culture, great people, and even better.. GREAT PRODUCT!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "101465012783440997885", "name": "Brandon Butler", "time": 1573504669731, "rating": 5.0, "text": "RxBenefits is a very innovative company.  The work environment is very good and everyone is very much on board with doing what is in the best interest of our customers.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "111522214137046001789", "name": "Shauna Donovan", "time": 1574097112555, "rating": 5.0, "text": "RxBenefits is forward-thinking and impactful in the marketplace.  RxBenefits is truly a wonderful place to work as well; employees are appreciated and the onboarding process is first-class.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "100695361352039396191", "name": "Melissa Brown", "time": 1573656727658, "rating": 5.0, "text": "Just started with RxB...Great experience so far with an excellent group of people. Corporate culture is very strong here, everyone cares about their role and how it impacts the bigger goals at RxB. Looking forward to learning and growing here.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108595587190665788538", "name": "Izz Noland", "time": 1500435705004, "rating": 5.0, "text": "A great company. These guys are an \"enterprise family.\" The services and assistance offered to their customers is more than exceptional, and in many cases life changing. I'm proud to be a part of this organization, helping others across the country to obtain needs prescriptions at an extraordinarily reduced cost, as well as support from within the people that make these daily miracles a reality.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115143401004672310287", "name": "Langley Kyle", "time": 1573677507859, "rating": 5.0, "text": "Great place to work.  The care about individual growth as well as ensuring that employees are happy and able to provide a high level of customer service.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104903586222962731602", "name": "Casey Capps", "time": 1573504000166, "rating": 5.0, "text": "A great place to work! Very family oriented and everybody is willing to make experiences great!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108902716831666160128", "name": "Phil Langenfeld", "time": 1573504814355, "rating": 5.0, "text": "Excellent company to work for! The culture is something other companies strive for and from top to bottom everyone is incredibly dedicated to making RxBenefits what it has become today!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113452196121561443844", "name": "Beth", "time": 1573657686794, "rating": 5.0, "text": "I was so impressed by the services I received from RxBenefits that I applied for a position with them and went to work for them.  RxBenefits is one of a kind and spectacular company!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "112274391500719690633", "name": "Alecia Cockrell", "time": 1573656149816, "rating": 5.0, "text": "I've worked at RxBenefits for right at 2 years now. It has been a rewarding experience to work in a relaxing and flexible corporate environment.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "106201752822292174472", "name": "Marsha Reynolds", "time": 1574171896047, "rating": 5.0, "text": "RxBenefits is an extremely well run organization who care as much about their employees as they do their clients!!\nA great place to work!!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "118156132585123587683", "name": "Nora Esparza", "time": 1573760084681, "rating": 5.0, "text": "RxBenefits is a great company with great people. This is a firm that cares deeply about its employees as well as their customers.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104205077356308113247", "name": "Shelby Rounds", "time": 1574178354904, "rating": 5.0, "text": "RxBenefits, Inc is a wonderful place to work offering flexibility, a great work-life balance, awesome benefits, as well as invested interest in the success of their employees.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "110525737632393937674", "name": "Ashton Slawinski", "time": 1574373553894, "rating": 5.0, "text": "An amazing company that really cares about their employees! Great place to work with great people!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "108343130222194209545", "name": "Shannon Benzinger", "time": 1574435157945, "rating": 5.0, "text": "I have been with RxBenefits 17 years in January.  This was 8 years after the company was founded by W.L. Gunnells III.  There were 3 employees when I was hired so I became number 4.  I have watched a very small company grow by leaps and bounds and I'm very proud to be a part of it.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107918267810291826510", "name": "Brittany Kedziora", "time": 1574096882456, "rating": 5.0, "text": "RxBenefits is a team of accomplished, hardworking and service oriented folks from all over the country that are dedicated to their clients and teammates.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116015465627229867075", "name": "Ashley Davis", "time": 1573503050298, "rating": 5.0, "text": "RxBenefits has the most knowledgeable Client Service team.  They are always friendly and extremely helpful.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "104670636735351151222", "name": "Ranah McSween", "time": 1574097515757, "rating": 5.0, "text": "I have been working in the pharmaceutical industry since 2005 and with RxBenefits since 2018. The company is composed of highly qualified and knowledgeable staff members who, collaboratively, are able to provide superior service in all areas of pharmacy benefits administration.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113505794974553746294", "name": "Megan Smith", "time": 1573502392267, "rating": 5.0, "text": "This is a GREAT company to work for! They are like family and go above and beyond to meet member and clients needs.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "115450503194597767413", "name": "Nathan Warner", "time": 1574172496882, "rating": 5.0, "text": "RxBenefits is a great place doing great things in Pharmacy Benefits!  Highly recommend for employment!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113937892861410616325", "name": "Jess B", "time": 1574358872624, "rating": 5.0, "text": "Amazing company and people! Everyone goes the extra mile and is friendly while doing so.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102365366845883375023", "name": "Carmen Allen", "time": 1574097681995, "rating": 5.0, "text": "This company is a great company full of great opportunities and a great company to grow with, It has truly been an honor to work for RxBenefits!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "110646890240536421183", "name": "Shrina Amin", "time": 1573655337456, "rating": 5.0, "text": "Best place I have ever worked! RxBenefits is a wonderful place to work!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102848578140410247608", "name": "Karishma Patel", "time": 1573660328481, "rating": 5.0, "text": "Best place I have ever worked! RxBenefits is a great place to work!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116644703062303288897", "name": "Huny Marie", "time": 1573656932068, "rating": 5.0, "text": "Great company with an exceptional culture fostering community, compassion, and fun! I joined the company a little over a year ago and couldn't be more happy that I did.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "111479064982570807641", "name": "Tressa Chretien", "time": 1573501071482, "rating": 5.0, "text": "Great place to work!  Great company!  Family atmosphere!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117336971077386026038", "name": "Noel Villarreal", "time": 1555085214846, "rating": 1.0, "text": "Job recently changed our benefits to this pharmacy after waiting 2 weeks and getting bullied around by the reps finally been told they are going to deny a prescription that I have been on since day 1 of my diagnosis and telling my doctor to put me on a much more inferior product that's much less Cost effective. They even are 2nd and 3rd guessing my doctor by asking them to double check my diagnosis and even asking for all my dr visit records.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102977710791862735569", "name": "Angela Becker", "time": 1564167639883, "rating": 1.0, "text": "My work recently switched to them 7/1. I tried to get my sons meds filled before the change, but it fell through. And have been trying to get them filled since which he has been put of. They are very rude and just will not listen, so decide to just annoy my dr. And pharmacy. The script got put on hold needing prior authorization first, and then they decided to finally refill it this one time  (7/22) til the issue is resolved with the doctor cause they denied it saying we needed to try other things first for a med. My son has been on for 7 months. Waiting to have problems with my other son who is on the same meds and has been for 5 years, but they won't do anything with that until his comes up due end of August but I can only refill when he's down to 7 days, but it has been over 3 weeks and can't resolve the first son.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "113594065597688067300", "name": "T.K. Murphy", "time": 1573500477086, "rating": 5.0, "text": "Wonderful place to work! It's like a big family!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114403573122333860097", "name": "Justin Collins", "time": 1574181057293, "rating": 5.0, "text": "Working at RxBenefits has been one of the better experiences in my career.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "112067456221204036940", "name": "Kim Pitts", "time": 1573500708065, "rating": 5.0, "text": "Such an awesome place to work!! Couldn’t be prouder of this company!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107129571479847396221", "name": "Ashley Aynes", "time": 1573573749374, "rating": 5.0, "text": "Family-oriented, work hard, play hard, relaxed work culture.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "114077309670632943249", "name": "Brian", "time": 1592446261327, "rating": 5.0, "text": "The company cares about their employees and the clients they service.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "116314686757726803379", "name": "Emi Nakashima", "time": 1513100003911, "rating": 1.0, "text": "Absolute worst customer service ever. The customer service representative was extremely rude and kept talking over me while I was trying to explain the situation. I have been trying to get them to help me straighten out the information in my account for 3 months and every single time I have either 1) been told they would get a supervisor, 2) told they would straighten it out but don't, 3) been hung up on and 4) told that they can't help me at all. Representatives need to get training on how to actually help people that NEED their medications.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117848337573814108630", "name": "Sarah Olia", "time": 1573660522636, "rating": 5.0, "text": "Great place to work!!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117576274246066849651", "name": "Tonya Duckett", "time": 1573506389022, "rating": 5.0, "text": "Amazing Company!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "102794172479676976861", "name": "Kelli Farmer", "time": 1574435752792, "rating": 5.0, "text": "Great place to work!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "117717034542239271567", "name": "Grant Farr", "time": 1630013817468, "rating": 1.0, "text": "Our company recently switched to RxBenefits as the company that \"dispenses\" our pharmacy benefits. Like others, notice how all the 5 star reviews are from employees, which is great, I cannot say that anytime calling customer service they were not \"kind\". However, I can say for sure that I have experienced what a LOT of others have, which is that I was taking a medication for 20 years, that is GENERIC, and they would not cover once the benefits implementation was switched to these folks. The first prior authorization was DENIED incredibly despite my doctor saying it \"doesn't seem wise or prudent\" to have to rapidly stop the medication.\n\nI am really blessed, so I could afford to pay out of pocket to fight with the company for 6 months, using coupons etc. while I got \"approval\" on a second prior auth. Again, I am blessed to have some medical knowledge, reasonable time, and afford to find other resources to pay. However, I KNOW FOR SURE that a lot of folks don't, and that this could have been catastrophic (I.e. couldn't get right meds - more PCP or heaven forbid ED visits which then just waste time at PCP/etc offices). This company advertises how \"great a workplace\" they are and they are \"saving money\" for companies, but all of these review are pretty clear HOW they are doing that. Putting up arbitrary guidelines that just waste your doctors time, your companies HR time, and frankly, the patient's time as well. Please, this company is TERRIBLE. I will be preaching against them to ANY HR meeting I'm in and will NEVER use this company again.", "pics": null, "resp": null, "gmap_id": "0x88893d4ffaac9485:0x31634e9ad56beda"}
{"user_id": "107788360140273771252", "name": "William Peacock", "time": 1620689456357, "rating": 5.0, "text": "Very 3 Antenna System for Amateur Radio USE! 73 AE4OY William Peacock EM-81UF SOUTH EAST GEORGIA", "pics": null, "resp": null, "gmap_id": "0x88891822f0c0be71:0x7402cace62ee8994"}
{"user_id": "107780845280422596659", "name": "Sherri L Lowery", "time": 1570123412157, "rating": 5.0, "text": "Wonderful... small biz expert!", "pics": null, "resp": null, "gmap_id": "0x889281a4510c5c35:0xd463a6c2e8a233c2"}
{"user_id": "106425105780147201374", "name": "Mitch Green", "time": 1613921293766, "rating": 5.0, "text": "Nathan and MJ were the best home inspectors I’ve ever seen and I’m a mortgage lender. Professional, knowledgeable, great communication, my wife and I will never work with anyone else. The follow on report was off the charts thorough, with detailed descriptions and photos, which allowed us to move quickly with he contractor to get repairs done before listing our house. These folks do everything the right way.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "106367515287060539592", "name": "Taylor Lybarger", "time": 1612237687663, "rating": 5.0, "text": "Nathan has done many home inspections for me, my family and the clients I work with!  He is extremely thorough and catches things that most inspectors don’t take the time to inspect!  I recommend Huntsville Home Inspection to all of my friends, family and clients!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "108921196283171812725", "name": "Jeremy Porto", "time": 1611756387228, "rating": 5.0, "text": "Nathan at HHI has been great to work with.  He’s now inspected 6 properties for me, one of which was a 40 unit apartment!  In one instance he pointed out some seriously deficient systems which led me to cancel the contract and save a ton of money.\n\nAs a person, Nathan is respectful, professional and truly wants to help you.  He explains all of his findings and makes himself available to answer questions.\n\nForget this review and just consider that I’ve used him 6 times!  You don’t do that unless they’re good.  I highly recommend Nathan at HHI!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "115579206153261332679", "name": "Brandon Price", "time": 1611716574492, "rating": 5.0, "text": "HHI is incredibly detailed, responsive and will provide a trustworthy assessment of your interested property. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "105853197924127183398", "name": "Danny Blalock", "time": 1611157577389, "rating": 5.0, "text": "It feels Great to Have Someone speak honestly.\nI recommend that You Consider Huntsville Home Inspection for Your Next Home Inspection.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "118050249585712961585", "name": "Ben Nemec", "time": 1611243251157, "rating": 5.0, "text": "I have personally used and referred clients to Nathan and his team many times. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "106604306646270343143", "name": "Zach Walker (The Bearded Realtor)", "time": 1601138781676, "rating": 5.0, "text": "Nathan is far and away the best inspector I’ve ever used. I’ve listed and sold, purchased, and used many inspectors in my career and in my personal life, and to this day, I’ve never had a more thorough inspection priced so reasonably. He is a man of integrity and character and you can’t go wrong using HHI", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "108916790262456101915", "name": "Jonathan Dunwoody", "time": 1595335990981, "rating": 5.0, "text": "I cannot speak highly enough of Nathan Goldsmith.  We had a contractor really mess up a ton of work at our house and didn't catch it until he was on his way out with a very large sum of my money.  Nathan went out of his way to Somerville to check on it for us having never met us.   Nathan did a very thorough inspection for us in a timely manner!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "114051751503497811674", "name": "Morgan Hartman", "time": 1567013625787, "rating": 5.0, "text": "Nathan provided our family with a very thorough and detailed home inspection. He goes above and beyond to even point out cosmetic flaws in the home as well. He Is very honest, reliable and professional at what he does. Very friendly and will definitely recommend anyone to him.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "100104519966196013451", "name": "Mark Morrison", "time": 1578747175762, "rating": 5.0, "text": "One of the best in the business. Awesome response time to the customer and just really cares about you and your home. Highly recommend HHI!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "109744727335045730832", "name": "DJ Jennings", "time": 1553983517665, "rating": 5.0, "text": "I highly recommend Nathan to anyone looking for an inspector. He has done multiple inspections for me and my family and he has always been very thorough and honest with us. He took the time to walk me through each finding and helped me understand the reasoning. Top notch and very professional, you can’t go wrong!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "107667774277810944570", "name": "Dustin Shannon", "time": 1572659342988, "rating": 5.0, "text": "Nathan is the best inspector in Town! I highly recommend him. Even after we closed on our house, he was still involved with helping us with repairs or suggesting local businesses. He is #1!!!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "101528828390005220169", "name": "Dakota DeLuca", "time": 1571932214477, "rating": 5.0, "text": "Choose Huntsville Home Inspection on your next real estate transaction! Nathan's experience in the industry shows. His attention to detail and home knowledge is superb. An excellent and easy to read report was delivered in a very timely manner! Thanks Nathan and HHI!!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "104569481022203069908", "name": "Susan Rogers", "time": 1566966863233, "rating": 5.0, "text": "Nathan was very thorough with his home inspection. He was very informative and gave me valuable advice. He was professional and at the same time, personable. I would recommend him and his services to anyone.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "110948454295106343945", "name": "Blake Ellis", "time": 1554561719825, "rating": 5.0, "text": "I couldn't recommend Nathan and Huntsville Home Inspection enough! Nathan was on time, professional, and made the inspection process really enjoyable. The report he completed was super detailed with pictures and good explanations. I will be recommending him to anyone I know needing an inspection and he will be the first I call when I need another one again.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "112770991358777700735", "name": "Kareen Smith", "time": 1575426461136, "rating": 5.0, "text": "My husband and I came across HHI (Nathan Goldsmith) when we were selling our house in Five Points. So believe it or not, we were the seller and he was the home inspector for the buyer! During that selling process, I noticed his reports were so thorough that I kept his report for the house we sold and then hired him as our inspector for our new house! His inspection report was thorough and we even requested  a re-inspection  which revealed that our builder’s foreman did not complete all the repairs identified in the report.\n\nWe are so grateful for the work HHI (Nathan Goldsmith) has performed for us. Full transparency, timeliness, value, and great customer service. If you want to be able to sleep at night because you want to feel SECURE in the purchase of your home, have your home inspected by Huntsville Home Inspection.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "108005108254220113442", "name": "Amanda Thompson", "time": 1539891861065, "rating": 5.0, "text": "Nathan is very thorough when it comes to the inspections. I've used him for 2 inspections and he went through everything in both houses! No stone was left unturned. The report was easy to read and had it to me within 24 hours. I highly recommend him to anyone who is looking for an inspector.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "103766182338440223087", "name": "Chris Young, Realtor", "time": 1539654496355, "rating": 5.0, "text": "Nathan made the scheduling process very easy and provided a quick turnaround time in making the inspection report available. The report was very detailed and easy to read. Nathan was easy to reach and very responsive to my clients questions. Nathan is a consummate professional and I would highly recommend Huntsville Home Inspection to anyone looking for a professional and knowledgeable home inspector!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "115314120024800922523", "name": "Kelly McCarthy", "time": 1559682596773, "rating": 5.0, "text": "Nathan was thorough, professional, timely, and patient in our home inspection experience.\n\nHome buying situations can be very stressful in a “buyer beware” state, and it can feel like no parties involved have your best interest in mind as they push for a sale, but Nathan was an exception as he seemed dedicated to providing a thorough and unbiased report on the house.\n\nWould absolutely recommend for those who want to know the house they are buying!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "116104793687889969141", "name": "Victoria Anderson", "time": 1540267618418, "rating": 5.0, "text": "Nathan was fantastic to work with! He was able to fit us in his schedule quickly and did a thorough job on our home inspection. I can’t recommend him enough!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "104324745848282382754", "name": "Will Ansley", "time": 1547490177633, "rating": 5.0, "text": "Great experience. Would highly recommend and would use again. Nathan at HHI is knowledgeable and thorough in all areas. He puts in the time and effort for his customers, which is much appreciated when making a property investment.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "118350998183386692695", "name": "Shawn Douglas", "time": 1571326058766, "rating": 5.0, "text": "We’re very happy we used Nathan. He was very knowledgeable and gave us great information.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "113069423342200444657", "name": "CJ Whiteaker", "time": 1541633339363, "rating": 5.0, "text": "Nathan is amazing.  He did a thorough analysis of our home and communicated with us in a very professional and straight forward way.  We will totally use him again for any home inspections in the future.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "104620214457530084471", "name": "andy “warlockofguitar” miller", "time": 1554076557990, "rating": 5.0, "text": "A1 service! Well mannered, punctual, and affordable! I will definitely be using this home inspection service for all my properties inspection needs.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "103791775785009080898", "name": "Jason Page", "time": 1566863552763, "rating": 5.0, "text": "A+ Service, Nathan was super professional. I would highly recommend to friends, family, or anyone else in need of a home inspection.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "100693948739569084657", "name": "Aaron Anderson", "time": 1547467816432, "rating": 5.0, "text": "Great Service, very prompt and informative. Knowing that Nathan has been in realestate, residential construction, and now home inspection-ist was a no-brainer for us. And we were not dissapointed in the least bit. Very thorough!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "104507210720649186369", "name": "Rickey Winsett", "time": 1556910556876, "rating": 5.0, "text": "Services were prompt and Huntsville Home Inspection showed up on time and did the job right. I would definitely recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "117892771409449669835", "name": "Tim Nightengale", "time": 1571226924661, "rating": 5.0, "text": "Very knowledgeable and thorough.", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "117893245673265749628", "name": "Taylor Petty", "time": 1554168393583, "rating": 5.0, "text": "Great work!", "pics": null, "resp": null, "gmap_id": "0x88621bd0c90e1269:0xa4c8c7b9dd15f5e2"}
{"user_id": "107611519782519868772", "name": "Carmen Williamson", "time": 1579542315444, "rating": 5.0, "text": "Great service, courtesy, very informative on all questions that I had", "pics": null, "resp": null, "gmap_id": "0x88626b404c195555:0xb1bfedfde2934751"}
{"user_id": "105588510705567563559", "name": "Vicki Morris", "time": 1629080444432, "rating": 5.0, "text": "This team is very knowledgeable about cyber security, and they are dedicated to sharing their insight with the entrepreneurial community. The company’s CEO, Jamie Miller, very graciously volunteers his time by delivering informative and engaging seminars for our technology focused networking group, RISE. We highly recommend the Mission Multiplier team.\n\n-Vicki Morris for R.I.S.E.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107034948609897467895", "name": "Nisheeth Agrawal", "time": 1629126811414, "rating": 5.0, "text": "Mission Multiplier is an outstanding company providing great service in our community and nationally. Jamie Miller is always willing to step up to promote security in our community. He takes time to listen to his customers and provides the best solution.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100147647911267833947", "name": "Matthew Lewis", "time": 1629120635377, "rating": 5.0, "text": "Mission Multiplier has been a wonderful company to work for. I have worked for them for the past nine months, and it has been an absolute pleasure. Jamie Miller, the CEO, goes above and beyond in every way imaginable. He has been a crucial part in helping me grow in my role at Mission Multiplier, and is dedicated to providing for the needs of his customers.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115386005592007264164", "name": "K Lamb", "time": 1629131235070, "rating": 5.0, "text": "Mission Multiplier provided outstanding Cybersecurity and Risk Management support to our team supporting NASA - Marshall Space Flight Center. The Mission Multiplier teammates were very professional, engaged in continuous learning and supporting the client's mission.\n\nJamie Miller is a people-first leader and has what it takes to recruit, train, and equip professionals to support a wide array or client engagements. I would also recommend taking a look at their MARS Suite product for providing a clear picture of Cybersecurity status and Risk Posture.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107309222857998095217", "name": "Rish Wood", "time": 1629059024680, "rating": 5.0, "text": "I have never seen such security capabilities in one sensor. My colleagues in cyber are going to hear about Mission Multiplier’s network security product. It is outstanding, period.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "112443048352261387274", "name": "Adam Stephens", "time": 1618336813221, "rating": 5.0, "text": "I don’t know that you can find a finer guy than Jamie Miller anywhere in Huntsville... as dedicated a leader as I’ve ever encountered. You can absolutely trust that Jamie and his team at Mission Multiplier will stop at nothing to make sure you’re cyber-secure. You can sleep easy at night when you’ve got them watching your back.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "101422040376000709528", "name": "John Reed", "time": 1618335805695, "rating": 5.0, "text": "I have had the privilege of working with Jamie Miller and his team for the past couple of years. I have been extremely impressed with their team dynamics and collaborative approach as they develop products and solutions pertaining to everything Cyber Security. I am looking forward to continuing to work with them now and in the future.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115821787009983001468", "name": "Tina Cerullo", "time": 1618404602963, "rating": 5.0, "text": "Mission Multiplier has been one of the best companies I have had the pleasure to work with over the past 4 years. From the business/financial side, they have always been very professional, responsive and helpful in all aspects of the job. I look forward to a continuing relationship!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111573835021358067377", "name": "Lea Cahoon", "time": 1618499670907, "rating": 5.0, "text": "Mission Multiplier is a very professional and knowledgeable company. Jamie Miller is a stand up guy and leads his team exceptionally!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106652511385302327972", "name": "Ben Denton", "time": 1618435031942, "rating": 5.0, "text": "Really great company with top leadership. Love that they give back to the community!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106390971567146577509", "name": "Mav Rick", "time": 1621608659231, "rating": 5.0, "text": "Very professional and highly capable company with friendly and caring staff. Love doing business with this team.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105361346575269195956", "name": "Lenny Aupperlee", "time": 1613755986432, "rating": 5.0, "text": "In working with Mission Multiplier the level of professionalism and responsiveness was outstanding. They are a go to partner with regards to their work ethics and being able to deliver mission critical solutions.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104227466060819868886", "name": "Brian Lynn", "time": 1598474852149, "rating": 5.0, "text": "Great company!  A team that really believes in what they do.  Mission Multiplier’s team of professionals are always a pleasure to work and collaborate with. I have personally worked with Mission Multiplier on several projects and can confirm first-hand that their dedication, professionalism, and their ability to understand the challenges and develop top-notch innovative solutions is outstanding. I highly recommend Mission Multiplier and look forward to working with the Mission Multiplier team on future projects.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115813992793843123901", "name": "Cassie B", "time": 1618410925171, "rating": 5.0, "text": "Fantastic company. Great people to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "114914613716128112436", "name": "Kevin Repa", "time": 1599065566427, "rating": 5.0, "text": "Mission Multiplier is at the forefront of cybersecurity and great company to work with.  Jamie has built an outstanding team and innovative technologies that can help customers protect their data and systems. In addition, the company is all about ‘giving back’ by contributing to and supporting various local non-profit organizations.  An outstanding company in all respects.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100020360387591352619", "name": "Steven Lloyd", "time": 1598448174353, "rating": 5.0, "text": "The business relationship that has developed between Mission Multiplier and All Points is outstanding. I have had the great opportunity to work very closely with Jamie and his team, witness the phenomenal growth and progress that they have made as a business, and as key member of the community.  Mission Multiplier provides an excellent model of how a small business can make huge impacts!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "109110372081978288489", "name": "Josh Daniels", "time": 1604350658076, "rating": 5.0, "text": "Mission Multiplier is a global business that operates with integrity and a focus of improving the quality of life for its community's stakeholders.  The shadow that its CEO, Jamie Miller,  casts is one of excellence, cultural competence and an innovative spirit which results in an exemplary team and customer focused operations.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107434482445402861371", "name": "David Lefort", "time": 1596829264210, "rating": 5.0, "text": "I've known Mission Multiplier's CEO, Jamie Miller, for more than 20 years, and I find him to be among the most ethical and innovative businessmen I've ever met. He's spoken multiple times at Compliance Week's keystone conference for senior compliance and cybersecurity professionals and is truly a subject matter expert. I also love that his company is made up of employees who have a stake in the success of the venture ... that's what makes it a special organization.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "114624720189605792688", "name": "Johnny Hall", "time": 1596720432128, "rating": 5.0, "text": "The team at Mission Multiplier is top notch. They are cybersecurity experts in every aspect. In addition, they are forward leaning in innovations and a highly professional organization. All members of the team are personally committed to excellence and helping their clients be as successful as possible. We at All Points are working with MM on a regular basis and we are finding new customers and expanding current work at NASA and DOD. They are a leader in Huntsville and in the cyber field at large.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105661008013919425625", "name": "Leigh Ann Pierce", "time": 1604527598185, "rating": 5.0, "text": "I've watched the growth of Mission Multiplier since its inception and witnessed the hard work Jamie and his team perform daily.  Jamie and his team are dedicated, knowledgeable and passionate about the service they provide.  Great company to work with!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115462152938497558145", "name": "Courtney Langham", "time": 1598891357455, "rating": 5.0, "text": "Mission Multiplier is one of the best companies that I have worked for.  I have had the pleasure to work for Jamie Miller over the last 4+ years and have witnessed his growth and professionalism first hand.  His style of leadership is second to none and the Mission Multiplier team members mirrors his dedication to satisfying the needs of his business partners.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102954863842082229154", "name": "Juliet Fletcher", "time": 1596804152192, "rating": 5.0, "text": "What a super team to work with! Mission Multiplier's team of experts makes easy work of solving dynamic and complex cybersecurity problems and challenges. Jamie and his team are dedicated, hard working, innovative, and a pleasure to collaborate with. Their understanding of the challenges faced by businesses trying to protect their assets is grounded in their experience and knowledge. I highly recommend Mission Multiplier.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115121401893760241564", "name": "Brandon Artis", "time": 1604423826601, "rating": 5.0, "text": "Mission Multiplier is an incredible company to work for, very professional and responsive. They are charitable and very involved with the community. 11/10 would recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104685810161965618184", "name": "Ken Phillips", "time": 1618344966537, "rating": 5.0, "text": "Mission Multiplier is an outstanding company that is doing exceptional work for the federal government.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111911850492135989832", "name": "Chase Hall", "time": 1604441824667, "rating": 5.0, "text": "Mission Multiplier has been an exceptional company and has been willing to step out and help its community and other businesses. I would highly recommend working with them!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "110221625988003991158", "name": "Morgan Thomas", "time": 1594394172906, "rating": 5.0, "text": "Working with Mission Multiplier was a great experience. The whole team was professional, friendly, and knowledgeable. The time spent working with them included a welcoming atmosphere and an inviting company culture. Couldn’t recommend them more!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100805439980606406650", "name": "Mike Johnston", "time": 1596729951868, "rating": 5.0, "text": "The team and leadership at Mission Multiplier is outstanding.  They have skills and expertise to meet every need, and they provide innovative solutions.  They are also very invested in their community, and they support other businesses in many creative ways.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111926026178591566929", "name": "Kraig Tersigni", "time": 1584116665433, "rating": 5.0, "text": "The work available at Mission Multiplier is constantly challenging and evolving. This type of environment has open so many doors for me to grow professionally. I can't thank Jamie Miller and all my co-workers enough for giving me the opportunity take my career to the next level. It has been an exciting ride and I continue to look ahead to the future of what Mission Multiplier has in store.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108006492431977914738", "name": "Raymond Corriveau", "time": 1596748693533, "rating": 5.0, "text": "I have found the team at Mission Multiplier to be extremely professional and responsive. The take great care in their work and are dedicated to delivering quality products and services. Highly recommended...", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "101675083957324330607", "name": "Adam Hays", "time": 1604352843911, "rating": 5.0, "text": "Amazing company!  Mission Multiplier is constantly working towards the betterment of the industry they work in, the employees they truly care for, and most importantly, the community around them!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115182799090202321225", "name": "Jason Dinkins", "time": 1586611937900, "rating": 5.0, "text": "I've had the pleasure to work along side of these folks for many years.  Their focus and ability to deliver are second to none.  The Saturn-i VPN solution is the best I have ever used and the implementation has allowed seamless access to remote systems.  Their people are top notch and very professional.  I highly recommend Mission Multiplier because of their focused approach on delivering capable solutions for a wide range of needs.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115508867016190110542", "name": "Leigh Christian", "time": 1594728296620, "rating": 5.0, "text": "Mission Multiplier is one of the top companies I know providing Cyber Security Services!  They are also a treasured member of our community and so supportive of many organizations!  They give back to their community and are servant leaders!  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105275735919737857603", "name": "Christy Sanders", "time": 1597263158290, "rating": 5.0, "text": "Mission Multiplier's team is top notch.  They are professional and spend the one on one time that is needed to get a quality product across the board.  EvoTech is thankful for Mission Multiplier's teamwork mentality and excellent product!", "pics": null, "resp": {"time": 1597356753180, "text": "Thank you so much Christy for your kind words.  We really enjoyed working with you and the entire team at EvoTech"}, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "112485836100709309518", "name": "Mark Wensyel", "time": 1604349162238, "rating": 5.0, "text": "Mission Multiplier is a fantastic Cyber Small Business.  The Company has innovative ideas and great community involvement.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105639643052520706886", "name": "Britt Snyder", "time": 1598528884233, "rating": 5.0, "text": "What a super team to work with! Mission Multiplier's team of experts makes easy work of solving dynamic and complex cyber security problems and challenges. The entire team is amazing to work with and the products that have been produced are top level and work just as they say", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116236475828112441008", "name": "Tracey Fagan", "time": 1598453280122, "rating": 5.0, "text": "Mission Multiplier is a very dedicated Hub Zone business in Huntsville. Jamie Miller and his team are very talented in the field of Cyber Security. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104122571866247163873", "name": "Red Sage", "time": 1598541991708, "rating": 5.0, "text": "Mission Multiplier is a wonderful company in Huntsville providing innovative cyber technology solutions. The company's leadership is forward-thinking and very involved in community organizations with a focus on cyber.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105470210020756214533", "name": "Peter Lenzner", "time": 1586532783998, "rating": 5.0, "text": "Mission Multiplier is a terrific company.  They provide comprehensive cybersecurity services that protect mission critical systems and data through powerful data analytics capabilities to ensure the Government’s assets and networks provide the highest level of security for their users and data.  Jamie Miller is innovative technical masterpiece and exceptional leader.  I am happy to give them a well deserving recommendation.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "104052476331788469934", "name": "Deanna Justice", "time": 1591235604439, "rating": 5.0, "text": "In my 18+ years in the Security Industry, Mission Multiplier is hands down, one of the best Cyber Security groups I've had the pleasure to work with. Professional, knowledgeable, and always ahead of the curve. Jamie Miller has built an impressive cross-functional team.", "pics": null, "resp": {"time": 1591239769485, "text": "Thank you for your kind words Deanna.  It is really our pleasure to work with exceptional clients like yourself!"}, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116486151308994962919", "name": "Jimmy Kilgore", "time": 1587659207126, "rating": 5.0, "text": "In my 20 years of working in the private sector, Mission Multiplier has been the absolute best of the companies to have worked for. It is almost more like a family business than a corporation. To have been selected to become part of the team was truly a blessing.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "117359512879696216468", "name": "Judy Hobbs", "time": 1598969626409, "rating": 5.0, "text": "Love working with the Mission Multiplier Team. They go above and beyond to help and contribute to any job at hand. Jamie and the Mission Multiplier team do it all with professionalism and positive attitudes.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "110525242526831374560", "name": "John Degory", "time": 1590503646851, "rating": 5.0, "text": "I am very impressed with the Mission Multiplier team and pleased to be part of in my consulting role.  Having worked with many technology companies I am impressed with the talent and how the team collaborates allowing for the best of class solutions and products to be developed.  Engaging the customer or end-user early on, as part of their process,  also offers a collaboration that is directly reflected in all end products.  I look forward to our ongoing relationship with the team as we grow the company and our product offerings.\n\nJohn Degory\nFounding Partner\nJD Technology Solutions, LLC", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100159929200308907103", "name": "Richard L Nichols", "time": 1590505084111, "rating": 5.0, "text": "I've had the pleasure to work along side of these the employees of MI for many years.  They are focused and deliver quality work.  MI's employees are always professional and helpful.  I recommend Mission Multiplier their ability to deliver and focus on customer service.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "103884259181861421054", "name": "Ed Scarborough", "time": 1598624014599, "rating": 5.0, "text": "Mission Multiplier is truly a small business having a large impact to the enterprise security of today's companies and our Government. New technology insertion into today's environments is the \"Mission\" in Mission Multiplier.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108698600039796280056", "name": "Justin Pierce", "time": 1582857188970, "rating": 5.0, "text": "If you live in Huntsville, AL, and your field is cybersecurity, you must consider a career at Mission Multiplier. Barring their many awards as a company, most recently the 2019 Technology Business of the year, and their mission to give back to the community, what truly stands out is how much they care about their employees. In short, no glass ceilings, great benefits, and genuine care for how you want to develop in one of the fastest-growing fields in the world.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "118046262530881075371", "name": "Gabby Harris", "time": 1583779322066, "rating": 5.0, "text": "Mission Multiplier is an amazing company to work for. Since the beginning of my career with company they are family oriented and care about what you are passionate about. If you're looking for a career job and a great company to call home, I certainly suggest reaching out to the Mission Multiplier team!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108813009603894737773", "name": "Brandon Dean", "time": 1582911694026, "rating": 5.0, "text": "Mission Multiplier has been a great company to work for since the very beginning. I've watched the team grow and the company provide fantastic cybersecurity services and tools to all sorts of clients. I'm excited to see where the company goes in the years to come.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116541440182652464678", "name": "Jarrod Hardy", "time": 1604937679235, "rating": 5.0, "text": "Mission Multiplier is a great role modle and we're lucky to have them in the Huntsville area.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "116329681049260098404", "name": "Gaines Gravlee", "time": 1596809229014, "rating": 5.0, "text": "The MM Team are not only the premier cybersecurity experts but they are committed to excellence in every aspect of the organization.  Whether your requirements include CMMC, DFARS, RMF, HIPPA, etc. their focus on client success and professionalism is unmatched.  They are knowledgeable and innovative and have become a key business partner for our company.  You also can’t help but be drawn to Jamie’s vision and passion for cybersecurity and the thoughtful way he has structured community support within the company.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "108422692653406740512", "name": "Jim Miller", "time": 1582862490627, "rating": 5.0, "text": "Mission Multiplier has an outstanding team of cyber security professionals who are experts in this extremely critical industry. The company is well managed and provides valuable solutions to its customers within a highly ethical and comprehensive framework.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "109093037398670914360", "name": "K C", "time": 1598899949958, "rating": 5.0, "text": "Mission Multiplier have talented cyber security professionals that are dedicated to meet their customers needs.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106064574543880202430", "name": "Melissa Burgee", "time": 1586533583625, "rating": 5.0, "text": "I've worked with Jamie Miller and Mission Multiplier's team for several year's.  It has always been a pleasure working with a professional and capable company!  I look forward to our future association in the upcoming years!!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "101995092516293238382", "name": "Cameron Case", "time": 1590501409639, "rating": 5.0, "text": "Some of the most professional and capable people I have had the pleasure to work with. They are HIGHLY responsive to customer needs and requests.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100129316811665578286", "name": "Cam Bob", "time": 1590435713422, "rating": 5.0, "text": "We work with Mission Multiplier, who provide comprehensive cybersecurity services that protect mission critical systems and data through powerful analytics tools.  I highly recommend this company", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102381540003066152701", "name": "G “Big Kahuna” S", "time": 1586532819437, "rating": 5.0, "text": "I have known Jamie Miller for over 5 years and he has brought together a team of top notch professionals who fully understand cybersecurity and the challenges this creates for our customers and country.  You can guarantee Jamie is on email 24/7, I don't think he ever sleeps.  Highly recommend Mission Multiplier and team for your cybersecurity needs.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111256029775558964189", "name": "Kevin Brown", "time": 1586534282661, "rating": 5.0, "text": "Mission Multiplier has been an tremendous business partner. Their expertise in cybersecurity technology and incredible work ethic has repeatedly proven invaluable in pursuit of business growth opportunities.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115891706930956686301", "name": "Kurt Weidenthal", "time": 1586541123962, "rating": 5.0, "text": "Our cyber focused mentor-protégé relationship has set a phenomenal standard for all of DOD and NASA....thanks to Jamie and his dedicated team!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115134988410600263076", "name": "Maggy Floeter", "time": 1590500659112, "rating": 5.0, "text": "Mission Multiplier is a premier IT CyberSecurity company that brings best practices and a unique approach to protecting its customers from IT vulnerabilities. Their repeatable QC and review procedures ensure that they always meet and often exceed our expectations. As a subcontractor on our MITS II contract, MM deployed two in-house developed cyber security tools at NASA’s Marshall Space Flight Center, the MARS (Monitoring, Assessment, Reporting, and Security) Box and MI:COP (Common Operating Picture). These tools have been a huge boon to MSFC and are currently being looked at by the entire NASA Agency for Agency-wide deployment! I highly recommend Mission Multiplier!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "115011104568754280274", "name": "Katy Standridge", "time": 1594232446950, "rating": 5.0, "text": "Excellent company, super friendly staff!!!! Staff is very hard working.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "100967285339909682533", "name": "Jason Hough", "time": 1585162276534, "rating": 5.0, "text": "Highly professional and knowledgeable team of cyber security experts.  If you are in need of a tool or service in order to enhance your cyber security poster or ensure compliance with new government requirements (RMF, CMMC, HIPAA, FINRA, etc.) This is your one stop shop for everything Cyber Security related. If you are a company that is trying to allow your employees to telework during these trying times, and are having issues making that happen, not only easily for your employees but also keeping security in mind for your proprietary information the Mission Multiplier Saturn-i appliance is definitely something to look at. It can build a complete ruleset around remote access, allowing your employees to telework with ease while make sure they keep themselves as well as your company safe while doing so....", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "113678186266750226379", "name": "Hunter Bullard", "time": 1594251046152, "rating": 5.0, "text": "Great company. Full of a lot of hard workers.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "113498735454160329746", "name": "Debra Lynn Doty", "time": 1594239509777, "rating": 5.0, "text": ".Great company. Really hard workers.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "114601049847260073509", "name": "Anna Ferry", "time": 1557174388080, "rating": 5.0, "text": "Mission Multiplier is so helpful! Patrick provided me with excellent customer service and I look forward to working with them in the future!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "107139307274664481069", "name": "Island Hunter", "time": 1596803025234, "rating": 5.0, "text": "Had the pleasure of working with Jamie Miller and his team for the past couple years. Mission Multiplier is the \"Go-To\" company for Cyber Security tools and services.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "106899825025236378278", "name": "Rod Doty", "time": 1594306325322, "rating": 5.0, "text": "Wonderful company and extremely dedicated staff.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105926169102465331697", "name": "Chris Hutto", "time": 1533653880524, "rating": 5.0, "text": "The MARS Box provides all the benefits of an ISSO in a small, affordable package.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105374878322647140500", "name": "Camron Pourhassani", "time": 1530039151974, "rating": 5.0, "text": "If you need RMF, DFARS, or any other assistance related to Cybersecurity, without a doubt, the best company to do it!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102485918336474571389", "name": "SUSAN BRANHAM", "time": 1594254454513, "rating": 5.0, "text": "Great company with awesome employees", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "109467883444169988256", "name": "Joshua Doty", "time": 1594342701752, "rating": 5.0, "text": "The Staff is wonderful.", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "105660360200543724566", "name": "pam pinyan", "time": 1594148735060, "rating": 5.0, "text": "Very good company", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "111124611826151840654", "name": "Noah Pinyan", "time": 1527620541962, "rating": 5.0, "text": "There is no better organization to do business with than Mission Multiplier!", "pics": null, "resp": null, "gmap_id": "0x88626b54112765db:0x2c6143675051d913"}
{"user_id": "102285025872117436620", "name": "Amy Adkins", "time": 1498498385959, "rating": 5.0, "text": "Scott Jones d/b/a Jones is Thirsty is fantastic and knowledgeable of extremely good wines at very reasonable prices.  He has worked our annual fundraiser for United Way of Alabama for the past two years.  I would highly recommend Scott Jones for a private wine tasting at your home with guests, or a large fundraiser.   We have always had a good turnout, with money left to donate!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNENbHzILXeUgwwStYNji6_OdNDax20q7AOKf71=w150-h150-k-no-p"]}], "resp": {"time": 1498567267698, "text": "Thanks, Amy! I appreciate the kind words...and for the opportunity to partner with awesome organizations like United Way of Alabama to do my part in giving back to the Birmingham community."}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "116722354746811582342", "name": "Sally French", "time": 1531493976373, "rating": 5.0, "text": "I went to one of Scott's classes this week and he did an exceptional job! The class was very fun and informative. The no-snobbery education made a comfortable atmosphere for discussion and questions. I was pleased to find all of the wines we tasted at my grocery store without any issue and they were all within my price range! I would definitely recommend one of Scott's classes to anyone wanting a fun and laid-back wine tasting experience!", "pics": null, "resp": {"time": 1531494802023, "text": "So glad to hear you enjoyed the education/tasting session! I appreciate the kind words and good thoughts."}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "106142074257908578623", "name": "Marilyn Lindsey", "time": 1498490193739, "rating": 5.0, "text": "I have participated in two different wine tasting events with Scott - one with friends and one with co-workers at a holiday party.  Both events have been absolutely AWESOME.  Scott shares his immeasurable knowledge of the wines during the tasting and it takes the whole experience to another level.  Highly Recommend!!!", "pics": null, "resp": {"time": 1498567190456, "text": "Thanks, Marilyn! I appreciate the kind words!"}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "111966465672028454461", "name": "Brent Fuhrman", "time": 1498308229729, "rating": 5.0, "text": "His wine knowledge is impressive but his ability to translate that knowledge is what sets him apart!", "pics": null, "resp": {"time": 1498317076838, "text": "Thanks for the kind words and good thoughts, Brent! Working hard to spread the No-Snobbery doctrine in Birmingham and Nashville!"}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "106704138335131588495", "name": "Bryan McAllister", "time": 1610814769764, "rating": 5.0, "text": "I found Echo Six, when looking for a dealer for the D Dupleks ammo.  As their website directed, I called.  Left a voice mail, and within a day, someone called me back.  He was friendly, and polite.  They had the shells I wanted, and shipped them out as promised.  Prompt delivery.  Very pleased.  These are difficult slugs to find.", "pics": null, "resp": null, "gmap_id": "0x8862690851b2e6a7:0xb9edb6230c2fa25a"}
{"user_id": "118105324242668957906", "name": "GOLDBULLIONTREASURES", "time": 1546519104383, "rating": 5.0, "text": "Just checking out the Christmas lights in this housing development.", "pics": null, "resp": null, "gmap_id": "0x8862690851b2e6a7:0xb9edb6230c2fa25a"}
{"user_id": "116518812338804976510", "name": "Ashaduzzaman suvo", "time": 1581264220618, "rating": 5.0, "text": "Woesome", "pics": null, "resp": null, "gmap_id": "0x889a4d13122c6353:0xec2e0cab4673d367"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1552860833604, "rating": 1.0, "text": "💀💀💀", "pics": null, "resp": null, "gmap_id": "0x889a4d13122c6353:0xec2e0cab4673d367"}
{"user_id": "106483366370668904230", "name": "Georgia Patterson", "time": 1544151534739, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x888e8034c52fffff:0x47dcd7bb982d9ee4"}
{"user_id": "103681007746796562672", "name": "Debra Smith", "time": 1612220132866, "rating": 5.0, "text": "The Quickbooks product is excellent and we have received excellent service from Chris.  Chris has been a huge asset from purchase to install. We have multi-stores and his expertise in our field as been so beneficial. I would highly recommend Chris to anyone and anywhere in the county. Thanks for all your great support Chris.", "pics": null, "resp": {"time": 1612273428439, "text": "Debra, thank so much for the review!  We at Barons' love Chris too...great guy personally AND professionally!  SO glad you had a GREAT experience! Please let us know how we can serve you in the future!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115184016981435573311", "name": "Karen Sherman", "time": 1548282187470, "rating": 5.0, "text": "Barons' INC has helped me on my three businesses over the past five years. I feel they were indispensable when is came to setting up the books for one of the new ventures. Also,  I had my credit card machines purchased through them and they did a wonderful job with managing that for me.\nThese people are reliable, prompt, professional, and very informed.\nI trust them.", "pics": null, "resp": {"time": 1548288790924, "text": "You're AWESOME Karen, NOT just our customer, but our friend! Always a pleasure to work with you! Thank you SO MUCH for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117068110860688416954", "name": "sherry ramsey", "time": 1568382780678, "rating": 5.0, "text": "They are hands down the number one Quick Books and accounting firm of all times.  I have never worked with anyone so knowledgeable and easy to work with in all my years.  Very satisfied customer!", "pics": null, "resp": {"time": 1577827863036, "text": "Wow Sherry, thank you so much for the rave review."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100173678078828747649", "name": "Nhat Truong", "time": 1549393903872, "rating": 5.0, "text": "Very knowledgeable, excellent communication. Brandon goes the extra mile to get things accomplished. I’ve been working with him to bring value to his clients, but he has in turn provided me exceptional value. I definitely recommend his expertise in all realms of Intuit Products.", "pics": null, "resp": {"time": 1553713989445, "text": "Nhat, you my friend are a ROCKSTAR!  We appreciate the GREAT review and is always a pleasure to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111823807177511452049", "name": "Laser Beauty", "time": 1547941528421, "rating": 5.0, "text": "Barons, inc is very professional and and helpful in all aspects of QuickBooks management. I have been a client for over 15 years. I love working with Sharon. She always returns my calls and goes out of her way to fix any problems or help with questions. My business would not be where it is today if it were not for her expert knowledge and genuine caring attitude.", "pics": null, "resp": {"time": 1548287929987, "text": "Thanks Jacqueline!  I've appreciated working with you as well, you've been a joy to work with! Thank you for the GREAT review! ~Sharon"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111277116250474484410", "name": "Tamla Masters", "time": 1550259881800, "rating": 5.0, "text": "Barons has been truly wonderful to work with. Very knowledgeable and extremely receptive with any of my business needs. I consistently get excellent customer support from the Baron’s team. They go out of their way to help me solve any issues I have with Quikbooks which gets me quickly back on track. Their services are extremely valuable for my business.", "pics": null, "resp": {"time": 1553712085351, "text": "Tamla, our Club Z! friend! Thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112115929266158956995", "name": "RxMaster Pharmacy Software", "time": 1553551376745, "rating": 5.0, "text": "Sharon is very knowledgeable and professional. I trust her with any Quickbooks problem or question I might have, she always gets back to me within a short time frame. I have been a satisfied customer for 14 years. I would recommend Baron's to anyone.", "pics": null, "resp": {"time": 1553711651174, "text": "Rhonda, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105829907665835612779", "name": "Claude Stone", "time": 1559922161010, "rating": 5.0, "text": "I am not sure 5 stars gives one the right magnitude of the service Morse Farm has receives from Barron's, Chris Metzler. His support of each of our employees gives them the confidence to integrate Quick Books Point of Sale in the the Morse Farm infrastructure. We would love to make a sugar maker of him.", "pics": null, "resp": {"time": 1559924617504, "text": "Thanks Claude for your business! We feel the same way about Chris!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117317254217504116074", "name": "Helene Cerise", "time": 1593114531105, "rating": 5.0, "text": "Excellent service - helped me all weekend to convert from Desktop to Online.", "pics": null, "resp": null, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "103553518053420410499", "name": "Teresa Bradford", "time": 1552933235427, "rating": 5.0, "text": "Sharon was an absolute delight to work with! Besides being very knowledgeable, she was very personable and quick to respond to every question and need that I had.  I am elated to have found such an expert!", "pics": null, "resp": {"time": 1553711770753, "text": "Teresa, it was a delight to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110992099580609457605", "name": "Josh Drummond", "time": 1562364103306, "rating": 5.0, "text": "Baron's Inc is a great company with excellent service and lots of business knowledge for quickbooks and more. They service me here in Arkansas all the way from Alabama! Great folks and friendly to deal with. Highly Recommended!", "pics": null, "resp": {"time": 1562368437165, "text": "In true Rockstar fashion, thanks buddy!  Love doing business with you"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106571462612984588457", "name": "Jeanne Grimes", "time": 1551808299303, "rating": 5.0, "text": "Baron's is your go-to for all things accounting and Quickbooks.  Sharon McCauley is extremely knowledgeable and a pleasure to work with for our end-of-year bookkeeping, financial audits for contractor licensing and any new business piece that we need to add in Quickbooks.  She is a wizard at all of it.  Truly don't know what we would do without her expertise.", "pics": null, "resp": {"time": 1553711955993, "text": "Thank you so much Jeanne!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111276108849508523867", "name": "Regina Daniels", "time": 1549997944652, "rating": 5.0, "text": "Wow! We have been using Barons Inc since 2008!! I would spend hours trying to figure out how to “fix” something in QB, because you know it has to be easy😊, then I’d call Sharon and she would tell me in 5 seconds. They have made our lives so much more organized by teaching us & being fast at answering our questions!!", "pics": null, "resp": {"time": 1553712253531, "text": "Regina, yes WOW...thanks, yup kind of a long time...we love working with y'all!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107962674414500317604", "name": "Jc’s Outlet", "time": 1547820153796, "rating": 5.0, "text": "Baron’s is an asset to my business. They have a lot of business insight, super friendly, and super helpful whenever I have a business need. Utilize their services and you won’t go wrong!", "pics": null, "resp": {"time": 1548288960720, "text": "Justin, you are a ROCKSTAR business owner as well as a great friend!  We value your friendship and your business!  Thanks for the review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105263527778344374868", "name": "Kathy Vance", "time": 1548196933696, "rating": 5.0, "text": "I have been a client of Barons' Inc for over 10 years. Sharon and Brandon are great to work with. They are quick to return phone calls and follow through to get your accounting or qb issues resolved. I highly recommend this company!", "pics": null, "resp": {"time": 1548288200223, "text": "Thank you PEBBLES! We love working with you and we love you!  Absolute rock star professionally and personally!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113723871616249817164", "name": "Will Perry", "time": 1550027401626, "rating": 5.0, "text": "My clients buy their QuickBooks software from Barons'. They do an excellent job of taking care of my clients. My clients and I have been doing business with Barons' for several years and they have always provided prompt service without any problems. I highly recommend Barons' Inc.", "pics": null, "resp": {"time": 1553712166569, "text": "AND...we appreciate you and your clients Will, thank you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116988780458405924345", "name": "Joanne DelBalso", "time": 1549742497328, "rating": 5.0, "text": "The team at Baron's Inc has top notch customer support.  They are very knowledgeable with all things Intuit product based.  If you have any questions on which product to purchase for your accounting software, POS system or Merchant services make sure you give Barron's a call!!", "pics": null, "resp": {"time": 1553713654918, "text": "Joanne, thanks for the GREAT review and thanks for being a friend and long time member of the Accounting Success Group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101823155699672483707", "name": "Jimmy Stewart", "time": 1547771723343, "rating": 5.0, "text": "Very great company with very knowledgeable staff. Highly recommend them to anyone. They will be a tremendous asset to your company.", "pics": null, "resp": {"time": 1548289095065, "text": "Jimmy, you're a great friend and appreciate the RAVE review!  So many years of  friendship and business..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115522262429313184268", "name": "Jim Dinwoodie", "time": 1551997598578, "rating": 5.0, "text": "I have had the pleasure of working with Barons' for over fifteen years.  They were instrumental in helping me create and manage the financial foundation of our small business, and for educating me (a marketing person, no less) in the use of QuickBooks.  I have found their entire management team at Barons' to be professional, responsive and a delight to work with.", "pics": null, "resp": {"time": 1552063327425, "text": "Jim, you, my friend are another that started as a customer and left as a friend!  We value our relationship with you and much appreciate your review...THANK YOU!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116162691382124930775", "name": "Michael Jordan", "time": 1566223941263, "rating": 5.0, "text": "Chris Metzler is a top notch professional. He took great time and care making sure our point of sale system was properly set up .", "pics": null, "resp": {"time": 1577827906641, "text": "Hey Michael thank you so much for the review. We think the same thing of Chris... Thanks again for the review I will make sure Chris sees this."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101168821075903408179", "name": "Ernest Cook", "time": 1549952778489, "rating": 5.0, "text": "I've know Brandon for almost a decade. He and his team provide top notch support for customers. I am happy to refer customers to his team because I know they will be treated right.", "pics": null, "resp": {"time": 1553712333969, "text": "A DECADE!? DUDE! Thanks for the great review Ernest!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104588604249400463226", "name": "maria johnson", "time": 1549037440435, "rating": 5.0, "text": "My experiences working with both Brandon and Sharon has been a pure pleasure. Their expertise and dedication to help me achieve my business objectives surpassed my expectations.", "pics": null, "resp": {"time": 1553714191881, "text": "Thanks Maria, for the great review and the friendship over many years!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101872866175889778924", "name": "Yvette Shaw", "time": 1549347316705, "rating": 5.0, "text": "Barons Inc. always give us excellent service and support. They are extremely helpful and knowledgeable. I would recommend them to anyone. Thanks Brandon and Sharon for stellar service and always giving us the support we need!  Yvette from YMS Bookkeeping Services, Inc.", "pics": null, "resp": {"time": 1553714057944, "text": "Yvette, you always so kind...we love working with you and having you on the ASG team as well!  Thanks for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114328140259736151845", "name": "Cason Smith", "time": 1549394513032, "rating": 5.0, "text": "Brandon is trustworthy, skilled and creative to customize an experience that is tailored to meet your exact needs. Plus! He’s a great guy who has a passion for helping people and businesses!", "pics": null, "resp": {"time": 1553713881226, "text": "Thanks Cason, you hit the nail on the head...we ROCK! LOL Seriously, thanks!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111564339020835713042", "name": "April G", "time": 1551914491919, "rating": 5.0, "text": "Professional and customer service excellence! They are always my go to people when I have questions about Quickbooks. Thank you for your kindness and support dedication!", "pics": null, "resp": {"time": 1553711926151, "text": "Hey April! Thanks for the GREAT review...see you at QuickBooks meetup"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100158609571642394133", "name": "Erik Wolff", "time": 1548111734313, "rating": 5.0, "text": "Baron's have eliminated ALL the headaches I had with Quickbooks and payroll. I have 5 different business, from Corporations to LLC to Non-profit. They set-up my Businesses from day one to run flawlessly and I'm still having success 10 years later because of what they continue to do. I would encourage any Business to give Barons Services a try. You'll wish you did it sooner.", "pics": null, "resp": {"time": 1548288095787, "text": "ROCKSTAR review Erik! Thank you SO much!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102916626435739492516", "name": "Angie Johnson", "time": 1555437518731, "rating": 5.0, "text": "Barons' Inc is the best. Sharon is amazing, she can always help me with any issues I may have. I highly recommend them.", "pics": null, "resp": {"time": 1577827964169, "text": "Thanks Angie! Sharon is awesome, we agree... I'll make sure she sees this."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106630557942804063758", "name": "Nick Goedereis", "time": 1549483940100, "rating": 5.0, "text": "Barons is the best at what they do, I highly recommend them in every Accounting /Quickbooks/ Technical situation, simple or extremely difficult. They WILL find the answers and ease any stress or confusion you find yourself in. Always up to date with newest regulations or technology. Very courtious,professional and prompt.", "pics": null, "resp": {"time": 1553713836850, "text": "Nick & Lauren...thank you so much for the GREAT review...we love working with you guys!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107638663752361238902", "name": "Sharon Ramey", "time": 1549993463359, "rating": 5.0, "text": "Sharon McCauley and Brandon Morris are excellent at what they do.  They are professional, knowledgeable and very easy to work with. I highly recommend them.", "pics": null, "resp": {"time": 1553712266880, "text": "Sharon, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "108444596400790262303", "name": "Robin Boyer", "time": 1550232908721, "rating": 5.0, "text": "Barons, Inc. set are company up with quickbooks over 10 years ago. Made my life so much easier. Extremely knowledgeable. Sharon always ansrewed  my calls when I needed help which was a lot. Very sweet and professional. I would recommend them to everyone", "pics": null, "resp": {"time": 1553712111695, "text": "Thanks Robin...much appreciated"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117365559143113529977", "name": "Tricia Estes", "time": 1549231417557, "rating": 5.0, "text": "Sharon and Brandon are incredible!! Their knowledge, quick response and patience is second to none! I would highly recommend them to anyone needing help with Quickbooks.", "pics": null, "resp": {"time": 1553714148718, "text": "Thank you Tricia...you guys are always a joy to work with!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106432421922678528479", "name": "Gina Rodkey", "time": 1549677222570, "rating": 5.0, "text": "Working with Baron's is a pleasure. Brandon is very professional, he knows my needs and is pro active in making useful suggestions. Anytime I have had a question or needed help he has been there.", "pics": null, "resp": {"time": 1553713738564, "text": "Gina, the pleasure is ours for sure! Thanks for being a friend and long time member of the ASG group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114086011900714284722", "name": "Nicole Donohue", "time": 1547741172940, "rating": 5.0, "text": "Brandon and Sharon have been building this business for 16 years and are extremely knowledgeable and passionate about what they do! I am beyond thrilled to be working with them both!", "pics": null, "resp": {"time": 1548287726699, "text": "Thanks Nicole! We agree, WE are absolutely thrilled to be working with you as well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112724701068644125891", "name": "Kyle Crabtree", "time": 1547748464005, "rating": 5.0, "text": "Brandon from Barons' Inc is my go to guy for all things accounting software. He bring not only the wealth of knowledge from being a Quickbooks expert but also the understanding of how business is ran.", "pics": null, "resp": {"time": 1548289176501, "text": "From you, Kyle that means a lot, you know a lot of people...GREAT review, thank you for the kind words as well!  Appreciate your friendship even though you bailed on me here in Mobile! lol"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116450211628548719754", "name": "Jaguar Cleaners Inc.", "time": 1548438873716, "rating": 5.0, "text": "QuickBooks Gurus!  Look no further,  these guys do it all!  All of our accounting systems are now automated and integrated.  Our office now functions with ease.  We couldn't thank them enough!", "pics": null, "resp": {"time": 1548442729841, "text": "LOVE this review! Thank you Christina! Both you and Thomas are great people, work hard, and have a phenomenal business...thank you again for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105433879793598619825", "name": "Wende Burdick", "time": 1553706121978, "rating": 5.0, "text": "Brandon and Sharon have been trusted Club Z! partners who have delivered exceptional support and training for many years. I don't know what we would do without their responsiveness and expertise to keep our franchisees out in the field and not stuck in their back office struggling with operations headaches! I always recommend them first over the other options available.", "pics": null, "resp": {"time": 1553707098417, "text": "Wende, thank you for this GREAT review!  We appreciate you and the Club Z! franchise!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111935659508903591533", "name": "KC ProAdvisor", "time": 1549314660505, "rating": 5.0, "text": "Brandin has been a valuable source of information and has great solutions customers.\nGreat follow through and professional standards", "pics": null, "resp": {"time": 1553714123201, "text": "Jim, thanks for the GREAT review...much appreciated...love having you on the ASG team especially for the number of years we've been able to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110328737941233817676", "name": "Nursery Texas Teacups (Texas Teacups)", "time": 1556730981793, "rating": 5.0, "text": "Chris Metzler is somewhat of a rockstar! I have had a very hard time getting everything installed properly and setup and every time I call and ask a question he always answer! Even when traveling he opens his laptop in the airport and walks me through step-by-step on how to get it done! Thank you Chris!", "pics": null, "resp": {"time": 1556810390681, "text": "We agree, Chris is kind of a BIG DEAL...but SO ARE YOU Becky...we appreciate your business and even more appreciate the time you took to brag on Chris...THANK YOU for your business!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104664991626861162361", "name": "Tracy Johnson", "time": 1548692203037, "rating": 5.0, "text": "Have had great experiences with Barons' Inc. They have gone above and beyond to help me have the knowledge and tools I needed for my business. They really care about our success!", "pics": null, "resp": {"time": 1553714606930, "text": "Thanks Tracy, for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110625825839017936804", "name": "Coral Tree", "time": 1548347388057, "rating": 5.0, "text": "We have always had a positive experience working with the team at Barons' Inc. and would highly recommend them to anyone considering their services.", "pics": null, "resp": {"time": 1548348872058, "text": "Hey CORAL TREE, MUCHO thanks for the review! You guys are TRUE rockstars and appreciate your friendship and your products...great addition to our services! Thanks again!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114403797920020902926", "name": "Ron Brown", "time": 1548275320315, "rating": 5.0, "text": "We Have been working with Sharon McCauley & Brandon Morris for close to 5 years. Excellent speedy and accurate service for our Quickbook needs, also all of our general accounting, payroll, and CPA work. If you are a Contractor you will  be amazed at the detail and experience they can bring to your firm.", "pics": null, "resp": {"time": 1548288684964, "text": "Thanks Ron for the AWESOME review! We love working with you guys. Give Turk a rubdown from us!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117819026071038224553", "name": "Benita Drew", "time": 1547751358006, "rating": 5.0, "text": "Brandon really knows his stuff! He stays current on all the software has to offer and customizes it to fit what I need it to do for any new business venture I come up with.", "pics": null, "resp": {"time": 1548289526765, "text": "Thanks Benita...for the YEARS of business and bantering back and forth as well as bossing me around for photo shoots that the family has forced me into :) Not just a customer, but a friend!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106317578164941275975", "name": "Becca Bodiford", "time": 1549951742595, "rating": 5.0, "text": "Brandon has always went above and beyond to help us out.  Fair price for excellent service.  Thanks for always taking care of the carpet store when we need you.", "pics": null, "resp": {"time": 1553713429223, "text": "Becca, it's always been our pleasure...cool that we get to work together after going to middle & high school together for all those years :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113390311494774903268", "name": "Connie Armer", "time": 1548112625959, "rating": 5.0, "text": "Baron's has been wonderful to work with. If I didn't know the answers they always did.  Thank you for being there for us.", "pics": null, "resp": {"time": 1548289591675, "text": "Thanks for the GREAT review Connie, it is MUCH appreciated!  I have enjoyed working with you as well, both with your practice as well as with the church!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107385354572352553890", "name": "Sabrina Johnson", "time": 1548369439285, "rating": 5.0, "text": "Brandon has always been friendly,  informative and professional. I highly recommend this company.", "pics": null, "resp": {"time": 1553712580077, "text": "Thanks Sabrina, much appreciate the review...hope all is going well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107413259219398428581", "name": "Marcie Hill", "time": 1552496039221, "rating": 5.0, "text": "Great at what they do.  From teaching to solving the problems.  Very informative and Great service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMzi5-HkJUX9MT6YqsCLN6oikNIUYejh4ZTZw2t=w150-h150-k-no-p"]}], "resp": {"time": 1553711812284, "text": "Marcie, thanks for the GREAT review! Love hearing from long time clients!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115243769015594441761", "name": "Janette Armstrong", "time": 1548186647755, "rating": 5.0, "text": "Barrons is so helpful and always available with any questions. Definitely recommend their services!!", "pics": null, "resp": {"time": 1548289722189, "text": "Thanks Janette for the GREAT review...ALWAYS enjoyed working with you both at the tractor store as well as 101 Livestock! Thanks!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116827982663756002412", "name": "joealzate", "time": 1548368888368, "rating": 5.0, "text": "Love the personal attention they give. Friendly and knowledgeable staff.", "pics": null, "resp": {"time": 1553714685541, "text": "Hey Joe, thanks for the GREAT review..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111367301631481325443", "name": "David Gotsche", "time": 1549986955624, "rating": 5.0, "text": "If you need ANY help with QuickBooks, this is the best resource available. The team will answe any questions you have and work to get you the total solution for your accounting needs!", "pics": null, "resp": {"time": 1553712302953, "text": "Thanks David, yeah...we are the TOTAL PACKAGE! :) LOL"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111414255168103229315", "name": "Andrea Roy", "time": 1549378051626, "rating": 5.0, "text": "Very helpful for all of our Quickbooks needs and we always have a great experience!  I highly recommend!!!", "pics": null, "resp": {"time": 1548288513175, "text": "We highly recommend OPC and you are always a pleasure to work with as well Andrea! Thanks for the RAVE review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102114284254594159971", "name": "Russell Guy", "time": 1553096302080, "rating": 5.0, "text": "Barons has helped me with my small business since 2011.  Their general accounting support and QuickBooks expertise has been of great value to me…and Sharon is such a joy to work with, I appreciate them greatly!", "pics": null, "resp": {"time": 1553711743589, "text": "Russell, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "109648838740866766564", "name": "Treasurer Salem UMC", "time": 1549652371583, "rating": 5.0, "text": "Always helpful and professional. This is the best way to help your business be successful.", "pics": null, "resp": {"time": 1553713795685, "text": "Thank you for the great review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117967001023013505741", "name": "Bill Beyer", "time": 1551460330490, "rating": 5.0, "text": "If you use Quickbooks you need Baron's on your team. I have them on speed dial!", "pics": null, "resp": {"time": 1553711998228, "text": "Thanks Bill, one of these days we'll go see the Wizard (of ads) together! :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101255129352709315425", "name": "Patrick Flanagan", "time": 1548739717756, "rating": 5.0, "text": "Extremely knowledgeable, professional and service driven. I would absolutely recommend Barons Inc for any business owner.", "pics": null, "resp": {"time": 1553714596385, "text": "Thanks Patrick, for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117700248905227186794", "name": "Robert Button", "time": 1550625951511, "rating": 5.0, "text": "Baron',s Inc is spot on when it comes Quickbook set up, sales and support. Sharon is extremely knowledgeable and has helped me manage my Quickbook accounts for over 12 years. Her expertise in the QuickBooks program is outstanding. Because of Baron',s Inc. My tax preparation was cut in half at the CPAs office saving time and money. I would highly recommend the Baron',s team!", "pics": null, "resp": {"time": 1553712053775, "text": "Thanks Robert!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110997975562732227490", "name": "Pam Bohall", "time": 1553377632279, "rating": 5.0, "text": "Very knowledgeable and great service!! Would highly recommend Barons", "pics": null, "resp": {"time": 1553711680149, "text": "Thank you Pam, we appreciate your business"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116843428936314117303", "name": "Elizabeth Crowder", "time": 1548272430869, "rating": 5.0, "text": "Baron's Consulting are amazing, very professional, loved working with them, they always knew what I needed for my self storage business. Thank you for always taking care of me", "pics": null, "resp": {"time": 1548288435097, "text": "Thank you so much Elizabeth with the GREAT review!  You are pleasure to work with!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106483038404408750591", "name": "Jamie Delveccio", "time": 1549909501173, "rating": 5.0, "text": "I've had the honor and opportunity to know and work with Brandon Morris and the Barons' Inc team as their QuickBooks Channel Manager here at Intuit QuickBooks for over 5 years. Barons' Inc. is one of our fastest growing and highest valued QuickBooks Solution Providers, providing excellent service to our QuickBooks customers, and mentorship to our fellow QuickBooks Solution Providers. He also serves as a member in our QuickBooks Advisory Council, working directly with our QuickBooks leadership and product developers to lend his experience and feedback. I can't say enough about Brandon and Barons' Inc, we're incredibly fortunate to have him on our team!", "pics": null, "resp": {"time": 1553713591194, "text": "The honor and opportunity is all ours Jamie!  We love being in the QSP program, and love the direction and advice that you provide as well!  Thanks for all that you do!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115261229787112019533", "name": "Lori Rogers", "time": 1548110690270, "rating": 5.0, "text": "I learned so much about QuickBooks from Barons' I would absolutely recommend them. They provide personal service and are very knowledgeable!", "pics": null, "resp": {"time": 1548288025153, "text": "Lori, Thanks for GREAT review!  We've LOVE working with you and we miss your face! :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102258092652910121459", "name": "Marcella Parson", "time": 1549378413658, "rating": 5.0, "text": "We have used Barons' Inc for years and have always been happy with them.", "pics": null, "resp": {"time": 1553712482123, "text": "Marcella, thanks for the GREAT review! We've enjoyed working with you over all these years"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110657316619835389026", "name": "Jessie Puryear", "time": 1550091268102, "rating": 5.0, "text": "Trustworthy, Honest, and Kind. They have gotten me out of some big jams.", "pics": null, "resp": {"time": 1553712137519, "text": "Jessie, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111034602315809179296", "name": "Ross Rodden", "time": 1548859689522, "rating": 5.0, "text": "I’ve used Barons for many years in my small business. Their service, support and expertise in Quickbooks has been invaluable.", "pics": null, "resp": {"time": 1553714307507, "text": "Thanks Ross, we've enjoyed working with you guys as well...much appreciate the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "109832571006216266309", "name": "Paul C", "time": 1601059161204, "rating": 5.0, "text": "Great to work with.", "pics": null, "resp": null, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111514335252727309845", "name": "Mason Schirmer", "time": 1549674552731, "rating": 5.0, "text": "Brandon it's knowledgeable and responds quickly!", "pics": null, "resp": {"time": 1553713760291, "text": "Mason, thanks for the GREAT review - much appreciated!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107366794749859003835", "name": "Tammy Hubbard", "time": 1548791181965, "rating": 5.0, "text": "Barons helped me with my pos system and when I started my business and is so helpful when I have any questions that come up. Which is probably more than the average person but I always get answers.", "pics": null, "resp": {"time": 1553714548914, "text": "TAMMY, you're a rockstar...thanks for the great review..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110109097986193427933", "name": "Joe Delacruz", "time": 1548972602831, "rating": 5.0, "text": "Sharon McCauley did a great job.", "pics": null, "resp": {"time": 1553712442387, "text": "Joe, thanks for the GREAT review! Hope your rental business is going well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113087742610922079601", "name": "ravindavid", "time": 1553200625185, "rating": 5.0, "text": "Top Quality Service-ALL the time,EVERY time", "pics": null, "resp": {"time": 1553711716228, "text": "HARK! Thanks Dave...your work is always top quality as well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117611259330163789194", "name": "Faith Lessly", "time": 1552213906437, "rating": 5.0, "text": "They are very knowledgeable and eager to help!", "pics": null, "resp": {"time": 1553711879568, "text": "Thanks Faith (Bill) - GLAD you noticed our knowledge...and we ARE eager to help :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107538613512321785609", "name": "TEAM VISION LLC", "time": 1548890928158, "rating": 5.0, "text": "From the owner to the agents. Nothing but great service and professional 😊😊😊😊", "pics": null, "resp": {"time": 1553714232271, "text": "The same could be said about you Kevin...thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117762228844796233439", "name": "OnCall Email", "time": 1548954026545, "rating": 5.0, "text": "Very professional and extremely prompt.", "pics": null, "resp": {"time": 1553714205790, "text": "Thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114894900767987371896", "name": "Stefanie Herrick", "time": 1548692321302, "rating": 5.0, "text": "Very knowledgeable and helpful. I would definitely recommend them.", "pics": null, "resp": {"time": 1553712513323, "text": "Stefanie, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100637001887715834985", "name": "Jenny Flicker", "time": 1549720026059, "rating": 5.0, "text": "Very responsive and helpful.", "pics": null, "resp": {"time": 1553713706108, "text": "Jenny, GREAT review, THANK YOU...glad to have you with Accounting Success Group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112616152128960672894", "name": "Annie Stieler", "time": 1548275194834, "rating": 5.0, "text": "The best of the best.", "pics": null, "resp": {"time": 1548288324024, "text": "Thanks for the GREAT review Annie! Truly appreciated!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106141568721393274216", "name": "Kevin Horton", "time": 1545620738802, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x887d49f00950bfa1:0xbce01321d817ffd7"}
{"user_id": "109101559430909519708", "name": "Mary Rose", "time": 1627091916408, "rating": 5.0, "text": "Laura has been my Scentsy girl for several years and has given exceptional customer service EVERY time.", "pics": null, "resp": {"time": 1627092579114, "text": "Thank you for such kind words! You are such a blessing! ❤️"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "112282652035810553854", "name": "Julia Lawrence", "time": 1626781100958, "rating": 5.0, "text": "Laura is amazing! She is always sweet and willing to help me pick amazing Scentsy products for my home.", "pics": null, "resp": {"time": 1626781758588, "text": "Awww thank you Julie!!! It truly makes my heart smile to help you! ❤️"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "114297391067817659199", "name": "Melissa Tschida", "time": 1612727796433, "rating": 5.0, "text": "Laura is THE BEST! Many rep's post only occasionally on social media to keep their clients informed of upcoming sales, new products, special events, etc. Laura posts many times per week to keep us \"in the know\"! My questions are answered promptly, and my orders are delivered quickly. If there's ever an issue, she always works hard to make it right!", "pics": null, "resp": {"time": 1612727975541, "text": "♥️♥️♥️ thank you so so so much for taking time to say such kind words! I appreciate you so much!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "100136697011478275909", "name": "Tammy Shelley", "time": 1612729850434, "rating": 5.0, "text": "Laura is the best! She knows what I like and offers her expert advice when needed. I am fortunate that I am local to her and can get what I want most any time. She makes every customer feel special!", "pics": null, "resp": {"time": 1612730433908, "text": "Tammy!!! You are seriously so sweet! Thank you for being amazing! 🤍 I love being your friend & scentsy girl too!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "111705536275127744883", "name": "Eddy Busby", "time": 1601435645486, "rating": 5.0, "text": "Laura is the BEST Scentsy girl in the world. I needed something happy for a friend having a really hard time, I needed a special Christmas gift for someone hard to buy for. She always makes the gifts perfect! No one cares like Laura! She really is amazing! Kathy", "pics": null, "resp": {"time": 1601463177081, "text": "Thank you Kathy! You are seriously the best! ❤️"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "105694484814073618058", "name": "Amber fielding", "time": 1601462265203, "rating": 5.0, "text": "If you're looking for a great Scentsy rep, you've found the best in Laura.  She is a truly kind person who appreciates her customers and always goes the extra mile for them.    She is a pleasure to know, and boy does she know her stuff!  Give her a try!  You won't regret it!", "pics": null, "resp": {"time": 1601463109756, "text": "Oh my heck! Thank you!!!!! You’re so sweet!!!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "100119569833762216333", "name": "Donna Marion", "time": 1606011637210, "rating": 5.0, "text": "Laura is seriously the BEST Scentsy girl there is! She works to learn what you love and then works so hard to make sure you’re happy. She’s just fabulous!", "pics": null, "resp": {"time": 1606012276341, "text": "Awww thank you so so much! This means a lot to me!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "108069661633611211796", "name": "DARLENE NELSON", "time": 1601470790125, "rating": 5.0, "text": "Laura does everything in her power to see that we are informed of all products, new, as well as those on deals. She also sends us little goodie bags that are to die for!  Always a special, and welcome, surprise. Can’t wait to see what’s inside every time. She is the best ❣️🥰🥰🥰", "pics": null, "resp": {"time": 1601487131579, "text": "Darlene you are so sweet! I’m so glad you’ve been enjoying everything! Thank you!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "117605579987449228902", "name": "T Burke", "time": 1605970084406, "rating": 5.0, "text": "Laura is the best!!!! If you are needing a new consultant or just looking to try scentsy for the first time, you couldn't choose anyone better!!", "pics": null, "resp": {"time": 1606012307959, "text": "Thank you BUNCHES for your kind words!!! ♥️♥️ I appreciate you!!!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "113023020935148845859", "name": "Linda McElroy", "time": 1605969122331, "rating": 5.0, "text": "Laura is the best !  I love my Scentsy warmers.", "pics": null, "resp": {"time": 1606012490224, "text": "Thank you sweet Linda!!! 😍😍😍 I am soooo glad you love them!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "111627478297491074269", "name": "Keren “Keren” Burdick", "time": 1601445511088, "rating": 5.0, "text": "Laura is THE BEST!!!! She works so hard at getting to know you and your likes/dislikes.", "pics": null, "resp": {"time": 1601463144450, "text": "Thank you for your kind words!!!  We appreciate serving you!!!"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "106003257978369535735", "name": "Adelynn Newton", "time": 1601485062954, "rating": 5.0, "text": "The best there is!!!", "pics": null, "resp": {"time": 1601487089929, "text": "Thank you!!!! ♥️♥️"}, "gmap_id": "0x888ccb901df458bd:0x647986a7ea8d82b"}
{"user_id": "105366377189058722485", "name": "Burchfield lc", "time": 1524006642343, "rating": 5.0, "text": "Great and very helpful! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb31f66646b65:0xb9c65cfbc2dfef14"}
{"user_id": "104265552971129993705", "name": "Lloyd Boyd", "time": 1503433194970, "rating": 5.0, "text": "Absolutely Amazing individual !!! Her story touched my soul!!! And her book is a must buy!!!", "pics": null, "resp": null, "gmap_id": "0x887f905e8dbd259d:0xecca8e48fcd16b81"}
{"user_id": "108126113333302113308", "name": "Troy Schoenfelder", "time": 1601043871290, "rating": 5.0, "text": "Excellent advise.  Patricia's office has supported my growing business and has provided invaluable counsel over the years.", "pics": null, "resp": null, "gmap_id": "0x88626f6a5ad43ff5:0x9900cd082f76c463"}
{"user_id": "105457011462378268875", "name": "Carole Albyn", "time": 1590080162799, "rating": 5.0, "text": "Personable, and thorough. We have been going here for several years and have had excellent service.", "pics": null, "resp": null, "gmap_id": "0x88626f6a5ad43ff5:0x9900cd082f76c463"}
{"user_id": "116847551199040953705", "name": "Andrew Harless", "time": 1553262248194, "rating": 5.0, "text": "Absolutely love them! They are the best! They are so friendly and so professional.", "pics": null, "resp": null, "gmap_id": "0x88626f6a5ad43ff5:0x9900cd082f76c463"}
{"user_id": "115018884121375061463", "name": "Jerod Hardeman", "time": 1521093598096, "rating": 5.0, "text": "To this place a few years back when I found out I needed glasses and they really did give me a good deal for me and my kids at the time when I was married it was a really good place they was nice friendly courteous so if you ever get a chance visit this place is right off of Oakwood thank you", "pics": null, "resp": null, "gmap_id": "0x88626f6a5ad43ff5:0x9900cd082f76c463"}
{"user_id": "103527473914176324397", "name": "Henry Lemley", "time": 1624108264117, "rating": 5.0, "text": "I never visited this place. Only looked them up online. Happy to give them a good rating because I'm sure they are excellent at whatever it is they do.", "pics": null, "resp": null, "gmap_id": "0x888e8566e5a07679:0xd99839113170898b"}
{"user_id": "103405989372892064958", "name": "Blaqheart (xblaqspen)", "time": 1553798234402, "rating": 3.0, "text": "I drove by, sounds like a very interesting place. I'll save and come back for visiting then I can write a fair review.", "pics": null, "resp": null, "gmap_id": "0x88861d210a46e375:0x728de22a8b1a4ca3"}
{"user_id": "100693254541230403479", "name": "Kole Wilson", "time": 1605926780371, "rating": 5.0, "text": "Very detailed plans.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "104431175387745860701", "name": "Bob Bartlett", "time": 1544622578115, "rating": 5.0, "text": "I inspected the facility on a weekend.  You can tell a lot about a company by the way they keep their facility.   It was very neat.  Their equipment was clean and well maintained.  The location was easy to find.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "112373062355350702899", "name": "K. L.", "time": 1575528366528, "rating": 5.0, "text": "VERY NICE PEOPLE AND  BUSINESS ESTABLISHMENT 👍👍👍", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "103862699533386407112", "name": "Joey Syron", "time": 1513718622869, "rating": 5.0, "text": "We at John G Walton have worked and completed numerous projects throughout Mobile County with Driven Engineering overseeing the design, implementation and installation. We as a company currently have projects on the books with Avalisha and Driven and look forward to getting them started and complete. Driven does some of the best plans in the county, they have engineering technology in building models that is years away from other companies.\n\nIf your in need of a design firm, this is definitely the company your searching for.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "109945516970090401789", "name": "Bama Junky", "time": 1513808365766, "rating": 5.0, "text": "Driven has provided excellent service for my department over the past 4 years.  The staff is very knowledgeable and professional.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "112061497723503081906", "name": "Rx Burner", "time": 1513776512101, "rating": 5.0, "text": "We have worked with this firm for about 6 years (design work, surveys, & dam inspections) and have been very pleased with their work. They are very responsive and great to get along with.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "108535437910304735390", "name": "Allen Rentz", "time": 1513785468775, "rating": 5.0, "text": "Avilisha and her firm has been professional from day one.  They are reliable and very knowledgeable.  Great family feel and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "111701515642469859350", "name": "Randy Spear", "time": 1513718050898, "rating": 5.0, "text": "Utilized Avalisha Fisher's expertise in litigation as an expert witness. Her vast experience and knowledge of both applicable building codes and sound engineering practices yielded tremendous results. Highly recommend Driven Engineering.", "pics": null, "resp": null, "gmap_id": "0x889bac34633ead3d:0xfbc053791faf5dd6"}
{"user_id": "107127727231377505165", "name": "James Shivers", "time": 1532466069445, "rating": 5.0, "text": "Super nice guy, excellent service, and very knowledgeable.  Kent walked me around during the home inspection and showed me exactly what he was looking for and why it was important, for a first time home buyer that was very beneficial.  Full report was provided to me the very next day with everything we went over. Very pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x888924095c16d943:0xcc5b31d642ded947"}
{"user_id": "104818768450478360464", "name": "Minela Rivera", "time": 1556911387230, "rating": 5.0, "text": "Kent is super nice, knowledgeable, works quickly and thoroughly and is competitive with pricing. I would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888924095c16d943:0xcc5b31d642ded947"}
{"user_id": "108474885173044015987", "name": "Justin Poiroux", "time": 1581008089671, "rating": 5.0, "text": "I'd rate 10 stars if I could. Michael is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bbd7a066229:0x5a2337db144464cf"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1472484036586, "rating": 5.0, "text": "Excellent Law Firm, they do great work and don't overcharge their clients", "pics": null, "resp": null, "gmap_id": "0x88891bbd7a066229:0x5a2337db144464cf"}
