{"user_id": "110078135120117596614", "name": "Austin Meyer", "time": 1626099981192, "rating": 1.0, "text": "No showed us twice without calling. Then repeat called after the second no show, one call right after another. Terrible service,", "pics": null, "resp": null, "gmap_id": "0x88626980d25b1d0f:0xa0d0d520ab96e75e"}
{"user_id": "116119082833418713039", "name": "Brad Beasley", "time": 1616700112445, "rating": 1.0, "text": "I don't recommend this business. We made an appointment request online and waited but never got a call so we called the store a couple days later. Spoke with a lady who took our information and said someone would be in touch with us to schedule an appointment. We waited 3 more days and still no call. I called again and spoke with Greg and made an appointment for him to come to our house 2 days later. He didn't show or call. I called to see what happened and he was at another job that ran over and he didn't have my phone # to call and update me. When I complained he told me to find someone else to do my closet. Obviously when you have this many problems just trying to get a quote you do NOT want to work these people.", "pics": null, "resp": null, "gmap_id": "0x88626980d25b1d0f:0xa0d0d520ab96e75e"}
{"user_id": "114528309347615806450", "name": "Selina Mason", "time": 1563927557452, "rating": 5.0, "text": "Greg and crew were able to accommodate a fast turnaround with expert installation and a top quality product. I have been very happy with the results.", "pics": null, "resp": null, "gmap_id": "0x88626980d25b1d0f:0xa0d0d520ab96e75e"}
{"user_id": "101203340813783273385", "name": "Robin Mitchell", "time": 1508820548857, "rating": 5.0, "text": "Owner Greg Hall is incredibly talented and has a knack for this.....affordable  and efficient.", "pics": null, "resp": null, "gmap_id": "0x88626980d25b1d0f:0xa0d0d520ab96e75e"}
{"user_id": "105628488732638906954", "name": "Ruckedup G", "time": 1544006431816, "rating": 5.0, "text": "Great service for all your closet needs!", "pics": null, "resp": null, "gmap_id": "0x88626980d25b1d0f:0xa0d0d520ab96e75e"}
{"user_id": "117328267389506293700", "name": "Daniel Perkins", "time": 1550937385068, "rating": 1.0, "text": "Closet orderly van was speeding, passing cars in double stripe zones, and running stop signs in 25 mph residential area.", "pics": null, "resp": null, "gmap_id": "0x88626980d25b1d0f:0xa0d0d520ab96e75e"}
