{"user_id": "107372308518211251493", "name": "LaMonica Roland", "time": 1625482460979, "rating": 5.0, "text": "I  cannot rave enough about how wonderful our experience was with Attic Plus 280. April was right on time with anything we needed and super accommodating. The pod was clean and we had minimal damage to the things we stored for 2 months. Our driver Chris was friendly and amazing  and always made drop off and pick up a breeze. We will only ever use Attic Plus and will be sure we recommend them to others.", "pics": null, "resp": null, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "109052493686069665920", "name": "Rickey Swancey", "time": 1625100884679, "rating": 5.0, "text": "April did a great job accommodating our needs to deliver, move and have picked up. The delivery driver Chris was awesome and is spot on with his ability to drive and drop the pod and make it level.   The pods are far and above better than any of the others on the market. They are actually shipping containers so they are not only weather proof, but they are extremely sturdy and secure.\n\nOnly criticism would be the website is not the best and they are a little hard to get a person live. However they April is super responsive if you just email her.", "pics": null, "resp": null, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "103384584404413632346", "name": "Jennifer Cantu Nail", "time": 1626974883123, "rating": 5.0, "text": "Love Attic Plus… April this manager is so nice and friendly.  Very helpful.  I recommend to anyone needing a place to store their household items.", "pics": null, "resp": null, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "101280216285295762752", "name": "Steven Robinson", "time": 1591204477606, "rating": 5.0, "text": "I can't say enough good things about the service this company offers. They provided a container for me that was larger and at a much better price than any other company that offered similar services. The driver ( Chris) delivered and picked up the pod exactly when he said he would and  Danielle at the office was over the top helpful. If you are looking for a reliable temporary storage solution look no further.", "pics": null, "resp": {"time": 1591209409349, "text": "Thank you so much for the great review and your business!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "106295543879826476870", "name": "Michael Laney", "time": 1598546714303, "rating": 5.0, "text": "The service from the Attic Plus Portable Storage on highway 280 in Birmingham, Alabama was wonderful. It was beyond my expectations. I was able to reach a live person quickly every time I needed to talk to them. They truly have their customers' needs at the top of their priority list because they helped me out when I needed something done quickly.", "pics": null, "resp": {"time": 1598552548317, "text": "Thank you very sir for your business and the wonderful review!! We sincerely appreciate you as a customer!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "109933288491481010029", "name": "Beverly Zekoff", "time": 1594762366619, "rating": 5.0, "text": "We were so pleased with their quick response and service. They helped solve our temporary storage problem after a tree fell on our house. We continued to use their services until we were able to get things repaired. We appreciate their professionalism yet neighborly feel in their assistance.\nThank you Danielle.", "pics": null, "resp": {"time": 1594774357776, "text": "We really appreciate your business and thank you so much for your time and writing such a great review! We look forward to serving you in the future. Thank you! 😀👍"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "113177403885157539902", "name": "Brenda Bailey", "time": 1617827266143, "rating": 5.0, "text": "I like the ease of being able to schedule everything online. No phone trees or waiting for someone to contact me. The delivery driver was very friendly and helpful in showing me how to use my storage. Will use Attic Plus Storage again and will highly recommend them!", "pics": null, "resp": {"time": 1552136655754, "text": "Thank you so much for your repeat business! It really means a lot to us."}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "107486205220977773131", "name": "James Lloyd", "time": 1556900123403, "rating": 5.0, "text": "Great staff. Very responsive and easy to communicate with. Unit met our needs and the delivery and pick up were quick and easy to coordinate. Would certainly use them again for my moving and storage needs.", "pics": null, "resp": {"time": 1556901269621, "text": "Thank you so much Mr. Lloyd! We sincerely appreciate your business. - Courtland & Danielle"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "112745478834141540948", "name": "K W Brown", "time": 1553702207496, "rating": 5.0, "text": "The manager and the driver are both great. Portable storage can be so convenient when you have a lot to store!", "pics": null, "resp": {"time": 1553703064580, "text": "Thanks for the great review!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "115491518267381120978", "name": "The Works Automotive", "time": 1552074626358, "rating": 5.0, "text": "Good Strong Containers. Exactly what we needed for storage and easy to deal with!", "pics": null, "resp": {"time": 1552136674498, "text": "We appreciate it!!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "103400245553949001333", "name": "Tiffany Little", "time": 1556818874191, "rating": 5.0, "text": "This was the easiest time I've ever had renting portable storage, everything is very efficient and staff is friendly and informative.", "pics": null, "resp": {"time": 1558711473737, "text": "We really appreciate you taking the time to give us this great review! Thank you!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "113981277360830891573", "name": "T Gemini (tntGemini)", "time": 1574024236725, "rating": 5.0, "text": "Very convenient and great customer service from the staff!", "pics": null, "resp": {"time": 1574033855452, "text": "We sincerely appreciate the wonderful review! Much appreciated!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "109003859288446261175", "name": "Kristen Bomer Douglas", "time": 1559751303870, "rating": 5.0, "text": "Helpful, responsive staff! Great local business that makes moving much easier!!", "pics": null, "resp": {"time": 1559753894249, "text": "We really appreciate it! Thank you!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "102539351802589310722", "name": "Danielle Bailey", "time": 1555513334696, "rating": 5.0, "text": "Great rates and very easy to get scheduled.", "pics": null, "resp": {"time": 1555602589220, "text": "Thanks!!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "103818024371781045914", "name": "Rebecca Mckenzie", "time": 1612054368269, "rating": 5.0, "text": "Very clean and friendly", "pics": null, "resp": {"time": 1612064879023, "text": "We really appreciate your business and review!! Thanks!!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "104213538030297839555", "name": "Rontez Barksdale", "time": 1552928643085, "rating": 5.0, "text": "Great Company! Great Customer Service!", "pics": null, "resp": {"time": 1553011415432, "text": "Thank you for your business!"}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "102551767584134924338", "name": "Lawrence Maske", "time": 1590272281374, "rating": 2.0, "text": "No service in my region.", "pics": null, "resp": {"time": 1590321996818, "text": "Hi Mr. Maske – I’m confused as to why you would give us 2-star review just because you are outside our delivery area. We are a local company, not a national one, and our website clearly states the areas we service under \"Delivery Area\" on the Portable Storage page. If you would please contact me at your convenience, I would appreciate the opportunity to discuss this review further. Michelle Bailey, General Manager. 205–969–1860 or mbailey@atticplus.com. Thank you."}, "gmap_id": "0x888917e598fc9abf:0xa1632a5e60d456db"}
{"user_id": "118232873042117932496", "name": "Christin Brown", "time": 1613172531860, "rating": 5.0, "text": "I told my husband I wanted one of these for Valentines Day so we reserved one. The AWESOME people at Bin There Dump That found out that this was a Vday gift and delivered it with balloons and cookies!! They said they’ve had some weird requests, but never a Valentine’s gift! They’re the absolute BEST! Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP2-F6KRe1BL3JJJKKzY1W-1WnLpXRadv7Ej2sr=w150-h150-k-no-p"]}], "resp": {"time": 1613441244404, "text": "This definitely was a first Christin but you've given us some ideas for future Vdays! We are happy you enjoyed the service."}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "115992582072213612604", "name": "Brian Blevins", "time": 1610732493802, "rating": 5.0, "text": "If you need to rent a dumpster at a reasonable price to clean out your garage or do spring cleaning, give them a call. They have dumpsters in various sizes and can assist you in finding the right size for your needs. Also great for remodeling projects too! The rental is for 7 days, so you can take your time and includes free drop-off and pickup. They will even place wood boards on the ground to avoid damage to you driveway or yard before placing the dumpster on top!\n\nTheir customer service is outstanding and will work with you to make sure you are happy with your rental. If you need to keep the dumpster for a extra day or two, they can arrange that too. One call is all it takes. Their prices cannot be beat and no one can match their customer service. They are one of the very few companies I enjoy doing business with. I will recommend them to family and friends if they ever require a dumpster rental! Give them a call!", "pics": null, "resp": {"time": 1613173524087, "text": "Thank you Brian for the awesome review and we appreciate you!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "103454025110172712773", "name": "Chisty Reach", "time": 1626446684815, "rating": 5.0, "text": "Absolutely wonderful! I got exactly what I needed when I needed it at a very competitive price. There were no hidden fees which I loved. I highly recommend them. No complaints!", "pics": null, "resp": {"time": 1626454019644, "text": "Thank you Christy!! We appreciate your feedback !!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "101852000505376117098", "name": "johnnie reid", "time": 1617371514725, "rating": 5.0, "text": "DELIVERED ON TIME, OFFICE PEOPLE VERY FREINDLY AND PROFESSIONAL. PRICE BEST I HAVE FOUND. WILL USE THIS COMPANY FOR ALL MY JOBS IN THEIR COVERAGE AREA.   THANK YOU FOR GREAT SERVICE", "pics": null, "resp": {"time": 1617372928968, "text": "Thank You Johnnie!! We appreciate your business"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "106615922687677982404", "name": "Scott Light", "time": 1618856122040, "rating": 5.0, "text": "Great experience overall. They showed up when they promised and the driver even called to make sure the bin was left in the correct spot. I called their office with questions about what could be placed in the bin and the phone was even answered by a real person. Very professional company!", "pics": null, "resp": {"time": 1618858433118, "text": "Thank you Scott!! We appreciate you !!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "102002126178373182244", "name": "Meagan Guyton", "time": 1616783727953, "rating": 5.0, "text": "Talk about accommodating! Suzanne kept in touch during the entire selective process. The storms interrupted my past work week, so I'll be giving them a call again for next week service! $400 cheaper than WM or Rumsey and personalized service!! You can't beat that!", "pics": null, "resp": {"time": 1616796720501, "text": "Thank you Meagan!! We appreciate you!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "117594607218469813548", "name": "tiffany wallace", "time": 1619789729947, "rating": 5.0, "text": "Highly recommend this company! Very professional!! Called them last minute and they were very accommodating! Will use again in the future!", "pics": null, "resp": {"time": 1619792502337, "text": "Thank You Tiffany !!! We appreciate you!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "114254956624561529264", "name": "Jeff Craft", "time": 1621025518383, "rating": 5.0, "text": "This was the easiest thing ever.  I marked the driveway where I wanted it.  They left it there and they came and picked it up as scheduled.  Nothing to sign when delivered.  It was just there until they picked it up.", "pics": null, "resp": {"time": 1621026261393, "text": "It was our pleasure! We appreciate you supporting our locally owned business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "113067919110849180908", "name": "Keith Davis", "time": 1594942135132, "rating": 5.0, "text": "I had been put in a very unfair position of being asked to leave a rental house that I had been in for over six years, Never been late on rent payment and increased the value of the owners home, due to the upkeep of the yard. I was called and told I would have to find somewhere else to live, and be out in 60 or so days. I was working on a seemingly impossible deadline and when I called Bin There Dump That, The woman that answered the phone was incredibly helpful, understanding and kind. She said they could have it delivered as soon as I wanted, she gave me the rates which I thought were very reasonable and said if anything changed just to give her a call and let her know. The bin was delivered on time, very clean and ready to use. The guy who delivered it was very helpful in showing me how everything worked and letting me know the details of what to do. When it came to the last day, I made a phone call and ask if there was a possibility that I could have it one extra day and they accommodated with no problems. I can’t say enough about the staff. Everyone that I have dealt with that has anything to do with Bin There Dump That, has been above my expectations, very accommodating and extremely professional. I will recommend them to anyone who asks. I could not be more pleased. Thank you for being what a business needs to be.! Outstanding!!", "pics": null, "resp": {"time": 1594993388806, "text": "Thank you Keith!!! We appreciate you!!!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "113482689203668757468", "name": "Debbie Holland", "time": 1622067602572, "rating": 5.0, "text": "If I could give this company a rating over 5 stars, I would. We have used them twice this year and have another dumpster scheduled for delivery in a few days.  Everyone, I mean everyone, is professional, friendly, and courteous. They are very easy and flexible to work with and we have encountered zero issues.  I highly recommend you give them a call to see for yourself. Our purpose for using this company: emptying a large house and thankful Bin There Dump That has been able to assist.", "pics": null, "resp": {"time": 1622139279744, "text": "Thank you Debbie!! We appreciate you so much !"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "103351894326152283201", "name": "James Cargile", "time": 1614957466136, "rating": 5.0, "text": "Very professional setting up and picking up.  Was a pleasure doing business with them and will be using in the future.", "pics": null, "resp": {"time": 1616075903273, "text": "Thank you James for the awesome review and kind words. We appreciate you!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "115218044555996596499", "name": "Barbara Moss", "time": 1604084102989, "rating": 5.0, "text": "My team and I filled two dumpsters with construction debris in less than 4 days.  We needed the dumpster brought Monday afternoon to be switched out for Thursday morning.  Then Thursday afternoon the second dumpster was picked up\nIt went great and I was accommodated in a timely, helpful way.", "pics": null, "resp": {"time": 1604085162999, "text": "Thank You Barbara!! We appreciate you!!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "106181230138742478081", "name": "TheCboyer2008", "time": 1596889654827, "rating": 5.0, "text": "Great people to work with. Quick to answer any questions and friendly. Dumpster was delivered the next day. Loved that it is a compact unit compared to others so they can drop in areas that others might not be able to due to size. Will be using them again. Support small businesses!", "pics": null, "resp": {"time": 1597279555253, "text": "Thank you for the kind words and great review!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "117258767162215446542", "name": "Frank Prevost", "time": 1613142899562, "rating": 5.0, "text": "Have used these folks on multiple occasions and I'm always delighted with the service.", "pics": null, "resp": {"time": 1590157684264, "text": "Thank you Frank!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "109093593400600294207", "name": "Christin Brown", "time": 1613172254865, "rating": 5.0, "text": "I told my husband that I wanted one of these for Valentines Day so we reserved one. The AWESOME people at Bin There Dump That found out that this was a Vday gift and delivered it with balloons and cookies!! They said they’ve had some weird requests, but never a Valentine’s gift! They’re the absolute BEST! Highly recommend!!", "pics": null, "resp": {"time": 1613485605192, "text": "Thank you Christin! Happy Valentines"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "105343566911245846963", "name": "Mary Mentel", "time": 1604767832282, "rating": 5.0, "text": "Amazing customer service! I reserved a bin online late at night and it was delivered the next morning! I highly recommend their services!", "pics": null, "resp": {"time": 1604769210025, "text": "Thank you Mary!! Our pleasure! We appreciate you"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "116407764260958039308", "name": "Mike Oswalt", "time": 1597273646574, "rating": 5.0, "text": "Great people to work with. Delivered when they said it would be and placed where I wanted it placed. I needed dumpster an extra day and was able to work It out with no problem.", "pics": null, "resp": {"time": 1597277878305, "text": "Thank you for the kind words Mike. We appreciate your business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "106257226394399025959", "name": "Cheryl Duke", "time": 1601942124507, "rating": 5.0, "text": "We use them frequently on demolition jobs and they are so easy to work with. Would definitely recommend for any construction needs.", "pics": null, "resp": {"time": 1601988268241, "text": "Thank you Cheryl for your business and the kind words!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "106656416707225152928", "name": "Michael Kelley", "time": 1590154107099, "rating": 5.0, "text": "Of the Local dumpster folks I have worked with over the last several years and I have work with a couple thanks to the April Tornado 2011, and then most recently, Bin there Dump That. I have to say, My experience with Bin There Dump That was by Far better! No surprises in the billing, very nice folks, everyone was a Southern Professional, and by that I mean they showed common courtesy, and respect, something unfortunately lacking in businesses today. If you need a service they provide, I recommend them.", "pics": null, "resp": {"time": 1590157618315, "text": "Michael we appreciate your business and your kind words!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "114616665590035007774", "name": "Laura Storey", "time": 1604951970946, "rating": 1.0, "text": "Terrible! Charged $200 for extra weight in dumpster. No. 1. There is no way the dumpster was over weight, only had framing wood, in a 20 yard dumpster. It was not overfilled. No. 2. We were not even told there would be extra charges for weight. A twenty yard dumpster, not overfilled and they just randomly add more charges to my cc. Never use this business again.", "pics": null, "resp": {"time": 1605245728310, "text": "We are so sorry that we couldn’t not resolve this issue with you. We do not like unhappy customers and would love to earn your business again. We have been doing this for 5 years and never have randomly run someone’s card. We also email our terms and conditions to every customer after the order is placed."}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "114232159273866580662", "name": "sherry nichols", "time": 1590153791499, "rating": 5.0, "text": "I highly recommend this location; I don't have one complaint.  Great service by everyone start to finish.  On time as promised and no hidden charges - price quoted was price I paid.  Save time and call them first.", "pics": null, "resp": {"time": 1590157519182, "text": "Thank you Sherry for your kind words and your review!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "105757869091614728344", "name": "Kimberly Roberts", "time": 1582303329144, "rating": 5.0, "text": "We had a wonderful experience with this company! We were helping clean out a house, and we quickly realized a dumpster was going to be needed.  I contacted this company, and they were so very sweet and kind!  They immediately got us set up, and they worked with us on the timing for deliveries and pick ups.  We will definitely use them again!", "pics": null, "resp": {"time": 1582318361995, "text": "Kimberly we appreciate your trust in us and your kind words."}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "100244772657927962142", "name": "Robin and Karen Jones", "time": 1590782545449, "rating": 5.0, "text": "These guys responded quickly to a request for a dumpster and it was just what we needed. Also, it was about half the price of the other 2 more well known waste management companies in the area. Highly recommended!", "pics": null, "resp": {"time": 1590786412618, "text": "Thank you for your business and the kind words! We enjoy making customers happy."}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "116130692330118266433", "name": "Dana Newman", "time": 1581081499948, "rating": 5.0, "text": "Bin there dump that Tuscaloosa is all that and more. Excellent service and wonderful people to work with. Will use them again and again and recommend to anyone looking to need a dumpster for any reason.  Thank you again for your service and professionalism.", "pics": null, "resp": {"time": 1580926238749, "text": "Thank you Dana!!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "113208973862680483304", "name": "Sarah Gafnea", "time": 1589748299000, "rating": 5.0, "text": "This company is great. I will call them again. They are so courteous and will work with you. They were always on time. I just want to say thank you for what y’all do.", "pics": null, "resp": {"time": 1589831975516, "text": "Sarah thank you for your kind words! We appreciate and value your business."}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "110170081135083755080", "name": "Kim Thompson", "time": 1582161145517, "rating": 5.0, "text": "The dumpster was delivered when scheduled. It was easy to fill and then was removed promptly upon my letting them know I was done. I would recommend this company and use again myself if needed.", "pics": null, "resp": {"time": 1582232414836, "text": "Thank you for your business Kim!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "111514707438564543527", "name": "Lindsey Smith", "time": 1591367663240, "rating": 5.0, "text": "Thank you guys so much for coming the extra mile for us! We REALLY appreciate you! If we ever need one again, we know who WE are calling! Thanks! :)", "pics": null, "resp": {"time": 1591404384562, "text": "Lindsey thank you for the kind words and the great review. We look forward to doing business with you again."}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "114798875336400028832", "name": "David Thompson", "time": 1580829743642, "rating": 5.0, "text": "What a great company.  They went above and beyond to get me the dumpster fast and then when I needed it gone fast...they picked it up right away.  What a great company and I highly recommend them.  If you need a dumpster in Tuscaloosa - Call Bin There Dump That!", "pics": null, "resp": {"time": 1580926213965, "text": "Thank you for your business David!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "109859358687372901138", "name": "Whit Norris", "time": 1578267703298, "rating": 5.0, "text": "They were great and also had good advice. Friendly service and the driveway was protected. We used them for a second round of cleaning out a home.", "pics": null, "resp": {"time": 1578271802621, "text": "Thank you for your business Whit!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "102053475871845929317", "name": "S Warner", "time": 1600364944449, "rating": 5.0, "text": "Great Company to work with! Prices are great!", "pics": null, "resp": {"time": 1600369135601, "text": "Thank you so much! We appreciate you!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "114571133176153773354", "name": "April Rice", "time": 1552925999719, "rating": 5.0, "text": "This is my second time using Bin There Dump That and they are great.  If you want a friendly, professional, and reliable service with a real person not a recording to talk too this is definitely who you want to call.  They are quick and have all kinds of options with great prices.", "pics": null, "resp": {"time": 1552926769233, "text": "Thank you April for being a loyal customer!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "100609779219115242151", "name": "Tori Kate CH", "time": 1541025087595, "rating": 5.0, "text": "Excellent service. They were friendly and helpful, communicated well letting us know what time to expect delivery and pick up. Price was very reasonable. This is the second time I’ve used them and they are definitely who I’ll be calling in the future. I highly recommend them.", "pics": null, "resp": {"time": 1541092331411, "text": "Thank you Tori!!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "111188127627784163242", "name": "Alison Gann", "time": 1588352486069, "rating": 5.0, "text": "This company and the service is awesome. Will definitely use them again in the future.", "pics": null, "resp": {"time": 1589517175342, "text": "Thank you Alison!!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "113102873304075370842", "name": "rlowrdr2010 “WildBills Kia”", "time": 1589549308835, "rating": 5.0, "text": "Second time I have used been there dump that and both times it never had a issue they are a great company with nice people and very professional will do business with them again highly recommended thanks been there dump that", "pics": null, "resp": {"time": 1589562008196, "text": "Thank you for your repeat business!! We appreciate you so much !!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "105810649352931586626", "name": "stephanie mullins", "time": 1615041337187, "rating": 5.0, "text": "Great service for a great price. Actually 1/2 the price of the leader competitor for double the time. Thank you for great service. This was not our first time and we will be using you again!  Suzanne was very professional and so nice on the phone and the driver was just as nice. Thank you for providing excellent customer service in a time that it is getting harder to find!", "pics": null, "resp": {"time": 1520289085308, "text": "Thank you!!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "109970466527358484300", "name": "Cyndee Worrall", "time": 1518730121430, "rating": 5.0, "text": "Great experience! I needed a large dumpster for my parent's house and after thorough research,  I called Bin There Dump That. They helped explain the sizes and determined which size I needed and had the dumpster ready for me as soon as I needed it. The price was great and customer service was awesome. I would highly recommend this Company!", "pics": null, "resp": {"time": 1518733390485, "text": "Thank you Cyndee! We appreciate your business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "113136737369660483283", "name": "Bright Horizons4U", "time": 1588941241915, "rating": 5.0, "text": "Reasonable rates and great customer service.", "pics": null, "resp": {"time": 1589517228200, "text": "Thank you Gwen for your business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "108397856701561531573", "name": "sprout sprout", "time": 1550776337782, "rating": 5.0, "text": "Used Bin There Dump That to rid our house of clutter and to dispose of some bad tile work done by myself. Chad and his coworkers are great! Have good communication for drop off and pick up. VERY reasonable rent rates. We were highly impressed that the process was so simple and easy. This company takes care of its customers and their your property, nobody would have ever know that we had a 20yrd dumpster in the driveway after it left. Would highly recommend that you use this company for your dumpster needs.", "pics": null, "resp": {"time": 1550777668236, "text": "Thank you for the kind words it is very much appreciated!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "106370769409693958741", "name": "Victoria Evans", "time": 1503506931125, "rating": 5.0, "text": "This business is top notch. HIGHLY RECOMMEND! I was in a last minute panic realizing I needed a dumpster for renovation project. I filled out request form at midnight, and sent email as backup. Early the next morning I sent text, and Mr. Ezell called me back quickly, said he would see what he could do. Then he had one delivered THAT DAY by 10am! Amazing. The nice delivery man even came back to move dumpster to place it exactly where we needed it for easiest reach. When I needed to extend the rental past 1 week just a bit, owner graciously worked with me with zero hassle. After pickup, they cleaned so you could not even tell there was a bin. Was worth every penny in time saved and less stress, instead of trying to haul out truck loads of rubbish to dump off site. So nice to have traditional (rare) Southern service with a contemporary product. Also great to spend dollars locally with a family business. Will use again! A+++", "pics": null, "resp": {"time": 1505483784998, "text": "Thanks so much Victoria!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "101375800264140184692", "name": "Warren Laird", "time": 1588086691646, "rating": 5.0, "text": "These folks are amazing!! So easy to work with.", "pics": null, "resp": {"time": 1589517146739, "text": "Thank you for your business Warren!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "117596107538408527919", "name": "janice horne", "time": 1505491623305, "rating": 5.0, "text": "Although there was a little mix up in the delivery address, this company handled it with the utmost professionalism. They came out on a Saturday and moved it to the right location. Not only that but for my inconvenience, they emptied it and gave me a free one. This business knows how to deliver customer service the right way. I will definitely be using them again and will reccomend them to my colleagues.", "pics": null, "resp": {"time": 1505559365695, "text": "Thanks Janice so much for this wonderful review. We're thrilled we could accommodate your needs"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "105584280047794552827", "name": "Leon Layton", "time": 1554743533015, "rating": 5.0, "text": "Used them 3 times on a foreclosure I had to clean out. Chad seems to really care about working with the customer. I will definitely continue to use them any time I need a dumpster.", "pics": null, "resp": {"time": 1554834107080, "text": "Thank you Leon for your business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "112586699301197172537", "name": "Michelle McGaugh", "time": 1538953006581, "rating": 5.0, "text": "Bin There Dump That was very professional and definitely rates ⭐️⭐️⭐️⭐️⭐️‘s in my book!!! They deserve 6 ⭐️‘s when it comes to customer service!!! Thanks CHAD for the quick email responses and I will definitely be using Bin There Dump That again!!!", "pics": null, "resp": {"time": 1538953840569, "text": "Thank you for your business Michelle!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "106611268083225900732", "name": "Shelly Melchior", "time": 1596808835105, "rating": 5.0, "text": "We had no idea this business existed till doing some renovation work at home with no idea where to haul the debris and junk!  Looked online - reserved a bin and it was delivered in hours!  Glad they are in Tuscaloosa - will use again!", "pics": null, "resp": {"time": 1596813299558, "text": "Shelly thank you so much for the kind words and allowing us to serve you! We look forward to working with you again!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "117237807969439232825", "name": "Danny Wallace", "time": 1549399232398, "rating": 5.0, "text": "This company is very very accommodating and professionally operated.  Prices are very reasonable and the staff very friendly and helpful!", "pics": null, "resp": {"time": 1549400815385, "text": "Thanks Danny for your business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "110207117668924573404", "name": "crystal smith", "time": 1569617818192, "rating": 5.0, "text": "Couldn’t ask for better service! They are GREAT", "pics": null, "resp": {"time": 1578318345949, "text": "Thank you for your business !!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "109228386757265156272", "name": "Jessica Wilder", "time": 1546621305990, "rating": 5.0, "text": "Awesome company! Very reasonable, would highly recommend to anyone.", "pics": null, "resp": {"time": 1546742145392, "text": "Thanks Jessica!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "113892852900172821909", "name": "Catie Perry", "time": 1549524174139, "rating": 5.0, "text": "Excellent customer service and great prices.  Will use again in the future.", "pics": null, "resp": {"time": 1549554314463, "text": "Thanks Catie for using us!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "118427336530830519430", "name": "Lucas Marc Hancock", "time": 1449501152993, "rating": 4.0, "text": "It was a pleasure working alongside Chad and Bin There Dump That Tuscaloosa. They provide a residential dumpster rental solution unlike any other dumpster company in Tuscaloosa/Birmingham. For any household project like renovation or clean out, I'd definitely recommend Bin There Dump That.", "pics": null, "resp": {"time": 1520289062957, "text": "Thank you for your business!"}, "gmap_id": "0x8888aa0a1e5409cb:0x5364f9870daa2c75"}
{"user_id": "110104125997853914178", "name": "Terry Brooks", "time": 1621512603320, "rating": 5.0, "text": "One of the best companies! They are very responsive! No chasing them down for info. Everyone has been so nice and helpful! I am about to order my FOURTH dumpster for a cleanout and remodel.", "pics": null, "resp": {"time": 1621606480125, "text": "Hi Terry!!  It’s a pleasure working with you.  Thank you for your business."}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "103844767988452980811", "name": "Jeff Morris", "time": 1618093831810, "rating": 5.0, "text": "I would highly recommend The Dumpster Guy in Orange Beach! The transaction was very simple and the customer service is top notch! Will definitely use them again when the need arises.", "pics": null, "resp": {"time": 1618102095642, "text": "Thank you Jeff.  It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "106220481765221776554", "name": "Michael Corley", "time": 1620935207066, "rating": 5.0, "text": "The guy seems real polite and professional. Probably does an excellent job.", "pics": null, "resp": {"time": 1620942290064, "text": "Thank you for Michael!  Please let us know if we can let us know if we can help you."}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "108229501941451386655", "name": "Larry Lucero", "time": 1621869064108, "rating": 5.0, "text": "Great company reliable fast efficient on the spot great prices thank you dumpster guy.\nLL Construction", "pics": null, "resp": {"time": 1621886382467, "text": "Thank you Larry!  It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "114740401592989956511", "name": "Kim Davis", "time": 1613425224605, "rating": 5.0, "text": "Very professional, friendly and accommodating. Fast delivery and pickup. Will definitely recommend and will use again in the future.", "pics": null, "resp": {"time": 1613426342263, "text": "Thank you Kim!  It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "106330003199087306264", "name": "Justin Tucker", "time": 1607362319511, "rating": 5.0, "text": "Very accommodating, very professional, and competitive pricing. Will use them again and highly recommend!", "pics": null, "resp": {"time": 1607362974117, "text": "Thank you, Justin! It was a pleasure doing business with you."}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "105818573804508588273", "name": "Keri Williamson", "time": 1565291055437, "rating": 5.0, "text": "Friendly staff & amazing prices! Very respectable drivers!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOjeILz3PsTxbM82sR6x3y7IxvSaAnH4FGqWFor=w150-h150-k-no-p"]}], "resp": {"time": 1565293150524, "text": "Thank you for your business Keri!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "110654394009137907256", "name": "Joan Dunlap", "time": 1597774789298, "rating": 5.0, "text": "Was easily able to get dumpster into a small gated space where other company had failed. Cannot recommend their service and staff more highly.", "pics": null, "resp": {"time": 1597779147539, "text": "We appreciate your feedback, Joan!  It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "107032816967473177477", "name": "Meghan Sonnier", "time": 1564760936447, "rating": 5.0, "text": "The Dumpster Guy provided service to us while remodeling.  Very helpful, respectful and timely service was provided.  Driver was friendly and always on time.", "pics": null, "resp": {"time": 1564762615711, "text": "Thank you Meghan!!  It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "117138095180218389329", "name": "Jamie Maldonado", "time": 1564845729458, "rating": 5.0, "text": "Very dependable, honest, friendly and helpful! Will definitely use them again!", "pics": null, "resp": {"time": 1564848913776, "text": "Thank you Jamie!!  It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "102646264936277569616", "name": "Steve Wilson", "time": 1563902321889, "rating": 5.0, "text": "This made cleaning out my shed so much easier. Dumpster was delivered the same day and the driver delivered and picked up right on time.", "pics": null, "resp": {"time": 1563903953108, "text": "Thank you for your business Steve!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "117368750809289813440", "name": "Chris Guthrie", "time": 1563896803936, "rating": 1.0, "text": "Drivers are very disrespectful!", "pics": null, "resp": {"time": 1563898575469, "text": "Please contact us immediately at 251-270-9633 to provide us with an explanation of your incident.  We would like to make sure this is handled in the most appropriate manner since we do not have your name in our database to validate that you have used our services. Thank you from The Dumpster Guy in Baldwin County, Alabama"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "110070779403217889754", "name": "Dodie Lancon", "time": 1564771164412, "rating": 5.0, "text": "Great service!!", "pics": null, "resp": {"time": 1564774035900, "text": "It was a pleasure doing business with you!"}, "gmap_id": "0x889a40a7415c8dfb:0xfe967fffa246a966"}
{"user_id": "103549093417281356157", "name": "Maryann Wyatt", "time": 1626286648583, "rating": 5.0, "text": "After my father’s passing, we needed to clean out his garage and workshop. I searched online for local temporary dumpster rentals and this is the one I chose and I’m so glad I did! They were friendly, responded promptly, reasonably priced and did everything they said they would do. I texted pictures of exactly where we wanted the dumpsters (we ended up needing them two times) and they were perfectly placed both times and delivered and picked up exactly when they said they would be. Would 100% use “Bin There Dump That” again!", "pics": null, "resp": {"time": 1626289140414, "text": "Thank you so much Maryann!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "113939814611057028405", "name": "Cassandra Washington", "time": 1624902524712, "rating": 5.0, "text": "Great service and very professional when delivering and picking up the dumpster. Very nice and price is upfront and they let you know everything, no surprises. I'll be using them again for my next project and definitely refer them to my friends and family.", "pics": null, "resp": {"time": 1624903582893, "text": "Thank you so much Cassandra!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "101335462577852568158", "name": "Kathy Nation", "time": 1624025945104, "rating": 5.0, "text": "I am so happy that I found a dumpster rental company with fair pricing and great service!!!  I have been amazed at the service I have received with Chandi McMillan and her Crew at Bin There Dump That.  I am so glad that I found them and will definitely be renting Dumpsters from them in the future.  I'm always happy to support a family owned and operated business.  KEEP UP THE GREAT SERVICE!!!", "pics": null, "resp": {"time": 1624302297397, "text": "Thank you so much Kathy! We appreciate you!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "113933477662168507896", "name": "Michael Doriot", "time": 1618522056010, "rating": 5.0, "text": "We had never had to rent a dumpster before and they made it so easy from the very first call to find out about the process to the time they came to pick it up. If you call them and they don’t answer you immediately get a personal text message stating that someone will get back with you in 10min. Each time I called they called back and were so friendly and helpful. The delivery guy was nice and informative and gave me a call when they were 10min away. Pricing was very reasonable and no hidden costs!!! Highly recommend!!", "pics": null, "resp": {"time": 1622118523939, "text": "Thank you so much Michael! We appreciate you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "109219494438463486904", "name": "Virginia Harris", "time": 1622140389861, "rating": 5.0, "text": "I was very pleased with the prompt delivery and pick-up of the dumpster. The office staff was very knowledgeable of their services and answered all my questions. I would definitely use them again should the need arise.", "pics": null, "resp": {"time": 1622167844352, "text": "Thank you so much!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "104558866798919366916", "name": "Daniel Harmelink", "time": 1621565988589, "rating": 5.0, "text": "They were very polite and helpful. The driver was very good and the whole experience with the company was professional. They went the extra step because it was part of their unique style of doing business. I would use them again", "pics": null, "resp": {"time": 1622118584826, "text": "Thank you so much Daniel!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103342723067388900810", "name": "Mike Logan", "time": 1623971854556, "rating": 5.0, "text": "Bin There Dump That was great to work with. Communication was excellent, service was excellent as well. They would deliver and pick up on schedule. I highly recommend them!", "pics": null, "resp": {"time": 1623972508719, "text": "Thank you!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "101761162558562667451", "name": "Shane Savella", "time": 1618409659405, "rating": 5.0, "text": "Owners of Bin There Dump That and their employees were professional! They arrived for drop off and pick up at specified times, they also call ahead to give you a heads up that they’re on the way. Any questions you may have, they’ll be glad to answer. The prices of their dumpster rentals are very affordable! I rented the 20 yard dumpster and I got rid of everything and then some in and around the house to declutter. I would highly recommend them to anyone as I’ll be using this company again in the future!!", "pics": null, "resp": {"time": 1618488874591, "text": "Thank you so much Shane!!! We appreciate you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "115933492632802005061", "name": "Denise McMichael", "time": 1625924029028, "rating": 5.0, "text": "Chandy is a joy to work with. Very accommodating. The ONLY dumpster company we use here at Rezults Real Estate!!!", "pics": null, "resp": {"time": 1625926737936, "text": "Thank you so very much Denise!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "104026422395193761676", "name": "Japonicas Thurman", "time": 1621531458030, "rating": 5.0, "text": "This was by far one of the most professional, accommodating, friendly businesses I have encountered in a long time. I have recommended their services to everyone I know! Thank you!", "pics": null, "resp": {"time": 1622118567981, "text": "Thank you so much Japonicas!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "100363064234572627020", "name": "Shelby Fetherland", "time": 1624379747316, "rating": 5.0, "text": "Used this service 2x and will use again in the future! Bins are great size, great price, and great customer service! Thanks!", "pics": null, "resp": {"time": 1624396418320, "text": "Thank you!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "113556847377919081926", "name": "Casey Goodin", "time": 1616598649116, "rating": 5.0, "text": "I had a wonderful experience.They were extremely friendly and very professional. They answered every question I had. Will definitely use again in the future.", "pics": null, "resp": {"time": 1616600096446, "text": "Thank you so much Casey!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "100703508341581592405", "name": "Donna Denmark", "time": 1624299923198, "rating": 5.0, "text": "They are extremely professional . I had a drop off day that I had to change twice because of bad weather and they were so friendly snd worked with me , never had an issue about me changing my day ., and never charged me more money .", "pics": null, "resp": {"time": 1624302271359, "text": "Thank you so much for the kind review Donna!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "110690245199157728540", "name": "beachchic1977", "time": 1616008470471, "rating": 5.0, "text": "Excellent price, professionalism and customer service. Will definitely use them in the future if the need arises.", "pics": null, "resp": {"time": 1616067201656, "text": "Thank you so much! We appreciate your business!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "115010698694100100638", "name": "Kathy Burns", "time": 1615404489059, "rating": 5.0, "text": "They answered the phone. Not the answering machine. Told me what I needed. And delivered on time. Worked out perfectly. Very friendly people. Thank you.", "pics": null, "resp": {"time": 1615405911746, "text": "Thank you so much Kathy! We appreciate you!!\nChandi"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "102986315568050232107", "name": "Richard Garner", "time": 1607609484802, "rating": 5.0, "text": "This was our first time using Bin There Dump That and it will not be our last. Chandi has top notch hospitality and truly cares about her customers. We had same-day delivery and pick up with cleanup. Support your small business!! I assure you this is a great family business to support.", "pics": null, "resp": {"time": 1607470473051, "text": "Thank you so much for the awesome review!! We hope to do business with you again!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "116193931024327987493", "name": "Tina Kimball", "time": 1594612009393, "rating": 5.0, "text": "I cannot say enough good things about this company! The customer service is absolutely fantastic! They were always prompt to answer calls and emails, professional, courteous, and flexible. They contacted me very quickly to meet my needs over a holiday weekend and insure I was able to complete my project on my timeline. The price was competitive, the dumpster was clean and functional, and they placed it exactly where I wanted while I was at work so I didn't have to ask for time off.\n\nTL;DR...Wonderful people, highly recommend!!", "pics": null, "resp": {"time": 1594658678048, "text": "Tina you are awesome!! Thank you so much for your kind review!  We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "108000669243935477152", "name": "Jose Velez", "time": 1609373816213, "rating": 5.0, "text": "Good customer service! By the way, the driver that dropped and picked the dumpster very friendly and professional, excelent service. Happy New 2021 to the Bin There Dump That family, great doing business with you!", "pics": null, "resp": {"time": 1609361031068, "text": "Thank you so much Jose!!!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "101300127328659616545", "name": "misha unruh", "time": 1613011029206, "rating": 5.0, "text": "Awesome company!! Chandi and her company really delivered for us!! I needed a last minute dumpster with a quick turnaround and they went above and beyond!! I would definitely recommend this company!!!", "pics": null, "resp": {"time": 1613130354590, "text": "Thank you so much Misha! It was a pleasure working with you!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "101817890510466095190", "name": "Ray Baker", "time": 1603920409354, "rating": 5.0, "text": "After Hurricane Sally dealt me a savage blow, Ben There Dump That made a challenging time go smoothly and they were super easy to deal with. Everyone from the front office to the driver were very nice. I will highly recommend them!!", "pics": null, "resp": {"time": 1603921981778, "text": "Thank you so much Ray, we appreciate the kind words and greatly appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "101007457906380149847", "name": "Melissa Sprinkle", "time": 1589912703620, "rating": 5.0, "text": "GREAT EXPERIENCE!\nWe rented a dumpster for residential use as we completed some annual cleaning out. The service was excellent with a prompt response to my inquiry as well as delivery. They brought the dumpster to my home, set it up so that it would not damage my driveway, and allowed us to use it for 7-10 days. We actually ended up adding a few days as well. The pricing was the most economical in the surrounding area. The pick up, hauling away, and dumping was included. I would recommend this company and I will use them again.", "pics": null, "resp": {"time": 1589918255474, "text": "Melissa, thank you so incredibly much for the very kind review! We greatly appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "109681700369063349126", "name": "Theresa Blanchard", "time": 1607361362845, "rating": 5.0, "text": "Amazed at how friendly, helpful and honest Chandi at Bin There Dump That was after talking to a couple other local companies first.  Super easy to reserve and schedule, great price.  Highly recommend.", "pics": null, "resp": {"time": 1607470379037, "text": "Thank you so much for the awesome review, Theresa!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "114831097195008673332", "name": "Ricky Thrasher", "time": 1595356426623, "rating": 5.0, "text": "Been in the Roofing industry for awhile now.  So have dealt with many different ways to handle the dumps and all that includes.    This company solves all issue you can think of  and then some.   Five stars is not enough to give the real value BIN THERE DUMP provides to any one or company needing a dump.   If you try this company,,, it's over,, you won't want to be with out them.     This company will make your company look much more professional and look like you know what your doing.   If you have your own dumps you already know the headaches with flat tires,,, insurance cost and dealing with transporting it.    Fantastic Services.  Find out for yourself.", "pics": null, "resp": {"time": 1595361447065, "text": "Ricky thank you so much for your continued business and for writing such a spectacular review!  Greatly appreciate you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "114124846613195982184", "name": "#dianeandjennysells EXIT Realty Lyon", "time": 1596334465618, "rating": 5.0, "text": "I spend my days guiding my clients to declutter and get their homes sale ready! And finally I needed to do this myself.  Wow! Impressed beyond belief.  Delivery was smooth and quick, I filled it quickly and they picked it up as requested.  Much more efficient, inexpensive and easier than taking to the dump myself.  Thank you! I will highly recommend to all my clients and friends.", "pics": null, "resp": {"time": 1596386150903, "text": "Thank you so much Jenny! I appreciate the kind words!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "116642717640014643527", "name": "Tabitha Patterson", "time": 1592393724501, "rating": 5.0, "text": "This place was the cheapest and they were awesome. They were super friendly put the dumpster right where we wanted it. Over all it was a great experience to deal with them and I will never go with another company again", "pics": null, "resp": {"time": 1591705707111, "text": "Tabitha thank you SO MUCH for the great review!  We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103708809437447776292", "name": "Paulette Davis", "time": 1590859485871, "rating": 5.0, "text": "Having never rented a dumpster, I had no idea what to expect. Bin There, Dump That proved to be an excellent choice. The dumpster was delivered on time!  The actual dumpster was clean and fresh....no odor, no residue from other uses, not even a stain. The delivery man set it up and showed me how to use the doors.  The gentleman who came to pick it up was so patient. I had just a few more articles to put in the bin. He not only waited a few minutes, he helped me put those last few items in and closed the door.  After he took the dumpster, there was not anything to indicate that a dumpster had ever been in my driveway!!\nI highly recommend Bin There Dump That.\nEverything was done professionally and courteously.\nPaulette Davis.", "pics": null, "resp": {"time": 1590930779842, "text": "Paulette, thank you so much for taking the time to write such a kind review! We greatly appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103442693588465174880", "name": "Kevin Gorman", "time": 1616765864479, "rating": 5.0, "text": "They are great go out of the way to help you", "pics": null, "resp": {"time": 1616960669059, "text": "Thank you so much Kevin!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "110134496545528052533", "name": "Heather Sinclair Smelley", "time": 1603304113245, "rating": 5.0, "text": "They were very kind and professional. We had an issue with our plans changing regarding our needs for the bin; they were extremely understanding and accommodating. I would definitely recommend them!", "pics": null, "resp": {"time": 1603305174574, "text": "Thank you so much Heather! I appreciate you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "111806961806251710058", "name": "Shelby Mitchell", "time": 1603743202713, "rating": 5.0, "text": "Very professional, answered my many questions,  and made a hard job much easier for me and my family. I would recommend them to anyone!", "pics": null, "resp": {"time": 1607470433153, "text": "Thank you so much Shelby!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "102114268489713596476", "name": "Zeb Crowder", "time": 1610143930980, "rating": 5.0, "text": "Service from beginning to end was very professional and friendly. Would recommend this company to anyone.", "pics": null, "resp": {"time": 1610145880977, "text": "Zeb thank you so much for the awesome review! We appreciate you!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103502837372855833018", "name": "Marie Hansen (Mrs. Hansen)", "time": 1593291328357, "rating": 5.0, "text": "The price was affordable for people with a budget. The bin was well taken care of. The people were helpful and kind. I could not ask for better customer service from a business.", "pics": null, "resp": {"time": 1593295016135, "text": "Thank you so much! We greatly appreciate your business and you taking the time to leave a review!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "107181274522702955330", "name": "Charles Persons", "time": 1578958806104, "rating": 5.0, "text": "Provided the dumpster bin quickly, delivery was professional while protecting my property. All questions were answered promptly and pickup was quick and easy. Outstanding courteous service, will use again!!", "pics": null, "resp": {"time": 1578970326165, "text": "Thank you so much Charles, we greatly appreciate the review as well as you trusting us with your dumpster service!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "114212433397727215304", "name": "Hailey Ruth", "time": 1601397035565, "rating": 5.0, "text": "They were awesome! Able to get us a dumpster quickly and always respond promptly.", "pics": null, "resp": {"time": 1601423801834, "text": "Thank you so much Haley!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "113686622801416636505", "name": "Randy Reid", "time": 1594238527999, "rating": 5.0, "text": "These guys could not have been more helpful. They came through for me at the last minute when I was in a crunch. They weren't agitated at my urgent need but thanked me for letting them assist me. Chandl is simply the best. Thank you \"Bin there done that!!!\" You guys are awesome!!!", "pics": null, "resp": {"time": 1594246448011, "text": "Randy, thank you so much for your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "107218440180208585195", "name": "chris", "time": 1573842654613, "rating": 5.0, "text": "Excellent company to do business with. Everyone from the office staff to the drivers are excellent to talk with and there prices are very reasonable.\nI highly recommend these fine folks and We will be getting another dumpster from them to finish what we started after the holidays.", "pics": null, "resp": {"time": 1573856184842, "text": "Thank you so much Chris! We really appreciate the review!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "115719818592209951182", "name": "jamon calhoun", "time": 1588616068927, "rating": 5.0, "text": "Bin there Dump that is an amazing dumpster company. Their service is barnone. Nobody compares to their prices. Their customer service is exceptional. I highly recommend them, and will be utilizing their service again.", "pics": null, "resp": {"time": 1589918293514, "text": "Jamon, THANK YOU so much for the kind review! We appreciate you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "104050984411978434192", "name": "Nancy Schipper", "time": 1592848594302, "rating": 5.0, "text": "Couldn’t have been an easier process. Made our first round of cleanup and clean out a breeze. Will definitely call again next round. Thanks to all.", "pics": null, "resp": {"time": 1592852498532, "text": "Thank you so much Nancy! We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103732533785988979699", "name": "Cathy Gray", "time": 1592255637108, "rating": 5.0, "text": "We have a long driveway that makes it difficult to bring a truck down.  But their system uses small trucks and it was dropped off right in front of our garage where we wanted it.  It was fast, easy, and no contact.", "pics": null, "resp": {"time": 1592309300633, "text": "Cathy! Thank you so much for your business and for the positive review! Greatly appreciate it!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "111662019693575840203", "name": "DSBP Agency", "time": 1592362396770, "rating": 5.0, "text": "They were very quick to pick up and drop off. Very nice and accommodating! I would highly recommend!", "pics": null, "resp": {"time": 1592431105957, "text": "Thank you so much for the fantastic review!! We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103337591133642104095", "name": "Carol Winters", "time": 1593538460860, "rating": 5.0, "text": "Awesome place to rent a dumpster! They let us have it for an extended time at no extra charge! Will definitely recommend them to anyone and use them again! Thanks!! 😁", "pics": null, "resp": {"time": 1593542586068, "text": "Thank you so much! We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "114391833813918563341", "name": "Angela Bell", "time": 1619550280962, "rating": 5.0, "text": "Great customer service, prompt service", "pics": null, "resp": {"time": 1619633362717, "text": "Thank you so much Angela!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "105408895460730642853", "name": "Tashay Stovall", "time": 1592947206376, "rating": 5.0, "text": "Customer Service was excellent,  the BEST EVER!\nI ran into a problem and she help and solved my problem. I would use again and would definitely recommend.", "pics": null, "resp": {"time": 1609879011565, "text": "Thank you so very much for taking the time to write such a kind review!  We appreciate your business, Tashay!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "105778417579538594391", "name": "Keri Bals", "time": 1572891055786, "rating": 5.0, "text": "Just want to share a few thoughts about our experience working with this local company .What a pleasure it has been . They are absolutely professional and easy to work with . They were prompt , courteous and patient ! We will positively recommend them for any dumpster needs to our family and friends !  Keep up the good work !\nLooking forward to working with them again .", "pics": null, "resp": {"time": 1572894833470, "text": "Thank you!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "111497691753349064579", "name": "Stockton Builders", "time": 1561515991500, "rating": 5.0, "text": "Wonderful experience! There when I needed it and gone when I called for it to go. Fair price and great value. We will keep calling them!", "pics": null, "resp": {"time": 1561671287696, "text": "Thank you so much for your business!  We appreciate working with such a professional contracting group!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "113637374627919984810", "name": "Elizabeth Rachel", "time": 1570476161923, "rating": 5.0, "text": "Owner, Chandi is my new go-to for all things dumpster related! She's extremely knowledgeable and goes above and beyond for the customer. Their rates are GREAT too!", "pics": null, "resp": {"time": 1571754569283, "text": "Thank you so much Elizabeth!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "109281108085631077859", "name": "William Peebles", "time": 1578503897176, "rating": 5.0, "text": "Very helpful and professional. Would highly recommend to anyone needing needing fast, reliable service.", "pics": null, "resp": {"time": 1578507664602, "text": "Thank you so much William! We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "105391851567689531025", "name": "Chris Whittaker", "time": 1603986779571, "rating": 5.0, "text": "Excellent staff that was courteous and delivered what they promised.", "pics": null, "resp": {"time": 1604073215131, "text": "Chris, thank you so much for the awesome review and for taking the time out of your schedule to post this. I greatly appreciate it,\nChandi"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "106484320086636249393", "name": "Kevin King", "time": 1553019901184, "rating": 5.0, "text": "I have worked with Bin There Dump That since they started and have never had a bad experience. They are prompt and go above and beyond when setting up the dumpsters. I highly recommend using them for your on-site dumpster needs.", "pics": null, "resp": {"time": 1553031662672, "text": "Kevin King thank you so much! We really enjoy working with you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "100440401264775415758", "name": "Jess Stainbrook", "time": 1554132000680, "rating": 5.0, "text": "Amazing owner and staff. They met and exceeded all our needs! You can't beat the price or service. They were prompt and friendly. Made our move so much easier. I will be recommending them to everyone. Thanks Chandi and staff for everything!!!!", "pics": null, "resp": {"time": 1554133471325, "text": "Jessica thank you so much for the awesome review!  So glad you chose us to as your dumpster provider!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "118342416047939667055", "name": "William Marker", "time": 1562093329982, "rating": 5.0, "text": "I am a roof contractor and on Monday morning of a holiday week they took on a new client and have been very successful keeping me overly satisfied. Can’t ask for better service! If my trailer or track ever go down again. I know who I will be using!", "pics": null, "resp": {"time": 1562095207036, "text": "William thank you so much for your kind words! We really appreciate your business!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "102418688137735155407", "name": "Chris Bartz", "time": 1587729305528, "rating": 5.0, "text": "Very friendly and responsive to my needs as a customer. Highly recommend their service.", "pics": null, "resp": {"time": 1589918315666, "text": "Thank you so much, Chris! We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "106198576007704998967", "name": "Ed Persons", "time": 1554937928932, "rating": 5.0, "text": "Superb service.  Very prompt and better than expected . Professional . I am 100% pleased with everything.   A genuine life safer!!!  I definitely recommend this company.", "pics": null, "resp": {"time": 1554951678653, "text": "Ed thank you so much for giving us an opportunity to work with you! And for going the extra mile in the companion department! You rock!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "110333685499876729194", "name": "Desiree Cochran", "time": 1573328259222, "rating": 5.0, "text": "We rented a dumpster from this business to remodel a house. The box shape is ideal as it saves parking space and allows you to pack so much into the dumpster. They were punctual, courteous and Chandi treated us like family. We definitely reccommemd this company.", "pics": null, "resp": {"time": 1573392657426, "text": "Thank you!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "105667042001649732404", "name": "Tracey Riddell", "time": 1603455564299, "rating": 5.0, "text": "Very dependable and wonderful customer service.", "pics": null, "resp": {"time": 1607470415999, "text": "Thank you so much for the opportunity to work with you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "105688835318485952744", "name": "Theresa Perry", "time": 1560551346175, "rating": 5.0, "text": "Had a great experience, the driver was very nice and courteous, the delivery in the pickup of the bend we're on time. I would recommend bin there dump that to anyone.", "pics": null, "resp": {"time": 1560601356904, "text": "Theresa thank you so much for your fabulous review! We really appreciate you!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "107519342633786921261", "name": "Debra Lee", "time": 1579027050476, "rating": 5.0, "text": "This company was a pleasure to work with.  They are a very reliable and dependable company.", "pics": null, "resp": {"time": 1579030751229, "text": "Thank you so much Debra! We greatly appreciate your business as well as taking the time to leave an awesome review!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "102851809204051151634", "name": "B.A", "time": 1568145754848, "rating": 5.0, "text": "Love this business!!\nIt could not have been an easier process to secure the bin.\nChandi is a joy to work with.\nShe also goes out of her way to make sure it all goes to plan.\nI will definitely use BTDT for my future dumpster needs.\n\nAdam  B.", "pics": null, "resp": {"time": 1568464566129, "text": "Brad thank you so much for your kind review! I really appreciate the opportunity to earn your business!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "103769745012354739944", "name": "Anthony Baker", "time": 1580910118079, "rating": 5.0, "text": "Chandi was great to work with and made everything super easy.  Scheduling was exactly on time each way   Look forward to next time we rent", "pics": null, "resp": {"time": 1580913804042, "text": "Thank you so much for your business, Anthony!!!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "116584805635682057363", "name": "Brian Edmonds", "time": 1555468046630, "rating": 5.0, "text": "Exceptional service!! Couldn’t have asked for better service from the delivery of the very clean bin and talking with the owner on my needs! Thank you Chandi for going above and beyond to satisfy my expectations!!", "pics": null, "resp": {"time": 1555598561751, "text": "Brian - Thank you so much for your business and the awesome review! So glad we could help you out with your project!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "100417330909503457192", "name": "Clark Van Derwood", "time": 1550769967143, "rating": 5.0, "text": "My entire experience with BTDT has been great. I had to order three dumpsters over the course of several weeks and due to my experience with the first one I did not have any desire to shop around. Chandi is friendly explained all of the options and services available. The delivery came right on time, they were able to put it exactly where I wanted, and the dumpster itself was clean. The pick up was also seamless--only a few minutes to prep the bin and get it loaded. I will use them again if the need arises.", "pics": null, "resp": {"time": 1550775809947, "text": "Thank you so much Mr. Van Derwood!  We greatly appreciate your loyalty and we're so happy that we could help out!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "105818573804508588273", "name": "Keri Williamson", "time": 1556565684777, "rating": 5.0, "text": "Wish I could do more than 5 stars!  After tons of quotes, I am SO happy I went with \"Bin There Dump That\"   The most important thing to me is that they were 100% upfront with the costs from the beginning, there were NO hidden costs thrown in!  AND it was the cheapest quote I ended up getting! (im not wondering how they even made money)\nI also have to say this....they put there dumpsters on planks so they don't touch the ground, the dumpster so was clean when it arrived that I thought it was brand new! They did a metal sweep when they picked up and you literally could not tell it was ever there! CHOOSE THIS COMPANY, YOU CAN'T GO WRONG!\n\nShout out to Taylor who delivered & picked up! the ground looked AMAZING after they took the dumpster (we were going to pick up when the dumpster was gone) he most certainly did not have to do that but did and for that we can't thank you enough!\n\nThank you, Taylor & entire staff at Bin There Dump That! you all really made this a breeze!\n\n-Keri WIlliamson", "pics": null, "resp": {"time": 1556567174897, "text": "This review makes me so proud - I will definitely send this to Taylor! It will make his day! Thanks so much for your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "114421125115749891740", "name": "Motor Hub", "time": 1573933340641, "rating": 5.0, "text": "Very awesome company!! Great prices, nice friendly worker!! Thanks", "pics": null, "resp": {"time": 1573936880203, "text": "Samual thank you so much for taking the time to leave such a kind review! We really appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "115595031824101303376", "name": "Scott Hedlund", "time": 1565194817394, "rating": 5.0, "text": "Great to work with and accommodating on both dumpster placement (time and location) and pickup.", "pics": null, "resp": {"time": 1565203925154, "text": "Scott, thank you so incredibly much for the kind words.  We appreciate your business!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "104333221503563776022", "name": "kristie paul", "time": 1542229927280, "rating": 5.0, "text": "This bin was a life-saver while preparing for my move! After living in my house for 7 years i needed to de-clutter my attic and closets so that i didnt have to pay to move so much junk.\nHaving a bin on my property gave me the motivation to get it all done without worrying about multiple trips to the landfill and wasting precious packing time and lots of gas.\nWonderful company and owner! Honest, Accommodating, and Professional service.", "pics": null, "resp": {"time": 1542294177933, "text": "Thank you so much Kristie!  We were happy to help you out and so glad you had an awesome experience!  Good luck with your move!!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "108473662726258722861", "name": "dennis long", "time": 1559356997080, "rating": 5.0, "text": "Service was outstanding would definitely use again", "pics": null, "resp": {"time": 1559401587235, "text": "Thank you so much it was our pleasure!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
{"user_id": "118344083553802115734", "name": "Joel Clark", "time": 1561671175194, "rating": 5.0, "text": "My experience with Bin There Dump that was fantastic!", "pics": null, "resp": {"time": 1561671915294, "text": "Joel Clark you are awesome!  Thanks for your business and the great review!  We appreciate YOU!"}, "gmap_id": "0x889a53ac96fd76cb:0x3eae415d3e8d8baa"}
