{"user_id": "116795363952750043309", "name": "raymondcolley", "time": 1626293060483, "rating": 5.0, "text": "I sold my home in Alabama and needed to move and store my goods until I could find a home in Tennessee. My PODS sit in their facility for 6 months until I purchased my new home. The PODS were delivered at the perfect time for my hired muscle to unload. We had no damage to anything. All the drivers were extremely courteous and professional. We would definitely recommend to all and will use again if I need to move in the future.", "pics": null, "resp": {"time": 1626294743612, "text": "Moving isn't the easiest thing to do, so we're excited to hear we helped make the transition to your new home as simple as possible. Thank you for choosing PODS!"}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "109478854095078734144", "name": "Katie Bieneman", "time": 1611101060043, "rating": 5.0, "text": "Absolutely loved my experience with PODS. It was super smooth. Loved that with each drop off and pick up it was the same person/crew, just made everything much easier. Everything was super clean. My stuff was well maintained within the POD even after being transported from Alabama to Nevada. Would definitely use again if I need to and recommend to anyone who is considering using them!", "pics": null, "resp": {"time": 1611153841871, "text": "We appreciate you taking the time to spread the word about your awesome experience, Katie. We have your back when you need us again!"}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "115576773615381317547", "name": "Bette Cobb", "time": 1617748778679, "rating": 1.0, "text": "A zero is too high for this company.  My personal things were put in two storage containers 6 years ago by a business that cleaned up our water damaged house.  Five years ago that business we got to do the clean up went out of business and the two containers were taken out of our yard with my belongings and without notice.  I am not allowed to have access to them because I don't have the pin # to the account. Five years ago, we got no help from the local business or main company.  We tried to get everything take care of then and couldn't get in touch with the business that worked originally with us and PODS would only talk to the original business that was no longer in existence.\nSo, skip to a week ago I get a letter that informs me of the amount that is owed on the two pods since 2016 and will be put up for auction at the end of the month.  I am a third party and have tried to work with this company - I called and asked about the letter and was told it was a mistake and I shouldn't have gotten it.  Yet, six years later I am still not allowed to get my families' things that are still in the storage units.  So, I was told that nothing could be done and my things would be sold at an auction on 29th of this month.  So, if I paid the $26,692 that was owed by the other company that contracted with Pods originally, could I get my things with no PIN #?  I would just like some help and it seems like no one cares at this company.  There needs to be some way to work this out.  I would like to try and get some help with this because it was not my fault the other business did not pay - but you would think it is.", "pics": null, "resp": {"time": 1617805571454, "text": "We can understand how you're feeling and would like to research this further, Bette. Can you please email socialmedia@pods.com with the customer ID number or any additional information to help locate the order."}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "105540582394986856606", "name": "Teshika Holmes", "time": 1611780056718, "rating": 1.0, "text": "I’m no longer pleased with this service. I have had to contact customer service and they are unprofessional with long hold times, they have messed my account up and constantly charging my credit card after already paying hundreds of dollars already.  Then their collections department have contacted me was unprofessional. I’m to the point where I would like to cancel everything and go with another moving company. Nothing has gone smooth with this company. I’m on a crunch already with an apartment I have to be moved out of already. Each day I call this company between customer service and billing nothing gets straightened out ever! Will never recommend or use this service again!!!", "pics": null, "resp": {"time": 1611782456423, "text": "We certainly don’t like to see this, Teshika. If you’d like to chat, please email socialmedia@pods.com with your customer ID and additional details."}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "105464823127246205415", "name": "Cheryl Phillips", "time": 1556287802222, "rating": 5.0, "text": "Great way to store things when renovating a home without the commitment of purchasing a shed. Super friendly staff from the very first call to the gentleman who picked up the POD.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNN7Z45rZPnFML_r4VEZyqr25LzdE3HFYw4Ft6z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUzKYUnA5Hi_WIva2S6AyeA6f6EL_rwbnd-8pU=w150-h150-k-no-p"]}], "resp": {"time": 1556564335605, "text": "Appreciate the stellar review, Cheryl! Glad to hear PODS made storing your items a breeze! Thank you!"}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "109892343365472788534", "name": "Mike Johnson", "time": 1615817307446, "rating": 5.0, "text": "Clean box great  business", "pics": null, "resp": {"time": 1615843204739, "text": "We're pleased to hear this, Mike! Thanks for choosing PODS!"}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "106461890418409579262", "name": "Yuvonda Nickson", "time": 1613909315710, "rating": 1.0, "text": "Asked to be taken off auto draft and they are still drafting my account when they  want too very unprofessional", "pics": null, "resp": {"time": 1614006828164, "text": "We'd like to connect with you to learn more and address your concerns right away, Yuvonda. Can you please email socialmedia@pods.com with your customer ID?"}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "117756294532525404018", "name": "Michael Hoeft", "time": 1569544860142, "rating": 5.0, "text": "Nice drivers and customer service. They were on time and nothing arrived broken.", "pics": null, "resp": {"time": 1569597069748, "text": "We are delighted to hear about your experience, thanks so much for sharing, Michael! We hope to see you again!"}, "gmap_id": "0x888e86c86d6e68dd:0x6464a160b4bb6142"}
{"user_id": "115759147251947479375", "name": "sandra naylor", "time": 1620775218187, "rating": 1.0, "text": "This was a cross country move. My initial delivery date was scheduled so I hired movers to unload the POD based on the delivery date I was guaranteed. 3 days prior to my initial delivery date I was informed that my POD would be delivered in 10 days. No apology, no reason whatsoever. Posted on PODS site, my container was sitting in their Chandler AZ warehouse and I lived 16 miles away. I've used them in the past, never again.", "pics": null, "resp": {"time": 1620828341081, "text": "We certainly don’t like to see this, Sandra. If you’d like to chat, please email socialmedia@pods.com with your customer ID and additional details."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "104026047849228710494", "name": "Mindy Moore", "time": 1603318504716, "rating": 5.0, "text": "Great customer service!!!  Gave a discount on first month POD rental because the delivery fee was a little higher than estimated. Delivered on time and placed in exact discussed location.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPbYNDUrQ9bby3GMaKqV1OwQASvjikTKaKojR1_=w150-h150-k-no-p"]}], "resp": {"time": 1603402600688, "text": "We're delighted to see this, Mindy! Thanks for stopping by and sharing your experience! And great picture of your PODS container!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "113361947756770335420", "name": "Kevin G", "time": 1624112352300, "rating": 5.0, "text": "Pods is awesome. I'm a driver for this company so I know first hand how amazing this company is.", "pics": null, "resp": {"time": 1624114115300, "text": "Thanks for your five-star review, Kevin!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "100919817412094508750", "name": "Sherry Reese", "time": 1623417409917, "rating": 5.0, "text": "Was on time, except for once and that was because of traffic. Parked it perfectly each time and made it very accessible.  All the guys were very polite and friendly.  Thank you.", "pics": null, "resp": {"time": 1623422283846, "text": "Kudos to our stellar team! And thank you, Sherry, for acknowledging their commitment to delivering exceptional customer care! We're looking forward to working with you again soon!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "101256545291912358484", "name": "Katherine Gonzalez", "time": 1617310957478, "rating": 5.0, "text": "Such good quality for a great price. Everyone was so helpful and kind.- from customer support to the drivers to the moving company that PODS recommended. Will only be using PODS for all of my moving needs from here on out.", "pics": null, "resp": {"time": 1617376086386, "text": "Hi, Katherine! Thank YOU for choosing PODS and sharing this wonderful review with us. We count ourselves lucky for customers like you!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "117239661851250973976", "name": "jruff76203", "time": 1616827104456, "rating": 1.0, "text": "I placed my things in storage in a pod in June 2020 to move home so I could have help during Covid with my newborn. I moved in my new place March 2021 only to find a rusted pod on the exterior and all of my possessions  ruined from a rat infestation. I contacted Pods immediately and still have yet to hear from them. I have no clothes, dishes, shoes or furniture except from what I had with me. I was devastated and have to start over with nothing. I even had content protection and still haven’t heard anything pods. It’s devastating thinking I paid 250 a month not including the transport cost for nothing. I thought I was taking the safest route but I was wrong.  Save yourself the trouble and choose a storage unit you can walk into that’s secure and not rat infested. I’m devastated and out of thousands as I have an infant and cannot salvage rat infested furniture.", "pics": null, "resp": {"time": 1616870875499, "text": "Hello, we're disappointed to read you've had this type of experience. We want to be able to have this looked into further. Please email socialmedia@pods.com with your customer ID so we may best assist."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "104224818317110757624", "name": "Gary Johnson", "time": 1613690697534, "rating": 1.0, "text": "Everything about the Pod rental was great except for the driver running over and damaging my front yard. When contacted I expressed my displeasure with the yard and was told by the area manager that he would repair my yard the next day or the day after and was sorry but it’s been a week or so and I still haven’t had my yard repaired nor have I been contacted to give me an update or to tell me it was gonna be later when they will come because something came up. I just want communication from their part on the situation. The actual rental, storage and moving of the pod was great but the yard being damaged just overshadowed the good. Very disappointing. If Pods storage rectifies the situation I’ll use them in the future but if they don’t, I’ll never use them again.", "pics": null, "resp": {"time": 1613745718852, "text": "We appreciate you bringing this to our attention and would like to research this further, Gary. Can you please email socialmedia@pods.com with your customer ID?"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "114986372383793216862", "name": "Robert Norton III", "time": 1619917994225, "rating": 4.0, "text": "Funny thing. I have never used PODS. One of your customers either fat-fingered my phone number in or they did it intentionally. I call customer service to find out why I was getting phone calls from the company and to have my number removed. The woman that I spoke to was EXTREMELY helpful and apologetic for the inconvenience.", "pics": null, "resp": {"time": 1620310675040, "text": "Happy to hear we were able to get this resolved, Robert! We appreciate your kind words!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "108540808252898240018", "name": "Jay Roberts", "time": 1613074836059, "rating": 1.0, "text": "I would never use them again, charged me storage for a month I didn't use, never contacted me to let me know my container was here, never heard back from a senior team lead when I was told that one would contact me. To my military family that maybe on the fence about using PODS look elsewhere.", "pics": null, "resp": {"time": 1613150101631, "text": "This certainly isn't how we want you to feel, Jay. We've shared your concerns with our customer resolution team and requested that they review and follow up with you."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "116509468797871672554", "name": "Nannette Smith", "time": 1617927299883, "rating": 1.0, "text": "Did not deliver on time or pick up and overcharged us  Door was jammed and things fell out", "pics": null, "resp": {"time": 1617982759922, "text": "Hi, Nannette! We’re disappointed to see this. We encourage you to send us an email at socialmedia@pods.com with your customer ID and additional details so we may best assist."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "117967195621134302293", "name": "Gary Franklin", "time": 1600374898364, "rating": 5.0, "text": "PODS staff were very helpful in making my long-distant move such a breeze.   I'd definitely will be using their service again as well as recommending my friends to use PODS.", "pics": null, "resp": {"time": 1600452524381, "text": "Moving is not easy, so we’re glad we were able to help ease some of the stress along the way! Thank you, Gary!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112994583135627204018", "name": "Marsha Bradford", "time": 1583773126355, "rating": 4.0, "text": "You are never able to keep your pod for the full 30 days that you have paid for.\nI understand scheduling conflicts, however a refund for the days less than 30 should be refunded.\n\nThe first few reps I spoke with were absolutely wonderful!  They latest one...not so much. I had a difficult time understanding him. His English was poor at best.\nI will recommend PODS.", "pics": null, "resp": {"time": 1583780243988, "text": "A big thank you for sharing your thoughts, Marsha. We rely on customers such as yourself to let us know how we can better meet their expectations. Your feedback will be shared with all of the appropriate groups."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "115830710728819939570", "name": "Kristin Garrigan", "time": 1594407854089, "rating": 5.0, "text": "I recently used PODS to move and they made the experience a lot less stressful with convenient delivery and pick up times, contactless service and very affordable pricing! I will definitely be recommending them to everyone!", "pics": null, "resp": {"time": 1594413233784, "text": "We'd be super appreciative of you spreading the word to your friends and family about our moving/storage services, Kristin! Thank you so very much for choosing PODS! It was a pleasure working with you!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "103589524140291072873", "name": "Lee Witherington", "time": 1596506301540, "rating": 4.0, "text": "Great concept. Had an issue with delivery dates but no harm done.", "pics": null, "resp": {"time": 1596552368159, "text": "We just love working with customers like you, Lee! Thank you so much for the feedback and super review."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112148404010974394686", "name": "Lance Huffstutler", "time": 1590072182514, "rating": 4.0, "text": "I like that they pick up and drop off the pods. Customer service has always been good. They have left locks out of my order and set up the wrong delivery address", "pics": null, "resp": {"time": 1590085521727, "text": "Hi, Lance! Thanks so much for your review and feedback! If we haven't had a chance to connect about the locks you ordered but didn't receive, please email socialmedia@pods.com with your customer ID."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "101338863104156142286", "name": "Tom McDougal", "time": 1590931179783, "rating": 1.0, "text": "AVOID! This was a HORRIBLE experience. I booked them and they said it was easy to change drop off and pick up reservations. WRONG! When I rescheduled they screwed up the pick up part of the reservation and the PODS are still sitting in the driveway and they are now 5 days late picking up. 6 phone calls and you never can reach anyone local bc they won’t return a phone call. The national call center is rude and no help - other than taking a reservation they have no impact on local operations. The worst part is THEY JUST DON’T CARE! I would give them a -5 Star review if it was possible. Run! Don’t do business with this company unless you want a hassle and to be treated with disrespect and experience the WORST customer service possible.", "pics": null, "resp": {"time": 1591036476035, "text": "We appreciate you taking the time to share your feedback, Tom. We certainly don’t like to see this. If you’d like to chat, please email socialmedia@pods.com with your customer ID and additional details."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "102551767584134924338", "name": "Lawrence Maske", "time": 1593725359194, "rating": 4.0, "text": "Customer service is excellent.  Problems handled professionally,  quickly and completely.", "pics": null, "resp": {"time": 1594059267125, "text": "Thanks for putting a smile on our face, Lawrence! Glad we could help!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "107996810758825574104", "name": "brittany west", "time": 1582327208951, "rating": 1.0, "text": "I was trying to move so I rented a pod I called in my address, but it was put in wrong, so I changed it to the correct address because gods  only knows where it would have ended up. I noticed that my order was cancelled they day before it was scheduled to get picked up  just because i change the address to the correct one. When I called to ask why they cancelled my order they just blamed it on me! I even put the date back in when i changed the address. My stuff sat at the my old house that I sold for over 3 DAYS. I'm sure the new owner was upset over it it was more than likely in his way of moving in. I took vacation days to move which was a waste of my  time, I had to live without a lot of my stuff for that time, even my brothers asked for the days off to help unload it. It was five days before I was off again and had the help to unload my stuff. I  have recommend to other people to just rent a u haul!", "pics": null, "resp": {"time": 1582565633784, "text": "We appreciate you bringing this to our attention, Brittany, and we take your concerns very seriously. We'd like to learn more, please reach out to socialmedia@pods.com with your customer ID so we can take a look."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "109252910444353865305", "name": "GRACE LOVE", "time": 1580736697833, "rating": 3.0, "text": "The driver refused to wait 10 minutes for me to get onsite to move a truck over 10feet. Then I was charged $54.50 re-pickup fee. No one told me about the fee until I got my final bill and called to inquire and was told that the local site made the decision to charge me the fee and they would have to issue a refund. WILL NEVER USE THEIR SERVICES AGAIN!!", "pics": null, "resp": {"time": 1580744887181, "text": "This is disappointing to see, Grace. We always aim for a seamless experience and we would like to learn more. Please reach out to us at socialmedia@pods.com with your customer ID so we can look into this further."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "103224136045300582552", "name": "Stephen Yeatman", "time": 1547495297805, "rating": 1.0, "text": "Worst experience to date. Driver called to say he would be on-site in 45 minutes at 6AM. He then called back 20min later saying he was leaving the house.\nClaimed too many vehicles in driveway. There were 2 cars in a circular drive that can park 9 cars easy. He had an entire entrance to back in and drop the POD. He refused to let the people on-site move their cars out of the way and left. I have asked 3 different customer service reps to let me speak to manager of local branch. They refuse to give out info. Claim to have left a request for them to contact me. Still have not received any calls. Now having to wait until the end of the week for them to re deliver. Do not use.", "pics": null, "resp": {"time": 1547565113106, "text": "Let's connect, Stephen. Can you please send us your customer ID to socialmedia@pods.com so we can help?"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112540159347212960587", "name": "Louise W", "time": 1572554892747, "rating": 1.0, "text": "This is absolutely the worst company I’ve ever dealt with. Not only did the pod get delivered late the day that it was supposed to show, On the day that the pod was supposed to be picked up they just didn’t show.  I had a confirmation email and when I called three hours after the window I was told that the date is not a guarantee?!? The POD was supposed to be gone before I closed, selling my house and they missed the date!!!! Then, they had the nerve to say they were doing me a special service to pick up the POD the following day.\n\nAlso, The POD is quite small.  I got the large one and it definitely did not fit a 2 bedroom home.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "111764342454987168721", "name": "Jason Shafer", "time": 1624060859291, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1624112578972, "text": "We're delighted to see this, Jason! Thanks for choosing PODS!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "110930732039586157847", "name": "Richard Ferris", "time": 1557231835974, "rating": 1.0, "text": "Well if I could give PODs a zero I would.  The delivery went fine, however when I called for the pickup I was told they only pickup in my area on certain days.  This was never mentioned when I ordered the POD.  The dates they could pick up and move to the new location were not available for me.  Therefore I had to empty the POD and move the contents to the new location.  They will be picking the container up at the same location they brought it to.  Total waste of  $400.", "pics": null, "resp": {"time": 1557236779361, "text": "We certainly don’t like to see this, Richard. If you’d like to chat, please send us an email to socialmedia@pods.com with your customer ID."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "110022122098725845857", "name": "Martha Storm", "time": 1597862416123, "rating": 5.0, "text": "Very professional , dependable and on time .", "pics": null, "resp": {"time": 1597958418725, "text": "We appreciate your kind words, Martha! Take care!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "103842838382543010966", "name": "Rachel Key", "time": 1570332220283, "rating": 1.0, "text": "Terrible! Charged my card even after the reservation was canceled.\nReservations must be canceled by 4pm the day before the POD arrives. Which I did, but my card was still charged and I've been told that I have to wait 5 to 7 business days to get my refund. Definitely lesson learned and the BBB has been contacted. Terrible way to do business.", "pics": null, "resp": {"time": 1570464600407, "text": "We'd be happy to look into this, Rachel. We encourage you to send us an email at socialmedia@pods.com with your customer ID and additional details so we may best assist."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "111770993833265698981", "name": "Mark Midyette", "time": 1472841980215, "rating": 5.0, "text": "These guys were just great!  They were on time, took great care not to mess my lawn up and we were very pleased.  Although I REALLY don't ever want to have to move the stuff out of my house again, I'll call them in a flash I that happens.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112544730905252623315", "name": "Kewanee Fox", "time": 1475810107350, "rating": 5.0, "text": "PODS is the best idea I have ever seen. I appreciated that we could pack and move at our pace. I had to pull items from the POD at least twice. I went online to set the time when I would be there and it went smooth. When it was time to move to our location we unpacked with ease as well. I cannot say anything bad about our experience. I will use PODS again should the need arise. I have already recommednded to family and friends.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "107553948220920261253", "name": "Haley Capps", "time": 1511137932760, "rating": 5.0, "text": "Pods made our move so much easier! They delivered/picked up the container exactly when they said they would. Our pod was in storage for 2 months, and all of our things came back exactly how we left them! No weird smell either! I will definitely use them again the next time we move.", "pics": null, "resp": {"time": 1586887773585, "text": "This is what we like to hear, Haley! We're glad we could assist! We certainly have your back when you need us again!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "107673679426615333655", "name": "Michael Matthews", "time": 1476534976194, "rating": 2.0, "text": "The service that we received from PODS was great!  The drivers were very mindful of placement of the PODS and took great care when picking up the PODS.\n\nAs for their billing, it needs A LOT of help!  It is very confusing and once I thought we were paid in full, I received another bill about 6 months later.  The billing process is the only thing that would cause me to hesitate to use PODS in the future.  Other than that, I would recommend them.", "pics": null, "resp": {"time": 1476802969174, "text": "John, we are very glad to hear about your satisfaction with our drivers. However, we apologize for the troubles that you experienced with our billing. Please send an e-mail to podsrequest@pods.com if there is anything that we can do to help or any questions that we can answer for you."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "103186581736675087389", "name": "Angie Beaubien", "time": 1559865234813, "rating": 1.0, "text": "DO NOT use this company!!!! Terrible customer service! Made an appointment 2 weeks ago for a delivery with a pod pick up the next day. NO SHOW!!! Second time this has happened!", "pics": null, "resp": {"time": 1559918281643, "text": "Hello, Angie. We're disappointed to see this. We'd like the chance to connect and look into this further. Please send us your customer ID and additional details to socialmedia@pods.com so we can get started."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "109087978433243926368", "name": "Justin Roberts", "time": 1436198684791, "rating": 3.0, "text": "For the overall experience it was good. The only thing I will say about the Birmingham, AL location is that the building is not climate controlled. It is ventilated only. I had a cloth chair that had obvious mold due to not being a climate and humidity control environment.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "106159147308153242154", "name": "Spencer Hedges", "time": 1542389155600, "rating": 2.0, "text": "I was trying to move household items i had inherited from Canada to my home in the USA. The pod was delivered on time during its specified delivery window.\n\nThe problem came with the lack of local support and the poor customer service with respect to the documentation required by the movers. Despite frequent efforts on my part to clarify which documents were required i came to the conclusion that dealing with this company long distance was not going to work for me. One of the documents for example was for the driver! Why was i receiving this and exactly what should i have filled in? I was simply told they all had to be filled in.\n\nIn order to avoid further aggravation i decided to switch to more traditional movers at a substantial price increase but peace of mind since they absolutely knew what import documents were required. To top it all off PODS charged me $400 for drop off and pick up of the pod i hadnt used due to their incompetence.", "pics": null, "resp": {"time": 1542393388332, "text": "Hi Spencer, we'd like to connect with you further regarding your experience. Do you mind sending us an email to socialmedia@pods.com with your customer ID so we can chat further?"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "100789209372596207537", "name": "Alex Dendy", "time": 1522964641061, "rating": 5.0, "text": "The young man that picked up our POD was FANTASTIC! His name is Brandon and is superb.", "pics": null, "resp": {"time": 1586361611081, "text": "We'll be sure to pass along your praise, Alex! Thanks for choosing PODS for your moving/storage needs!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "113118726788878698731", "name": "Steve Loyd", "time": 1488396289920, "rating": 5.0, "text": "Prompt, efficient, and polite. These guys were great. They made a challenging experience easier and less stressful!", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112416295802763212593", "name": "Brandon Jones", "time": 1469468352105, "rating": 1.0, "text": "I highly discourage anyone from using this incompetent company.  Worst customer service!  My story goes like this.  Ordered 2 PODS and realized the day of loading that I was going to need another one.  I called PODS and requested a new container and the call lasted for two hours and fifteen minutes.  I also scheduled the pickup for all the PODS after loaded and was assured all three would be stored in Montgomery, AL, which would be the closest storage facility that would deliver to my new address in Auburn, AL.  The technician told me to just call about three days before I needed them delivered to the new address and there wouldn’t be any issue.  There was a big issue.  They didn’t store my PODS in Montgomery, they stored them in Birmingham and claimed they needed five days for transit and three day for logistics.  I spoke to three or four supervisors and nobody could do anything to get my PODS on the day I requested.  They did say that if my PODS would have been stored in Montgomery like they said there would not have been any issue.  THEIR FAULT! So they put in an account review and some guy called and stated they lost the 2:15 min call I had with them.  He credited my account $100 dollars and said basically take it or leave it and he didn’t have to give me anything.  So I accepted I was getting my PODS on the earliest date they said.  I moved my entire family down the day prior because all three PODS were scheduled to be delivered.  They only delivered two of the three and stated the other one was never scheduled.  I asked if someone could just please contact the Birmingham facility and see if they can make an exception and deliver it the next day but was met with the standard “that is not our policy or procedure”.  I had to drive my family back to my parent’s house to stay with them for another week because the one POD they didn’t send is the one with all of our furniture.  It is taking them nine additional days to deliver my last POD and I’m having to take more vacation time off to unload it.  They also charged me for and extra month of storage because due to their mistake the PODS were in storage for more than 30 days and they don’t prorate monthly storage fees.  I will never use this company again.  They have ONE job, to deliver/store PODS and they can’t even do that right.  WHEN they make a mistake, and they will, they will not fix it.  They will tell you to submit and account review and someone will get back to you in 3-5 days.  Not one time did I call them and spend less than an hour on the phone.  If you ask for a supervisor, they put you on hold for half hour and then come back on stating they are busy.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "109523881897001326398", "name": "Mayo Woodward", "time": 1566269980663, "rating": 5.0, "text": "Great and so easy to use.", "pics": null, "resp": {"time": 1566317789059, "text": "This is what we like to see, Mayo! Come back and see us again soon!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "109839778271960599422", "name": "Ronald Johnson", "time": 1552301578646, "rating": 1.0, "text": "Took 4 months to get container picked up . Still charged me the whole time it was empty.   They did it just to get extra money from costumers . After 2 months of calling everyday and they came got container  . Shouldnt have to do this . DO NOT DEAL WITH THIS COMPANY .", "pics": null, "resp": {"time": 1552318346793, "text": "We appreciate you bringing this to our attention, Ronald. We encourage you to email your customer ID and additional details to socialmedia@pods.com so we can sort out this situation."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "111763802345988907419", "name": "Leah Olszewski", "time": 1463060426650, "rating": 1.0, "text": "Do not go through PODS period. I'm not specifically complaining about the Bham location. PODS as a whole is a rip off. They completely messed up my billing also. AND, they charged me rent on a POD I wasn't even using (never to get that money back)! An entire month of it at over$200!!!  It was the worst experience ever as I was trying to move. Horrible service. Find a company that actually cares.", "pics": null, "resp": {"time": 1463252843839, "text": "Leah, We are so sorry that you have experienced these issues with PODS. Please send us an email at podsrequest@pods.com with your customer ID and a summary of your concerns, so we can help you get this resolved right away."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "109147095299101697818", "name": "Charlotte Breazeale", "time": 1528317122746, "rating": 1.0, "text": "Absolutely dishonest about their processes.  Horrible company to deal with.  Company policy will not allow you to speak with anyone locally. Use anyone else!", "pics": null, "resp": {"time": 1528376573279, "text": "or send us an email to socialmedia@pods.com with your customer ID!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "113647100340205664529", "name": "Eric Harris", "time": 1480112783374, "rating": 4.0, "text": "Very helpful in my time of moving.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "103029971091536705345", "name": "Ryan Monroe", "time": 1509193496390, "rating": 1.0, "text": "PODS are garbage, not careful with your container and doesn't care afterwards. Customer service is literally the worst. Thanks for being the worst.", "pics": null, "resp": {"time": 1509375392246, "text": "Hi Ryan. We're sorry to hear about your experience. If there is anything that we can do to assist you please send us an email with your customer ID to socialmedia@pods.com."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112986211529495162978", "name": "Stacy Brunner", "time": 1562586410815, "rating": 4.0, "text": "Very helpful", "pics": null, "resp": {"time": 1562607617103, "text": "We appreciate your great review, Stacy!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "112060851285261385451", "name": "lena w", "time": 1566827184295, "rating": 5.0, "text": "Very nice", "pics": null, "resp": {"time": 1566848415091, "text": "Thank you for the awesome 5-star review, Lena! We hope to do business with you again in the future!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "108459719491372175264", "name": "Brenda Carr", "time": 1493425536998, "rating": 5.0, "text": "We hope we don't have to, but if we needed to move ourselves again, we would definitely use PODS again.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "108929377258704654323", "name": "Amos Mcconnico", "time": 1525836769845, "rating": 4.0, "text": "Have not been there", "pics": null, "resp": {"time": 1586361654930, "text": "Come on by, Amos! We're here to assist you with your moving/storage needs!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "100308659649354370428", "name": "Tracy Wilson", "time": 1572448447428, "rating": 1.0, "text": "Hard to deal with", "pics": null, "resp": {"time": 1572452998468, "text": "We certainly don’t like to see this, Tracy. If you’d like to chat, please send us an email to socialmedia@pods.com with your customer ID and additional details."}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "118048574715725979121", "name": "148 Driver", "time": 1508190835047, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "103873481188542326750", "name": "Tina Fields", "time": 1556127972620, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": {"time": 1556292205358, "text": "We're thrilled to hear everything went well, Tina! Thank you for your five-star review!"}, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "108459719491372175264", "name": "Brenda Carr", "time": 1493425536998, "rating": 5.0, "text": "We hope we don't have to, but if we needed to move ourselves again, we would definitely use PODS again.", "pics": null, "resp": null, "gmap_id": "0x88891f1fb1cb8e33:0x27a0a5ff6fe82e95"}
{"user_id": "115158592460407700735", "name": "Keslie Vinson", "time": 1613410799079, "rating": 1.0, "text": "We were very satisfied with this company and their services until it came time to schedule delivery of our pod. We moved out of state and weren't sure what zip code we would end up in. When we called to schedule delivery and give them our new address, they decided to charge us an extra $600 to drive past our new address and turn around and come back to us. We have our stuff being stored in Birmingham, Al and want it delivered to Guntersville, Al and they want to take it to Huntsville, Al first and charge us for it  waited on hold for 30+min to get a supervisor on the phone and the best they would do is take 10% off the $600 over charge fee. Poor way to do business and considering how much was already paid for this service, its ridiculous. We will never use this company again unless they do something to make it right", "pics": null, "resp": {"time": 1613419239741, "text": "We’re disappointed to see this, Keslie. We encourage you to send us an email at socialmedia@pods.com with your customer ID and additional details so we may best assist."}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "107990354241529624878", "name": "Essalyn Long", "time": 1612316649352, "rating": 5.0, "text": "Came very promptly. Was professional and efficient.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPL_OXVrg2IFA_uOwJLbsyul1UzKWyzcnjbrrog=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN34BKpC6UoIQOtJllefWIIASFnabSwILS-W41y=w150-h150-k-no-p"]}], "resp": {"time": 1612367120803, "text": "We appreciate you taking the time to spread the word about your satisfaction with the level of service PODS provided.\nThank you, Essalyn!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "105051378090162039610", "name": "Jennifer Cantrell", "time": 1577807467286, "rating": 5.0, "text": "I had a wonderful experience with the delivery of the empty pods and the pick up of my full pods. The employee who delivered was Brad S. He was so helpful, friendly, kind and professiona . He made my day, that I was very stressed about, stess free and even pleasant!!! THANK YOU BRAD⭐⭐⭐⭐⭐", "pics": null, "resp": {"time": 1577826965751, "text": "Thank you so much for your kind words, Jennifer! We really appreciate you taking the time to share your experience with us—and we agree, Brad is truly an asset to the PODS team!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "104795313384695990717", "name": "Kent White", "time": 1602560170458, "rating": 5.0, "text": "Good follow up.", "pics": null, "resp": {"time": 1602604125368, "text": "We’re glad to hear it, Kent! Thank you for stopping by!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "116440789379645919505", "name": "sara shipley", "time": 1570563063362, "rating": 1.0, "text": "If I could give this company negative stars I would. They try to steal your money, they promise they can send your pod to its final destination on time and say no problem and then they tell you they can't so the pod is in the way for the new owners of the home you sold and it's in your way while you have to try and figure out how to move your things. Most unhelpful customer service ever. I have never been treated that way in my life, and I work in customer service. Refuse to even pick up their empty pod so you can use another means of moving.", "pics": null, "resp": {"time": 1570631819292, "text": "We can imagine this has been a stressful experience, and we’d like the chance to look into this, Sara. We encourage you to send us an email at socialmedia@pods.com with your customer ID and additional details so we may best assist."}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "116660610214619396116", "name": "Austin McShan", "time": 1563379934049, "rating": 4.0, "text": "Worked really well moving out of an apartment and into a house. Small billing snafu but great costumer service. Overall positive experience.", "pics": null, "resp": {"time": 1563463379201, "text": "Thank you for the great review and feedback, Austin!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "116333011436036531039", "name": "Brenda Styles", "time": 1560083687889, "rating": 5.0, "text": "Awesome service.  Friendly,  kept me updated in arrival times. Highly recommend!", "pics": null, "resp": {"time": 1560173445766, "text": "Hi, Brenda! We have the best associates and we love to hear this! Thanks for taking the time to share your experience!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "117088437478473682181", "name": "Cynthia P", "time": 1488305402359, "rating": 5.0, "text": "Everything was delivered as requested.  The quality of the PODS were excellent.  The communication provided was excellent and was more than really expected.  Would recommended them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "112970413108880123840", "name": "Robert Davis", "time": 1568202413817, "rating": 1.0, "text": "To costly an want stop calling after you say no", "pics": null, "resp": {"time": 1568210877699, "text": "Hi, Robert. We'd like to address your concerns. We encourage you to send us an email at socialmedia@pods.com with additional details if you'd like to chat."}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "107026903572989480722", "name": "Mike Disser", "time": 1474048330387, "rating": 5.0, "text": "Delivered on-time, nothing damaged!!!!  Would use them again if I ever move again!!!", "pics": null, "resp": null, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "117991716706092711746", "name": "Justin Garver", "time": 1592950009714, "rating": 5.0, "text": "Great drivers!!!", "pics": null, "resp": {"time": 1593030047777, "text": "We think so too, Justin! Thank you for the shout-out!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
{"user_id": "100842858527041631152", "name": "Yvonne Findley", "time": 1559351382391, "rating": 5.0, "text": "Convenient", "pics": null, "resp": {"time": 1559574409838, "text": "Moving can be complicated, so we're glad we were able to simplify the process for you! Thanks for sharing, Yvonne!"}, "gmap_id": "0x88620d4402f163c9:0x12ef3701ddc309bf"}
