{"user_id": "114481091531893131517", "name": "Darren Ice", "time": 1582346212372, "rating": 5.0, "text": "The cooking classes are a great date night; culinary education mixed with amazing food and knowledgeable people.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5om-8jm11UEub8PCUUkFovxf4QSKdcde5h4w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNAUmAnUPPsIkyPXTJBh1PrPLEpViNE_joZbPU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZ8WRul5SWPcP82eNhIH8OkzO6a4JrYeKdlFw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkpUAMvUAQ2Sg4FW4DT-6OtQuvad7oO8RYvFU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "110371737344884996340", "name": "Lelia Wissert", "time": 1582565715725, "rating": 4.0, "text": "My daughter and I took a class, Celebration of New Orleans. It was fun, Chef Steven was great and his helper was too. The facilities were really nice. We made gumbo, shrimp and grits and bananas foster. My disappointment was the tomatoes in the gumbo, it turned the gumbo into a creole dish. Corporate needs to let the Chef’s cook dishes that are regional and not from some far away place.  We lived in Louisiana for many years and never had gumbo that was red.  Be sure to try a class!!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "117361591650432770601", "name": "Vicki Yackel", "time": 1590714164481, "rating": 5.0, "text": "Absolutely love this store, their products and the staff!  Chef Tenita is awesome!  Can't wait until classes begin again!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "110264065072084241647", "name": "O P", "time": 1597279100905, "rating": 5.0, "text": "Expert and honest opinion, going out of sale get it while you can.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "105970757067103209668", "name": "Rosalind Lewis", "time": 1590702917657, "rating": 4.0, "text": "I was able to enter freely and see a 'cook's dream' and all I could do was add the cost and try to place in my budget to return for purchases.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "110207220062043295661", "name": "Brittany Ward", "time": 1579102782092, "rating": 3.0, "text": "Recently took a class here, and it was way too crowded - 14 people plus 3 chefs. Their kitchen is not big enough to accommodate that many people to have a comfortable experience. It was 4 people to a 3 person station. For the price of $70+ per person, you would expect more and more hands-on. Overall, the chefs were great. Really hate they are limited to a set, very basic recipe from corporate. Also, their stove wasn’t working properly. All groups were cooking at different temps for different amounts of time, which messed up some people’s food.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "118059759926802992691", "name": "Nicholas Blackstock", "time": 1498049790561, "rating": 4.0, "text": "This store is pretty cool. It's like Bed Bath & Beyond, but just the Beyond part and on steroids at that! All things kitchen can pretty much be found here. Depending on what you're used to, you might consider it on the pricey side, but that comes along with the quality/brands they sell here. I've walked through this store and seen items I literally had no clue existed. Staff has been completely friendly and helpful in my experience. Especially with the nice array of FANCY coffee machines that will gladly dispense samples for you.\n\nAlso, toward the back of the store they have a kitchen setup for group cooking classes. Again, imo on the pricey side but check the website because they sometimes have sales! The class we attended was nothing short of spectacular! The teacher was great, the format of cooking in teams worked well and ALL of the food we prepared in this particular class was amazing! So happy that we got to bring the recipes home to try them out on our own (and maybe add our own spin to things)!\n\nCome check the store out for yourself, even if just to simply window shop!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "105905580112857686944", "name": "Cyrus Patel", "time": 1562542620303, "rating": 5.0, "text": "I think everyone who is into cooking should do a cooking class here. My girlfriend and I have done two. One with Chef Rodney (scallops, rice, salad, and a souffles) and one with Chef Steven (salmon, mashed potatoes, salad, and a creme brulee). Both times we had so much fun. They are expensive but totally worth it. We will definitely be doing more cooking classes.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "109266245816607281040", "name": "Bonnie Philips", "time": 1491008446547, "rating": 5.0, "text": "SHOCKED AND SADDENED by the other reviews! :(\nI have always had amazing experiences in this store. The employees are helpful, efficient, and care about the costumers and the merchandise. I love their selection especially the Pearl dinnerware collection, which the staff helped me piece together throughout the years as the collection grew. Grateful to have this Sur la Table in Birmingham!!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "109464309515501726339", "name": "Scott Whitlock", "time": 1517991036246, "rating": 5.0, "text": "I love this store! It is a foodie paradise. Although pricey, it is somehow not as pretentious as Williams-Sonoma. The staff is always friendly, and I could spend hours here just browsing.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "107473305844072902504", "name": "David Petry", "time": 1563564199103, "rating": 5.0, "text": "My cooking class was great it was fun and it helped me become a better chef.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "108389291477513439513", "name": "Ken Davenport", "time": 1544494409483, "rating": 5.0, "text": "Chef Tyler is amazing. Me and my daughter had the best time", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "108714737956968439456", "name": "Chrissi Burrell", "time": 1530635161122, "rating": 4.0, "text": "Love the unique selection of kitchen gear and the cooking classes, the staff on the other hand, not so lovely. Victoria and Marilyn's review on the staff is pretty accurate.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "102596166594644062574", "name": "Correy Miller", "time": 1500816993277, "rating": 5.0, "text": "I have nothing but great things to say about this store, the product selection, and the staff. This is truly a cook's store. I would also highly recommend taking a cooking class with Chef Nadia!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "111773357693952643618", "name": "Victoria Mass", "time": 1491407337547, "rating": 1.0, "text": "Terrrrrrrible. The customer service is a joke. Absolutely rude. I literally saw an employee give a customer the finger. That is SUCH poor taste. To have that kind of person working with customers is flabbergasting. How immature and childish. Particularly these two women kathy and christy. The store's environment would be great but these two drag it down with their rudeness and disrespect. Don't ask a question because they will just roll their eyes and give you a plate of sarcasm. Customer service doesn't mean a thing in this establishment. Too bad for Sur La Table...they make your business look bad.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "107903129565900055211", "name": "Guy Whiddon", "time": 1534399558303, "rating": 5.0, "text": "Great classes! Love Date Night with my wife!!!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "104038932801695145650", "name": "Mrs C", "time": 1544127192994, "rating": 5.0, "text": "Unique kitchen items", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "107943997876565730938", "name": "Jamie Harrell", "time": 1605622408080, "rating": 5.0, "text": "Chef Susan Avello went above and beyond my expectations for our catered dinner party. She carefully thought out every little detail and made the most perfectly prepared dinner. I would absolutely recommend her for any occasion. Her food is more than just delicious, it was a work of art! She coordinated very unique vegan, vegetarian, gluten free, and even some meat options with the tapa dishes. I M P R E S S E D!!!!! #RealFood", "pics": null, "resp": {"time": 1605625168238, "text": "Thank you, Jamie. I appreciate your review it was a pleasure working with you and your group. What a wonderful dinner we had and a beautiful occasion. Thank you for using Lean Bean Chef and for choosing me for your event."}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "114805429157226031027", "name": "Cassie Federoff", "time": 1571239502801, "rating": 5.0, "text": "My story goes something along the lines of, I wanted to do something with my friend that we hadn't done before. Most friends get together and eat. We had the opportunity to take it up a notch!\nThe Lean Bean Chef, Susan, did a fantastic job teaching us how to prepare some delicious Thai food! I don't know which was most enjoyable, the guided lesson and history of the cuisine, or the overly satisfied taste buds!? Many memories were made!\nLean Bean Chef surpassed my expectations!", "pics": null, "resp": {"time": 1571240978106, "text": "Cassie, thank you for your wonderful review. It was such a joy teaching you both in your private cooking class, you were terrific students. You made my job fun and enjoyable with your enthusiasm for cooking, friendship and food. I'm so glad I could help you create lasting memories through this experience. Thank you for using Lean Bean Chef! - Chef Susan"}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "103664357549830664019", "name": "T MK", "time": 1580498685910, "rating": 5.0, "text": "My Husband and I were looking for something to do other than going out to eat. We found Susan's class and it did not disappoint!  We learned a lot and had a great time!", "pics": null, "resp": {"time": 1580831339871, "text": "Thank you so much for your kind review. It was so great having you and your husband in our healthy eating cooking class! You were such an asset to the group! We look forward to having you again at one of our upcoming cooking classes in Dothan! - Chef Susan"}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "109204950059726446360", "name": "Chris W", "time": 1574391302249, "rating": 5.0, "text": "My father is a diabetic and just had a heart attack. This came with a lot of new eating restrictions and my mother was overwhelmed. We reached out and Chef Susan came in without skipping a beat. She helped my father understand that healthy doesn't have to mean tasteless. She helped my mother with healthy alternatives to things she already knew and new ways to think about leading a healthier life going forward.  Despite the limitations put on Lean Bean Chef, our expectations were continually exceeded. If you are thinking that you need chef services, go for it, you will not be disappointed.", "pics": null, "resp": {"time": 1574428035693, "text": "Chris, thank you for your kind comments regarding my services. These situations can certainly be extremely overwhelming. Having someone to help guide you in these times can be so helpful, I know from my own personal experiences. So glad I was able to help your family during this time of transition."}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "109447095613705509318", "name": "Kim Starr", "time": 1502824817052, "rating": 5.0, "text": "I am a Diabetic and I have to watch what I eat because of that. I have had several meals from Lean Bean Chef made especially for me with that in mind. They are made fresh, with local, organic ingredients and are delicious and healthy choices. Being a Diabetic doesn't mean having to cut out flavor - but I can now find satisfaction eating healthy and knowing I can keep the diabetes under control. If you haven't tried Lean Bean Chef Personal Chef Service you are missing something special. I think Lean Bean Chef is the Best Personal Chef Service in Dothan.", "pics": null, "resp": {"time": 1571241356012, "text": "Thank you, Kim. Being diabetic can be quite the challenge especially when knowing what you are supposed to eat and not eat. I'm thrilled I could help out in guiding you along this journey to better health and nutrition. - Chef Susan"}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "114632082938843510452", "name": "Richard Deguzman", "time": 1510775727053, "rating": 5.0, "text": "I just had to take the opportunity and say that Lean Bean Chef, Susan takes the time to listen to and take into account what your health goals are, and likes and dislikes of food.   She incorporates all the feedback to prepare the most perfect meals.  It is so wonderful to come home after a long day at work and know that there are healthy, very delicious meals waiting for me, and there is no mess to clean up.  The food is amazing and has helped in my recovery from C-Spine surgery.  It's a one of kind experience that I will continue because of the outstanding and professional service that she offers.  I have never hired or used a Personal Chef before.  Some of my favorites are Garlic Butter Brazilian Steak w/Collard Greens, Coconut Tofu Curry w/Red Pepper and Spinach w/Brown Rice, Slow Cooked Salmon w/Chickpeas and Greens, Humble Sriracha Roasted Wild Rice Buddha Bowl, and Short Ribs in Tomato Fennel Sauce to name a few.  Whether you're in need of a Personal Chef for you health goals, or an event, Chef Susan is the one to choose.  Simply the best that the Wiregrass  has to offer.", "pics": null, "resp": {"time": 1510776737365, "text": "Rich, thank you so much for taking time out to share your experience with Lean Bean Chef regarding the service you have been receiving. It means so much that you would take the time out of your busy schedule to let others know how much you value what we do. We are so grateful to have you as a client and hope to continue to provide you with the best experience all around. Chef Susan"}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "108042282478904003362", "name": "Zephani Willamson", "time": 1504198343691, "rating": 5.0, "text": "I have experienced a few of the dishes (curry black bean lime rice, Budda bowl, blueberry muffins, and roasted vegetables) and they are delightfully flavorful, healthy, satisfying, with a beautiful presentation. I would highly recommend Lean Bean Chef for even the most discriminating palette.", "pics": null, "resp": {"time": 1504200642546, "text": "Dear Zephani, we are overjoyed that your experience with LEAN BEAN CHEF has been so great and that you chose to let others know. We hope that you will continue to encounter such deliciousness going forward with Lean Bean Chef! All our Best!"}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
{"user_id": "101999098764806090497", "name": "Rebecca Mimms", "time": 1507085681775, "rating": 5.0, "text": "I had the privilege of tasting your curry two different times! Both dishes were some of the best curry I had eaten! God had truly blessed you with a gift!!", "pics": null, "resp": {"time": 1507136942177, "text": "Becky, thank you for your kind review of our Food! We always strive to provide the best final end product with the freshest ingredients and love it when folks take time to tell us how they feel about it!"}, "gmap_id": "0x88928c0890353285:0x2127a797921a65fe"}
