{"user_id": "108027655412523689921", "name": "Danielle Genry", "time": 1548254715469, "rating": 5.0, "text": "I needed some flyers printed for an event that came up and Todd got it done quickly and effortlessly. The flyers look amazing and the price was very reasonable. The business is a family owned and operated business and you will enjoy working g with this business!", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "108031652978987056460", "name": "Stephen Guy", "time": 1548254388204, "rating": 5.0, "text": "Amazing products. Great service. Happy as could be with their services.", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "114994496280932409210", "name": "David Carpenter", "time": 1533910555491, "rating": 5.0, "text": "The good folks at ArtCraft have done a number of jobs for me.  The quality and professionalism that has become their standard is amazing.  They are able to to do any job, no matter how big or small.  If you asked me the name of another printer in Mobile, I couldn't tell you.  I don't need anyone other than ArtCraft.", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "114775261433973217886", "name": "Debbie Gautreaux", "time": 1548254459744, "rating": 5.0, "text": "Todd at Artcraft Press has help our family with all our weddings. Very helpful, cost effective  & prompt.  His suggestions help us save money & time.", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "109260962569382883981", "name": "Springhill Medical Center", "time": 1476120953674, "rating": 5.0, "text": "The team at Artcraft press is awesome.  Always on time with the job with zero surprises. Perfect EVERY time!", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "114723659623808311450", "name": "malcolm yunker", "time": 1547156500374, "rating": 5.0, "text": "Without question, one of best printers there is!", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "108524040756139355142", "name": "Delton Steiner", "time": 1562765830263, "rating": 5.0, "text": "Todd is the man with a plan", "pics": null, "resp": null, "gmap_id": "0x889a4df196387411:0x3c4d54806987d28a"}
{"user_id": "114720194413747308763", "name": "R T", "time": 1614901009216, "rating": 1.0, "text": "I went by there to find out the cost to mail something simple 9 x 6 envelope with papers enclosed. I was given a price of $4.36 to mail it. I asked what the store store was (Surcharge) and the lady did not know. I left and did not mail it there. I took it to the post office downtown Decatur, Alabama and the Total cost was only $2. What kind of extra charges is this place charging?", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114441491131382657787", "name": "Kris Small", "time": 1595953548046, "rating": 1.0, "text": "I've never once been asked what I am shipping ever by any company. I was attempting to ship some very valuable items to my brother in Ca. today and was asked what I was shipping, I stated personal items nothing hazardous. She asked me to describe the item.... that's how they figure out what packages to steal I guess.  because I've had plenty of packages go missing in the mail. if it's hazardous sure I understand but it's not and not on the prohibited list. so they don't need to know. I'll take it to UPS or Fedex next time directly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "113782076434936919802", "name": "Joey Anderson", "time": 1581617285842, "rating": 5.0, "text": "I am very impressed with this store and their employees. I was greated before I made it completely through the door. The staff is upbeat and professional. They were able to service all of my needs and super knowledgeable. I will definately be going back. Thank you for such a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105894517387541931417", "name": "Jason Jameson", "time": 1571417959113, "rating": 5.0, "text": "Amazing store, most polite employees, FedEx shipping. Ignore other reviews where people are not posting honest information. The Shipping Store & More offers FedEx shipping and has amazing employees!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108084887572777496456", "name": "Jay Boyd", "time": 1581458906888, "rating": 5.0, "text": "The employees are very friendly and helpful at this esablishment. I am exteremly satisfied with their professionalism and expertise. I appreciate their services and friendly smiles.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100483729770111816809", "name": "Glen Hunter", "time": 1576823465784, "rating": 5.0, "text": "The 2 clerk's working today were very helpful and professional and handled my packing and shipping needs very quickly. I would definitely recommend this store for all your packing and shipping needs.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107824479444157216157", "name": "Bill Jehle", "time": 1440517629378, "rating": 5.0, "text": "As the chief cook and bottle washer of my own business, the kind folks at The Shipping Store are my staff. I could not run my business without them. Shipping and receiving, not a problem. Notary, not a problem. Photocopies, packing material, anything an average office would need, not a problem. Blueprints, full-sized plans that require a plotter, again, not a problem. Plus, it's great to walk in and folks know me by name. Let The Shipping Store be your secret weapon to make your life or business life a little bit easier.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109508137692215896816", "name": "Captain_Redpill", "time": 1553722820451, "rating": 1.0, "text": "Won't be going back to this place ever.  The lady working there completely refused to serve me.  Went two miles down the road and had the service performed at the ups store,  without question.   Continue to watch your business fail.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116113654703355588114", "name": "Alexa Womack", "time": 1462886507362, "rating": 5.0, "text": "Such a welcoming store! I was greeted by every person in the store upon entering and leaving. They were even willing to get my package ready to go even though it was UPS. I was only there for a few minutes but I really felt that the employees enjoyed their job! Definitely recommend using them.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105389454577494015329", "name": "Brian Moran", "time": 1448147712160, "rating": 5.0, "text": "I have to say that I've never been taken care of in the way this team takes care of my needs. As a small business person myself, I appreciate the attention to detail, warm environment, and sincerity I receive when I walk into with The Shipping Store. I've read some of the other reviews and I would have to say that their prices are very fair. They provide a service that I have not seen matched with other big company chain stores. It is an absolute pleasure to do business with these guys!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107847402129431752361", "name": "Sandra Austin", "time": 1594243283093, "rating": 1.0, "text": "Anytime I mail from here it takes many days for the package to get anywhere.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106934267714093912358", "name": "Christina Morse", "time": 1463755936331, "rating": 5.0, "text": "The employees at The Shipping Store were super friendly and helpful! They did everything they could to save me money on shipping. If you have anything to ship, I would definitely recommend The Shipping Store. They made shipping a breeze!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "100668768891717817680", "name": "Jennifer Melcher", "time": 1464146531134, "rating": 5.0, "text": "We took in a fragile item and they packed it for us wonderfully. They were super nice and not just to us but to everyone that came in. They also showed us ways they could help our small business save money on shipping and printing. We will definitely use again!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "110547199723346370010", "name": "John Wallace", "time": 1563465552462, "rating": 1.0, "text": "They do not ship fedex, waste of my, yours and everyone's time.  Fedex sign in window, rude lady behind the counter..DO NOT GO HERE IF YOU ARE TRYING TK SHIP A FEDEX PACKAGE, FALSE ADVERTISEMENT..!!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106542589286602344651", "name": "jose villa", "time": 1575930733783, "rating": 1.0, "text": "Waste of time they say they ship fedex but they don't they are limited so you have to go to the one in Madison. Why even call it the ship in store where they can't ship nothing", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "118445472702982105366", "name": "susan hassett", "time": 1441054295523, "rating": 5.0, "text": "I have used The Shipping Store for many years to mail packages, have copies made and faxes sent. I appreciate the professional and friendly staff. Their packaging services help me save time and enable me to send packages hassle-free.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109596769324101350077", "name": "Tracy Roberson", "time": 1463225262109, "rating": 5.0, "text": "The staff are always professional and courteous when I bring things in to have shipped.  I wish the same was true of USPS. The Shipping Store has never lost any of my parcels with the many dealings I have had with the business. You can probably guess who has. I will continue to bring my business here as long as they are here. Thank you.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "115160726920482923383", "name": "Jenna Burfield", "time": 1558036223914, "rating": 1.0, "text": "Store staff was very rude. TERRIBLE CUSTOMER SERVICE!! I brought in a package to be shipped and asked for documentation stating that I dropped a the package off. The lady behind the counter stated that if I wanted a receipt that I could wait until FedEx picked it from their location and scanned the barcode (who is to say they wouldn't loose my package) or I could drive to Madison.\n\nEdited to inform that I was able to take my package to Walgreens for drop off. The Walgreens staff were friendly and promptly emailed me a recept for my records. THERE IS ABSOLUTELY NO EXCUSE for the pushback I received when I asked for a simple drop off receipt from The Shipping Store.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104087776520124817766", "name": "Mary McMahan", "time": 1440260718055, "rating": 5.0, "text": "Amanda saved me from losing my $4900.00 ring to a scammer on Craigslist.  I am so grateful to her and to this store for hiring her.  This experience has brought renewed faith that there are still people who work for businesses that genuinely care about their customers !!  Amanda, you are an angel, I will always be grateful for you and I pray blessings upon you and your family !!  The Shipping Store....don't ever let her go !!!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1462390895397, "rating": 5.0, "text": "Great people, great service!  The Shipping Store is a place where you will be taken care of.  Great folks!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117270700978745782182", "name": "AK Lee", "time": 1495585833241, "rating": 5.0, "text": "They offer a great service and and I even paid for the tape it was worth it", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117701923495067398210", "name": "L D", "time": 1377130186414, "rating": 2.0, "text": "Way overpriced. $0.75/each for stamps! Their shipping costs are also astronomical. I went there to ship a package and was quoted an amount so high that I thought it was a joke. It wasn't. I then went to Staples right down the street to get a quote from their shipping center and it was 50% less. Stay away from this place!", "pics": null, "resp": {"time": 1493327901599, "text": "Jill,\n\nFirstly, thank you for patronizing our business.  We take great pride in our friendly, high level of customer service.  As to your comments about our service charges,  If we weren't able to realize some level of margin over our costs, we would not be able to maintain a viable business or be able to offer the level of service that we so pride ourselves in.\n\nThanks sincerely,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "101710291188347059144", "name": "cassandra chittam", "time": 1447866224969, "rating": 1.0, "text": "Closest shipping place to our company.  We will be driving the extra distance to find an actual post office from now on.  Pricing is extremely high to send out items USPS.  When I called asking why they charged my assistant 10.74 for a small FLAT RATE box, I was told they do not honer flat rate shipping.  I then asked why did they not inform my assistant of this and they stated because all she said was she needed to ship these items. The lady behind the counter didn't know what she was doing.  First time she rang up the bill the total came to $4000 for USPS shipping. Wanting to use USPS services for your packages stay away from this place unless you want to pay double what you would if you went to the post office.", "pics": null, "resp": {"time": 1493328931183, "text": "Ms. Chittam,\nFirstly thank you for patronizing our store.  We take great pride in deliverying friendly, high quality goods and services.  As to your comments about USPS flat rate boxes, we do not offer them as they simply aren't big enough for average small shipments.   Per your comment about the cash register misring, we are sorry but we as humans are not infallable.  Fortunately, our system will catch any errors before the transaction is complete.  We apologize for the momentary delay.   Regarding your comment that our USPS prices are double the Post Office,  yes, we do charge a nominal service charge to cover our overhead and the ability to maintain a viable business thereby offering our customers a level of service they might not realize at the Post Office.    In fact many of our USPS prices are actually lower than the Post Office as we realize volume discounts that an individual would be unable to quality for.\n\nThank you again for your comments.\nSincerely,\nDon Cantrell\nPresident,\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "114990420188726533020", "name": "Daryl Piner", "time": 1441294603051, "rating": 5.0, "text": "Excellent service and very friendly people who will go the extra mile to help you.  I reccomend this place to everyone.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "117049772022464651991", "name": "Lee Bates", "time": 1452354104733, "rating": 5.0, "text": "Always friendly service and they do the job right. I drive extra miles for this quality.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "105075834732383199786", "name": "Elise van zandt", "time": 1464366522941, "rating": 5.0, "text": "A+++ service! Very friendly staff and super helpful!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112593356385282467328", "name": "Rodrigo Banzon", "time": 1464385634824, "rating": 5.0, "text": "Excellent service.  Outstanding staff!", "pics": null, "resp": {"time": 1493327616424, "text": "Thank you. We take great pride in our level and quality of service."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "111708991384449542120", "name": "Brenda Caudle", "time": 1448047458517, "rating": 3.0, "text": "Fast and friendly service. The cost was higher than expected.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "108899288135944656892", "name": "Misty Myres", "time": 1470087060480, "rating": 1.0, "text": "Very rude staff. I called ahead to verify all details and was told something different when I got there leaving me to rush to FedEx in Madison to ship my packages.", "pics": null, "resp": {"time": 1493327550562, "text": "Ms. Myres,\nFirstly, thank you for patronizing our business.  We pride ourselves in deliverying friendly,  high quality goods and services.  However, we are unable to access your or any other customers FedEx account number to charge shipping to.  We gladly accept FedEx prepaid packages at no charge, which have the shipping label already affixed.  Otherwise we are glad to create a label for you for which there would be a charge.\n\nRespectfully,\nDon Cantrell\nThe Shipping Store and more..."}, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "112071219118800431716", "name": "Karla Gibson", "time": 1463250306071, "rating": 4.0, "text": "People were Very nice and helpful.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "104660907043666156150", "name": "John Buckelew", "time": 1496504042314, "rating": 5.0, "text": "I use them for my mailbox, shipping, and FAX service. Professional in every way. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109557001826874830430", "name": "Jim Nichols", "time": 1463653639672, "rating": 5.0, "text": "Its like when Butch said to Sundance, \"Who ARE those guys?\"", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "109658838689981900939", "name": "Rodney Scott", "time": 1464175044310, "rating": 5.0, "text": "Had a legal document that had to be handled asap and the store more than exceeded.", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "116022121710779188150", "name": "Teresa Hutto", "time": 1464316250880, "rating": 5.0, "text": "They are great people!!!", "pics": null, "resp": null, "gmap_id": "0x886283ff5f4d1729:0x3b6e7505d247bc5b"}
{"user_id": "107250943834456592020", "name": "Mitchell Summerlin", "time": 1629083049437, "rating": 5.0, "text": "Competent and quick.  Very helpful.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "108553647455388713416", "name": "Tammy Gant", "time": 1620744683585, "rating": 1.0, "text": "I did not receive quality graduation invitations from this business. The product was comparable to Walmart. I submitted high quality images from a professional photographer, but the images on the invitations were dark and blurry. I received them after promised delivery date, so I had no choice but to go ahead and send them out. I took one of the invitations by the office within a few days, and it was agreed they were dark and blurry, but because I had already used the rest of them, it was just too bad. I spent almost $200 on something that was actually worth a fraction of that. I went to a printing shop to receive a quality product, but that is not what I received.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "114819579165540656009", "name": "Lacy Hollaway", "time": 1614713573666, "rating": 5.0, "text": "I love working with First Choice. The whole team is extremely talented and everything we've received is beautiful. I couldn't recommend them enough.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "106854970677737844425", "name": "Jack LaFountain", "time": 1615485705807, "rating": 1.0, "text": "Closed except to commercial printing. Only a hand made sign on the door to this effect.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "103238130878382489792", "name": "T P", "time": 1572271663092, "rating": 5.0, "text": "Without a doubt, this is the BEST printer in North Alabama. I have literally called every printer in Huntsville on various occasions asking to submit estimates and give timelines for completion and a) either there is no response to my requests (it's as though they don't WANT my business), or b) they're hilariously overpriced. First Choice has ALWAYS gone above and beyond to give me what I need and often times within very strict/unrealistic deadlines.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "108412204780546666114", "name": "Wanda", "time": 1515040446280, "rating": 5.0, "text": "Fast and friendly service every time! I had flyers made for the Mt Tabor Church Feeding Families Program and the employee gave us great quality, service and price as well. She told me that our downloaded flyer will be kept on file for future use.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "118404709471109113045", "name": "Daniel Pannell", "time": 1568301290426, "rating": 5.0, "text": "Great local company for all of your printing needs!  Mike and his teams have provided great service for our organization", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "113658473595973608215", "name": "Melissa Bombard", "time": 1547229073466, "rating": 5.0, "text": "What wonderful service and quality of product! Shanna and Mike are a fantastic to work with. Recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8862841ec5cf2f87:0x81f30f4d9976b607"}
{"user_id": "104710001909883449389", "name": "Kyle Boden", "time": 1616098867631, "rating": 5.0, "text": "I was in a real pinch and needed something printed quickly. Luckily I chose to call Black Warrior Printing. The person who helped me out went the extra mile to help me and was happy to do so. If you need something printed, I would highly recommend going to Black Warrior Printing!", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "100546182385437281803", "name": "Phoebe Mori", "time": 1600733999580, "rating": 5.0, "text": "Mr. Mike was so helpful and kind in helping me get a huge poster I designed in photoshop printed. He helped me select the proper size of paper that would be the least expensive for me, and he was even able to help me get it done in such a short time frame. Thank you so much, I will be back in the future if I ever need anything printed again!", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "117329105262504605376", "name": "Bailey (Bailey Jean) Barton", "time": 1603125112594, "rating": 5.0, "text": "If you are in or around the Tuscaloosa area, do yourself a favor and go to BWP for ALL of your printing needs. Mr.Mike has helped me with big projects and little projects. He is always so kind, helpful, speedy, and affordable!! The best in town by far!!", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "113721004771288362150", "name": "Rosemary W Buffer", "time": 1581005890660, "rating": 5.0, "text": "Quality Products & Service. Great Options (e.g. weddings, special events, etc.) Efficient, FAST & Reliable! Local Owner Mike is MOTIVATED to help you look great.", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "113080260705862823658", "name": "Brandt LaPish", "time": 1573667387169, "rating": 5.0, "text": "Mike is one of the best vendors I’ve work with. His customer service is outstanding!!", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "107244757148046775107", "name": "Lauren Wilson", "time": 1510699777633, "rating": 5.0, "text": "Mike and everyone over at Black Warrior Printing are awesome!  They are so great to work with!  I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "100483629532233684380", "name": "Stephen Shabazz", "time": 1453826203731, "rating": 5.0, "text": "Outstanding  Service! Fast Delivery! I Highly Recommend Black Warrior Printing For All Your Printing Needs.", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "106197601271409271074", "name": "Family Chiropractic", "time": 1457460635391, "rating": 5.0, "text": "Highly recommended!! Fast,friendly,awesome service with a smile. Mike aims to please!", "pics": null, "resp": null, "gmap_id": "0x888602e646b23389:0x407535d6f8ba5cf"}
{"user_id": "106368295851836027360", "name": "Paul Stahl", "time": 1527797354323, "rating": 5.0, "text": "This company has the most amazing service and professional assistance of any copy shop I have every worked with.   I needed a rapid turnaround order, bound and hand delivered in downtown with a 45 minute deadline.  This was for a large government bid.  They made my deadline with 15 minutes to spare!  I can't recommend them highly enough!", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "111487703116601419659", "name": "Southern Stream Live", "time": 1565023111756, "rating": 5.0, "text": "Kwik Kopy is definitely Kwik! They provide excellent customer service. We have always been overly satisfied with every order. Southern Stream Live definitely recommends Kwik Kopy for all your printing needs! Thank you guys!", "pics": null, "resp": {"time": 1595256112259, "text": "Thank you for your recommendation! We are delighted to have such an amazing customer."}, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "116431725098501731927", "name": "Destiny Williams", "time": 1522103094797, "rating": 5.0, "text": "Kwik Kopyshop is an outstanding business! We needed work done with a 2 day turn around time. Mark not only ensured that Kwik Kopy could do it, but he also offered recommendations that would save us money without compromising the quality of our product.\n\nIt was great working with Keri as well! She was always kind and calm, communicated effectively, and overall offered quality customer service.\n\nNot to mention, our signs look great!\n\nThank you, Kwik Kopyshop, for providing such great services!", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "105931976750454029240", "name": "Bryan Carter", "time": 1547757969539, "rating": 4.0, "text": "Excellent service. \"Kwik\" and quality work. I use them all the time.", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "115167867017837569190", "name": "Ronald White", "time": 1539870161622, "rating": 5.0, "text": "They are convenient, quick, and very polite and professional. if you need something taken care of in downtown Montgomery this is the place to go. I would highly recommend them for all of your needs.", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "111932578819044089775", "name": "Delores Hornsby", "time": 1516982991191, "rating": 5.0, "text": "Quick friendly service very sweet ladies", "pics": null, "resp": null, "gmap_id": "0x888e816948b5bb47:0xf72f69265cba865"}
{"user_id": "111625764152107590895", "name": "James “XDMAN” Nicholas", "time": 1480484800797, "rating": 4.0, "text": "If I absolutely need office supplies right now and cant order them online I will go here. The place is usually quite and empty for the most part so it is easy to get help from any of the employees. A plus is that they can make custom stamps for say and address while you wait.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "100307851399970983845", "name": "Bryan Thompson", "time": 1530312363811, "rating": 2.0, "text": "I tried sending a package through them and an employee was taking up the space for personal use on what appeared to be company time. I then showed them the QR code that they're supposed to be able to scan to print out a label. They didn't even know how to do that. The box I had needed to be taped so I asked if they could tape it. Not only did the employee only put a single, small piece of tape on it, but he didn't even know how to use the tape gun. I had to do it. Being the only person in line, it took me 15 minutes to get a label printed and box taped up.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "117675281028372093165", "name": "Ashley Robinson", "time": 1564089806515, "rating": 1.0, "text": "BOO! Equipment was all broken and employees didn't care. I waited FOREVER for my VERY important fax to send. When it finally failed they just shrugged and laughed. I had to leave. Signs were posted everywhere about malfuctioning equipment...it seems disfunction is the norm there. Boo.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "110374793158799620784", "name": "Casey Sugden", "time": 1470526813049, "rating": 5.0, "text": "The store is stocked full of all your office, school, and home essentials. Had no problem finding what I needed at good prices. Office Depot has a great inventory and a staff that is willing to help.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "116563331599717385137", "name": "jennifer kyle", "time": 1548970802940, "rating": 5.0, "text": "Great . Wonderful people work there. Best service.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "111211990436990578895", "name": "Shelley Potter", "time": 1563900657998, "rating": 1.0, "text": "I have done 2 different print orders there, and I will likely not go there again for a print order. Both times the order was marked as complete, and when I arrived I had to wait on them to fix it because there were mistakes.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "114572394885723631702", "name": "Tarrie Love", "time": 1519837603809, "rating": 5.0, "text": "Their staff is the best. I had designed an invitation, and was having trouble locating an envelope that would fit. I was despondent, thinking I would have to redesign the invitation, when a staff member asked if he could help. They sold me some envelopes out of the print shop inventory, and saved me tons of work!", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "109402495823722189620", "name": "Junion Pintal", "time": 1533233073571, "rating": 3.0, "text": "It's an Office Depot, at the time of this posting it has some decent back to school sales going on. Otherwise it has a pretty normal selection of office supplies and equipment as well as printing facilities.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "106880920236662412183", "name": "Mary Sumrall", "time": 1498614092066, "rating": 5.0, "text": "Good service and great food!  Yummy cheese biscuits just can't get any better.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "106504828892986907049", "name": "Mick McMeme", "time": 1526851079752, "rating": 3.0, "text": "well stocked, just don't be in any sort of rush to get out quickly.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "114540640988492744700", "name": "Bryan Taylor", "time": 1500735452162, "rating": 5.0, "text": "Staff is always very helpful and often will stop to assist.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "110244487795275770447", "name": "Nickie Dimartino", "time": 1554833265092, "rating": 4.0, "text": "Has what I need most of the time. Prices are just a little higher than other options.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "100175497397059310700", "name": "Caitlin Bonilla", "time": 1534627409917, "rating": 1.0, "text": "Horrible customer service, and very poor photo quality.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "104687254291789961897", "name": "Bill Mcallister", "time": 1545100810880, "rating": 2.0, "text": "No expertise in printers. Nice people but no real advice.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "103323050013210560635", "name": "Frog Price", "time": 1503619936465, "rating": 2.0, "text": "Very helpful staff. No electric buggy for me to get around in. Only looked for two of ten needed items because of walking limitations.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "107395011960801608209", "name": "Rob “Deacon Yomouf” Allbanks", "time": 1536849411128, "rating": 4.0, "text": "Very helpful and informative, ask for Josh!", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "106206392422205628821", "name": "dolores clark", "time": 1540336599687, "rating": 1.0, "text": "there was one desk left but they refused to sell it to me. i did not say give me would not sell it to me", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "111040201755190466061", "name": "Charles Pilant", "time": 1547142984477, "rating": 5.0, "text": "Had the HP ink cartridges I needed but didn't have the ink pen refills I needed.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "101696745753848461112", "name": "Hayden H", "time": 1469077540545, "rating": 4.0, "text": "Store sometimes seems messy or cluttered but often has great sales!", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "112825742290696556175", "name": "Gerica Cammack", "time": 1548819144320, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "116605468345830034914", "name": "Glenn B", "time": 1526491062354, "rating": 2.0, "text": "Usually hard to get someone to help. I just browsed through the computer section for about 10 minutes, and no one even spoke to me.", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "100433815120294764446", "name": "Med Conserv", "time": 1550806175548, "rating": 5.0, "text": "Did not find what I needed,  but the manager was great....", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "102457046691159895267", "name": "Wayne Plunkett.", "time": 1532095828872, "rating": 4.0, "text": "Great service, and Manager!", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "115993932641937164418", "name": "joycelyn moore", "time": 1512692199801, "rating": 5.0, "text": "Employees were very helpful", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "113552094024121364686", "name": "Lorie Anderson", "time": 1478232936185, "rating": 5.0, "text": "Well organized store", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "112986211529495162978", "name": "Stacy Brunner", "time": 1466816453484, "rating": 5.0, "text": "Love it!", "pics": null, "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "116774274507625637814", "name": "PATTY MOON", "time": 1574791274423, "rating": 5.0, "text": "(Translated by Google) 🦋Good store of everything for your work in office we found very good discounts🦋\n\n(Original)\n🦋buena tienda de todo para tu trabajo en oficina encontramos muuuuy buenos descuentos🦋", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdQM0NtD5hXv8AcLulrT_mWbRllZG6_TsNdubx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdiuB0vCnnzuBofrX3HXerHZOwWQen9DqpzQ8t=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLE5P1b_4ZFE-gjtym5Rl8C7W3oJNo9KUoJ4bW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMi8jRM9Lqej4UA2oBDhJtrxe8w0iWm2HuC9R0e=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOm-wdweyCw9yVuQWu4opIIma3YVtYIIB5MkpD8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWopkdZPgXYreaErpliJWCqrdVjONjhsUWr5F3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMan3aiWOPi-lFell2Wa69kc64Mwk6PY2rB_Lli=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTXV-TzTnsKB0sT3o4ghLA9VkVIwBR2-zcSDmF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFDWCcYICc2IiDO-fGSci6NvfS3cP923qDkDFH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNO8mCIANsk-cUZ118mSvefApeiF4n25J3tH8vp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTfI9krkqreaWV3RYgk4PDqr0koES9LrZk6jzt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPWXVgRR6_HsGHS9rwkpHPZBMZ41kZ1CXcOg8yR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM0F53ckqHc4vdycMSN1CFrBpzmbnGLf-dfoaKn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOVQq0w6PCaFTEkDN1tVoAq_6UzTMZDdxvdFx4p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwA4xofNAMrZzC7lBpqRijSCLNS4zTR-HAC7zD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwh51yYXIqp8imNjb2X5LrSlZUnuJlgss8FCuo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtoATo0khnBSO9XXXj3W17r2B-r3wB9Bck0dxO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMI9s4n8pFGVqnNr-IjZUJK8P40tQgN2b1w3kiY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUY-rkB7mjgvvmw_jJUV8ufBapaX1xp2n6e3V1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOs0nVAg-bxEdqOQWDFJTZ-LXX9zBQmIoHl78XR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7utfMZJy3ePgoXBP_RqZlzG_f95XVgxQ7gERf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgG8nafWyMoHkw7s8n1-tSJVQWdR6TfWdxBxK2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOx9Skb7L6fAiTc5frIifAX5WYWOh0SVxw9nOQA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMq4rdiF9xmw_2qMkLo1fbEd6xT1VWbJ0rxlQ17=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZHyaSHFcBmCaygdPik_CQkxCzlqMtWl2f7JQ2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8IF8UY5wGrChrElKtkuhkACsDMffct1mBaZ2k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAjUpg_CKSBaSz43iOHqjv9p2zrg5FcXdQ9ICA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOip8hiLWm7wv2Ckf6pB49Puq4gXzZ0ByOayUiC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNq2RCBqMfrQShIf7K8e7RlpBQ9_gNnQUtGCorN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNw6MHwGkXI4VRPNuEMkli1VGXdwpvPTG_xjOba=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5SFmlayRBlBelrXffSwpJqiLxb1AQJ1PNZvND=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOBoeRWlzVReRv96Hq7NPibuxs9jsPXEZnKNJ18=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOi9AOLa0dMer78yfTvmZSInfQbD1-LIo7kUE2g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMomNMDqxkfPpEIC1PiZnxCYVCW5Vu5GAgldcId=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOg1kGwiWqFp9EBKM_VLDUJztjrq_eLVqqk0uq0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0Ggv3adI7AUHkjVkWXbHz_AHvKr5N6cEJIKkT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMwL4RuBPGi3eRqwjOdKsQNkqTvj7F5zTWCjZ8i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbx7fsCbsMiq_805r5XiPkaIPZJtffINeIO3OD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMyYdnUMikdeBMlp3E0JqerycBb0bVnaxbv4ICa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890c607dcc0511:0x39255b66c10d50c3"}
{"user_id": "103350191571697816316", "name": "David Santos", "time": 1615504247003, "rating": 5.0, "text": "What can I say, well to start with, I was not ready for the change to a New Company because I have been with Xerox for over 25 + Years. I have always been treated very well from them so, NO I did not want to change. After a while of thinking about it SEVERAL MONTHS and my Son hammering me with the RJ YOUNG name, I did it. I purchased a machine from RJ YOUNG.\nAt first I was skeptical and to be honest I really didn't want to give it a chance (The Machine), but I did and after several months and barely using the machine I starting coming more around it and using it a little more & more. Then I began to really like it because it really printed so nice and pretty fast. It only took me  8 to 10 months to like it but you have to understand I WAS A XEROX Man and I thought there was NOTHING out there but Xerox. The Xerox machine has ALWAYS  performed outstanding and the SERVICE was the best, I was spoiled from that. However, I found out that there was more out there than XEROX! I found out that RJ YOUNG was REAL and believe me they have made a believer out of me. The Service that I thought would not compare to XEROX, has showed me they are just as good and if not BETTER. I never thought I would say that but it is so true. I can not believe how fast the Service Technicians reply to the service calls. They are always polite, and get me back up and running in a very quickly manner. They have such good personalities and a smile! As for the Ladies at the Home Office, Oh My How can you NOT like them. They are AMAZING. They always tell me they will have my supplies on the way or a Technician asap. IT IS JUST SO HARD TO PUT IN WORDS what RJ Young has done for my business. This is a very caring company and to be honest I am so glad that I have some of their product and that I was introduced to the World outside of XEROX. RICO machines have made my life SO MUCH Better and I am so happy that I have changed. If you are not a part of RJ YOUNG, you are probably missing out on good PEOPLE and Great Machines.\nDavid Santos,\nSantos Printing Co.", "pics": null, "resp": {"time": 1615567331024, "text": "Thank you so much for your feedback, David! We truly appreciate it."}, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "107060019385402490294", "name": "SBNABN Nelson", "time": 1596815182481, "rating": 5.0, "text": "RJ Young was very helpful! They were very knowledgeable and worked quick to help deliver and service our devices! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104972628291985606322", "name": "Tom Sommerville", "time": 1596541843874, "rating": 5.0, "text": "Great Company, top quality products, service and support. More that a Copier Company, They sell Technology, gear. and the Latest Security Camera;s Printers from desktop to Print Shop.\nAV installations, Managed Print and Network Services. Full line of PPE.", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "111391196337052808128", "name": "Chris Smith", "time": 1578669178257, "rating": 5.0, "text": "Great place with great people!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104420937470922492672", "name": "Sarah Kuykendall", "time": 1537234260415, "rating": 5.0, "text": "Best place to buy a printer and the service is amazing!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104122743274703043189", "name": "Ronnie Butler", "time": 1537250043970, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "100811678791818039001", "name": "Gabby Zepnick", "time": 1614789848248, "rating": 5.0, "text": "Angela who works at both the Northport and Tuscaloosa location has great customer service skills and is extremely personable. I remember her every time I go into the store. I can tell that she is genuine and cares about assisting her customers in any way possible and as best as she can. Thank you, Angela for your hard work and dedication!", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "113826335387058694826", "name": "Cristan Watership", "time": 1605634164113, "rating": 2.0, "text": "Well stocked store but the women handling the copies are not careful at all and seem confused by anything more than just a single copy. I would take projects to a more competent facility.", "pics": null, "resp": {"time": 1605637733661, "text": "Hi Cristan:\n\nThank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want for our customers. We will research this immediately.\n\nWould you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number, and a short recap similar to below? Please include the store #2274 in the subject line.\n\nWe are here to help!\n\nChloe :)"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112513237728603061182", "name": "Rose Sharples", "time": 1603206216790, "rating": 5.0, "text": "clean store and the staff was nice and they had what i was looking for at a reasonable price", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "116424778769689894094", "name": "Bryce Besherse", "time": 1611761095755, "rating": 1.0, "text": "Came inside instead at the counter for 20 minutes, the clerk proceeded to help 4 people standing behind me without even acknowledging me. This place should be ashamed of themselves. You've earned yourselves a report to your corporate office. Disgraceful business practices, I will never use Office Depot again.", "pics": null, "resp": {"time": 1612219324664, "text": "Hi Bryce, Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information and these details. We are here to help! -Emma"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "104791667644189869065", "name": "Deepsouth Kuntrydiva", "time": 1588532571626, "rating": 5.0, "text": "I love the entire staff at Office Depot(Skyland). There inventory is always stocked with what I need. The printing departments customer service\nis beyond excellent. Such a warm and inviting atmosphere.They are more like family.\nCharlotte", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "107373939516915055274", "name": "Stacy Bennett", "time": 1563683003062, "rating": 5.0, "text": "It's awesome the staff is friendly. It's clean and they always have what I need. They have every thing for school and the best prices in town . they price match also with no problem\nLoved it everybody needs to come check it out especially tomorrow no taxes July 21", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112465708765750357085", "name": "Jay Hughes", "time": 1574019049298, "rating": 1.0, "text": "This was my first disappointing experience at this store. I went to make self serve copies and and both machines were down. After 20 minutes of trying to bring them up, they offered to print behind the desk. I said great. What I didn't know was they were going to charge me almost double the self serve. I asked could I get the price matched because it wasn't my fault..they said No. It was a lose-lose. I left the copies there!", "pics": null, "resp": {"time": 1574178301090, "text": "Hi Jay, thank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want our Customers to have and we want to look into this immediately. I have shared your feedback with the Field Management Team responsible for this stores location. We would like to try and make things right. Would you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number. We are here to help! :) Emma"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "103079969129167579836", "name": "TriSeed", "time": 1596237779098, "rating": 1.0, "text": "Me and my wife went in to the store to find a USB head set for her job they looked it up on there computer after they looked they just said they couldn't find it and walked away not even trying to help us find something they did have that may work", "pics": null, "resp": {"time": 1596551175173, "text": "Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information and these details. We are here to help! -Emma"}, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112793675042594123554", "name": "Anna Henson", "time": 1543460742099, "rating": 5.0, "text": "HUUUUGE shout out to Ashley and the rest of the crew in the print department. I was in a bind needing a last minute print job and Ashely totally went above and beyond. She was very knowledgable and kind. She had great recommendations for getting the most out of my project and I will certainly be back with anything I need in the future.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "113753666233879809378", "name": "Allison Gage", "time": 1557088110083, "rating": 2.0, "text": "First, they tried to charge me double the price that was online for a print job, then when I went to pick it up all 375 copies had a black line running down the middle. Yes, they re-ran the job, but without any apology at all.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112923804550760433349", "name": "Craig Parker", "time": 1506784798059, "rating": 5.0, "text": "I was surprised. The salesman  was very helpful and showed me where everything was I was looking for. Very impressed.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "104476824455300035199", "name": "jim cantell", "time": 1383080366245, "rating": 1.0, "text": "Took my computer into this store. Talked to an extremely nice gentleman named Robert. Little did I know that he was about to try and screw me out of a ton of money! I left my computer there for a \"free\" check up. When I came back two days later, this guy had just deleted all my stuff off the computer. It had a virus and if I wanted to wipe all the stuff off the thing I could have done that myself. He then tells me that I owe Office Depot $240 for the work. And then stuck his hand out like I was going to give the cash to him! So now I have lost all my stuff off my computer. If you don't want to waste your time and money don't take your computer here.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "117759622648817544005", "name": "K. “Stunts” P.", "time": 1495217401387, "rating": 2.0, "text": "Ok so they messed up my computer and now no antivirus program will work on it. It's been a week now. Yesterday they said that they have absolutely no idea what's going on with it and that they were going to take it to another office Depot location to let them have a look. I call the other location a little while ago and the tech guy tells me he doesn't know what I'm talking about because he didn't work yesterday when my computer was to be taken to them. Anyways he's supposed to be checking it out and getting back up with me. I'm hoping they figure something out. On the plus side they are really nice people and seem to be taking responsibility so I gave them 2 stars.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "112441212817693469546", "name": "Agent Phrosty", "time": 1470335619924, "rating": 2.0, "text": "Staff lacks knowledge about products sold, particularly technology. Store cluttered with little attention paid to items fallen on the floor. Lines often several customers deep with only one register open. Several attempted purchases failed because items were not in stock, despite product boxes being on the shelves. Save the stress and the gas and go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "103857433614098597155", "name": "Rodney Lucio", "time": 1479350297314, "rating": 4.0, "text": "Office Depot always has great clearance sales. Staff is always helpful and courteous.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "106445416894083423253", "name": "Christie Parker", "time": 1500908910347, "rating": 1.0, "text": "They never answer the phone when I call to see if what I need is in working order, and every time I've been in lately, mysteriously, whatever machine I happen to need that day in the print services department is 'broken.' Not sure if the person is just being lazy or their luck is really that bad.  Do yourself a favor and drive across town to the other location.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "114644026785020341986", "name": "Sven Holiday", "time": 1551749431533, "rating": 2.0, "text": "Store is very dirty. Candy wrappers, bits of paper trimmings, and old gum on the floor.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "110429701100738620479", "name": "Bryan McElroy", "time": 1510370108970, "rating": 4.0, "text": "Great for all of your office needs.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "111989233813889467946", "name": "John Heathcoat", "time": 1546714864859, "rating": 5.0, "text": "The clerk took care of all my computer needs", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "115388145690955091870", "name": "Harry Knight", "time": 1545428627659, "rating": 5.0, "text": "Very helpful.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "101597814296287837258", "name": "Elizabeth Brasfield", "time": 1486431225327, "rating": 3.0, "text": "Great products and service.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "104037052230040687895", "name": "Iain M", "time": 1478739880397, "rating": 4.0, "text": "Stationary!!", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "110003547842982332467", "name": "Camilla Pickens", "time": 1474414519327, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "109541689856131342292", "name": "Jeremy Butler", "time": 1485867172440, "rating": 3.0, "text": "Well-stocked office-supply store. A lot of turnover in its staff, however. So the service is hit-or-miss.", "pics": null, "resp": null, "gmap_id": "0x88861cd5e2f0822b:0x98fa45d302977609"}
{"user_id": "102780644021638631749", "name": "Red Beard", "time": 1598459086555, "rating": 5.0, "text": "My go to place for copies and laminating.  You cannot do better than this guy.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "103538778209738568808", "name": "Timothy Townsend", "time": 1576857065154, "rating": 5.0, "text": "They do a lot of work for my business.  Exceptionally nice people, and are reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "113378398045060468241", "name": "Shallazar", "time": 1570568050270, "rating": 5.0, "text": "I had 50 missing cat flyers printed and was not charged due to kindness. They are nice people there.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "112051559563058676196", "name": "Dennis Mynatt", "time": 1525361678411, "rating": 5.0, "text": "I always enjoy visiting Copy World for my office printouts. Affordable prices, prompt turnover time on orders, and great customer service have kept us happy customers of Copy World", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "117830929214078936531", "name": "River City Roofing Solutions", "time": 1579635250794, "rating": 5.0, "text": "Fast friendly service.", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "104144378418079452571", "name": "Michael Hamilton", "time": 1473181472461, "rating": 5.0, "text": "The staff is very friendly and professional! They are reasonably priced, centrally located on 6th ave across from subway. This is the only place I will go get my work done as far as printing!", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "109629364138304967729", "name": "Zakaria Jamal", "time": 1530654623377, "rating": 5.0, "text": "very professional .i called on the phone.sent them my documents before i came to the store.i found them ready. the lady that was on the phone was very nice and patient .\ni highly recommend this store", "pics": null, "resp": null, "gmap_id": "0x8862841c4ef23a71:0x4daca25d036d5c6c"}
{"user_id": "106247392302653826464", "name": "Jonathan Borom", "time": 1610056512446, "rating": 5.0, "text": "I enjoyed the professionalism and the personalized experience.", "pics": null, "resp": null, "gmap_id": "0x888e8165282724f3:0x26feafd8570b0def"}
{"user_id": "116093588171461617329", "name": "Donna Dannelly", "time": 1579119761486, "rating": 5.0, "text": "Customer Service was excellent! Just like ordering from a small town business because they treat you like they have known you forever, but like a big city business because of all the services they offer! They walked me through the whole process, & kept me informed.  It was a  very easy process and an outstanding quality product completed ahead of schedule.", "pics": null, "resp": null, "gmap_id": "0x888e8165282724f3:0x26feafd8570b0def"}
{"user_id": "103374242086324184034", "name": "Samuel Tullis", "time": 1607391918672, "rating": 5.0, "text": "Outstanding, All-Round Organization!", "pics": null, "resp": null, "gmap_id": "0x888e8165282724f3:0x26feafd8570b0def"}
{"user_id": "111028038858557237066", "name": "TayTay Buckley -w- mojo", "time": 1591399356444, "rating": 5.0, "text": "It was wonderful. The whole staff was awesome.", "pics": null, "resp": null, "gmap_id": "0x888e8165282724f3:0x26feafd8570b0def"}
{"user_id": "106653187277600913602", "name": "Lee Gilmer", "time": 1539703653933, "rating": 5.0, "text": "Outstanding customer service-- McQuick will go above and beyond to help.", "pics": null, "resp": null, "gmap_id": "0x888e8165282724f3:0x26feafd8570b0def"}
{"user_id": "105684462577878849925", "name": "Missy Stevens", "time": 1567739233539, "rating": 5.0, "text": "i really am a happy customer", "pics": null, "resp": null, "gmap_id": "0x888e8165282724f3:0x26feafd8570b0def"}
{"user_id": "103276174758767265745", "name": "Patricia Holt", "time": 1596739244555, "rating": 4.0, "text": "Great service and reasonable prices...", "pics": null, "resp": null, "gmap_id": "0x8862847060e1dec1:0x358b9f835e75cdaf"}
{"user_id": "109712313376979401335", "name": "Brittany Brooks", "time": 1617126385541, "rating": 5.0, "text": "GREAT EXPERIENCE. I contacted the team to request a quote for Baby Shower invites. They were very nice and helpful. They had the invites printed and ready to go two days after I had first contacted them. They turned out GREAT. I will definitely be using them again in the future.", "pics": null, "resp": {"time": 1621966799810, "text": "Thank you Brittany for trusting us with your printing needs!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "112730755608037090042", "name": "Juana M", "time": 1621016914257, "rating": 5.0, "text": "Outstanding service! They went above and beyond to get our flyers printed for a Conference in Hunstville on very short notice. We needed last minute prints because our marketing literature was lost in the mail when shipping from Houston. We are very grateful for them! Thank you!", "pics": null, "resp": {"time": 1621966759404, "text": "We're so glad you contacted us and that it worked out for you!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108141785636663852938", "name": "Lloyd Thompson", "time": 1612798592846, "rating": 5.0, "text": "I can't say enough good things about these folks. They are more than prompt, super friendly, very helpful, reasonably priced, centrally located, and just plain cool. Everyone who works there has a nice attitude and they obviously care about the quality of the work and the needs of their customers. I wish I could leave 10 stars.", "pics": null, "resp": {"time": 1621967271052, "text": "Thank you very much for trusting us with your printing Lloyd!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104947697651991216587", "name": "Emily Key", "time": 1609801088743, "rating": 5.0, "text": "Phenomenal service. Minuteman is always so helpful to me when I am doing odd projects and need to figure out the best way to do it. Even when the job might seem unimportant or small.\n\nI received incredible support from them today after I wanted small precise card sized stickers done of my art and they did everything they could to help me figure it all out, even helped me budget and cut my own costs with the needless things.\n\nI never feel deceived or oversold on anything and the work always comes out high quality. I love this company and the people here, they really do care about their work. Aways my preferred choice for printing!!", "pics": null, "resp": {"time": 1621967328723, "text": "Thank you for making us your goto for printing needs Emily, I'm so glad we could partner with you!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "115665119594433046587", "name": "Amy McWilliams", "time": 1603458273713, "rating": 5.0, "text": "The team at Minuteman Press is wonderful! Highly quality products coupled with great staff makes Minuteman Press our go to printer.\n\nJonathan's team has assisted us with hundreds of projects for our company and our clients. We keep going back for competitive pricing, knowledgeable and responsive staff, and quick turnarounds.", "pics": null, "resp": {"time": 1604666893471, "text": "Thank you Amy!  It's always fun working with y'all!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103939048334353401700", "name": "Joseph Conwell", "time": 1606243732664, "rating": 5.0, "text": "Jonathan and his team are great at what they do!  Whether it is a small print job for stationary or a large commercial print job or vehicle wrap they are the best!  Theater handle all of my printing needs with quality and care!", "pics": null, "resp": {"time": 1606917192810, "text": "Thank you Joseph!  We really appreciate the relationship we've been able to build with you and your team!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "109295715829904418318", "name": "emily long", "time": 1592852954732, "rating": 1.0, "text": "upon visiting the shop i witnessed some unprofessional mannerism from the owners from the beginning. It should have been a red flag that i should have not ignored. The owner and his wife were arguing. Which i later found out was a constant occurrence. He even went to tell me personal things about his wife that no man should say about his wife.  The owner Johnathan was very unprofessional and exuded the attitude that he was above everyone else. The signs i purchased were of poor quality and not the correct size. I later called to complain and Johnathan was very rude. Did not care to hear a customers concerns. And talked to me like i was scum on the bottom of his shoes. I would not recommend this place at all the owners are unprofessional and the quality of their products is not good either.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106772910973652518388", "name": "Kimberly Hardee", "time": 1602184398871, "rating": 5.0, "text": "Jonathan and his team go above and beyond to produce quality products with great customer service! I use them for all of my printing needs!", "pics": null, "resp": {"time": 1602247420720, "text": "Thank you!  We really appreciate your business!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "114541687110494273846", "name": "Julie M", "time": 1378237169650, "rating": 5.0, "text": "We have used Minute Man for all of our school copying needs. Jonathan is wonderful to work with. He's very efficient and helpful. Every employee I have encountered there has been totally professional and very nice. It's always a joy to go in there. Plus, being able to utilize the website to upload documents for printing is so convenient. Everyone around me who has been in Minute Man comments on how nice everyone is. Copying is quick and great quality every time!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117757841839748531934", "name": "Kristen Bowen", "time": 1458323995892, "rating": 5.0, "text": "We had a great experience with Minuteman Press! I recently became the Marketing and Advertising Manager of a local company. Almost immediately, I began searching for a new printing company to build a relationship with. I met with Johnathan and reviewed their pricing, 1/2 of the prices we were getting from other companies. That was not the best part though, Laura, completely revamped our large brochure. It looks incredible! They were cheaper, did a better layout, much friendlier and cheaper than anywhere else we looked!\nThey make us look great! So happy we switched!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "112063233924215051379", "name": "Lauren Jones", "time": 1508956394312, "rating": 5.0, "text": "I cannot speak highly enough or recommend them enough! From save-the-dates, to rehearsal invites, to the whole wedding suite invites and menus and programs etc etc etc -- they went above and beyond to make everything look perfect AND IT IS SO AFFORDABLE! They have the nicest, most accommodating customer service and the highest quality work from the graphic design to printing to mail merging for envelopes. Save your headaches and money and use them.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106708779202925730278", "name": "Carolyn Dietrich", "time": 1465483520596, "rating": 5.0, "text": "I own a real estate company and a property management company in Madison.  We have been using Minuteman Press for business cards, magnets, signs, etc. for years.  We use them because of the great relationship we have with Dawn McDonnell.  She is professional, knows her products, has timely delivery and is incredibly nice!  I never inquire about price, because to me, it doesn't matter.  I get quality products with excellent customer service, and that is most important to me.  She also did a great job on our wedding service programs!  We highly recommend Dawn McDonnell and the staff at Minuteman Press!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "111238639357124474343", "name": "Minuteman Press-Franklin", "time": 1540298077308, "rating": 5.0, "text": "Outstanding team! Jonathan has been tremendously helpful to our company and I highly recommend them for any printing / marketing design project you may have.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106749335324908338173", "name": "Bippen Electric, Inc", "time": 1501541331455, "rating": 5.0, "text": "Just had Minuteman design, print and install a full vehicle wrap on one of our company vehicles. It turned out great! Our logo and text are reflective. So at night they glow when headlights hit them. Looking forward to having another one done soon. Can't say enough about the staff at Minuteman. Thank you! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108753108714030688194", "name": "David Rice", "time": 1515609157046, "rating": 5.0, "text": "Always prompt, professional, and the best customer service you could ever ask for.\nI’ve been a customer for 4 years now and I am always pleased at how well the Huntsville team always handles my orders, regardless of how much or how little time I give them.  They routinely produce my orders and have them shipped to the locations of my choice, and always on time and perfectly completed.\nA huge thank you for always helping me look good and professional.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "112143996543368815315", "name": "Shannon Harwell", "time": 1515613247587, "rating": 5.0, "text": "Minuteman Press has printed our company materials for the past few years.  They came highly recommended by someone else in the printing business and have created professional material for us in a timely manner.  I recommend them to anyone who needs something professionally printed.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "101325687715950030996", "name": "Erin Bloxhamcurtis", "time": 1515613277599, "rating": 5.0, "text": "I LOVE working with the team at Minuteman Press. All of our items are printed in a professional and timely manner. From graphics to delivery - they do it all!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106944561608081175142", "name": "Joshua McAlister", "time": 1484077460332, "rating": 5.0, "text": "Minuteman Press is great. They always complete orders in a timely and quality fashion. I've used them for quite a few things and have always been happy. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "102188842520207310290", "name": "A G", "time": 1363120347401, "rating": 5.0, "text": "Minuteman always does an above and beyond job with all of their printing jobs. Anything from one-off projects to thousands of items, Jonathan and the whole staff always make sure to end product is professional, clean, and cost-efficient. Even for (admittedly) last-minute jobs, I know I don't have to worry after I hand my artwork off to Minuteman--they'll get the job done! :)\n\nI will recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "116958345781014600308", "name": "Allison McReynolds", "time": 1450279305046, "rating": 4.0, "text": "I have used Minuteman Press for many professional designs and prints as well as personal prints for my wedding. I appreciate their timeliness with communicating to their customers and the care they take with their work. They definitely make it easy to keep coming back!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104942084764579884784", "name": "Alan Helms", "time": 1515601499471, "rating": 5.0, "text": "They are always willing to help and have a very fast turn around. They make doing business very easy with there delivery service!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "105622629993637745821", "name": "Wesley Moffett", "time": 1515605295883, "rating": 5.0, "text": "This was my first print job done via Minuteman Press, and I was very happy with both their customer service and the product they created for me. I will definitely use them again in the future!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104679082656021647590", "name": "Tina Parker", "time": 1355782343678, "rating": 5.0, "text": "Jonathan and his stafff are helpful and easy to work with.  They provide exceptional service and always meet our demands, especially when we are in a hurry!! Thanks for all you do, the whole staff at Home Mortgage of America.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104693908342767835481", "name": "Josh Henry", "time": 1465483154593, "rating": 5.0, "text": "This is the place to go for all your printing needs!! Dawn has a great talent for understanding what is needed to get the job done and in a timely manner. The prices are very fair in todays market. Love this place!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103960411672054648509", "name": "Brandon Morris", "time": 1515693874116, "rating": 5.0, "text": "Very helpful and friendly staff. Gave me good options and delivered great quality product.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "113717721904274283439", "name": "ashley dunwoody", "time": 1515601137788, "rating": 5.0, "text": "The staff is awesome!  They are always so friendly and helpful when I need them!  I would highly recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103651917231488934159", "name": "William Warrington", "time": 1515623195644, "rating": 5.0, "text": "All jobs were on time and within budget.  All problems were resolved quickly.  Great people to work with.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "105432166541899747740", "name": "Kallie Butler", "time": 1515606253759, "rating": 5.0, "text": "Great staff, amazing customer service and all the products that we've ordered have been exactly what we've asked for. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104693908342767835481", "name": "Josh Henry", "time": 1465483154593, "rating": 5.0, "text": "This is the place to go for all your printing needs!! Dawn has a great talent for understanding what is needed to get the job done and in a timely manner. The prices are very fair in todays market. Love this place!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "107840104192505670312", "name": "Dr. Debbie Hargett", "time": 1515604276339, "rating": 5.0, "text": "Wonderful customer service and quick turnaround on their work. Would definitely recommend Minuteman Press!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104679082656021647590", "name": "Tina Parker", "time": 1355782343678, "rating": 5.0, "text": "Jonathan and his stafff are helpful and easy to work with.  They provide exceptional service and always meet our demands, especially when we are in a hurry!! Thanks for all you do, the whole staff at Home Mortgage of America.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "111830868184765628044", "name": "Bo Thomas", "time": 1378398165288, "rating": 5.0, "text": "We use Minute Man for all of our printing needs. They always take care of us and offer many other products besides print. When I have been in a time crunch I have talked to Jonathan directly and he has always come through to get the project done on time.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103040660697176088352", "name": "danny newton", "time": 1515601955372, "rating": 2.0, "text": "Used their services several times. Every single time, they tell me it will be ready at a time and date. I show up after that time to pick it up, walk in, and it is NEVER READY! THIS IS EXTREMELY FRUSTRATING. No, I do not want to return later. No I do not want to sit in the lobby and wait for you to make it happen. Have it ready when you say it will be ready.\n\nLast time I was there the manager said, \"I thought I told you it would be ready tomorrow\" I proceeded to read him the email he sent to me the day before saying it would be ready. He said \"oh, I'll have it in 5 minutes\"\n\nI have decided to go with another printer.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108089085910743765406", "name": "Linex Marketing", "time": 1515605577591, "rating": 5.0, "text": "Love the customer service, support and partnership that MInuteman brings to our business.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1315958937318, "rating": 5.0, "text": "Great service, great prices!  Jonathan and his crew are the best in town", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "114374722355092505230", "name": "Timekee Turner PhD", "time": 1520799050487, "rating": 5.0, "text": "Always on time. Always perfect. #excellentwork", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117610076178447721976", "name": "Nichelle Fields", "time": 1375385337677, "rating": 3.0, "text": "They are great when you have a big Company name behind you, but if you are a small business owner, the service was very slow. No follow ups I had to follow up three times plus it finally took three weeks to get my order. Johnathon is not what he is cranked up to be either.", "pics": null, "resp": {"time": 1376688156810, "text": "Wow, I am very sorry that you had a bad experience with Minuteman Press and especially with me.  I am not aware of this situation.  Please contact me at your convenience so that I may be able to resolve the issues and hopefully provide a solution that will help.\nJonathan"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "102693635942299023596", "name": "Elizabeth Houssain", "time": 1371754060872, "rating": 5.0, "text": "Minuteman Press ALWAYS provides extraordinary service at a great price.  I recommend them to all of my clients, and they are so happy with their experience at Minuteman, they come back to me and thank me for the referral!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "100660179116163681659", "name": "chris denton", "time": 1515699366246, "rating": 5.0, "text": "Great customer service and a very detail oriented staff.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103061496153617449992", "name": "Jeff Lyons", "time": 1515601711521, "rating": 5.0, "text": "Everyone on the team is great - professional, friendly, attention to quality and detail, and always courteous and a pleasure to work with! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106095243764111417495", "name": "Karla Hawkins", "time": 1515610227014, "rating": 5.0, "text": "Very friendly and excellent work on our business cards. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "116423399150491827737", "name": "Marcus Elliott", "time": 1515693484128, "rating": 5.0, "text": "I trust these guys with our printing needs. Always helpful!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "118414997703837653650", "name": "Stephanie Cash", "time": 1515605165461, "rating": 5.0, "text": "Easy to communicate with and finished product looked great!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "116618245838620930244", "name": "Brian Bellomy", "time": 1515623305618, "rating": 5.0, "text": "Great Quality and great staff!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106248796164291440939", "name": "Jim Algie", "time": 1515625577522, "rating": 5.0, "text": "Had a short deadline to meet which was met with time to spare and all of this happening during the holidays.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117608643934852788872", "name": "Karen Sumerlin", "time": 1515682916320, "rating": 5.0, "text": "Great service, top quality work, excellent product!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117689088833133845635", "name": "Malcolm Taylor", "time": 1515605207428, "rating": 5.0, "text": "They do good work here.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108299925021361460427", "name": "Adrienne Matthews", "time": 1515614490482, "rating": 5.0, "text": "Quick and quality products. A+++", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108299925021361460427", "name": "Adrienne Matthews", "time": 1515614490482, "rating": 5.0, "text": "Quick and quality products. A+++", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "118287547268761178824", "name": "Jay Hixon", "time": 1515617298222, "rating": 5.0, "text": "Great folks and service!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104552545058395716550", "name": "Aaron Lutz", "time": 1498959581880, "rating": 4.0, "text": "They helped me with what i need but expensive to print just 3 pages of paper!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "110320296564179304572", "name": "Brandi Mason", "time": 1515604840228, "rating": 5.0, "text": "Quick and accurate service", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106583819761605020384", "name": "BamAlaBam", "time": 1515602408498, "rating": 5.0, "text": "Professional and on-time!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "101764762922306199319", "name": "Torrey Price", "time": 1515617487343, "rating": 5.0, "text": "Friendly, fast, and reliable", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104618065653989099647", "name": "Bryan Radcliffe", "time": 1400972656938, "rating": 5.0, "text": "excellent", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103039775318863817911", "name": "Brennen Privett", "time": 1608412207744, "rating": 2.0, "text": "This was the worst experience I think I've ever had in a store. The staff was horrible. I asked a simple question and the guy said I'll go get it from the back. I sat at the front for 45 minutes. Not only that but the girl at the online pickup/print area literally cussed out a customer. He left. Not to mention how messy and dirty the place is.\n\n(Edit) When I found the guy he apologized. I understand that people can forget things. 1star to 2 stars. (Because that chick was super rude and like I said she cussed a customer out)", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113416110037510340805", "name": "Messy Potamia", "time": 1576600811442, "rating": 4.0, "text": "Okay.  Heavy rains last night. Wonder if he spent the night in their men's restroom handicapped stall.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsYtawJYYLHTMXw6gS_XsMQ2Jes_AD3UCC-ga2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106623994486252017043", "name": "patricia mccoy", "time": 1621055645747, "rating": 1.0, "text": "Very rude and unprofessional person that works up front I would gladly take his job and I could guarantee that every customer that came through there would be helped and smiling when they walked out. I will never go back and I bought nothing.", "pics": null, "resp": {"time": 1621440487065, "text": "Hi Patricia:\n\nThank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want for our customers. We will research this immediately.\n\nWould you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number, and a short recap similar to below? Please include the store #2564 in the subject line.\n\nWe are here to help!\n\nChloe :)"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "114654694346750625790", "name": "Stephanie Mims", "time": 1607317657466, "rating": 2.0, "text": "Last 2 times I been in this store, staff was non existent. Couldn’t find anybody to help. Finally found one guy that didn’t offer that much help or knowledge. Went back in to return an item and cashier had an attitude for no reason. Store was messy and disorganized. Went down to Staples and had an awesome experience. Also spent $200+ there. So sorry about y’all’s luck. I won’t be back to this location.", "pics": null, "resp": {"time": 1607787227490, "text": "Hello Stephanie,  Thank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want our Customers to have and we want to investigate this immediately. I have sent this to the Field Management Team responsible for the store's location. We appreciate you bringing this to our attention.  Leesa"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100735062210791365838", "name": "BJ Winston", "time": 1607134748522, "rating": 1.0, "text": "This store needs more workers and ones who actually service all customers and not those of their same skin tone. Waited an hour for assistance. Found what I needed but no one was around to help except for the guy who went from the the counter to every other customer except me. Ordered the product online, finally ask for help again only to be told that the display could not be sold.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104940383881701636080", "name": "Shawna L.", "time": 1607093682986, "rating": 5.0, "text": "Five Stars to Tech Services Rep *Will*. He was extremely patient in helping me with issues with my desktop (White Dell AIO). His advise, skillset and overall mannerism was the epitome of customer service. Thank you Will !", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "117502573981034452638", "name": "Ashley Wright", "time": 1602525576880, "rating": 1.0, "text": "Went into store to buy two computer chairs for our household. We found the ones that we wanted at the price point we wanted. No one seemed to be available to help us, so we had to load them up ourselves. Once reaching the register, the chairs rang up $100+ higher than the signage. Even after verifying the price tag did indeed show the lower price, we were (rudely) told that since the sale had ended (6 days earlier, btw), they would not honor their price tags. Either update your signage when the sale ends, or learn something about customer service and own up to your mistakes. I've worked in retail before, and this is not how you treat customers.", "pics": null, "resp": {"time": 1602539983634, "text": "Hi Ashley, Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information and these details. We are here to help! -Emma"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "103954730020821207937", "name": "Brandi Westrom", "time": 1597165644070, "rating": 1.0, "text": "I ordered a printer to be delivered.  Shipping confirmation stated that I would receive the printer on 8/10/20.  I received another shipping communication after the printer was not delivered stating that the printer was not on the truck but delivery would be attempted again.  I contacted customer service and found out that I would have to reorder the printer to actually get it.  The email said nothing about needing to reorder!!!!   It is no wonder Amazon is doing so well.", "pics": null, "resp": {"time": 1597253819679, "text": "Hi Brandi:\n\nThank you for taking the time to provide us your feedback. I am so sorry to hear we let you down. This is not the experience we want for our customers. We will research this immediately.\n\nWould you please be so kind to send an email to socialmedia.service@officedepot.com with your best contact email and phone number? Please include the store #2564 and the order # in the subject line since this is more of a order issue.\n\nWe are here to help!\n\nChloe :)"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "112122945503852262767", "name": "Carl Esch", "time": 1548246265669, "rating": 3.0, "text": "I gave a 5, STAR review on this sight. HOW EVER this time when we went to pick up our new batch of Business Cards for our Band, they was not as well made as the original was. I gave the Lady at the desk one of out old cards told her to duplicate it. She said Very well. We ordered two boxes. When I picked them up they was off centered to the Left cutting My wife's right shoulder and part of her hat off. The lettering was so darn small and light colored we could see it with a magnifier glass. But when you hand a card to a Potential Client, you want them to be able to read it easily. If they have to strain they will chunk it. I cut the rating down to a 3 star. If it is no better I will cut it out all to gather. They have always been good there is why we went back.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104131972493762022041", "name": "kevin nguyen", "time": 1579522417916, "rating": 1.0, "text": "I went here to get my business gift certificate done. i gave them a copy of my old gift certificate and tell them that how i want, when i pick up and take it home until my boss take a look, he was so up set how poor and ugly it look, I regret that I didn’t look before take it home. I never come here again, staple is the best place to go", "pics": null, "resp": {"time": 1579619952733, "text": "Hi Kevin, Thank you for bringing this Customer service issue to our attention. I am so sorry for the negative experience you recently had at our store. I would like to send your comments to the appropriate team, so that this can be addressed properly. They will want to contact you for additional details. Kindly send us an email to socialmedia.service@officedepot.com. Please provide the store # in the subject line along with your contact information. We are here to help!   Emma"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "117967493083315865309", "name": "Dokter Xomby", "time": 1585357422659, "rating": 1.0, "text": "If I could rate zero stars, I would. Ordered a computer for curbside pickup, they assured me on the website and when called they had one in stock, but they didnt even have one. I drove from an hour away to be told they dont know what I'm talking about. I spent $566.74 and $10 in gas to be turned right back around. They were rude and kept avoiding me because it was 30 minutes before closing time. Now I have to wait 3 days to be refunded my money. I will never be doing business at this store again. Better off going to your local Goodwill or Walmart for a computer than this Office Depot. Horrible experience!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "107876123964304094875", "name": "Amy Gilmer", "time": 1531249993672, "rating": 4.0, "text": "It's an older store, but it's well organized and clean. Employees were all friendly and helpful. I did an online print order and one item was wrong. The employee at the print center fixed it immediately and everything turned out great.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104383117432529953986", "name": "Amber Puckett", "time": 1562285147887, "rating": 5.0, "text": "I love shopping at this store. I do a lot of personal and business transactions at this store. The staff always makes me feel at home and part of the family.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113876422452428467601", "name": "Donna Stamper", "time": 1539215198431, "rating": 3.0, "text": "I appreciate the Office Depot staff walking 20 feet to the ink section to retrieve the single black cartridge I ordered online. Apparently, the online ordering process is only convenient if the item you're ordering is not actually in the store and you need it to be.  Otherwise, you will spend just as much time, if not longer, standing at the online pickup counter trying to pick up the item you searched and already paid for online.  Office Depot scanned my driver license (I had already clarified that I personally would pick up the order, as the online form asks). I was asked twice if I wanted a receipt, once by the computer then by the rep (the receipt already came to my email,  along with the $ withdrawn from my account when I placed the order).  I had to sign the credit card panel.  Honestly, I don't have to do all that when I order $200 worth of groceries online for pickup at Walmart.  Office Depot--please make your online ordering more efficient.  Isn't that the point of ordering online--efficiency and convenience?", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "108034972724537357610", "name": "CC", "time": 1554511308006, "rating": 1.0, "text": "I ordered a poster print at 11:47 am because I needed for a trip I'm taking tomorrow and they claim to provide same day service. They said it would be ready by 7 pm. That gave them 7+ hours to have it done. When I came to pick it up 7pm, the guy behind the counter said, \"Yeah, I haven't even started it yet.\" No apology. When I got upset he asked when I needed it. I said, now. You had 7+ hours to get it ready! I won't being doing any business here again!", "pics": null, "resp": {"time": 1554813123962, "text": "Colleen, , I am sorry to learn that you were disappointed with the service you received during a recent visit to your local Office Depot store.  When you enter one of our stores you are our guest, and as such are entitled to be greeted by knowledgeable employees who are willing and eager to assist you.  From your comments, it appears that this is not the level of service that you received, and we regret disappointing you.\n\"\"If you would like I can place a note for someone to contact you back after they receive the complaint, would this be okay?\" If you would reply back to SocialMedia.Service@OfficeDepot.com . Please enter the store#2645 in the subject line.  Thanks  Shirley!"}, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111455539412458117269", "name": "S.Hazen Guthrie", "time": 1434644251369, "rating": 5.0, "text": "I have had two copying crises.  Not a normal Office Depot customer, I followed a suggestion to try  a particular Office Depot store in my city:  University Drive, Huntsville Alabama.\n\nCustomer service by the copy specialist, Katie, was just amazing.  There was no job too unusual, time limit too constraining.  She was creative, competent, and fast.  The second occasion, I was helped by the manager, Gary.  He set me up with the copy center.  Once again creativity, confidence, and service.\n\nAs an individual businessperson, my crazy schedule and over-full priority list were made so much easier today.\n\nThank you!!!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "110760664684586358913", "name": "Paulette Risher", "time": 1488836419565, "rating": 5.0, "text": "Yesterday, I purchased a 27\" Samsung Computer Monitor.  I installed it and was extremely unhappy with the quality of the color and resolution.\n\nOnly then did I go back and read the reviews on the Office Depot website and found that I wasn't alone in my negative assessment.  I called the store and the customer service manager could not have been more accommodating.  There was no whining or critique.  He simply told me to bring it back and they would give me a refund or trade it for another monitor.  This morning I took it back in and the man that helped me could not have been more helpful.  I bought a Dell (one with great reviews).\n\nThis is a true example of what excellent customer service looks like.  Thank you!!!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100463571348503777909", "name": "Justin Mullen", "time": 1536445083480, "rating": 1.0, "text": "Very disappointing customer service. Came in to pick up extra  mechanical pencils and note cards while in the area and went to the check out.  No one was running the registers, but three employees were behind customer service (2 high school/early college age male and female, as well as a older female)  The two young employees were actively engaged in a conversation, one makes eye contact while the other has back turned but continues with conversation.  The older female notices me as well and has to tell the younger female with her back 4 times to return to her register.  She goes to register, doesn't greet me or ask if I found everything alright.  Instead only asks if I want to sign up for a membership a few times after I decline repeatedly.  She puts my order in the bag and walks off before I can take my card out of the chip reader and back into my wallet.  Didn't even get a thank you for shopping.  Will not return again since staff doesn't want to make their customers feel welcomed or care if they make the sell. Will just order supplies from Amazon in advance, or go to Walmart in a pinch.  At least then I can use self check out.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102527292129215127093", "name": "Gwen Thomas", "time": 1539027136236, "rating": 2.0, "text": "I go to the copy department to get a couple of sheets enlarged. It will be ready in 10 minutes the employee says. I leave and come back in 30 minutes. There is a new lady behind the counter now!! Asking me all kids of questions because the first employee didn't do her job.\nSo frustrating!! So now I still have to wait.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102674955996533736309", "name": "Mattea Matthews", "time": 1564684152653, "rating": 1.0, "text": "Placed an online print order and called to see if it really was going to be ready at 7pm or if I could get it earlier. When I got transferred to their department the girl answered \"Printing\" I told her about my order and was told \"If it said 7pm then it will be ready at 7pm\"  then she asked if that was all I needed because she was busy. If ya hate your job that much go find a new one. If management reads this (I really hope you do) if your staff is too overworked and can't keep up with orders than put more staff on and if not then talk to them about customer service. I wont be ordering here again.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100271898301250768017", "name": "john morton", "time": 1570611180545, "rating": 5.0, "text": "Friendly staff. Nice set up of products.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113363326513093680070", "name": "James Burton", "time": 1483768165016, "rating": 1.0, "text": "Always available to help. (5 star)\n\nUpdate Dec 2016 (dropping to 2 star): went by on a Saturday and they were closed by 6:30 even though their sign says they're open till 9. The agent on the phone kept insisting their hours were listed as until 6, and i think he was only satisfied when I read him the hours sign that they really were listed as open until 9.\n\nUpdate Jan 2017 (dropping to 1 star): I contacted the company about the incident above, and they forwarded my message to the local manager but I have not heard anything after several days. Seems like they should want to fix this. . .", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "105582021345420739973", "name": "Joseph Chandler", "time": 1550546462492, "rating": 5.0, "text": "This is the 2nd time over the years we've bought a new computer from this Office Depot. They actually have really good prices a wide selection of computers both online and in store, and they are friendly and don't push anything you don't need.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102733867975260162027", "name": "A Shirey", "time": 1539009024194, "rating": 5.0, "text": "Awesome customer service... Oh did I mention their backpacks are 60% off - don't forget to check out all the Office Furniture upon ur visit and ask for Apollo Furniture assembly service", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111174830013976424422", "name": "Dark Hatter", "time": 1513448991803, "rating": 5.0, "text": "Miss Talitha, who works in the copy/print section is amazing.  She is extremely helpful and goes out of her way to help how she can. Someone please PROMOTE her!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111960708488432984299", "name": "Constance Tiller", "time": 1542403076129, "rating": 5.0, "text": "Always friendly service. I found some great deals today!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106098771998297944446", "name": "youknowit158", "time": 1526837693072, "rating": 1.0, "text": "Walked in to look at chairs for a home office. Now it had been open for 2 hours by the time I walked in, and there was trash all over the floor looks like they haven't clean that place in months. And with the horrible lighting of the place and garbage all over the floor and when I mean garbage I mean candy wrappers pieces of plastic receipts and random other things of trash this place just seemed disgusting in the lack of acknowledging my existence by the employees this place gets one star because there's no option for zero Stars. Myself and one other person were the only customers in the entire store literally the employees had us out number 2 to 1. And no one could even say welcome or even clean that place very lazy employees from what I've seen. I can safely say I will never go back to that place.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "114546726941031957510", "name": "Emilee Vinton", "time": 1535216928777, "rating": 1.0, "text": "Literally the WORST place EVER! Drive AWAY Drive Away FAST! Go anywhere else! I don’t even know why I keep coming back. Every time I go there to get print work done, they forget about my order and when I go to pick it up they never know what I’m talking about. I even go in an place my order in person every time and they still manage to not do their job! It’s ridiculous and then they expect you to pay full price for a huge inconvenience!!! I needed invites printed out recently and needed to mail them on a certain day. I told the lady she was like sure no problem. It will be ready at such and such time. Keep in mind I have a toddler in which it’s hard enough to make time to run errands. I go in with my toddler to pick up my order and I’m actually an hour later than what she told me because I figured they could use the extra hour.  Well when I get there, they had no idea what I was talking about and said the lady never put my order in. My stuff that I wrote down for her along with my usb drive is missing too. My toddler isn’t happy at this point and neither am I! Finally they find it and he said oh yea it’s not done sorry. I can have it done in like a few hours..... I was like well that’s not very helpful bc I needed them mailed today and he said yes I’m sorry. Okay well do you expect me to pay full price bc I sure as heck am not!!!!! Like don’t go here if you want things done right! This is seriously the worst place to go! I wouldn’t even give them a 1", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104545075494302764697", "name": "John Belt", "time": 1556921735641, "rating": 5.0, "text": "The really tall skinny guy was very helpful and very friendly. I'm sorry I don't know his name.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "102678947769045333164", "name": "Ashley Fountaine", "time": 1368633526673, "rating": 2.0, "text": "I found the other Office Depot location (at around Drake and Memorial) to be more helpful. The University location had my item \"in stock\" but they couldn't locate them. They had it marked on sale and it wasn't, according to the manager. So, I visited the other location and they honored the sale even though this location is the one that messed up and left their sign up.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "103085755643987955460", "name": "Rosemary Davidson", "time": 1509174111750, "rating": 5.0, "text": "Great customer service. They scan my documents for me, and had some great clearance items for the Teachers.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "103778460469912688270", "name": "Jessica Polk", "time": 1492274460216, "rating": 4.0, "text": "Awsome customer service. Store was very organized. Staff was more than willing to help.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "114026981524584990985", "name": "Lynn Howze", "time": 1502420374315, "rating": 5.0, "text": "Great customer service. Keep up the good work", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111129544741600877237", "name": "Deborah Lee", "time": 1498591823492, "rating": 5.0, "text": "I purchased PC, modem, etc. Gary was a terrific rep to work with. Very helpful and efficient.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "109842370976235742300", "name": "Chantaine Rhoe-Bulluck", "time": 1538448943755, "rating": 5.0, "text": "Great service, product s and prices! It's a triple win!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111782793664577030461", "name": "Cynthia Riddle", "time": 1549126533219, "rating": 5.0, "text": "The staff was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "105260404103213638759", "name": "Lee Mills", "time": 1493045360957, "rating": 4.0, "text": "The folks were nice but everything I needed was out of stock.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "110590860214026251235", "name": "David Brewer", "time": 1556140119066, "rating": 5.0, "text": "Friendly personnel and a great sale.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "104358650742509000140", "name": "Kayci Williams", "time": 1552514035915, "rating": 1.0, "text": "Called to get a quote to see how much a repair was. Got put on hold then they hung up.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "111735215265011923940", "name": "Michael Pukish", "time": 1549841727945, "rating": 5.0, "text": "I got help in the aisles from a salesperson without having to ask, and that's everything these days because it's so rare now.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "116491253873525216004", "name": "Paul Tidd", "time": 1534951397553, "rating": 5.0, "text": "They had everything we needed", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "112982658453514223724", "name": "Scott Smith", "time": 1533780873928, "rating": 4.0, "text": "I can really had a hard time finding an Android USB mini charge cable everything you have it's for an iPhone right.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "113611150480649721892", "name": "annette bramblett", "time": 1498003200042, "rating": 4.0, "text": "Customer rep didn't know what steno pads were (showing my age lol), but we found them. Manager checked me out so there would be no waiting.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "117337554654179213796", "name": "Robert Kemper", "time": 1527888017871, "rating": 4.0, "text": "Lots of selection except in the telephone area. Couldn't find what I needed.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100017718313714410450", "name": "AnnMarie Martin", "time": 1535423791045, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "115421978000062935647", "name": "Pat Stolz", "time": 1540493410623, "rating": 3.0, "text": "Hard to find someone to help find an item and then only had one of something i was looking for, but the south store had 5 in stock.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106947754633020076261", "name": "Arthur Arthur", "time": 1455417459403, "rating": 5.0, "text": "Customer service by the Computers specialist, Stefan, was just wonderful.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "107288027382965199795", "name": "Sabrina Faer", "time": 1511289517513, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100017718313714410450", "name": "AnnMarie Martin", "time": 1535423791045, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "106947754633020076261", "name": "Arthur Arthur", "time": 1455417459403, "rating": 5.0, "text": "Customer service by the Computers specialist, Stefan, was just wonderful.", "pics": null, "resp": null, "gmap_id": "0x88626959b3ed9123:0x19763ea56a2befdc"}
{"user_id": "100761976214908395391", "name": "Vic Robertson", "time": 1490471097961, "rating": 5.0, "text": "Great merchandise, great prices, friendly and fast service.", "pics": null, "resp": null, "gmap_id": "0x88626620fc1d943f:0xb0f4dce566519b45"}
