{"user_id": "104284601336320352933", "name": "Josh Bankston", "time": 1527276485159, "rating": 5.0, "text": "It was our first time doing an escape room and had a blast!   Good pricing and great staff.   Highly recommend if you're in the area and looking for something fun to do.", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "101766747953702143966", "name": "Anna Clardy", "time": 1525048555894, "rating": 1.0, "text": "This place was terrible. Some friends and I went last weekend and found the key to our room in 15 minutes and were confused because we’d barely opened any boxes. The guy working told us our room had been put back together wrong and items and clues were out of order and he didn’t know why. He wasn’t going to give us our money back or anything, we had to ask him if we could come back again the next week since it was a waste of time and money. He let us do that so that was the only good thing. We literally came back this weekend and our room was messed up AGAIN. We were missing clues and nothing made sense, we tried to call for clues/help multiple times and had to wait TWENTY minutes until after time ran out when the worker finally came back. So basically we spent 20 minutes looking for clues that werent there then we sat in our room for over 30 minutes just waiting on someone to come help us and let us out. It was absolutely ridiculous. We still never got our money back and we refused to come back again for another “correct” room. In addition to all of that, THE DESCRIPTIONS OF THEIR ROOMS ON THE WEBSITE ARE NOT WHAT THE ROOM ARE ACTUALLY LIKE. we were disappointed because we chose both of our rooms based on the online description yet when we got in both rooms the storyline was COMPLETELY different. Super unprofessional, the workers hardly know the clues or how the rooms work themselves. I wouldn’t recommend this place to anyone. One of my worst experiences and I will never go back. PLEASE SAVE YOUR TIME AND MONEY AND GO TO BREAKOUT TUSCALOOSA INSTEAD!!", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "100254566634886434276", "name": "Bethany Donaldson", "time": 1532131394524, "rating": 5.0, "text": "We had my son’s birthday party here. It was a huge hit with both parents & kids! The kids all worked together to solve the clues. Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "100728870009378546299", "name": "Kimberly Smith", "time": 1528041224021, "rating": 1.0, "text": "I wish there was an option for zero stars! This is the biggest waste of 20 dollars I’ve ever spent. The associate was nice but had no clue what was supposed to happen in the room. These five star ratings have to be fake! When I asked for a refund the associate shrugged and said nobody in the store can give refunds and to call the corporate office for a refund DO NOT GO TO THIS PLACE", "pics": null, "resp": {"time": 1528130642144, "text": "Hey Kimberly, could you send your contact information to mgr115@allinadventures.com. I would like to discuss this further with you. Thanks! Have a great day!"}, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "110799225172096933753", "name": "YourCurlfriend 1", "time": 1529805309786, "rating": 5.0, "text": "The rooms we chose were a bit challenging but the staff was great! We accepted the challenge twice within 7 days and we’ll be back again. I can’t wait!", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "113210343527376233168", "name": "Jeffrey Phipps", "time": 1531277953167, "rating": 5.0, "text": "Great way of putting down the phone and reminding ourselves the family can work together when you locked in a room.UCF the true national champions undefeated and beat Auburn.", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "110889252160616881746", "name": "Ryan West", "time": 1528407847468, "rating": 4.0, "text": "Pretty fun experience but not very elaborate. A little on the plain side with few props and decorations compared to other escape rooms that cost around $20.", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "109108308216974111176", "name": "Kristie Abernathy", "time": 1521326497747, "rating": 1.0, "text": "Only reason I picked a star was to write this review! This place was the biggest waste of money I’ve ever EVER spent!!!!! This place deserves a negative 5 stars!!!! Close it down!", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "110539708762770002541", "name": "Alex Gray", "time": 1532210445011, "rating": 5.0, "text": "Fun", "pics": null, "resp": null, "gmap_id": "0x8888a8323a9424a3:0x72e4c35ccfdc1c5a"}
{"user_id": "104585564767060405180", "name": "Earthangel888", "time": 1624037281239, "rating": 5.0, "text": "I've turned escape rooms into a personal hobby after my first experience in Texas a few years ago. Imagine my delight when I found one in the city of Auburn! The manager is very friendly,patient,and personable. Even though he temporarily lacks sufficient staff at the moment, he is still able to deliver a fun experience for everyone. He deserves a good staff !  Apply if you enjoy creating fun experiences for people! I plan on booking more rooms in the near future and bringing more people with me next time! My friend and I chose \"Imprisoned\" and I'm glad that he enjoyed his first escape room.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGzw4OY0dNKHESS2vpjIdsKdx4AmucudyS2tGI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIIz_hYafXU6-_nhQD_ecC4zYo7FI2uHlizH14=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTvEIbe56jHmyTSf5kwrE6uDPLF3nqHY8i86PU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106653883514727340718", "name": "Deborah Williams", "time": 1624050460170, "rating": 5.0, "text": "I had such a great time! It was a little hard but not too difficult and was super fun and satisfying, I got out with 1 minute! Our game master Dawson was great too! Coming back tomorrow!", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "109374819678635338670", "name": "DeMarcus Butler", "time": 1618693933772, "rating": 5.0, "text": "Had a blast! Went with the wife and two teenager boys and took on the medium difficulty room. The puzzles required thought and a keen eye, and were extremely fun to solve. Will definitely be back to tackle one of the harder rooms. Oh yeah, we made it out in time.", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "117782074099536510570", "name": "Dimode Rhee", "time": 1616698052385, "rating": 1.0, "text": "Event started normally with the game master explaining rules, objectives, & information regarding opening locks. Throughout the game, I noticed we actually had to open the escape room door to ask if anyone was there to help us—we had multiple hints. Even received extra with beverage purchases... the hint providing service was slow. Secondly, before the game started we were informed that the room had a tough lock to open where every group struggled... understandable... we received the hint to open the tough lock but failed to open so we called for assistance. Hilariously enough, even the game master struggled to open the lock... this whole process of opening one, tough lock took approximately 15 minutes—1/4 of our game time. With the intention of completing destroying the lock and my foot on the wall, I had to pull that one lock off with all my force after the game master left. But the game master assured that the time would get frozen—cool.\nThirdly, when time was up... the game master does not hesitate to end the entire game by punching in the last code spoiling everything. There was not a single thought in the game master’s mind to ask us whether we desired just a bit more time to crack the room... Game master simply walked in, punched the code, and we all stood there awkwardly, confused, & disappointed.\nWe complained about the lock... their response was there was prior information given before the game—true. We recommended them to please replace it immediately\nWe asked if there was anything that could be done to remedy our dissatisfaction with the room and the fact we paid $200 for one hour to elapse so unfortunately. They informed us that it was up to the owner to perform refunds, but the manager informed us with a possible discount sent through our email. It’s been a week... nothing. Obviously, their customer service skills need to be reevaluated.\nWas a real tragic end to a group’s Friday night honestly. We went in expecting to have fun whether we escaped or not... but we felt robbed. Hopefully future groups will not experience the extreme dissatisfaction like we did.\nPSA: DON’T PICK THE VAULT ROOM.", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "104497056871196122535", "name": "amy dilmar", "time": 1598143055931, "rating": 4.0, "text": "Thank you for a good time. Great customer service! Minor tweaks such as a few clues on laminated paper weren't erased from last group. Fun and enjoyable!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMaI5x_i3kyKYzRvX4WZkqxelrsExt6Vs9oI106=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-GUJpB1TtmiP6CB5zIDvvq_mT4v4ZpwB458XX=w150-h150-k-no-p"]}], "resp": {"time": 1598138004956, "text": "Hmmm, we’ll do better!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "111707006822944607155", "name": "jacob hootselle", "time": 1622322319640, "rating": 5.0, "text": "Excellent! Very fun. Fast paced and interesting theme. We almost got through it but no cigar haha.", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106529555344566194429", "name": "Trina Taylor", "time": 1610266208804, "rating": 5.0, "text": "Auburn Escape Zone is AWESOME!!!! We traveled from Columbus, Ga to check them out. It was worth the drive. The staff is professional and respectful. I love how they engage with the customers to make sure their experience is a great one. We will definitely be going back soon.", "pics": null, "resp": {"time": 1610381566543, "text": "Thanks so much, Z!  I cherish your review and can’t wait to have you back. We need all the support we can get during this tough time, bring some friends and play again!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "112181552472968566617", "name": "Deidra Allen", "time": 1618693844676, "rating": 5.0, "text": "Was our first escape room and we had a blast today! Erin was great, will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "104288554983324840790", "name": "Michelle Broome", "time": 1618100909814, "rating": 5.0, "text": "We had A blast! We did The Vault with 6 of us and it was so fun!! Can’t wait to do it again!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "102363088500959916375", "name": "Tanisha Scarlett Bellamy", "time": 1610311700421, "rating": 5.0, "text": "Erin and Emma what a great duo. Great service, loads of fun. We will be back soon. Thank you for the great first experience!", "pics": null, "resp": {"time": 1610381451669, "text": "Wow!  We really appreciate that, Tanisha. We’d love to host you again soon. Tell a friend!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "104056750624995180898", "name": "Drew Malinowski", "time": 1612042549072, "rating": 5.0, "text": "Myself and my wife came here and we were a little anxious at first but we left having fun and ready to come back soon! This was a great COVID safe date night!", "pics": null, "resp": {"time": 1612043606513, "text": "A million thanks, Drew!  Tell everyone because we need’em right now."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "102346506339915183369", "name": "Annie R", "time": 1616727172092, "rating": 5.0, "text": "Great customer service, the room was fun, and the game master was really helpful!", "pics": null, "resp": null, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "104315396452790504491", "name": "Paul Howell", "time": 1597464738426, "rating": 5.0, "text": "This was great fun. I took my 15, 13, and 11 year old kids to do the cabin. They worked together to figure out all of the clues for an entire hour and didn’t argue once, that alone was worth the price of admission. The puzzles were challenging but even the youngest was finding clues and solving the mystery. When we finished they wanted to do another room!  We didn’t that night but will definitely be back to try the next room.", "pics": null, "resp": {"time": 1598127925880, "text": "Paul, this is a great endorsement and exactly what we are looking for--disconnect from devices, connect with family/friends.  Can't wait to have y'all back for another adventure!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "113723273634620006455", "name": "Joseph Davis", "time": 1614543342460, "rating": 5.0, "text": "Very fun and challenging!! We went as a date and it was a great time!", "pics": null, "resp": {"time": 1614544665638, "text": "Many thanks Joseph. Hope you have many more dates and play all our rooms!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106670578195058903726", "name": "Brandon Jameson", "time": 1593319914552, "rating": 5.0, "text": "We love this place! They are doing what needs to be done re: COVID-19. The place is clean and open for business. What a great place to bring your family.\nErin is such a sweet young lady. So helpful with a great attitude.\nCan’t wait to go try our luck again!\nBrandon Jameson", "pics": null, "resp": {"time": 1593459108691, "text": "Many, many thanks Brandon!  We need all the help we can get spreading the word that we're open, safe and fun!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "111930288784889115774", "name": "Blair Owens", "time": 1593820847859, "rating": 5.0, "text": "Had a great time. Went in with 3 adults and a six year and 3 year old. We did the imprisoned room and found it somewhat challenging but the game master was great with the clues and tips. Would definitely do again!", "pics": null, "resp": {"time": 1593821159656, "text": "What a great group!  Be sure to try our other adventures soon. Thanks!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "100977667599294476249", "name": "Kelsey Grant", "time": 1593731086835, "rating": 5.0, "text": "This was our second time at Auburn Escape Zones. They have friendly staff and great rooms. Very clean facility and a fun way to get out while still being safe during covid-19. Will definitely be back soon!", "pics": null, "resp": {"time": 1593820976795, "text": "Can't wait to see you again soon.  Please help us spread the word, we need all the help we can get as we attempt to bounce back after the shutdown!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "111048080177602266086", "name": "Carsten Grove", "time": 1612670810676, "rating": 4.0, "text": "Difficult puzzles that were a lot of fun!", "pics": null, "resp": {"time": 1612671365661, "text": "We’ll take that. Thanks for your business. Give us a chance to earn that other star soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116314851762972347449", "name": "Kim", "time": 1596315083432, "rating": 5.0, "text": "This experience was so fun! We did the prison room and it was amazing!!!! It's clean, it's suspenseful, and makes you think OUTSIDE of the box!!!! Can't wait to come back", "pics": null, "resp": {"time": 1596785613781, "text": "Great review, can't wait to see you again!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "113070194160968413688", "name": "Deana Schrimsher", "time": 1594505490573, "rating": 5.0, "text": "Both of our experiences have been amazing! Erin and Ashlyn, our game leaders were very helpful and made the experience great. Our family loves the challenge of solving the puzzles and we have made it out both times!", "pics": null, "resp": {"time": 1594509166981, "text": "Amazing!  Y'all are 2 for 2.  Hope you'll try them all!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "105720112151696741942", "name": "Jay Hartin", "time": 1566704264256, "rating": 5.0, "text": "I've done 16 escape room across 3 states, and I was pleased with my experience with Auburn Escape Zones. Online booking was a breeze and our on-site service went smoothly. We did The Vault. The room concept was original and the puzzles were fair and evenly split between the two sections. Our game master, Riley, was great. She was attentive and helpful. We look forward to coming back to try the Puzzler Room.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMM4n4R4OhdDHHccAMEU07KtpIxO3e1Nt48r-7E=w150-h150-k-no-p"]}], "resp": {"time": 1566749536548, "text": "Thanks, Jay.  The idea of a cooperative room is daunting to some, so glad you enjoyed it.  I appreciate hearing that our Team is performing well!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "103680835070776396723", "name": "Nathaniel Lazard", "time": 1593994452224, "rating": 5.0, "text": "I had a great experience here. I’ve gone here many times before and with this pandemic I’m really glad to know the team here is working diligently to provide safe and clean fun for everyone by increasing room sanitation and adhering by state regulation.", "pics": null, "resp": {"time": 1594491269358, "text": "Thank you Nathaniel! We work hard to make sure that all of our guests have a safe, fun experience and were so glad that you enjoyed yourself! We hope to see you back soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116395311600480786723", "name": "Sierra Jacobs", "time": 1581882003075, "rating": 3.0, "text": "Their rooms are great. The people are great when I’m there, and they would get an otherwise perfect score, but everytime I call them no one ever answers the phone. There have been times where I’m literally in the middle of booking a room and at 1 min over the time I can’t book it. I tried calling to ask if it was still available, and no answers EVERY time. Even if I’m not asking about a room and just calling to ask questions, I haven’t gotten an answer. I shouldn’t have to drive there in person to talk to someone, or just book online to interact with you all.", "pics": null, "resp": {"time": 1581977012401, "text": "Hi Sierra,  as we are a 'reservations' venue we are usually not in the building when no rooms are booked.  The 1 min issue you mentioned is a feature where games are no longer bookable within 60 minutes of the start time--this protects us from someone booking the 4:00 room at 3:55 and we're not prepared--once that time has passed the room 'falls off' of the website.  As for you having trouble reaching someone we are rarely in the building during the week (unless a room is booked Wed or Thurs) and we're there answering calls during business hours Fri-Sun when it's busy.  Beyond that we check our voicemails X2 daily and respond to calls as quickly as possible.  We're so glad you enjoyed our rooms and would love to host you again, I recommend email or FB messenger if you don't reach anyone on the landline (if we're there we'll answer!).  Thanks for coming in!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "101607390540988777034", "name": "Rachael White", "time": 1581613896970, "rating": 5.0, "text": "Our staff of 17 went on day leadership retreat and Auburn Escape Zones did everything they could to make our experience awesome! We had a schedule change last min and they were able to graciously accommodate. We loved it and we all had so much fun!", "pics": null, "resp": {"time": 1581620871024, "text": "We are so glad y'all had a great time, can't wait to host you again soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "117965019269983555353", "name": "MoNique Gaines-Harris", "time": 1592953063489, "rating": 5.0, "text": "If you are looking for a challenging fun-filled excursion, you will definitely find it here! We are becoming somewhat of escape room enthusiasts, and Auburn Escape Zones is currently our favorite. We are closer to Columbus, GA escape rooms, but they were booked, so we decided to take the short ride to Auburn, and it was worth it. The staff was professional and accomodating while adhering to public health guidelines pertaining to COVID-19.\nWe did the Cave room and will be returning to escape the Vault!", "pics": null, "resp": {"time": 1593006405890, "text": "So glad y'all made the drive MoNique!  Josh at Exodus has some great rooms as well but we'd love to have you back to try all of our challenges.  Hope you get hooked like we are!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "107214753758027795272", "name": "Cyntell Crosby", "time": 1595121101926, "rating": 5.0, "text": "really fun! staff is extremely nice! husband and i tried the cabin was hard but still fun!", "pics": null, "resp": {"time": 1595249754249, "text": "Cabin is tough with 2 players, we'd love to see you come back and bring a few more players.  The more the merrier (and better chance of escaping)!  Thanks Cyntell!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116500453623955239371", "name": "Teck Four", "time": 1603596643351, "rating": 5.0, "text": "Erin was amazing!!! LOVE HER! 10/10 recommend", "pics": null, "resp": {"time": 1603816564729, "text": "Thanks so much, Teck.  She is pretty great.  Hope to see you again soon."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "112568327184158167249", "name": "Sarah Ingram", "time": 1595042708854, "rating": 5.0, "text": "Still open now during the pandemic and keeping the place neat and clean and giving out masks to wear!! Much needed time to get out w friends to escape being stuck at home all day!", "pics": null, "resp": {"time": 1595078714905, "text": "Glad you were able to escape with us!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "101721110777743478710", "name": "Mike Milford", "time": 1593892579449, "rating": 5.0, "text": "Super fun! Had a great time with the fam. Clean and safe, which was nice.", "pics": null, "resp": {"time": 1593962473844, "text": "YEEESSSS!  Tell a friend please!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "105415648691080794664", "name": "James Collins", "time": 1593317581972, "rating": 5.0, "text": "This is the most exciting place I have ever been to it's better than six flags ! But you have to use your noggin in order to find out don't rush!", "pics": null, "resp": {"time": 1593459153395, "text": "Boooooommmm, take that Six Flags!  Haha--we're a roller coaster of emotions!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "107982618375763155545", "name": "edneshea williams", "time": 1596322535834, "rating": 5.0, "text": "Had an amazing time s/o to guss he did great!", "pics": null, "resp": {"time": 1596785642481, "text": "Thanks EW!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "111871318230356298860", "name": "Tyrell Jones", "time": 1592702690436, "rating": 5.0, "text": "I had a blast I highly recommend everyone come out with their families it was awesome", "pics": null, "resp": {"time": 1592706781951, "text": "We really appreciate the recommendation Tyrell!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "104079678400322626975", "name": "Leslie F", "time": 1593105809460, "rating": 5.0, "text": "Super fun team building! Everything thoroughly sanitized!", "pics": null, "resp": {"time": 1593176751088, "text": "A million thanks, Leslie!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "110978388164676127979", "name": "Wifiproblems", "time": 1597551937700, "rating": 5.0, "text": "Really fun!!! Jordan and gus did great", "pics": null, "resp": {"time": 1598127831576, "text": "Yes, they're amazing!!!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "102683111327443283463", "name": "Riley Anna", "time": 1598751793503, "rating": 5.0, "text": "Staff was super chill and the room was super fun!", "pics": null, "resp": {"time": 1598755457820, "text": "Thanks Riley!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "115268105187054126618", "name": "Steven Dixon", "time": 1501520328130, "rating": 5.0, "text": "I've been to Auburn Escape Zones twice with friend and we have absolutely loved it. If you're looking for a fun challenge, I would highly recommend checking this place out!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_4Vec6M6hn8hy73MuAoSzNhsslnXW2IS-600s=w150-h150-k-no-p"]}], "resp": {"time": 1576765660826, "text": "Right on, Steven.  We appreciate it!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "115193197511850581579", "name": "Stephanie Yuhas", "time": 1565580610183, "rating": 5.0, "text": "Came from NC with the family to visit my son who recently moved to Auburn area for college. We wanted a family activity we had never done before. We googled family things to do in area and Auburn Escape Rooms came up. We booked the cabin escape room for 6 of us. We ESCAPED with 7 seconds remaining! We absolutely loved it. We now are gonna make it a family thing for us to do each time we come to visit our son! Highly reccommended!!!! The staff was amazing and so friendly and it was set up i side the building so nice and clean!! Thanks so much!\nTHE MCKAY FAMILY", "pics": null, "resp": {"time": 1568384763078, "text": "Amazing!  Talk about edge-of-your-seat!  So glad y'all found us, we can't wait to see you again."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "111077723481122608074", "name": "jason helms", "time": 1524950327541, "rating": 5.0, "text": "Fun time set up well challenging clues we didn’t escape so we’ll definitely be back. Great activity.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMx0jhhQGQeUmDghhIG94ZtAMdCAbQeNZD8G1dP=w150-h150-k-no-p"]}], "resp": {"time": 1576765592599, "text": "Thanks a million, Jason."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "113982020412637947480", "name": "Kim Golden", "time": 1495027752677, "rating": 5.0, "text": "So much fun! It was a great way to spend an hour. I did a room with my husband and we really enjoyed the challenge. The staff was super friendly, too. Great value for your time and money!", "pics": null, "resp": {"time": 1579108384939, "text": "Better late than never--thanks Kim!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "104942707090060120645", "name": "Todd Scholl", "time": 1480540042690, "rating": 5.0, "text": "Great time for my sales team from The Hotel at Auburn University!!!  We had several rooms and think it was so valuable want to return when they get their \"racing rooms\" ready so we can get competitive between departments.  Definitely need at least 3 people but 5 was a great number in our room.  We will be back and refer them for team building fun to our clients!", "pics": null, "resp": {"time": 1480546971548, "text": "Todd aka Tony, what a great group you brought.  It was so much fun having you guys escape with us.  Can't wait for you all to come back.  Thanks for passing our name along to people who stay at the hotel!  Make sure you tell them to tell us that Todd sent them!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "101884665059014665866", "name": "Andrew Smith", "time": 1483125345795, "rating": 5.0, "text": "Myself and members of our group loved Escape Zones! We met Dave, one of the owners, on the first night and had such a great time that we came back the next day. The puzzles were challenging but fun and the stories behind the rooms were great. We loved knowing that the owners came up with the ideas themselves and that it was not part of a franchise. I recommend visiting Escape Zones in Auburn!", "pics": null, "resp": {"time": 1483139442488, "text": "Thanks for the kind words. Your group was a lot of fun and we hope you guys slay Blackbeard!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "109027159012295140968", "name": "Miles Parker", "time": 1487127909966, "rating": 5.0, "text": "Staff was friendly and very punctual. We did the Imprisonment challenge, and it was a blast! Puzzles were challenging, but not impossible. Price is pretty good too. I'm excited to doing my next one, and I highly recommend Escape Zone to anyone looking for something fun to do.", "pics": null, "resp": {"time": 1487130767050, "text": "Miles, we enjoyed having you and Kittye out tonight!  Very impressed at how well you guys did.  Hope you bring your brother and friends with you next time!  Happy Valentines!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "109304698962147607207", "name": "Abigail Starns", "time": 1583024854584, "rating": 5.0, "text": "One of the better ones we've been too", "pics": null, "resp": {"time": 1583157599309, "text": "Love that endorsement, Abigail!  Hope we can have you back for our other adventures soon."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "114345465828955602011", "name": "Lakisha Haynes", "time": 1475992036935, "rating": 5.0, "text": "If you haven't been, go! We went with a group of people and it was both challenging and fun. We had an awesome time. All of the staff members were super nice and energetic/outstanding!", "pics": null, "resp": {"time": 1475992654725, "text": "Loved you guys coming out!  Such a fun group!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "105325169968461603764", "name": "Laura Runion", "time": 1566688839595, "rating": 1.0, "text": "Unfortunately I can't give this zero stars! I booked online and, we got there early. We were told there was another group in the room we had booked. We waited half an hour then were asked to follow a girl to the back where we were told they had \"double booked\" The room. They offered us  us another room, one not as difficult but didn't offer to comp it! We did ultimately take a refund but left really, really unhappy. We won't be back. There's another place in Moore's Mill!", "pics": null, "resp": {"time": 1568384581010, "text": "Laura, I'm so sorry for the experience you had at our business.  Having messaged with you personally I feel that we've resolved the issue as best as possible.  We are a family-owned small business that thrives on word-of-mouth advertising.  I don't want to make excuses as to why this scenario unfolded the way it did, only want to convey my sincerest apologies for the perfect storm of bad timing that your group walked in to (city sewer system was backing up into our bathroom, manager was out of the building dealing with that issue, newer employee didn't recognize that there were 2 groups booked for that time slot).  As a fellow SBO you know that there are occasionally times when all the holes in the cheese line up and things happen.  We do everything we can to mitigate these events but this time we failed you and feel terrible.  --Shawn"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "108277215577513647127", "name": "Holly Batal", "time": 1562212264935, "rating": 5.0, "text": "Great way to spend an afternoon. Older kids loved it!", "pics": null, "resp": {"time": 1563118414189, "text": "Many thanks for the kind words, Holly.  We'd love to host you again soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106952589281071998911", "name": "Sean Cornelius", "time": 1485057973553, "rating": 5.0, "text": "PHENOMENAL experience. They packaged AMAZING value while being super affordable. Some places charge as much as double. I'm not saying thoses places are not good....I'm saying we really enjoyed ourselves here. Meeting the owners and getting to know them and their story added to the value of the experience. I would recommend this place and we're for sure going back to beat the other rooms.", "pics": null, "resp": {"time": 1485058422640, "text": "Thank you so much for the kind words. We really enjoyed having you guys here and can't wait for you to come back."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "102218085921222897685", "name": "Brittany Israel", "time": 1482089567146, "rating": 5.0, "text": "I wanted to experience something new with my family as a big birthday celebration. This was the perfect outting for us as we are very competitive and love to solve puzzles and riddles. We chose the Cabin as our escape room and had the best time. The puzzles are all intriguing and require a little bit of focus and memory, but with some teamwork and brainstorming we were able to make it out just in time. We will definitely be back to try the other rooms soon, I can't say enough about Auburn Escape Zones. Thank you for making my birthday a day to remember!", "pics": null, "resp": {"time": 1482092411330, "text": "We are so thankful you chose us to celebrate with.  Hopefully fun memories were made.  Come back soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106174869228939726536", "name": "Tracy Brunson", "time": 1514775585758, "rating": 5.0, "text": "My family had the opportunity to make a memory that will last forever thanks to the kind people at Auburn Escape Zone. They graciously incorporated a surprise engagement proposal from our future son-in-law to our daughter. We did the  Black Beard's Brig which was exciting and very challenging. It required teamwork from the whole family. This was an awesome experience that everyone should try.", "pics": null, "resp": {"time": 1514778013785, "text": "Tracy we loved being a part of such a special evening.  It was humbling sharing this moment with you all. Blessings on you and your family."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106485013578862848314", "name": "David Moore", "time": 1570961939385, "rating": 5.0, "text": "Had a great time with my wife and kids! Just needed 5 more minutes!!!", "pics": null, "resp": {"time": 1570969911810, "text": "So glad y’all came in to play. Escape Rooms are a learned skill, the more you play the better you’ll do. Hope to see you again!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "117231414399239000448", "name": "Kaylee Wynn", "time": 1492313590216, "rating": 5.0, "text": "This was my family's first experience with an escape room. We were trying to find something to do with my kid brother and we were not sure what we were expecting when we pulled up, but we ended up having a blast! The employees are very friendly and helped made the experience more enjoyable! I recommend it!", "pics": null, "resp": {"time": 1492314931389, "text": "Kaylee we enjoyed meeting you and your family.  We pray you have a wonderful Easter and come back to do all our rooms!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "115001677242383435404", "name": "Leadership Lee County", "time": 1484406859828, "rating": 5.0, "text": "We took a large group (34 people) to Auburn Escape Zones and they were very accommodating. It is the best place for a corporate team building experience! Just let them know what you need and they will go out of their way to accommodate! Thanks for letting Leadership Lee County \"Escape Auburn\"! We had a blast!", "pics": null, "resp": {"time": 1579108497331, "text": "We've just hosted you again almost 3 years later.  So thankful for our loyal customer base!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116946537184015159061", "name": "Crystal Green", "time": 1493864915032, "rating": 5.0, "text": "Had a blast in the cabin room!  The staff was great and very accommodating for our group. Exciting challenge that definitely put our brains to work and proved to be a great team builder activity for us.  So glad we were able to experience this awesomeness!", "pics": null, "resp": {"time": 1493865642724, "text": "So glad we were able to provide a fun and challenging experience.  Dig deep and find that inner superhero and come back to do that room!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "115030226036206774878", "name": "Melissa Rohling", "time": 1476103494632, "rating": 5.0, "text": "We had a great team-building experience with out staff!  We had 2 groups break out of their rooms and then we had lunch brought in for our staff meeting.  Everyone had a great time and we all learned a little more about each other :)", "pics": null, "resp": {"time": 1476235312324, "text": "Can't wait for you guys to come back!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "105404239877709315456", "name": "Grant Gravitt", "time": 1499218679920, "rating": 5.0, "text": "The staff was friendly and the rooms were well-decorated and immersive. Our group of 4 very much enjoyed themselves and had lots of laughs trying to get through the puzzles. Will definitely visit again when I get the chance.", "pics": null, "resp": {"time": 1576765679567, "text": "Many thanks Grant!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "100883752850865189955", "name": "Tara Harbison", "time": 1481560136880, "rating": 5.0, "text": "We had a FANTASTIC time at Auburn Escape Zones!  Our sales team utilized AEZ as a fun team building activity and we more than happy with the outcome. We broke out into two different teams, and since we are competitive, it was definitely a race to see which team could \"escape\" first. I have personally recommended this place to several clients who are looking to entertain out of town guests with a fun outing.  Great addition to the Lee County Area!", "pics": null, "resp": {"time": 1482092450776, "text": "Thanks for the kind words.  Come back soon."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1597337687391, "rating": 5.0, "text": "Good customer service", "pics": null, "resp": {"time": 1597456459883, "text": "Thank you! We pride ourselves on excellent customer service. Be sure to tell your friends about us, & we hope to see you soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "103661203840905803532", "name": "Janet Merchant", "time": 1472358479984, "rating": 5.0, "text": "I went with my family and a friend for my nephew's birthday. We did \"Imprisoned\". I cannot give enough stars! The staff were so friendly, and it was a very fun atmosphere.\nA great time was had by all!!  So glad we have this in Auburn!!", "pics": null, "resp": {"time": 1579108647936, "text": "We're thrilled to be serving the A/O area and are thankful for customers like you.  Please come again!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "112256089493628082910", "name": "AHS DECA", "time": 1475868098696, "rating": 5.0, "text": "The AHS entrepreneurship class visited  Escape Zones , here is what a couple of  my  students said:\n\nEscape zone offered us a way to connect as a team for our tiger cage. Solving problems under stress allowed us to gauge each other’s strengths and test our team compatibility. This experience was crucial for the future of our Entrepreneurship teams.\n\nIt was really fun, I'd go again!\n\nI thought that Escape Zones was really fun. It was interesting to work together with people who thought differently from me to try and solve the room. It was an enjoyable experience.\n\nEscape Zones is a pretty fun place to go if you were looking to work with people together as a team and it would have been more fun if we got out!!!!!!!!\n\nI thought it was great. It was challenging in a good way!!!\n\nThis was a blast.  It was very good for me to build connections and work with a group. It taught me that depending on fellow group members isn't a bad thing and to completely succeed it requires trust and reliance on one another.", "pics": null, "resp": {"time": 1475868562965, "text": "We enjoyed having your group out!  What an impressive and well behaved group of young people.  We hope to have future classes come out.  Thank you for your kind remarks?"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "105466876997950661012", "name": "Brent Carpenter", "time": 1472771865508, "rating": 5.0, "text": "What a great experience!  I had the day of the appointment wrong and showed up and no one was there so I called.  One of the owners met us there within 15 minutes.  My daughter, wife, and I had a great time and will do it again!", "pics": null, "resp": {"time": 1579108600775, "text": "Brent we appreciate your business.  Please come again soon and try out our new rooms!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116253861815816672032", "name": "Brittany Edwards", "time": 1530556650302, "rating": 5.0, "text": "Did the cabin. Me and my partner have done a lot of rooms. We did not escape but we both agreed this room was amazing. I do not suggest this for groups smaller than four as it’s challenging and has a lot clues. However the room was amazing looking and the clues were clever and everything went with the story line. Only thing I would have done different is waited until I had a bigger group to do it. They are super friendly and it’s not like any other rooms I have ever seen", "pics": null, "resp": {"time": 1568384816944, "text": "We appreciate that feedback, Brittany.  So glad you found our room unique and challenging."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116865708878410126546", "name": "Will Daniel", "time": 1576120507798, "rating": 5.0, "text": "Great time and great karaoke", "pics": null, "resp": {"time": 1579108369612, "text": "Thanks for the stars, Will, but this may not be the right place?  No karaoke here, yet..."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "103957288152038094516", "name": "Keandra Baker", "time": 1592702665237, "rating": 5.0, "text": "We didn’t escape but it was so much fun!!!", "pics": null, "resp": {"time": 1592706747554, "text": "Thanks KB, glad you came in!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "118325684780605901049", "name": "Ayanna Thomas", "time": 1480625959155, "rating": 5.0, "text": "I went to Auburn Escape Zones for a work team building exercise! I enjoyed working together as a team to find and piece together clues to finish the assigned task. The staff was very professional and offered to be of any assistance before and during the game.", "pics": null, "resp": {"time": 1480533694850, "text": "We enjoyed your team coming!  What a great group.  Hope you come escape with us again!!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "107392468153623997923", "name": "Marlena Gillis", "time": 1481066338646, "rating": 5.0, "text": "Our team had the pleasure of going through a room recently. It was so much fun work together as a team and learning about each other's strengths. Staff was friendly and helpful! We are looking forward to going back and trying another room!", "pics": null, "resp": {"time": 1481067785528, "text": "Loved having your group.  Come back with your family or friends soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "107134704472342325960", "name": "June Milford", "time": 1593892576382, "rating": 5.0, "text": "super fun challenge", "pics": null, "resp": {"time": 1593962497635, "text": "So glad y'all came in--see you again soon we hope!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "106470238316757388349", "name": "Taco Master1334", "time": 1545541118342, "rating": 5.0, "text": "I've been meaning to leave a review for these guys for a couple of weeks now, sorry! But I wanted to say these guys were amazing! I used to them to propose to my now finacée and the workers were extremely helpful with everything! They helped me choose which room and where to do it at. They were extremely perfessional and didn't give anything away when it came for me to ask, so she was totally suprised. The room was challenging for her but also a lot of fun! I would highly recommend you use them!", "pics": null, "resp": {"time": 1563118484408, "text": "That's awesome!  We're so happy to have been a small part of your big day."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "114713459964271044242", "name": "Mary Isbell", "time": 1477766704450, "rating": 5.0, "text": "Great Experience! We escaped and had so much doing it! The staff is very friendly and made the experience unforgettable! We WILL be back to do the other rooms!", "pics": null, "resp": {"time": 1477767060412, "text": "Loved having you guys here. Can't wait for you to do the other rooms."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "115895740638265816326", "name": "Hannah Wright", "time": 1475789298749, "rating": 5.0, "text": "This is the coolest place.  So fun and challenging!  You will want to do all the rooms.", "pics": null, "resp": {"time": 1579108544388, "text": "Thanks a million, Hannah.  Your opinion means a lot to us.  Hope you'll find your way in to try The Vault."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "117235382099466504682", "name": "Kirkland Floyd", "time": 1498182864279, "rating": 5.0, "text": "Auburn Escape Zones is by far one of the best things to ever come to town. The experience was challenging, thrilling, and boggled my mind.", "pics": null, "resp": {"time": 1498186656746, "text": "Kirkland so glad you and tHE  gANG could cone.Hope you come back soon!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "108312664337576357560", "name": "Heather Johnson", "time": 1507378046635, "rating": 5.0, "text": "Great fun for the entire family! Would absolutely visit again!", "pics": null, "resp": {"time": 1576765636714, "text": "We hope you will, new rooms available now!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "112767110888073032033", "name": "Joice Milare", "time": 1480531475181, "rating": 5.0, "text": "We had a Team Building outing at Auburn Escape Zones and had the most fun time! Highly recommended!", "pics": null, "resp": {"time": 1480533702234, "text": "We enjoyed your team coming!  What a great group.  Hope you come escape with us again!!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "112405521331789204111", "name": "Mark Summerford", "time": 1495317031893, "rating": 5.0, "text": "I took our office staff to The Escape Zone as a \"team-building/get out of the office for some fun\" event, and it did not disappoint.  Everyone had a great time, and we all want to come back and try to escape again.", "pics": null, "resp": {"time": 1495317732019, "text": "Thanks Mark for the kind words!  Glad your group had a good time.  Can't wait for you to come escape with us again!"}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "109703015700716329653", "name": "Fenton Hughes", "time": 1486271461741, "rating": 5.0, "text": "Really fun group activity. We did three challenges in one weekend! Very kind staff.", "pics": null, "resp": {"time": 1486273779394, "text": "Fenton we enjoyed having you all to AUEZ!  Fun seeing you all get better and better with each room.  Have a safe trip back to Utah!  Come see us next time you are in town."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "116663372078576487103", "name": "Jessica Hopper", "time": 1474235502232, "rating": 5.0, "text": "Good clean fun. Staff if very friendly. Will be coming back and referring a friend.", "pics": null, "resp": {"time": 1579108566313, "text": "Many thanks, we'd love to host you again soon."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "102690081987498334761", "name": "Elizabeth Lundey", "time": 1478015254417, "rating": 5.0, "text": "Great experience for my high school juniors and seniors!", "pics": null, "resp": {"time": 1478016153138, "text": "Such a great group.  We enjoyed having the Ambassadors escape with us.  Come back soon."}, "gmap_id": "0x888cf2abcd659339:0xf3ac36f480162009"}
{"user_id": "114735781732581091408", "name": "Mike Breeding", "time": 1612134212505, "rating": 2.0, "text": "I was sorely disappointed in the birthday party we scheduled. The party was scheduled 1:00-3:00. We showed up around 12:50 assuming it was going to take 10-15 minutes to get all 6 kids setup and ready to play. Unfortunately that wasn’t the case. The kids didn’t get setup and playing until around 1:40 (leaving only an hour to play).  At 2:40 the kids we sent into the party room to eat pizza and open presents.  At 2:50 the guy came in to inform us that we had to be out of there within 10 minutes.  Keep in mind that we paid for 2 hours of playing for the kids and it took 45+ minutes before they all could start playing. The guy that was working informed us that it normally isn’t this troublesome and he wasn’t sure what was wrong  ( we even had a PC crash in the middle of a game within 5 minutes after we finally got it up and running). I will say the only positive to the experience was how nice the staff was but for $275 I expected to at least get an hour and 40 minutes of playing time before eating and we only received maybe an hours worth.  Not worth the money that was spent.", "pics": null, "resp": {"time": 1612139209891, "text": "We are so sorry to hear this. If it is okay we would like to contact you and offer 1 hour of free gaming for each child who attended.This is not our standard for our parties and we are so sorry. We do hope you give us another chance to redeem our store. We hope to speak to you soon."}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "107996180787530505362", "name": "Mckinney Chattman", "time": 1583188848779, "rating": 5.0, "text": "Glad you guys are here.. It's been a fun time the two times I've been there.  🙌🏾💯💙 Virtual Reality with the Zombies is my favorite", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9Tp3jQ7e3RmtiMZPvW2hzwwfZdfnHDdO8Mo-r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0r9U-PQNMVG0flB6KCIU5v5nh1kShq1fz8Sjk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOfVQDh9uAnX5CqC9fJ-O_QoyHppE0b1fpTephn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4eeKVDfGqZe3n6snwmsgNlEGEz3ufb2ImMYcZ=w150-h150-k-no-p"]}], "resp": {"time": 1591661084856, "text": "Thank you for visiting! Hope to see you again soon!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "109178846307674777819", "name": "Katie Farley", "time": 1614283924498, "rating": 5.0, "text": "Great games for people of all ages and interests! Staff was super friendly as well. I liked the rollercoaster simulator the best!", "pics": null, "resp": {"time": 1614299672796, "text": "Thank you so much for your positive feedback! We are so happy to hear you had a wonderful time. We hope you come back and play again!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "107862510298209158875", "name": "Marisa Hamilton", "time": 1622687673536, "rating": 5.0, "text": "Best Surprise Birthday Party! The staff was excellent!", "pics": null, "resp": {"time": 1622688490811, "text": "Thank you so much for the positive feedback. We are so happy to hear you had a five star experience! We hope your party was everything and more! Thank you again for supporting a small business"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "117533301095283791142", "name": "Josh Serena", "time": 1580351023013, "rating": 5.0, "text": "Great Venue! I came here with my girlfriend and it makes a great date night or a cool family night out. The staff is super fun and helpful. The restaurant is also super good. It's not just cheap arcade food, it's super fresh and made right in front of you! Highly recommend whether you're into video games or not! They really have something for everyone; 6 Solo Virtual Reality Booths, 2 Multiplayer Virtual Reality Booths, a ton PCs, 7 XboxOnes, 7 PS4s, and 2 Custom Virtual Reality Racecars!! The restaurant has custom made pizzas, subs, salads, wings, soft drinks, 20 beers on tap, and a few wines too!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN243hWZup0llhJuoxiJrVJGvuKobJVa0uORIU6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOBBCkReFiwysRsBH-8fTKeXGzxWHw5y5g6sVax=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPi1lBcq5ThDYOdSFPCJsU4AyAXWSKTi94lc2I9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGOFNtQVqXNInQYmgISiArWQc5G2GoymKxe853=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMwxc6o__fLKDeYX5KHxO9nxFvNJm1q5uAGMg-h=w150-h150-k-no-p"]}], "resp": {"time": 1580536527066, "text": "Thank you for your review! So glad you both had a wonderful time!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "113163572496888376497", "name": "Malik Sealey", "time": 1620743521153, "rating": 5.0, "text": "Great place to chill, good staff. But it does not have Blade and Sorcery.\n\n#hateschool123", "pics": null, "resp": {"time": 1621124219981, "text": "Thank you so much for your review! We will look into adding your recommendation!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "113536450336876068616", "name": "Derrick cain", "time": 1614137493749, "rating": 5.0, "text": "I was blown away. I am not a gamer but my kids love to play and I actually got to spend quality time with my children playing VR and console games. The staff was tremendously helpful making me feel like I was part of the gaming community. I enjoyed it so much we booked a birthday party and all 10 kids that came could not believe how fun it was to have an arena for them to compete in. They felt like professional gamers. I could play the VR games all day. They have cold beer on tap and a restaurant with food that was really good and not crazy expensive. We are making this a monthly family fun day.", "pics": null, "resp": {"time": 1614203854537, "text": "We are so happy to hear you enjoyed your visit. We appreciate the positive feedback. Thank you for your review and hope to see you again soon!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "101439746308604167954", "name": "Mallory Shaw", "time": 1614201963352, "rating": 5.0, "text": "Very satisfied with our experience at the ePLEX! Clean, friendly staff, and very accessible for person’s with disabilities. Will definitely be going back!", "pics": null, "resp": {"time": 1614203798620, "text": "Great to hear! We certainly value the feedback. Thank you for supporting a small business during this time. Hope to see you all soon."}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "111569235445985902747", "name": "Erin Lovett", "time": 1596397312503, "rating": 5.0, "text": "If you haven't been you have to go. I knew my son would love it but I ended up loving it too! Super friendly and knowledgeable staff", "pics": null, "resp": {"time": 1596401069546, "text": "Thank you so much for visiting us today! Our staff loves to help and we are so glad you ended up loving it too! Come back and Game On with us anytime!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "103941952452987769345", "name": "Johnny Karris", "time": 1609357292167, "rating": 5.0, "text": "A great place to play games online with your friends or to throw a party great prices", "pics": null, "resp": {"time": 1609546473264, "text": "We are so glad you enjoyed your experience. Thank you so much for your review."}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "106987290876992075591", "name": "California21", "time": 1596659313498, "rating": 5.0, "text": "Its a MUST GO TO for gamers of all ages!!\nAll of the staff were so nice ,attentive, respectful and kind. Two thumbs up for excellent customer service!\nThey have so many gaming options available at your finger tips you can easily spend hours there and enjoy every minute.  The VR head sets are a definite fav. Eplex is a good clean environment and a wonderful place to go hang out, relax and game hard, its easily 5 stars. I can't wait to go back.", "pics": null, "resp": {"time": 1596655565587, "text": "We are so glad you enjoyed the ePLEX! We prioritize our cleanliness and customer service! Thank you for this wonderful review! Come back and Game On with us anytime!!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "104985655568289271753", "name": "Jennifer Cook", "time": 1598191924657, "rating": 5.0, "text": "I took my six year old because he said his dream was to be in a video game. We did the VR experience and it was amazing! I’m not a gamer and I had a blast. I also earned cool mama points!", "pics": null, "resp": {"time": 1598199305337, "text": "Thank you for your review! We are happy to hear you enjoyed your Virtual Reality experience! Game On!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "105557464896918939609", "name": "Kelsey Luckianow", "time": 1581160483572, "rating": 5.0, "text": "This is one of the best additions to Birmingham. We went recently for our friend's 31st birthday party (yes, I said 31st). It was awesome. We had the Matrix package for the Virtual Reality pods. There were 10 of us, and we all had PLENTY of game time for 2 hours. We also had wonderful service for our party. Eve and Ian were great! I'd say if you're looking for a fun time out with friends or family, this is definitely a place to go. We will be back for sure!", "pics": null, "resp": {"time": 1581204833717, "text": "Great to hear! We certainly value the feedback. Hope to see you all soon."}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "106708620237881186292", "name": "Brenda Jones", "time": 1582394046052, "rating": 5.0, "text": "My grandson had his Birthday  party here and is is a great  place for  birthday parties!  The  staff  here are amazingly  friendly and welcoming and helpful!   The bathrooms are  so clean!!!  That's one of my pet peas ( clean  restrooms).\n\nEva Seidel  she greeted  us with a  big smile and  she is so  amazing!!  I will come back just because she was so incredibly nice to us!", "pics": null, "resp": {"time": 1591661137386, "text": "Thank you so much! We hope he had a wonderful birthday!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "103645267401501009455", "name": "Randy Rich", "time": 1577564774570, "rating": 5.0, "text": "This place is phenomenal. Everything we played was great. Very helpful staff for us ole timers!", "pics": null, "resp": {"time": 1577568752408, "text": "We are so happy to hear you enjoyed your visit. Thank you for your review and hope to see you again soon!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "115313433511168760863", "name": "Jesse Stewart", "time": 1582769269605, "rating": 5.0, "text": "Awesome location. There is plenty of space for events and their hardware is great. This is the best esports location in Birmingham.", "pics": null, "resp": {"time": 1591661058775, "text": "Thank you so much for your review we do appreciate it!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "115480573574872114185", "name": "Noah Holmes", "time": 1581134904360, "rating": 5.0, "text": "Simply amazing. Loved how good the food was, amazing tournament experience. Kind people and great staff!", "pics": null, "resp": {"time": 1581204646611, "text": "Thank you for your review! We are happy to hear you enjoyed your experience. See you again soon!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "102851039670362303037", "name": "Ainsley Cohn", "time": 1578944703123, "rating": 5.0, "text": "Eplex is really a fun time for the whole family. We visited all the way from Baton Rouge (6 hrs away) because there is nothing like it around us. The virtual reality experiences were not only amazing to experience yourself but also fun to watch each other experience. We drove virtual cars, walked virtual planks, fought virtual zombies and so much more. And, of course, if anyone in the family is a gamer....that side of the building is a paradise for them. Not to mention the food was great, and there is even a bar for adults!!\nThis would be a great place to have birthday parties, a group of friends, or even a fun experience with co-workers too!", "pics": null, "resp": {"time": 1579731975894, "text": "We are so glad you had a wonderful time! Thank you for leaving us a positive review!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "106476152906291283726", "name": "Segun Ajigbeda", "time": 1584234310464, "rating": 4.0, "text": "Cool place but got to make sure you're a gamer in order to get your money's worth.", "pics": null, "resp": {"time": 1591661116829, "text": "Thank you for visiting come again soon!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "107962776062591082238", "name": "JCYOUKNOW", "time": 1595717926483, "rating": 5.0, "text": "It was a very good place to go and recommend.", "pics": null, "resp": {"time": 1595805111247, "text": "Thank you so much for your recommendation! We appreciate the support and hope you come back and Game On anytime!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "102368348419905004846", "name": "Karen DeVito", "time": 1580492949858, "rating": 5.0, "text": "What a fantastic place to have a reality game session including lunch! Wonderful owners and open house!!!", "pics": null, "resp": {"time": 1580536568175, "text": "So great to meet you and we hope to see you again !"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "102894159903718596857", "name": "Jordan Walker", "time": 1577490760747, "rating": 5.0, "text": "Very good customer service and fun and exciting experiences for the whole family to enjoy! There are experiences for gamers of all ages! The ePLEX has PC and console gaming, Virtual Reality, classic arcade games, and even racing simulators! I very much recommended going to the ePLEX!", "pics": null, "resp": {"time": 1577494980198, "text": "We are glad you enjoyed your visit! Thank you for your review!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "103063915440289720728", "name": "Chris Donaldson", "time": 1577511391790, "rating": 5.0, "text": "Great team. Fun place to game and team build.", "pics": null, "resp": {"time": 1577568637384, "text": "Thank you for your review!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "108169996001131992869", "name": "Elliott G", "time": 1578188232575, "rating": 5.0, "text": "Very nice and friendly staff, had a great time.", "pics": null, "resp": {"time": 1578192179243, "text": "We are happy to hear you enjoyed your visit! Thank you for your review"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "103440763369175560233", "name": "Charlie Pohlmann", "time": 1580743732971, "rating": 5.0, "text": "friendly staff, had a great time, we'll be back!", "pics": null, "resp": {"time": 1580751718146, "text": "Glad to hear you had a pleasant visit. Can’t wait to see you again. Thank you for the review."}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "102233310486369669513", "name": "Mark Coleman (Thrache)", "time": 1578787511558, "rating": 4.0, "text": "Awesome experience", "pics": null, "resp": {"time": 1578791600869, "text": "Thank you for your review! We are always looking to improve and value your feedback. Hope to see you again soon!"}, "gmap_id": "0x8889118bd207bba1:0x82e42381af1f67e"}
{"user_id": "102625321856201685170", "name": "Megan Dannar", "time": 1619041938141, "rating": 5.0, "text": "This is my favorite place to go ! I feel safe & comfortable in the private rooms ! This is basically my therapy haha. You can dance , cry! Haha , laugh , choose wack a doo songs & it doesn’t matter - you are in your own room !\nI personally love that it is in Korean & love experiencing the culture.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "111681081844390611286", "name": "Richard Gladney", "time": 1608044785130, "rating": 4.0, "text": "Very nice setup and fun to do with a group of friends, but cocktails were terrible.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "105015839381939540312", "name": "Dena Nikia Williams-France", "time": 1513505047941, "rating": 5.0, "text": "Had a very good time, and the food was delicious. Drinks were very good but a little to high for the size of the cup. I will highly recommend attending if you want to do something like a birthday party. It's Not an open space its different rooms you go in, wasn't expecting that but had a ball. Yes I would go back.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "112526634833921050063", "name": "Blair Gilliland", "time": 1542854986687, "rating": 4.0, "text": "It was a lot of fun! I loved having our own room and that we were able to include our kids! It was odd that most things were not in English there but the staff was very nice and helpful in explaining everything.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "108315487165030243304", "name": "Cydney Mathews", "time": 1520092870600, "rating": 5.0, "text": "Although all of the directions were in Korean language, the hostess was very patient in explaining how to do things. We had so much fun! You should have some songs in mind before coming to save time. I like the private room. I would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "105936429926772492572", "name": "DONALD JENKINS (DJ)", "time": 1516930890960, "rating": 5.0, "text": "Studio sound... Very spacious room for loved ones and or friends to sit back and watch the talent and the discover of free spirited of individuals just by singing a song or two. Great place! Will book event very soon!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "113555740089892025279", "name": "hawonk2", "time": 1583837608945, "rating": 5.0, "text": "A lot of good songs to play.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "115563831419207154032", "name": "Jatna Rivas", "time": 1527478753757, "rating": 5.0, "text": "We had a great time! They have tambourines and songs in different languages. Note that if it is in Korean or Japanese the lyrics will too", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "110238157884982286836", "name": "Sarah Great Hosey", "time": 1591418745935, "rating": 5.0, "text": "A really, really, really great time!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "117494318886854976567", "name": "Madelyn Black", "time": 1519518695495, "rating": 5.0, "text": "Super fun! Drinks avalible. It is in Korean as a warning but it's easy to understand once you start.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "100016204945307224891", "name": "Deepanraj", "time": 1521344097545, "rating": 5.0, "text": "This was my first karaoke bar and I was very impressed. It was so much fun.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "105794624644293940835", "name": "Bre Harris", "time": 1611682095443, "rating": 5.0, "text": "Loved it", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "101823158118620163634", "name": "Christopher McLeroy", "time": 1521347298338, "rating": 5.0, "text": "Lots of fun to take a few friends and rent a room just to good off and sing to some of your favorite songs!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "103417648861614498844", "name": "nadia Brundage", "time": 1528347891378, "rating": 5.0, "text": "Best place in town for groups or a couple friends to have a good time and some good ol Karaoke.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "102198653184835329360", "name": "Char M.", "time": 1512403329721, "rating": 3.0, "text": "We had a pretty good time, however it was very unorganized. Had a birthday party here and when I got there about 15 mins early to do some decorating, the room was not ready. So I had ppl show up as I was decorating.\n\nAfter we decorated, the t.v. in the room didn't work and we had to move everything to another room, which also wasn't ready and They had to mop and wait for it to dry before we went in. They did however, accomadate us into a bigger room with a bathroom at the same price which was nice.\n\nThe wings are tiny so I don't suggest ordering those, but food was good. Spent a whole lot more than I expected. I'd go here again but would not suggest a birthday party for a kids unless you can shell out some $ to have a enjoyable time and feed everyone.", "pics": null, "resp": {"time": 1512515005010, "text": "Im sorry to hear that.  We did have some problems with the machine turing on, it was an elecrical problem. Due to our store opening at 3:00 our server and cook do their best to have the room cleaned and swept before customer arrive. Since the party was so early, when you got here my employees were still getting the room cleaned.  We will no longer take reservations for big parties before 4:00.  We hope to have you back soon.  Thank you Sing sing karaoke mgnt."}, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "106294534408444425038", "name": "Patricia Tatum", "time": 1533238871831, "rating": 5.0, "text": "Room was a lil stuffy, but we came early. Birthday and guest enjoyed themselves!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "107195554421120855609", "name": "Jeffrey Pearson", "time": 1574373703737, "rating": 5.0, "text": "Great place....", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "113028324144314539833", "name": "ben kim", "time": 1558030112031, "rating": 4.0, "text": "Can't complain. It's the only one in town.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "112291079102288617866", "name": "RED DIAMOND", "time": 1510081524722, "rating": 5.0, "text": "We had a ball! and the wings were delicious!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "102074295093645626953", "name": "Marilyn Roy", "time": 1518658544590, "rating": 4.0, "text": "Awesome 1st date night!! We shall return!!! ❤️", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "108582469754656798084", "name": "chris", "time": 1577841846211, "rating": 3.0, "text": "Its fine", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "115591291792539754880", "name": "Casey Poncini", "time": 1520394031414, "rating": 1.0, "text": "Awkward. Who wants to watch their crazy friends sing drunk in a tiny room? Never again. Also, no liquor license.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "117571218380465612392", "name": "Myeonghee Cho", "time": 1543467735631, "rating": 4.0, "text": "Very fun and enjoyable", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "113116892806017861053", "name": "Jack McDaniel", "time": 1512531145573, "rating": 5.0, "text": "New, super cool place.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "105652939483297949359", "name": "Jamie Dee", "time": 1554246636115, "rating": 5.0, "text": "It was great", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "111859000175356589357", "name": "Laquinta Moss", "time": 1515904956306, "rating": 5.0, "text": "10!!! So much fun with family and friends!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "100200591353039442677", "name": "Mary Abraham", "time": 1553601750296, "rating": 4.0, "text": "Fun place.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "108443373024859255599", "name": "Teleka Edwards", "time": 1554778269583, "rating": 5.0, "text": "Great fun!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "104654357498266568123", "name": "Dana Nicole", "time": 1527606290241, "rating": 5.0, "text": "Fun!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "106537406860169715864", "name": "Lucas Copeland", "time": 1524291889691, "rating": 5.0, "text": "So fun!!!", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "112800080594109656423", "name": "David Brazeal", "time": 1519264100601, "rating": 4.0, "text": "Clean, good equipment.", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "100564535574000069430", "name": "Alyssa Bandy", "time": 1512963044301, "rating": 4.0, "text": "Fun but the food is terrible", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "112164478284568645494", "name": "Sewong Jang", "time": 1570775294052, "rating": 5.0, "text": "(Translated by Google) Thank you Jong-soo.\nI love you\n\n(Original)\n종수야 고맙다.\n사랑해", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "111503026747842350868", "name": "하지용", "time": 1604291666243, "rating": 5.0, "text": "(Translated by Google) Good karaoke\n\n(Original)\n노래방 좋넴", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "113428850419747133880", "name": "박승덕", "time": 1542543223434, "rating": 1.0, "text": "(Translated by Google) Unkind and expensive\n\n(Original)\n불친절하고  비싸다", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "111772358962438349055", "name": "신신", "time": 1509807177154, "rating": 1.0, "text": "(Translated by Google) not really\n\n(Original)\n별로", "pics": null, "resp": null, "gmap_id": "0x888ced54f65858a9:0x881bba2105883900"}
{"user_id": "116925120825743437650", "name": "Tracy Jacobson", "time": 1594673153111, "rating": 5.0, "text": "DJ Swaye not only did my first daughter’s wedding, but my second daughter’s as well!  Both weddings, no one left the dance floor the entire reception. He also provided music and mics for the ceremony and provided music for the cocktail hour. You will not find a better DJ out there for a wedding, and a nicer guy to work with.   Tracy J", "pics": null, "resp": null, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
{"user_id": "116005096751312353225", "name": "BRITTANY MOORE", "time": 1580607814133, "rating": 5.0, "text": "When we say no one left the dance floor from the first song to the end of the night, we mean that. DJ Swaye was able to play a wide variety of music that was appealing to everyone and keep everyone dancing. We have had so many great comments about our DJ choice and how they have never danced that long before.\n\nDJ Swaye not only was able to keep the dance floor full, he was also able to be apart of our intimate ceremony and play the music. He had a setup that was able to accommodate the ceremony and cocktail hour, while having a station inside the reception hall.\n\nDJ Swaye was one of our favorite choices for our wedding! You can’t go wrong. Thank you DJ Swaye for giving us a night we won’t forget!", "pics": null, "resp": {"time": 1569188178995, "text": "Thank you. Gratitude in advanced."}, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
{"user_id": "107978011747694465284", "name": "Onyana Rosa", "time": 1565793058023, "rating": 5.0, "text": "Always very professional and dependable! Also knows how to rock a party and plays the best music!", "pics": null, "resp": {"time": 1569188186801, "text": "Thank you. Gratitude in advanced."}, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
{"user_id": "117770193886932133026", "name": "Melissa Cormier", "time": 1565778762513, "rating": 5.0, "text": "He Did my wedding and he is awesome,  I told him what we wanted and he did just that. If you want a DJ that is great at what he does this is the man for the job.", "pics": null, "resp": {"time": 1569188161317, "text": "Thank you. Gratitude in advanced."}, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
{"user_id": "103006548767632217750", "name": "Thomas Robinson", "time": 1565803204811, "rating": 5.0, "text": "Swayed puts all of his heart and soul into his gigs, you will always be satisfied with his work!", "pics": null, "resp": {"time": 1569188193730, "text": "Thank you. Gratitude in advanced."}, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
{"user_id": "116125105666570991245", "name": "Danita Barry", "time": 1568506143740, "rating": 5.0, "text": "Great DJ, excellent service, always dependable.", "pics": null, "resp": {"time": 1569474878849, "text": "Thank you. Gratitude."}, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
{"user_id": "103764632855698704787", "name": "Lashara Sullivan", "time": 1566513095931, "rating": 5.0, "text": "Very professional and a great DJ!!", "pics": null, "resp": {"time": 1569188206216, "text": "Thank you. Gratitude in advanced."}, "gmap_id": "0x88f5bff10f462c1b:0xdf8fa333dd26268d"}
