{"user_id": "117172630788788097467", "name": "Shawanna Grant", "time": 1628968417648, "rating": 5.0, "text": "Wondering couple and great customer service skills and I feel In love with the banner", "pics": null, "resp": null, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "109846901615896258847", "name": "Jared Garfield", "time": 1490977592340, "rating": 5.0, "text": "Michael Godwin is a true Southern gentleman, who goes above and beyond to meet client expectations.  When I first walked into his store he stayed way after hours to meet my needs.  His recommendations were excellent and innovative, especially his \"window perf sign process\" that will give me one of the best storefronts in the Historic Prattville downtown.  His prices are excellent, and he was even willing to match national pricing from a big warehouse vendor for my real estate signs!  If you want small town service, big city professionalism and great pricing, Central Alabama Sign & Banner is your place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPNTYMGCj43PdJS30CctpqcL1KX5nchkY1PwiOW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "104146607796122412734", "name": "Kimberly Cole Zemke", "time": 1576811061823, "rating": 5.0, "text": "He has been our sign man for years!  He does superior work!!  Great prices and fast service!! He is very creative and stays  on the cusp of new technologies!  Give Michael a try and you will be very satisfied with his work.", "pics": null, "resp": {"time": 1577037772755, "text": "Thank You"}, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "101012830323220343558", "name": "Evita B", "time": 1551031953238, "rating": 1.0, "text": "Went in to get an outdoor retail sign. Gave my information and was told someone would come out and measure. They never did. I called about 3 weeks later and was told someone would come out that day to measure. Waited at the location all day until about 8pm. No one showed up. I've heard a similar story from another business owner about them never showing up or calling back. Decided to go with SignOps and they were very helpful, and got our sign made and up within a week of contacting them and approving the design. They handled everything and it looks perfect!\n\nResponse. \"Perceived\"? No one came to measure and he admitted he didn't come and measure the first time, citing the holidays. I visited the shop before the holidays and in 3 weeks time, no one measured or contacted me. After I called, he never came that day after saying he would. I was there all day, and no one measured and no one contacted me. I do not have any calls from this place and I gave my cellphone number and address. Place is like 10 to 15 minutes away. As I said, another business has had the same experience. People reading this review can decide for themselves from my \"perceived\" experience. Thank you and have a nice day.", "pics": null, "resp": {"time": 1551030705388, "text": "I am very sorry for your perceived experience.  One of our salesmen did go out and measure for your sign. After repeated attempts to contact you with no response on your part, we figured you decided to go another route.  If there is anything we can do for you in the future, please do not hesitate to contact us."}, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "110041655594369348358", "name": "Tiffany Trueblood-Adkins", "time": 1580418226126, "rating": 5.0, "text": "These folks are great to work with! They do a superb job and always help when I'm in rush for time!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "105068103428977282959", "name": "Alisa B", "time": 1492969013490, "rating": 5.0, "text": "This family owned/run business is awesome.  Always friendly, great customer service.  I have purchased several monogrammed products from Central Alabama Sign and every single one was perfect!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "113025795955300296968", "name": "Janyth Grimes", "time": 1487005709527, "rating": 1.0, "text": "Would not exchange return damaged merchandise.", "pics": null, "resp": {"time": 1487008437036, "text": "I'm sorry that we would not be able to return your item.   There was no receipt for return and the item did not leave our store in the condition that you attempted to return it in (Stained with black marks and cut under the arm).  We inspect our clothing items carefully and do not sell unacceptable product."}, "gmap_id": "0x888e8fb7395177ad:0x5e753478aa5899d6"}
{"user_id": "100863761519121074641", "name": "Amanda Handley", "time": 1624046562139, "rating": 1.0, "text": "We order 13 and then realized we needed one more to make 14 so my husband goes to pick the one up and they don’t have a clue where it’s at or anything and the guy got an attitude with me and said I should have ordered the correct amount the 1st time. We will never use the place again! Not professional at all!", "pics": null, "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "106741270653134453184", "name": "Scott Plagmann", "time": 1496235514378, "rating": 5.0, "text": "Very professional and very good quality!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPm_FnOh6hKFjBLltZv0zSl-uykbMyRzG8oWhHb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "100670877454714921615", "name": "Justin Wallis", "time": 1558480068262, "rating": 1.0, "text": "Went in to look for team trophies. There was no one upfront to talk to. Looked around for a little while at the old and outdated trophies covered in dust and stepping over boxes and other junk in the floor. Finally a man came from the back and gave the impression of why was I there and why are you bothering me. I asked about ball holder trophies and he kind of waved his hand in a general direction. I left shortly after that and won’t be going back.", "pics": null, "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "114767807787905113335", "name": "Jay Floyd", "time": 1526680416020, "rating": 5.0, "text": "Ordered trophies Monday, were told would be ready Friday, they were ready on time for pickup. The boys are going to love them.", "pics": null, "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "118280631382586084277", "name": "N Luv", "time": 1479885804545, "rating": 5.0, "text": "Great service and great business. Very professional and great work!!", "pics": null, "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "110856164390208026033", "name": "Christopher Mathis", "time": 1547680288574, "rating": 5.0, "text": "Always great work and great customer service", "pics": null, "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "108951422375755946013", "name": "Liz Lewis", "time": 1488127951069, "rating": 1.0, "text": "Very disappointed in the service that I received.", "pics": null, "resp": null, "gmap_id": "0x88890de283648fdf:0x22643b0c4878cf9e"}
{"user_id": "104327442630654276050", "name": "Hannah Coulter", "time": 1621949368718, "rating": 5.0, "text": "Joe, Shawn, and the team at Regalo have been great to work. They are true professionals and know how to take care of their customers. They always go above and beyond to provide the best product with a high level of customer service. Highly recommend them!", "pics": null, "resp": {"time": 1621954345932, "text": "Thank you Hannah"}, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "112226968426850988097", "name": "Kelsi Nuss", "time": 1563982578400, "rating": 5.0, "text": "Mr. Lubisco and his staff have done countless corporate orders for me and they are always friendly, service is prompt, and they make sure our order is exactly what we need! There have been a few times that I’ve needed rush orders and I don’t know what I would’ve done without their help! We also set up a t-shirt fundraiser through entrusted tees and they made the whole process super simple. Great customer service! Thanks guys!", "pics": null, "resp": {"time": 1563984192457, "text": "Thank you"}, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "102960235727120029944", "name": "Beth Tutwiler-McGuire", "time": 1551196120283, "rating": 5.0, "text": "The Morgan County Association of REALTORS® really enjoys working with Entrusted Tees. The staff is helpful and very knowledgeable. They have done things for our office, as well as individual REALTORS® and our Affiliate Council. Their items (shirts, banners, signs, buttons) and work are of high quality, professionally designed and they offer outstanding prices for all of our needs and get the work done in a timely manner. I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "104144378418079452571", "name": "Michael Hamilton", "time": 1571935217292, "rating": 4.0, "text": "They are located in upperriver road and the staff are friendly and they are reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "112806121799443323667", "name": "Robert Martin", "time": 1542589219000, "rating": 5.0, "text": "The team at Entrusted Tees is top notch! They always go above and beyond to put your business goals first. They do amazing corporate apperal, shirts, hat and just about anything else you could put your logo on. Thanks for being amazing :)", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "104858319907236027873", "name": "unknown being", "time": 1552101224139, "rating": 5.0, "text": "Joe, Bill, and the rest of them team are always professional and helpful. Great graphics design and quality products. Thank you\nPete Willis\nIMS, Inc.", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "115708990312798882650", "name": "Shorty Pilk Ranch", "time": 1435256976159, "rating": 5.0, "text": "The staff at Entrusted Tees makes it easy for me to stay up to date with advertising and uniforms for my crews and so much more. They are reliable, friendly and quick to get what I need in a timely fashion. Banners, polo shirts, hats, t-shirts, vinyl and more no job has been too big or small.", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "107670597992878175628", "name": "Karen Woldahl", "time": 1434728597660, "rating": 5.0, "text": "Fast, easy service with a smile.  We use them for way more than just shirts....all our printing needs   Quick turnaround, vast item selection and friendly staff.  They are a great community partner to have.", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "100786980631849071590", "name": "Leigh Littrell", "time": 1442013388895, "rating": 5.0, "text": "Loved the ability to design a shirt online through the website and the screen printing turned out beautiful! The quality was top notch and so was the customer service! I will definitely use Entrusted Tees in the future!", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "112563994777736008552", "name": "Pamela Phillips", "time": 1540247106026, "rating": 5.0, "text": "Alot of help and very sweet person that helped us ......Excited about getting them.....Thx for everything", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "100122313042381321746", "name": "Chad Johnson", "time": 1541360506890, "rating": 5.0, "text": "I get all my business attire here ,great business.", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "115766225941673874007", "name": "Alba Theriot", "time": 1522349306705, "rating": 5.0, "text": "Great Service, awesome staff. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "106504844261527888618", "name": "Shane Taylor", "time": 1445293221404, "rating": 5.0, "text": "Exceptional Service ! Great staff , always a pleasure dealing with them.\nHighly recommend using them!", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "112783566533003656902", "name": "Gaming Dude", "time": 1575564648232, "rating": 5.0, "text": "Great products and people!!", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "104122958255044351691", "name": "Tiffany Hardwick Watson", "time": 1435587970943, "rating": 5.0, "text": "Quality products and excellent customer service from genuine people - That's what you get at Entrusted Tees!", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "101381603421232898805", "name": "Todd Beam", "time": 1525115399831, "rating": 5.0, "text": "The staff was so help and knew exactly what I wanted", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "110122090650690551662", "name": "Nathan Burrows", "time": 1538324502093, "rating": 5.0, "text": "Great products and service!", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "104511131729655094714", "name": "Lisa Moore", "time": 1545883731454, "rating": 5.0, "text": "Seems very dependable", "pics": null, "resp": null, "gmap_id": "0x886280bed8b8acc7:0x51e0988c19708daa"}
{"user_id": "100367329911634918477", "name": "Alex Alexander", "time": 1624556724822, "rating": 5.0, "text": "Merideth is so helpful! She always replies promptly to any of my questions and goes over and beyond to assist me in any way! I have enjoyed bouncing ideas around with her. Great experience!", "pics": null, "resp": {"time": 1624664568227, "text": "Alex, Thank you for kind words about Merideth, she is a great asset to our staff. Thank you for your business."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "116201542186029905022", "name": "Max Mitchell", "time": 1608628855984, "rating": 5.0, "text": "MEWS is absolutely fantastic - the selection and prices are great. Robyn was the most helpful and insightful person I worked with throughout the entire home building process. She went out of her way to make sure everything was installed correctly and promptly fixed any issues we had.", "pics": null, "resp": {"time": 1609777055607, "text": "Max, Thank you for the sweet remarks, and we all love taking care of our customers. I will tell Robyn about your appreciation of her helpfulness."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "110781975122031613091", "name": "Sharon Cain", "time": 1615265876359, "rating": 5.0, "text": "My experience at MEWS was terrific!!!!  Corey was so very helpful, professional and knowledgeable.  He went above and beyond to help me with my lighting selection.  I plain on making future purchases.  Thank you Corey!!!!😁😁😁", "pics": null, "resp": {"time": 1615418002214, "text": "Thank you Sharon, we love our customers, and I will tell Corey that he made your experience above and beyond."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "104170603632109196895", "name": "Donna McDonald", "time": 1608213566491, "rating": 5.0, "text": "One of the shops I always look forward to visiting is this one. The displays are beautiful and full of creativity! So after finding the perfect picture frames I was so disappointed in the reception I received at the counter. Besides being ignored, one of the staff was on a tirade about the lunch hours. She even commented about how they never have nice customers while she still ignored me! Gee! That made me feel good!😏", "pics": null, "resp": {"time": 1608214822869, "text": "Donna, I am so sorry, please call me at the store and this will be corrected. Thank you."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "110758333296621431711", "name": "Doug Corley", "time": 1597090263792, "rating": 5.0, "text": "Customer service is outstanding. Needed some parts for the plumber to finish on a new construction home that is about an hour away and Robyn had them there quickly which allowed the plumber to finish and not have to come back another day. From the very beginning Robyn has helped my wife pick out all of our fixtures and it has been one of the easiest parts of building our house.", "pics": null, "resp": {"time": 1597155084951, "text": "Thank you Doug, I have a wonderful staff and we love our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "106668679786731989592", "name": "Fuck Your God", "time": 1607219939939, "rating": 1.0, "text": "As a plumber they don't have a lot of stuff I need alot of times. But good people I don't know about anything else.", "pics": null, "resp": null, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "103950877833553351252", "name": "Julie Lyle Johnson", "time": 1595373347048, "rating": 5.0, "text": "A very beautiful, clean showroom with everything you need to decorate your home. Corey was very helpful, and ordered just the right ceiling fan for our porch.", "pics": null, "resp": {"time": 1595469954339, "text": "Thank you Julie, and I'll let Corey know how you appreciated his assistance."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "117312883243087060119", "name": "Olivia Hardy", "time": 1564800353062, "rating": 1.0, "text": "My husband went to the back to buy a blower unit for the inside part of our A/C. When he got there he found out that they don't sell them as a unit like they used to. You have to buy just the motor, so that's what he bought. When he gets it home, he finds out that it didn't have mount brackets so I went up there to get one that does. I was then told that none of the motors come with bracket mounts. I made the comment that he should have told my husband that so he could have gotten it while he was there. It's hot and this is our A/C unit we're trying to fix in the middle of a hot day. The gentleman said it wasn't his job to know what a person knew or not. I told him that he knew more than my husband on what parts come with what, that's when a woman came around counter and said that she was the owner and that I didn't need to talk to her employee that way. I wasn't being rude or belligerent. I just didn't think it would have been that hard to ask if the customer knew it didn't come with bracket mounts, especially if he brought an older model in. This will be the last time my family and I will be back to that store and before today, I would have recommended that store to anyone. Now I'll tell people to stay away. It's nothing like it used to be.", "pics": null, "resp": {"time": 1565720472419, "text": "Mrs. Hardy,\nYou did not speak to the owner for I am the owner, and I was at another store that day, you spoke to a co-worker, but Mrs. Hardy we have no idea what a customer's needs are until they inform us.\nThere are hundreds of units, and they change models every year, and the servicemen have to request what they need from us. We are a supply house, not a service company, and we are sorry that your husband did not realize he need additional products, but that was his call and not ours. Your husband was servicing his own unit.\nWe try and make all customers happy, and were sorry that you were disappointed, but do realize we have no idea what is wrong with a central unit until a serviceman request a particular part."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "116974851903056374509", "name": "AK _SAVAGE", "time": 1550535920012, "rating": 5.0, "text": "The ladies who work in the front are very friendly and helpful, as well as the associates that are in the showrooms. Huge variety of lighting, many are on display for the customer to see. There's something for everyone!", "pics": null, "resp": {"time": 1550590642201, "text": "Thank you so much for the compliments on our staff,  and we want to have a good selection for our sweet customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "105098009053378437929", "name": "Richard Brown", "time": 1538234444269, "rating": 5.0, "text": "In addition to having to the plumbing part that I needed, they have a lot of awesome stuff that would decorate any home beautifully", "pics": null, "resp": {"time": 1538239291729, "text": "Thank you Richard, and we love taking care of our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "118268531911652590361", "name": "lilly Keene", "time": 1514772655271, "rating": 5.0, "text": "Wonderful customer service and very happy with my purchase good to find the quality locally.", "pics": null, "resp": {"time": 1518121780713, "text": "Thank you Lilly, I don't know how I missed your sweet review until now."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "107221695179950899315", "name": "Judy Meyer", "time": 1600789809734, "rating": 5.0, "text": "Very nice", "pics": null, "resp": {"time": 1600796425249, "text": "Thank you Judy, we appreciate our sweet customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "113330469000008044766", "name": "Cory Hardy", "time": 1551197268508, "rating": 5.0, "text": "Great people and great materials I recommend MEWS to ANYONE", "pics": null, "resp": {"time": 1551201376189, "text": "Thank you Cory, it is so sweet of you to tell people about us. We do love our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "115050475612973215501", "name": "Jared Toone", "time": 1485371537277, "rating": 3.0, "text": "Great selection, but prices seemed really high.", "pics": null, "resp": {"time": 1497306857523, "text": "Jared, We try and have a selection for all budgets and hope you will give us the opportunity to service you again.\nSorry, I've been so long in responding, but I have not been receiving these reviews until this past week."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "107590350671569690386", "name": "Dawn Czermak", "time": 1523116049507, "rating": 5.0, "text": "UNBELIEVABLE selection. I have no words. Whatever you are looking for - they have it. Anything.", "pics": null, "resp": {"time": 1523288619832, "text": "Thank you Dawn, we want to be there to service our sweet customers and have the products to meet your needs."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "101784775847666266146", "name": "Thomas Thompson", "time": 1517369247069, "rating": 5.0, "text": "Good prices Goodwill variety great service", "pics": null, "resp": {"time": 1517404541533, "text": "Thank you Thomas, that is so sweet of you to take the time to do this."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "113494012974465219262", "name": "Sara Knaub", "time": 1597088832982, "rating": 3.0, "text": "Kinda snotty people", "pics": null, "resp": {"time": 1597095236937, "text": "Please call me and let me know whom you dealt with, this is a very unusual comment for my staff, I usually get just the opposite of how sweet and kind they are."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "113224144832015855927", "name": "Sherry Hester", "time": 1553359073430, "rating": 5.0, "text": "Wow I thought it was just lighting. This store has a little bit of everything. Checked it out.", "pics": null, "resp": {"time": 1553361612483, "text": "Sherry, Thank you for shopping with us, and we hope to see you again soon. We do love our customers."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "105287292938466275483", "name": "Merri Bass", "time": 1536347220952, "rating": 5.0, "text": "Staff is super helpful !!", "pics": null, "resp": {"time": 1536348081502, "text": "Thank you Merri, we appreciate our customers and want to take care of your needs."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "103778336272478274110", "name": "mike clinard", "time": 1532018586170, "rating": 5.0, "text": "Great staffed, provided instructions on suggested part", "pics": null, "resp": {"time": 1565720504754, "text": "Thank you Mike, and sorry I missed your review."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "108600301590225681225", "name": "Chadrick Piper", "time": 1496858679856, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1497306897181, "text": "Thank you Chadrick."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
{"user_id": "107353406227582420592", "name": "Stacey Adams", "time": 1494247796093, "rating": 3.0, "text": "High prices", "pics": null, "resp": {"time": 1497306730275, "text": "Stacey, We try to have product in all price ranges to satisfy our customers, I hope you will let our staff service you again and work with you."}, "gmap_id": "0x88628b7d1d913759:0x218c14b05a050498"}
