{"user_id": "108417989621542622668", "name": "linx finx", "time": 1601573600127, "rating": 5.0, "text": "Quick loading. Nice lazy at the shipping office.", "pics": null, "resp": null, "gmap_id": "0x88626ec99a067cff:0x66a4c3d74d3a58f2"}
{"user_id": "104303152041291169109", "name": "Sean Flynn", "time": 1334758164084, "rating": 5.0, "text": "Excellent customer support. Spoke with a tech Patrick who could walk me through anything. Support call originated with a Verizon network problem. Verizon's support has been abysmal and attempts to blame everything on gateway. Patrick helped me confirm that the errors are on Verizon's end. The ticket was created at 9:00 AM and I was called back by a tech who could help before 10:00 AM! Thank you", "pics": null, "resp": null, "gmap_id": "0x88626ec99a067cff:0x66a4c3d74d3a58f2"}
{"user_id": "113693858983848907050", "name": "Michael McKenna", "time": 1565114772626, "rating": 5.0, "text": "Listen up, my friend Jason just bought a brownie from the cafeteria and it had nuts in it...come on", "pics": null, "resp": null, "gmap_id": "0x88626ec99a067cff:0x66a4c3d74d3a58f2"}
{"user_id": "102085276812532096981", "name": "Clifton Duke", "time": 1495737526505, "rating": 5.0, "text": "Great staff, with a great product.", "pics": null, "resp": null, "gmap_id": "0x88626ec99a067cff:0x66a4c3d74d3a58f2"}
{"user_id": "115777566812229617382", "name": "Adam Dyess", "time": 1487542325652, "rating": 5.0, "text": "Terrific place to work.", "pics": null, "resp": null, "gmap_id": "0x88626ec99a067cff:0x66a4c3d74d3a58f2"}
{"user_id": "117021142286141185731", "name": "Marcus Kirby", "time": 1552925245747, "rating": 5.0, "text": "Quite place for lunch...", "pics": null, "resp": null, "gmap_id": "0x88626ec99a067cff:0x66a4c3d74d3a58f2"}
{"user_id": "109477334918307021411", "name": "Matthew Strong", "time": 1592942420021, "rating": 5.0, "text": "Great Customer service and Great people. Best company and their implants have served me great. Strongly recommend", "pics": null, "resp": null, "gmap_id": "0x8889225871148943:0x269ee8379d85115a"}
{"user_id": "102458561657580077396", "name": "Dan Ulaszek", "time": 1552928143437, "rating": 5.0, "text": "A couple reviews here act like BioHorizon's implants are causing the issues with the restoration.  I have been restoring BioHorizons parts for over a dozen years.  As a Lab Tech I have personally seen thousands of Bio Horizons cases go smoothly where other implants may have failed.  Bio Horizons is a world class medical device provider in my opinion, and I would not hesitate to allow my dentist to place one in my mouth based on the years of witnessing successes by our clients.  Keep it up BioH!", "pics": null, "resp": null, "gmap_id": "0x8889225871148943:0x269ee8379d85115a"}
{"user_id": "107395898573383219257", "name": "Mickey Mouse", "time": 1557894699865, "rating": 1.0, "text": "This company is a complete joke, as is their HR department. They asked me to come back for a second round interview, and then the next day they said that I lacked the proper qualifications. The interviewer told me 3 people had left the position I was interviewing for within the past year. Red flags everywhere", "pics": null, "resp": null, "gmap_id": "0x8889225871148943:0x269ee8379d85115a"}
{"user_id": "104444415555772548643", "name": "Jeremy", "time": 1468254891408, "rating": 5.0, "text": "Great customer service and great implants!", "pics": null, "resp": null, "gmap_id": "0x8889225871148943:0x269ee8379d85115a"}
{"user_id": "100976209527535229081", "name": "susan zoppi", "time": 1398187882528, "rating": 1.0, "text": "Biohorizons is a company that does not back up their products. I had an implant done with an abutment (post) that was provided by Biohorizon. The abutment was either defective or was made of materials that were not up to industry standards. The abutment snapped when I bit into an ice cream cone 2 and a half years after it was inserted into my mouth. I have called and emailed their customer service department dozens if not hundreds of times, to no avail. I had to have my implant completely redone by a different dentist. I was told the abutment from Biohorizon was made out of zirconium, which is an inferior product that is cheap and not up to industry standards. The dentist that re-did my implant used an abutment made out of titanium. When I bit into that ice cream cone the biohorizon abutment snapped like glass, that is what it sounded like. In my opinion Biohorizon is not a reliable company - shouldn't an implant that's supposed to last a lifetime last more than 2 and a half years. Their customer service is non existent and their products are inferior. Before you have an implant done find out where the abutment is made and if your dentist tells you Biohorizon either request one from another company or find another dentist!", "pics": null, "resp": null, "gmap_id": "0x8889225871148943:0x269ee8379d85115a"}
{"user_id": "108307211349294134238", "name": "Ahmed Mataria (DDS)", "time": 1546281584540, "rating": 1.0, "text": "I completely agree with the Dr above\nStay away from them , no loyalty, horrible customer service, they just want your money", "pics": null, "resp": null, "gmap_id": "0x8889225871148943:0x269ee8379d85115a"}
{"user_id": "116912446409609202441", "name": "Groovy Redhead", "time": 1534778007029, "rating": 1.0, "text": "Regions is absolutely awful. The customer service will not work with you or talks to you like you’re stupid. There is no excuse for Regions to treat people like this. I really want to show up at the Corp office and tell the receptionist I’m not Leaving until a manger sees me so I can complain, but they probably don’t care either. A quick Google search tells you have awful and unhelpful they are.", "pics": null, "resp": null, "gmap_id": "0x888922597a81eb4b:0x3f5b505c2ee331e6"}
{"user_id": "107797963116797806453", "name": "Rayuna", "time": 1497976678163, "rating": 5.0, "text": "Fast service and short lines.", "pics": null, "resp": null, "gmap_id": "0x888922597a81eb4b:0x3f5b505c2ee331e6"}
{"user_id": "100792515261502650287", "name": "chirag patel", "time": 1615932523638, "rating": 1.0, "text": "Whating 7 hr for pick up this is 2nd time\nNo over night parking  Was Please", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "107091789449241994613", "name": "NatasHa Cook", "time": 1612977225905, "rating": 1.0, "text": "Horrible personnel. HR and VP are very biased.", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "107237380432039212785", "name": "Supakool85", "time": 1597082603438, "rating": 3.0, "text": "Nice people clean warehouse....just tight for OTR 18WHEELERS", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "115749054536674515544", "name": "Secquonya Franklin", "time": 1617915198043, "rating": 1.0, "text": "Worst job I ever had", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "102284862789426667452", "name": "Keiwana Eaton", "time": 1572881761679, "rating": 5.0, "text": "Great place to work. I sincerely enjoyed my time in Document Control.", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "104297269230428236261", "name": "Falana Reed", "time": 1565053697605, "rating": 1.0, "text": "BEWARE BE WARNED: This company will fire you on the spot if they don't like you, jealous of you, envious of you, if you're not scared of them, if you don't kiss butt. Management and HR will side with the Supervisor NO MATTER WHAT even if they are DEAD WRONG! HR is a mess infact they have had 3 HR managers within 1 and 1/2 yrs.", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "117549663244053483128", "name": "christopher woodson", "time": 1519003425000, "rating": 5.0, "text": "The best job I have ever had.", "pics": null, "resp": null, "gmap_id": "0x888cf42392482f75:0xdf6718de0256cd2b"}
{"user_id": "105722936557757647563", "name": "Lila Kathryn Moldenhauer", "time": 1622904624871, "rating": 3.0, "text": "They are helpful about obtaining immediate need... I didn't see the emergentcy shelter but I recommend it to other options... It's not alone and a more secure building.. Priorly the area I guess talking to locals could be kind of dope but now people do provide government verification to work... The downtown area is charming and coffee shops are open and more then just coffee like a monologue seat to speak to children's legislation I recommend honey..", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "111540986721442192650", "name": "Tiger Dowdle", "time": 1601069395238, "rating": 4.0, "text": "This place is amazing never seen a place so nice and helpful", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "112036950507720270643", "name": "will will", "time": 1553738267354, "rating": 4.0, "text": "All these horrible and selfish reviews from people who didn't get what they wanted, when they wanted, and how they wanted it. I came to the Christian Mission over 3 yrs ago and was admitted into their New Life Center program. I have been affiliated with them ever since. I entered this place from jail, a drug-addicted sinner of the worst kind. I was treated with compassion, love, and respect without earning (or deserving) any of it. I have seen such good works done here. Meals to the home-bound, three meals a day to local \"walk-ups\", financial assistance and food to those IN NEED, etc. Is the Christian Mission perfect? No. Because it's run by flawed human beings...who are doing their best to follow God's will that we love and serve one another. These people get paid a pittance (those that do get paid), they do this for something greater than themselves. Does the Mission help EVERYBODY who comes in wanting something? No, because EVERYBODY wants something for nothing...so they have to determine (to the best of their ability) how to help. This place has helped so many, but we tend to only hear from the few it doesn't... Those OUTSPOKEN few who probably aren't telling the whole story of WHY they couldn't be helped. But God bless them all.", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "102916130954260258940", "name": "Bill Tompkins", "time": 1597246853852, "rating": 5.0, "text": "Friendly hard working staff.", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "100802190673884645076", "name": "Estevan Sotorosado", "time": 1573653863276, "rating": 5.0, "text": "Yesterday one of my friends need it assistance and the Christian Mission was there to help the family in need.\n\nThe Christian Mission did what the Bible said in Lucas 4:16-19\n\n16. He came to Nazareth, where he had been raised; and on the Sabbath he entered the synagogue, according to his custom, and rose to read.\n\n17. And he was given the book of the prophet Isaiah; and having opened the book, he found the place where it was written:\n\n18. The Spirit of the Lord is upon me, Because he has anointed me to give good news to the poor; He has sent me to heal the brokenhearted; To proclaim liberty to the captives, And to see the blind; freedom to the oppressed;\n\n19. To preach the pleasant year of the Lord.\n\nSpanish Translation:\n\n16. Vino a Nazaret, donde se había criado; y en el día de reposo entró en la sinagoga, conforme a su costumbre, y se levantó a leer.\n\n17. Y se le dio el libro del profeta Isaías; y habiendo abierto el libro, halló el lugar donde estaba escrito:\n\n18. El Espíritu del Señor está sobre mí,Por cuanto me ha ungido para dar buenas nuevas a los pobres;Me ha enviado a sanar a los quebrantados de corazón;A pregonar libertad a los cautivos,Y vista a los ciegos;A poner en libertad a los oprimidos;\n\n19. A predicar el año agradable del Señor.\n\nVery respectfully,\n\nPastor Estevan & Melissa Soto", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "109165618912797068227", "name": "Larry Sutley", "time": 1556587060365, "rating": 5.0, "text": "Great place. Loving Christians willing to serve.", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "109144455436102016061", "name": "Jessica", "time": 1547564097985, "rating": 1.0, "text": "Online it says the hours 8:30 and The lady didnt open until 9 and then closed the store 17 mins early ! She also made 2 rude  comments when buying something. Told me she hoped i didnt break my neck on these shoes i bought then made a rude comment towards my husband saying \"He dont carry? \" concerning my bag that only had my shoes i just bought in it. Extremely rude and uncalled for. she was an older, white, lady and wears glasses", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "104140599477777190012", "name": "James Barr", "time": 1623639898425, "rating": 1.0, "text": "the staff there are very rude. I would recommend staying as far away from that evil place as you can. There is a lady there by the name Kristy.  She got high the night she graduated the program and now works their. The place has some good people and some very veil hearted people. Lots of prayer is need for this place.", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "115076200194136652400", "name": "Glen Lorenson", "time": 1568054830634, "rating": 1.0, "text": "I felt humiliated and because not head of household even worse", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "103382542181152596714", "name": "Gloria Gonzalez", "time": 1475460863585, "rating": 1.0, "text": "That black lady is very rude. And yall call this a Christian place. Please change the name.", "pics": null, "resp": null, "gmap_id": "0x88926c1f8f7dbf63:0x4a1c15b91dcdbfaf"}
{"user_id": "113557804834359840709", "name": "m wilson50", "time": 1626276626712, "rating": 1.0, "text": "BLUF: Nagging sales people and substandard insurance. When I was in my 30's they called me at least once a month trying to upsell me on their mediocre product. When I turned the age of 50, they quadrupled my monthly premiums  - I am not in bad health. I had been paying on the policy for 20+ years, my only option was a phone-call cancellation. There are better options available, my advice is go and find one.", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "101201378081116029508", "name": "Daniel Scott", "time": 1621976945789, "rating": 1.0, "text": "Selected this company because of their relationship with Costco. I nonetheless would not recommend appling for term life insurance with Protective. It ended up being a waste of time. The lab work from my medical exam all came back as a healthy 30 year old. The claim was denied based on a rash on my leg. This is even after the dermatologist stated there were no health risks with the condition. I can only assume that a health professional was not involved in the underwriting process.  For as much as I enjoy Costco, this is a company/service they should drop.", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "117096403742958613404", "name": "No Never", "time": 1605899731734, "rating": 1.0, "text": "My dad died in 2005 and my family has sent them death certificates talked to them and sent back forms they requested and they will not release his money back to us.  The continually send us a bill for $10.00 and when we do not send the $10.00, they take the $4,400 he paid in and pay the monthly premium.  Every time we call we get some excuse and a request for new forms. Good luck with this company, I have filed a complaint to get our family money that is ours.", "pics": null, "resp": {"time": 1609873651077, "text": "Robert, I would appreciate the opportunity to speak with you. If you would like, please email us at social.media@protective.com and we’ll reach out to you directly. Thank you! -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "110763750888644633145", "name": "Brian w", "time": 1596653490731, "rating": 1.0, "text": "My mother purchased a prepaid life insurance policy with liberty mutual years ago. She passed in June of this year I called liberty mutual and was informed that I had to call protective insurance. I called and was told how to file a claim which I did following their instructions. I did not get any response from the company so I called them they said they would have a rep call me back we’ll I never got a call instead I got an email stating my mother’s death certificate had status of divorced and I had to provide them a copy of the divorce decree. I checked with the county clerks office in Erie county New York and was told that those records are sealed pursuant to New York State law and that the only people that can view them are the plaintiff,defendant or attorneys of record so I called protective back and was told someone would call me back. SUPRISE no call back again so I called again and asked to speak with a supervisor and I was connected to John who stated he would look into it and call me back the next day. Guess what no call back again. I called them again and after being put on hold was told that everything was ok and I didn’t need to do anything  After another week went by I called to check the status of my claim and was told I had to provide a copy of my parents divorce decree I explained again that I could not provide it because my parents divorced 49 years ago and were no longer alive my father passed years before my mother took out the policy. I was told I needed to provide a copy of my fathers death certificate in order for them to process my claim. By the way did I mention I am listed as the sole beneficiary on the policy.... I should not have to provide anything but my mother’s death certificate which I did in the first place. I just faxed a copy of my fathers death certificate today let’s see what excuse they come up with next not to pay on my claim. I will probably have to sue them for what is rightfully mine left to me by my late mother. This company should be ASHAMED\n\nUpdate\nProtective insurance got back to me to make sure the claim was closed and they listened to my concerns and stated that they would try to improve their call backs moving forward. I am impressed that they followed up with me on my concerns I wish they would have done it sooner if they had I never would have had to make this post in the first place. But it all worked out in the end. Thank you protective", "pics": null, "resp": {"time": 1596222642875, "text": "Brian, I’m sorry for your experience and would appreciate the opportunity to speak with you. If you would like, please email us at social.media@protective.com and we’ll reach out to you directly. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "106654978827598174024", "name": "Nikola Budisavljevic", "time": 1489537354109, "rating": 5.0, "text": "Great insurance company and great people! Just like the guy in the photo, I give them a big thumbs up!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNten2_0UyzZ8mrARdk3RMPIREweO7DVYQ93HQU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "109776370011464465939", "name": "Sandra Karley", "time": 1585672754168, "rating": 1.0, "text": "I would really like to give it a zero stars!  After carrying a policy that paid for itself for 39 years I was sent one letter in January stating it was no longer paying for itself and since I did not receive this letter only owing $19.80 it was cancelled. After talking with Leslie desk U31 she stated that this is all they are required by law to give you.  So the policy was cancelled.  I feel that this is inhumane and not very understanding after 39 years of my business.  Think twice before dealing with this company.", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "111127780809029714580", "name": "GMail API", "time": 1601044749618, "rating": 1.0, "text": "Spammers!!!  I've never had any experience with them and I definitely won't now.  This email is a commercial message sent from Protective Life Insurance Company, 2801 Highway 280 South, Birmingham, AL, 35223, USA", "pics": null, "resp": {"time": 1601932236872, "text": "Hello, We would appreciate the opportunity to speak with you. If you would like, please email us at social.media@protective.com and we’ll reach out to you directly. Thank you! -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "102673044057006561381", "name": "K J Olsen", "time": 1609813970042, "rating": 1.0, "text": "Lost 100K from my Protective Variable Annuity due to their faulty algorithm. The annuity sold when the stock market was down and bought when the market was high. They even charged a 10k surrender fee on top of the loss! Worst company to deal with.The only winners are the financial representatives who sell their products. The so called response was a joke. We told you so. we told you so.", "pics": null, "resp": {"time": 1597676144381, "text": "K J, I would appreciate the opportunity to speak with you. If you would like, please email us at social.media@protective.com and we’ll reach out to you directly. Thank you! -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "113455331686046489087", "name": "Jermaine Tomlinson", "time": 1582289170794, "rating": 1.0, "text": "Worst life insurance company ever . Since Liberty Mutual sold to this company the service has been a nightmare not only are there long holds when you call in, when I tried doing a 1035 exchange and cancel my policy the company kept having issues with paperwork yet still charging against premiums against my cash value. I then decided to just fully surrender my policy and they are still delaying the surrender and continue to pull premium . Absolutely awful not even worth 1 star.", "pics": null, "resp": {"time": 1584041478993, "text": "Hi Jermaine. We're sorry for the experience you've had and would appreciate the opportunity to help. Please email us at social.media@protective.com and we will have someone reach out to you directly. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "115438753735599880454", "name": "Charmaine Perry-Livers", "time": 1610145528321, "rating": 5.0, "text": "Very nice staff!", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "111092423989479181433", "name": "Marieb", "time": 1579714489166, "rating": 1.0, "text": "Horrible Customer Service. 35 min call on my break at work with no help..agent could not answer my questions. The second person came to the phone sounding aggravated that I called asking about my policy...so long for good customer service. 😣", "pics": null, "resp": {"time": 1579730377071, "text": "Hi Marieb. We're sorry for the experience you've had and would appreciate the opportunity to help. Please email us at social.media@protective.com and we will have someone reach out to you directly. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "104029457809760911515", "name": "Cita Philpot", "time": 1549392315037, "rating": 1.0, "text": "My mother lost her daughter, my sister on November 25, 2018. The insurance agent filed a claimed in December along with the death certificate, it’s now February and all they keep telling us is their processing it. Honestly, this is absolutely unacceptable and very unprofessional. Hopefully they can handle this matter promptly and in a timely manner before we seek other measures!", "pics": null, "resp": {"time": 1549404718310, "text": "Good Afternoon Cita.  We are so sorry for your family’s loss and apologize for the inconvenience.  We would appreciate the opportunity to speak with you and resolve this issue. Please reach out to us at 1-800-424-1592. Thank you for bringing this to our attention. - RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "106493105002266182048", "name": "mika mikar", "time": 1578260396654, "rating": 1.0, "text": "WORST EXPERIENCE EVER! Do not deal with this company! Your loved one will be dead and buried and you will still be fighting with Protective Life. Just added grief, stress, and loss of funds.", "pics": null, "resp": {"time": 1579015049137, "text": "Hi Mika. I'm sorry for the experience you've had and we would appreciate the opportunity to help. If you'd like, email us at social.media@protective.com and we can have someone reach out to you directly. - RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "112377970336988468177", "name": "Rebekah Bliss", "time": 1587770868511, "rating": 1.0, "text": "Worst experience with this company. Don’t even consider them.", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "110877926320090608856", "name": "Legend Hodges", "time": 1570561269619, "rating": 1.0, "text": "This is Heather Hodges. My grandmother bought policy's when my siblings and I were born. My brother and I decided to surrender our policies due to the fact that I recently had my first child and need a car to get him to appointments and I to work. My brother did his first and had his money in a month I then began my surrender at the end of July and was told they had to decide if my grandma or me wasbtge owner which it states on the policy when we turn 18 it's ours. I'm 31 now. So after that delaying the process I email my paperwork to them on Sept 23 and it's only supposed to take up to 10 days. It's over that and all they can tell me is they will put a request in...well obviously that's what I already did. I just don't get why it takes so long to surrender it isn't like someone died and u had to investigate and it isn't a large sum of money. Started in July it's now Oct n nothing.", "pics": null, "resp": {"time": 1571085981323, "text": "Hi Heather. I’m sorry for your experience and would appreciate the opportunity to help. If you would like, please email us at social.media@protective.com and we’ll be able to reach out to you directly. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "111031817082806589703", "name": "Lloyd Brown", "time": 1533841848240, "rating": 2.0, "text": "Their telephone system is atrocious.  The voice recognition system doesn't work. If you do get the numeric input to work be prepared for a long wait, a very long wait. If you do get to talk to someone be prepared for another long wait if they must access any information from their computer system.", "pics": null, "resp": {"time": 1533848541891, "text": "Thank you for letting us know about this issue with our telephone system, and we’re so sorry for your experience. Protective is constantly looking for areas to improve and will pass your feedback on to our operations teams. Hopefully with constructive feedback like yours, we can streamline the process for all of our clients. -AP"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "114535365180361753416", "name": "Cece P", "time": 1560190013800, "rating": 1.0, "text": "This company is horrific. The left hand doesn’t know what the right hand is doing. They keep telling me my account is in grace period but yet I just paid my account. Don’t even try the 1-800 number so dang many prompts you get dizzy then I was on hold 45 minutes.\n\nThen I called the 205 number and was told something totally different from my first call on May 17.\n\nOh yeah in the letter they sai “ you may want to take a moment to consider the reasons you originally purchased this insurance” personally I found this statement aggorant and condescending. So now I’m off to find some else. To bad I’ve had this policy since 1992", "pics": null, "resp": {"time": 1560193911646, "text": "Hello Cece -- We apologize if there has been any incorrect information provided and would very much like to help with this matter. Please email social.media@protective.com and someone will follow up with any questions or concerns you have. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "115811453281741170122", "name": "Elsie Fletcher", "time": 1551377471907, "rating": 1.0, "text": "Agree with the poor reviews.  I inherited an account from my Dad and decided to leave it with the company for 5 years.  My calculations show they owed me around $51,000; they paid me $49,000; and when I called for a breakdown of principal vs earnings they sent me a form saying they issued me a check for $46,000!  Needless to say I called and they will have a processor call me back- in the next 8-10 business days. Totally unacceptable - am drafting a letter for Richard Bielen, President and CEO.  This is after struggling with them for 6 months to determine how to handle my account - I was told I could roll to an annuity; then I was told by someone else I could not.........  The reps seem nice but either uninformed or overworked.  I see they are in a partnership with Costco and I will voice my concern to them also.  I also see there are NO women on their corporate board so I am disappointed my Dad invested with them as the Father of three successful daughters!", "pics": null, "resp": {"time": 1551207070671, "text": "Hello Elise -- We apologize if there has been any incorrect information sent to you and would very much like to help with this matter. Please email social.media@protective.com and someone will follow up with any questions or concerns you have. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "110238433057863574427", "name": "Jeanelle and Luke Keller", "time": 1533679567610, "rating": 1.0, "text": "Terrible Insurance Company\nWhen it was time to renew after 1 yer it was absolutely impossible to get in contact with anybody.  I was trying to give them money, but they were completely and utterly incompetent.", "pics": null, "resp": {"time": 1533742504700, "text": "We are so sorry you have not been able to connect with us. Our Customer Service Center is open Monday – Thursday 7 am to 6:30 pm and Fridays from 7 am to 5 pm. If you would please give us a call at 1-800-866-9933, we would be more than happy to help you with your account. - RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "114146065672906280993", "name": "Zachary Bryant", "time": 1563474607985, "rating": 1.0, "text": "Rude. Doesnt to listen to your concerns", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "109983775032974643709", "name": "Tori Tenniswood", "time": 1597199384218, "rating": 5.0, "text": "Great company!", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "102173871052567851952", "name": "Rhonda Howse", "time": 1549647270691, "rating": 1.0, "text": "This company is a scam. They are sending out 1099-INT forms for claims that have never been paid, money that has never been received, Unable to talk with anyone at this company because they put on hold for at least 1 hour.", "pics": null, "resp": {"time": 1550510090003, "text": "We apologize if there has been any incorrect information sent to you and would very much like to help with this matter.  Customer Service can be reached at 1-800-866-9933 or by email to ladphs@protective.com and someone will follow up with any questions or concerns you have. - Mike"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "101640420366402109465", "name": "James R. Bryson", "time": 1510974252033, "rating": 5.0, "text": "Great insurance company. Have life policy and cancer insurance policy.", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "114696223591520302562", "name": "beer grills", "time": 1588098194763, "rating": 1.0, "text": "Been waiting 7 months for cheque , avoid", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "105521116645401579237", "name": "Luke Keller", "time": 1547945716352, "rating": 1.0, "text": "Terrible insurance company.  Terrible customer service.  Takes 20 minutes on the phone following prompts only to be told by an automated message that they are closed.\n\nBilling practices are absolutely terrible.", "pics": null, "resp": {"time": 1548170848593, "text": "Hi Luke -- We apologize for the inconvenience. However, we would appreciate the opportunity to speak with you and hopefully resolve these issues. Please reach out to us at 800-866-9933. - RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "110941085532714177332", "name": "LaNcE 19", "time": 1549497008215, "rating": 5.0, "text": "Great Company, Bad Management. -NOC", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "111524608307567009579", "name": "Gray Pendleton", "time": 1589939165855, "rating": 3.0, "text": "Phone wait times are over an hour...", "pics": null, "resp": {"time": 1567554172700, "text": "Hi Gary. I’m sorry for your experience with longer than normal wait times. If you would like, please email us at social.media@protective.com and we’ll be able to help. -RH"}, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "100278064728970729339", "name": "DeEdward Harris", "time": 1501684801585, "rating": 5.0, "text": "it is very big\nwhoo", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "117113308091760590478", "name": "Frank Sottosanti", "time": 1435362443554, "rating": 5.0, "text": "Fantasy insurance", "pics": null, "resp": null, "gmap_id": "0x8889198e5c33b7eb:0x22edbf81417388dc"}
{"user_id": "103905008157195768566", "name": "I.M. Being", "time": 1542382321554, "rating": 1.0, "text": "Another corporation making its money by destroying the environment and harming human health. Greed and ignorance!", "pics": null, "resp": null, "gmap_id": "0x8889172b424358af:0x9e0f8f39766e7f3f"}
{"user_id": "112715255740683110341", "name": "Stephanie Fitzgerald", "time": 1602023040088, "rating": 5.0, "text": "Great customer service and quick response to any question I might have had for them.", "pics": null, "resp": {"time": 1602258757430, "text": "Thanks, Stephanie! Let us know if you need anything else."}, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "113105851193245278486", "name": "Ella B", "time": 1566916725405, "rating": 5.0, "text": "The first time calling to do an application speaking with Tawana was amazing just the attitude was so positive and very helpful ❤️ And then driving down from Ocala to do the training with them and the way they trained was just an amazing experience for me There funny, positive, motivated, willing to take the time to make sure you get the information you need the correct way. I just love the staff rather I work with them or not there just perfect in my eyes customer service skills off the charts. 🥰😍❤️ I really don’t think it could get any better.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "113658805104711859975", "name": "Steven Croft", "time": 1568922552686, "rating": 5.0, "text": "Finished third deployment with CNC, great company, managers are goal driven and expect results as expected with professionals.  Patrick and Robyn are very knowledgeable and encouraging managers.", "pics": null, "resp": {"time": 1602258813536, "text": "Thanks for the kind words, Steven! We appreciate you."}, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "110399108172633554004", "name": "Justin Safiran", "time": 1559272031494, "rating": 5.0, "text": "Awesome place to work! The company is growing and always hosting training classes . If you want to be an adjuster this is where you need to come.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "100721919377396188936", "name": "Thersia Weaver", "time": 1549487202998, "rating": 5.0, "text": "Worked for this company 15 years, The Fowler family is some of the best people you ever want to work for. They were more than my bosses they were family and I still considered them as family.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "107675013458518657916", "name": "Betty Betts", "time": 1598064012986, "rating": 5.0, "text": "A great company!", "pics": null, "resp": {"time": 1601474593052, "text": "Thanks, Betty! We appreciate the compliment."}, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "103440336358119142241", "name": "marlindarlin714", "time": 1510070179835, "rating": 1.0, "text": "Stay clear of this company. Management is lowly evolved and ill informed. Always throws their teams to the wolves, will provide incorrect info and then not stand behind their word. ZERO integrity all the way around.  Mickey Mouse outfit run by dubious characters.  This co is a joke among real adjusters.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "112209289812127448394", "name": "Bll Wangerin", "time": 1490729485289, "rating": 5.0, "text": "Everyone I've worked with at CNC has been great to work for!", "pics": null, "resp": null, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "107752613653278227173", "name": "Emily Bacian", "time": 1490563896221, "rating": 1.0, "text": "Treats temp employees like second class citizens.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b01e18dd5:0xf0745fb4d5fd1278"}
{"user_id": "113523808788783845288", "name": "Alan Flynn", "time": 1619547623909, "rating": 5.0, "text": "Beautiful homes and great craftsmanship.  River Park is an amazing community.  Cheryl in warranty is a true asset to the company and provides phenomenal customer service.", "pics": null, "resp": {"time": 1619549416294, "text": "Thank you so much for your kind words, we are so happy you are enjoying your home in River Park!"}, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "105372743585851465725", "name": "Dave Kimzey", "time": 1577816470581, "rating": 5.0, "text": "Jeff Benton Homes was fantastic at making the build process easy to understand and kept us informed through the entire process. They helped us be involved throughout the process and continually adjusted their schedule to meet ours. We love our home and feel very appreciative of Jeff Benton Homes and his team. Thank you very much!", "pics": null, "resp": {"time": 1577974305706, "text": "Thank you so much for your kind words, we hope you enjoy your new home for many years to come!"}, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "114620118968526431510", "name": "Con Aggie", "time": 1583012900401, "rating": 1.0, "text": "Rude!! The realtor lady that represents you in Hampton cove model home is not type of person that can help you to earn business. Just giving you a heads up! You need more open minded people.", "pics": null, "resp": {"time": 1583024033423, "text": "I am sorry you didn’t have an enjoyable time or experience at our model home. if you wouldn’t mind telling us what made your experience unpleasant so we can better understand how to resolve this issue and make sure it doesn’t happened again."}, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "105138992842155885922", "name": "Raz Man", "time": 1520392202567, "rating": 5.0, "text": "JB is one of the best home builders in the area. All of the people we have dealt with through the whole home building process were top notch.  They don't disappear after they hand over the keys either. The construction quality is superb and the 10 year structural warranty is a rare option in our area. I would recommend this builder to anyone.", "pics": null, "resp": null, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "114466515795246830109", "name": "Janet Bernstein", "time": 1582477011047, "rating": 1.0, "text": "They were closed on Saturday!! Website says they are open till 4:00. What's with that!!☹", "pics": null, "resp": {"time": 1582480873698, "text": "Hi Janet, sorry you made a trip to the studio. We are currently remodeling the design studio and it is closed for now. We will post on our website when it is reopened."}, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "117883661349408016495", "name": "Alan Johnson", "time": 1557958567593, "rating": 5.0, "text": "Easy process with a great end result!   Jeff Benton builds a great house for a good price!", "pics": null, "resp": {"time": 1558013362211, "text": "Thank you so much for your kind words! We are thrilled you love your new home!"}, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "114000353874793207204", "name": "scott starrett", "time": 1553103003781, "rating": 5.0, "text": "Very satisfied with the building experience from start to finish.", "pics": null, "resp": {"time": 1553173979966, "text": "We are so happy you chose to build with Jeff Benton Homes and that you had a wonderful experience!"}, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "102881993342029598267", "name": "Matt Knupp", "time": 1397031805093, "rating": 5.0, "text": "Love what Jeff Benton Homes is building in Lake Forest off of Martin Road in SW Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626ccbcb1ea25f:0xbc9f268cfc4a1f72"}
{"user_id": "111993751861742228146", "name": "Maaya Kumar", "time": 1532031224227, "rating": 5.0, "text": "Friendly Staff and neatly maintained. Love this place!", "pics": null, "resp": null, "gmap_id": "0x88891a4eed114ee7:0x68dbec245650dbbc"}
{"user_id": "102310779313043127096", "name": "Tim Timmons", "time": 1572288637366, "rating": 1.0, "text": "This place is a joke...ran by totally incompetent managers!", "pics": null, "resp": null, "gmap_id": "0x88891a4eed114ee7:0x68dbec245650dbbc"}
{"user_id": "100458612127634882582", "name": "billy hannigan", "time": 1544552000369, "rating": 1.0, "text": "HR department is extremely inconsiderate.", "pics": null, "resp": null, "gmap_id": "0x88891a4eed114ee7:0x68dbec245650dbbc"}
{"user_id": "102699588264771601065", "name": "Dennis Wilks", "time": 1533244160342, "rating": 5.0, "text": "Great meeting with our partners Ram Tool Construction.", "pics": null, "resp": null, "gmap_id": "0x88891a4eed114ee7:0x68dbec245650dbbc"}
