{"user_id": "108790568487914570774", "name": "tonya Johnson", "time": 1497570506839, "rating": 4.0, "text": "Friendly Staff Safe Sex.\nNo Sex. Practice that's.", "pics": null, "resp": null, "gmap_id": "0x888918beee83221f:0xcff49695297710ff"}
{"user_id": "114350878905099447512", "name": "Jennifer Nelson", "time": 1550756958296, "rating": 5.0, "text": "AA meets here every morning at 6:30 am! Great meeting!", "pics": null, "resp": null, "gmap_id": "0x889a4dc91d9a35a5:0x47efa526342b961a"}
{"user_id": "112906281039734948085", "name": "Gary Donohoo", "time": 1549167148589, "rating": 5.0, "text": "Good bunch of friends of Bill W.", "pics": null, "resp": null, "gmap_id": "0x889a4dc91d9a35a5:0x47efa526342b961a"}
{"user_id": "108698198049461626156", "name": "Bruce Jones", "time": 1535378660990, "rating": 5.0, "text": "It is an absolute life saver for people like myself", "pics": null, "resp": null, "gmap_id": "0x889a4dc91d9a35a5:0x47efa526342b961a"}
{"user_id": "111781128016267591247", "name": "Daniel Hannan", "time": 1532838524291, "rating": 5.0, "text": "Saves lives", "pics": null, "resp": null, "gmap_id": "0x889a4dc91d9a35a5:0x47efa526342b961a"}
{"user_id": "112523796644348476863", "name": "Lauren Mahler", "time": 1592925959361, "rating": 3.0, "text": "I went for marriage counseling.  I believe Annette would have been fine for family counseling but she should have sent me to a specialist for abuse counseling.  “Women in abusive situations (even just physiological abuse) should not seek couples counseling. Couples counseling is designed for problems that are mutual.” Abuse is not mutual.  Read “Why does he do that?” By Lundy Bancroft if you are unsure if your marriage is considered abusive. Couples counseling only made my situation worse at home.", "pics": null, "resp": null, "gmap_id": "0x8889cbbbd45da017:0x9d9235bdbc3f216a"}
{"user_id": "110614043025173186001", "name": "sean schofield", "time": 1578432997591, "rating": 5.0, "text": "Awesome people, Annette is the absolute best for our son. We've seen remarkable results. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889cbbbd45da017:0x9d9235bdbc3f216a"}
{"user_id": "108545806718892733964", "name": "Amy Hancock", "time": 1507221298695, "rating": 5.0, "text": "I have used Cullman Family Counseling for several years. Has helped me tremendously. Just recently took my son there and they helped us sort out if it was a behavioral or mental issue. Thankful to have them there for me!", "pics": null, "resp": null, "gmap_id": "0x8889cbbbd45da017:0x9d9235bdbc3f216a"}
{"user_id": "105695634693973741221", "name": "Cherrelle Fancher", "time": 1528122721010, "rating": 5.0, "text": "Cullman Family Counseling is operated by people who genuinely care about their community and clients. They are a wonderful asset to the Cullman community and to those that they help.", "pics": null, "resp": null, "gmap_id": "0x8889cbbbd45da017:0x9d9235bdbc3f216a"}
{"user_id": "118219606682393351667", "name": "Raymond Yarbrough", "time": 1629699482826, "rating": 4.0, "text": "Great place it helps so many people who don't have insurance and they now have a low-cost dental clinic. I have insurance but I know a lot of people that don't in this place is a lifesaver for them their medications are even reduced in price so most people with any income especially those with very low income can't get there life saving medication without spending every time they have", "pics": null, "resp": null, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "113975866669725126167", "name": "James Sullivan", "time": 1627047128924, "rating": 3.0, "text": "Seems to only be about the grant money they receive for new patients. Started off real good but as time progressed they seemed to want me out and all the promises they made were lies. There are some good people there though. The program has a good foundation to make a really helpful experience.", "pics": null, "resp": {"time": 1628536456965, "text": "Hello James. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "115434672749021455613", "name": "Whitley Goodson", "time": 1626115741346, "rating": 4.0, "text": "They work towards making sure you're healthy and even have options for uninsured people to see a doctor. Lord forbid your insurance run out though. The front desk staff doesn't relay messages to your doctor and you end up going without blood pressure medicine for a month. Then when you finally get to see the doctor, they're pretty upset that their receptionists didn't let them know that you're going through sort of a health emergency.", "pics": null, "resp": {"time": 1628536452224, "text": "Hello Whitley. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "115915108177155209198", "name": "Shane T", "time": 1626387489728, "rating": 5.0, "text": "This location is very technologically advanced. They can administer all your health needs and are run on solar power.", "pics": null, "resp": {"time": 1628537254849, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "116395734257046669158", "name": "Milton Jent", "time": 1628647352187, "rating": 5.0, "text": "a really good place to go. got good doctors that will help you.", "pics": null, "resp": {"time": 1628537280006, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "105985201128839060360", "name": "Lance Moseley", "time": 1622755374485, "rating": 3.0, "text": "Clean and professional  but, I'm giving it a 3 star because I was told by the doctor and the theropist they don't perscribe benzodiazepines. I understand they are restrictions on certain prescribing medications but, please evaluate the person and at least review a person's background before you shut them down.i didn't feel heard at all . I am a former correctional officer and do not take anything.  Imagine being told the only medication that helps you,There not going to perscribe to you. I didn't make a big deal of it because everyone is polite.  But, I didn't feel heard or my personal situation evaluated", "pics": null, "resp": {"time": 1622759150178, "text": "Hello Lance. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "108675520148576965675", "name": "David & Krystal Bishop", "time": 1603230836234, "rating": 5.0, "text": "Capstone is a wonderful place that has a variety of health care as well as a dentistry on site.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMFbh_fIApPLPc3oYrYklwdSoKcVTHejcHIYRBS=w150-h150-k-no-p"]}], "resp": {"time": 1628536947119, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "100026738796992846942", "name": "Mandi Uptain Baker", "time": 1628989182047, "rating": 5.0, "text": "Love my doctor💖💖", "pics": null, "resp": null, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "111608912106967252229", "name": "Kelley Williams", "time": 1599573825367, "rating": 5.0, "text": "Absolutely wonderful establishment. Warm, caring, attentive staff all the way around. Pleasant disposition with everyone you come in contact with. Very affordable. I drive all the way from Hayden to Parrish and it's totally worth the trip. And the office is really modern. Clean. Spacious.", "pics": null, "resp": {"time": 1574512542073, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "108994353545852862849", "name": "Kenny Loyd", "time": 1581970514001, "rating": 5.0, "text": "The Parrish clinic is a God send to this little town and a general bright spot in the county. Deniser is a wonderful NP with genuine concern and care for her patients. Never have a problem getting things done here and being taken care of. Very professionally run from all aspects. Very happy with the new addition of the pharmacy of which I have used NAUVOO for years and would say will be hard to beat. I truly thank Capstone for it’s generosity towards our town and all they do to help move us forward.", "pics": null, "resp": {"time": 1628536922003, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "101041261569244892199", "name": "Leslie Payton", "time": 1597478282004, "rating": 4.0, "text": "They're pretty organized considering what's going on in the world right now", "pics": null, "resp": {"time": 1628536933274, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "110788177844726630666", "name": "Erica Swindle", "time": 1605919438008, "rating": 5.0, "text": "Incredible quality of work and awesome performance by the employees", "pics": null, "resp": {"time": 1628536949879, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "114930563372106101908", "name": "ANGELA COOK", "time": 1531782810254, "rating": 5.0, "text": "I received a shot for ear & sinus infection, and to clear up my lungs.  I'm so stubborn & should have gone in sooner.   I've suffered 4 weeks with this and couldn't overcome it.  I'm so grateful for Capstone's help.  They were so nice!     Old childhood memory...From now on I'll just go in & take that shot!   I didn't kick, scream, or bite the nurse this time.    When I was a kid, Dad would come & sit on me to protect the nurse's & I bit him several times.   He thought that was hilarious!  Instead of getting a whooping, he would come out laughing his head off.  Normally I was a very obedient & good child, but a needle turned me into a cat!  Miss dad!", "pics": null, "resp": {"time": 1541170048245, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "115353327528458657722", "name": "Savana Miller", "time": 1606887106599, "rating": 5.0, "text": "Do y'all do laughing gas while working on teeth", "pics": null, "resp": {"time": 1607038507412, "text": "no"}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "100504965729123535440", "name": "Merrie Brown", "time": 1581759968135, "rating": 4.0, "text": "I started going here in November, nice friendly people. Switched getting my meds too the pharmacist there in Parrish. Ran out of an important medication because they had closed due to a holiday. Understand they just opened up a pharmacy there but i ran out. Had an appointment today, needed some blood work done, after 4 different nurses they finally accomplished it. My appointment lasted 2 hours and i wasn't able too get my meds as i just missed it at closing time,5 o'clock exactly. So i asked the receptionist then Doctor Miller to have it sent too Wal mart, i go all the way into Wal mart for my meds that was much needed and it was NEVER called in and when i called it was the answering service. They closed at 5 i was at Wal mart at 5:24. Soo now i have to go all weekend without. Thanks.. when i left Capstone the gate was down at the pharmacy but they were still there. I guess some get treated differently there than other's", "pics": null, "resp": {"time": 1628536917120, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "107090492300435167503", "name": "Billy Ford", "time": 1576525292455, "rating": 5.0, "text": "They are the only Drs in 20 yrs to actually fight at all cost to get my treatments for my liver  and because  of this clinic  and the wonderful  staff I'm going to live to see my son get married  and watch my grandbabies  grow up God  bless this place..", "pics": null, "resp": {"time": 1628536905923, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "101062881511880310112", "name": "J Scott", "time": 1576011325273, "rating": 1.0, "text": "I have never been in this place that I did not have to wait a long time its apauling of the uncaring response I have had and no respECT I was 30 min. early and still wasn't called back an hour after my app. they new I had to work they was calling people a head of me they new I couldn't wait I'm berry sick been bleeding in my bowels you would think your doctor would care but I guess mot thanks for nothing", "pics": null, "resp": {"time": 1628536571966, "text": "Hello J Scott. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "114344554220781337894", "name": "Tiffany Hill", "time": 1563513041483, "rating": 1.0, "text": "The doctors and nurses here have always been nice but the receptionist at the desk was very rude and unprofessional to me today. She had an attitude from the time I walked in. I was having a hard time breathing and just needed a refill on my inhalers. When I was trying to pay for my visit she was talking really loud letting the whole waiting room hear my business. I will never go to Parrish clinic again. I’ll just stick with Nauvoo clinic. Nauvoo is awesome and a very sweet receptionist. I walked out of Parrish clinic. I didn’t even get seen. I had to go to emergency room just to get some relief from my asthma.", "pics": null, "resp": {"time": 1574512355877, "text": "Hello Tiffany. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "117144628169353530825", "name": "Sherri Walker", "time": 1568519268034, "rating": 5.0, "text": "Very convenient,on a first name basis with most of staff.im always taken very seriously.", "pics": null, "resp": {"time": 1574512558072, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "114096718899579265095", "name": "Joy Carlson", "time": 1544730712547, "rating": 5.0, "text": "Very nice, caring people in a hard hit rural area, clean and affordable.", "pics": null, "resp": {"time": 1552340451753, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "117841952774825763143", "name": "Wallace Hallmon", "time": 1503071770226, "rating": 5.0, "text": "I have been well pleased with the care I have received. They make me feel that they really care about me", "pics": null, "resp": {"time": 1505331347292, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "106113262152135676193", "name": "Martha Tucker", "time": 1504215628505, "rating": 5.0, "text": "Love this place. Everyone is friendly, the staff listens to your concerns. Highly recommend them.", "pics": null, "resp": {"time": 1505331264048, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "111252206183823615099", "name": "Amanda Leigh", "time": 1534436593480, "rating": 1.0, "text": "Dr. Miller is very cruel and uncaring. This is the most unprofessionally run doctor’s office I’ve ever been to. They treated me with disrespect and the nurse actually laughed at my concerns. I went in after moving from Soith Alabama in order for me to keep receiving a very vital prescription that I need to function on a daily basis. They e-scribed the meds to the Walmart pharmacy in Jasper. Well, the Walmart pharmacy was going to have to order it and it would take three days. Well, I needed the meds that day because I had started a new job and needed the meds to function properly and hold down my job. So, I called Dr. Miller to ask her to e-scribe it to the CVS. Well, it’s now three days later and Dr. Miller still hasn’t e-scribed the medicine. I’ve never in my life been treated so disrespectfully by a medical staff in my life. Luckily, my doctor’s office in my old town e-scribed the script in for me or else I would have eventually lost my job waiting on Dr. Miller. This clinic is a JOKE. The people who work there are a JOKE.", "pics": null, "resp": {"time": 1534454556731, "text": "We have searched for you in our patient database and are unable to locate you as our patient.  Because you aren't in our system, we don't have contact information and thus encourage you to contact our offices if and talk to management about this issue."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "103469772733211728677", "name": "Brandy Reynolds", "time": 1516200172652, "rating": 2.0, "text": "I went here nearly 5 months ago after a bad spat of bronchitis, upper respiratory infection and lung infection. I had a horrible cough during that and developed a hard pressure in the upper center part of my stomach which is pushing on my ribs and heart (possibly vagus nerve) I explained all of this to the doctor that I seen and told him I was having problems breathing since it started, much worse when I sat down. I also explained to this doctor that I had been taking meds for migraines but had ran out and needed a refill. Once this doctor found out I was a smoker, he seemed to not even care at all. He blamed everything on smoking. I had my 12 year old son in the room at the time and this doctor literally drew a graph of how long I was going to live on the bed paper. He terrified my son!!! I knew then I'd never see that man again! Instead of checking to see what the pressure was and instead of refilling a med I had been taking for 12 years he put me on Buspar. The first night I took that Buspar the pressure increased so bad I could hardly move! I'm also now having to take bp meds since all of this. I'm 34 years old, I should not have all of this going on and for it to hit like it did all at once. And instead of this doctor trying to help me he terrified my son! He also prescribed me Naproxen which luckily I didn't take because I went to St. Vincent where they done at egd and found I have chronic gastritis as well as reflux esophagitis so the Naproxen could have caused a stomach bleed... I've seen another doctor here who is better than the first but I am still having the same issues. I'm honestly believing a stuck hiatal hernia or something else has been missed. The new doc put me on zantac which didn't help either. I feel no better, in fact I feel worse than when I did when I went to try and get help here about 5 months ago. As far as the staff, nurses and other docs they are great. The first doc I saw I would not recommend to my worst enemy!", "pics": null, "resp": {"time": 1628537207737, "text": "Hello Brandy. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "110641990497504960156", "name": "chassidy smith (Chass)", "time": 1496078040001, "rating": 5.0, "text": "This place is wonderful... They don't judge and love everyone the same ...:)", "pics": null, "resp": {"time": 1505331492983, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "101559836099771922575", "name": "Isaac Patterson", "time": 1503540889412, "rating": 5.0, "text": "Great service. They care about you", "pics": null, "resp": {"time": 1505331325016, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "113599897302576320142", "name": "Sharon Trimm", "time": 1541028935740, "rating": 1.0, "text": "They don't care about their patients. They have taken over 2 months to get my husband a referral to a specialist. Still no appointment.", "pics": null, "resp": {"time": 1541169977310, "text": "Hello Sharon. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "112273122413152014923", "name": "Janice Lightsey", "time": 1503702071651, "rating": 5.0, "text": "This place treats people very good nice to go where they listen to you and youre not just a number", "pics": null, "resp": {"time": 1505331289409, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "108280697258100229182", "name": "Kyle “Necronomikyle” Dockery", "time": 1529705159975, "rating": 1.0, "text": "I used to love this place but my last few visit have been plagued with billing errors or inconsistencies, staff members that get confrontational just because you ask questions about services your paying for, staff members giving false information about billing, and service providers that are seemingly apathetic.", "pics": null, "resp": {"time": 1529780538768, "text": "Hello Kyle. Thank you for the review and providing this feedback. Capstone Rural Health strives to serve the patient needs to the best of our ability. If you would like to discuss this further, please contact the Operations Director at 205-686-5113."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "101385664125598020171", "name": "Lonita Tucker", "time": 1499267379182, "rating": 5.0, "text": "My doctor is great", "pics": null, "resp": {"time": 1505331471529, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "108148704040127403174", "name": "Melissa Pettit", "time": 1523020981325, "rating": 5.0, "text": "Simple and easy", "pics": null, "resp": {"time": 1541170110629, "text": "Thank you for your review and rating. Capstone appreciates you choosing us as your healthcare provider."}, "gmap_id": "0x88888a6633a60b37:0xcbd29eb21ed5b341"}
{"user_id": "109564226312361038667", "name": "Reuven Knight (Laz0r50)", "time": 1461030594448, "rating": 3.0, "text": "John Rook is an excellent counselor and helped me very much in the time that I saw him, even though he could not save my marriage at the time (it was beyond saving but he did his best) and always treated us with dignity and respect. That is why it is so sad that I have to say that I wouldn't trust him with record keeping as he lost the entire file on my marriage counseling and did not even have a digital copy. Worse, he told my legal representation who needed the file that he never, ever took notes which I knew was untrue and was contradictory to what he had said about losing the file (how can you lose something that never existed?).\nHe is good counselor to go to for advice, but I wouldn't go to him if you might need records of your therapy later.", "pics": null, "resp": null, "gmap_id": "0x88927dd36b98bfbb:0x59188415ad3155e1"}
{"user_id": "112520203106825222014", "name": "Christina Oates", "time": 1629238081457, "rating": 5.0, "text": "Thrive is making such an impact in my life. I love how easy and open the conversations are and how the counselors personalize the “growth” assignments to their clients. They honestly meet you were you are and are honest and helpful about where the next steps are and how to take them on your journey to a better and healthier you.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "102577419814964078798", "name": "Carly Steed", "time": 1627049974478, "rating": 2.0, "text": "Please do not book a psychiatry appointment here. I was diagnosed with a panic disorder (after being asked vague questions and made to feel uncomfortable) and prescribed a VERY outdated medicine that isn’t prescribed anymore. After speaking to my therapist about not feeling anything, and even feeling worse from the medicine prescribed, I called the office and was immediately told that I could only talk to the psychiatrist in person and would have to pay for another session rather than quickly speak to the psychiatrist about this weird medicine or ask any questions. The psychiatrist would not take questions over the phone. I went to another psychiatrist, and was told that the medicine I was prescribed was one that she had never heard of. Please take the plunge and join the waiting list to see another psychiatrist.", "pics": null, "resp": {"time": 1627051234265, "text": "While we do stand behind the knowledge and expertise of our psychiatrist, your experience following up was not acceptable. It will be addressed and we apologize for your experience. If you would like to discuss it directly you can reach me on my cell at (205) 743-9251."}, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "111315312618344298253", "name": "Sarah Arnold", "time": 1628615130974, "rating": 5.0, "text": "Wonderful counselors who will really listen and do their best to help you.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "107241517556331570228", "name": "Sam Mayhew", "time": 1628615409042, "rating": 5.0, "text": "Great counciling for all of your mental health needs.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "115954176930852337511", "name": "Burgandy M", "time": 1623255212555, "rating": 2.0, "text": "Did not want to retain me as a patient. Counselor cancelled appointments. Phone sessions were cut short (counselor disinterested).", "pics": null, "resp": {"time": 1623262325084, "text": "We never want one of our clients to feel this way. You can contact me directly on my cell at (205) 743-9251 and we will do whatever we need to to make this right."}, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "103083350347864768484", "name": "kyle fortenberry", "time": 1628616161003, "rating": 5.0, "text": "The best counsellors work here!", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "115546509333291626148", "name": "Scott Hodnett", "time": 1628615286190, "rating": 5.0, "text": "Wonderful place with great counselors!!", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "116532065080543243075", "name": "Payton H. Stantis", "time": 1583248867248, "rating": 5.0, "text": "When I say that Thrive Counseling & Trauma Therapy has saved my life, I mean THEY HAVE SAVED MY LIFE. The methods that Jeff and his team use to help their clients are different than any type of therapy I have experienced. I spent much of my life seeing talk therapists who would make me feel heard, but that never gave me the tools to handle life's difficult situations. Thrive will hear you and help you figure out concrete ways to handle life's hurdles while providing you with the tools necessary to regulate yourself in any situation. I have been going here for years and have made significant progress on managing emotions, conflict resolution, self esteem, and have processed through multiple traumas. Many of my friends and family go here as well and we are all constantly singing their praises!  If you are ready for some healing contact these wonderful humans because they are the best in the biz! Good luck!<3", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "106511653386093639018", "name": "JustBeingDrè _", "time": 1494977232919, "rating": 5.0, "text": "I have known Jeff professionally for years. We worked side by side, practically sharing an office for about 2 years. He is truly passionate about his work and the healing of his clients. I know for a fact that he will go the extra mile to help clients achieve therapeutic goals, if you are willing to do your part. He is experienced and certified in substance abuse treatment and trauma therapy.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "110376672012477654972", "name": "Regina Turner", "time": 1551743775879, "rating": 5.0, "text": "Jeff has been helpful as I work through adjustments and anxiety.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "107999966181547050169", "name": "Theresa Rose", "time": 1616621123220, "rating": 5.0, "text": "I never thought I could get better and not be depressed, until I started seeing Jeff at Thrive a few years ago. The day he was getting married, I had a pretty terrible panic attack and called him, and he spoke with me for 45 minutes and was able to calm me down. Right before they walked down the aisle!!! EMDR helped even though I was skeptical of it. I’m not perfect now, but I’m far from the sad, depressed girl who walked into Thrive suicidal all those years ago. They are wonderful and I couldn’t sing their praises enough!!!", "pics": null, "resp": null, "gmap_id": "0x8889232604792c65:0x5211fff7c37f08d7"}
{"user_id": "100981674450619719385", "name": "Mellissa Goetz", "time": 1609891065023, "rating": 5.0, "text": "Great counseling! Not just someone that will just listen and give metaphors. Actually getting better with each visit. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889232604792c65:0x5211fff7c37f08d7"}
{"user_id": "116945667201273026069", "name": "A Dana", "time": 1627438273459, "rating": 5.0, "text": "I've had a wonderful counselor here for 2 years. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "112957104417902610330", "name": "Autumn May", "time": 1622150014467, "rating": 1.0, "text": "I was recommended to call this place but after calling all week about services they never return phone calls, even with voicemails left! I’ll find some other services.", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "108191254693118638489", "name": "Maitri Ganguly", "time": 1595693132791, "rating": 5.0, "text": "My counselor was Elizabeth and I wanted someone to help me gather all my strength and fight back. She was able to peek deep inside me and could address the points I needed. It's been about 2yrs and I still remember everything she told me and I still practice them.", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "113091863933214793373", "name": "Ellie Banks", "time": 1598544607977, "rating": 5.0, "text": "I have had a great experience with Oasis. My therapist, Leah, is very comforting, kind and attentive. I've always had positive interactions with the office staff and I would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "107848514114374007553", "name": "Krissy Cinnamon", "time": 1546663002579, "rating": 1.0, "text": "Completely disgusted by the way I was treated here. They are supposed to be “non profit,” but all they care about is money. My therapist retired without even telling me. I requested off work 2 weeks in advance to see another person. They “randomly” do a file check 30 MINUTES before an appointment in which I desperately needed help. Since I didn’t have the amount of money they wanted (I borrowed enough to get there from a friend), they cancelled my appointment and left me in tears and gave me no other options for who to call. If I had plenty of money to give them, I’m sure they would have found a way to see me. Also, SHAME on Mrs. Player for retiring and not even telling me. Really inconsiderate and money hungry despite the fact that they get proper funding and should see low income people needing help. I didn’t get it here.......", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "117593098305661382346", "name": "Kristina Blackmon", "time": 1531259195912, "rating": 5.0, "text": "What's in a name? Everything. This place is an oasis. The people here are nice. Its a judgement free place and i always leave refreshed.", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "115002359956892986477", "name": "Ambra Richardson", "time": 1554837163982, "rating": 5.0, "text": "Awesome place. I didnt feel out of place or judged. I was able to open up and let things out and left with a smile on my face and feeling much better than I did.", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "115729675832185919169", "name": "Kara", "time": 1510149528473, "rating": 5.0, "text": "My young daughter has benefited immensely from counseling here and she looks forward to going all the time. They work with my low income so we can easily afford to come regularly.", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "114703962043272744489", "name": "R Heffner", "time": 1571156611074, "rating": 5.0, "text": "Near uab", "pics": null, "resp": null, "gmap_id": "0x88891bdb3851e1fd:0x35988f2e0786a10e"}
{"user_id": "117871315260237187816", "name": "Lucas Fenstermacher", "time": 1624066462372, "rating": 5.0, "text": "Went here years ago, wouldn't be here today if not for Dr. Avery Berry he helped me out a lot didn't judge me once and took his time to try to understand me and my thoughts, he saw me as human being and not as a crazy person the way my last therapist did elsewhere because of him I am able to cope with having bipolar disorder better than I was before. I'd recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "102406628889749483172", "name": "CHLOE CROSKEY", "time": 1626453018224, "rating": 1.0, "text": "The website for this company has no integrity.  The employees would NOT tell me (Michelle Croskey) who the CEO/President name.  This company is Not professional. Can someone have one these people to call me or give me there phone number.\nDuncan McRae, Jr. M.D., President\nPete Cobb, J.D., Vice President\nElizabeth DuBard, Secretary\nSteve Rutledge, Treasurer\nJessica Taylor, J.D., Immediate Past President", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "107445596653551451482", "name": "Rebecca Varner", "time": 1599836936498, "rating": 5.0, "text": "I took my granddaughter’s here to see someone and they really were very helpful and the girls loved their therapist and it really seemed to help them. They are very helpful if we you really are having problems and need help. They don’t take insurance but you pay cash and they will give you a receipt to for you to file with your insurance.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "106362633253189940238", "name": "Debi Goodman", "time": 1588015619350, "rating": 5.0, "text": "I have seen 2 of the counselors here over the last 10 years. Another family member has seen a third. We have been extremely happy with all 3. The staff is professional but makes you feel like family. There is no judgement. They are faith based, but you decide whether or not you want that to be part of your program. I would reccomend this group to anyone of any age who needs someone to help them work  through  something. They take all major insurance and have a payment plan if you are uninsured.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "112550832522594320110", "name": "shelbly1", "time": 1568144564124, "rating": 5.0, "text": "I absolutely love the counselor I see here! She is so kind and caring. Helpful and compassionate about what you're dealing with.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "116859078028732265371", "name": "Scott McNelley", "time": 1392480560412, "rating": 5.0, "text": "This is a wonderful resource for so many in the River Region. Compassionate counseling and help provided by a very talented staff.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "110686894710486879266", "name": "Holly Walker", "time": 1602635578401, "rating": 5.0, "text": "This counselor is amazing. She was very helpful!! Really appreciate all of her help!", "pics": null, "resp": null, "gmap_id": "0x888a3eaff1aa5223:0x4ad10ecb2542b819"}
{"user_id": "107542633975982889553", "name": "Kadie Oquain", "time": 1597091640070, "rating": 5.0, "text": "A very friendly place nice people too", "pics": null, "resp": null, "gmap_id": "0x888a3eaff1aa5223:0x4ad10ecb2542b819"}
{"user_id": "110031941071750947018", "name": "Matthew Putman", "time": 1624932411418, "rating": 5.0, "text": "It was a little off the beaten path which is not a bad thing. I got a very good feeling when I walked inside and I could feel Dr. Jessica's high vibrational energy as soon as she walked through the door. It was very comforting to say the least. I would recommend her to anyone.", "pics": null, "resp": null, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "115228334772318673824", "name": "G M", "time": 1621021089125, "rating": 4.0, "text": "Lori has been a wonderful doctor. My life has improved greatly since working with her. I only wish I had met her sooner. The staff always worked with me when it came to payments when things were tough.", "pics": null, "resp": null, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "114401029044434865717", "name": "Ananna Jones", "time": 1625155857678, "rating": 5.0, "text": "This place helped saved my life, it truly is a lovely and peaceful place, and everyone there is wonderful and comforting", "pics": null, "resp": null, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "108371168644195959518", "name": "Tracey Horton", "time": 1608339641084, "rating": 1.0, "text": "I had my first appt with Lori Pohly and there's no way to sugar coat it, it was awful.  Unprofessional. Condescending. Mocking. Insensitive. Dismissive.\n\nI went for Child Post-Traumatic Stress Disorder in an Adult and past history of eating disorders related to food insecurity.\n\nShe had the audacity to smirk while I was talking about symptoms.  I asked what she was smiling about and thinking? She said, \"Well, I'm thinking that you talk like you have anorexia, but... :::: points up and down toward me::::::  you obviously, don't have that.\n\nYes, thank you for that reminder.  Yes, I'm overweight and no longer am anorexic but still have anorexic behaviors, perceptions, and thinking.\n\nI pointed out an instance of starving as a child, with NO food and having water mixed with ketchup as soup.  She decided to dismiss the severity of the situation by pointing out that her father loved ketchup on spaghetti.  Okaaaaaay, except that was HIS choice and preference.  Not a situation where it was the only thing and it had to be eaten 3 times a day.\n\nLori Pohli needs to go back to school, taking some sensitivity training, and maybe working in an ER or hospital setting to learn some REAL therapy skills.\n\nIt is unprofessional and unethical at best.", "pics": null, "resp": {"time": 1608757622085, "text": "I am so sorry you had those experiences.  Please let us know if there is anything we can do to help alleviate your stress or if we can place you with another therapist.  Jessica Zimmerman and Joanne Weis are both amazing local therapists if you need a referral to another agency or another agency's phone numbers let us know.  What matters most is that you get to a therapist that can give you the help you need."}, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "102505644213561676171", "name": "MaryAnn Hillig", "time": 1596291781024, "rating": 5.0, "text": "Lori is a wonderful counselor who is very experienced and down to earth.", "pics": null, "resp": {"time": 1596467811136, "text": "Thank you!! We appreciate you so much :)"}, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "115517243708114031052", "name": "Barry Beavers", "time": 1492829451926, "rating": 5.0, "text": "Jessica Penot is amazing. She is very insightful and backs up her sessions with the latest literature. She gives excellent suggestions on books to read to help your particular situation. I always feel much better after a session. Highest recommendation! She is also a very accomplished author, her books are great!", "pics": null, "resp": null, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "103840001664965082051", "name": "Stone Statue", "time": 1543899170251, "rating": 5.0, "text": "Jessica Penot is very good at what she does. She takes the time to listen to what you have to say. I have benefited a great deal from her experience.", "pics": null, "resp": null, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "107427142081631639484", "name": "Johnny Roscoe", "time": 1549467449232, "rating": 5.0, "text": "This place is great. Great staff, counselors and doctor. I highly recommend!", "pics": null, "resp": {"time": 1549475820627, "text": "Thank you for great review! We appreciate your business!"}, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "114707155757847104135", "name": "Sue Wlos", "time": 1559085667328, "rating": 1.0, "text": "Very disappointed", "pics": null, "resp": {"time": 1559328012212, "text": "We are so sorry to hear that.  If there is anything we can do to help or change things please let us know.  We are here Monday, Tuesday, Weds, and Friday from 9am to 4pm and would love to talk to you about any problems you have had.  You can also email the owner at Jessica.penot@gmail.com if you would like to discuss it with her."}, "gmap_id": "0x886212f54cdb07b3:0xfcbe7896a44bd6f7"}
{"user_id": "102423391220071048334", "name": "JB", "time": 1618606557455, "rating": 4.0, "text": "TC Counseling has some amazing counselors, that can assist individuals in every aspect of their life.", "pics": null, "resp": null, "gmap_id": "0x8889198f67bc0629:0xb4fcb7b8a1a34549"}
{"user_id": "118094571279552962882", "name": "Eboni Thomas", "time": 1618608109166, "rating": 5.0, "text": "Respectable service, very reliable and dependable.", "pics": null, "resp": null, "gmap_id": "0x8889198f67bc0629:0xb4fcb7b8a1a34549"}
{"user_id": "107421737258528075141", "name": "Yoshiko Legg", "time": 1572127200688, "rating": 5.0, "text": "I have been in Birmingham for two years. We have searched high and low for a good, strong counselor. We found it!! Our lives have changed. Forever grateful!!", "pics": null, "resp": null, "gmap_id": "0x8889198f67bc0629:0xb4fcb7b8a1a34549"}
{"user_id": "101544450639058039738", "name": "Jamal Jamal", "time": 1597969750733, "rating": 1.0, "text": "Called about inquiring assistance. Was told to call 211 and she got off the phone as fast as she could. This place has no real interest in helping. Showed no concern.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "111074940875565011731", "name": "Becky Jones", "time": 1543364050329, "rating": 5.0, "text": "Catholic Social Services is an awesome place. They have different programs to help people with different kinds of circumstances. ☺️ They help women who are in the family way (or expecting a baby). They have a wonderful program for women and their unborn baby. 🙂 They have other programs based on people's needs. They also accept donations from in-date food to gently used clothing. I highly recommend and trust this fantastic organization! 😀", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "106609227429101872915", "name": "Terry Dees", "time": 1617753768142, "rating": 5.0, "text": "Are we helpful", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "109814232002794134814", "name": "Anne Malec", "time": 1601927364322, "rating": 5.0, "text": "Thank you Catholic Social Services for all the help you give to our community!  I am proud to be a Catholic and the 1st to donate items to your shop where I know they will go to people in need.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "104480066704570793575", "name": "erica ervin", "time": 1558036917836, "rating": 1.0, "text": "I will never ever return here. I would never refer anyone to this place. I came here because the catholic services where I have been living was very helpful. If you’re honest about your situation here, they help you out by calling DHR on you. Typical judgemental people", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "114960452083175142215", "name": "Saphronia Smith", "time": 1553849423796, "rating": 5.0, "text": "Very good selection of goods. And. Everthing was neat and in its place", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "114352758607726340884", "name": "Newlife Ocean09", "time": 1556554390472, "rating": 1.0, "text": "I called to seek assistance on geting help with my light bill and they told me that I either had to be 2 months behind or I had to be in disconnect status. Soooo wow this is crazy.... This goes to show you why folks don't give a damn about catholics. They are not a place of help or need they are a busines just like everyone else .", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "114354932692612429034", "name": "Twinkle Davis", "time": 1497531274836, "rating": 1.0, "text": "I don't understand how the Catholic Social services requires an individual to be 2 months behind on their rent or about to be evicted in order to receive an appointment and in return once the appointment is made the only assistance they offer is 200 dollars max.....That is not assisting individuals with staying off the streets. Especially families who actually had an extreme emergency. You expect them to pay the remainder of the balance before you pay the 200 dollars. If they were able to pay any of it I would think they wouldn't have the need to come to you for help. That is a slap in the face calling that emergency assistance. Catholic Social services should just shut down. There are people out here who work hard everyday and are hit with something unexpected and are faced with being homeless but the system rather help people who manipulate the system. Yeah this world is backwards....", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "108441188182670075850", "name": "Hope Brown", "time": 1523366208315, "rating": 4.0, "text": "Was in and out quickly! Everyone was nice, and accommodating.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "116069880796549662495", "name": "Teresa Starks", "time": 1575083438869, "rating": 1.0, "text": "No help to me you have to be in their outlines of what they can do anything different they can't help or offer anywhere to help you", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "109497160317255148172", "name": "toni field", "time": 1507646600536, "rating": 5.0, "text": "I want to thank you all so very much for your help throughout my hard times💘... Ms. Condolette, my heart goes out to you. You were so very kind & precious 💝.\nThank you all💘.\nJ.F.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "103482192991659811212", "name": "Minah Vibez", "time": 1530209160187, "rating": 1.0, "text": "they don’t really pay much on utilities and don’t give the right information out. My whole appointment was a waste of time and it just seems like they want to get in your business just to preach at you.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "116177175962976691331", "name": "Dvd p", "time": 1546177494983, "rating": 1.0, "text": "Another trick by the Catholic Church to get your eyes off of the truth and on them. Read your Bible.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "107217669035484601733", "name": "Monicajazz Taylor", "time": 1548281683539, "rating": 1.0, "text": "Because they look how much i made before i got sick, didnt help", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "108664190054131239168", "name": "Helen Conner", "time": 1532377399262, "rating": 1.0, "text": "I don't understand if a person is in need why you have to have a appointment a week or so away when you are disabled and you don't have power and all you want is a little bit of help just once in your life and you feel so humiliated as it is to ask and then they just make it worse and don't even help with any other resources that could be quicker for you, just aweful.", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "106417786231497236707", "name": "Amanda Hughes", "time": 1572041500217, "rating": 5.0, "text": "Clean, helpful and professional", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "115664519824056500547", "name": "Henry Kimbrough", "time": 1540661819047, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "112785831311982912615", "name": "Vashon Marcel", "time": 1526493999650, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889a4fd180372455:0xa0dd1ee6ba08f2ab"}
{"user_id": "106714065417311034723", "name": "Genoc Genesis", "time": 1628010366141, "rating": 5.0, "text": "I see Maggie Kellar and her nurse Mackenzie. They are both fantastic and very personable. I drive 45 minutes just to see them specifically. My experience with Mrs.Kellar is the best doctor/patient experience I have ever had. As long as the both of them are there I will always come back.", "pics": null, "resp": {"time": 1628011594099, "text": "We appreciate the five-star review. Thank you for taking the time. I share this with the team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "111088285127167682268", "name": "melody galloway", "time": 1626799700334, "rating": 5.0, "text": "Wonderful clinical staff.  Love love LOVE Dr. Lona!  She's intuitive and kind always.", "pics": null, "resp": {"time": 1626804381575, "text": "Melody, thank you for taking the time to leave us a review. We appreciate your kind words and I will share them with the team.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "112747420689615813668", "name": "Mark Gotschall", "time": 1619647761047, "rating": 5.0, "text": "This place is so much the improvement over the Mobile location.  Miss Anita has always taken good care of me.", "pics": null, "resp": {"time": 1619704167460, "text": "We appreciate the review and value your feedback. Thanks for taking the time. I will share it with our team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "107238972653597520709", "name": "Bernard Doug Cook", "time": 1618246308024, "rating": 4.0, "text": "Seeing a therapist there, Barbara Lee, she's pretty good.", "pics": null, "resp": {"time": 1618253299486, "text": "Hi Bernard, thank you so much for the review. I am happy to hear you've had a positive experience at BayView. I will share your feedback with our team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101933426791587473106", "name": "Paula D", "time": 1611276984306, "rating": 5.0, "text": "I love this office! I recently had my first appointment there in the office with Ms. kellar. The nurse mckenzie and ms Keller we’re both very kind and i could tell they really cared about me and my mental health. As long as dr kellar and McKenzie are there i will continue to come.", "pics": null, "resp": {"time": 1611328235036, "text": "So glad you had a great experience, Paula. I will share your feedback and praise with our team. Have a wonderful day!\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105056974580107650670", "name": "Gail GULF SHORES", "time": 1598468288749, "rating": 5.0, "text": "So far so good for the excellent help I've got online with KATHERINE DAVIS. She is a very compassionate employee,  \"goes the extra mile \". So helpful with any questions.  A keeper.", "pics": null, "resp": {"time": 1598472946760, "text": "Hi, Gail! Thank you for the five-star review. We appreciate your kind words.\nSincerely,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "107061948462776552968", "name": "Sandi Cushway", "time": 1581717258298, "rating": 2.0, "text": "They completely changed my medications that I have been stable on for over 15 years (with not ever having to increase ANYTHING).  I have only seen the PA twice and she was pretty nice.  There seems to be little concern for what I, as their patient, am going through every single day as a result of their decisions.  They are making matters worse for me mentally to where I am barely functional at home or work.  The only reason I gave two stars is for the nurse, Anita.", "pics": null, "resp": {"time": 1581721202681, "text": "Sandi, I am sorry to hear we did not meet your expectations. Your feedback will help us improve our services. If there is anything further you wish to add you can reach a member of our patient relations department at info@altapointe.org.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101617498648064415605", "name": "Billiam Quine", "time": 1575313763900, "rating": 1.0, "text": "They have an issue with making sure their records are up to date. Their staff isn’t helpful and I’m not sure they could be even if they wanted to. Lots of “Its not my problem” going on there. Find someone else to see. Just because they may be the biggest certainly doesn’t mean they are the best.", "pics": null, "resp": {"time": 1575403907628, "text": "Hi, Billiam. I am sorry to hear we did not meet your expectations of care. We appreciate the feedback because it will help us improve our care. If you would like to share more about your experience you can send an email to info@altapointe.org or reach our Patient Relations department at (833) 921-1811.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "113201579604041302758", "name": "Serena kay", "time": 1565619809891, "rating": 5.0, "text": "I found a place where I could get help for my autistic son that's transitioning into adulthood. It's nice to have a place we can call and talk to and get help with medications without coming across as different or weird.  They deal with these things on a daily basis and it feels good to be understood.", "pics": null, "resp": {"time": 1566234746100, "text": "Hi, Serena Kay. Thank you for the five-star review. We appreciate you and your feedback.\nSincerely,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "114717128277114793724", "name": "Shae McIntyre", "time": 1578512568798, "rating": 1.0, "text": "First of all it took 3 months to get in to see a nurse practitioner to try to get different medication for my anxiety. Second, I finally get to my appointment and because I have shingles (which is a. Only contagious when the fluid in the blisters are touched but b. All of my stuff was covered and wrapped up) they said they would need to do a full decontamination sweep and I would have to get the clearance from my doctor before I can be seen  . So I spent an hour there waiting just to hear I'm the plague basically. I've never felt so offended. I already cant go to my own brothers wedding because of it but now this. I'm furious.", "pics": null, "resp": {"time": 1578522055496, "text": "Shae, I am very sorry to hear we did not meet your expectations of care. Your feedback will help us improve our services. If you would like to provide us with additional information, you can speak to someone in our patient relations department by calling (833) 921-1810.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "116324311210238740165", "name": "Juli Norman", "time": 1582921058880, "rating": 1.0, "text": "Some of the most unkind judgmental unprofessional human beings I’ve ever met. Worst money I ever spent looking for help. Went here due to my doctor no longer being in practice and instead of getting back on my regular medications I Was accused of being under the influence by the NP I saw, being two days post op. She stated “you seem drowsy and irritable” I’m tired and in pain (since I was driving I couldn’t take my pain medication). The woman who took me back for my weight and BP answered her phone and began screaming at someone about what only I can assume was her boyfriend cheating on her. Not a single employee looked at me with a smile or made me feel welcome in the slightest. These woman look at you and judge you, they didn’t even talk to me before I felt like I wanted to run out of that building. I just wish I had read reviews before giving them my money.", "pics": null, "resp": {"time": 1582924708391, "text": "Juli,  thanks for sharing your feedback. I am sorry your experience didn’t match your expectations. Your feedback will help us improve. Please feel free to reach out to our Patient Relations department (833) 921-1811 with any further comments, concerns, or suggestions you wish to share.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "115186632278001103758", "name": "Ingrid Hartman", "time": 1555342724085, "rating": 5.0, "text": "My family’s experience has always great!  The location is convenient, the medical staff thorough and the clinicians spend the time needed. Thank you!", "pics": null, "resp": {"time": 1556111097279, "text": "Hi, Ingrid! Thank you for the five-star review. It is our goal to deliver the utmost in care to our patients and their families so they can live their best lives."}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "116630874358668399189", "name": "Christa Bailey", "time": 1519248559272, "rating": 1.0, "text": "People who come to BayView for help have issues. I was 2 minutes late and had to check in (wait for 6 minutes in line because a computer was down and I was standing there not knowing what to do and nobody would even look at me). I was told that I was 10 minutes late and my appointment is only 20 minutes long so I could reschedule or the doctor would work me in -of course I will have a no-show fee. I have never been here and not had to wait 15 minutes to see doc-I guess it’s a one way street.", "pics": null, "resp": null, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105519067131511202481", "name": "Samantha Wade Caraway", "time": 1513282717030, "rating": 1.0, "text": "DO NOT GO TO BAYVIEW! THESE PEOPLE DO NOT CARE ABOUT THEIR PATIENTS! They can not even file insurance correctly. If you don't agree with them, they will refuse to do ANYTHING for you. Their only option is to increase meds that do not work or put the patient in the hospital. If I could put ZERO stars, I would!", "pics": null, "resp": null, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "112670653066595001898", "name": "Richard Vin Zant", "time": 1564409121515, "rating": 1.0, "text": "Yeah worst record keeping of any business I’ve been too.", "pics": null, "resp": {"time": 1564423971258, "text": "Hi, Richard. I am sorry to hear we did not meet your expectations. Your feedback will help us improve our services. If you would like to provide any further information, please email us at info@altapointe.org\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "115695293131782216691", "name": "Indigo Bolt", "time": 1550852163071, "rating": 4.0, "text": "Affordable health care not much of a wait if you get in at the right time other wise you may wait up to three hours brief being seen.", "pics": null, "resp": null, "gmap_id": "0x88626b2f8a47f3ab:0x3422d4355d194172"}
{"user_id": "104287176090595124416", "name": "richard holcombe", "time": 1543059736694, "rating": 5.0, "text": "Help with what your to scared to hand money you hand you think make them fat let hospital Handel it for you they got the big bucks fixing them", "pics": null, "resp": null, "gmap_id": "0x88626b2f8a47f3ab:0x3422d4355d194172"}
{"user_id": "106974279064451533434", "name": "James Watwood", "time": 1534164720177, "rating": 5.0, "text": "Great place great peeps", "pics": null, "resp": null, "gmap_id": "0x88626b2f8a47f3ab:0x3422d4355d194172"}
{"user_id": "108271251819242661372", "name": "Buffie Holt", "time": 1594647793095, "rating": 2.0, "text": "Truly loved this place & therapist until one day they wouldn’t see my kids because I was told that “the last several appointments hadn’t been paid for by insurance”. I checked insurance which hadn’t changed at all, let the practice know and also gave them the new telemedicine codes from the insurance company. No response to repeated emails (which is the better and faster way to communicate) to even try and help so I’ve come to the conclusion someone there doesn’t care enough or smart enough to file insurance claims. After months of therapy & gaining my kids trust, now I have to start over because it was very literally only a paycheck to them.", "pics": null, "resp": null, "gmap_id": "0x888925ddd2e33661:0xc69ee6de01d45412"}
{"user_id": "116335756438574248445", "name": "Sonia Argueta", "time": 1596509075309, "rating": 5.0, "text": "No doubt this is a place that God has His hand on. Josh Shoemake is an amazing councelor.", "pics": null, "resp": {"time": 1621775893366, "text": "Thank you for your kind words!"}, "gmap_id": "0x888925ddd2e33661:0xc69ee6de01d45412"}
{"user_id": "109328305447424691969", "name": "Matt White", "time": 1576454711985, "rating": 5.0, "text": "You will not find a group of caring and loving individuals. WWG will always be a crucial piece of our family forever. Highly recommend.", "pics": null, "resp": {"time": 1621775876809, "text": "Thank you so much!"}, "gmap_id": "0x888925ddd2e33661:0xc69ee6de01d45412"}
{"user_id": "106365683196040562740", "name": "Robyn Nichols", "time": 1555949040190, "rating": 2.0, "text": "While I liked my daughter's therapist, it is almost impossible to get an afternoon appointment. I also, called to cancel an appointment the day  of because my daughter had a stomach virus and they charged me a $50 fee which they refused to refund. I will find another therapist.", "pics": null, "resp": null, "gmap_id": "0x888925ddd2e33661:0xc69ee6de01d45412"}
{"user_id": "115735581277979563321", "name": "Susan o'brien", "time": 1530041707560, "rating": 5.0, "text": "My Grandaughter goes here to,see Cherie shes a very  Godly lady who really connects with my daughter I ,I'm verry fond of her receptionist its always so. Friendly I highly recomend it", "pics": null, "resp": {"time": 1530042474746, "text": "❤️"}, "gmap_id": "0x888925ddd2e33661:0xc69ee6de01d45412"}
{"user_id": "107363320017728714818", "name": "Tj Ball", "time": 1538558987810, "rating": 1.0, "text": "I am a veteran and went through The vet center to be able to go here.  On my first visit the counselor never showed up and then on my third visit my counselor was on vacation. This place does not support the military or the veterans.", "pics": null, "resp": null, "gmap_id": "0x88929341848b9ae5:0x4512605e19195010"}
{"user_id": "116280052174193535677", "name": "dropof blood", "time": 1526401232596, "rating": 1.0, "text": "no privacy walked in the door sat down, one of the thrapists came out and started talking with someone right in the lobby. doing paper work in another room and a bunch of people come in", "pics": null, "resp": null, "gmap_id": "0x88929341848b9ae5:0x4512605e19195010"}
{"user_id": "112788562341638563553", "name": "Darrell s", "time": 1529709237241, "rating": 5.0, "text": "Great people and Jeff justice is the best", "pics": null, "resp": null, "gmap_id": "0x88929341848b9ae5:0x4512605e19195010"}
{"user_id": "114887793840161290840", "name": "K Hudlin", "time": 1615061937884, "rating": 5.0, "text": "Very nice office, scheduling appointments is a very easy process, and great staff!\nMrs. Kelsey Jackson is a dream! My son quickly felt comfortable with her and was willing to go out of his way and come out of his shell with her assistance. He says he likes going to \"Doctor's appointments now.\" It is so nice to receive care from someone who actually loves their job. She just has this ease about her that put my son and I in a very comfortable space. Mrs. Kelsey please keep doing what you do, you are a very bright light! You are a very valuable asset to your organization! Stay safe and well. Blessings to you and your family!!", "pics": null, "resp": {"time": 1615219345718, "text": "Thank you so much for the kind words, and especially for Kelsey! We think she's pretty awesome, too!  We're so happy that you had a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "116227978716204049887", "name": "Laura Elmore", "time": 1617657531737, "rating": 5.0, "text": "We’ve had a great experience going through autism and ADHD testing for two of our boys. The staff are friendly, knowledgeable, and professional. Scheduling is easy (I recommend emailing for appointments). The feedback from Dr Wadsworth and the therapists is great! Can’t recommend this place enough :)", "pics": null, "resp": {"time": 1617717323197, "text": "Thank you so much for this great review! We're glad that you had such a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "102262751710617203234", "name": "Terin", "time": 1600800399733, "rating": 1.0, "text": "I’ve been calling since June to schedule an appointment; I was finally able to reach someone at the clinic via phone - it’s September. To be clear, I have not been to their office... This practice was recommended by my child’s pediatrician for comprehensive developmental testing. Once I finally spoke to someone, I was informed that they only accept BCBS or cash. For the low, low price of $2500-3000, you can have 3-4 appointments (that is for testing only, no treatment).\n\nWhile their website presents this image that they aim to treat a wide array of conditions, including those individuals with disabilities and handicaps, it appears that their primary interest is taking advantage of those most in need. In many instances, those with handicaps and disabilities are unable to work with little to no income to support themselves or rely on their families for support; families in these situations are already under intense financial strain. Additionally, based on my conversation, test results are not given until a year long payment plan concludes (imagine an oncologist having this policy). A year, when it comes to a child’s development, is a long time to wait.\n\nAfter hearing the pricing, I had no interest in further details or clarification; however, I suppose it’s a good thing they offer a payment plan, if you’re willing to pay their high fees and do not want to take out a personal loan. It is likely they do not contract with Medicaid because the state will not pay anywhere close to their high fees.\n\nI have no interest in supporting a clinic more interested in lining their pockets than genuinely helping the community in which they aim to serve. I would not recommend this clinic to anyone and I will be contacting my pediatrician’s office to advocate removing this office from their list of recommendations.", "pics": null, "resp": {"time": 1600811761271, "text": "Terin,\n\nI am very sorry for the communication difficulties. I am afraid that there were some miscommunications regarding insurance coverage and cost of testing.  Additionally, test results are never withheld for payment - we always provide patients with a copy of the test results at the test result session, with payment plans continuing well beyond that date if cash is used. Please contact our office manager, Angela, at angela@silverliningsclinic.com for more clarifications.\n\nThank you,\nSLN"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107219142762668301169", "name": "Krista Kiser", "time": 1617208472749, "rating": 5.0, "text": "Holleigh Woodward is an compassionate professional therapist. I highly recommend her.", "pics": null, "resp": {"time": 1617717382608, "text": "Thank you so much for the kind words for Holleigh!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "110785630211230592802", "name": "Jason & Amanda Page", "time": 1564781419799, "rating": 5.0, "text": "We’ve been using Silver Linings for our daughter for almost two years now. We absolutely love the doctors there. The environment is welcoming and calming. The doctors are very patient and detailed. They go over things with us at length and make sure we understand everything about a diagnosis or a therapy we’re doing. I’m just so very thankful for this place! Highly recommend it!", "pics": null, "resp": {"time": 1564958007364, "text": "Jason & Amanda,\n\nThank you so much for sharing your experience! We’re so happy that it’s been a positive one. It’s been a delight working with your family!!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117700292109131912622", "name": "Brittnie Guise", "time": 1596550319079, "rating": 1.0, "text": "My son had an appointment for a full developmental screening and I was contacted by Angela and she told me that insurance denied to cover the testing and so I called my insurance company and they sent me information to appeal and I let Angela know this and she emailed me back once and I at that point communicated that I wanted to appeal and then sent her the information that needed to be filled out. It’s been 3 weeks and I’ve heard NOTHING from anyone. I have left voicemails for Angela  as well as emails, I have also tried contacting the front office and have left voicemails there trying to get some sort of help. My child is 4 and at the developmental level of a 2.5 year old as far as his speech & has multiple behavioral issues, I am desperate for help for him and all I want is for him to hopefully be tested and appeal the insurance decision or it’s $2600 out of pocket. It seems as though no one here cares I don’t understand it. Very unprofessional and I would not recommend this business to anyone. I’m beyond frustrated and disappointed.", "pics": null, "resp": {"time": 1596555049190, "text": "Ms. Guise,\n\nWe are so very sorry for the communication difficulties. We will be reaching out to you as soon as possible to attempt to rectify the situation.\n\nSLN"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "110126183966165584875", "name": "Jennifer Brown", "time": 1560174617330, "rating": 5.0, "text": "My son is a patient with Heather Wadsworth. Her and the rest of the staff are amazing at what they do and very friendly! The office is very clean, comfortable, and welcoming for people of all ages. By far the best place we have been for my son to get help with his issues. We love this office. My son actually gets excited for each appointment! Definitely a 5 Star facility!", "pics": null, "resp": {"time": 1560175487830, "text": "Jennifer,\n\nWe're so happy that you and your son are enjoying your experience with Heather and everyone at SLN!  It makes our day to know that your visits have been so positive!  Thank you so much for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "113664281639864498400", "name": "Jessie Loveday", "time": 1593127466168, "rating": 5.0, "text": "We LOVE silver linings!! We went to numerous other places to get our son the help he so desperately needed. My son suffers from a severe case of selective Mutisim and we just kept getting told he will out grow it but we knew better and were watching our child suffer with such a debilitating anxiety disorder. Then we found silver linings. We met with Dr.Crisler and she confirmed that he would not “just out grow it” and they would get our son through this. She set us up for therapy with Emily and she is simply amazing!! Our son has been to four therapy sessions and we are already seeing amazing progress. The entire staff is so kind, compassionate, understanding, and you can tell none of them are there just for a paycheck. They TRULY care about these kids and the families. The front desk staff always make you feel so welcome and have always been upfront about there policies and do a great job going over insurance and copays prior to your first visit. I HIGHLY recommend this team!", "pics": null, "resp": {"time": 1593180395552, "text": "Jessie,\n\nThank you so much for such a warm review!! We are all so happy that you have been seeing progress and have had such a good experience with our team!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117700435964401330954", "name": "Tasha Vineyard", "time": 1568033748910, "rating": 5.0, "text": "It's very hard to find skilled and compassionate mental health professionals but this office has nailed it. Everyone from the Office Manager (Angie) to the Psychologist (Dr. Crisler) are caring and patient. We have been patients here since the office opened and the quality of care provided has been exceptional.", "pics": null, "resp": {"time": 1568044704740, "text": "Tasha,\nThank you so much for this review and kind words!! It has been our pleasure to work with you and are delighted that you've felt so supported!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105956955776369894907", "name": "Cassandra Roberts", "time": 1575784054952, "rating": 5.0, "text": "Silver Linings has been the best thing for our daughter. The advancements she's made since we have started going is unbelievable and we are so grateful for them!", "pics": null, "resp": {"time": 1575903069178, "text": "Cassandra,\n\nWe are so happy that you have had a great experience at Silver Linings! Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "100671702607893317718", "name": "april patellis", "time": 1559681437900, "rating": 5.0, "text": "My daughter has had a wonderful experience at Silver Linings.  She is working with Brooke Sorrells, Speech and Language Pathologist, to improve her verbal social skills.  2 months ago I would have never thought that a speech pathologist could help her with her social skills, but she is improving so much thanks to Brooke's work with her!", "pics": null, "resp": {"time": 1559844959846, "text": "April,\nThanks so much for the positive review! Brooke is pretty awesome :) We're happy you have seen such great improvement!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1559834481063, "rating": 4.0, "text": "Pretty good. One odd policy like we can be late more than 15 minutes late for your appointment but if you're 15 minutes late you may not get in. Other than that pretty good and professional.", "pics": null, "resp": {"time": 1559845389300, "text": "Thanks for the kind review! We're very sorry if you were ever left waiting. If this was a significant problem, please feel free to reach out to our office manager, Angie, at office@silverliningsclinic.com  We try our best to stay on time and have the 15 minute policy in place to simply encourage our clients to do the same - especially for our shorter, 30 minute sessions.  When we are able to, though, we do make every effort to see patients who are late."}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "108051639933198824726", "name": "Lela Boggess", "time": 1556550050022, "rating": 5.0, "text": "As a homeschool family, Silver Linings provided  exactly to kind of support that we needed to get answers and solutions to a few of the issues we were facing. The staff were all helpful and polite. Billing was made clear and they helped us navigate insurance issues. I would recommend them to others.", "pics": null, "resp": {"time": 1556635913390, "text": "Lela,\nThank you so much for the kind review! We’re happy that you had such a positive experience with the entire process!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "103808072427117692694", "name": "randy williams", "time": 1553782858111, "rating": 1.0, "text": "I had a very poor experience with silver linings. I needed help with my teenage son.the attitude and atmosphere from the beginning was uninspiring at best.the reception was poor.the lack of information was poor.my son had one visit .the counselor did not even introduce himself or herself.i don't know if it was a male or female. my son will not even tell me what was discussed.please go elsewhere if you need help.", "pics": null, "resp": {"time": 1553796249200, "text": "I am sorry that your experience with SLN was unsatisfactory.  Please reach out to us at office@silverliningsclinic.com so we can better understand your complaints and how to rectify the problem in the future."}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "116656017474654651318", "name": "Christie Queen", "time": 1556335499724, "rating": 5.0, "text": "My daughter loved her experience with testing recently. The staff was very friendly and helpful. The office was clean, welcoming, and well-thought out.", "pics": null, "resp": {"time": 1556541920342, "text": "Christie,\nWe're so happy that testing went well with you and your daughter! We aim to try and make it as pleasant as possible and are so happy that you both were pleased!  Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107312898871977736000", "name": "Kathleen Dunseith", "time": 1561392398698, "rating": 5.0, "text": "The staff is great. They communicate by phone, text, and email. Most paperwork is sent ahead of time by email or their online portal.", "pics": null, "resp": {"time": 1561415999518, "text": "Kathleen,\nThank you for the wonderful review! We're happy that you have found use of the online portal and have had a positive experience with our team!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105601826631770899498", "name": "Meg Breland", "time": 1534295780530, "rating": 5.0, "text": "Silver Linings is the perfect name for this office! These amazing women go above and beyond for you. The whole office from the receptionist to the doctors take the time to know you and your child. They REALLY listen and want to use their knowledge to help. Here you are not just another patient. (Also, They take a variety of insurances. So don't let that stop you from calling.) They provide the gold standard testing like Sparks and Glenwood without being put on a year long waiting list.", "pics": null, "resp": null, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107035388024058210213", "name": "Pamela Kerns", "time": 1556562912954, "rating": 5.0, "text": "Everyone in this business has been kind and courteous.  Takes time to listen about needs and has been very punctual about appointment times.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOTds5VtuC3rt910RjhKLRBUDNIM5LymplJuQ4j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgHWuvb0lPGbUNmTrqEF9PicjyfpJkemugF7Bo=w150-h150-k-no-p"]}], "resp": {"time": 1556635998287, "text": "Pamela,\nWe greatly appreciate your kind words! We’re happy that you have had a good experience with our team! Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "108963407588328066973", "name": "ALN", "time": 1554302898709, "rating": 5.0, "text": "SLN is simply AMAZING!! They offer everything from diagnostics to other services that a client may need. They are passionate and vested in their clients, and go above and beyond what one would expect from a professional setting. Personally, the wellbeing of a child is priceless, and they are more than willing to take the time to listen and then implement whatever means necessary to help a client. I HIGHLY RECOMMEND SLN! You will be blessed!", "pics": null, "resp": {"time": 1554829073573, "text": "Thank you so much for the positive feedback!  It has truly been a pleasure of ours to help!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105012151659853195263", "name": "Norionna Cox", "time": 1554467140503, "rating": 5.0, "text": "The entire staff is amazing!! They have been so helpful and encouraging and we are so thankful for their help.", "pics": null, "resp": {"time": 1554828860143, "text": "Thank you so much for the warm feedback!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107331701119944635207", "name": "Brenda Tapia", "time": 1555014098297, "rating": 4.0, "text": "Great support in working though and developing a plan. I appreciate the staffs professionalism .", "pics": null, "resp": {"time": 1555078837301, "text": "I'm so glad that you felt supported! Thank you for sharing your positive experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117137893230451895396", "name": "Karen Rass", "time": 1554816292729, "rating": 5.0, "text": "Very nice office and wonderful staff! Dr Crisler was concerned about my child issues and listen to them! Thank u!", "pics": null, "resp": {"time": 1554828780100, "text": "Thank you so much for the kind review!  We're so happy that you had a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "111025696414748911189", "name": "Matthew “Matt S”", "time": 1539741391688, "rating": 1.0, "text": "*****DO NOT USE SILVER LININGS*****\n\nAs much as Silver Linings does to help the customer, I feel like they still need a lot of work in actually helping.\n\nThe only reason I was willing to see so many therapist and so often was because we had met our max deductible and all that would be owed was the $25 dollar co-pay as session.\n\nSomehow in their decisions, they had us using a therapist that apparently wasnt a Blue Cross Blue Shield In-Network Doctor. You would of thought that anyone in their right mind wanting to only pay the 25 co-pay would not want each session to start costing over $130 dollars a session.\n\nI know I am partly to blame, but I just stopped paying waiting for the insurance to clear on the sessions, UN-knowing she was not even running it on Insurance. Silver Linings kinda screwed me over.\n\nOn top of that, my wife is a bit forgetful but we were stuck with $400 dollars in Cancellation fees for 4 missed appointments. Pretty stiff. I never even knew that policy existed, because they never told me. And dont say well I told Jane, because I am Bob and not Jane. Tell me the one paying the bills.\n\nWell as things are now, we are not putting our son back at Silver Linings because I feel like I was screwed over and they are not willing to work with me at all.  They will take their money over time sure, but work with me getting screwed over and making things right, no they wont.\n\nIf they decide to work something out with me, I will edit my review.", "pics": null, "resp": {"time": 1539793482702, "text": "Mr. Skillman,\n\nWe are deeply sorry that you feel less than pleased with the encounters your family has had with Silver Linings.  We do our best to present all fees within initial paperwork and notify families of any higher fees related to insurance as soon as we are made aware, but also understand that you are not satisfied at present.  We will discuss as a team how to improve and make all fees as clear as possible to future families. We are sorry for the frustrations you have experienced.  Please call us at 256-489-1583 to discuss your personal encounter in more detail and how we can further help.  When calling, please ask for the Insurance & Billing Department.\n\nSincerely,\nThe Silver Linings Team"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "115916623262560252548", "name": "rachel ciliax", "time": 1555425802290, "rating": 5.0, "text": "Very knowledgeable and friendly staff, dr Emily is great with my son.", "pics": null, "resp": {"time": 1555671901061, "text": "We’re so happy that you have been pleased with everyone, especially Emily! Thank you for the kind review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107195974654973740165", "name": "David Moak", "time": 1580312208960, "rating": 5.0, "text": "Easy parking and covered access", "pics": null, "resp": {"time": 1580851255923, "text": "Thanks for the great review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105583832628431142937", "name": "Kristi Tahada", "time": 1471879670031, "rating": 5.0, "text": "Dr. Griffith is an amazingly empathetic counselor who genuinely cares about her clients. She's helped me tremendously and I'm so glad I was referred to her.", "pics": null, "resp": null, "gmap_id": "0x886268cfa246afe7:0x5faffa851f7826df"}
{"user_id": "108535098481422491720", "name": "Stacie Willis", "time": 1618798798507, "rating": 1.0, "text": "I went there and it really was like no one cared about me but only getting their money I had been through so much before I got there I was abused by my boyfriend and abandoned by my own family not to mention I was on drugs ,I had a roommate that was stealing from the center and they punished me not her I had the worst client rep she only cared about the ones who had money.. I left the center and got clean all on my own without their help I mean I tried to ask for help no one wanted to hear my story Brenda just ignored my cry for real help I never relapsed the whole time I was there.. I’d never refer someone to that money making place they don’t care about you only the money....", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "109732978315492363003", "name": "Mandy Armitage", "time": 1597777037718, "rating": 5.0, "text": "I have never met 2 women that have hearts as big and genuine as Mrs. Brenda and Mrs. Malinda... The Lovelady Center changed my life and gave me all the tools to utilize out in the world to remain sober and drug free. My relationship with my kids has been restored and I now have a handsome grandson that I am able to spend lots of time with. Had I not went to The Lovelady Center there is no telling if I would even still be alive. Thank you so much for all that you have done for me Mrs. Brenda and Mrs. Malinda. I am now a much stronger, happier, independent woman and I was able to become this woman with the help that The Lovelady Center gave me. This a picture of my most handsome and wonderful grandson. Thank you Lord for The Lovelady Center!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMl1_QJzBOSS-A_oNytn-77wMXq_hpHLNQmsPri=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "111203269111180148013", "name": "Angela Edwards", "time": 1619257169924, "rating": 5.0, "text": "Man, this place is so amazing!! Everyone is just so nice here, and they love u so much... This place has taught me how to live life without drugs. I learned how to love myself ❤️ I wouldn't wanna be anywhere else. We're one big family, here at the lovelady center it doesn't matter where you come from, They take you in and treat you like family, they even let you have your sweet babies here . We have a church and a kid zone . Transportation and walmart trips 👌🏼 , Im currently in phase 4 of 5 . I'll be forever thankful for the lovelady and staff . N the best part is they are christian based ✝️🙌🏼", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "107169982013563387008", "name": "Gabriel Bruzzi", "time": 1616714852724, "rating": 5.0, "text": "My daughter has some mental issues and addictive drug issues as well. She had been there years ago for what she was going thru back then. They took her back again with open arms as she is going thru allot now. They called me to let me know she got there ok from Amtrak as they picked her up. I pray and hope she gets the help that they can provide for her. Having the word of God is such great help as well.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "113173430954081535174", "name": "Michael Ganey", "time": 1573062558367, "rating": 5.0, "text": "From Hevan was sent the lady's running the love lady center. They have saved and changed my wife's life. And with the power of God backing the ladies, nothing can stop them. God Bless you all. Thank You !!!!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "101871523091700069988", "name": "Jessica Kuerner", "time": 1563899164344, "rating": 1.0, "text": "We scheduled a donation pickup and they called the day before to confirm, but then never showed up!  For several days we had to haul it out to the driveway and then haul it back in so it wouldn't get rained on, and they were so rude on the phone when we tried to confirm they were ever going to come get it!  Why bother calling us the day before and then not show up?  Luckily there are many other organizations in Birmingham that are responsive and grateful for donations, like The Exchange Club!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103465405167840657897", "name": "David Melton", "time": 1559971370312, "rating": 1.0, "text": "What a load this place is. I cant recommend using Lovelady to make donations. They’ll call and tell you a truck will be in your area accepting donations for pickup but then they never show up. Then they’ll call you to reschedule, but they still won’t show up. I had several boxes of my mother’s clothes waiting outside for six days for them to pick up. When they finally did show, they picked up a couple small items and left everything else with a note saying they I needed to call again to reschedule. Only problem is, the next few days rain was expected so I had to haul everything back into the house. I’ve called several times since then and they won’t answer, ignore my calls, or send me to voicemail. So exhausting dealing with them. It’s almost like they get off on stringing me along but I’m not gonna beg them to come pick up my stuff. They should be the ones asking me. Oh wait, that’s right they did ask me when they called in the first place. Yeah, right. Good luck with that. I wanted to donate my mother’s clothing. She passed a way a few month’s ago and would have wanted it that way. But I can’t deal with the ineptitude, incompetence, and unreliability of Lovelady.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "106010787554681526423", "name": "Steph Casey", "time": 1549162933246, "rating": 5.0, "text": "Tonia Silas do you not understand what it means to work for your room and board?  Tell me where on Earth (other than jail) that you can go live for free? It is a shame that you are not the first person to come to the Lovelady with that attitude and you probably won't be the last. I've got news for you though; until you get real about living a productive life, supporting yourself and not blaming everyone else for all of your problems your life is not gonna change. There are many people in this world that do not care about you, your circumstances or your salvation, but Miss Brenda and Miss Melinda actually do.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "101754297470100673342", "name": "Stephanie Casey", "time": 1537452926709, "rating": 5.0, "text": "I love the Lovelady! I am grateful that this place exists to help people like myself. I am disappointed to hear people badmouth this place when there are such good people doing their best to cater to our every need. We need a place to stay? We got it. A soft, warm bed? We got it. Food to eat? We've got it. Clothing? We got it. Someone to talk to? (in the form of amazing counselors and client reps)-we've got it. Transportation? We've got it. Healthcare services? We've got it. Family legal assistance? We've got it. Stop complaining! I'm a firm believer that we are a family-a family of survivors...and a family in Christ. Stop talking bad about my family!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "117091323685356040915", "name": "Dennis Turnbaugh", "time": 1528735552668, "rating": 5.0, "text": "First of all I need to apologize to Ms. Brenda and Ms. Melinda for the review I posted 11 months ago! My wife graduated from TLC in January 2018. When she arrived April 2017 she was pregnant, and broken. She was sent on a court order which infuriated me. Neither of us realized how badly she needed to go to The Lovelady! My 2 children went there to live with her in June 2017, and our 3rd baby arrived August 2017. Had she not gone to TLC, she wouldn't have learned to live first for God and the rest would fall into place, nor would I. Even after moving out of the center they are still there for her, they're there for us! The people are amazing people of God and are an amazing support system!! They're still our family and friends and to be honest, we've never known friends, love, and support the way they've shown to our family! God knows what he's doing, and he sent my wife there for a reason. Had he not, I don't know where my family would be today. Many thanks and much love to all of the folks at The Lovelady Center!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102046184030698226299", "name": "Leah Logan", "time": 1604971916657, "rating": 5.0, "text": "I love it here!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "114176399131309948694", "name": "Brenda Sullivan", "time": 1548176484929, "rating": 5.0, "text": "MY NAME IS BRENDA SULLIVAN McCLENEY AND I WAS SENT TO THE LOVE LADY CENTER BY THE STATE OF ALABAMA ON THE SUPERVISED RELEASE PROGRAM WHERE I SPENT MY LAST 9 MONTHS OF INCARCERATION THERE.. I MUST ADMIT THAT WHEN I FIRST ARRIVED IT WAS VERY OVERWHELMING...AFTER SPENDING SOME TIME WITH THE AMAZING PEOPLE THAT OWN AND RUN THE LOVE LADY THE OVERWHELMING FEELING THAT I HAD WAS REPLACED WITH THE FEELING OF PEACE AND MY WHOLE LIFE HAS BEEN CHANGED BECAUSE OF THIS PLACE!!!MRS BRENDA,,MRS MALINDA AND MY BEAUTIFUL CLIENT REP MRS TAMMY PORTER SHOWED ME MORE LOVE THAN I COULD EVER HAVE IMAGINED AND MADE ME WANT TO BE A BETTER PERSON!! THIS PLACE HAS TAKEN ME FROM PRISONER TO PRINCESS AND I THANK GOD FOR THE OPPORTUNITY TO BE ONE OF MRS BRENDAS MANY LOVE LADY SUCCESS STORIES...", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "112752716654036871874", "name": "Kayla Brown", "time": 1526865602970, "rating": 5.0, "text": "I as well as my daughter lived at the Lovelady center as I went through the program! If a person wants a new life the opportunity is there! Mrs Brenda, Melinda and the rest of the staff were always there to help! My daughter enjoyed the time there as she got to make friends and play as I sometimes worked in the Education and Kids zone! I would recommend this place to anyone seeking second chances and a sober life! Most of all they offer HOPE and LOVE as well as support!!! Assisted me in my court cases and even today I stand strong and sober without my Gods love my will and their “whole-way house” I would not be where I am today! Thanks Mrs Brendan and Melinda for having that vision where women in need may get that last chance to live and have a free life!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "115672259265402741962", "name": "Joseph Willingham", "time": 1504227055896, "rating": 5.0, "text": "Amazing place! This place brings women and children to God and sobriety.  To me that is sacred grounds. Addiction is the filthiest place on Earth and i hear people on here talking about dirty rugs.This is spiritual boot camp not the Hilton. if you have a problem with the rugs or playground then go volunteer. Otherwise just sit back and watch the miracle of God\"s work. This is a huge opportunity for someone that is willing to put forth the work of learning to have a better life.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "114113391770346841933", "name": "Amanda Whitman", "time": 1592419261242, "rating": 5.0, "text": "I have no clue who R is but I am a Lovelady and they have never charged me or my family for my meds.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "118432478298348106591", "name": "joni rogers", "time": 1561803378081, "rating": 5.0, "text": "God favors this place 🙌 my life was changed, giving thanks to all who answered God's calling, I've seen restoration, healing and pure worship.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104619620964128683846", "name": "Susan Lay", "time": 1567020972251, "rating": 5.0, "text": "I was a resident from December 2006 thru June 2007 ... graduated the program and under the supervision of Hugh Thomas and Ms Brenda I started the Job Placement department.  My name was Susan Edgil at the time.  After graduating I continued to live on the 4th floor working on into 2008... I believe I left in March 2008. They provide EVERYTHING NEEDED TO PREPARE TO LIVE YOUR LIFE CLEAN AND SOBER... BUT YOU HAVE TO WANT IT.  IM STILL CLEAN AND SOBER...13 YEARS AND COUNTING!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "112620993439254436486", "name": "Ashley Head", "time": 1550820415727, "rating": 5.0, "text": "This place has been absolutely  amazing and has already began to work miracles and restoration in my life and with my children from broken to blessed this program truly works if you are ready for a life change and are ready to make that commitment  for yourself then this is definitely  the place to be everyone here is so full of love and support.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "100480615468362853072", "name": "Jennifer Creech", "time": 1568772014191, "rating": 5.0, "text": "Wonderful place and people. Changing lives daily", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "111591041285393662800", "name": "Christina Keener", "time": 1536611963540, "rating": 5.0, "text": "Loved this place!  Great people and wonderful staff that helped me so much!  Mrs. Brenda will always have a special place in my heart for all that she did for me!!!! 💜💜💜💜", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102297633959894363939", "name": "Tom Dooley", "time": 1506032622337, "rating": 5.0, "text": "As a volunteer on the pastoral team I've witnessed first-hand this amazing \"whole-way house\" holistic program.  Each week I speak with dozens of women who are being transformed from addicts and incarcerated individuals into precious Loveladies.  This is an exemplary faith-based recovery center.  ti works.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104353787908882036600", "name": "Maranda&Paul Godwin", "time": 1556854813672, "rating": 5.0, "text": "My name is Maranda Harville. I was incarcerated in 2011, 2012 for drug related problems. My life was great BUT I didnt know it! I've been reading what some of the ladies have said about this place so I decided to tell my story!!! THANK GOD! THAT I WAS SENT HERE. My community corrections officer an my mom an dad found this place for me. I was afraid an overwhelmed just like a few others, in the beginning! Not completely knowing what to expect an being away from everything and everyone I knew. That was key tho, an very soon into my journey I would find this out. The date that I am writing this is May2nd2019 an I have been COMPLETELY 100% clean an sober since the day i walked out of this place. 1st an foremost it takes a desire to change. 2nd it takes help. An 3rd it takes a higher power! Speaking for myself and only myself I found all of these things here at THE LOVELADY! God has always been a huge part of my life BUT I refound Him here. You see even tho He never left me I NOT ONLY LOST MYSELF IN MY ADDICTION I LOST HIM. An IN RECOVER YOU HAVE TO HAVE A HIGHER POWER!!! I choose for mine to be God! Mrs.Brenda, Mrs.Melinda, Ms.Brandi, an i definitely cant forget Pastor Lesley an Pastor Mullins! An so many more from admin to exit! I cant say enough good about them all. All of them have made it possible for females like me to learn how to live again. Of course there is some bad BUT all in all it was a great experience FOR ME! I was reading a post from a Ms.Silas an I completely disagree. The foodstamp stuff and the thrift store stuff is completely untrue! This program is Blessed, The Hand of God is on this place because they do so much good! There was a store where you could treat yourself an they do take foodstamps for your convenience. They do try an get you back out into the working world BUT IF YOU HAVE ISSUES THEN YOU CAN WORK WITHING THE FACILITY! Ms.Silas failed to tell you how you do schooling you can have your children here, they can go to school as well. So many good things an I will stand firm on this!!! THANK YOU LOVELADY CENTER! TO ALL WHO WERE THSRE WHEN I WAS THERE AN TO ALL WHO ARE THERE STILL AN NOW... CONTINUE TO DO WHAT YOU DO!!! IF WE WANT CHANGE IT CAN BE FOUND HERE!!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "111402262849705246235", "name": "Cindy Isaacs", "time": 1530666322179, "rating": 5.0, "text": "I have watched miracle after miracle turn women's lives around.  This establishment is great for any woman that wants to turn her life around.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "100599570625461717481", "name": "Kimberly Pickron", "time": 1546446796516, "rating": 5.0, "text": "This place is truly God's house.. Amazing", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "116740752679350877118", "name": "Lisa", "time": 1550899642887, "rating": 5.0, "text": "I have learned who I was..who I am and who i will become! This place has changed my life and the people here have become my family!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103974936204841273403", "name": "Rani Chapman", "time": 1478815975929, "rating": 2.0, "text": "There are pros and cons. Some good programs offered. But the mold and mildew make even the staff sick.I called the health dept to no avail. I called the state rep for that area and within an hour my dau. -in-law was kicked out for an offense that wasn't proven.The food is mostly donated expired food that isn't safe to eat.  And they get and keep 100% of each girls food stamps. Item donated  are then sold to the girls. And they charge family members for drugs paid for by medicaid and medicare.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103580591423669844110", "name": "shirley mccord", "time": 1528072520286, "rating": 5.0, "text": "I called the Center last week to report a problem with a patient. The operator said she would have someone call me and I could tell her what happened. The return call never came. I have been a supporter for this center for years, am a christian countsler for girls with hurts and hang ups. This is very disappointing to me since this young lady has been in several faclities  including Love lady several time.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103669534343350527826", "name": "Lily Roberson", "time": 1527348027176, "rating": 5.0, "text": "This place helped me and my mom develop a better relationship and it helped her with responsibility and a lot more", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102824848429769577982", "name": "Laura Diane Bailey", "time": 1499346234798, "rating": 5.0, "text": "They helped my sister Karen brewer ,she is now drug and alcohol free, Thanks for all your help and support that you all did for her,GOD BLESS THE LOVELY LADIES CENTER,\nTHANK YOU,LAURA BAILEY", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "107405898633468998043", "name": "Lisa Hester", "time": 1408299673995, "rating": 5.0, "text": "Miss Brenda and her loveladies helped my sister become free from her addictions and got her to start believing in God, trusting in Him and following His ways! I will be forever grateful to this center for changing a woman we thought would never change. I pray nothing but the best for your success in helping the lost become found and changing the worst into the best! Thank you so much to all the loveladies at the Lovelady Center in Birmingham AL.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "105761249101982271604", "name": "Steve Pruett", "time": 1512518100637, "rating": 1.0, "text": "Lady at the desk was cold and non-receptive..\nDis not have any ideas how to help us with a family member.\nThey wanted $ up front (non-refundable) if our relative runs 2 days in, we lose it all!!\nNo acceptance letter or contract until theu get $...\nWe will go else where.\nOh btw, ive I've served in ministries helping people with addictions for many years.  I was sad to see such a cold lady to talk to!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "109236546804545718844", "name": "Sheena King", "time": 1516907412980, "rating": 5.0, "text": "I love this place because this is where i found what ive been searching for....GOD", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "106860945439081303528", "name": "Susan McDonald", "time": 1457398868066, "rating": 5.0, "text": "GOD TRULY TRANSFORMS AT THE LOVELADY CENTER!! THANK U GOD FOR THE LOVELADY CENTER!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104066046471091803554", "name": "Janet Caldwell", "time": 1558875515665, "rating": 1.0, "text": "From visiting this place and observing it is a hazard and the poor kids that are there having to live in there is horriable who would put children with over 400 drug addicts coming in off the streets they get there cash assistance a d food stamps from these kids I hope it gets shut down or at least the kids will get taken out of there", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "115802036508042552842", "name": "Nelta Cox", "time": 1422820050107, "rating": 5.0, "text": "Save my life! Tks miss Brenda spann for answering gods calling:)", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "115355125222852794225", "name": "Brenda Kirksey", "time": 1422866815862, "rating": 5.0, "text": "Awesome place to be I was there in 2010-2011. I'm going back there tomorrow", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "107769261148041912161", "name": "Jerry Ippolito", "time": 1619031791964, "rating": 5.0, "text": "//////Gynarchy now!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "108084572461159663409", "name": "Ginger Tunnell", "time": 1522511391861, "rating": 5.0, "text": "Wonderful place", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104612211716134179961", "name": "Courtney Woods", "time": 1513857026578, "rating": 5.0, "text": "This is an amazing place", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "103062729592318738830", "name": "Michael Witt", "time": 1476817799000, "rating": 4.0, "text": "Because my Sister is going there to get help for addiction problems.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "102949831934362286668", "name": "Bad Babies", "time": 1490059859368, "rating": 1.0, "text": "This place needs to be shutdown!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104641463898667381099", "name": "jacob Fleming", "time": 1462685416305, "rating": 5.0, "text": "It the best it nice to be a love lady", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "113964637315498172481", "name": "Brett Rogers", "time": 1471391148674, "rating": 1.0, "text": "this place is a hoax/scam. a bunch of greedy, hypocrites.", "pics": null, "resp": null, "gmap_id": "0x888910183b0f17e1:0x5eea278810234762"}
{"user_id": "104353787908882036600", "name": "Maranda&Paul Godwin", "time": 1556897777967, "rating": 5.0, "text": "I'm looking for a program for my brother an I seen the question on Mr.Larsons page. You helped someone you will be blessed for that. What they do with it is on them. I have heard of this place tho so I'm sure its legit!!!", "pics": null, "resp": null, "gmap_id": "0x88626afebdf7903b:0x230acca42f0653ff"}
{"user_id": "104294836035423198962", "name": "Larson Hicks", "time": 1555639423068, "rating": 1.0, "text": "Is this for real? I gave the dude outside of the dollar store some money, but not sure if it’s legit?", "pics": null, "resp": null, "gmap_id": "0x88626afebdf7903b:0x230acca42f0653ff"}
{"user_id": "112107192622640094491", "name": "A. S.", "time": 1495462530677, "rating": 5.0, "text": "Dr. Adams is knowledgeable in his field and has successfully treated my type 2 bipolar disorder.  He worked with me to find the best combination of medications so that I am able to function as a productive citizen and not be in a prescription haze/foggy mind. As a patient of Dr. Adams for ~11 years I have only had positive experiences with him and his staff and would highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "101311565114546529731", "name": "Art", "time": 1495383128245, "rating": 5.0, "text": "My family and I are very grateful for the outstanding care we have received!  We have benefited greatly and continue to reap rewards from the work we have done together.  We HIGHLY RECOMMEND this provider for individuals and families seeking compassionate, experienced, highly professional care. Thank you most of all, dear Dr. Douglas Adams!", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "114585744046161133105", "name": "Amelia Adams", "time": 1512748637510, "rating": 5.0, "text": "Please do not leave reviews on this site/page if you are not a Saturday patient of Dr. Douglas Adams. The business that goes by the name Madison Behavioral Diagnostic and Treatment Services belongs solely to Dr. Adams. The other providers that rent out an office in this building have a different corporation named Behavioral Health Offices.  This page to leave reviews on has no relation to Behavioral Health Offices providers. Unless you are one of Dr. Adams’ Saturday patients, do not leave feedback here. Thank you.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "116981634606371056216", "name": "Jason Grider (Gen Turgidson)", "time": 1513886461042, "rating": 5.0, "text": "I've been going to MBDTS for over 4 years now and have always had excellent service from the office staff and therapist. I've had three different therapist over my time there and all of them have helped me with my personal issues. The office staff has been spectacular from both the scheduling of appointments and with any billing/insurance questions I've had. Never had an issue that was not handled professionally and with care and respect. Great people!", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "109849229897749942019", "name": "Jamie Hall", "time": 1525703478872, "rating": 5.0, "text": "We have been going here for over 3 years. The care that my family and I have received has been outstanding. They really take the time to get to know you in a very unjudgemental way and are not quick to fix something with a prescription. If a prescription is needed they will take that route but it's not the first method they jump too. I trust them with everything I have.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "103825872175411957604", "name": "Sarah Capps", "time": 1571239451153, "rating": 5.0, "text": "We love Dr. Swartz right on on everything", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "113990311575510216156", "name": "S S", "time": 1495505470947, "rating": 5.0, "text": "I see Isabella. I really like her and have found her to be very helpful. She cares about me more than just as another patient.\nThere is a new lady in the office and she is very kind.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "116276336911371164111", "name": "Torey Lavish", "time": 1512426950673, "rating": 1.0, "text": "Worst professionalism I’ve ever dealt with as far as their front desk and receptionist go. Definitely not who you want to trust with your issues and problems. THEY DONT CARE!\n\nBack story: First appointment, my fiances mother wanted to make sure I gave them the right insurance cards in order because she said they got misfiled in incorrect order last time and it took them over a year to fix so I told that to the receptionist when I got there and she snarkly responded \"I doubt that\". To which I responded... \"No it wasn't a question \"if\" ...it did..\". Then I was filling out the paperwork for my fiancé and she said that he needed to fill it out hisself . With his condition he can't do that so I told her that was the whole reason we were there in the first place, and that he couldn't. She was super rude and snarky and judgemental the whole time. So we had to leave to find him an appropriate writing utensil he would use and he finally signed the papers. Fast forward to this time:\nHe has a 2:00 appointment, we arrive at 1:40... we sit all the way til 2:30 thinking Dr. Schwartz was just running behind. Then he comes out at 2:30 and calls a different patient back... so I ask Dr. Schwartz when my fiancé's appointment time is to which he says he doesn't know, so I go to the desk and ask and she tells me it was at two... but that he was running behind.. but she neglected to mention any of this for the fifty minutes we waited. So then my fiancé asked how much longer it will be for him then, and she said thirty minutes.. so we decided to leave and go get coffee.. We come back in only twenty minutes and see the previous client leaving when we walk in. She came out the door and said \" Dr. Schwartz came out after he finished with his client and you weren't here and I was \"unsure\" if you were coming back so I went ahead and gave him his next patient. To which I responded... No you told us it was thirty minutes til he would be seen.. so we left and came back in twenty. She just kept blaming it all on Dr. Schwartz when all of it was literally her lack of professionalism that caused this whole scene. She never told us he was running late, nor apologized. She never told Dr. Schwartz what she told us about him being able to see him in another thirty minutes... like I have never in my life witnessed such carelessness and unprofessional from a \"professional\" practice. So Dr. Schwartz didn't even end up seeing my fiancé even though we waited approximately an hour and a half. And he missed work to not even get his appointment due to the vendetta this receptionist had against him. Take your time and money elsewhere!\n* She is the receptionist with box colored black hair btw. Don't even know her name.", "pics": null, "resp": null, "gmap_id": "0x886268c45f34bca3:0x7cd870430f227283"}
{"user_id": "106872580423181225048", "name": "B K", "time": 1592345472119, "rating": 5.0, "text": "I love everything! The counselors are wonderful, front desk and everyone in between are incredibly kind and you can tell they really care. I feel very comfortable and actually look forward to my visits here.", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "117831178413984456527", "name": "Tommy Reynolds", "time": 1579723248399, "rating": 4.0, "text": "The counselors provide a caring, supportive atmosphere where folk can be safe, and heard.  Healing can take place here.\n\nThe office is on the second floor.  Not sure if there is an elevator there.  Call ahead and they can accommodate with one first-floor room.", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "103538778209738568808", "name": "Timothy Townsend", "time": 1561057813916, "rating": 3.0, "text": "Would be a five star review, but you have to climb a mountain to get into the office.", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "109265034924829905732", "name": "Tom S", "time": 1469449425486, "rating": 5.0, "text": "They genuinely care. You're not just a paycheck", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "103485890352765913654", "name": "Preston Holloway", "time": 1576274856235, "rating": 5.0, "text": "Wonderful adult training here. The kids play parents learn!!", "pics": null, "resp": null, "gmap_id": "0x888918ecac8c83b3:0xb645bcd1df415c70"}
{"user_id": "114481337311416101693", "name": "phil plant", "time": 1612484400929, "rating": 5.0, "text": "As a family therapist in private practice, I have had the privilege of working with Elk River Treatment Center and their staff for the past nine (9) years. In fact, my most recent client to grafuate Elk River, is the 38th adolescent I have had graduate Elk River's program. Overall, every family has been grateful for the positive experience they have had working with Elk River.\nThe 16 year-old girl I had graduate two (2) months ago has transitioned home smoothly, and has shown incredible changes in attitude and behavior. I just finished a session with the family,  and as they were leaving my office, the Dad said, \"Thank you for helping our daughter return to the person she was meant to be.\" This is the outcome that I have come to expect from Elk River, easily one of the top five (5) adolescent programs in the country⭐⭐⭐⭐⭐", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8lEMyR09z6CW-yHrJDlFZkHum-yfNHvD-ue2-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPxJtdAnSja7v18WFTS7Fvkp1LWVbsRIlm-ISuN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYDmwgDKZQBMGEZgpOxADyAuHCfKTKJnE_MXXe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPH8_6M2N5bXSVBe9DjcRTFIrOCJWNpNMsA6L40=w150-h150-k-no-p"]}], "resp": {"time": 1612980244581, "text": "It says a lot about a mental health professional when parents continue to seek their guidance - even after their teen discharges from a residential program. Like you, we caution parents about the zig and the zag of progress. And because you do such a good job preparing them, they don't fall apart when their child hits a bump in the road. There are few therapists who dedicate more time and energy to their clients and it shows in the relationships that you have built over the years. We are grateful that you've put your trust in Elk River and strive to never let you down."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "104862408064426445384", "name": "Kerry Holder Joffrion", "time": 1613755103036, "rating": 5.0, "text": "My professional experience of Elk River Treatment was premised on training staff on the use of the labyrinth for contemplation and healing. My name is Rev Kerry Holder Joffrion and I am an educator.  I find the staff;  including field staff and clinical counselors to be thoughtful, intentional, creative and practical in their efforts to empower teens and young adults in recovery and restoration.  Program clients are engaged and helpful in their group work and said that walking the path gave them meaning.\n\nThank you for this important work you do with dedication and hope for their futures.  Elk River Treatment Program changes lives.", "pics": null, "resp": {"time": 1614097254681, "text": "Thank you Rev. Kerry Holder. The labyrinth training that you provided to our staff and clients was useful in every aspect of residential treatment. Sharing your invaluable knowledge is something that our clients, group leaders and seasoned clinicians will carry with them the rest of their lives."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "107124304383228854534", "name": "Peter Joffrion", "time": 1613755177728, "rating": 5.0, "text": "As builder of the labyrinth at the Elk River Treatment Program facility, I was impressed with both the cooperation and professionalism of the staff with whom I interacted, and the attitude and cooperation of the program participants (teens) who assisted me with spreading the gravel base and locating field stones for the labyrinth circuits.  This is an 11 circuit, Chartre labyrinth, approximately 60 feet in diameter.   In terms of the volume and weight of materials, it was a gargantuan effort, made much easier because of the genuine care and willingness of the teens who were asked to help me.   I did not expect this, and it's a testament to the quality of the professionals who work with these youth every day.   Not one of the youth who helped with the build approached it as a burden, or with dread.   There was an authentic and eager commitment to \"service\", which speaks volumes about how they respond to the profound work of the counselors, teachers, administrators, and field staff at Elk River.", "pics": null, "resp": {"time": 1614272396762, "text": "Thank you, Peter, for your kind and thoughtful words. It means so much to our staff that you recognize the work being done at Elk River. We weren’t surprised that our clients responded so well to your instruction while building the Labyrinth. Thank you for delivering a tangible therapeutic tool that they could take pride in building. It has become a critical component of treatment for our clients – especially those with early childhood trauma. They’ll never forget the experience that you gave them."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "118302270481405817451", "name": "Wilson Adams", "time": 1613600839206, "rating": 5.0, "text": "We used Elk River Treatment Program (2017, 2019) for two of our adopted children who suffered severe trauma and attachment issues. We experienced success both in their helping the children confront their past along with tools to successfully guide their future. Additionally, we received parent training to help us learn better skill-sets once they returned. We were very pleased with the program. Highly recommended.", "pics": null, "resp": {"time": 1615413328914, "text": "Thank you, Wilson, for your kind words. We are honored that you placed your trust in Elk River Treatment Program and followed the advice of our experienced treatment team. There is no doubt that children with parents who are engaged in the treatment process like you and Julie enjoy the long-term success that all children should have. Hearing about your family’s outcome is what motivates us to keep doing what we do. Please tell the boys that we say hello and would love to hear from them."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "110051641385945758646", "name": "Tevvy McDole", "time": 1611858235900, "rating": 5.0, "text": "Almost 14 years ago I was a resident at Elk River. I can truly say, it saved my life, taught me so many life skills and helped mend a very broken family. I have read the reviews that some have left bashing this program. I am honestly in shock that some people would make up so many lies. Not only was I a resident there, I worked there several years ago after I received my college degree. Take it from me, someone who has seen both sides of this program, it WORKS. And the staff truly and genuinely care. That is really rare and hard to find these days. I’ve seen staff put in so much work and so many hours just for the benefit of the children. Elk river is not a luxury resort. But let’s be honest, troubled teenagers and children don’t need a luxury resort. They need a place that will teach them structure, discipline, accountability, hard work, and then and only then will they see the positive and rewarding outcome. If you want a place to teach them these things and want them to get better and act responsibly, this is the place. If you want your child to be pampered and go off learn nothing and get nothing out of it, keep them at home with you or send them somewhere else. I’ve read some reviews that say that their child was starved, I just had to laugh. That is bogus. I gained 30 pounds when I was there because of how much I ate. And I NEEDED to gain that weight. If some people need to lose weight, then the program and staff will cater to that as well. Each resident there has their own treatment plan, a lot of thought and time goes into developing and determining the best plan for each child. I can say this and know that it’s true because once again, I was a resident there and later on an employee. The best part about the treatment plan is that the parents are extremely involved. Parents don’t get to call ALL the shots, because obviously that doesn’t work. But they do have their own input for their child. I can’t say enough wonderful things about this place. I am writing this because I know how much it helped me. I have nothing to gain from writing this, I no longer work there. I just felt the need to share after reading some of these reviews that are just completely untrue and made up. As a parent myself, if my child was expressing negative behavior and needed a place to go for help, there is no doubt that I would 100% send him to Elk River. It is 2021, kids are smart. Kids are manipulative and unfortunately sometimes lie to their parents so that they can come home from treatment. And after reading some of these reviews, there is no doubt in my mind that this has taken place with some of the parents and children who have chosen to bash this place online. It’s bogus. Elk River staff, I love you guys and appreciate all of your hard work! I love the program and most importantly I believe in the program with everything in me. I will be forever grateful for this place. If I hadn’t gone and gotten help, I wouldn’t be the successful and happy adult that I am today. So, thank you. Thank you so much!", "pics": null, "resp": {"time": 1612458987628, "text": "Thank you Tevvy. What a wonderful testimony and one that is encouraging for our program staff who have dedicated their careers to adolescent care. You should consider being a Parent Coach because you don't pull any punches. We are so proud of your hard work and look forward to a visit soon."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "100509211592528601246", "name": "Eden Harrison", "time": 1613273376273, "rating": 1.0, "text": "It’s strange that you have no record of me. I was number 1007. Maybe you should check again. I have a whole paragraph I angrily typed out that I’ve saved in my notes that I meant to leave with this review. I held back because i figured a 1 star was enough,but now I’m wishing I’d posted the whole thing. I went here in 2016 and it was hell. Treated like a prisoner. Went for depression. Left with ptsd. I don’t have this place confused. You’ve replied to other people I was literally there with.", "pics": null, "resp": {"time": 1613272092994, "text": "Eden: We value your privacy. Please contact our Director of Outreach: outreach@pinnacleprograms.com - so that we can discuss this. If you were a resident at Elk River and have something to share with us, we certainly want to hear from you. We value opinions from actual residents, but there are many \"reviews\" on here that are not from people who attended the program."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "103033633810420328299", "name": "Ashley Turner", "time": 1612016519641, "rating": 1.0, "text": "As an LPC in the state of Alabama, I’m extremely concerned that you all are in violation of HIPAA in responding to these reviews with personal information about the reviewers stay based on your records.  I was looking into this program for a client, but again, this is a huge concern that you all would be willing to violate law in order to defend your program.", "pics": null, "resp": {"time": 1612458571789, "text": "Thank you Ashley for bringing this to our attention."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "115619231176157863912", "name": "Beason Fordham", "time": 1612387865459, "rating": 5.0, "text": "I have been working closely with Pinnacle for many years and would recomend them without reservation.", "pics": null, "resp": {"time": 1612458511838, "text": "Thank you Beason. Your expertise in IT has kept us running smoothly for many years. We appreciate you."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "108265900107893500128", "name": "Erica Huskin", "time": 1608159690117, "rating": 1.0, "text": "I wish I had not sent my child here. They suffer on a daily basis from nightmares and PTSD symptoms - therapy is helping, but I am afraid this will be a lifelong endeavor.", "pics": null, "resp": null, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "115996755286450122234", "name": "Miranda Mason", "time": 1603145582413, "rating": 1.0, "text": "10 years later and I still talk to my therapist about the trauma I experienced here. This place will not help your children in any way.", "pics": null, "resp": {"time": 1610479695586, "text": "It saddens us to read how you feel about your experience. Although the program and staff have changed since 2012, our goal remains the same: to provide an environment of respect, acceptance, skill development and challenge to our clients in order to foster personal development and emotional growth. We take every comment very seriously – regardless of the time between discharge and today. Not everyone continues on the path that they carefully planned upon leaving Elk River, but most do succeed. Please continue your therapeutic journey and never give up on yourself."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "101365810704269490626", "name": "Anonymous anonymous", "time": 1587605391246, "rating": 1.0, "text": "There is a reason the bad reviews of this facility have more likes than the positive reviews. This program did nothing for my mental health or drug addiction problems. There was little to no actual therapy other than occasional group sessions, and residents rarely received one on one therapy with counselors. However, that is not the reason for my low rating. While nothing about my time there was tolerable or helpful, my major problem with this facility is the way residents were treated there. We were not allowed to speak to anyone, including the staff, without nonverbally asking for permission, and if we were given permission, it had to be \"treatment related\". We were not allowed to converse with other residents or get to know them personally. While I was there, mushrooms and mold grew in the showers. The \"domes\" we slept in had several holes and were placed on top of a rotting wooden platform that I watched an employee fall through, and we slept there even when there was dangerous weather. At one point, the water we drank and bathed with was brown. Even though we spent most of our time inside, we were only given sunscreen two times that I can recall, regardless of the fact that it was the middle of summer.  If the staff decided the rules were not being sufficiently followed, there was use of solitary confinement (which they called separation). The only form of communication we had with the outside world was through letters to our parents, but they were censored, and they frequently refused to send letters they didn't agree with. My last complaint is that I personally watched employees cause intentional physical harm to patients, and even heard them brag about it. The people in charge of the facility knew about these incidents and did absolutely nothing to stop them from happening again. I could go into much more detail, but this experience is one I would prefer to just not think about. I genuinely believe this facility has caused me trauma and I often find myself wondering if what I experienced there is legal. As someone who has completed and graduated from program, I can confidently say that this place is not suitable in any way for teens who are looking to be helped.", "pics": null, "resp": {"time": 1605740745824, "text": "Unfortunately, unknown people who have never engaged in our services leave 1 star ratings. This is a calculated, malicious attempt to draw people away from the behavioral and/or mental health services that they seek. Any anonymous rating or review for any business should be completely disregarded."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "108832237885298496746", "name": "Brock Holcombe", "time": 1607629810392, "rating": 1.0, "text": "Why do the vast majority of adolescents who get sent to this place end up having terrible long term outcomes after “graduating?”", "pics": null, "resp": {"time": 1607979306132, "text": "We are confused about this statement since we have a long list of success stories from our clients who left the program several years ago. Granted, not everyone is successful ... yet. But we are not willing to give up on anyone. If you'd like to talk to one of our counselors, please call us at 866-906-8336."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "110200398566669480422", "name": "Conor Mcnamara", "time": 1582212312792, "rating": 1.0, "text": "Learned nothing... The place made me feel like I was in prison. Did group therapy maybe twice a week and 1on1 therapy once my whole stay. I do not recommend this place whatsoever. Still to this day I am traumatized from staying there.", "pics": null, "resp": {"time": 1607370736417, "text": "We are disheartened to read that you think you learned nothing about your time at Elk River. To protect the privacy of our clients, we cannot comment directly about a specific treatment plan and since all treatment plans are individualized to meet the goals of each client, we must generalize our response. Our 120 acre campus has no gates or fencing, we do not use handcuffs or any such restraints, and parents are welcomed to visit and participate in weekly parent workshops, so we are confused about your feelings of being in prison. Our staff are trained to supervise the clients in our care around-the-clock (even while clients are sleeping) so such close monitoring might be uncomfortable for some individuals. But the safety of our clients is our number one priority.\n\nIt is puzzling to us that the feedback included after discharge rated our program \"good\" or \"great\" in 25 of 28 areas of the survey and about 90% of clients state that they would recommend the program to someone else. It is apparent that something changed post-discharge. We hope that you are getting any help that you need to become the self-directed, educated, contributing member of society that you are meant to be. That is our wish for all our clients."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "103275841559744278134", "name": "Lori Williams", "time": 1551810833219, "rating": 5.0, "text": "Elk River isn't an easy place. It's hard work. It's challenging. It equips youth for real life. It's also a place where youth receive the tools that they need to overcome tremendous obstacles in their lives. I have been working as a part of the clinical staff for a little over two years.  I can say with certainty that the team here genuinely care and work diligently to provide the best treatment possible.  I eat the same meals the youth do.  The food is high quality, healthy and delicious.", "pics": null, "resp": {"time": 1610996744669, "text": "Thank you Lori for the kind words. Elk River does not run the same without you!"}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "106345375258012064142", "name": "Serena Crowder", "time": 1551808890477, "rating": 5.0, "text": "What a better place to take a break from the day to day stress of the world and focus on yourself , to equip you with the tools needed to prosper! A team that is dedicated to these young ones , and takes pride in them when they progress even with little steps toward graduating the program. While treatment is hard for anyone , especially our young ones the benefits both themselves and their family and friends share are everlasting . So keep up the good work and thanks for all you do for our young ones", "pics": null, "resp": {"time": 1610996835875, "text": "Thank you Serena. It is our hope that families recognize how hard you work for them in the background. There could be no better advocate for them than you."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "117329913383332977222", "name": "asher levine", "time": 1551907413293, "rating": 5.0, "text": "I have referred adolescents to this program since 2006.  Being an interventionist that works with young adults, I take it very seriously when I have to help a family make a decision to admit their child to a therapeutic program.  Elk River offers a therapeutic setting and the support for the clients to be in a safe supportive place learning the skills to be invested in their own wellbeing.  Terrific communication with families too.", "pics": null, "resp": {"time": 1610996671793, "text": "Thank you Asher for your dedication to the wellbeing of young people. We always enjoy seeing and hearing from you. We hope that you'll stop by the campus or home office soon to update us on your never-ending adventures."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "114528309347615806450", "name": "Selina Mason", "time": 1551805459188, "rating": 5.0, "text": "I have never met a more dedicated group of professionals than the ones that work at Elk River Treatment Program. Every day these people invest their time and energy in helping young people with behaviors that are challenging to say the least. Making a positive difference in someone's life is their mission. I am so thankful to know these wonderful, kindhearted people.", "pics": null, "resp": {"time": 1607368506685, "text": "Thank you Selina. It is dedicated parents like yourself that help make this program successful. Always remember, \"it works if you work it.\""}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "102029419643378884265", "name": "Laurel Nersesian", "time": 1533159670253, "rating": 1.0, "text": "I have posted a review before, but I’m going to again because i am so glad people are finally giving this place honest reviews. I will keep posting until they close down if it saves another child. Like someone else said, I am also not a bitter teenager. I had to go through my therapies and treatments to even get over what happened to us at Elk River. I am so much better now, and it was no thanks to them. Do not give them your money!!! “Therapy” was a joke!!! It’s a miracle that some kids come out better, but it has nothing to do with the program. I went there when I was 16, and at 21 I still have nightmares about the torture!!", "pics": null, "resp": {"time": 1605741668218, "text": "It is our policy to protect the privacy of our clients and not discuss therapeutic treatment in a public forum. All feedback is important to us and we take it seriously. It is frustrating to watch any client make great therapeutic progress and leave the program with high hopes and plans for success - then leave such negative comments years later in a public arena. Sometimes we hear from former clients or their parents when they lapse into old behaviors. We ask, \"Did you follow the discharge plan developed by the treatment team to help you continue the success you earned while in the program? Are you continuing therapy? Are you journaling?\" These are the minimum standards that must be met to achieve long-term recovery. It's difficult to stay on course 100% of the time. Many struggle, but many more succeed. We hope that you find the help that you need and wish you only the best."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "110626192949445043685", "name": "Tony Mason", "time": 1613268377297, "rating": 5.0, "text": "These one star reviews are obviously fake reviews. It's sad that anyone can create a gmail address and slander good people who are doing great work. This is a program that helps teenagers and broken families heal when behavior issues or drugs take control. I would recommend it to anyone who fears they have lost their son or daughter. Seek help from people like this before it's too late. Too many young people are dying from overdose and suicide. If you think something is wrong with your teen, it's probably true. This program will show you how to save them. My family is grateful every day for the people at Elk River.", "pics": null, "resp": {"time": 1607368426848, "text": "Thank YOU Tony for the kind words. The clinical team and support staff at Elk River are grateful for parents like you."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "113049490534541292793", "name": "Cameron Malek", "time": 1553962786923, "rating": 4.0, "text": "I believe that the majority of the staff here genuinely care about the livelihoods of the teenagers that are at the program. (Mr Jaynes, Mr Stierwalt, and Ms Newman, thank you) At times it could have been monotonous, but really what do you expect? We weren’t sent there to have fun out in the sun LOL.\n(I attended in 2011)\n\nIn my opinion, the teens sent there have to be mature enough to open themselves up and actually work on themselves. They do monitor almost everything you do whether it’s speaking to another teen or journaling. They monitor the journals so you don’t plan on killing your self or harming others. They’d never just go “hey man I read your journal you better not really think so and so is hot because we don’t allow opposite gender touching” lmao.  And if we were allowed to talk to each other without it being monitored, it most likely would have been ‘war stories’ and the things said in the stories are probably why the teens got sent there, so why would they want us to talk about it? They wouldn’t. It’s as simple as that.\n\nI do truly believe that Elk River helped me work on myself and grow up mentally. I came out of the program with a new respect and look on life. BUT, I also think some of the kids that are brought into ER, need more professional help than could be given here at this facility.\n\nI gave this review 4 stars simply because the pictures are kind of a hoax. I never saw bicycles and the pool was green. They did give us free time outside to play some games, but if kickball got too intense it got shut down lol. The only teens allowed by the horse(I only ever saw 1) were the mid term teens who were there for like 6 months at a time. They had more privileges. Most of the cool stuff to do was mid term only like the rock wall, shooting basketball, etc. I believe my parents were told I would get to experience these things, and when they picked me up and learned that I didn’t they were a little confused haha.\n\nA for real review from a past bitter teen.", "pics": null, "resp": {"time": 1607379170903, "text": "4-2-19 - Thank you Cameron for your \"real review from a past bitter teen.\" That is our favorite sentence in your review. That you put the bitter teen where it needs to be: in the past. As for the pictures on the website, we attempt to project a positive, realistic example of our facilities without compromising our client's privacy. This can be difficult at times. Due to privacy issues, we do not post photos of the smiling faces we enjoy seeing when clients earn their new phases in the program. Because nothing is \"given\" at Elk River. Everything is earned. We cannot publish photos of the proud faces of family members at their loved-one's graduation. Instead, we hold those memories close to our hearts and revisit them to remind ourselves why we come to work every day and night. Again, thank you for the kind comments."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "106164878936770136239", "name": "Aloofcat22", "time": 1513559291271, "rating": 1.0, "text": "This place was truly traumatizing. I was ripped out of my bed & essentially kidnapped - then 'transported' to Elk River. I still have nightmares & mental trauma from the mental abuse involved with this place. They attempt to brainwash your children & look for reasons to keep your child in the facility for an extended period in an attempt to extort as much as possible. Elk River not only traumatized me, but many of the people I was with during my stay. If your child needs help, for the love of God do not take them here. The so called 'treatment' is assimilating your child to militaristic ideologies & a complete destruction of their unique personalities. It was ran as if it were a boot camp, & you hardly ever spoke with a therapist. If you spoke out of line, or you weren't 110% angellic you'd be threatened with an extended stay. IF YOU SEND YOUR CHILD HERE, BEWARE OF THE REPERCUSSIONS THAT WILL FOLLOW.", "pics": null, "resp": {"time": 1607372805702, "text": "It is not our policy to respond to an anonymous \"review.\" If you indeed were a client at Elk River Treatment Program, then you know the importance of accountability, integrity and responsibility. If you were literally kidnapped and experienced other trauma in your life, we sincerely hope that you get the services that you need to heal."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "105091843804761420424", "name": "brian gamble", "time": 1506697052887, "rating": 4.0, "text": "it was amazing and the best time of my life. And to be honest i wish i could just go back for another 7 month, cause i cry almost every day cause i want to go back", "pics": null, "resp": {"time": 1607380297931, "text": "Original response posted 2019: It IS amazing when our clients take the time to examine faulty thinking and replace it with new problem-solving skills. We love to hear from alumni and welcome a scheduled visit."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "114142812895508940837", "name": "maculey brash", "time": 1513456856941, "rating": 1.0, "text": "I went to \"the place\" it was hella retarded all you did was work and get told not to talk. Foods not bad not enough though. Punishments are pretty retarded and the therapists are very manipulative so you stay longer so they get more $  don't send your kid there. Don't send your kid anywhere I've been to 3 rehabs each one making me more mad at my parents it's not worth it.", "pics": null, "resp": {"time": 1607379941221, "text": "It is disappointing that Google allows such offensive language to be published. We hope that your vocabulary has matured along with your age since your review was written in 2017. You mention that the three other \"rehabs\" had only made you more mad at your parents. It is our sincere hope that you have found and accepted help and have become a happy, contributing member of society. Best of luck to you."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "105013287993088836945", "name": "yaron cohen", "time": 1511020761725, "rating": 5.0, "text": "My child spent over a year in this most phenomenal program. It completely changed his life. He was a mess when he joined. We made sure that us as parents, worked closely with the camp on changing the way we were operating as a family, as we needed to be an integrated part of the program in order to make it a success.\nWe were extremely fortunate, as the staff at ELK River is so experienced, professional and most responsible and companionate. The program must be tough in order to succeed. It was frightening to us as parents, but we decided to trust the camp explicitLy and it worked. Our child ended up in a top university with a scholarship, happy and secure. His amazing turnaround  would had never come about without the fortunate choice of choosing ELK River.\nWe owe our lives to them. We only hope that other families with similar situations will be lucky enough to end up there. Recalling the many touching moments at the camp, remembering the many kids who were in terrible distress and the way the camp is working with them brings tears to my eyes each and every time (now two years ago).\n\nThank you, ELKRiver.", "pics": null, "resp": {"time": 1607368135043, "text": "Greetings from Elk River and team! Google made changes to our brand account so unfortunately we lost the replies to our reviews so I am responding again. THANK YOU for the kind words and encouragement for our staff. Children succeed long after leaving Elk River when their parents are engaged, open-minding and committed to changes that help their children thrive. We wish you and your beautiful family the best always and look forward to further updates."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "104955320270343561516", "name": "Oscar Lee", "time": 1442589843247, "rating": 5.0, "text": "A safe residential setting for troubled teens to work on themselves without everyday distractions. Individual, group and family therapy facilitated by experienced staff and clinicians. I certainly would recommend it to a family with a teen that is struggling emotionally or with substance abuse.", "pics": null, "resp": {"time": 1611011151294, "text": "Thank you Oscar. Your kind words are appreciated."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "115754725183524146029", "name": "Rae Huskin", "time": 1540481668193, "rating": 1.0, "text": "part 1: please, for the love of god and all else, never send your child here. i’m going to be an adult in the next 2 months. i am not some bitter teenager, like others have stated. i stayed here for 7 months and left 7 months ago. it’s an awful place.\n\nmost of the staff you see on the website aren’t there anymore!! joseph clary, jesse wilcox, and amanda robinson left. they were probably the two best staff there, and they’re gone now! a lot of the people you see on the website weren’t there when i was at the facility. they were there years ago, and are long since gone.\n\nwhen you arrive, they give you three sets of clothes; 1 sweatshirt, 3 t-shirts, 3 pairs of jeans, 3 pairs of underwear, 3 pairs of socks ALL FROM WALMART. if you were here for the colder months, we got coats with zippers and velcro but nearly every coat there was broken. the zippers broke off and the velco strips were falling off. we were so close to hunting grounds, so we had to wear bright orange baseball caps. also, our shirts were also very bright colors (yellow, green, pink, orange) so we wouldn’t be shot. we also got very cheap hiking boots to wear. the cook was also our tailor. they didn’t give them much money to fix our clothes, so we had to keep our broken coats throughout the course of winter. they didn’t zip or close, and when it’s below 30 degrees outside, it’s awful.\n\nthere are 3  precautions/consequences at elk river. there is separation, self-harm, and run risk. each has three levels. if you get put on separation I, you can’t talk to anyone. you can’t speak to your group, or your staff. you had to eat alone, and spend everyday 10 feet from your group.\nif put on separation II, you had to spend ALL DAY outside. you basically couldn’t see any of your group members. separation level III, which i believe the police got involved because it was considered ‘corporal punishment’: you had to spend the whole day on an elevated wooden platform. you had to washboard your clothes, wear size 15 rubber boots, cook your own food, and shower behind a tarp with freezing cold water. i don’t believe they are allowed to do this anymore, but i can think of many ways this place would find ways around. for self harm I, you have to be watched in the bathroom and while you shower. this precaution level goes for all levels of self harm. for self harm II, you have to follow self harm II but also be at an arms distance of staff, and wear size 15 rubber boots. for self harm III, you have to follow self harm I and II, and carry a 12 inch piece of thin yellow tape around, and a staff member has to hold the other end. you’re basically on a leash. if you drop the tape, they put you into an automatic containment (which means a staff member has to get you down on the ground from any position and restrain your arms and legs, often by laying on the person). for run risk I (which is an actual precaution because you can literally run off the property because they have no fences or security— you’re out in the woods), you have to wear size 15 rubber boots and usually an ankle monitor. for run risk II, you have to eat alone and be an arms distance from staff, and follow previous levels for run risk. for run risk III, you have to follow all previous run risk rules, but also carry that piece of yellow tape around like a leash. if you drop it, it’s an automatic containment.", "pics": null, "resp": {"time": 1605741592447, "text": "Edited 2-10-21  This is a surprising review. Due to our respect for your privacy, we will not discuss a client’s mental health in a public arena. However, our Clinical Director invites you to call at 866-906-8336 for an opportunity to discuss your concerns. We are always surprised when a negative review appears from a client who worked hard to graduate the program, seemed to be doing very well, and even submits a satisfaction survey at discharge ranking the services at Elk River Treatment Program as good or great in every category. We have examples from clients who state that they would recommend the program and claim “this program saved my life,” then years later appear extremely disgruntled in a public forum.\n\nDuring the course of our program, we often discuss the importance of accountability, integrity, and responsibility. In keeping with the philosophy that we teach and role model, we want to clarify some of your comments. Regarding the website: we work diligently to keep our website up-to-date but sometimes things get overlooked. Upon review of your comments, we checked and the website is current. We agree that we have excellent staff - some have moved on to advance their careers elsewhere and others have continued the mission of Elk River Treatment Program to provide for our clients an environment of respect, acceptance, skill development, and challenge.\n\nAs for clothing, we can only assume you are ridiculing clothing items purchased at Walmart. We disagree with your opinion. We do not issue an abundance of clothing and gear. Clients are responsible for caring for their clothing including the laundry of it. This can present a challenge for someone who hasn’t had those responsibilities in the past. The sleeping gear is certified to accommodate weather below 30 degrees although it rarely gets that cold in Alabama. We have an inclement weather shelter that is provided should the temperature drop too low, get too high or if storms are predicted.\n\nAs many clients attend treatment due to unsafe behaviors that place them or someone else in harm’s way, we are very serious about safety, which includes monitoring supervision. We also want structured communication to take place where a positive peer culture model can be implemented that teaches active listening and conflict resolution in a safe space. This accountability for yourself and holding others accountable in the positive peer culture is one of the most challenging skills that residents learn. If a resident is issued “rain boots,” it means that they were at risk for running away, and as a safety precaution the boots help deter someone from running, as it is more difficult to run in rain boots as compared to hiking boots. Similarly, if a resident is at risk for running away or harming themselves, they do have to stand next to staff within arm’s length. We hope that you will consider contacting us to discuss your grievances. We take all reviews seriously."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "111993540419210306868", "name": "Troy “Nielmorek” Voglewede", "time": 1477428496915, "rating": 1.0, "text": "I cannot rate this low enough. Do not send your child here. They will be abused. All of the photos provided are false or fake. I have been out of Elk River for nearly 4 years now and still have mental trauma and disorders that i got from my \"treatment\" there. This place needs to be investigated for sure and worse is that from what I understand it used to be worse before I got there.", "pics": null, "resp": {"time": 1607381239542, "text": "Our residential program is licensed by the State of Alabama and the Department of Youth Services conducts four on-site visits per year. Two of the four inspections are unannounced. Our scores have been exemplary since we opened in 2006. Our program is also accredited by the nation's top healthcare accrediting agency. Because of privacy issues, we cannot publish photos of our actual clients or their parents which limits what we can use on the website. However, when a parent is considering our program for their child, we gladly share a photo presentation of the program and our facilities. We have nothing to hide and much to be proud of: literally thousands of young people leading happy, successful lives because of the treatment they embraced at Elk River. We hope that you have found the help that you deserve and are now living a self-directed adult life. We wish you the best."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "109024170243630820029", "name": "Stephen Shaw", "time": 1443632245163, "rating": 5.0, "text": "I haven't had a child in the Elk River Treatment Program, but I can tell you from working with the owner and staff that they are very professional, exceedingly committed, and their heart is truly in the right place. Many of the people who work at Elk River have had direct experience with troubled teens struggling with drug addiction and/or behavioral problems, so they know intimately the challenges that parents are facing and are standing right there by their side.", "pics": null, "resp": {"time": 1611011116395, "text": "Thank you Stephen for the kind words. We work hard to provide an environment of respect for our clients and their families. This program has helped thousands of teens and their families since opening in 2006 and we hope to reach thousands more in the future."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "115970010497884984686", "name": "The Balanced Life, LLC", "time": 1447096271579, "rating": 5.0, "text": "This is a wonderful resource for teens that are struggling with behavioral and/or substance abuse problems and their families. They do a great job helping kids learn better ways to cope so they can live healthy, productive lives. Family members are also involved so that the entire family system makes the necessary changes to support the teen in their forward progress. Over the past 8 years of my practice I've seen many of my clients go through this program and become successful college students and adults.\n\nJessica D. Cleveland, M.S., LPC, NCC\nIndependent Contractor- The Balanced Life LLC\n9238 Madison Blvd.  Bldg. 1 Suite 800\nMadison, AL 35756", "pics": null, "resp": {"time": 1607381344423, "text": "Thank you for the kind remarks Jessica. We hope you are doing well in your practice."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "110931263866795803753", "name": "Zane Slocumb", "time": 1441887314342, "rating": 5.0, "text": "Since I had the privilege as serving as Program/Clinical Director at Elk River Treatment Program (ERTP) I am well acquainted with the the quality of the services they provide. ERTP staff are professional, committed, and dedicated to the health and safety of the program residents, as well as the residents' relationships with their family members. I continue to refer adolescents and their families to ERTP with confidence and assurance of restored relationships and positive outcomes.", "pics": null, "resp": null, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "114809470343621007837", "name": "L Kate", "time": 1476503793748, "rating": 1.0, "text": "This is the absolute worst place in the world. There is very little therapy involved, and it is basically child abuse. Two years later and I still have nightmares. Think twice before sending your child here. I got in trouble for passing notes and talking in the tipi, and I was sent to \"level 3\" which consisted of never going inside in the middle of winter, and they put my food in the FRIDGE before they fed it to me (again- it was FREEZING outside). One of my meals was just a hot dog- not even a bun- and some other side dish. I was also made to sleep outside the tipi IN THE RAIN. Prisoners get treated better. I needed mental help, yet we only had one group therapy session a week, and there was barely any time to talk. I'm surprised nobody has sued them yet. This is not helpful. at all. don't send your kid here. I came out more depressed and anxious than I went in, and all my family problems just got worse. I can only hope this review saves one child from having to endure this boot camp disguised as treatment. If my own parents tried to punish me the way these people did, they'd be in jail. it's ridiculous. A lot of people don't believe the kids that come out of there when we say how horrible it is, but I am drug free and happy now- no thanks to them. Also, don't be fooled by the pictures! You only get to use the horse therapy a few times during courseweek (at the very end), and they never once let us rock climb. There wasn't much wholesome activity going on- just a lot of chopping wood so the nightstaff had a nice fire to sit by while we were freezing in the tipi...", "pics": null, "resp": {"time": 1610484409087, "text": "If a negative comment is disclosed about our residential treatment program, our first action is to retrieve the client's file and verify the admission/participation at Elk River Treatment Program. There are other adolescent programs in the state and sometimes Elk River Treatment Program is confused with Elk River, MN. Additionally, there are unscrupulous individuals who profit from writing negative reviews so verifying the legitimacy of a review is important to us. We take all comments very seriously. If you were indeed a client at Elk River Treatment Program, you would have completed a survey after discharge that would give us an opportunity to address any negative experience that you had while placed in the care of Elk River Treatment Program. There are several post-discharge reviews with parents/guardians/probation officers. It is impossible to address the accusations that you made in this review without knowing your identity or when you were a patient in the program. Receiving positive or negative feedback in a timely manner would allow us to investigate and adjust our programming accordingly. We are so happy to read that you are drug free and happy now."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "109253450772842609952", "name": "Adrian Rosales-Balcazar", "time": 1509638655294, "rating": 4.0, "text": "went in at 2016 definately changed me for the better", "pics": null, "resp": {"time": 1607380185184, "text": "Thank you for the kind remarks and the update. Please let us know how you are doing. Call us at 866-906-8336 and send an email to info@elkrivertreatment.com and we will make sure the treatment team sees it."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
{"user_id": "117940767708956204326", "name": "Dawg101447 97", "time": 1504737027541, "rating": 5.0, "text": "Was the best experience of my life!!!!!!!!!!! It changed who i am as an individual!!!! THis place made me a better ME!!!!!!!!!!!", "pics": null, "resp": {"time": 1607380408071, "text": "October 2017 - Thank you for taking the time to share the success of your hard work and personal growth. It is comments like this that keep our staff motivated to provide the top adolescent program in our region."}, "gmap_id": "0x88626caeb6cf22e5:0xb2de456bea1e1b61"}
