{"user_id": "102665710538718196198", "name": "Kaiden Hart", "time": 1605728830284, "rating": 5.0, "text": "this UDDERLY changed my view on life. i cant belive that something like this would exist. how could one place outpizza the hut like this. i am udderly dumbfounded.  THEY EVEN HAVE A GAMER HEADSET ON SALE (sponsored my squarespace)  this is so crazy!!!!!!!!!!!!!!! wow you guys should subscribe to vapor moose on ut4ube. its cool and crayz. anyways, this place is a good place to clip your toenails", "pics": null, "resp": null, "gmap_id": "0x8834c177fd8cfa0f:0x1a53c1416a0c4337"}
{"user_id": "114941162910643026308", "name": "Larkin Jackson", "time": 1428772560289, "rating": 2.0, "text": "Yep. It's just a court house. So I guess it deserves 2 stars, due to the fact that its a government building. That's the highest rating it can have. LOL", "pics": null, "resp": null, "gmap_id": "0x8834c177fd8cfa0f:0x1a53c1416a0c4337"}
{"user_id": "107268557023191751233", "name": "Bob McMillan", "time": 1550353958908, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x8834c177fd8cfa0f:0x1a53c1416a0c4337"}
{"user_id": "117029158364035639967", "name": "Dawn Payne", "time": 1581461016052, "rating": 5.0, "text": "Had to take my son to get his driver's license and everyone was very nice.", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "109779740040655473649", "name": "Amber Rider", "time": 1579663315521, "rating": 1.0, "text": "So they apparently shut their phones off on Wednesdays. So good luck getting information from a courthouse that can't even be bothered to keep their phones working during business hours when they are there. This is the most pathetic thing i've ever seen in my life. They need to get it together. For real. Glad to see our money put to good use. *insert eyeroll here*", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "117818765800383214051", "name": "Alan Atwood", "time": 1581302888610, "rating": 5.0, "text": "Sense of humor in this office made getting new tags almost fun", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "106858600858776821168", "name": "Denise Barlow", "time": 1583048222937, "rating": 5.0, "text": "Had jury duty they need more parking", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "105014900577210405584", "name": "stanley grubbs", "time": 1424709648926, "rating": 4.0, "text": "friendly,fast smiling faces not always able to get on the phone but an overall great place to do your business...........!", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "110855535409886701029", "name": "daryle mcwhorter", "time": 1594422811606, "rating": 5.0, "text": "Always is quick and easy", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "113791128740670293137", "name": "Joseph Watson", "time": 1580051794467, "rating": 5.0, "text": "Nice helpful people.", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "113297318921391580844", "name": "Robert Smith", "time": 1580767117050, "rating": 5.0, "text": "Great and helpful staff", "pics": null, "resp": null, "gmap_id": "0x888b00bdc40a7931:0x56ee8fe55519f7f4"}
{"user_id": "111307809156762543317", "name": "Gabe Muro", "time": 1620250773617, "rating": 1.0, "text": "Terrible experience. They turned our marriage certificate down because it was handwritten and its their \"internal office procedure\". My wife has impeccable handwriting so it was just them being lazy. They couldn't produce any written rule about handwritten forms whatsoever and the young lady was just unconcerned with processing our form. Keep in mind this was at 3:30pm...30 minutes before they close. It says nothing of such on the website. We ended up driving over to the Bessemer Courthouse and had zero issues with the same document. Bessemer was extremely nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "111383705154040128915", "name": "Mary Barnfield", "time": 1617738293820, "rating": 1.0, "text": "I called 5 days straight 4 times a day- pressed option 1 and ABSOLUTELY NO ONE ANSWERED. Can’t possibly be that busy.  Wish I could give zero stars .", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "107820142460087708297", "name": "Kimberley Davidson", "time": 1603725397787, "rating": 5.0, "text": "Reached out to the JeffCo Probate Court regarding a certificate of formation I filed. I wanted to find out when the documents had been sent to the state. The lady that was assisting me, put me on hold, but I had to hang up. To my surprise she called me back and provided the necessary information I'd requested. She was very professional, and thorough and provided the best customer service. So often we are quick to criticize so I wanted to provide a very positive experience. I have to be honest, I was not expecting a call back so kudos to the workers in the probate court. Thank you for providing GREAT customer service!", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "106543307304962298011", "name": "Tasha Thompson", "time": 1614089982169, "rating": 1.0, "text": "Disappointed I have to give them a star..... they never answer the phone. Ever. They don’t respond to emails.  Horrible county courthouse.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "112870177037613964260", "name": "Lara Accountant", "time": 1602915090168, "rating": 1.0, "text": "The rudest staff that you could ever meet  in the world are hired at this court. Unqualified, unprofessional, and untrained employees. It takes more than 4 trips back and forth to fill out a marriage from that takes less than 3 mins have they had a computer station. Staff assume everyone knows everything already and will never tell you everything you need to save you time and efforts. They get paid for no work. Five couples infront if md with same complain, and definitely Form should be edited. rules should be printed out and handed or verbally spoken to every client. This should be a happy place for happy people to obtain official documents. Management should take this department to a whole new upgrade.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "108830068525982106584", "name": "Eddie Thomas", "time": 1618444374682, "rating": 5.0, "text": "It was a great experience,  jury duty...", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "104842384681651801572", "name": "Bradley", "time": 1536931716275, "rating": 1.0, "text": "Avoid window #6! You will recognize her as over-weight, bleached hair, and a very mean looking face. I wish I had wrote her name down. This women needs to lose her job immediately. I was there for a simply name change for my adopted daughter and this women refused to look at and process my paperwork because I used the forms and process from the Bessemer office website. She wouldn't even look at the documents! I did persist and the manager was called in to help and she found all my paperwork to be in order and correct. Thank you Ms Jones! Window #5 was also very nice and helpful and she was a joy to work with. But, #6 tainted what was going to be a memorable and joyful day for my adopted daughter. Finally gaining the last name of her new family. Just to be sure I got the window #6 correct, its the same one in this picture where the man with the blue shirt and ball cap is standing.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "110952135445224642428", "name": "Andy Scott", "time": 1580762269239, "rating": 1.0, "text": "I have a simple question, but cannot get through to speak with anybody. Government at its finest. Overpaid to do nothing.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "111573787153490520611", "name": "penny kitty", "time": 1557356826615, "rating": 5.0, "text": "I have been very pleased every time that I have been to the probate office. I have been several times in several months,  the girls that work there are very nice and helpful!", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "101007289502962227943", "name": "Troy Reynolds", "time": 1522421127405, "rating": 5.0, "text": "The Clerks on the Judicial side of probate court made my name change such an easy process. I was meet with a friendly greeting , all of my questions answered and was in and out fairly quickly. Thank you ,  Alicia, Tiffany and Tam. You ladies were wonderful on a Good Friday.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "110880836040983546481", "name": "Meghan Hall", "time": 1493839376003, "rating": 3.0, "text": "Whenever I call the recording department they are usually prompt at answering the phone, and try to be helpful.  They are not always able to help find some older documents recorded in the county, but I wonder if they just don't have time to search for anything that isn't already on their computer system.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "105295010392689042395", "name": "Alacyia Hall", "time": 1464202843575, "rating": 1.0, "text": "I tried calling the phone number provided on the probate court website. It lists of a handful of recorded options to direct your call. For all other option of other departments it say press '4'. Once you press '4' it tells you to go on the website to see a list of all other departments. WHAT CRAZINESS IS THIS??? I called because I clearly want to talk to someone. Not look at a list of departments with no way to actually talk to a person. That is just the craziest thing ever!!!", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "103851918281669982339", "name": "James W", "time": 1521823281112, "rating": 5.0, "text": "The clerks at the main downtown Birmingham division of the Jefferson County Probate Court have been very helpful to me, with a special shout out to the clerk Tiffany who is of Vietnamese ancestry.  Tam is also super, as is Melody, Judge King's Assistant, and also Betty is very helpful.  James West", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "100971047897703493693", "name": "Darcy Moseley", "time": 1516386370398, "rating": 1.0, "text": "I called to see what it would cost to Probate my mother's Will,  a female voice comes on the recording to press whatever you need. The phone rings forever, never got an answer. Its too cold to be driving from Irondale to downtown to get an answer. I need to know how much it will cost, if they take cash, checks, money orders, debit cards, whatever but none of the Yahoos will answer the phone. They have GREAT GOVERNMENT JOBS BUT WILL NOT DO THEIR JOBS. JESUS CHRIST, JUST ANSWER THE PHONE. IS ANYONE READING OUR COMPLAINTS???? SERIOUSLY!", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "110384869455535645150", "name": "Vickie Harris", "time": 1527268309188, "rating": 5.0, "text": "Tiffany on the judicial side was very helpful. She guided me through on issues that I didn’t understand. She also was friendly and had a smile during the time spent with her.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "117102212337643043689", "name": "Justin Williams", "time": 1568141077014, "rating": 1.0, "text": "What’s the point of having a phone if they never answer it. Pick up the phones or get rid of them.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "112763616165312128728", "name": "Diana Hancock", "time": 1486153057643, "rating": 1.0, "text": "What in the world is going on down there? No one ever answers the phone.. do I really need to drive 45 minutes down there to ask a question? Snail Mail would be faster....", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "118221690606171287348", "name": "Jack Smith", "time": 1501774451814, "rating": 1.0, "text": "This is one of the most poorly managed state service departments I've ever worked with. I joined two of the Jefferson County Probate employees on a call to find a solution.\n\nThey persisted to yell at each other and try to overstep each others answers. I hired an attorney to solve the problem and he eventually got it taken care of.\n\nGood luck if you're pursuing an issue with your personal time.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "113487415960787458698", "name": "erin edwards", "time": 1520608185435, "rating": 1.0, "text": "I called the \"Name Change\" information line to ask about NAME CHANGES because I'm getting married and I need to CHANGE MY NAME, and the lady who answered \"Doesn't know, doesn't know, doesn't know, huffff hufff, doesn't know, huff!\" Very helpful- THANKS!", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "103699989430236235641", "name": "TriumphAthletics", "time": 1540907796258, "rating": 1.0, "text": "Typical government employee.  Unprofessional and provided zero help.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "118107208502684756018", "name": "Patrice Morris", "time": 1529091546160, "rating": 1.0, "text": "I have been calling for the past 2 weeks trying to get to get someone on the phone to get information about a marriage license and everytime I call it's no answer. I finally got someone today and all they could tell me was go to the website and got off the phone in a hurry.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "114785856970549880137", "name": "Cornelius & Talley, PC", "time": 1524156350146, "rating": 5.0, "text": "Tiffany provided great customer service today!", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "104606928563836432474", "name": "Sabirah Rand", "time": 1488824442537, "rating": 1.0, "text": "They won't pick up the phone here.  Then it just hangs up.", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "108053503822779923191", "name": "Morgan M", "time": 1495457782567, "rating": 1.0, "text": "Just awful", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "102421201151642253495", "name": "daniel fuller", "time": 1555550117981, "rating": 5.0, "text": "(Translated by Google) Dezz nuts\n\n(Original)\nDezz nuts", "pics": null, "resp": null, "gmap_id": "0x88891b9a6532d4c1:0x81b6dbf869f1e89b"}
{"user_id": "104708419938380376590", "name": "Marc M.", "time": 1564527542028, "rating": 5.0, "text": "Never forget those that gave everything for the greatest country on this Earth!", "pics": null, "resp": null, "gmap_id": "0x8861eee7195c0fcd:0x9425c7d20a3235db"}
{"user_id": "104302874844090703023", "name": "Nerd Life", "time": 1530850147023, "rating": 1.0, "text": "The lawyer's judges and cops are more corrupt than the people they send to jail", "pics": null, "resp": null, "gmap_id": "0x8861eee7195c0fcd:0x9425c7d20a3235db"}
{"user_id": "116057875347928634377", "name": "Amy Nicole", "time": 1616235549701, "rating": 5.0, "text": "Employees are very nice and the new Covid system they're using is very convenient", "pics": null, "resp": null, "gmap_id": "0x8885c2f97574bd39:0xc0cc5d610f08e376"}
{"user_id": "104219254872985170661", "name": "Smitty Johnson", "time": 1577205850899, "rating": 1.0, "text": "Gotten my tag from several counties before and they always let me choose from the stack of tags they had available. But here they were going to let me do the same until another lady there made up a rule that said I wasn't allowed", "pics": null, "resp": null, "gmap_id": "0x8885c2f97574bd39:0xc0cc5d610f08e376"}
{"user_id": "116101074779866946212", "name": "Audrianna Blanton", "time": 1617627816520, "rating": 1.0, "text": "I’m in the military and been trying to help my brother with getting custody of his child. My brother is a respectable and financially stable man. My brother was trying to get custody of his son 7 years ago and just gotten a phone call back about custody. Now, his son is almost 18! Very unprofessional and unreliable. If you have a problem with this court system, take it federal. Write a letter to Congress about this court system and how things are being handled here. Petition everything. This is where your taxes are going people.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "102620728637331687328", "name": "Yolanda Holmes", "time": 1598970355236, "rating": 1.0, "text": "I have had several cases here over the years and its dad to say that this place is very unprofessional.  I hate I have to even use their system.  Jefferson county needs to come here and evaluate their workers. Some people need to be fired im sorry.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "102876616483896037369", "name": "Kyla Ashford", "time": 1597441035621, "rating": 1.0, "text": "I've been dealing with Family court/ DHR since 2013 until this current day. All the negative reviews you are reading is true.\nDHR will take your kids put you through hell and close the case. DHR owns Family Court.\nSomeone need to investigate.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "114099830216435594545", "name": "m b", "time": 1595433910175, "rating": 5.0, "text": "Jasmine puts the \"service\" in public service! Needed certified documentation from the court and Jasmine's follow up and follow through impressed me.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "107045641517409218081", "name": "Yvonne Farley", "time": 1600192528497, "rating": 1.0, "text": "The worst court system I've ever seen", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "103819514988215657500", "name": "Darniel King", "time": 1559239519379, "rating": 5.0, "text": "These people were great my wife died in my step kids were tookin from me by the relatives at the funeral it hurt me so bad cause my wife in I discussed that she wanted the girls to stay with me if anything happened to her I’ve been in my kids life for 8 years there now 10&11 long story short I file a petition to get my girls back cause I know thay wanted to be with there daddy now there home happy back around there friends in loving being back in there in room God is good I know my wife is resting an Sexy Happy thanks Jefferson county family court", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "107627520643556162197", "name": "Lindi Pearson", "time": 1535943965155, "rating": 1.0, "text": "They took my children away from me and my husband and gave them to grandparents and refuse to give them back. We have had a stable home for many years, are clean of drugs and alcohol, and have tried to fight tooth and nail for them but since the grandparents are millionaires and they wanted them, they have them. It is all about money and not about justice. So sad that love and providing a normal stable home in Vestavia isn't good enough because we can't pay for everything they can. It's not just this place, the whole system is broken.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "111761967237085312230", "name": "X Rae", "time": 1512679847840, "rating": 1.0, "text": "The judge on 10/17/17 was very rude and did not allow me to talk. My daughter and myself were not represented like we should have been by the state. After providing them ALL the information of the absent father it took 1yr and 4 months for me to get a court date and I was then told that my back child support payment would only include 2 months prior to my set court date.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "105016909712874092352", "name": "Marilyn Petty", "time": 1534188369755, "rating": 3.0, "text": "I am trying to find out information where child support was ordered in Family Court by Judge and the last letter I received I was owed $50,000.00.  I would like to know about this dead beat dad.  I want what is owed by him or put Keith Essman in jail.  I know where he is.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "113099827467686740934", "name": "Janice Fassina", "time": 1541621236557, "rating": 2.0, "text": "Son in law took my granddaughter without permission while in no restraint and left my house, called DHR, when they showed up the children were removed from my custody and then for the last six months allowed father to have visitation rights even though he has never paid a dime of support. This has been going on for two years due to his need to keep them in our lives.  It comes down to not the child but the need to try and destroy his wife who has always been there for them.  DHR is for whoever makes the call and not the facts behind what is actually going on.  Poor judicial system.  You r constantly jumping through hoops.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "118164406314148852151", "name": "Kip P", "time": 1562135402565, "rating": 1.0, "text": "Judges don't care about about the kids and are very rude and nasty. The allow deadbeat parents chance after chance. Paperwork is often not put into the system and they give you a very hard time. Judge cousins is the absolute worst", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "106365683196040562740", "name": "Robyn Nichols", "time": 1568642059317, "rating": 1.0, "text": "Christina Smith is rude and refuses to help with a dangerous child still being allowed in school. She would not help or direct me to help and basically just screamed at me. If something happens due to this child it will be on her hands.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "104110950245036699729", "name": "Josh Monteabaro", "time": 1506376049508, "rating": 1.0, "text": "I REQUESTED my payments to be taken out of my checks, yet I'm still falling behind. Just found out I have a warrant (which I will be turning myself in as soon as I get back) because Judge Donaldson denied my motion for continuance due to I have mandatory work out of town. He says he sent notices out in July, I found out about work on Thursday evening and requested a date change on Friday morning. Furthermore I have not received any notices. When asked, the judge and clerks each have separate wrong addresses for me, and I correct them every time. It never gets entered in the system. This court is designed against the defending parent. Even the mother of my child gets denied when requesting I be taken off of child support", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "110029326045074970907", "name": "Casey “Ap0kryph0s” Mena", "time": 1567701939474, "rating": 1.0, "text": "How is it you allow Jeff Co resources go to a Blount Co resident for five plus years? Time for a reform of this broken system.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "100566532647732983357", "name": "Christal Skelton", "time": 1465517955439, "rating": 5.0, "text": "I seen a small lady with a big heart stand steady in her authority and overcome a bully trying to be above the rules and like In psalms 91 she had victory over the enemy which was not an enemy but a frustrated mother tired of of being in the system . But we all must admit we put ourselves here they did not! They work to keep our children safe so they deserve our respect ! I only picked up a mother nd baby I thought but ended up with her drugs in my car and went to jail for a faker who tricked me but I learned a important lesson! Psalms 91 came to me and I now live by it", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "106960446377797736388", "name": "Janice King", "time": 1549989628542, "rating": 1.0, "text": "They just take kids from good parents", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "110739341061948954813", "name": "Aaron Mitchell", "time": 1496165411310, "rating": 1.0, "text": "The Court Systems of America are still under British Rule. They do not acknowledge you as a living and breathing soul. You are seen as paperwork and treated as such. Look up the Straw man  deception.  This is not a system built for Justice.  It is a system built for law. Justice and legality are 2 different things. Slavery was Legal, Jim Crow was Legal, everything Hitler did was legal.  But to seek out true Justice within America has no ends and you will not find it in any court system. Especially as a black man.  Dred Scott V. Sanford March  1857. A Black man has no rights which the white man is bound to respect.\nNo matter the color of the Judge,  Police Officer, ect. We still uphold the standards and rulings of the Dred Scott case since it was never overturned.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "108981254304925867791", "name": "Jessica Watkins", "time": 1460724647172, "rating": 5.0, "text": "Tbh they are really good and they dont play about these men or women not taking care of they kids and they shouldnt have to be put on child support to be taken cared of", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "111189806210541883603", "name": "Shannon Kite", "time": 1440690122550, "rating": 1.0, "text": "I have been informed that it's only one magistrate to file a hearing for childsupport adjustment. I've been currently waiting now 8 months just to receive a court date and counting......", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "115170265501071628530", "name": "shawn blackmon", "time": 1585331334609, "rating": 1.0, "text": "Very bias, no justice for men", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "111631353903405652855", "name": "Nicole Fenderson", "time": 1455830207756, "rating": 1.0, "text": "The judge never even gave me and my children a chance.  Poorest sight of a judicial system I have ever seen in my life!!!", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "115543070878928001222", "name": "Marcell Mcgraw", "time": 1456846426662, "rating": 1.0, "text": "I took my daughter's mother due to neglect and abuse.....they left her in the home where she continued to be abused until she ran away... Only then they investigated then removed her......they are totally against a father in every way", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "114364695277389259279", "name": "susan Smith", "time": 1516201568904, "rating": 4.0, "text": "Our case worker was very professional and really seemed to care about the kids she was trying to help.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "110978359731235226718", "name": "Robert yee", "time": 1535146315019, "rating": 1.0, "text": "The Family Court inadvertently stripped me of my rights to my kids, in they way they worded the dismissal of a DHR case against my ex wife. I wasn't even the one in their system, yet I lost my kids.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "112318603788067930575", "name": "Ebony Townes", "time": 1375456841212, "rating": 2.0, "text": "It's a zoo run by clowns.. By far the WORST legal experience I have ever had. The staff is never able to control the patrons; they just yell over them. Total and complete waist off time. Future endeavors will be held by a personal attorney.", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "101840699989898976588", "name": "Tavarus Robinson", "time": 1459906612105, "rating": 1.0, "text": "I didn't have a job and they awarded my child mother with $514 a month. They locked me up although they was was taking money out my check when I went to court she told them I was behind $20000 and awarded her that when I only been on child support for 2yrs....", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "116463277622697012391", "name": "Ashley Colin", "time": 1558115467992, "rating": 1.0, "text": "Horrible horrible horrible", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "105468593799894995709", "name": "LAKRESHA DAVIS", "time": 1503330004176, "rating": 1.0, "text": "Clerks are extremely lazy and inconsiderate!!", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "101092235112278132715", "name": "Amy Owens", "time": 1474492065654, "rating": 1.0, "text": "They are disrespectful, rude, and all you get is put on hold and hung up on! I was more than polite and i got no where!!  All I needed is a certified copy of an Order!!", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "108879810703443008710", "name": "stephanie blaylock", "time": 1454084623488, "rating": 1.0, "text": "This was the worst experience I have ever had with the judicial system. All of the employees are inconsiderate, lazy, and unprofessional. And their attitudes are the Worst", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "116765588463355702500", "name": "Steven J", "time": 1418671138641, "rating": 1.0, "text": "For the children my ass, these clowns give their own opinion of the law instead of what's right!!!!", "pics": null, "resp": null, "gmap_id": "0x88891c121ff6c65b:0x4dd765313b8cb9bf"}
{"user_id": "117089803959717036135", "name": "Scott Jeter", "time": 1618515467033, "rating": 5.0, "text": "License plate's not tag's!! You put license plate's on vehicle's,truck's,buses,utility trailer's,etc.!! You put tag's in live stock ear's!!", "pics": null, "resp": null, "gmap_id": "0x889293aa561ae22d:0x795d151875331206"}
{"user_id": "108091106330978199648", "name": "christine maddox", "time": 1579102552856, "rating": 5.0, "text": "Ms Breanna in the tag office was extremely helpful, kind and overall friendly. She made the whole experience less daunting for me. I just want to thank her for her professionalism and kindness. If only everyone was like you. She had me in and out quickly, answered all questions and just was friendly.  thank you.", "pics": null, "resp": null, "gmap_id": "0x889293aa561ae22d:0x795d151875331206"}
{"user_id": "103972297711535481112", "name": "Cindy Lynn", "time": 1583881957193, "rating": 1.0, "text": "Mostly rude women who act like you are bothering them when you go in. They seem to get pleasure out of people's stress.", "pics": null, "resp": null, "gmap_id": "0x889293aa561ae22d:0x795d151875331206"}
{"user_id": "102319063233213197794", "name": "Ben Quackenbush", "time": 1514398483980, "rating": 5.0, "text": "I love the people who work inside.", "pics": null, "resp": null, "gmap_id": "0x889293aa561ae22d:0x795d151875331206"}
{"user_id": "103764959238313961608", "name": "Joyce Lambert", "time": 1575998271273, "rating": 5.0, "text": "Very helpful, explained a lot of legal technicalities to me.", "pics": null, "resp": null, "gmap_id": "0x8890458e3c0abca9:0x4836a44c1bc94d9b"}
{"user_id": "103257833059949232018", "name": "Caleb Campbell", "time": 1599684054551, "rating": 1.0, "text": "Horrible service! Not honorable judge! Side with dishonest shop because they are in town and tied to voters unlike people who lives in other county’s! Just a warning! The proof was fool proof worst judgment ever! Horrible horrible! Also did not know it was legal for a shop to give a customer car with no Tag! Apparently in Madison it is!", "pics": null, "resp": null, "gmap_id": "0x88626b5423ec2145:0x8650c8226b3f2946"}
{"user_id": "101784452978302463561", "name": "Melanie Beth", "time": 1622565604684, "rating": 1.0, "text": "There very RUDE!", "pics": null, "resp": null, "gmap_id": "0x88626b5423ec2145:0x8650c8226b3f2946"}
{"user_id": "112273171680754288226", "name": "Katinka Edger", "time": 1543489137155, "rating": 5.0, "text": "Most Honorable and fair Judge's I've ever had the honor and privilege of meeting.  They are truly experienced in knowing when any one is innocent or guilty because they go strictly by the letter of the law and prosecute the guilty to the fullest extent. They've graduated from excellent law college's and simply do not put up with criminal activity!  They are overworked and underpaid yet perform an outstanding service to the public. Katinka D.Edger", "pics": null, "resp": null, "gmap_id": "0x88626b5423ec2145:0x8650c8226b3f2946"}
{"user_id": "109789079198514619515", "name": "Karen Martinez Merritt", "time": 1607096652876, "rating": 1.0, "text": "Why are all the clerks so rude?What's going on?", "pics": null, "resp": null, "gmap_id": "0x88626b5423ec2145:0x8650c8226b3f2946"}
{"user_id": "116868326624014910837", "name": "Lynda Brown", "time": 1515745081353, "rating": 5.0, "text": "Very helpful, the employees were very friendly and helpful.... answered all my questions & walked out satisfied", "pics": null, "resp": null, "gmap_id": "0x88626b5423ec2145:0x8650c8226b3f2946"}
{"user_id": "117063953597320045465", "name": "Cassandra Norris", "time": 1621006616836, "rating": 1.0, "text": "Sent off for replacement title over a month ago on a vehicle I sold because lady lost the title before switching it over so I requested that it be sent to their office when returned. Today I was told that it had been misplaced and I would have to pay for another one if not found and the supervisor wouldn't even speak to me on phone . Very unprofessional and unorganized losing important documents and they need to get it together up in there because they get paid to do that job and no one should have to pay for their mistakes it should come out of their check.", "pics": null, "resp": null, "gmap_id": "0x888f0680c03c8b87:0xc2fcd9c4e0963573"}
{"user_id": "103024598191061210286", "name": "Darius Bettis", "time": 1609222285151, "rating": 5.0, "text": "They are open but practicing safe guide lines in dealing with Covid 19", "pics": null, "resp": null, "gmap_id": "0x888f0680c03c8b87:0xc2fcd9c4e0963573"}
{"user_id": "113483035643735109758", "name": "Melinda Daniels", "time": 1480387950253, "rating": 3.0, "text": "Depends on why you are there. Rude counter help in the tag area except for maybe 2. Cant ever get anyone to answer the phones in any department.", "pics": null, "resp": null, "gmap_id": "0x888f0680c03c8b87:0xc2fcd9c4e0963573"}
{"user_id": "115541300965383014746", "name": "tweet-tweet tweety", "time": 1609168393878, "rating": 3.0, "text": "I checked their online holiday hours on Dec. 22, 2020 and saw they were closed on Dec. 24 and 25.  There was nothing about only being open for 2 hours, 8am to 10am, on Dec. 23 so I drove 40 minutes to find them closed.  I'm pretty sure they never, ever check or update their online hours or emails.  You must make a long distance call (other counties have 1-800 phone numbers) to find out their hours of operation.", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "102141761182222234896", "name": "preston naish", "time": 1544475872598, "rating": 1.0, "text": "Apparently the other sides attorneys can have you thrown out for no reason and the courthouse can’t tell you why you were thrown out", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "110952281476106404564", "name": "Jennifer Moore", "time": 1547586362273, "rating": 5.0, "text": "The clerks and staff are great!!!", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "112550554242842637176", "name": "Terry Mims", "time": 1554343791098, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "115806381758600385228", "name": "Ashley Godwin", "time": 1490016727849, "rating": 1.0, "text": "Awful live over 2 hours away no way to pay them unless you mail it in or bring it yourself not even able to pay over phone this is such a inconvenience for everyone", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "108666483216842801476", "name": "Martha Wilson (Queen)", "time": 1550597912548, "rating": 1.0, "text": "Awful place.", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "102782100997021340270", "name": "Raymond Danner", "time": 1510791659050, "rating": 2.0, "text": "Last time I was there, I had my backpack with me. On it was a closed sport bottle with water inside. Because of the sport bottle, I was forced to leave my pack outside, and while I was not there long (long enough to make an enquiry at the Property Tax office), it could have ended with my pack getting stolen. I believe the officers running the checkpoint goofed up.", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "109965588318848558545", "name": "Jessica Hubbard", "time": 1482520177496, "rating": 1.0, "text": "Closed early today and there was no sign up or anything on any voicemail to let people know they would be closing early. I drove all the way from Helena over 45 mins to find out they closed early. Absolutely ridiculous", "pics": null, "resp": null, "gmap_id": "0x888ec63045533351:0xbde312519a171b70"}
{"user_id": "100779554295711579521", "name": "Brother Smitty", "time": 1602263464555, "rating": 4.0, "text": "Went to pay a traffic ticket. Very nice visually and the guy at the window was super helpful and friendly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOo9HLXcKH3dPm1mcCHi_MMNgiN7Sf7-7quTczJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "118023303441177727258", "name": "Lords Mobile", "time": 1619449445584, "rating": 1.0, "text": "21 back to back calls over the span of 4 hours. No one ever answers the phones. Worthless bunch of employees.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "111883689598386790231", "name": "Alex Delery", "time": 1597435394281, "rating": 1.0, "text": "Went down to the courthouse to get a copy of a citation with ALL of the documents needed for my Navy Officer Recruiter. The initial case date was set on a holiday and instead of the clerk noting that in the case action summary, she stated I failed to appear which is false. Multiple pages missing which means it is skipping page numbers which makes me look like a liar.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "104503932638541959944", "name": "Matt DeBlaey", "time": 1582331823663, "rating": 3.0, "text": "I had jury duty, what else is appropriate?", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "115727302336720591147", "name": "Kaquandria Johnson", "time": 1562937626579, "rating": 5.0, "text": "Mobile County District Court House in my opinion is very well together...the employees are helpful....", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "108963137270649477900", "name": "Cypress H.", "time": 1557922743185, "rating": 1.0, "text": "Did you know Alabama is the latest in communist fashion? Alabama tells people what they can and cannot do but also refuses to help pay for what they control. It's like they are mashing the worst of the political spectrums and saying as long as it keeps \"those\" people in line. Btw that's not freedom so we better come up with a new slogan for America.  Freedom isn't free it is being told what to do, and dont be brave in this land? A little longer but becoming more accurate.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "103161201194648801191", "name": "G. W.", "time": 1500589386995, "rating": 1.0, "text": "I used to think that things were ran normally and that this was just the typical courthouse, ran like typical courts... Nope. Far from it. After traveling for years I have learned that this so-called \"Courthouse\" is a freaking JOKE! Actually they are the ONLY courthouse I have ever seen that had a constantly leaky roof, everyone else fixes their roofs. With as much money as Mobile Co Courts steal from people you would think they could afford repairs instead of more buckets to places under the leaks. Not only that, everything they do is pretty much incorrect. The way they keep records, they way they handle contact with out of state lawyers, they way they keep false charges on peoples records when the cases were thrown out, the way they communicate with all the other Mobile Co court system branches like probation and traffic violations all of it is a mess. They are so disorganized that even they mix stuff up causing issues for everyone else. Ive seen innocent people's lives ruined because Mobile Co Courts will charge people with false crimes, take money, arrest, jail for weeks, when trial comes the case is dropped but they leave the charges pinned on to those innocent people's records. When people want those fake charges removed the state of Alabama will allow them to hire an attorney and correct everything starting at a tiny fee of $10,000. If you're innocent and Mobile pulls fake charges on you, then you are better off fleeing the country because Mobile with try to ruin your life and steal every single penny you have for years on end.\nTHATS JUST INNOCENT PEOPLE\nThey let the real criminals go free. Repeat offender of 25+ times for drug charges thrift and everything else? Oh you're good, you will be home to see your woman by weekend in time to commit more crimes over the weekend, get picked up again on Monday, then back out again that same week. Oh your a politician's kid? Then you can be arrested 8 times in 5 years for drug charges then just be sent off to Colorado when you can smoke legally.\nJudges, lawyers, DA, sheriffs, Mobile PD, all of them are just terrible and it all leads back to this one location full of many offices and people who hate their lives.\nNot only is Alabama ranked #1 for worst state in the US, Mobile should be listed as #1 worst city, #1 most corrupt cops, #1 most corrupt government (haha Im laughing at you Roy Moore and Sandy Stimpson), #1 worst health care, #1 most greedy city, #1 worst compassionate city, and so on. Shall I start making the trophies?\nIf you live in Mobile and have not got caught in the web of the Court there, leave, just leave. If you dont get out now something will change and Mobile will try to own you for the rest of their lives (not yours, you can die and they can care less).\nPS: Ive never been arrested, never had a court date, never had a lawyer, never had a ticket, never had a charge on my record, nothing. My history is 100% squeaky clean. I just know that courthouse that well.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
{"user_id": "114517106598111374825", "name": "Tara Dukes", "time": 1590095495692, "rating": 1.0, "text": "Been calling about a ticket for 4 days in a row!!!!!..................", "pics": null, "resp": null, "gmap_id": "0x889a4fd0f2594a1f:0xef30cb144dc3f8cd"}
