{"user_id": "104710493464204562131", "name": "Tiffani Grzybowski", "time": 1630166913771, "rating": 3.0, "text": "Will wait forever depending on time of day", "pics": null, "resp": {"time": 1630167892843, "text": "WOW Tiffany, you have the wrong Transportation Service. When did you book a pickup with me? Although, I am not perfect but having someone wait forever, isn't how I handle my business. Don't leave False Reviews..."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "115132075894292883233", "name": "Katie Carpenter Stuhr", "time": 1628208362993, "rating": 5.0, "text": "Safely drove my parents home after a late flight - we'll call her again - thank you!", "pics": null, "resp": {"time": 1628210932518, "text": "Katie, it was my pleasure to provide your parents transportation services!!! You're welcome! Thank you for sharing your appreciation.🌻😁🤗"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "109492518576322440309", "name": "Kathy Milton", "time": 1618883991718, "rating": 5.0, "text": "She picked me up at the airport and my destination was about an hour away.  We chatted and had a great conversation!! She kept her eyes on the road. I am a nervous passenger but when she was cutoff by the same car TWICE she maintained control, and handled the maneuver correctly to avoid collision but not toss me around.\nLovely lady and I am so glad I found her to take me to my destination!", "pics": null, "resp": {"time": 1618886488524, "text": "Kathy, it was a pleasure to meet & have a wonderful conversation with you! Thank you so much for sharing your Ride Experience. I pray the best for you and your family!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "114387456748890490020", "name": "Lorin Smith", "time": 1619982236181, "rating": 5.0, "text": "Eunice Paige is an amazing woman and will serve you with genuine quality. I highly recommend her services.", "pics": null, "resp": {"time": 1619991771317, "text": "Thank you Lorin for giving me a wonderful Review. You are a God sent today. It was a blessed pleasure to have met you today!😁💥🙏💥"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "113680293613335200971", "name": "Dave Perkins", "time": 1619470292413, "rating": 5.0, "text": "Friendly, personable, professional, on-time and reasonably priced. A pleasure to work with. Will be using her service again for sure! A+++++", "pics": null, "resp": {"time": 1619480664953, "text": "Dave, thank you for your great Review, business & the wonderful opportunity to provide transportation services, to you today! Welcome to Huntsville, AL.😁"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "116519826032846691589", "name": "Gabriel Wigfall", "time": 1609209234573, "rating": 5.0, "text": "I absolutely love this Taxi business. The driver(s) are always on time, and if she is not in your pick up area, she will communicate to you how long it will take and still manage to arrive early. She is very polite and straight forward. She picked me up when I did not know how I would get home. I immediately call the Taxi Lady and she went out of HER way to pick me up.\n\nIF YOU NEED A RIDE HOME, CALL THE TAXI LADY PHONE...", "pics": null, "resp": {"time": 1609212058743, "text": "Gabriel, thank you so very much for your amazing Review. I appreciate you taking the time to express your gratitude for my transportation services. It's my pleasure!Peace"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "108306817572735425809", "name": "Donna Lasseter", "time": 1615503716334, "rating": 4.0, "text": "Very nice and pleasant but very hard to get a ride with her", "pics": null, "resp": {"time": 1616332596971, "text": "Thank you Ms. Donna for your Review. In the near future I am endeavoring to expand my Transportation Services by providing more vehicles/Drivers. However, currently, I am my only Driver and at times the demand for rides is greater than I alone can fulfill. It's an honor & a pleasure to have the opportunity to answer the Call of EXPANSION of business that I have been so GRACIOUSLY given by my Abba Father; to be of service to others..."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "103220521232598150890", "name": "Salted Cracker", "time": 1612563995682, "rating": 1.0, "text": "We tried to call this taxi service and she hangs up on us as we are in mid conversation! Horrible horrible service ! I do not recommend to anyone !", "pics": null, "resp": {"time": 1612583588271, "text": "The times that I have actually hung up on a caller are when the person is demeaning, rude, confrontational and lacks reason/understanding, and or abusive. It's my pleasure to treat people with kindness & dignity. Your review doesn't speak truthfully concerning the Transportation nor Customer Services that I provide.\nEunice Paige🌻"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "108167945564907187900", "name": "Q khan", "time": 1620669423024, "rating": 1.0, "text": "Very rude. When I called and asked for service , the reply was (I don’t work ) and she hang up .", "pics": null, "resp": {"time": 1619395349983, "text": "Hello Q Khan, I apologize for offending you. It would be nice to know how I was rude to you, instead of you just giving me a 1-star review and stating that I was very rude. I really feel sorry for you and others who have missed used your ability to Rate a business unjustly. I hope that you can find true joy and love in life and learn to be kind to yourself as well as others. PEACE"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "104368270854509573789", "name": "Totyjoe", "time": 1605880378656, "rating": 5.0, "text": "I've traveled with her a few times now, and every time she has been punctual and extremely nice. The Taxi Lady is my go to taxi service!", "pics": null, "resp": {"time": 1605909714725, "text": "Patrick, thank you so very much for your amazing Review! It's my pleasure to have the opportunity to provide transportation services for you & other UAH students & faculty. Have a blessed Thanksgiving & a safe, enjoyable time at home."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "111060068658282772094", "name": "crin dima", "time": 1599180939730, "rating": 5.0, "text": "Thank you taxi lady for saving the day. It was a pleasure meeting you. You are awesome! Hope you had a nice lunch...", "pics": null, "resp": {"time": 1599601296701, "text": "Mr.John Crin, thank you so very much for your kindness! It was a blessing to provide the wheels of service to you!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "113572864389247421926", "name": "Max Miller", "time": 1584096839908, "rating": 5.0, "text": "You cannot get this level of service from an Uber driver and I highly recommend the Taxi Lady anytime you are in Huntsville! Amazing service and great conversation. Eunice was so friendly and arrived right on time. She quoted me on the phone the day before so I knew exactly how much I was paying for the ride. She was an excellent driver and even was smart enough to take a detour because she had seen an accident before picking us up! We would’ve been waiting in standstill traffic otherwise. Thank you for getting us to the airport on time!", "pics": null, "resp": {"time": 1584109563149, "text": "Max, thank you for Highly recommending my Transportation Service. It is with great pleasure that I was given the opportunity to serve as your Driver. I wish you and your colleague safe travels and Much Success in your consulting careers!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "117261595340142059230", "name": "Tonya Castleberry (Tonya36033)", "time": 1607825747503, "rating": 5.0, "text": "She helped get my cousin food and cigarettes to him. She was wonderful and very pleasant to speak to.", "pics": null, "resp": {"time": 1607904656297, "text": "Tonya, thank you for your grateful appreciation of my Delivery Service. It's always a pleasure to assist when the opportunity becomes available!😁"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "114799275719436350156", "name": "Alberto Garcia", "time": 1619966616625, "rating": 1.0, "text": "Bad and poor service   please update your location of service and stop wasting peoples time", "pics": null, "resp": {"time": 1619968440164, "text": "Mi vida, it is most unkind for you to give me a 1-star review, when my business is based out of Huntsville Alabama. How did I waste your time you text me on a Sunday morning and I responded to you quickly. When I am able to accommodate someone in Decatur I do so. The type of trip request that you were asking for would be absolutely expensive for you to use me when there is another cab service in Decatur that can better accommodate picking up your child from school. I even gave you a suggestion but you weren't considerate of that and chose to give me a low rating. I am including your text to me just to let people know wait your request was of me:\n\nHello I need your service.\nI have a child that would need to be transported to a special school mon and Tues here in decatur"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "100362954431386825980", "name": "Charity Barker", "time": 1588610185751, "rating": 5.0, "text": "Phenomenal service from beginning to end! Eunice shared with me that Nashville is not typically her service area but she believed God had told her to go on this particular day... the day I needed a ride to the airport. Being the early hours of the morning, I was having a difficult time getting an Uber. I ended up canceling the driver I had been continuously waiting on because I was worried I wouldn't make it in time for my flight. I tried requesting a driver one more time, and Eunice showed up within minutes. We had church in the vehicle all the way to the airport. She even asked if she could pray with me. Whether Eunice realized it or not, she touched my heart that day in more ways than one. I'm thankful our paths crossed and would recommend her fabulous service to anyone. Thank you, Eunice! {Hebrews 6:10}", "pics": null, "resp": {"time": 1590843649926, "text": "OH MY GOODNESS!!!!😁😂😂😂😄\nTHANK YOU!!!!😁 THANK YOU!!!! 😁THANK YOU!!!!😁 HI CHARITY!!!!😍💥🙌💥🙌💥🙌💥🙌💥🙌💥 HALLELUJAH❗❗❗❗❗❗❗❗PRAISE JESUS❗❗❗❗❗❗❗😄You have encouraged my soul TODAY❗❗❗❗❗😂😂😂😂What a BLESSING & NEEDED INSPIRATION to be honored by receiving your AMAZING REVIEW!!!!!😁 I am so GRATEFUL to have had the opportunity to provided transportation to you at that DIVINE appointed time we met!!!!! Please contact me (256)694-3041. I have something GREAT to share with you!!! Please check out one of my new business opportunities since this unprecedented experience of COVID19. I have an online Press On Polish Shoppe. Here's my Facebook VIP Group & the virtual shopping launch party links.\nhttps://www.facebook.com/groups/1290038038051782/\nhttps://www.colorstreet.com/TheTaxiLady/party/1274408\nAgain, thank you so VERY MUCH for taking the time out to express your GRATITUDE for my Transportation Services as an Uber Driver. GOD'S SUPERNATURAL BLESSINGS & DIVINE PROTECTION 2U & ALL THAT CONCERNS YOU!!!!😍💖🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌💥🔥🙏🔥💥😂😂😂😂😂😂😂😂😂😂🎉🎊🎉👑💃👑🎉🎊🎉🌹🌻🌹"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "114572459406360363527", "name": "Brittnie Nicole (BackWoodz*Princezz)", "time": 1620582898511, "rating": 5.0, "text": "Awesome lady ♡", "pics": null, "resp": {"time": 1620585094563, "text": "Hello Brittnie, thank you so very much for sharing your kind thoughts. I really appreciate your expression about who I am. God's continuous DIVINE PROTECTION & BEST to you!😁"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "104160670338187502627", "name": "Rachel Ojani", "time": 1595548731928, "rating": 5.0, "text": "Awesome service.  Highly recommend and will use her service again when I am in town", "pics": null, "resp": {"time": 1595683126100, "text": "Hello Rachel thank you so very much for your wonderful comments regarding my Transportation Services. Stay safe & God's BEST to you & ALL that concerns you!!!😁✌🔥🙏🔥"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "109531290229363876960", "name": "Lee Johnston", "time": 1573343588047, "rating": 5.0, "text": "Eunice is the best ride in Huntsville. Honest, positive, and already on time. She has become a great friend and appreciate all she has done for many! Can’t go wrong with the Taxi Lady!", "pics": null, "resp": {"time": 1573353352536, "text": "Thank you Lee for your kind review of my transportation services to you! It was my pleasure to be your Driver & an amazing experience to have become friends with you! MUCH SUCCESS!!!!😃🔥💃🔥"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "116672242255807505489", "name": "McKenna Green", "time": 1569927911001, "rating": 5.0, "text": "By far the best ride I've ever had. I called at 4:30 in the morning and she answered and got to me as quickly as she could. Great conversation that we had and was super sweet and understanding of my situation. I recommend 10/10", "pics": null, "resp": {"time": 1572400923651, "text": "McKenna, I am so very grateful that I was available & able to accommodate your Trip Request!!! It was my pleasure as well to have met & spoken to you. GOD'S  CONTINUOUS SUPERNATURAL CARE & ABUNDANCE OF BLESSINGS TO YOU & YOUR FAMILY!, IN JESUS NAME AMEN❗😃💥🙏💥"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "106368591730844879550", "name": "A L.", "time": 1572268964720, "rating": 5.0, "text": "She’s my blessing in form of a human. We were able to talk like I knew her for years! Amazing! Thank you!", "pics": null, "resp": {"time": 1572400499255, "text": "Akaya, you are welcome! I am so glad that the Spirit of the Lord inspired me to help you on last Sunday afternoon. It was my pleasure to serve as a means of transportonion service & be given the amazing opportunity to speak words of encouragement to you. Remember to put Jesus FIRST on everything you do & keep your focus on what pleases Him FIRST & foremost❗😃💥🙏💥"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "117564966435922152739", "name": "Dawn Rodriguez", "time": 1612893069941, "rating": 5.0, "text": "Very friendly and kind. Not many people like this anymore.", "pics": null, "resp": {"time": 1612961935782, "text": "Dawn, thank you so very much! It was my pleasure to provide Transportation Services to you!!! God's BEST to you & your family!!!😁🤗"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "116915988844359930881", "name": "Evan Lunde", "time": 1581812387235, "rating": 5.0, "text": "The mini van drip!  Why Uber when you can use “the taxi lady” ! Super sweet, very accommodating, and got me where I needed to 0 to 100!! Appreciate you luv!", "pics": null, "resp": {"time": 1581876958922, "text": "Evan, it was totally my pleasure meeting you, your Mom & Sister as my Uber Customer's while driving with the Rideshares in Nashville. What a blast we had on our way to the Grand Ole Opry. Enjoy the rest of your vacation & safe travels back home!!! Thank you for your amazing Review!!!😃😂😁"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "113049512060762940079", "name": "Osla McKercher", "time": 1579661038602, "rating": 5.0, "text": "Circumstances did not allow me to use The Taxi Lady's services, but WOW! She was very kind and so helpful when I called her. She sounds like a very sweet lady. I needed to schedule a midnight ride for someone. Since she doesn't drive that late at night, she couldn't do it, but she did take the time to talk and answer my questions about getting a ride in the area. Thanks Taxi Lady, and good luck!\n\nEdited to add: I did actually end up using The Taxi Lady's services for a friend. I set up the service for my friend. The Taxi Lady is absolutely wonderful and my friend loved her, too! Very sweet and kind. I wish I could have met her in person and given her a big hug!", "pics": null, "resp": {"time": 1550774426735, "text": "Osla, WOW❗️Thank you for expressing your gratitude. It’s my pleasure to help, even if I am not able to be your Hired Driver. Thank you for requesting my transportation service.  Eunice Paige 🌻"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "109533805190277084377", "name": "cody melton", "time": 1554827636897, "rating": 5.0, "text": "The ride and experience was perfect... very nice lady who helped me at the drop of a hat... would recommend over any other services 100%", "pics": null, "resp": {"time": 1554858474686, "text": "Cody, thank you for expressing your appreciation of my transportation service! It's my pleasure to make sure people get to where they want to go-to!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "108419868481806124912", "name": "Kathy Mashburn", "time": 1566235439441, "rating": 5.0, "text": "Eunice was great!  She picked me up with only about 45 minutes notice & we arrived at my destination with minutes to spare!  I would highly recommend her!", "pics": null, "resp": {"time": 1566925425505, "text": "Ms. Kathy, thank you so very much for giving your lovely comments about my transportation services. It was my pleasure to be your Driver."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "111410811804230533038", "name": "Donna MacArthur", "time": 1576877043745, "rating": 5.0, "text": "What a wonderful lady!  Great service, on time, and very friendly. I will defefinitly use her service in the future. Thank you.", "pics": null, "resp": {"time": 1579135228559, "text": "Thank you, Donna for your Review of my transportation services. It was my pleasure to be your personal Driver."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "110833767020998166803", "name": "Bamboo Web", "time": 1521713826954, "rating": 5.0, "text": "Eunice is great.  My hotel called her early AM for a ride to the airport.  She said she was dropping someone off and would be back to pick me up in 15 minutes.  She arrived as promised, even a few minutes early.  I respect that a lot.  She likes you to schedule a ride ahead of time if you know you will need a ride, but not necessary.", "pics": null, "resp": {"time": 1565947347630, "text": "Thank you Boonjaka for your comments. I love providing transportation to assist you in going to your desired destination. It was my pleasure!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "100756314840087376787", "name": "patricia allicocok-alshabazz", "time": 1579105677995, "rating": 5.0, "text": "Credible driver  from since in tampa ive traveled have a pleasant personality and conscious of what she does safety and customer service is important to her.", "pics": null, "resp": {"time": 1579135112713, "text": "Thank you so very much for your Review of my transportation services. It's my pleasure to aim to provide excellence in all that I do."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "101141924244044191771", "name": "L Pike", "time": 1527290934012, "rating": 5.0, "text": "Eunice was excellent! Friendly, personable, and arrived ahead of schedule-- which was very helpful since I had an early flight out of HSV. A very safe ride and we arrived on time. I visit family in Huntsville on average every two months and I will definitely call \"The Taxi Lady\" every visit! She's kind--a safe driver-- friendly-- and adorable! Very pleased I found her!", "pics": null, "resp": {"time": 1565947149277, "text": "Thank you so very much for your review. It's my pleasure to serve as your Driver. Please forgive me for not responding sooner than now."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "112355946000857406662", "name": "Dana Lacy", "time": 1565395662799, "rating": 5.0, "text": "If the taxi lady is available, she is  by far the best option in the Huntsville area.  She was very professional, prompt, personable,and with a very clean vehicle, in giving me a ride from Decatur to HSV.  Easily worth double the normal cab fair, but did not charge it.\n\nWill be calling ahead to reserve her services in future trips through HSV.\n\nSteve", "pics": null, "resp": {"time": 1565946734309, "text": "Steve, what an amazing heart felt encouraging review of my transportation service.  Thank you so very much for taking the time to give your comments. It's my sincere pleasure to have served as your Driver. Once again thank you!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "103480810209962209960", "name": "Emma T", "time": 1554751505783, "rating": 5.0, "text": "Eunice takes my granddad, who has dementia, from Rogersville to Madison on Mondays.  She is so kind and caring with him.  Also, she is very prompt!", "pics": null, "resp": {"time": 1554760720423, "text": "Thank you Emma, for expressing your appreciation of my providing transportation service to your granddad. It's a pleasure to have this opportunity. Thank you once again for your business."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "116932499026166975187", "name": "deepinder singh", "time": 1574282652009, "rating": 5.0, "text": "She is nice lady was quite friendly", "pics": null, "resp": {"time": 1574292122343, "text": "Thank you Singh for taking the time to express your kind regards of my service. It was my pleasure to provide transportation to you all!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "117529083269045995949", "name": "jeff weaver", "time": 1538870353990, "rating": 5.0, "text": "Dependable, reliable, interesting conversation if you so desire, and a warm heart in the excellent driver that uses a pretty clean van that has a/c, no smell and no unusual sounds like some cabs in HDV.", "pics": null, "resp": {"time": 1554761302359, "text": "Jeff, it was a pleasant experience to be your go-to Cab Driver while your were here in Huntsville, AL."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "111632688010804125082", "name": "AngieB", "time": 1566593949533, "rating": 5.0, "text": "I needed a ride to airport and training on Redstone. I did not want the hastle of downloading an app to get a ride so I saw the reviews for Eunice and decide to give her a try. She provide timley serivce with a smile. I actually used her several times while in the area and would use her again if I return. Thanks Eunice!!", "pics": null, "resp": {"time": 1566925571585, "text": "Angie, it was my pleasure to serve as your Driver. Thank you so very much for your business & your comments!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "113644768622264632121", "name": "John Bilich", "time": 1536023306574, "rating": 5.0, "text": "Eunice gets calls from me around the clock and always delivers with a friendly and courteous smile and service. She is best in her business anywhere!!", "pics": null, "resp": {"time": 1554761654237, "text": "Captain John, it's a welcome privilege & honor to transport your crewmembers to the Huntsville Airport no matter the hour. Thank you for your reoccurring business."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "106410913384957116794", "name": "Young Chu Baker", "time": 1547925648796, "rating": 5.0, "text": "“On time, very friendly and her car was very clean and comfortable.”", "pics": null, "resp": {"time": 1549753666451, "text": "Thank you Young Chu for expressing your appreciation for my transportation service."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "106726407328555010290", "name": "Steve Neubauer", "time": 1525649340532, "rating": 5.0, "text": "Eunice ROCKS ! Very personable, prompt and courteous, highly recommend her for your commute needs.", "pics": null, "resp": {"time": 1554761031452, "text": "Thank you Steve! I am grateful to serve as your personal Driver! Thank you for choosing to ride with me once again!😄"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "118287735357007314684", "name": "TJ Thompson", "time": 1590783473516, "rating": 5.0, "text": "This lady is awesome", "pics": null, "resp": {"time": 1590840952855, "text": "Terrance, it was a blessing to met you & to make sure you reached your desired destination!!! Thank you so very much for your appreciation of my Transportation Service. May you & your family's Angels be encamped all around you all, keeping you SAFE & SOUND in all of your travels, in Jesus Name. AMEN!!!😁👌💥🔥🙏🔥💥"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "110151110268610278644", "name": "Daniel Chang", "time": 1537609237548, "rating": 5.0, "text": "It's awesome to know that I can receive 5 star service with a taxi driver.  I have been skeptical in trying out Uber or Lyft due to the horror stories I hear.  I'm so glad I was able to find Eunice and her company and highly recommend her if you are flying or visiting Huntsville.  She's had a great attitude and so kind.  We had a little hiccup previously but so glad that I've found reliable taxi service in Huntsville.", "pics": null, "resp": {"time": 1565946989316, "text": "Daniel, please forgive me for not responding to your review sooner than now. Thank you for your comments. It's my pleasure to provide you with an excellent customer experience."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "108489894087926271294", "name": "Manikandan Madhavan", "time": 1528323485327, "rating": 5.0, "text": "Eunice is kind , friendly and safe driver.", "pics": null, "resp": {"time": 1554761174029, "text": "Manikandan, thank you for your positive reflections of my transportation service!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "100044202751039558248", "name": "Lou Anne DeMattei", "time": 1521711969925, "rating": 5.0, "text": "Five star service- reliable, on time, and courteous!", "pics": null, "resp": {"time": 1554761862401, "text": "Lou Anne, please pardon me for taking so long to respond to your wonderful review of my transportation service. Thank you so very much for your support!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "114190713296509867956", "name": "Wegahta Tewolde", "time": 1569434349774, "rating": 2.0, "text": "Rude driver. Didn't tell me there would be a $20 minimum until she arrived at my residence. And didn't even have a meter to track the distance I would be traveling.", "pics": null, "resp": {"time": 1569437334180, "text": "My apologies for not telling you about the $20 minimum. It was an honest oversight however. I did let you know before we began the trip. I am really not sure how I was rude to you since I waited for you even after you didn't answer me twice to let you know that I had arrived. You failed to state that I quoted you a Flat Rate charge of $30 for a Roundtrip to Wal-Mart that included Wait Time. However, you refused to agree to that FARE Cost & wanted to only pay $20. Since we could not agree on my stated cost you decided to leave out if my vehicle & go with contact another ride service."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "107389064006278812716", "name": "Latoya Davis", "time": 1554698094114, "rating": 1.0, "text": "I don't like her she's the worst anywhere she is so mean to me I'm on oxygen and it was taking me a little time to get in the car and she was really really really rushing me and it was making it hard for me to breathe and she said maybe if you lose weight it will not take you this long and she was looking at me like I was pathetic and pitiful she's pitiful please don't ride with her she is not good get someone else.she even called me nasty and disgusting please don't go anywhere with her and I used to stay with her and she treated me worst than the white folks treated me back in the slavery days no get", "pics": null, "resp": {"time": 1554859359754, "text": "Latoya Davis, I went over & above to help you in the time of your need. My heart went out to you due to your current health & living situation. How you can post a lie instead of the truth is less than acceptable. I sacrificed my own personal space, in order for the quality of your life to be better. For three days that I was able to assist you with transportation at no cost & a place to stay. May the Lord Jesus Christ be with you, forgive you, & cause you to treat others with kindness also consideration."}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "100863311395365531966", "name": "mirza ahmed", "time": 1556288047368, "rating": 5.0, "text": "Great!!!!", "pics": null, "resp": {"time": 1556358629917, "text": "Mirza, thank you for expressing your kind thought. It was my pleasure to have the opportunity to meet your mobility need on yesterday & for the wonderful conversation. Thank your your business!"}, "gmap_id": "0x88626c50bf088e35:0x4efffbf45463e4f"}
{"user_id": "109971411044660130966", "name": "Brian P. Hoene", "time": 1625204793171, "rating": 1.0, "text": "It has 3 signs that say NO 18TEEN WHEELER'S and not one single sign telling the 18teen wheel Drivers where to go it has a small driveway that's dark your supposed to go down for your 18teen wheeler so if you have never been here you end up parking out on the street and have to walk all the way around back to see if this is where you are supposed to be what a NIGHTMARE", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "105791229566976782806", "name": "Alex Strahan", "time": 1613770260540, "rating": 5.0, "text": "Within a few hours SGI setup a roundtrip from AL to PA to deliver medical supplies to my laboratory. OUTSTANDING service!", "pics": null, "resp": {"time": 1620841173584, "text": "Glad we could help! What a crazy year!"}, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "106712963649034518302", "name": "Reginald Larkins", "time": 1590097356864, "rating": 5.0, "text": "They respond quickly to phone calls and emails. They also deliver promptly", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "100184532538251331905", "name": "DEBORAH JOHNSON", "time": 1518540099365, "rating": 5.0, "text": "PrimePay uses SGI Delivery Solutions to deliver our payrolls. They are the most professional friendly people I have ever had the pleasure to work with. They keep me informed with any problem with a delivery attempt. They are always available when needed. They are extremely reliable! I love this company and the people who work here. They are awesome!!! I do not know what I would do without them !!!!!", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "112269488211432194613", "name": "Ron Cutler, Jr", "time": 1518034593053, "rating": 5.0, "text": "We have been using SGI for about 10 years and find them to be very reliable and customer service oreintated. They get the job done and will go out of their way, literally, to provide the service needed.\nI would and do recommend SGI to any and all who need quality service.", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "112220457034344347985", "name": "Gregory Utupo", "time": 1455781362333, "rating": 5.0, "text": "Second to none! Called these guys at 1:30 in the morning for an urgent 4am pick-up and within 5 minutes we were set and ready to go. Great customer service from David. These guys really came through!!", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "117350747640450358522", "name": "Jennifer Chandler", "time": 1433526661816, "rating": 5.0, "text": "We are a medical company located in Birmingham, AL. We have been using SGI as our courier service for over 5 years and have been more than satisfied. SGI has excellent customer service and is truly an extension of our company. We have many clients in multiple states and SGI couriers from many of those different states or assists with organizing our needs in a particular area.\n\nWe would recommend SGI to anyone looking for a top notch delivery service company.", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "103105819852873971743", "name": "Derek Rakestraw", "time": 1518025675019, "rating": 5.0, "text": "We have been using SGI Shipping Solutions for 10+ years. Great people to work with! Very satisfied with their work!", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "113433702629688732612", "name": "Valanda Taylor", "time": 1578715792162, "rating": 5.0, "text": "They are awesome company.", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "117235826903256179633", "name": "Braden Arnold", "time": 1469302112804, "rating": 5.0, "text": "Nice place to deliver/pickup", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "105805562696838750059", "name": "Allison Keeton", "time": 1485018766387, "rating": 5.0, "text": "Fast, friendly service.", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "114607127805316101557", "name": "Jason Watson", "time": 1488925214093, "rating": 5.0, "text": "Great Business", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "108501419862842631728", "name": "rasta woman", "time": 1510352763304, "rating": 5.0, "text": "On time", "pics": null, "resp": null, "gmap_id": "0x88891edb138af34f:0x92ec4c2cd0630497"}
{"user_id": "115290119703828450294", "name": "Noah Morgan", "time": 1487263450361, "rating": 4.0, "text": "Busy place\nGreat employees", "pics": null, "resp": null, "gmap_id": "0x888911b2efa0cc03:0xbbb1f1354f599047"}
{"user_id": "104031138776824576564", "name": "Mark Paul", "time": 1590792594397, "rating": 5.0, "text": "Another great place to get a bite. Very fresh ingredients on the sandwich. That peach tea that people come to get JUST FOR THE TEA I must admit is outstanding.Mobile is blessed with many great restaurants.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "105146381602191077249", "name": "Robert Smith", "time": 1574359669411, "rating": 2.0, "text": "At first I was happy to find out that this company delivered to my job, order food got it early even left the driver a good tip, next day had a good amount of people from corporate that wanted lunch delivered to the job just to find out they don't deliver in this area!! Very disappointed. You guys are the only delivery service that goes to the restaurant my company likes. No one from the company have not responded to my calls on the reason why you guy's stop after one delivery. Major opportunity just went out the window.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "106690590681281765304", "name": "Jessi Stubstad", "time": 1575677451699, "rating": 2.0, "text": "They were great, however since the change over, they are rarely open.  I haven't been able to order from here in over a month.  Recommend Waityr.  They seem to cover the same places.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "101230801889143600001", "name": "Shelby Anderson", "time": 1541108726114, "rating": 5.0, "text": "Drivers are always friendly! Owner called once to tell me they would be late and personally apologized and offered a discount on my next order. Port city is reasonably priced compared to the other delivery services. We are very impressed with Port City Deliveries!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "102703383044548986667", "name": "Stephanie “Momma Sasade” Sasade", "time": 1550548003076, "rating": 5.0, "text": "While visiting family I discovered this wonderful\nLocal company that is the only delivery service for my favorite, Pizzeria Delphina! Prices are fair and they pay their drivers the whole tip plus the delivery fee. Manager on phone was very quick to fix my order before he sent it and food came before the estimated time. I will gladly use this company again and my family has vowed to keep using them as well.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "110397235961517027285", "name": "Michael Keahey", "time": 1547434238085, "rating": 2.0, "text": "The deliverer called three times concerning the address. The first time I was told that there was no *****North, so I corrected them: *****West. The second time they called they told me that there was no *****South, so again I corrected them. The third time they called (and by this time they were already 30 minutes late) they had me walk outside so that they could more easily find the house, and that would have been fine had they been sure that they were in the right neighborhood. Eventually though, they found me and they gave me a $10 credit for the trouble. I will still only give 2 stars because of my cold order.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "110456940042234155878", "name": "Leslie Hakanson", "time": 1563623385251, "rating": 5.0, "text": "Friendly and helpful office.  Friendly drivers. Good option when need food but can't get out/away.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "106994739210687356866", "name": "Will Hannon", "time": 1574348620035, "rating": 5.0, "text": "They put an emphasis on delivering for local restaurants.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "106025888955539092071", "name": "Kimberly Williams", "time": 1554393642300, "rating": 1.0, "text": "Absolute worst service EVER!  Have been ordering for over a year.  Sometimes 2 -3 times a week. Had trouble with their website this morning.  Austin answered the phone.  Told, by Austin, sorry your are having trouble with the website but I have four other phone calls.  Go handle those phone calls Austin.  Cuz, I certainly will NEVER be calling y'all again.  If I could give you NEGATIVE stars I would.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "111865926661704788863", "name": "Music4Meka", "time": 1559372583575, "rating": 5.0, "text": "I've used for over a year now and they're great", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "100099719441043460896", "name": "Jenny Nall", "time": 1573866492832, "rating": 1.0, "text": "After I placed an order I was notified that it would take over 3 hours!  No one would return my calls or email.  Very unprofessional, terrible business! If I could give Port City Deliveries no stars I would.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "117985148858494152429", "name": "Brennan Baker", "time": 1477382321135, "rating": 5.0, "text": "These guys delivered in less than 30 minutes! I just moved to Mobile from Tuscaloosa and have been looking for somewhere that delivers food from everywhere thank goodness for these guys!! Awesome service give it a go!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "110292036493675922602", "name": "jennifer brown", "time": 1524146840953, "rating": 1.0, "text": "We ordered from work. It took over 30 minutes to place the order, then they called back and said that they had to cancel the order because the restaurant closed.  But they still charged my credit card.  I tried to call them back today but I only got a voicemail. My friend who ordered also, had charges come out of her account 6 times.  Beware!! They will steal your money!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "113100760967937345290", "name": "Lance Mayfield", "time": 1562089422579, "rating": 4.0, "text": "Pretty faIr and fast service", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "107777497258348985251", "name": "Nicole McCall", "time": 1543473519767, "rating": 5.0, "text": "Driver was very kind. And the food came quicker than I thought it would.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "110007223474197535742", "name": "Marina Buie", "time": 1512867427586, "rating": 5.0, "text": "Great experience! We ordered from a different delivery company the night before and it was awful. So very happy to find a company that believes in customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "106465033159946731354", "name": "mill W", "time": 1530322264107, "rating": 5.0, "text": "Port City Deliveries is a life saver. So many days I work longer than expected and can't get away for a meal. So I hop on the app and find a local place to order from. If the delivery person is running late they call and give a heads up with an apology. I also get texts to let me know when they are close by. They are always pleasant & polite. Tonight I ordered from a Chinese restaurant & my food was all wrong. Wasn't sure if I should contact the restaurant or PCD (since they brought me the food & I couldn't leave work to return it myself). I decided to call pcd. Maaan, I'm so glad I did! *AJ* did not hesitate to solve the issue.  He stepped right up & got the problem solved. Went far and beyond to make it right. Now THAT'S how you handle business! Dwnld the app, it's a game changer for sure.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "115344028222659442970", "name": "Craig Tucker", "time": 1524747690690, "rating": 5.0, "text": "First delivery experience. Fast and friendly. Good food, too.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "105514962445777904589", "name": "Tracee Wallace", "time": 1531878466538, "rating": 1.0, "text": "I placed a lunch order today fried shrimp poboy with waffle fries what I got was blacken shrimp with tater tots. I called Port city they blamed Montego restaurant  I call monetego they blamed port city but nobody offered to refund  port city offered to credit my account fo the next time I use the I fee like l am being forced to use them #disappoint\nJuly 17,2018. Today I was surprised to receive a call from AJ  to follow up. He apologized and  let me know I would be receiving a refund and a credit. I value good customer service and the willingness to go the extra mile to improve upon short falls. I will definitely give Port City Delivers another opportunity to provide great service!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "111307304761570718832", "name": "Brooke Crane", "time": 1502666958991, "rating": 5.0, "text": "Now I can order from all my favorite places!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "114689547796106505833", "name": "Star Winstead", "time": 1571794077924, "rating": 5.0, "text": "Always awesome experience", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "106376784854535682076", "name": "Deidra Dees", "time": 1569355804021, "rating": 3.0, "text": "How did I get blocked from ordering food", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "105379914550985466622", "name": "Justin Lamar", "time": 1529484422121, "rating": 5.0, "text": "This is my second time using their services and the employees are great and really hard working and I think I’ll continue to in the future", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "105484712027148573857", "name": "Christian Young", "time": 1550622053676, "rating": 5.0, "text": "Great customer service and friendly", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "105268588080168485459", "name": "Logan Brown", "time": 1536204363583, "rating": 5.0, "text": "Waitr is unreliable and unhelpful. I HIGHLY recommend using Port City Deliveries!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "115099755893757173062", "name": "Beth Lowe", "time": 1581968146750, "rating": 1.0, "text": "was told this company went out of business ???/   yes / No ???", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "102286110815969955661", "name": "Becca Croley", "time": 1560566127656, "rating": 5.0, "text": "Fast and friendly", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1548000733108, "rating": 4.0, "text": "Ok service.", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "104277665794095171513", "name": "Michael Taylor", "time": 1550542413500, "rating": 1.0, "text": "The owner is someone who misleads people", "pics": null, "resp": null, "gmap_id": "0x889a4e0cc2d85653:0x82698c826e69caeb"}
{"user_id": "102810069090133002885", "name": "Eric Hughes", "time": 1619319356934, "rating": 5.0, "text": "Highly recommend! great service and very responsive. Thanks for your help today", "pics": null, "resp": {"time": 1619382522765, "text": "Thank you Eric . We appreciate you"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "104503599446149333511", "name": "Crystal Brophy", "time": 1603580785031, "rating": 5.0, "text": "Maurice is a great guy and his business is perfect for the area. Don’t go through these other delivery sites. Keep it local!\nFast delivery, friendly driver and easy to use site!", "pics": null, "resp": {"time": 1610861567801, "text": "Thank you for the kind words 🙏🏽"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "116197051327693426916", "name": "Alexandria Lewis", "time": 1611278010072, "rating": 5.0, "text": "Best delivery service in town!! Expand to the beach!!", "pics": null, "resp": {"time": 1611511447224, "text": "Thank you . We will consider that recommendation. Which beach needs our service ?"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "118012869918072222541", "name": "Hannah Tucker", "time": 1584663011243, "rating": 5.0, "text": "Every time we order Kat’s Delivery we are super satisfied! Luci, Myles, and Austin have delivered to us and they are always so kind and make sure we have everything we need! We will definitely keep using Kat’s!", "pics": null, "resp": {"time": 1618674245133, "text": "Thank you so much."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "114207870014303796236", "name": "Jay Clyce", "time": 1581440532621, "rating": 5.0, "text": "Are you looking for quality service and professionalism, to deliver your food?  KATs Delivery is a great choice.  I highly recommend them!", "pics": null, "resp": {"time": 1581441028944, "text": "Thank you Jay for the recommendation. We are here to make a difference one order at a time !"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "102896997176427442750", "name": "Steven Scott", "time": 1564103154683, "rating": 5.0, "text": "Every time we use them fast delivery in less time than it would take me to go get it myself.  Busy days at work everyone eats anything they want within surrounding areas.  Drivers are always very nice.", "pics": null, "resp": {"time": 1564853670229, "text": "Thank you Steven. We appreciate your continued support."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "111759383115714649878", "name": "Robin Connell", "time": 1573825509190, "rating": 5.0, "text": "So grateful tonight that our little town has Kat's Delivery. Our family had a rough day today. As I'm on my way home I have my son order our food from a very well put together website. Paid added the tip and got a delivery time. Our food arrived shortly after getting home and was exactly what we needed. So thank you Kat's for servicing our small town. You have no idea how you helped us tonight.", "pics": null, "resp": {"time": 1573826703109, "text": "Thank you so much for trusting the KaTs Team. It’s our honor and our pleasure ."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "101063912513045891930", "name": "Jamie McGinnis", "time": 1558833103657, "rating": 5.0, "text": "KATs is a fantastic company. We love the mission of KATs and the easy access to grocery and food delivery it gives people! 5 STARS!", "pics": null, "resp": {"time": 1558837692905, "text": "Thanks Jamie for the kind remarks."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "106186937744581978653", "name": "Ryan Northcutt", "time": 1570465671091, "rating": 1.0, "text": "Not sure why the company doesn't tip the people who make the food (they work for tips). So if you order from them you are making someone work for free to make your food. The drivers get tipped but the employees at the restaurant who did all of the work get nothing. Please look into fixing this problem as there are more and more people using your service. Thanks.\n\nEDIT: not sure about the rude response from this owner, my mother works in the medical field and I don't know anyone from Longhorns. I was referring to a different restaurant. No one is trying to shake you down, just trying to give feedback!", "pics": null, "resp": {"time": 1570419887876, "text": "Ryan , the employees at Longhorn where your mom works get a salary / hourly wage from Longhorn Steakhouse in Alabaster . Every driver doesn’t always get tipped and when they do they have maintenance and gas on their vehicles . This review should be for people who used our service\nNot for people who are upset they didn’t get a tip . We deliver to all our customers with or without a tip . Your mom should serve her customers . I will send someone to management in longhorns in the morning to let them know what their employees are\nUp to harassing Longhorns customers when their off . Y’all are trying to shake Kats down like a NewYork mobster looking for his cut on a private business ."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "106239295667815249294", "name": "Amanda Mercer", "time": 1558828584219, "rating": 5.0, "text": "Great locally owned company. Drivers are friendly and communicate with customers during the delivery process! We love KATS!", "pics": null, "resp": {"time": 1558838076369, "text": "Thank you for all your support!"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "101208705499537408181", "name": "Isabel Santiago", "time": 1558828550479, "rating": 5.0, "text": "Maurice is the kindest individual you’ll ever meet. Love supporting his business!", "pics": null, "resp": {"time": 1558838110828, "text": "Thank you Isabel for your support and kind words."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "113441803954487220364", "name": "John H. Stubbs III", "time": 1558829449449, "rating": 5.0, "text": "Great experience!!! If you’re in need of a food delivery service, definitely give them a try! You will not be disappointed!!!", "pics": null, "resp": {"time": 1558838019511, "text": "Thank you sir. We appreciate the feedback."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "104234797467137424032", "name": "Andrew Simmons", "time": 1558832874550, "rating": 5.0, "text": "I was in town on business and had the pleasure of ordering from KAT's Delivery. What a surprise it was. My food was on time, the driver was neatly dressed, and none of the transaction made me feel uncomfortable. I love ordering from the locals when I'm in any city, and this delivery service is five star all around!", "pics": null, "resp": {"time": 1558837737481, "text": "Andrew, Thank you for your review. We look forward to serving you when your in Bham."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "115705802562170529508", "name": "Jacquelyn Davis", "time": 1558829880343, "rating": 5.0, "text": "This was the most wonderful service! I love everything about this company! And the food🤩", "pics": null, "resp": {"time": 1558837961880, "text": "Thank you for the kind review"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "112932751684774393525", "name": "Michelle Austin", "time": 1536935527171, "rating": 5.0, "text": "Easy ordering! Delivery was fast and food was still hot like I was actually eating at the restaurant! Will definitely use the service again!", "pics": null, "resp": {"time": 1536938708371, "text": "Michelle , thank you . It was our pleasure and we will see you again soon ."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "117796644403660470883", "name": "Stacy Burke", "time": 1536509115753, "rating": 5.0, "text": "My son used KATs Delivery for dinner a few days ago and received texts from time of order to delivery about status of his order. Great service!  Highly recommended!", "pics": null, "resp": {"time": 1536509928200, "text": "Thank you for letting us know our drivers are communicating to the highest standards . We appreciate the feedback ."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "107142396351015563945", "name": "Trent Walls", "time": 1558915300687, "rating": 5.0, "text": "Met the owner (Maurice) at a conference this week. He's a great guy and runs an honest operation.", "pics": null, "resp": {"time": 1558917737087, "text": "Trent, It was a pleasure to meet you as well. I look forward to continued growth with you and other RDS owners!"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "108200895486567036153", "name": "Will McGinnis", "time": 1558832248006, "rating": 5.0, "text": "We love KATS!!!  The owners are some of the best people we know!!!  Great service all the time!!!  Highly recommend!!!", "pics": null, "resp": {"time": 1558837755160, "text": "Thank you Will!"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "113602613171505557455", "name": "Brandi Bailey", "time": 1555798168013, "rating": 5.0, "text": "I LOVE LOVE Kats!! Dont know what I would do without them I work really long hours so my kids can get real food instead of fast food. They are super friendly and very fast!!!", "pics": null, "resp": {"time": 1556108173459, "text": "Thank you for being a loyal customer. Glad to be apart of your family’s meal plan."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "109647051396848812992", "name": "Charli Lavett", "time": 1552666818262, "rating": 5.0, "text": "Every restaurant and business in the Birmingham area should partner with Kat’s Delivery because Maurice’s customer service skills are exemplary, and he truly cares about his clients.", "pics": null, "resp": {"time": 1552669451764, "text": "Thank you Charli . I appreciate your kind words and looo forward to working with you again"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "114184437090971604518", "name": "Jen Avant Goodwin", "time": 1553274843795, "rating": 5.0, "text": "Robby is the BEST driver! He's super fast, incredibly friendly and takes care of my orders!!", "pics": null, "resp": {"time": 1554698178794, "text": "Thank you Jen , your review pushed Robby to Driver of the month!"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "104638277534709216180", "name": "Kesher Topaz", "time": 1558830173971, "rating": 5.0, "text": "Outstanding service! Thanks for ALL you do!!", "pics": null, "resp": {"time": 1558837943809, "text": "Thank you for the kind remarks"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "111241052597525719388", "name": "Chelsea Eberhart", "time": 1558829518076, "rating": 5.0, "text": "KATS highly recommend, amazing family!", "pics": null, "resp": {"time": 1558837996020, "text": "Thank you , please try us again when you are visiting the area."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "102925643583440488610", "name": "Sherita Belser", "time": 1558840088429, "rating": 5.0, "text": "Excellent service! Professional, courteous, friendly!", "pics": null, "resp": {"time": 1558841263972, "text": "Thank you Sherita."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "102992049721903402099", "name": "Tee W", "time": 1558830461263, "rating": 5.0, "text": "Very professional service!", "pics": null, "resp": {"time": 1558837877983, "text": "Thank you TW for your business"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "108930556161162760652", "name": "Maurice Mercer", "time": 1530553763024, "rating": 5.0, "text": "Great Family-Owned food delivery company", "pics": null, "resp": {"time": 1530556845800, "text": "Thank you"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "102814510130115361857", "name": "Thomas Cox", "time": 1530553921176, "rating": 5.0, "text": "Wonderful service\nAlways early\nAlways courteous\nHighly recommend", "pics": null, "resp": {"time": 1530556836214, "text": "Thank you Thomas and we look forward to working with you again soon!"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "109997698205130266285", "name": "Kate Ferguson", "time": 1568494766369, "rating": 5.0, "text": "Great people, amazing service!!", "pics": null, "resp": {"time": 1568594844007, "text": "Thank you for trying out our service . We hope to see you again soon !"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "105541130937291054009", "name": "sherry deel", "time": 1536507793710, "rating": 5.0, "text": "I used Kats delivery to order from Ichiban.  Ordering was simple, received my food quickly and it was hot and fresh.  I will definitely be using their services again!!! I highly recommend Kats :)", "pics": null, "resp": {"time": 1536509839411, "text": "Thank you Sherry for the warm comments  . We look forward to serving you again ."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "110052781831799094263", "name": "Brittany W", "time": 1513267863832, "rating": 5.0, "text": "Excellent service. Highly recommend.", "pics": null, "resp": {"time": 1530556853645, "text": "Thank you"}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "100927579180381498273", "name": "Laurie Johnson", "time": 1558825500951, "rating": 1.0, "text": "If only the things that showed up at your house were actually the things you ordered :(", "pics": null, "resp": {"time": 1558827689453, "text": "Laurie good afternoon, We are sorry your order didnt go as planned. We actually dont have an order under your name, can you provide an order number and telephone so we may discuss with you and work with our restaurant partner to make it right. Look forward to talking with you soon."}, "gmap_id": "0x888925046807a5fd:0xa9be0a359e48d0f8"}
{"user_id": "101279426360644989288", "name": "Sound Buryer Music", "time": 1622571975474, "rating": 5.0, "text": "Diana was a very safe driver and kept good conversations!", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "104360718288824993215", "name": "Graham Heath", "time": 1619832171068, "rating": 5.0, "text": "Quick, fast service. The driver, Trey, was very professional. I especially appreciate the driver's call alerting me he was arriving in three minutes.  I am one of many old farts in Baldwin County with ambulatory issues. The call was a huge help.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "104371656142578105016", "name": "John Curry", "time": 1618335052401, "rating": 5.0, "text": "I called a few taxi from the list i had gotten from google looking for quotes. I used his website link and although he was very busy he was able to manage giving me a quote. His price was as much as $30 cheaper than his competition. He very much earned this 5 star review because he made it clear that every customer is worth best service. Im sure he always wants to give us his lowest fare possible so if you can, show love and tip if you can", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "108313927825632809197", "name": "Kevin Crowley", "time": 1620216655282, "rating": 5.0, "text": "Really appreciated the assistance I received and the affordable price considering the circumstances for my transport needs at 2AM.\n\nI'm very satisfied with this service and I'd recommend them to anyone looking for early morning moves.", "pics": null, "resp": {"time": 1621346755661, "text": "Thank you!"}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "102757246313336200531", "name": "Clayton Hoch", "time": 1619147188320, "rating": 1.0, "text": "I had called for a cab and he said that it would be 45 minutes and then so I took a shower and he said he called me twice from the driveway then when I tried calling him back he said don't ever call this number again and started getting an attitude so don't ever use this Cab Company disrespect and I'll never use this company again", "pics": null, "resp": {"time": 1619260806471, "text": "Sorry it didn't work out for you. We are experiencing very high demand with a shortage of drivers. We are working hard to make sure everyone has an opportunity to get a cab."}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "110327112589035763508", "name": "Anthony DePaolo", "time": 1618158332728, "rating": 5.0, "text": "On time everyone and hardly a wait. Drivers are friendly and the vehicles are well kept", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "114815882684776000615", "name": "Raggedy Apple", "time": 1621273833829, "rating": 5.0, "text": "Very friendly\nGot to me pretty quickly!", "pics": null, "resp": {"time": 1621346684870, "text": "Thanks! Glad we were there for you!"}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "111012680316142986947", "name": "Richard Caudell", "time": 1618442120707, "rating": 5.0, "text": "Great  drivers. Great tested.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "116438711477307083565", "name": "Eat Your Cereal", "time": 1610343592236, "rating": 2.0, "text": "Cost us $10 to go about a mile other than that it was meh", "pics": null, "resp": {"time": 1610377627825, "text": "Our minimum fare is $8... for senior citizens $6. Tipping is not required."}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "109663893404941017898", "name": "lynwood lewis", "time": 1593601168480, "rating": 5.0, "text": "Fast friendly service. I left the hospital having trouble walking and the driver was willing to help me get from the cab to my front door.", "pics": null, "resp": {"time": 1593605903721, "text": "Thank you! So glad that we could help!"}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "116578302594296120439", "name": "William “Whiskywillie” Hermecz", "time": 1609149885108, "rating": 5.0, "text": "A little  too expensive  for me  but if yo need a ride  not too far  the time is with bay side taxi.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "107885246484168536951", "name": "Shaqona Byrd (NANK!!)", "time": 1582465873034, "rating": 5.0, "text": "Love them best taxi company around need a ride call Bayside", "pics": null, "resp": {"time": 1582469628740, "text": "We appreciate you!"}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "111956062813933827265", "name": "Bunny Elser", "time": 1600030026884, "rating": 5.0, "text": "They are always there in a pinch, and helped me when my car was totaled.", "pics": null, "resp": {"time": 1600034017303, "text": "Thank you! Always happy to help!"}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "100548585275046144328", "name": "Bradley Kelso", "time": 1610376654106, "rating": 1.0, "text": "way too expensive!!", "pics": null, "resp": {"time": 1610378889607, "text": "We are cheaper than other taxis around the area. We never use surge pricing. We were available when you needed us. That's why you called."}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "114132952741163973430", "name": "Lisa Melton", "time": 1493842518199, "rating": 5.0, "text": "Excellent service. Last minute call and they never hesitated. Courteous and professional from beginning to end. Keith provided a clean vehicle, safe environment and excellent conversation for my trip from Spanish Fort to Bay Minette. I would recommend to everyone and will use them again. Thank you for making my stressful day seem better.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "116295703143947042496", "name": "Ben Kannapel", "time": 1524547075637, "rating": 1.0, "text": "Bad service. I would give them a zero star , but that is not an option on Google. When they call you back generally they call from a known number, but this time was from an unknown caller over and over. Not only was the taxi driver rude over the phone when checking on the status but was also entirely off from his quote time. Honestly if you have other options I would recommend Bayside taxi as a last option.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "109512519618226750716", "name": "Laurie Turner", "time": 1537454844850, "rating": 5.0, "text": "Awesome  company they have one guy works in daphne during the day I is great.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "113892535208299458945", "name": "Ed Swann", "time": 1469749301024, "rating": 4.0, "text": "Always on time!  I use them a few times a month for work. Each driver takes a different route, but fare is about the same.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "113892535208299458945", "name": "Ed Swann", "time": 1469749301024, "rating": 4.0, "text": "Always on time!  I use them a few times a month for work. Each driver takes a different route, but fare is about the same.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "100503185553573014960", "name": "Vanessa Steinkamp Norfleet", "time": 1477694916551, "rating": 5.0, "text": "I had to use Bayside often after being released from the hospital while not able to drive. Overall the service was excellent. The drivers arrive in a timely manner and are courteous. As to be expected, some drivers exceed others in their willingness to open a door, help you get in and out, etc. The two stellar driver's, for my experience, were Tom and Danny. Both are exceptional people and good drivers. I will continue to use Bayside but will ask if either Tom or Danny are available first. Thank you, Bayside, for being prompt, courteous and helpful in my time of need.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "110714914477300526708", "name": "Brooks Foley", "time": 1495303358007, "rating": 5.0, "text": "Great service! Great drivers & receptionist & very friendly! On time every time!", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "115163964158932994618", "name": "Arthur Fryzel", "time": 1552766843428, "rating": 5.0, "text": "Showed up when i needed you guys in half the time.", "pics": null, "resp": null, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
{"user_id": "106729561546983142213", "name": "Appledroplarry", "time": 1498140297900, "rating": 1.0, "text": "Outrageous rates. Gouging. Avoid this company.", "pics": null, "resp": {"time": 1498142803449, "text": "Our metered rates are on file and regulated by the Alabama Public Service Commission.  The meter is there to prevent gouging.  We do not alter our rates or add hidden fees."}, "gmap_id": "0x889a6abb7e76be79:0xda6f9c04ec07fb7"}
