{"user_id": "111725852138716027054", "name": "jim taylor (jiMTV)", "time": 1579541653842, "rating": 5.0, "text": "Becca's classes have become a routine part of my life.  Her approach to yoga is encouraging, supportive and at times challenging.\n\nPractice Works is also a great venue. What they have done to this once vacant building is impressive.  There's a lot more than yoga going on here.  I encourage you to check it out.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMj1ItS6HF8wOanz-qNemuIGih8YJULj4nM8RIY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-YEyDY-TQjif4btgRbUF-e0kgY2gVSY_KcO4r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5rHQ4Kg03GS_ni_GjfdUvCzKSoBa3LywNlMnp=w150-h150-k-no-p"]}], "resp": {"time": 1579538109727, "text": "Thanks so much for the positive feedback Jim! We are really glad to have you as part of our community."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "105728864636783304203", "name": "Riann Nova", "time": 1629848824984, "rating": 5.0, "text": "Quiet, open, clean feeling work flex space", "pics": null, "resp": null, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "108639033531791544890", "name": "Eva Almeshal", "time": 1595886587498, "rating": 5.0, "text": "The organization I work with has hosted several team meetings at Practice Works over the last few months. The staff is incredibly helpful and friendly, and they always go out of their way to accommodate us and make sure that we can safely socially distance while meeting in-person. Since our team is remote, they also help make sure that our out-of-state attendees are able to virtually join us on Zoom without any audio/visual issues. It's always a pleasure coming to PW - from the friendly faces to the wonderful overall atmosphere/ambiance. This will continue to be our go-to spot for future meetings! Highly recommend!", "pics": null, "resp": {"time": 1595942381110, "text": "Thank you Eva for the kind words. We are honored to serve as the \"home\" for Coach Safely. We are looking forward too hosting your team again soon."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "118380884014251687585", "name": "Hamid Al-Dlaigan", "time": 1598331007483, "rating": 5.0, "text": "I booked Practice Works on short notice for an event of 25 people and they are absolutely phenomenal! Our team enjoyed their lobby space and the decor of their rented spaces are ideal for the look and feel we wanted for our event. The team was easy to work with and checked on us throughout the day. I can't say enough about how great this place is and how excellent they are to work with. If you are considering them I highly recommend using them.", "pics": null, "resp": {"time": 1598362464804, "text": "We were thrilled to be able to accommodate on short notice, Hamid. We love the energy you all brought to the building. We welcome you and your group anytime."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "111938749856143713119", "name": "Kevin Archer", "time": 1594043983259, "rating": 5.0, "text": "We held an event for 50+ people and the setting was perfect.  The staff was gracious and accommodating and the space was elegant and peaceful.  The event exceeded our expectations.  We will schedule many events here in the future and find ways to support Meredith and Becca.  Practice Works provides a very unique place for corporate trainings, meetings and events to go along with their vast offering of wellness services.  Highly recommended!", "pics": null, "resp": {"time": 1594049516572, "text": "Thank you, Kevin! We enjoyed hosting you and your clients. What a beautiful night that was indeed."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "102429860138176167924", "name": "Elizabeth Barbaree-Tasker", "time": 1590016232408, "rating": 5.0, "text": "Practice Works is a lovely and peaceful space. As soon as you walk in the door for a class or a meeting, it's easy to take a deep breath and transition fully into the reason for your visit. That's not an easy feat for a place where a variety of work happens! Whether you're working to achieve personal wellness or professional goals, you can easily do both here in a community of smart and dedicated practitioners. It's a great addition to the city!", "pics": null, "resp": {"time": 1590078130504, "text": "Thank you for your kind words, Elizabeth. We are happy to be part of your wellness practice!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "118031916410690672746", "name": "HereNowYoga Teacher Training", "time": 1595955730556, "rating": 5.0, "text": "HereNowYoga has hosted our 200 hour yoga teacher training at Practice Works for the past two years. The space is ideal to support our program and our students. We love the generous amount of common space so that our trainees can spread out and relax when they are there for a long training weekend. This year we have been able to take advantage of technology support at PW to run virtual and live sessions simultaneously and the variety of classrooms gives us the option to break into smaller groups. The space is always clean and beautiful and easy to access.", "pics": null, "resp": {"time": 1596045393408, "text": "Thank you Kim and Becca for coming back year after year. We so enjoy the love the HNY students bring to our space and community!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "116364947272359476756", "name": "Darlene L Wilson", "time": 1590076090173, "rating": 5.0, "text": "It's a great space! I like the atmosphere and the ease of use for services. The portal is a great way to schedule appointments and register for the classes that fit within my schedule. I like to be greeted with kindness and care. The staff is amazing. I've taken advantage of several services and all were good to me and for me. I will continue to use the services at Practice-Works. I love the package deals too! Big bang for my bucks...", "pics": null, "resp": {"time": 1590078196563, "text": "Thank you Darlene! It's always a pleasure to welcome you in to the building. We can't wait to see you again soon."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "108453146798033049326", "name": "Sommerville B. Johnston", "time": 1589825370271, "rating": 5.0, "text": "Step inside and feel the calm, clean, and healing atmosphere. Practice Works has given me a space for my private practice that supports more than just the external structure (getting out of the house, access to a printer, copier, excellent wifi, and a space to meet clients) but also, more importantly, supports my own wellness. The healthy food options, the calm and beautiful setting, the kindness and support of the staff, and the overall valuing of wellness permeates the environment. I feel better being there! And even during this pandemic, I benefit from being connected to a community of wellness practitioners, having access to a professional space for my Zoom calls and classes, and help thinking through  difficult decisions and aspects of adapting my business to the current community needs. I cannot recommend this space highly enough. Having lived in places like Asheville, NC and Boulder, CO before (both very progressive and health-minded communities), I am grateful to find such a unique offering in Birmingham, and believe that it supports the trajectory of the health and wellness industry for the Magic City.", "pics": null, "resp": {"time": 1589839092718, "text": "Thank you so much for your kind words, Sommerville! We are lucky to have you as a member!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "101660764670300414919", "name": "Roy C", "time": 1581389444827, "rating": 5.0, "text": "The staff, facilities, and classes offered at Practice Works are all top notch.\n\nI have found the meditation classes hosted and guided by Sheri Bagwell to be most beneficial on my path to overall health and well-being. She truly has a vested interest in perpetuating the highest potentials of everyone she encounters.  Highly recommended !!", "pics": null, "resp": {"time": 1581535141467, "text": "Thanks so much for your positive feedback! We are glad you're part of our Practice Works community!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "114103013730349578345", "name": "Patti Lovoy", "time": 1589914566752, "rating": 5.0, "text": "Whether attending a heavenly yoga class or having a small strategy meeting, Practice Works takes the stress away and offers soothing, welcoming, spotless accommodations. The environment itself is motivating. What a find in our downtown/southside community.", "pics": null, "resp": {"time": 1589919195296, "text": "Thank you, Patti. We loved hosting Children's Aid Society for your board committee meeting. We hope you'll make some time for a movement class on the back-end next time around!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "111784317645175629403", "name": "Valerie Thompson", "time": 1589464019900, "rating": 5.0, "text": "Practice Works is a coworking dream come true for wellness practitioners. I am an LPC and love the clean, warm, inviting coworking space to get my work done. The individual rooms for seeing clients are comfortable and soothing. The front desk staff is helpful and a kind first contact with my clients when they arrive. Co founders Becca and Meredith are innovative, supportive and just great people to know. They work to create community among the practitioners for connection and collaboration. I am so blessed to have found this!", "pics": null, "resp": {"time": 1589468994655, "text": "Thank you Valerie. We're fortunate to have you in our community!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "105066660703230860092", "name": "Linda Thacker", "time": 1564578243535, "rating": 5.0, "text": "Beautiful space. Excellent instructors offering multi-faceted types of yoga and meditation. Wonderful shared space for those needing a workspace yet not needing to rent everyday. The staff are all helpful and attentive to your needs.", "pics": null, "resp": {"time": 1564579737192, "text": "Linda, thank you so much for being part of our community! we are honored to support your practice."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "106834349602013325703", "name": "Joe Impello", "time": 1577651887449, "rating": 5.0, "text": "The perfect place in the ham for yoga and therapy. I recommend Beccas yoga classes or her customized private yoga sessions. She has been an inspiration and blessing in my life.", "pics": null, "resp": {"time": 1577724000329, "text": "Thank you so much for your positive feedback! We are glad to have you as part of our community!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "106695807344906139286", "name": "Dawn Marie", "time": 1581097608451, "rating": 1.0, "text": "Under no circumstances do I recommend taking classes with Sherry.", "pics": null, "resp": {"time": 1581437970448, "text": "Ms. Davis, we are grateful for all feedback, especially information that can help us do what we do better. Since you have not attended any classes at Practice Works, we are unable to relate your review to any experience here. We encourage you to contact us so we may understand and address your concerns directly."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "106107107680836545575", "name": "Susan Veenschoten", "time": 1568590126972, "rating": 5.0, "text": "Beautiful, peaceful place. Great people! Go check it out.", "pics": null, "resp": {"time": 1568639919040, "text": "Susan, thank you for being part of the Practice Works community! We are thrilled to hear your positive feedback, and look forward to  supporting your practice!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "112563139000548462799", "name": "Chancee Terry", "time": 1556384161071, "rating": 5.0, "text": "Absolutely amazing atmosphere. Great staff. Awesome class variety!", "pics": null, "resp": {"time": 1556548536720, "text": "Chancee, thank you for being  part of our story! We're thrilled to hear of your positive experience."}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "108639564495425420763", "name": "Dina Albert", "time": 1572026167917, "rating": 5.0, "text": "Delightful, clean environment. Serene!", "pics": null, "resp": {"time": 1572031911403, "text": "Dina, thank you so much for being part of the Practice Works community!"}, "gmap_id": "0x88891b3bba1e2911:0x6f5085a0212aa09f"}
{"user_id": "109117898834889906910", "name": "Joseph Prinzinger", "time": 1560740144282, "rating": 1.0, "text": "I've never been there.", "pics": null, "resp": null, "gmap_id": "0x88626e0661f4c055:0x5f4e21baae5dc9fa"}
{"user_id": "100352385949266855111", "name": "Edward Jimenez", "time": 1552285865010, "rating": 3.0, "text": "Redstone Arsenal Garrison HQ", "pics": null, "resp": null, "gmap_id": "0x88626e0661f4c055:0x5f4e21baae5dc9fa"}
{"user_id": "107787934727938286030", "name": "Chris Henke", "time": 1536230031344, "rating": 3.0, "text": "Redstone Garrison", "pics": null, "resp": null, "gmap_id": "0x88626e0661f4c055:0x5f4e21baae5dc9fa"}
{"user_id": "107430239254515214934", "name": "Kim Leousis", "time": 1625160577410, "rating": 5.0, "text": "Great meeting spaces. Super friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd4403720ed:0xdd71c0f2f2f55a60"}
{"user_id": "110728526392145054200", "name": "Christopher Ray Coleman", "time": 1614291324511, "rating": 5.0, "text": "The start up and entrepreneurship culture  in Mobile, Al will forever be changed for the better because of this space. Great women lead staff, great community of members, great security, and great looking space!", "pics": null, "resp": null, "gmap_id": "0x889a4fd4403720ed:0xdd71c0f2f2f55a60"}
{"user_id": "108190625022313355233", "name": "Marian Moesinger", "time": 1624978354342, "rating": 5.0, "text": "Very friendly place. Wonderful animals here.", "pics": null, "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "107117426943737102502", "name": "Mr Mane", "time": 1541800517181, "rating": 3.0, "text": "A beautiful building right in the middle of downtown the couple of photos are the view from the 25th floor. The 25th floor is corporate security offices and training I was there for training so I will give it three stars just because of the beauty of the building and some of the very large expensive tables that they have in this building.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdmrxXKZqk5O1Gpk2r0htIG9xgJApejquzofwk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM9DBH5s3O3DWE48ZIrKUtxwQREb8qzqY5Mh8Ae=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "101679767154182876952", "name": "Harrison C. Davies", "time": 1577050727605, "rating": 5.0, "text": "This is a really cool coastal landmark and has some very rich history not to mention some unique records. Interior and exterior have a modern yet classy feel and it’s a great icon for Mobile and the state of Alabama as a whole! #mobile #alabama #battlehousetower #skyscrapper #interstate10 #gulfcoast", "pics": null, "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "118334491184307214732", "name": "Deedee Webb", "time": 1489584693247, "rating": 5.0, "text": "This was a great experience!!! Vinita and Erica, were wonderful, so helpful...They took wonderful care of our group.  We were at Regis for about 2 months the offices and restrooms were always very clean. Their security procedures made you feel that your work area was very safe.  I would recommend Regis to anyone that needs space for their business", "pics": null, "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "111955371426015162499", "name": "Doctor Pepper", "time": 1569696378026, "rating": 5.0, "text": "Awesome view and a great customer service", "pics": null, "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "110784824502848509188", "name": "Roberto Singleton", "time": 1482013848494, "rating": 5.0, "text": "Great customer service, and the view is amazing! They are located in the tallest building in Alabama.", "pics": null, "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "106838767809453404476", "name": "Amber Adams", "time": 1561031922848, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x889a4fd9bf4d1dd7:0x2defb47f94e4639f"}
{"user_id": "106374975853617046788", "name": "Cheryl Dempsey", "time": 1602159546027, "rating": 1.0, "text": "I have thought about looking into this place for months. They must have a security issue. They were rude and unwelcoming. Not only did they not want to unlock the door but I was told their restrooms are for members only.", "pics": null, "resp": null, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "107314062844493439902", "name": "Jared Budlong", "time": 1492706367838, "rating": 5.0, "text": "Great space for creatives to co-work and have community!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMaYJjAOwJF9eDJ9VtFlslxEnen8T7M0XYtVn9-=w150-h150-k-no-p"]}], "resp": {"time": 1492708292003, "text": "Thanks Jared!"}, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "115516255307912005679", "name": "Kirsten Rand", "time": 1519689120046, "rating": 5.0, "text": "Joining the “yard” is hands down one of the best moves I’ve ever made for my business. I had outgrown my home office years ago and needed a professional work environment appropriate for the needs of my growing business. It’s a well designed, flexible, extremely well run and stimulating environment that has catapulted my productivity, energized my team and I, and given me a professional homebase to operate from. I’ve been a member for two months now and, frankly, can’t imagine how I functioned before. Bonus: I’m surrounded by friendly, creative, and entrepreneurial folks, unlimited coffee, and occasional visits from Stacy and Johnny’s two irresistible dogs. A win for my business on all fronts!", "pics": null, "resp": {"time": 1519691811560, "text": "Thank you Kirsten! We are so glad that you've joined the Yard family!"}, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "114987054998748390874", "name": "Abby", "time": 1535061716284, "rating": 5.0, "text": "I am so thankful to be a part of the Container Yard community! Everyone here is brings a unique aspect to the Yard making this place an enjoyable place to come to. I couldn't think of a better place to work.", "pics": null, "resp": {"time": 1535062482136, "text": "Thanks Abby! We love having you in the Yard family!"}, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "103580893619304911791", "name": "Christine LaGrassa", "time": 1535331844199, "rating": 5.0, "text": "I love container yard! Great spot to meet driven people and get work done.", "pics": null, "resp": null, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "113370273796540888556", "name": "Darnisha McCants", "time": 1560337965816, "rating": 5.0, "text": "Awesome. Beautiful place and very friendly people.", "pics": null, "resp": {"time": 1560352073324, "text": "Thank you so much!"}, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "105936335353132913727", "name": "Rhonda Smith", "time": 1549853196781, "rating": 5.0, "text": "Super neat love having meeting here", "pics": null, "resp": null, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "116489354040777497648", "name": "Gene Townley", "time": 1490356486294, "rating": 5.0, "text": "Great place for meetings. Amazing Internet upload speeds", "pics": null, "resp": null, "gmap_id": "0x889a4e321b245125:0xa38797fa6cdaa9de"}
{"user_id": "105559311772144271576", "name": "Seth Allen", "time": 1603302650073, "rating": 5.0, "text": "I love creating at Vibestreet! This studio is a clean, conveniently priced, centrally located, and social inclusive photographic resource that I would encourage anyone to check out. The owner is attentive, positive, accommodating and enthusiastic about the goals of artists who come through their doors. The online booking is a huge time saver and the wide range of backdrop options and available lighting equipment provides a level of hospitality I have yet to encounter in my many years of renting studio time across this country. If you are a studio photographer or someone looking to create a podcast, Vibestreet is the place to be.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMNllcv_YhF46qIw3gA9xYj1E4q2fmQn7JT8mdO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "115848485691121140931", "name": "J.Cxrter", "time": 1615001936179, "rating": 5.0, "text": "This place is just amazing! It’s perfect for up and coming photographers and content creators! I highly recommend booking here!!", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "106826453108567824231", "name": "Devin Wyatt", "time": 1592930936786, "rating": 5.0, "text": "My clients and I had a great time at Vibestreet Studios. The studio was well organized, clean and the owners offered us exceptional service. I would recommend this studio to anyone. Booking is easy and there are no hassles.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMvrmSHk4eRYhqibCHiz25rRh03Wsx6pTl6Y1tv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnveOqvyerHAyiYRbEMbOxca7D9qzt7wy-tU5V=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "113695893233315413391", "name": "Renata Brooks", "time": 1592939649235, "rating": 5.0, "text": "Great studio. Great customer service. This is the perfect place if you need a studio for your photography clients. The process for booking is very easy. If you haven't already, definitely check them out!", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "104505284587062700505", "name": "Jaye Washington", "time": 1592967698864, "rating": 5.0, "text": "The staff at Vibestreet Studios is always professional, welcoming, and accommodating! When I am in town I enjoy using the studio to record for my podcast and I am always met with a smiling face and helping hand. I highly recommend patronizing Vibestreet Studios! Plus, it is a black-owned business providing a safe space for fellow creatives.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "110124552239020441746", "name": "David Sikes", "time": 1593215385034, "rating": 5.0, "text": "Great space for portrait work and any other small studio photography or video. They also offer a great-sounding podcast studio that we can't wait to put to use! Kind and helpful people here, great hourly and day rates for booking, can't wait for our next session.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "104245351805359625183", "name": "Christopher Mosley", "time": 1592935609798, "rating": 5.0, "text": "Very nice vibes at an affordable price. Studio was clean and staff was friendly. They had an excellent playlist of music playing during our shoot. 👌🏽🙌🏽 Definitely will be returning soon to shoot again. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "115819853601234332806", "name": "Marc L.", "time": 1592974817047, "rating": 5.0, "text": "My friends and I have recorded are podcast at the studio several times and we really enjoyed it. The set up is great, very professional and they quickly send the recording session. Can’t wait to use the studio again.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "103707738860740791153", "name": "William E. Black III", "time": 1591735974615, "rating": 5.0, "text": "I have worked at Vibestreet Studios several times and every time has been great. Great people, great equipment, everything you need to get the job done!!!", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "109369576739329420495", "name": "Halei Moss", "time": 1593306658716, "rating": 5.0, "text": "Exceptional service and the staff was very helpful and welcoming. I will definitely book with them again!", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "115013321257777459923", "name": "The KickBack 205", "time": 1593116249363, "rating": 5.0, "text": "On top of the helpful staff, it is a great place for the community! Hands down the best studio in the 205.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "117390023515916266346", "name": "Two Fifths Productions", "time": 1592169568380, "rating": 5.0, "text": "Great staff with a great environment to work in. Well recommended studio with affordable pricing.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "114908839853969962111", "name": "Angela Ward", "time": 1619491616908, "rating": 5.0, "text": "Loved it.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "112314039720202174653", "name": "Kirk Jordan (KirkTheGreat)", "time": 1591725430693, "rating": 5.0, "text": "My go to studio for rentals!  Great staff & great environment!", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "104031566206443540600", "name": "Ken Paul", "time": 1570894675356, "rating": 5.0, "text": "I love it there, nice people. Very helpful, book with them you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "112996254858728913939", "name": "Rylie Hightower", "time": 1573373336002, "rating": 5.0, "text": "Owners are incredible and the cocktails are outstanding. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "105303508430544195373", "name": "Travis", "time": 1591726752562, "rating": 5.0, "text": "10/10. Would recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-Qd-Sa3Pj8_O19_Jpsdqt8IKPLtoQ9Ib_Jeom=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b97354f2b2f:0xa2a09e732aa6b569"}
{"user_id": "113584932532031545188", "name": "ALLAN BARNETT", "time": 1622070019047, "rating": 4.0, "text": "Nice facility inside and out", "pics": null, "resp": null, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "116885067136523667789", "name": "Jim Weaver", "time": 1608317048902, "rating": 1.0, "text": "Service is terrible, receptionist may or may not be around to let you in your room.  Billing is a mess and trying to cancel is nearly impossible.  I have asked local manager to cancel two weeks ago, then I got billed for January this week, when I called she said \"oh yeah you need to do that on the website.\"\n\nIn response to your reply............we contacted customer service 5 days ago and NO RESPONSE!  How about a number of email address of a human that can actually do something about this?", "pics": null, "resp": {"time": 1608109199590, "text": "I'm sorry if there've been any charges made in error. For any fees that are not stated in your contract, we'd be happy to help resolve these. Please send us your company reference number and we'll ask Customer Service to contact you. Thank you."}, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "114799918412737129682", "name": "Eric andrews", "time": 1595446841700, "rating": 1.0, "text": "The worst service I have ever received from any business.They Lied to us and cost us thousands of dollars. We ended up homeless. The york county south Carolina office is absolutely terrible.  We tried to buy a house using a V.A. loan we were lied to about pre approval for over a month. We broke the lease on our apartment and packed up all our belongings. The day of closing they called us and said they couldn't approve us till September. My wife is a disabled veteran and now 4 months pregnant. Because of the incompetence and blatant dishonesty of mortgage right we were homeless for the 4rth of July. We recently found out from our new loan company that (M.R) never even started the V.A. application process. They knew from day 1 that they wouldn't approve us but still lied to us for a whole month taking our appraisal, and Ernest money. The treatment we received was out right despicable the agents at their South Carolina office. Made us loose a substantial amount of money 1000.00 for the U-haul alone. They will be hearing from our attorney about that.\nWe will be reporting them to the B.B.B and we are currently in the process of getting this company black listed from the V.A. So no other service members are subjected to these kind of scumbagg business practices..\nWe are also contacting every news outlet in the following counties. York,lancaster,Chesterfield and Mecklenburg.\nLoan company takes advantage of 22 yo pregnant veteran resulting in homelessness on the 4rth of July...what a headline..", "pics": null, "resp": {"time": 1595579925913, "text": "Thank you for your review, Eric. Although it sounds like this may not be about Regus office spaces? If this based on one of the companies that uses Regus, please speak to them directly."}, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "108796717497168994577", "name": "December Sixx", "time": 1566049771215, "rating": 5.0, "text": "Very nice place.  I had to visit my insurance agent there.", "pics": null, "resp": null, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "114494392673114240412", "name": "Tiffany Perz", "time": 1598944953447, "rating": 5.0, "text": "Nice people", "pics": null, "resp": {"time": 1598947542620, "text": "Thank you for the 5 star review!"}, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "110688409937061721696", "name": "wendy roberts", "time": 1511826355669, "rating": 5.0, "text": "Ask for Shelley. She is a fantastic manager.", "pics": null, "resp": null, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "103606417299462128592", "name": "Aaron Gregory", "time": 1554808925523, "rating": 5.0, "text": "Great meeting location, helpful staff", "pics": null, "resp": null, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "117470218272626253230", "name": "Jonathan Barbee", "time": 1505279448609, "rating": 5.0, "text": "Great services and nice staff.", "pics": null, "resp": null, "gmap_id": "0x8889179f01f7c3cf:0xb0b7763764924919"}
{"user_id": "101774840332636892463", "name": "Brandy Olander", "time": 1623805810840, "rating": 5.0, "text": "Great office space.  Kristine is wonderful!", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "112488113589993227059", "name": "Rashid Swanson", "time": 1497555824004, "rating": 4.0, "text": "My girlfriend has her office for her non emergency medical transport company here called Angena healthcare services,  and I work here with a billboard company called smart safe systems, and they have miscommunications between corporate and the local branches sometimes, but other than that everything is perfect.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMJ1RP9U6tzd7dvvBhsOd-ByU6CH9BgtY6Lbyyd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "115984377264550655419", "name": "Kristine Jones", "time": 1535404042893, "rating": 5.0, "text": "I love having my office with Regus! It is clean, professional, and friendly. My clients love the building and interacting with the staff. I am proud to tell people in the community I am in a Regus space in one of the most beautiful buildings in downtown Montgomery. As a new business owner, I am happy I made the choice of starting my business in a Regus office!", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "102230906601179812103", "name": "Frank Truncali", "time": 1535402404976, "rating": 5.0, "text": "My experience so far with Regus has been great.  The staff is great and I love the building.  It's a good value for office space in downtown Montgomery.", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "105464823127246205415", "name": "Cheryl Phillips", "time": 1474597948325, "rating": 5.0, "text": "The staff is simply amazing and helpful! Definitely a great place to have your office located in. The decor is very nice, clean, and modern. You will feel like a 5star business and your customers will too.", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "114974279188732085132", "name": "Jeffrey Prescott", "time": 1534015245565, "rating": 5.0, "text": "So I went to look at a new office space for my work and I was nervous and new and amiee and Mallory were awesome in helping me pick the right plan for me I got a space and I love it  keep up the great work guys", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "104968488764931588731", "name": "JAMM Resources LLC", "time": 1525389826191, "rating": 5.0, "text": "Regus is wonderful! Nice office space, amenities, & staff. I’m so glad I found an all in one office space!", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "106189732927667010552", "name": "Ms Always Classy.", "time": 1512522700619, "rating": 5.0, "text": "This is a very secured, beautiful building. From the time you walk in, until the time that you leave, you feel a sense of security.", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "106046629375134758382", "name": "Clarissa Harris", "time": 1523796818843, "rating": 5.0, "text": "Beautiful Place! !", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "109887552740826404942", "name": "Marcus Jones", "time": 1543358044012, "rating": 5.0, "text": "Very friendly staff!", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "113582099538231230013", "name": "Don Johnson", "time": 1487630930186, "rating": 2.0, "text": "another RSA state owned office complex.", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "112906315350669729412", "name": "Shatia Miller", "time": 1470962432811, "rating": 5.0, "text": "Amazing staff.", "pics": null, "resp": null, "gmap_id": "0x888e81713b88cdcb:0xfe8eda384b9e7ff1"}
{"user_id": "116823496708539789800", "name": "Myles McKee", "time": 1608581043378, "rating": 5.0, "text": "If you are looking for a super clean, friendly environment to work from look no further. This space also offers seeds coffee included in its membership. Such a great space and completely recommend", "pics": null, "resp": {"time": 1609173071085, "text": "Thanks Myles!"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "110278811319784534751", "name": "Nathan Herum", "time": 1599256718334, "rating": 5.0, "text": "Love the Hub. Even before Covid I worked fully remote for my employer. The Hub provided a comfortable, quiet, productive space away from home. A huge help to fight the isolation and claustrophobia that accompanies being at home all day...every day...forever. Seriously though, it's a great environment, the people are awesome, and I love go there for a change of scenery and to recharge.", "pics": null, "resp": {"time": 1599579499347, "text": "Hi Nathan!  We love having you as a part of our Hub Community.  Thanks for leaving us a review!"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "115917465530717726639", "name": "Jasmine Densmore", "time": 1569254359019, "rating": 5.0, "text": "I recently hosted a meeting at the Hub Coworking in the conference room and everything was perfect! The space is beautiful and all of my guests commented on how nice it was. The staff is wonderful and provided excellent customer service;  our meeting was accommodated very well. I will definitely host more events at the Hub in the future!", "pics": null, "resp": {"time": 1569256787143, "text": "Thank you Jasmine, we enjoyed hosting you and your guests!"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "107243077826401740142", "name": "Sam Gosey", "time": 1566480329178, "rating": 5.0, "text": "Such a great place to work! So much life coming out of this one place. So many friendly, creative, diligent co-workers that inspire you to work just as hard. Great environment, great coffee, and has everything you need!", "pics": null, "resp": {"time": 1566507466943, "text": "Thanks for being a part of The Hub, Sam!"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "107897410713791349150", "name": "Ben Strout", "time": 1565116454184, "rating": 5.0, "text": "Love this place! Loving community filled with a diverse group of driven entrepreneurs. I enjoy working here every day!", "pics": null, "resp": {"time": 1565120917770, "text": "Thanks Ben!  We love having you as part of The Hub Community."}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "111582211693574919187", "name": "Taproot Landscaping", "time": 1566399467607, "rating": 5.0, "text": "The Hub is an awesome work environment! The balance of hospitality and community atmosphere, combined with a creative and productive setting is very hard to find. So thankful to The Hub staff for creating a great place to work!", "pics": null, "resp": {"time": 1566507705121, "text": "Thanks Taproot!  We love having your company work out of The Hub, and we're so glad it has been a beneficial place for your business."}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "112269762399136762337", "name": "Randy Martin", "time": 1566399625837, "rating": 5.0, "text": "Awesome people! Good looking space, all ways great people to meet with an added bonus of being right next door to the best coffee in town!", "pics": null, "resp": {"time": 1566507587825, "text": "Thanks for the feedback, Randy.  You're one of the awesome people who help make our community great."}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "105046292298930777731", "name": "Jessica Latten", "time": 1604387738054, "rating": 5.0, "text": "****edit: Just checked out the new website. Looks amazing. Great offers had it makes sense during Covid. *****\n\nThe website says that day passes are available in February but it’s the end of March. Also, several links on the website aren’t working. I’ll change my rating once it’s updated.", "pics": null, "resp": {"time": 1553374475717, "text": "Hi Jessica.  Thanks so much for alerting us to the oversite on our Day Pass purchasing page!  The issue has been corrected and you are now able to purchase a pass.\nWe also checked our links to make sure they are working, and they all seem to be. However, if you can email us at ashley@hubbham.com with specifics about the links that weren’t working for you, we will be happy to double check them.\nThanks, again for your feedback.  We hope to see you at The Hub soon!\nKind Regards,\nThe Hub"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "109757202862142131682", "name": "Jeff Huey", "time": 1566485393732, "rating": 5.0, "text": "Amazing work place environment and the people are top notch! Located next to the best coffee shop in town, can’t really beat that!", "pics": null, "resp": {"time": 1566507433450, "text": "Thank you Jeff.  We love having you work out of The Hub!  And, we have to agree; we love having SEEDS Coffee as our neighbors.  Truly the best coffee in the city : )"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "104911216284310115908", "name": "Charlie Peters", "time": 1545166322692, "rating": 5.0, "text": "The Hub is an excellent meeting place. Their team was very helpful -- and flexible -- with coordinating our work offsite (we had about 30 people). We'll be coming back again. Two thumbs up!", "pics": null, "resp": {"time": 1545166750226, "text": "Thank you so much Charlie!  We enjoyed having you and your team join our community for the day!  We hope to host you again some time soon."}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "114821974498135560980", "name": "Marcy Graben", "time": 1566504977491, "rating": 5.0, "text": "There is a natural light hearted feel in the space, which is really enjoyable to be a part of!", "pics": null, "resp": {"time": 1566507322790, "text": "Thank you Marcy!  You are a big part of The Hub being enjoyable!"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "113958562549266071004", "name": "Christopher Brown", "time": 1546525849243, "rating": 5.0, "text": "Best co-working space in Birmingham!", "pics": null, "resp": {"time": 1516211994411, "text": "Hi Chris!  We loved having you join our community for the day with a Hub Day Pass! We hope to see you again soon : )"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "103825707532627521342", "name": "Hank Womble", "time": 1499712010852, "rating": 5.0, "text": "Amazing concept, great things are going to come out of a space like this!", "pics": null, "resp": {"time": 1500914978719, "text": "Thanks so much for your review Hank!  We appreciate your positive feedback about our community and space.  Happy Creating - Ashley"}, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "113250668018797240993", "name": "Christopher Brown", "time": 1546575955335, "rating": 5.0, "text": "Always love working here.", "pics": null, "resp": null, "gmap_id": "0x88891ec91f37d40d:0x44fcecdda11f6210"}
{"user_id": "113806105108467228833", "name": "Jon Vaughn", "time": 1548803546887, "rating": 5.0, "text": "Very sweet girl that helped us demo the device.  Great experience.", "pics": null, "resp": null, "gmap_id": "0x88891bd66b4fb251:0xc4f81b8bb7c130ae"}
{"user_id": "113560465367854587664", "name": "BamaLen G.", "time": 1554918897011, "rating": 4.0, "text": "Friendly people", "pics": null, "resp": null, "gmap_id": "0x88891bd66b4fb251:0xc4f81b8bb7c130ae"}
{"user_id": "105018332772346377045", "name": "Suanne Nutter", "time": 1497471566091, "rating": 5.0, "text": "Beautiful office space", "pics": null, "resp": null, "gmap_id": "0x88891bd66b4fb251:0xc4f81b8bb7c130ae"}
{"user_id": "103496888232787860213", "name": "christa lodico", "time": 1501540521671, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x88891bd66b4fb251:0xc4f81b8bb7c130ae"}
{"user_id": "111776540060656452230", "name": "Mark Branson", "time": 1600964004402, "rating": 1.0, "text": "I have been a customer for several years. They have recently let go of everyone that used to run this location. Service has disappeared, communication has also vanished. Despite not adhering to the level of professionalism and service promised, they are refusing to let me out of a contract that was subsequently inflated without explanation. Please avoid at all costs!", "pics": null, "resp": {"time": 1601020815326, "text": "Hello Mark. I'm sorry to hear this. Please can you email customer.service@regus.com with your account number, along with details of your experience. A member of the Customer Service team will be in touch with you shortly. Thank you."}, "gmap_id": "0x888916147b9e7599:0x8c2412ce3eff959d"}
{"user_id": "103298949738277945268", "name": "Gary", "time": 1553456612842, "rating": 5.0, "text": "Nice, quiet place to do business. Easy to get too / convenient location.", "pics": null, "resp": null, "gmap_id": "0x888916147b9e7599:0x8c2412ce3eff959d"}
{"user_id": "104328738089275456562", "name": "dingo Rex", "time": 1558994504786, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888916147b9e7599:0x8c2412ce3eff959d"}
{"user_id": "104093809830594862489", "name": "rebecca anderson", "time": 1537708661574, "rating": 5.0, "text": "Fantastic company", "pics": null, "resp": null, "gmap_id": "0x888916147b9e7599:0x8c2412ce3eff959d"}
{"user_id": "112847773737982277804", "name": "Sarah Bragg Brown", "time": 1584059329603, "rating": 5.0, "text": "Did the Intro to Ceramics with Marika and it was so fun! She was a great teacher and was very patient in explaining things multiple times to newbies. I think the class series is a great value for 8 hours of instruction and getting 2-3 pieces to take home at the end. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "113655829312245464515", "name": "MeetmeAtSunset Darlin", "time": 1522255806695, "rating": 4.0, "text": "Just a good melting pot of creativity plus with ice cream w/waffle cone on the side", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqTEjxzHr8pee_rlVhzhqaieXDOTVdbI3Ln0qM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "102328131097725754448", "name": "Tim Swafford", "time": 1516677465109, "rating": 5.0, "text": "Great experience!  The instructor was excellent!  Very informative.", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "109784839893875136625", "name": "Michael Annunziata", "time": 1488744208298, "rating": 5.0, "text": "Knowledgeable and patient teacher guided us through making our first bowls in the pottery class. Fun!", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "103825707532627521342", "name": "Hank Womble", "time": 1483410731103, "rating": 5.0, "text": "Great service! Cool space with a shop", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "116606214900524099402", "name": "Brie", "time": 1518295826163, "rating": 5.0, "text": "Great place to take ceramics class", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "117567342067626393965", "name": "sean williamson", "time": 1506997377707, "rating": 5.0, "text": "If you want to learn how to do \"something\" this is the place!!! Woodworking, multimedia, ceramics, and welding are the staples.", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "111202448784244011251", "name": "Greg Williams", "time": 1503923984801, "rating": 4.0, "text": "Neat place.", "pics": null, "resp": null, "gmap_id": "0x88891a51126d11b5:0xdd5d10bdd66192e2"}
{"user_id": "103003503251264994116", "name": "Matthew", "time": 1563913728315, "rating": 5.0, "text": "Great place to work if you are looking for co-working space!", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "107790030348804776779", "name": "Mind Magnet", "time": 1471640403881, "rating": 5.0, "text": "My team has been working from the Exchange for almost three months, and it has been a great experience. The accommodations are great, Todd has been very helpful, and the people we've met and work alongside are inspirational. The Exchange is the hub for great ideas and thinkers.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "109235976929420243752", "name": "david clark", "time": 1522341687320, "rating": 5.0, "text": "yeah the environment is cool, but the real key is the fact that everyone here is super helpful and friendly. So, if you want to be welcomed in to a place like you are family then come check this place out!", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "116567212001426953147", "name": "Brandon Morris", "time": 1536200131994, "rating": 5.0, "text": "Love this place as far as co-working goes... Developed great working relationships, friendships, networking, coffee, conference rooms...", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "104877287252535848367", "name": "Jonathan Coffey", "time": 1454537332611, "rating": 5.0, "text": "Very impressed with the professional environment and culture that comes with it. Has several options and plans to accommodate creative minds to come together and make their goals a reality.", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "116622000086429302519", "name": "Chris Yokley", "time": 1503632861758, "rating": 5.0, "text": "Amazing place to network and grow your business", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "100630684416599733335", "name": "Jeff Hall", "time": 1489936650065, "rating": 5.0, "text": "Very positive environment with lots of opportunities offered", "pics": null, "resp": null, "gmap_id": "0x889a4fd0eb9e1661:0xddeecf68908b3901"}
{"user_id": "102816735912843632799", "name": "David Thomas", "time": 1544200371185, "rating": 4.0, "text": "Clean, attractive, well run location. Very accommodating.", "pics": null, "resp": null, "gmap_id": "0x88626ebecd427547:0xad26901ca25582b0"}
{"user_id": "105596648073087485647", "name": "Thomas Holman", "time": 1619405458418, "rating": 5.0, "text": "Just watched the HBO special. Hope the business is successful!", "pics": null, "resp": null, "gmap_id": "0x888c9338510e6a9b:0x294fdde6ddef36e6"}
{"user_id": "103263449180217731567", "name": "Michael Booker", "time": 1532024007564, "rating": 5.0, "text": "What an awesome concept and place! Clean, neat, professional! Sara is super helpful. So glad we found this place!", "pics": null, "resp": null, "gmap_id": "0x888c9338510e6a9b:0x294fdde6ddef36e6"}
{"user_id": "100761976214908395391", "name": "Vic Robertson", "time": 1490471097961, "rating": 5.0, "text": "Great merchandise, great prices, friendly and fast service.", "pics": null, "resp": null, "gmap_id": "0x88626620fc1d943f:0xb0f4dce566519b45"}
