{"user_id": "108954636529322973847", "name": "Jorge Garcia", "time": 1613194600248, "rating": 5.0, "text": "Great service, nice equipment, hard working people, well recommended..", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "114057526449775374555", "name": "Natalio Garzon", "time": 1613599697541, "rating": 4.0, "text": "(Translated by Google) Excellent service\n\n(Original)\nExcelente servicio", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "108954636529322973847", "name": "Jorge Garcia", "time": 1613194600248, "rating": 5.0, "text": "Great service, nice equipment, hard working people, well recommended..", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "114057526449775374555", "name": "Natalio Garzon", "time": 1613599697541, "rating": 4.0, "text": "(Translated by Google) Excellent service\n\n(Original)\nExcelente servicio", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "108954636529322973847", "name": "Jorge Garcia", "time": 1613194600248, "rating": 5.0, "text": "Great service, nice equipment, hard working people, well recommended..", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "114057526449775374555", "name": "Natalio Garzon", "time": 1613599697541, "rating": 4.0, "text": "(Translated by Google) Excellent service\n\n(Original)\nExcelente servicio", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "108954636529322973847", "name": "Jorge Garcia", "time": 1613194600248, "rating": 5.0, "text": "Great service, nice equipment, hard working people, well recommended..", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "114057526449775374555", "name": "Natalio Garzon", "time": 1613599697541, "rating": 4.0, "text": "(Translated by Google) Excellent service\n\n(Original)\nExcelente servicio", "pics": null, "resp": null, "gmap_id": "0x887d4f7a7fafb945:0x47a89c1d3f755f41"}
{"user_id": "100118297789651036492", "name": "Christopher Lindsey", "time": 1582306278380, "rating": 5.0, "text": "Jim is knowledgeable and really funny.  He is focused on the work. My hydraulics come here to be repaired. I wouldn't even consider going any other place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlyHJ6SnK82m2GdnevK1rmuYDd3OGwoTQnJrnm=w150-h150-k-no-p"]}], "resp": {"time": 1582488729468, "text": "Thank you Chris!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "104347323201840019139", "name": "Krash Hamilton", "time": 1615420636763, "rating": 5.0, "text": "Great people that are dedicated to perfection.", "pics": null, "resp": null, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "113860212678563616873", "name": "Blake Powers", "time": 1544913617783, "rating": 1.0, "text": "Price  gouging at its best!!!  They had one guy working 5 hours of wo $1900!  On top of that they were supposed to meet us at 8:00 AM on Saturday morning and showed up at 11. It cost us a whole day of work.  Save yourself by not making this mistake !  The job should’ve been $400.  I’m taking this to the better business bureau.", "pics": null, "resp": null, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "117257719537791730808", "name": "Eddie Kiser", "time": 1547634378938, "rating": 5.0, "text": "Great people to have working for you. Sam was an excellent help after hours got us back going quick. No one eles will get my business while working in this area.", "pics": null, "resp": {"time": 1542441708306, "text": "Thank you.  I will tell Sam of your kind words!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "109788833804602548473", "name": "Bill Yancy", "time": 1542308383408, "rating": 5.0, "text": "Just excellent service. I left my backhoe's leaking arm cylinder here and JimPam had it ready for me in 2 days, and at a better price for new seals than I've EVER gotten. It works like brand new now, Jim's experience speaks for itself", "pics": null, "resp": {"time": 1542441862568, "text": "Thank you! I'm glad we were able to get you up and running quickly!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "108633932499594956087", "name": "Chuck Linderman", "time": 1507890905337, "rating": 5.0, "text": "They do jobs nobody else can. The Hydraulic manifold on my Russian Belarus 250AS was in need of an overhaul. Every where I took it said trash it, buy another or wouldn't even consider attempting to rebuild it.\nJim was able to do the job for a fair price and saved me a lot of time and money. Check them out !!", "pics": null, "resp": {"time": 1508020597577, "text": "Thanks Chuck! It was a pleasure meeting you, and thank you for the comment!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "103383519642901167993", "name": "Robyn Z", "time": 1499361283042, "rating": 5.0, "text": "Excellent, friendly, professional, and very clean shop. And fast services. I won't go anywhere else for my hydraulic services. Thanks Jim your awesome!", "pics": null, "resp": {"time": 1499396078757, "text": "Wow!  Thanks so much!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "110991365419123013835", "name": "franklin mitchell", "time": 1512155864524, "rating": 5.0, "text": "Check with Jim before you buy the rebuilt kit from dealer. A friend told me about  Jimpam. Now ill tell all in need of repair where to go. Excellent  experience", "pics": null, "resp": {"time": 1512347205072, "text": "Thank you! We are usually able to buy parts, seals, etc for less than what our customers could buy the item for.  We pass that savings on to our customers.  Thanks for your review!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "114771110053736160301", "name": "Mike Smith", "time": 1513357198584, "rating": 1.0, "text": "Totally ruined a hydralic lift unit.Still to this day unable to use! Should have been told but i guess they were more into money than customer.", "pics": null, "resp": null, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "109552403233999475165", "name": "Mike S", "time": 1491795315800, "rating": 5.0, "text": "Best tech in the southeast. If no one else can do it, Jim can!", "pics": null, "resp": {"time": 1491847795985, "text": "Thank you for taking the time to say!  We appreciate your business!"}, "gmap_id": "0x889292d2c8c6584b:0xf4701c6f3fcd43f"}
{"user_id": "113657827668503857700", "name": "Ricky R.", "time": 1629393342712, "rating": 5.0, "text": "Very professional and friendly team.  Quick to respond and flexible. Highly recommend.\n\nJ&H Tree service made cutting 50 ft pines, look easy.  Keep up the great work.", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "100100913501251150861", "name": "Kitty Cobb", "time": 1594930340082, "rating": 5.0, "text": "J&H Tree Service came out to my house and removed over 50 oak and pine trees on my property. These guys were very professional and know what they are doing! They have a great work ethic and did my job in a timely manner and I was absolutely pleased with their work! You cannot ask for a better tree service. I HIGHLY recommend them!!! I won't hesitate to use them again.", "pics": null, "resp": {"time": 1594939453861, "text": "Thank you very much for that review Kitty! That review means so much to me and I love all of my customers! I strive for excellent customer service and professionalism. We work so hard to make sure that our customers are taken care of and give them our best each and every time. We take steps to make sure that we are safe and complete the job 100% without any damage. Thank you again! We look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "107771090023995899588", "name": "Lisa Bouier", "time": 1594087126245, "rating": 5.0, "text": "This tree service was very professional with their services. The guys were very informative about the job for someone that knows nothing about removing trees off  their property these are the very BEST guys to deal with. They were very nice and knew exactly what they were doing. They informed me of any troubled spots or diseased trees on my property. They took down 3 pines and cleaned out my fence line that also had some trees there. You wouldn’t go wrong with choosing this company to get the job done quickly and efficiently... I am very pleased.", "pics": null, "resp": {"time": 1594089630059, "text": "Thank you very much Lisa for your review! We take alot of pride in making sure our customers are educated about trees and know when to prune them up and remove them when necessary. We are very grateful for the business and take a lot of pride in professionalism and providing that absolute best service possible for our clients! We hope that you use our services again In the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "111845476678467113955", "name": "Barbaracarol 4", "time": 1599496843999, "rating": 5.0, "text": "I had 4 giant pecan trees removed stumps and all they are reasonably priced started the job quickly , the crew was professional and friendly. I am so pleased with their work. I highly recommend J&H tree service fantastic job guys thank you.", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102232550572337062732", "name": "Wade Becnel", "time": 1594500719706, "rating": 5.0, "text": "Josh and his professional team did a great job. This was repeat business for me since I hired them several years ago to remove several large trees in my yard and they continue to provide quality support. Strongly recommend them for any job you may have.", "pics": null, "resp": {"time": 1594525788848, "text": "Thank you very much Wade for your kind review! I'm so thankful that you are a loyal customer and keep using us for your tree service needs. We take alot of pride in that! We provide our customers with top notch quality work and professionalism. Our customers are our # 1 priority! We hope to hear from you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108422636118777582721", "name": "Justin Burchfield", "time": 1594236679325, "rating": 5.0, "text": "Josh and his crew did a fantastic job for us. He took down 19 trees for us for a very reasonable price and had it all done and cleaned up in 3 days. I recommend doing business with them!", "pics": null, "resp": {"time": 1594252251323, "text": "Thank you Justin for your review! It was a pleasure taking those trees out for you. There is no job to big or to small and we always do our jobs in a timely manner with top notch quality work! We appreciate your business and we hope to do more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "109903401725531127450", "name": "Tyler Collins", "time": 1594086464564, "rating": 5.0, "text": "Highly recommend! We have used J&H Tree Service on multiple occasions and have never been disappointed. Josh and his crew are always on time, professional, and get the job done right no matter the size. They go above and beyond and they are our go-to tree service!", "pics": null, "resp": {"time": 1594089282618, "text": "Thank you so much for that awesome review Tyler. We are very thankful that you continue to use us for all of your tree service needs. We take alot of pride in making sure that we go above and beyond for our clients and take care of them to the highest standard possible! Professionalism is very high on our priority list. We hope to provide services for you again in the near future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "105992592586702677814", "name": "Amber Traylor", "time": 1590184519254, "rating": 5.0, "text": "I can not say enough good words about Josh and his team. They removed a huge brush pile from our back yard along with several trees. They even went above and beyond by doing more than we expected. If you want someone trustworthy that knows what they are doing go with J&H!", "pics": null, "resp": {"time": 1594090146850, "text": "Thank you so much Amber for that review! I'm so glad that we were able to help you and it's always nice hearing those kind words from our customers. We always go above and beyond for all of our clients! Let us know when you need some more work done and we will be happy to provide you with our services again!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114896369789028848766", "name": "Tyler Campbell", "time": 1595386583431, "rating": 5.0, "text": "Did a great job cutting down two dead trees I had in my yard. Worked with me to minimize damage on my yard with moving the equipment in and out. Did the job very quickly and left it in a clean state. Good follow through on answering calls and texts as we planned out the work.", "pics": null, "resp": {"time": 1595390682884, "text": "Thank you Tyler for your review! We take our profession very serious and communication is very important to me. I'm glad that you decided to use our services and very thankful for the work! We treat our customers homes as if we were living there so we make sure to leave our customers homes in top notch shape when our services are completed. We look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "104924829330415942001", "name": "Aj Ja", "time": 1595398318011, "rating": 5.0, "text": "I highly recommend J&H Tree Service. I received a free quote on Monday (was happy with quote) and on Tuesday J&H was at my home removing limbs and a tree from my yard. They were all very professional and friendly. I will definitely be using J&H Tree Service in the future!!", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "101383262007455123877", "name": "Ben Roedl", "time": 1616459418096, "rating": 5.0, "text": "Did an amazing job. Would use again.", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114575392647194159027", "name": "Amanda Emerson", "time": 1583106540537, "rating": 1.0, "text": "Would definitely not recommend.  Not reliable at all. They did a good job cutting down a few trees but they left  huge piles all over our property.   When I call about making this better he just says someone is going to come back out but they never do. Save your money and use another company", "pics": null, "resp": {"time": 1594090838209, "text": "We apologize for any inconvenience. We hope that we can fix this issue for you. We always want our customers to be very satisfied. We take alot of pride in our clean up and that Is one thing our customers love about us."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "112624538320142916601", "name": "Teresa Kelley", "time": 1594163775420, "rating": 5.0, "text": "Josh came to give a quote the same day that I called for one. He and his crew showed up early the NEXT morning and  the job was completed that day. Which made me very happy. And it was not a small job!! I highly recommend!!", "pics": null, "resp": {"time": 1594165435823, "text": "Thank you Teresa for your review and glad that you are happy with our services. We pride ourselves on being prompt, on-time, & work efficiently to get the job done! I am very grateful for the business and hope that you use our services again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108729253195047976836", "name": "robin yelverton", "time": 1594160948697, "rating": 5.0, "text": "Josh and his crew did a great job taking down trees at my family’s property. We had a little communication issue at the beginning but once we got that straight, all my issues were taken care of promptly. I would call Josh again if I needed some trees down.", "pics": null, "resp": {"time": 1594165262920, "text": "Thank you Robin for that review and choosing us to do your work! I apologize for the lack of communication in the beginning and happy that we have another satisfied customer! We have a high volume of text, e-mail & phone calls everyday and we try to stay up to date with all of our customers. We hope that you use our services again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "101773614122225108243", "name": "Gail Clements", "time": 1599601422186, "rating": 1.0, "text": "They came and cut down two large trees.  One was cut up and removed.  The other was left and Josh said they would come back and remove it.  He was paid for both trees and the contract included removal.  After almost two months with no response, Dixie Tree Service removed the tree.  I would not ever recommend J&H or ever use them again.", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "115616300373215001718", "name": "John Griffin", "time": 1596473814802, "rating": 1.0, "text": "We hired Josh in May, 2020 to remove 6 trees and grind the stumps. He came out to our home on a Friday to do the job, cut down three trees, and called us to see if we would be willing to meet him with payment, saying, \"we are going to stay out here until the job is done.\" He cashed our check THAT DAY and never came back. We tried for months to get him to come back out, but he always had some excuse and would not return our money. We are in the process of suing him to retrieve our funds. DO NOT MAKE THE SAME MISTAKE WE MADE.", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "105424411312081263375", "name": "Theresa Long", "time": 1557537633289, "rating": 5.0, "text": "One of our largest trees got uprooted during the hurricane.  The tree was leaning over our pool and home posing a real hazard.  J & H tree service came out gave us a quote, showed up when they said they would, did an amazing, professional job safely! What impressed us the most was the attention to detail they showed in ensuring our belongs and home were not damaged and the property was left very clean!! Well worth the money- they have my highest recommendation!!", "pics": null, "resp": {"time": 1557539943449, "text": "Thank you so much for that awesome review! I am so honored to get that review and we take our profession very serious. We look at every angle before starting a project and make sure we explain everything to the customer before performing the services rendered. Safety & professionalism is very big with us and we always pay attention to detail. I'm looking forward to doing more business with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117580420949143044088", "name": "Kimberle Lindsey", "time": 1594145922513, "rating": 5.0, "text": "The company did a great job for us removing two stumps in our back yard!", "pics": null, "resp": {"time": 1594156542549, "text": "Thank you Kimberle for the review! We always make sure we grind our stumps 6-8\" below grade and clean up all of the wood chips. We hope you use us again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108266123886755743628", "name": "Matt Jennings", "time": 1542417812715, "rating": 5.0, "text": "I needed someone to assess hurricane wind damage to my residential lot, give me a quote, and then do the work necessary to remove multiple fallen trees and restore things to good shape, as my lot is on the market for sale. They responded promptly and handled the job efficiently and professionally with appropriate communication throughout. I live over 3 hours away, so it was good to have eyes on my property. It saved me a day of time, and it was good to know things were in good hands. Don’t hesitate to hire these guys, I’m glad I did and couldn’t be more satisfied.", "pics": null, "resp": {"time": 1542433955622, "text": "Thank you so much Matt for the review! We pride ourselves on professionalism and communication! We take pride in our work and make every effort to make sure our customers are satisfied! We are very thankful for your business! Looking forward to doing more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114397664623462253050", "name": "Jeanetta Irvin", "time": 1557884473515, "rating": 5.0, "text": "J & H Tree Service did an excellent job removing a number of large  oak limbs over our house and taking down a huge pine in front. They took care to move things that might be damaged and then replaced everything before leaving. They cleaned up completely even skimming the few leaves that fell in the pool We were very satisfied with Josh and his whole crew. All were very friendly and concerned with customer satisfaction.", "pics": null, "resp": {"time": 1557902670193, "text": "Thank you Jeanetta for your review and I'm very thankful for the business! We treat our customers like family and I strive for 100% customer satisfaction from beginning to the end of the job! Our customers are very important to us and we take great pride in our work and go above and beyond for our customers! We look forward in doing business with you again in the future! God Bless!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "113954642850773153383", "name": "Leigh Mobley", "time": 1556760282278, "rating": 5.0, "text": "I am very pleased with the work they did in my yard. They are Very professional. I was so impressed they arrived on time, got the job done and cleaned up. The job of removing two trees and raising the canopy of the whole yard was very well done. I highly recommend Josh and his crew.", "pics": null, "resp": {"time": 1557540260122, "text": "Thank you Leigh for the review! We are very thankful for the business and glad that your satisfied with our services! We take our profession very serious and strive for excellent customer service and going above and beyond for our customers! I'm looking forward to doing more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102021239703707698928", "name": "David Clark", "time": 1543966706105, "rating": 5.0, "text": "These  men did a wonderful job at my house today. Mr. Josh, Matthew, Mike, Robert, and Mark were very enjoyable to meet and talk to and they did a professional job in my yard today. My wife was extremely happy with the work as was I.  They are fine young men and I strongly encourage anybody that needs tree service to use them. They even stayed and sharpened my own chainsaw without being asked to. Again I highly recommend them.", "pics": null, "resp": {"time": 1543972001299, "text": "Thank you very much Mr. Clark for that review! We pride ourselves on professionalism and excellent customer service! We are very thankful for the business and glad that you were very satisfied with our services! We are looking forward to doing business with you again in the future."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "109954796963498170012", "name": "Mary Davison", "time": 1539555845326, "rating": 5.0, "text": "I would highly recommend this company to anyone. After hurricane Michael we had some trees come down and we called J&h. They were very professional and responded right away. Great job and a hard working group of guys. It’s literally 5:30pm on Sunday and they are still at it. I recommended them to my neighbor and they are now working on their property. They will be at it until late tonight. You gotta respect that.", "pics": null, "resp": {"time": 1542434209398, "text": "Thank you so much Mary for your review! I have alot of pride in my team and we work until the job is done! We are very dedicated to our job and strive for great customer service! We are looking forward to doing business with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "113406484922400236567", "name": "PEARL EASTER-WILSON", "time": 1525525105163, "rating": 5.0, "text": "J & H is a very customer oriented, professional and safety focused business.  The company specializes in large tree removal, storm damage removal, clearing property and crane services but also does other services such a laying cement, demolition and lawn care and restoration. The team is highly trained and skilled in operating heavy equipment such as cranes in open and fenced in areas.    They removed trees in my yard that were almost six feet in diameter, very tall and full without any disturbances to adjoining properties or fences.  Prices are very reasonable for the quality of work provided.  Their work ethics are impeccable; they were on time each day, courteous and never left a messy area.  All tree stumps were completely grind down and all debris removed.  I highly recommend this company.", "pics": null, "resp": {"time": 1525566233854, "text": "I am absolutely honored to get such a great review such as this one! It makes me feel very good knowing that I am gaining another completely satisfied customer! Thank you Pearl Wilson for your business! J&H Tree Service prides ourselves on superior work ethics and safety is our #1 goal on every job. We specialize in dangerous tree Removal such as the job we just done for you and glad it was a 100% success! Can't wait to do some more work for you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "110848257796740651670", "name": "Zachary Marden", "time": 1594826847344, "rating": 5.0, "text": "I had a large branch break halfway through and fall on my roof in the late afternoon. Called these gentlemen, and they were there within an hour. They cut that branch down right at dusk, showed me why the tree was dying and needed to come down, and then cut me a deal on that tree and two other problem trees. They knocked it all out the next day before a large storm came through and knocked other limbs down in my neighborhood.  I couldn't recommend these guys enough!", "pics": null, "resp": {"time": 1594850422736, "text": "Thank you Zachary for leaving a review for our business! We are a 24 hour tree service and will respond to any call day or night. We go above and beyond for our customers and ensure the highest level of professionalism when it comes to trees and when they need to be removed and pruned. We are happy that we were able to provide our services to you and look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117046989868410680157", "name": "Judy Stewart", "time": 1524343775700, "rating": 5.0, "text": "J&H Tree Service cut down one very tall oak tree and a small one. Their price was good  and  they were on time.  Very hard working, polite crew. They did a GREAT job. They took care of the stumps and cleaned up all of the debris I definitely would use them again and would recommend them to anyone needing tree service.", "pics": null, "resp": {"time": 1524344875230, "text": "Thank you so much Judy for the fantastic review! We want our customers to have a great experience with us and pride ourselves on professionalism and 100% customer satisfaction! Very happy to earn your business again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108656782632333024165", "name": "Ana Bickford", "time": 1535831455572, "rating": 5.0, "text": "Kudos to J&H tree services. Absolutely great job! Very professional and customer-oriented with reasonable prices. J&H tree services owner and staff went over and beyond to accommodate my needs, very courteous, knowledgeable, and professional at all times. I would highly recommend two friends and neighbors.", "pics": null, "resp": {"time": 1542434303837, "text": "Thank you Ana for your review! We are thrilled that you are happy with our services! We are looking forward to doing business with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "105066554208367722845", "name": "Jamie Goodman", "time": 1563411000707, "rating": 5.0, "text": "Great company to use for tree removal.  J & H helped us the morning after hurricane Michael with a fallen tree that was at risk of hitting our house.   We called J and H again to remove 2 trees in our front yard, and trim limbs the back yard so our grass would grow.  Josh is very professional.  He keeps his word, does great work, and does not leave any limbs or leaves behind.  We will use J and H anytime we need to remove or trim trees in our yard.", "pics": null, "resp": {"time": 1563422963750, "text": "Thank you very much Jamie for your review and your loyalty to J&H Tree Service. We are very greatful for the business and we treat our customers homes as if they were ours! We are very meticulous about our clean up and go above and beyond for our customers! We pride ourselves on professionalism and provide excellent customer service! We want a great experience for our customers! Thank you again for the continued business and we look forward to doing business again with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "112373740767079021891", "name": "Andrew Bath", "time": 1580931555706, "rating": 5.0, "text": "Josh at J&H Tree Service was great to work with! Once he and his team started they had the trees removed that were a danger to our building in no time! We greatly appreciate their hard work, quality, and service!", "pics": null, "resp": {"time": 1594089897616, "text": "Thank you Andrew for your kind review! We specialize in dangerous tree removal and very happy we were able to provide you with our services with 100% complete removal with no damage. We do our very best to provide our customers with top notch quality service. We hope that you use our services again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102736325072232601232", "name": "Chris B", "time": 1561391447089, "rating": 5.0, "text": "Highly recommended. I've used three different companies for tree services since I've moved to Dothan in the last 1.5 years. J&H is the only one I would recommend, which is why I have used them three different times already and will again in the future. They provide high quality work and great customer service.", "pics": null, "resp": {"time": 1561527556799, "text": "Thank you so much Chris for great review! I am very thankful that you continue to keep using J&H Tree Service. We love all of our customers and we take great pride in professionalism and giving our customers 100% customer satisfaction and leaving them with a great work experience. We go above and beyond for our customers and try to help out anyway we can. Our customers are #1 and we will continue to go by that standard! We want to thank you again for the business and look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102196492061605375032", "name": "Robert Allen", "time": 1497122687139, "rating": 5.0, "text": "I arranged for J&H to do some pruning and tree removal in my Mom's yard in Dothan. I set up the original appointment via e-mail. I live 5 time zones away and coordinated the work for the week I was at my Mom's. Josh came by, gave me an estimate, and recommended removal of two trees. Both were close to the house, one was a 50-ft oak tree.  Josh was able to reschedule a day earlier than he originally projected.\n\nAbout 6 hours of work, and the tree felling operations went flawlessly dropping right between house and fence. The crew was professional, Josh was personally meticulous about cleaning and power blowing yard clean, especially around pool. Josh owns and runs this business and of course will be saturated with calls after severe weather events.  That's why I elected to have the work done on my schedule, not Mother Nature's. I had some questions after the work was completed and Josh provided timely responses and follow up to my questions. I'd hire him again.", "pics": null, "resp": {"time": 1500561877704, "text": "Thanks Robert we really appreciate the review."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114071088424993008449", "name": "Rick McCleskey", "time": 1614538477733, "rating": 5.0, "text": "My first impression and review was only one star since they failed to show up or call with a reason for not showing up to give an estimate on tree removal,,,not once, but twice.\nEDIT:  Several days later, they called, made an appointment for an estimate and showed up on time.  Their price quote was fair and less than others I had received so they were hired.\nDue to weather and additional trees downed, what was supposed to be a 3 day job  has turned into 5 .   J &H has been great.. They've had as many as 10 to.12 workers here at one time and ALL were very polite and hard working. I'm impressed with the personnel and equipment they have.\nI can honestly say,  I'm happy with their work and I'm very picky.  Josh and his personnel are the best and you won't be disappointed if you hire them.. Just be patient if can't get in touch with them right away.\n\nCalled them a second time and the prices were now out of sight.", "pics": null, "resp": {"time": 1500561749532, "text": "Thank you Rick for giving us the opportunity to work for you! We are very thankful and glad that you are satisfied! We take pride on professionalism and great customer service! We are looking forward to doing more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108628525936090651280", "name": "Carl Pylant", "time": 1558652754095, "rating": 5.0, "text": "Josh and his crew were prompt, courteous and efficient. They provided a great service for a fair price. If you need a tree trimming/removal service, give these guys a call.", "pics": null, "resp": {"time": 1558668549790, "text": "Thank you Carl for your review! We have very competitive prices and believe in taking care of our customers! A professional company should be on time and provide 100% communication to the customer as we do just that. We are greatful for the business and looking forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102714586309325268034", "name": "Amanda Pierson", "time": 1552072276533, "rating": 5.0, "text": "These guys did a wonderful job moving a big tree that had fallen during the last hurricane. They also took down another tree for us and grinded down a couple stumps. They work fast and get it done! We are very pleased with their work and will definitely use them again and recommend to others.", "pics": null, "resp": {"time": 1557540360116, "text": "Thank you Amanda for your review and very thankful for the business. We are happy that your satisfied with our services and looking forward to doing more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "101320478614166824202", "name": "Kim Smith", "time": 1499900443745, "rating": 5.0, "text": "We had J & H Tree services trim our oak trees and we were left speechless. Mr. Josh has an amazing team and watching them work together you can tell he has great leadership. He did as much of the work as his team did. We both really like that he is hands on. We would very much so recommend his company to others. We like that he kept us in the loop from start to finish. When they were done it was like no one had even been here. Our yard looks so BIG and BRIGHT. We love it! Its like a new property. Keep up the great work guys.", "pics": null, "resp": {"time": 1500561528835, "text": "Wow great review thanks Kim. We aim to please."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "113753591248179277254", "name": "Kyle Harper", "time": 1529273219844, "rating": 5.0, "text": "Did great work for a fair price. Worked great with my wife and I schedules and kept a good line of communication with us through out the process. They hold themselves to professional standards and the results reflect that. Definitely would recommend", "pics": null, "resp": {"time": 1529274518853, "text": "Thank you kyle for your review! We take professionalism very seriously and believe communication is the key to a strong and successful business! I take great pride in making sure my customers are very happy and glad that I have earned another customer! Thanks so much!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "106295559125452325638", "name": "Bill", "time": 1558219945972, "rating": 5.0, "text": "Absolutely outstanding service, in a tight close quarters space. I would recommend this company to anyone I know without hesitation. Many thanks Josh, my wife is a happy camper now.", "pics": null, "resp": {"time": 1558321515756, "text": "Thank you so much Bill for your review! I'm very thankful that I could provide my services to you as well as excellent customer service. We treat our customers like family and take our profession very serious. We specialize in tight spaces and dangerous tree removal! Thanks for the recommendation, It really means alot."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "112793316081743546359", "name": "Janice Arango", "time": 1499984199122, "rating": 5.0, "text": "Josh responded promptly to my request for an estimate and kept me informed about when the scheduled work would be performed.   He and his crew did a great job removing about 50 trees from my property, and trimming up several others.  They totally cleaned up and removed the mess.  The price was extremely reasonable.  I would use this company again for tree work and would highly recommend them.", "pics": null, "resp": {"time": 1500561482449, "text": "Janice thanks for the great review. We really appreciate your business."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "110363516182599773829", "name": "Roger Day", "time": 1527039422962, "rating": 5.0, "text": "The team was very good at their job. And courteous. My 3 year old granddaughter was thrilled by the show they provided in bring down the trees. I will recommend them to anyone looking for tree service.", "pics": null, "resp": {"time": 1527043588855, "text": "Thank you roger for the review! Thank you for the business and happy that you will use us in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "115149468554815610697", "name": "William O'Brien", "time": 1499042572627, "rating": 5.0, "text": "We hired them to remove 15 trees from our backyard. We could not be more pleased with the work they done! Josh and his crew are very professional and prompt. Also, the prices can't be beat! We will definitely call them for any tree needs in the future!", "pics": null, "resp": {"time": 1500561592507, "text": "William thank you so much for the great review."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "115769820354538976635", "name": "Sydney Hardy", "time": 1563483408084, "rating": 5.0, "text": "Won’t be using anyone else again! Josh and his team did a wonderful job. Thanks again!", "pics": null, "resp": {"time": 1563492279921, "text": "Thank you Sydney for your review! We are very greatful for the business and looking forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102024065191778465023", "name": "cindy grommes", "time": 1527027472972, "rating": 5.0, "text": "Josh and his crew did excellent work. Professional and courteous. Trees were removed that were too close to home. Work was clean. I definitely recommend Josh and his team.!!", "pics": null, "resp": {"time": 1527043713130, "text": "Thank you cindy for the review! We specialize in dangerous tree removal and trees that are close to the home. We are happy you called us to do your trees & looking forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "107388253432046594902", "name": "Jeremy Kilpatrick", "time": 1530670879650, "rating": 5.0, "text": "Hands down the best company to use to have trees dropped, limbed, and stumps removed. They coordinated with Alabama Power to have my power lines removed to keep from having any issues with limbs or anything falling on them during the tree removal (which was a huge tree with the limbs laying across my roof) and even with my older kids at home they were never bothered, an once I got home from work the gentleman was nice enough to swing by for payment and even gave me a discount due to my neighbor utilizing them to remove trees off his property. The area where my tree was at was all cleaned off like it never had one even there. The guys are A++++ and id recommend them to anyone.", "pics": null, "resp": {"time": 1530835700001, "text": "Thank you so much Jeremy for that great review! I am honored! I am so happy that you are very pleased with our work and we give 150% to our customers everytime we do a job! I am so proud of my team for everything that they do for me and for being able to provide such great customer service experience! J&H Tree Service feels like we are the best because we put so much hard work and dedication into this company. We treat our cutsomers homes as if we were living there and thats what we stand by in our company! Thank you so much for your business and we are looking forward to doing more work for you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "110994650388444799253", "name": "Amelia Whitaker", "time": 1530137679016, "rating": 5.0, "text": "Great company and great work!!!  I was impressed with how quickly they worked taking down our 9 HUGE trees.  They were easy to work with, and kept in contact during the duration of the job.  KUDOS to J & H Tree Service for such great experience!", "pics": null, "resp": {"time": 1542434454379, "text": "Thank you so much Amelia for your review! I'm glad you chose J&H Tree Serivce, LLC. for your tree service needs. We strive ourselves on professionalism and great customer service experience."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "100528986048774910587", "name": "Southpaw Gamez", "time": 1527027452570, "rating": 5.0, "text": "Josh and his crew are professional and efficient. Josh was very accommodating to our schedule. They left the yard clean and looking great. We will continue to use J&H in the future. Thank you Josh!", "pics": null, "resp": {"time": 1527043930579, "text": "Thank you emily for the review & your very welcome! We are very thorough about our work & we want our customers yard to look just as good if not better when we leave! We treat our customers home as if it was our home. Im very happy to gain a new customer and I am looking forward to doing business again with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117683058852474080899", "name": "Jennifer Hill", "time": 1527166457545, "rating": 5.0, "text": "Very professional, great communication. This company goes above and beyond to take care of their customers and make sure the job is done right. If you need tree work this is the company to call!!", "pics": null, "resp": {"time": 1527432725396, "text": "Thank you so much for your review jennifer! We love our customers and we will go above and beyond to please them! We strive for excellence and professionalism as well as communication."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "110770142139202044395", "name": "Allison Sims", "time": 1543421206134, "rating": 5.0, "text": "I was very pleased with the removal of some difficult trees and debris.  I thought the price was great, as well as the work. I will definitely use them for future work and would also recommend their work!", "pics": null, "resp": {"time": 1543428220874, "text": "Thank you very much allison for that kind review! We specialize in working in tight areas and dangerous tree removal. We look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "105042086307565271717", "name": "Cheryl Mixson", "time": 1521227119709, "rating": 5.0, "text": "Very pleased with the job they did.   Cut two  very large trees and trimmed several others.   Josh and his team were very conscientious and a pleasure to work with.", "pics": null, "resp": {"time": 1523848159114, "text": "Thank you so much for the review! I'm glad that you were very pleased with our work and hope to do business again with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114578609789624643303", "name": "Tara Morris", "time": 1546889464784, "rating": 5.0, "text": "He beat the other estimate I got by almost half. He did a fantastic job and went above and beyond what I expected. I highly recommend him!", "pics": null, "resp": {"time": 1546912274879, "text": "Thank you Tara for the review! We always go above and beyond to please our customers! We specialize in storm damage and getting trees off of houses. Thank you so much for the business and looking forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "118144635235179207670", "name": "Carlotta Crawford", "time": 1546433666667, "rating": 5.0, "text": "Very pleased with this company. They came and cut down a large tree close to my house and storage building that seemed impossible but got the job done. Cleaned up everything and the backyard never looked better. I highly recommend this company, they do it right.", "pics": null, "resp": {"time": 1546577821273, "text": "Thank you so much Carlotta for your review! We specialize in working in tight areas. We study alot on dangerous tree removal and working in tight spaces. We are very thankful for your business and glad that we could do work for you! Professionalism and customer service is our #1 priority!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108307993313467330955", "name": "Stacy Kurtti", "time": 1523038333343, "rating": 5.0, "text": "Josh and his crew are wonderful. The men did an awesome job. Did exactly what we wanted and went above and beyond. Very nice guys.", "pics": null, "resp": {"time": 1523847877612, "text": "Thank you Stacy for the review! We work very hard to make sure our customers are very satisfied with our work!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "110754911891822807961", "name": "P Fowler", "time": 1523844779990, "rating": 4.0, "text": "Josh and his crew responded quickly when given the job to grind up multiple stumps on my front yard.  They are thorough even with their clean up. Just make sure to mark where your underground sprinkle lines are to prevent damage, some of the equipment used is heavy.", "pics": null, "resp": {"time": 1523847325300, "text": "Thank you so much for the review! We take pride in our work & we believe in excellent customer service. I'm glad that we had to opportunity to do work for you and I apologize for any sprinkler lines that may have gotten damaged!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "103599880965998406538", "name": "Rebekah McGinnis", "time": 1499907851758, "rating": 5.0, "text": "Josh & crew, this is just a brief note to commend you of the excellent work you & your crew performed on our trees. All of the work specified was done. The crew was friendly, courteous, professional, & thorough. The clean-up was excellent with all the leaves, branches & twigs. Please let the crew know that we are very satisfied with yalls work & would recommend J&H Tree Service to anyone. Since we still have a number of trees, there is no doubt you guys will be here again in the future. Thanks so much!!!\nSincerely yours,\nRebekah & Shaun From Cowarts,AL", "pics": null, "resp": {"time": 1500561501283, "text": "Thanks Bekah."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114217849374164839366", "name": "Mark Wisniewski", "time": 1525027833735, "rating": 5.0, "text": "Great experiance with J&H tree service. Josh came out Friday afternoon to give me a quote and was here on Sunday morning doing the work. Good to deal with and good work.", "pics": null, "resp": {"time": 1525028785551, "text": "Thank you mark for the review and\nalways being a repeat customer! We appreciate your business and will always be here for you when you need us in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "113035326302328250109", "name": "Mike Mc", "time": 1523036215053, "rating": 5.0, "text": "Very customer oriented. Removed several diseased pines and a Bradford pear. Yard was very wet resulting in some unavoidable ruts on property. Was extremely apologetic about something that was unavoidable. Brought in a load of sand to smooth it out. Good communication on when they would be working and of any delays. Don’t know if they are the cheapest but I don’t think anyone could be better and most times you get what you pay for.", "pics": null, "resp": {"time": 1523847990104, "text": "Thank you mike for the awesome review! We are very thorough about our work from the time we get there until the time we leave our customers homes! We are very thorough and believe in great communication! We hope to do business with you again soon."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "111214292691732757841", "name": "Michael Roskam", "time": 1530047738587, "rating": 5.0, "text": "Very good company went above and beyond what was asked of them.  Would recommend them for all your tree service work.  I will be using them again in the future.  Great job guys!!!", "pics": null, "resp": {"time": 1530055404184, "text": "Thank you very much for the review mike! We thank you very much for the business and looking forward to doing business with you again!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108021077495425026347", "name": "Adrianna Castillo", "time": 1517594314282, "rating": 5.0, "text": "Josh and his crew did an amazing job. Was great at answering my questions.  Very clean and a great price!", "pics": null, "resp": {"time": 1523848219446, "text": "Thank you Adrianna for the review! We take pride in our work & excellent customer service! Hope to do business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "106415007612741185864", "name": "Mikael Ash", "time": 1491510078820, "rating": 5.0, "text": "Professional, courteous, excellent communication and work.  No issues at all and they were honest enough let me know that they needed to wait a few days because they did not want to tear up my yard after a storm.  I would use them again.", "pics": null, "resp": {"time": 1500561819137, "text": "Thanks for the fantastic reviews. We are always open and honest with our customers."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117285715987222867951", "name": "Cody Corbelli", "time": 1525725822643, "rating": 5.0, "text": "They were very efficient, hard working and on time. They did a great job. Would Highly Recommend them. Thanks for everything.", "pics": null, "resp": {"time": 1525726615547, "text": "Thank you for the review! Your very welcome and happy to gain a new customer! Can't wait to do more work for you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "100774054021304305965", "name": "Venus Mccullough", "time": 1528505083316, "rating": 5.0, "text": "Josh and his crew were very professional, courteous, and left our place neat as a pin. They had to use a crane for a tree dangerously leaning over a house and it was no problem at all. They are very customer service driven and we would highly recommend them.", "pics": null, "resp": {"time": 1528521391929, "text": "Thank you so much Venus for that awesome review! We pride ourselves on professionalism and going above and beyond for our customers! I'm so blessed to gain new customers and I take great pride in that! We specialize in dangerous tree removal & crane services and very happy that the crane service we provided today was a 100% success!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "115350517725779616670", "name": "Dr Ken Brown", "time": 1558471459327, "rating": 5.0, "text": "I have used J&H Tree Service for years. They always do a quality job and are careful to  prevent any damage to surrounding structures. I will definitely be using them again.", "pics": null, "resp": {"time": 1558474804242, "text": "Thank you Dr. Brown for your review! Thank you for being a faithful customer. We always treat our customers homes as if we were living there. We pride ourselves on quality and making sure that we provide 100% customer satisfaction! We are very greatful for the business and looking forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "109744664117623021532", "name": "Mary Lee", "time": 1543979302344, "rating": 5.0, "text": "so. you came and clean the after math of stump. I am proud that you came out. of your time to do this .you are a good person. forgive me getting mad.good luck in Georgia tomorrow...😜", "pics": null, "resp": {"time": 1543976259610, "text": "I apologize for the inconvience. We work very hard to make sure we can get to everybody as quickly as possible. We have been overwhelmed with hurricane michael. Thank you for understanding and thank you for your business! We really appreciate it!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "105026644107814857957", "name": "Johnny Culbreth", "time": 1562278253807, "rating": 5.0, "text": "The guys with J&H Tree Service are great guys to do work with. I had some stumps that need grinding and call Josh the owner and him and his crew came out and did them on the same day.", "pics": null, "resp": {"time": 1562279503044, "text": "Thank you Johnny for your review! We offer same day service! I am greatful for the business and look forward to doing more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "100616991656978061384", "name": "Jerry Parr", "time": 1500345688968, "rating": 5.0, "text": "The most reliable tree service around. Friendly and very courteous.  Price is the best", "pics": null, "resp": {"time": 1500561383566, "text": "Thank you. We love our customers."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "116072707576704068378", "name": "Bo Thurman", "time": 1596936648121, "rating": 5.0, "text": "Josh and his crew does an amazing job.", "pics": null, "resp": null, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "116609807953822903547", "name": "Ashley Lawrence", "time": 1562449783615, "rating": 5.0, "text": "I would like to take the time out to say J and H tree service came out and did a tree removal for me they where knowledgeable and on time and very respectful to our needs I would recommend this tree service again they was fair price and reasonable and they done a excellent job we really do appreciate it :)", "pics": null, "resp": {"time": 1562518915503, "text": "Thank you Ashley for your kind review! We pride ourselves on professionalism and excellent customer service! We want all of our customers in the wiregrass to have a great experience with our company and want to provide a top notch service! We love everybody and our customers are our #1 priority! We are very greatful for your business and look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "106416669975644639835", "name": "Tim Patrick", "time": 1502327120160, "rating": 5.0, "text": "Good communication and planning. Worked within our budget with a positive attitude. I highly recommend these guys.", "pics": null, "resp": {"time": 1523848315844, "text": "Thank you so much Tim for the review! I'm happy that we were able to work with your budget! We pride ourselves in taking care of our customers & looking forward to doing business again with you in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "111738732516429686225", "name": "Brenda Raybon", "time": 1543612965864, "rating": 5.0, "text": "Highly recommend. Cut and cleared out a huge pecan tree that was close to house. Very pleased!!!", "pics": null, "resp": {"time": 1543645555817, "text": "Thank you Brenda for the review! We specialize in removing large trees in tight areas. We are happy we were able to help you and very thankful for the business. We are looking forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "113353234985490273610", "name": "Jessica Ezell", "time": 1558663941750, "rating": 5.0, "text": "Very satisfied. Quick to respond and got the job done same day as inquiry.", "pics": null, "resp": {"time": 1558668600336, "text": "Thank you Jessica for your review! We offer same day service and glad that we could assist you today with our services! We look forward to doing business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117873483018674830375", "name": "Preston White", "time": 1524086508518, "rating": 5.0, "text": "I contacted J & H Tree Service this morning and they arrived at my home within an hour!! They are quick, efficient, and very professional! Thanks so much!!", "pics": null, "resp": {"time": 1524086604215, "text": "Thank you sir for the review! We are so happy that you are satisfied and we are greatful for your business! Thank you for choosing us!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "100183135683878910460", "name": "Shannon Thomas", "time": 1533952911878, "rating": 1.0, "text": "Tried to call them to get an estimate but no one answered. Then messaged them and they said \"absolutely, what is your number?\". Gave it to them but still no call or anything. I found someone that did return my call and even got the job done today thankfully.", "pics": null, "resp": {"time": 1533956678979, "text": "We truly apologize for any inconvenience. We try our very best to answer every call and text and email but we can't get to everybody. We have a high volume of calls everyday. We hope you have a blessed evening."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117845097120059982194", "name": "Pamela Holland (Pam)", "time": 1524945934163, "rating": 5.0, "text": "Very professional and curtious. J & H showed knowledge and experience. The cleaned up afterwards was done very well. I would recommend J & H for your tree service needs.", "pics": null, "resp": {"time": 1524946979392, "text": "Thank you Pamela for your review! As a first time customer, Im very happy that your pleased with our services and hope to do business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "101599949291441124025", "name": "Scott TG", "time": 1531801189514, "rating": 5.0, "text": "Prompt, courteous service!  Excellent work including cleanup.  Highly recommend!", "pics": null, "resp": {"time": 1531883512933, "text": "Thank you Scott for the review! We really appreciate it!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "102300388748051054578", "name": "Lynda Baker", "time": 1498834673877, "rating": 5.0, "text": "These guys are the real deal. Knowledgeable, courteous, professional. I was heartbroken when Josh said my favorite tree had to go. I even doubt him. But when they cut it down I could see the wet and rot on the inside. The man knows his business.", "pics": null, "resp": {"time": 1500561641547, "text": "Thanks Lynda. Josh does know his stuff."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "104299482086536395892", "name": "J S", "time": 1523540433093, "rating": 5.0, "text": "Good service and easy to work with. They did a great job.", "pics": null, "resp": {"time": 1523847725678, "text": "Thank you so much for those kind words! We appreciate your business!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "111199662751860761782", "name": "Kitty Cobb", "time": 1528910236232, "rating": 5.0, "text": "Great Job. I highly recommend. Unbelievable service and price. Call them today. They are the top emergency tree service in Dothan.", "pics": null, "resp": {"time": 1500561541249, "text": "Thanks Kitty"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "108499737291937337171", "name": "Kelly Ratcliff", "time": 1521142397562, "rating": 5.0, "text": "Great tree service at an unbelievable price.  I was surprised at the professional stump grinding and tree trimming work they provided!", "pics": null, "resp": {"time": 1500561443583, "text": "Thanks for the review Kelly."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "114581782954096392723", "name": "Sammy Jackson", "time": 1568477723115, "rating": 5.0, "text": "They did an excellent job and we will call them again.", "pics": null, "resp": {"time": 1594089734764, "text": "Thank you Sammy for your review! Glad we were able to provide the services you needed. We hope to hear from you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "117196435702311059116", "name": "John Stokes", "time": 1524348891211, "rating": 4.0, "text": "Did an excellent clean up job. Couldn’t have asked for much better!", "pics": null, "resp": {"time": 1524351721277, "text": "Thank you for the review! We appreciate your business!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "105544947509817765642", "name": "Emily Jackson", "time": 1560642487069, "rating": 5.0, "text": "These guys went over and beyond to make sure everything was done and cleaned up very well! I highly recommend J&H!", "pics": null, "resp": {"time": 1560699922757, "text": "Thank you Emily for your review! Our customers are very important to us and we take pride in going above and beyond for our customers! We treat our customers houses as if we were living there. I'm very thankful for the business and looking forward to doing more business with you again in the future!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "101127202969568753686", "name": "Joe Daughtry", "time": 1498480149075, "rating": 5.0, "text": "I have used J&H Services more than once. Josh is always professional and does what he says he will do.", "pics": null, "resp": {"time": 1500561929318, "text": "We love our clients and hope that you continue to use us in the future. Thanks Joe."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "111356816794920467544", "name": "L.A. Jones", "time": 1471303405992, "rating": 5.0, "text": "Quick to respond! Very professional and affordable!", "pics": null, "resp": {"time": 1500561766259, "text": "Thank You!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "100780051523867502269", "name": "Tammy Persin", "time": 1544669137365, "rating": 5.0, "text": "Great job, very happy with service provided.", "pics": null, "resp": {"time": 1544680187611, "text": "Thank you so much Tammy for the review! We really appreciate the business."}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "116295357207569796031", "name": "Darrell Holderfield", "time": 1532376479881, "rating": 1.0, "text": "Seriously ?", "pics": null, "resp": {"time": 1594525930309, "text": "We apologize Darrell if we havent gotten in contact with you. We get a high volume of calls, text, & e-mails. We hope we can turn that 1 star into a 5 star. Have a fantastic day!"}, "gmap_id": "0x88928d80488970bf:0x6ddff92dbeeb7004"}
{"user_id": "112429725270487728461", "name": "Kevin Waldrup", "time": 1628880277423, "rating": 1.0, "text": "Drivers and staff are rude ill mannered disrecepectful to customers. Will not make nehiles available to customers after 5pm when calls are made to to try and set arrangements after hours. Has no interest in trying to help customers regain their vehicles. OWNER WILL MOT ACCEPT RESPINSIBILITY FOR HIS WORKERS NOR WILL HE RETURN PHONE CALLS.\n\nVERY VERY VERY POOR WORK ETHICS AND BUSINESS VALUES. DO NOT RECOMMEND AT ALL.", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "110426890620384646335", "name": "Garrett Putman", "time": 1623156802133, "rating": 1.0, "text": "Knowing that the only way to get your vehicle back is to pay whatever they say, They happily take advantage of the people that are already in a bind enough as it is. Also when you go in there the women behind the desk will let you know she's busy on Facebook with a glare and a look as if she smelled something unpleasant.... top notch", "pics": null, "resp": {"time": 1623255374244, "text": "We appreciate you taking the time to leave your feedback. We're sorry we didn't provide you with the best experience that we could have. Please reach out to us at (205) 405-1888 to let us know how we can improve."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "114181638517257062823", "name": "Beth Phillips", "time": 1614893384129, "rating": 1.0, "text": "It took the tow truck over two hours to after I was told it was dispatched to make a 30 minute trip. Only after giving them ample time and allowing for traffic did I call back to be told the had taken another call, one that was made after they told me the truck was on the way. Come to find out they have a contract with the state. which I understand. But if they are going to take another call and put it before mine I would think they would have the common decency to at least give me a call and let me decide if I wanted to wait three times what I was expecting. Their price was also a good $75.00 above the going rate.\nI was uneducated on towing services, but now know better. I would not recommend Hank's unless you have plenty of time and don't really care how much you spend. A disaster from start to finish. Horrible business practices to leave a customer waiting all that time without at least a courtesy call.", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "107612582301658398977", "name": "Andrea Kay (Andie)", "time": 1617801012512, "rating": 5.0, "text": "April 2, 2021 I was in a horrific accident, another car changed lanes into me on the interstate running me into the guardrail, which spun the car I was driving around and smashed it into the guardrail three more times. I was traveling with two dogs and hours away from home. To say I was a mess doesn't cover it. Your driver and his partner were professional, and went above and beyond helping me get myself and my dogs to a pet friendly hotel, getting all of my luggage and dogs in. Unfortunately I left the paperwork he gave me in  his truck but please know he is absolutely an asset to your business and I'll forever be grateful for the treatment and professional manner I was treated in that evening! Drivers like him are a rarety and kiddos to him!!", "pics": null, "resp": {"time": 1617812670643, "text": "Thank you so much, Andrea. You can call on us any time, and we will be there for you."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "108243894700942918854", "name": "Samuel Moore", "time": 1618868169374, "rating": 5.0, "text": "They professionally picked up my car and towed it 40 miles in time for me to still go get my other vehicle and go to work.\nI am very satisfied with them and will use them again.", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "110905265389094615493", "name": "Jason Dowling", "time": 1626127217641, "rating": 1.0, "text": "They don’t honor the time posted on the door. I was there at 4:45, (Monday) they close at 5. I get people like to cut out a few minutes earlier sometimes, I do. I really needed some things from my vehicle, and dispatch was rude as hell. I wouldn’t recommend if you have the option", "pics": null, "resp": {"time": 1626288253382, "text": "We're so sorry. We hate to let a customer down. If you have time please call us at (205) 405-1888 so we can discuss your concerns in greater detail. We hope to hear from you. Thank you"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "114036885354159244683", "name": "David Pilgrim", "time": 1621286648445, "rating": 1.0, "text": "My late father's truck got towed after 12 midnight on a Friday my son was driving the truck and went to jail , monday I called and they said 330 to get it out remind you they only towed it 2 miles when I got over there about 1 they said 390.00 they charged another 35 dollars because I wasnt there at 12 the reason and I told them I had to go to my brothers house and get my dads death certificate to get a release on it anyway the Pell city police dept said they had  few complaints on them ,I finally talk them into 360.00 but that low down shame they would take advantage of people charging that much oh it was a 100 admission fee plus 200 just for towing it 2 miles , what is the admission fee for I dont mind paying 200 towing it 2 miles which is high but then they add 100 admission fee what the hell is that for plus 35 aday storage. it should have been 200 to tow 70 storage for 2 days not 390 they wanted. that's doing people wrong and they get by with it because if you dont pay what they want you dont get your car , they got a hell of a racket going on and I'm wfiting the chief of police so they can discuss it over the next council meeting hopefully they wont be towing for Pell city a more,  and that fat boy that was there is lucky I kept my cool because I dont play no games especially when. I'm being ripped off  it was his lucky day I gave him a pass because I dont let fat boys run there mouth at me ,he must be used to talking to others like that. just beware if you call Hanks towing be ready to empty your wallet to them and that administration fee on top of towing I dont understand that ha! ha! That's a good one ,you got me this time but never again", "pics": null, "resp": {"time": 1621954655063, "text": "Mr. Pilgrim,\nAll of our pricing, No matter the jurisdiction involved, Are equal in all amounts and are within regulation(s) of the state of Alabama and all local municipalities.\nThe administrative or \"Admin\" fee that is charged reflects the costs we have to pay to search within the Alabama Department of Revenue and if applicable, any other state in which the vehicle is registered, to obtain the names of the registered owner and or lienholders (If applicable) on any vehicle pulled in, Reason being as so we don't get someone coming in with a handwritten bill of sale for example, stating that they are the owner of whatever vehicle they may see in our lot is theirs, It's a safeguard measure we take to keep any customers property secure, And to ensure only the rightful owner of the vehicle is allowed to even touch it.\nYour invoice copies will reflect that our storage charges are $30 per day, Which added in to your total price accrued of $360, And paid in full.\nMy apologies on having to meet on social media as a platform for resolution.\nPlease don't hesitate to contact us for any future towing needs, We'd be glad to amicably assist you in any way we can."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "100900918828740958008", "name": "Elaine Lasseter", "time": 1613788723193, "rating": 1.0, "text": "Had to pay $125 service fee and $7 per gallon of gas. They only brought 1 gallon of gas and our car still would not start. To bring more gas would cost another $125 service fee. My mom, daughter and I were left on the side of the road to try and find another way to get my mom to dialysis. This is the 2nd time we have called to hire this tow company just to be left on the side of the road", "pics": null, "resp": {"time": 1614090600646, "text": "Our team wants to extend our sincerest apologies concerning the issues that you have faced. We pride ourselves on maintaining the highest quality standards for our customers/clients; we hope you will give us an opportunity to discuss your concerns further with you. You can reach out to us at (205) 405-1888. We hope to find a solution promptly."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "103599203463649838122", "name": "Bigbodi Status", "time": 1616431745344, "rating": 5.0, "text": "I was satisfied with him moving a storage unit building from 1 location to the next. All went well I appreaciated their service they were perfessional well mannered prompt curtious and on time and the pricing he gave was fair justifiable to the job done. 👌👌👌👌💪💪💪💪👍👍👍👍👍👍👍 I rock with Hank towing company and if I need him again I would defintly  call on him again.     💪💪💪👆👍✌💃💃💃💃 Thank you very kindly  indeed", "pics": null, "resp": {"time": 1616445881720, "text": "We appreciate the 5 stars! Thank you for rating Hank's Towing Service! We invite you to contact us again for your towing needs. We'd be happy to provide exceptional service to you again!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "108746921711629971745", "name": "Karin Liddle", "time": 1598471786458, "rating": 5.0, "text": "Fast and professional!!!\nGood people!!!\nThabk you Mason😁", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPayZ3n9ZzEwSrFj7Van0TZyYWeYugPWiO8LUWD=w150-h150-k-no-p"]}], "resp": {"time": 1598537837400, "text": "Feedback like this is what we like to hear!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "117050135421301581858", "name": "Brittney Busbee", "time": 1626116987797, "rating": 1.0, "text": "They were rude to me from the get go. Horrible. Do not use them.", "pics": null, "resp": {"time": 1626288137204, "text": "We're very sorry you were treated like this. Our customer's experiences are essential to who we are. Please give us a call at (205) 405-1888 and tell us what happened so we can improve."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "108631113114482894174", "name": "Billy Ford", "time": 1626637134878, "rating": 1.0, "text": "They never showed up, Left us hanging", "pics": null, "resp": {"time": 1626890541852, "text": "Our customers are very important to us and we are sorry to hear we may have let you down! Please reach out to us at (205) 405-1888  when you're able so we can discuss this situation further."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "102804340504906802132", "name": "Charles Ousley", "time": 1623792415381, "rating": 5.0, "text": "Professional and good attitude.", "pics": null, "resp": {"time": 1623943488602, "text": "Hey there Charles, thanks for the kind words! Take care and have a great day!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "110254418746318475291", "name": "Tony Parker", "time": 1590094122110, "rating": 5.0, "text": "Called to have car towed to a shop.  Said it would be approximately an hour, which was not a problem.  An hour later they arrived to pickup the car.  Driver introduced himself (Tony), very cautious as he loaded the car, extremely nice and friendly.  Very satisfied!!!", "pics": null, "resp": {"time": 1590670749248, "text": "Tony, thank you for the kind words!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "113967815641686647555", "name": "Kristi Glass", "time": 1623740940988, "rating": 5.0, "text": "Great service and great people", "pics": null, "resp": {"time": 1623790446956, "text": "Kristi, thank you for your 5-star review of Hank's Towing Service! We are happy to hear we could provide great service. Take care!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "101821408648044876800", "name": "Keena Lowery", "time": 1595026874283, "rating": 5.0, "text": "Mason was extremely helpful and knowledgeable. He was kind and made sure I was taken care of! Truly appreciate all he done this morning.", "pics": null, "resp": {"time": 1595424268221, "text": "Thank you Ms. Lowery for the 5 stars and kind words!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "102957809898389018908", "name": "johnny nixon", "time": 1614383575382, "rating": 5.0, "text": "There when we call yo are always there And that is good business And one where pulling a mobile home out and we get stuck we always call you all and you never have no problem coming to get us", "pics": null, "resp": {"time": 1614622725792, "text": "Thank you for the five-star review of our towing service, Johnny! We're so glad we could be there for you, and provide you with efficient and reliable service!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116795073501812397861", "name": "Freddy Stanford", "time": 1605301382801, "rating": 5.0, "text": "Hank's towing service got me out of a real jam, and didn't steal anything out of my vehicle!!! I'd give them 6 starsif they had it!!", "pics": null, "resp": {"time": 1605593035764, "text": "Hello and thank you for taking the time to share your detailed feedback! We are thrilled to hear that you have nothing but amazing things to say about our team at Hank's Towing Service and what we offer. Thanks and have a great day!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "111858144905391506651", "name": "Chris Fraser", "time": 1588189650403, "rating": 5.0, "text": "Excellent company. Friendly service from start to finish. Punctual, courteous, and professional recovery technicians. VERY fair pricing on the recovery work they performed. 10/10.", "pics": null, "resp": {"time": 1589548720708, "text": "Thank you for the kind words. It was our pleasure to be of service."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "110436122698108155717", "name": "Kristian Bunt", "time": 1551562846199, "rating": 5.0, "text": "Just got my inoperative truck towed over to my grandmother's house. VERY pleased with the service. My driver was extremely nice and gave great service! Very pleased with the price as well. Will definitely use Hank's towing again!", "pics": null, "resp": {"time": 1552061647215, "text": "Hopefully, you won't need our service again, but if you ever do we're only a phone call away. Thank you for the five stars!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "114437160036838909392", "name": "Ashley Haynes", "time": 1593806562624, "rating": 1.0, "text": "Horrible horrible customer service. So very rude. They took my car Thursday night at 5:30 and we're supposed to drop it off somewhere that is 10 min from my house. I called the body shop at 1:20 pm on Friday he said they never delivered it. So I called Hanks. She was so rude and said at 8:10 on they were closed. Umm yep 3 hours later they would be. The guy at the body shop said that he got a call at 8 am saying they would be delivering it. Well they still had not. They said they needed to hear from the insurance company. So I called Geico. She said they already had the order put in. The lady at Hanks was so rude.  They were talking about us and saying he muted it but it was not. I have it all recorded. The lady at Hanks said it will be $325 to pick it up because Geico said to leave it in their lot which they did not. So Geico told her she was having someone come pick it up and give payment. 1 hour later they said they were closing and that someone could get it Monday Morning.  The guy from Geico that schedule the pickup on Thursday said wow that was the worst customer service I have ever had. And now I see what he is talking about.  DO NOT USE THIS COMPANY. They are crooks. They did that just to get extra money.", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "115036915740821493404", "name": "TaeBeastlyArt", "time": 1601934583456, "rating": 1.0, "text": "False advertising. They don't buy junk cars and the lady that answered the phone was very rude. I was asking about their services and she hung up in my face. Very unprofessional.", "pics": null, "resp": {"time": 1601996859305, "text": "Hello. Thank you for bringing this to our attention. We do not condone this type of behavior from any of our staffs, and we'll be looking into this. Please, contact us directly so we can gather more information about this incident."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "111169638851357869918", "name": "Jessica Davis", "time": 1581152781608, "rating": 5.0, "text": "It was 12:30 am and I was broke down on the side of a 2 lane highway and call my insurance roadside service and unfortunately they couldn't help me. Called Hank's Towing Service and they were glad to help. I would recommend this company to anyone.   Thank you for your help.", "pics": null, "resp": {"time": 1581352413381, "text": "Thank you for your five-star review, Jessica. Our team at Hank's Towing Service always strives for the highest standards. We are delighted we made your experience a positive one. Until next time, take care"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "109979829307835415450", "name": "Shannon Clanton", "time": 1596100820852, "rating": 5.0, "text": "The driver was very nice and right on time for when they said", "pics": null, "resp": {"time": 1596138668358, "text": "We're happy to hear you had an awesome time with us at Hank's Towing Service! Thanks for sharing your experience. We hope you stop by and see us again soon."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "111628192260628708159", "name": "Kim Bentley", "time": 1544423235902, "rating": 5.0, "text": "I thought they did a great job. My car was stuck in mud in the middle of the night/morning and would not budge. They were there to help me in no time. Hopefully, I won’t have a need to, but if I’m ever in a situation in which I need towing assistance again, I would definitely call them.", "pics": null, "resp": {"time": 1545092617205, "text": "Kim, thanks for the five stars. We're grateful for the review, and while we also hope that you don't get stuck in the mud again if you ever do don't hesitate to give us a call!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "107888898573396694333", "name": "Alvin Gray", "time": 1503554098902, "rating": 5.0, "text": "If you're ever in need of a tow in or around Lincoln Al your number one choice is Hanks hands down! I'm a owner operator and Kenny really went above and beyond to help me. I didn't think service like this was still in existence. I am truly grateful! Thanks Kenny. Hank's will always be my number one choice", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "107387173375711575364", "name": "Timothy Richey", "time": 1622185189248, "rating": 4.0, "text": "Just ok", "pics": null, "resp": {"time": 1622652615449, "text": "Thanks for the four stars! Have a great day."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "106821380703001237375", "name": "Keith Martin", "time": 1547176868943, "rating": 4.0, "text": "Quentin and his son Michael were the most polite and curtesy guys I have met. They worked safe and quick to help me get unstuck. Michael was raised right By his dad he showed manners  and Always said yes sir no sir", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "107848514114374007553", "name": "Krissy Cinnamon", "time": 1528427381461, "rating": 5.0, "text": "My car broke down on a very dangerous part of the highway in 100 degree temperatures on Monday. I was an hour from home and completely stranded. They showed up VERY quickly, made sure I was safe, and got me quickly to my mechanic. They even offered to stop at a store and let me get a drink because the weather was so hot. Friendly, fast, and dependable. THANK YOU!!", "pics": null, "resp": {"time": 1528743080550, "text": "Friendly, fast, and dependable are the types of service that we aim to deliver! Thank you for taking the time to lave us such a great review."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "108930652476130539230", "name": "Brian Anthony", "time": 1579974887314, "rating": 5.0, "text": "I didn't use Hank's in the conventional sense, But my insurance (progressive) sent a driver out to my home to pick up my deer damaged vehicle and take it to Birmingham for Progressive to look at.\nYour driver was Joey, And I haven't had a better experience with anyone during this period than he was. The tow truck the police called out to pick my truck were nice and quick, But when they asked where I wanted them to take it to, they seemed a little bit annoyed that I wanted it to go to my home, as I wanted to talk with my insurance agent first. I suppose they prefer taking them to their place or a body shop.\nWhen they unloaded my truck, a good bit of the plastic from the headlight and grill fell out on the tow truck, And the driver just brushed it off into my yard where my truck was sitting. I didn't think much of it, I'd just clean it up in the morning when I went out to take pictures to start working with my insurance.\nI talked to my insurance, They told me because it's a newer model truck,  That they would have someone from their salvage provider come pick it up, I believe it was 3 days later when I got a call from a lady from IIA or IAA, saying that she was about to be giving a driver the information to come pickup my truck and verified my address and the damages with me.\nNot too terrible long after I spoke with her and said ok to having another tow truck company come out, Joey actually called me when he was roughly 30 minutes away from my home to verify my address and that everything was ready to go. He showed up just as he said and came to the door and got me to explain why he was there, And actually gave me the rundown on the process of what would happen if progressive did or did not total my truck. I handed off my keys to him, He went and got  his truck from the street and backed it in to where he'd be able to load it up. Before he backed up into the location, he did ask me if I had septic in the area (I I didn't)  He said he always asks when he has to enter a yard,  Said he's never had a problem with accidentally finding a tank but really didn't want to have to make phone calls explaining a problem!  LOL!\nHe got down under my truck and did his work with some chains, Put it in neutral to wind it up his truck and chain it down. Now, this is where I became surprised,  He picked up every piece of plastic and debris that had come from my truck and put them in the bed. I never asked him to!\nI asked why he did and he said he wanted it to be just as if he and my injured truck were never there. I'm still amazed that there a people that have that mindset.\nWe talked for a few more minutes as he finished loading and chained my truck down, I asked where they were out of and he gave me a business card with everything on it. I'm in Chilton county, So it's not feasible for me to call a company that's an hour plus away,  But he told me that you have trucks all over the place at any given time, And to call if I needed help, That you might be right down the street!\nAs I said early on, I never thought that my best experience in this headache would have been the guy that picked up my truck and towed from my home to Progressive's auction yard. It ended up being totaled,  But I'm loving my new blue f150!\nThank you to Joey and Hank's!", "pics": null, "resp": {"time": 1580148883770, "text": "That is so amazing to hear, Brian! Thank you so much for taking the time to share your feedback with our team at Hank's Towing Service. It's great to know that we continue to provide our customers with everything they need. Have a great day!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "107032861619479570294", "name": "Rob Mathis", "time": 1473729698548, "rating": 5.0, "text": "They came for us broken down on I-20 on a Sunday morning. Recommended!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIbLJw_mdEbV3XKWEWSybEMob_kmyTBs-MbHBW=w150-h150-k-no-p"]}], "resp": {"time": 1494270956903, "text": "Thanks for recommending us, Rob! We're glad we were able to help. Call us whenever you need us, we're here to help 24/7"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "111211902594883975933", "name": "William Caldwell", "time": 1525940030615, "rating": 5.0, "text": "Extremely good service. Kenny knows his job well. Safety orientated and very thorough. Reasonably priced. 5 stars ☆☆☆☆☆", "pics": null, "resp": {"time": 1525962385101, "text": "Thank you for the compliments. We appreciate you taking the time to leave us a positive review."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "114146795662966968914", "name": "Julie Wilcox", "time": 1531239117625, "rating": 5.0, "text": "Lost tire. Called Hanks. They answered right away. Sent a truck right away. Got to us way quicker than expected. Timmy was wonderful. Got us to the recommended tire place. We are getting our new tire put on right now. All of this in 25 min. Excellent. I highly recommend these guys.", "pics": null, "resp": {"time": 1531434585264, "text": "We do our best to be quick and efficient while still offering great customer service. Thank you for the review, Julie. We're happy we were able to be of assistance."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "103753393183325999420", "name": "Star Jennings", "time": 1555036867445, "rating": 5.0, "text": "Answered the phone promptly, assisted with narrowing down my location in a moment of panic and a friendly gentleman arrived within a reasonable time. Very helpful. I will call again if I have another situation in need of a tow!", "pics": null, "resp": {"time": 1555091061789, "text": "We know that when you need our services you can be in a bad situation, so we're happy to hear that we were able to help during a moment like that. Thank you for leaving your feedback here. We're grateful for the positive review."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "104789064783540642328", "name": "Ande Zimmerman", "time": 1530151147908, "rating": 5.0, "text": "Love these folks!! They have helped me, and people I know several times and I’d recommend them to anyone!!! Honest and hard working folks", "pics": null, "resp": {"time": 1531434534912, "text": "Ande, thank you for taking the time to leave us such great feedback. We're happy to hear we were able to provide five-star service."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "100695900821209790841", "name": "Renee Martin", "time": 1527527337284, "rating": 5.0, "text": "Absolutely amazing. On Memorial day moving from IL to AL for the military the trailer I was pulling my car on broke instantly they came out in less then 20 mins towed my car and removed my car from the trailer it was on. Was very helpful and knowledgeable and possess awesome customer service.. I would call them everytime for any of my towing  needs and other services they provide.", "pics": null, "resp": {"time": 1527719132871, "text": "Renee, we're grateful for the positive review. Thank you for taking the time to leave your feedback on your experience with u and for the recommendation. It's one of the best forms of thanks we can get."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116496269735819830689", "name": "Virginia Franks", "time": 1554653846796, "rating": 5.0, "text": "Very prompt service. Did a good job at a fair price.", "pics": null, "resp": {"time": 1555090866301, "text": "We're happy we earned five stars, Virginia! Thank you for taking the time."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "100869399732889324041", "name": "Roger Kirkland", "time": 1560995234610, "rating": 5.0, "text": "broke down in pell city after buying a vehicle.placed a call to hanks towing and only had a 20 minute wait at the most. the driver was justin.b, super nice guy knew exactly what he was doin and very professional. i drive a tow truck for a company out of jonesboro georgia so i know what to look for when getting towed from another company and justin took the time to do every step the right way.  if i ever need a tow again in the state of alabama i will be calling them again", "pics": null, "resp": {"time": 1561123579415, "text": "Thank you, Roger, for taking the time to share your positive experience! We're glad you chose us and we appreciate the recommendations. Thanks again and have a great day."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116056524156096779082", "name": "Callie Zimmerman", "time": 1530149808498, "rating": 5.0, "text": "My driver was awesome! He went above and beyond for me. Would recommend for sure!", "pics": null, "resp": {"time": 1531434443728, "text": "We appreciate the recommendation, Callie. We do our best to make every experience with us a pleasant one."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116465124638380531728", "name": "Jacob Harris", "time": 1558622876412, "rating": 1.0, "text": "This place is a joke workers have attitudes dont know what they are doing the lady in the pellcity office was verynice and helpfull but if u need a tow or anything use somebody else they are crooks and like i said a joke", "pics": null, "resp": {"time": 1558710941566, "text": "Hello Jacob,\nWe are sorry to see this as this is not how we do business. Please contact us directly and we will work to turn this around."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "118060161194111093268", "name": "Jason Simmons", "time": 1538855345886, "rating": 1.0, "text": "Do not CALL!!!! They are liars and will leave you stranded and never come. I was .5 mile from them. I could see there lot and they said they were coming. 2 hrs later said they were coming 4 hrs later said they were coming. I finnally called ABC Towing. There in 30 mins. Hank never showed up or called to find us. Do not give any business they are liars and will tear your vehicle up towing it.\n\nAgain do NOT do business with these guys. The owner is not being truthfull. They quit answering there phone and never came to get me off the side of the road. They claimed there was an accident and 6hrs later they still never came. Dispatch wouldn't give me drivers phone number and she said she could not get in touch with driver because the drivers don't answer their phones when at wreck scenes. All LIES. I called another company and they instantly gave me the drivers number and the driver was there within 30 mins.", "pics": null, "resp": {"time": 1537375663167, "text": "Hello Jason,\nAt the time that we scheduled your pickup, we were rerouted to a fatal accident scene which altered our timeline. We hope you understand and apologize for any inconvenience on our behalf. We will work to resolve this at no charge. Please reach out to us so we can speak further."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "108588189997805209182", "name": "Stephen PIKE", "time": 1519870348625, "rating": 4.0, "text": "Skys limitless repo uses Hanks for all vehicle calls and none have been left behind yet,,,..", "pics": null, "resp": {"time": 1520011120885, "text": "Thank you for taking the time to leave us a positive review, Stephen."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "103275261109832774154", "name": "Regenia Rowell", "time": 1524486399586, "rating": 1.0, "text": "We had a building scheduled to move for a week with a very limited time frame. Waited on them ALL day. Were told when we would have to call them they were delayed but would be there. It never happened. No call. No show.", "pics": null, "resp": {"time": 1525181970488, "text": "Hello Regenia,\nPlease give us a call, we only do building moves on Saturdays and don't have a record of you in our system.  If the mistake was in the scheduling, it is extremely important for us to know how the ball was dropped so that we can avoid the situation in the future.\nThank you,"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "113362411365935984912", "name": "monique harger", "time": 1583533604076, "rating": 5.0, "text": "He is quick and very professional A1!!!", "pics": null, "resp": {"time": 1583773168021, "text": "We appreciate the five stars! Thank you for rating Hank's Towing Service and have a great day."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "113865120356959282123", "name": "Blake Bice", "time": 1550546790699, "rating": 5.0, "text": "Awesome people! Very helpful", "pics": null, "resp": {"time": 1550875616755, "text": "Thank you for saying so. We appreciate the feedback."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116016198768770199634", "name": "Travis Burdick", "time": 1578254291788, "rating": 5.0, "text": "These people are amazing!", "pics": null, "resp": {"time": 1578411624046, "text": "Thank you for the great rating Travis. We appreciate it."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "106563334138667101871", "name": "Nigel Henderson", "time": 1579120794369, "rating": 5.0, "text": "Towed me out quick", "pics": null, "resp": {"time": 1579189208156, "text": "We are super excited to hear about the positive experience you had with us Nigel. Thanks."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "110855318264698813047", "name": "Judy Collier", "time": 1581430428268, "rating": 5.0, "text": "Always quick to arrive and helpful", "pics": null, "resp": {"time": 1581526428095, "text": "It was our pleasure, Judy! Thank you so much for your review!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116451838233098155916", "name": "Amanda Huish", "time": 1539363119596, "rating": 5.0, "text": "I have had a car towed before by another company that was the worst. Hanks towing is far from that. They seemed to really care about people more than money", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "111456805304903482005", "name": "Jason Watkins", "time": 1579393647638, "rating": 5.0, "text": "Really great experience!", "pics": null, "resp": {"time": 1579636076969, "text": "We appreciate the excellent rating Jason. Thanks for the feedback."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "106543999229831009437", "name": "Jantae Shaw", "time": 1566115149504, "rating": 1.0, "text": "Horrible service. If you can even get anyone one the phone. They will lie to you and tie up your entire day", "pics": null, "resp": {"time": 1566834968848, "text": "Hello Jantae,\nWe apologize for any inconvenience that you experienced on our behalf. We intend on providing the best service in town. Please contact us directly and we will work with you."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "110074992736756078728", "name": "Jim Goodman", "time": 1536370084711, "rating": 1.0, "text": "Broke down on interstate one mile from there shop .talked to the lady ten times four hours later still no tow truck.but she still says on the way beware of those liers", "pics": null, "resp": {"time": 1537375555249, "text": "Hello Jim,\nHere at Hank's Towing Services, this is not how we conduct business. We have not been able to locate you in our system but invite you to reach out to us directly so we may find out exactly what happened here. We apologize for any inconvenience."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "113920861392222078736", "name": "Darlene Willis", "time": 1527886157844, "rating": 5.0, "text": "Was there quick when called.", "pics": null, "resp": {"time": 1528139533010, "text": "We value our customers' time and work to prove it. Thank you for your business and review, Darlene."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "107550197925864082072", "name": "James Samples", "time": 1511426436698, "rating": 1.0, "text": "Awful service had me waiting for four hours in a broke down car and never showed up tried calling with no answers. 0 stars!!!", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "117617743387806460673", "name": "Joe W", "time": 1464008297092, "rating": 1.0, "text": "I couldn't ever get these guys on the phone. And when I finaly did they never showed up. Then they charged me $30 a day for my car sitting there when these guys don't know how to use there phones...", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "108627382678694727749", "name": "Manuel Hernandez", "time": 1525486724273, "rating": 1.0, "text": "Called for a tow scheduled to be picked up 7am talked with Kenny he said yes sir would be there so it could go in get a new radiator, the shop told him 8 o clock so he could have it done before 5, sad to say didn't get there till 2, on top of that was told by Kenny him self that if I had to stay the night he would split hotel cost .. never happen ... would not ever again use Hanks towing cause of how lazy and dishonest the guys are .... 0 star rate for me ..", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "114612291312521021412", "name": "Shane Adkins", "time": 1572181704082, "rating": 4.0, "text": "Driver was nice", "pics": null, "resp": {"time": 1572296968093, "text": "Hi Shane. Thanks for leaving us some feedback. If you ever need us again, we'll be going after that 5th star."}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "116252321019934573158", "name": "Scott Knepper", "time": 1531447758009, "rating": 5.0, "text": "I have used three times.", "pics": null, "resp": {"time": 1532384465461, "text": "Thank you for your repeat business!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "118267468004152491693", "name": "auston carlisle", "time": 1532584379870, "rating": 5.0, "text": "Fast and reliable", "pics": null, "resp": {"time": 1532992464255, "text": "Thank you for saying so, and thank you for the review!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "114437031540402470981", "name": "Trinity Garage", "time": 1510195319996, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1510246011862, "text": "Great service is what we aim to deliver, Steven. Thank you for the positive review!"}, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "113606017393364037514", "name": "explorer9955zxx", "time": 1435781265086, "rating": 2.0, "text": "pricy", "pics": null, "resp": null, "gmap_id": "0x88897db96788dee1:0x114d8b6e5cb6aaab"}
{"user_id": "109628793371239404342", "name": "Eden Snyder", "time": 1626919757840, "rating": 1.0, "text": "For anyone considering calling this place for a tow, save your time and money and stay FAR away!! We have had not one, but TWO horrible experiences with this tow service. The first time, they left my 70 year old Father stranded in 90° weather for hours on end, we have AAA and they assigned Hank's to the tow job. They accepted the job and didn't call/notify/cancel the job to give my Dad the opportunity to get another company assigned to the job, they just left him stranded!!! Then, my husband called them last night and they accepted his request for a tow directly,no AAA,  he called them himself since they were close. They told him they would be there in no more than 45 minutes. 1 hour later, no word. He calls them back, they say they took another job and would get him as soon as they finished. 3 HOURS LATER, my husband is still stranded and calls them for the third time. They end up telling him he may be better off calling another company. God forbid what would have happened or how long my husband would have waited if leaving it up to them to follow up on a service they accepted to begin with. Y'all are clearly in the wrong business, and people can be seriously hurt or have personal things in their life that an be SEVERELY affected by your negligence and lack of consideration. Thank God they weren't on their way to work or something pressing that required a timely arrival. Lesson learned. I will be sure to let AAA know to never assign this business to my tow jobs again, and I would recommend the same to all of you, unless you want yourself and loved one's to be stuck out in the middle of the night with no help or in the blistering Alabama heat. Spread the word, Hank's is not a reliable service and should not be in the business they are!", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "100792376223105894118", "name": "Usa Volvotruck99", "time": 1618068013584, "rating": 1.0, "text": "I loose my front tire on the  exit 168 on I 20 , One of the driver was towed my truck  to TA 1 mile when he was lifting it, the truck filled, and when I asked him what happened, he got angry, his response was provocative and disrespectful. And there expensive. 700 $  and roud .", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "102803234399395676545", "name": "Cody Prater", "time": 1627600125353, "rating": 5.0, "text": "Grate people friendly service", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "102821068760315593665", "name": "duane weller", "time": 1598899071761, "rating": 5.0, "text": "Called them about problem with trailer I was pulling. They referred me to a shop they shared a lot with. Went there and in 1 he. They had me back on the road problem solved. The name of that. Place was put row. Can't say enough good things about them!", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "112064989452045165584", "name": "Patrick Gibson", "time": 1619646363344, "rating": 5.0, "text": "Excellent job", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "117615369453248631604", "name": "Capo Luciano", "time": 1626225174180, "rating": 1.0, "text": "Female got an attitude", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "105157120613627898093", "name": "Michael Sarhal", "time": 1572451837728, "rating": 5.0, "text": "Dispatch is a pleasure to deal with! They kept me up-to-date with new information. Drivers are professional and quick.", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "112147230009844152755", "name": "Mary Chandler", "time": 1606155114118, "rating": 5.0, "text": "Thanks for saving me by getting my keys from being locked in my car.", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "102616258699534116846", "name": "Geoff Smith", "time": 1602702416261, "rating": 5.0, "text": "Fast and professional!", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "101912438593950075850", "name": "DaVda Rocks", "time": 1515609449852, "rating": 1.0, "text": "01/10/2017 Called at 6:58am give location , owner stated had 7 trucks no problem ...\nwaited one hour called back got message to call another number...\nvoice message to call the number I just called.\nCalled John's towing in Lincoln got tow truck in 14 minutes.\nDon't use..", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "106921202453834615045", "name": "Steve Yancey", "time": 1459982339481, "rating": 1.0, "text": "First it took well over an hour for the truck to show. Then the driver has to borrow a hitch ball and wrench from me. After towing me back to his shop he leaves for another ten minutes then returns to remove the ball. After stripping the threads it has to be cut off. Since this was a pin removable ball, I had to replace the whole set for $80. When I asked for help replacing it he said I was ridiculous to ask since he towed me a whole two miles for only  $120. A true jack leg and a jack ass. I wouldn't trust him to find his feet with a flashlight.", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "102888835310784880856", "name": "kenny nock", "time": 1493628266738, "rating": 5.0, "text": "Very nice people treated me and my family very good thank you hanks towing for Taking such care of us", "pics": null, "resp": {"time": 1494271423012, "text": "Thanks for the nice review, Kenny! We are so glad we could help you and your family. Count on us whenever you need help again. We're just a call away!"}, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "109446033692787507798", "name": "Jonathan Williams", "time": 1494417450301, "rating": 4.0, "text": "They were resunable on their prices and are willing to work with you on getting your vehicle out.", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "101700474811298617328", "name": "Nelson Thompson", "time": 1535635526335, "rating": 1.0, "text": "They towed my truck and when they got to their yard they stole a projector, a pair of Costa sunglasses that they had to work at to get, cellphone holder that was in my glove box, taser flash light with its charger cord, and my spare key and magnet key storage. And I do believe that they took my other key to my lock cause I still haven't found that yet. What a bunch of crooks.", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "105731282604619586522", "name": "Sahal Dahir", "time": 1533556481560, "rating": 1.0, "text": "I called 1600 never showed up I called again 2100 told me he will be with me in 30 minute never showed up I called him back he told me on my way and he never showed up . This guys are like xox", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "107387173375711575364", "name": "Timothy Richey", "time": 1575058695344, "rating": 1.0, "text": "Unavailable \"on call\"", "pics": null, "resp": null, "gmap_id": "0x888bd05ac4e36e53:0x8633b0c9de398db7"}
{"user_id": "110350827593828084384", "name": "Karen Hardin me", "time": 1611086890014, "rating": 5.0, "text": "Best service around", "pics": null, "resp": {"time": 1611653451516, "text": "Dear Karen Hardin me, Thank you so much for taking the time to leave this excellent review.  We really appreciate your business.  Please let us know if there is anything we can do for you in the future. -Southeast Crane & Hoist"}, "gmap_id": "0x88897d7c07b9ec9f:0x3ed1b1b71719536"}
{"user_id": "106609073303854021111", "name": "Mark Turner", "time": 1504043617754, "rating": 5.0, "text": "Great company,with honest people,along with quality service!", "pics": null, "resp": null, "gmap_id": "0x88897d7c07b9ec9f:0x3ed1b1b71719536"}
{"user_id": "109874044851076709678", "name": "Brittany Sullivan", "time": 1516998046468, "rating": 5.0, "text": "Best service done right!", "pics": null, "resp": null, "gmap_id": "0x88897d7c07b9ec9f:0x3ed1b1b71719536"}
{"user_id": "107387591078221286136", "name": "Bobby Withers", "time": 1517435167921, "rating": 5.0, "text": "Best service in the southeast", "pics": null, "resp": null, "gmap_id": "0x88897d7c07b9ec9f:0x3ed1b1b71719536"}
{"user_id": "117227048773518563546", "name": "Mike Keith", "time": 1533525556742, "rating": 5.0, "text": "Very professional", "pics": null, "resp": null, "gmap_id": "0x88897d7c07b9ec9f:0x3ed1b1b71719536"}
{"user_id": "107114981920590503761", "name": "Anthony Tamburello", "time": 1561481874093, "rating": 5.0, "text": "Very professional  ,", "pics": null, "resp": null, "gmap_id": "0x88897d7c07b9ec9f:0x3ed1b1b71719536"}
{"user_id": "105823337159684606575", "name": "sean gaddy", "time": 1559267194922, "rating": 5.0, "text": "Have everything you need for moving large, lots or all types of equipment and materials. Very knowledgeable group of Guys!", "pics": null, "resp": null, "gmap_id": "0x888bb4175fdabf6b:0xb3ef0d8494da73de"}
{"user_id": "114170034967136530000", "name": "Tim Mccurry", "time": 1562551406133, "rating": 5.0, "text": "They are very professional, skilled, knowledgeable, dependable, reliable and have very competitive prices. I have been using them exclusively for 20 years.", "pics": null, "resp": null, "gmap_id": "0x888bb4175fdabf6b:0xb3ef0d8494da73de"}
{"user_id": "111756973220949361790", "name": "scott penuel", "time": 1472056554177, "rating": 5.0, "text": "Great communication on scheduling.", "pics": null, "resp": null, "gmap_id": "0x888bb4175fdabf6b:0xb3ef0d8494da73de"}
{"user_id": "100257855880243381687", "name": "Matthew Franklin", "time": 1584069219556, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x888bb4175fdabf6b:0xb3ef0d8494da73de"}
{"user_id": "105569286792409333039", "name": "not sure", "time": 1563451646015, "rating": 1.0, "text": "Your drivers need to review the learning manual.", "pics": null, "resp": null, "gmap_id": "0x888924573fd3aba3:0x784fb541d33faeb5"}
{"user_id": "107312505951853476446", "name": "Jonathan Sigmon", "time": 1494163405628, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x888924573fd3aba3:0x784fb541d33faeb5"}
{"user_id": "111363596681231828682", "name": "Frances Mendoza", "time": 1627740241853, "rating": 1.0, "text": "I called to get a vehicle towed and the first lady was nice, but another female in the background  was yelling and got on the phone, She would not let me explain i was having MY vehicle towed to my office. Very unprofessional.:\nupdated Your response is not correct in regard to that phone call The business was identified in the beginning of the conversation and your female associate was the only rude one. Had she stopped yelling I would have explained that that was fine but my personal vehicle also needed towing from a different location.", "pics": null, "resp": {"time": 1627737644158, "text": "We don’t do any Repo’s at all, someone in your office was trying to pull one over on us, acting like it was a normal tow which it was not… they failed to say it was a repo and then they got a attitude when we told them we don’t do them and if we did it would cost more than a regular local tow."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "110068577280136249820", "name": "Spiritisalive1", "time": 1624304723174, "rating": 5.0, "text": "Driver was very professional, arrived when he said he would. Handled all my business with a dealership in another county. Made the whole experience stress free. Definitely will use them again.", "pics": null, "resp": {"time": 1624462792871, "text": "Thanks for the great review! We're glad you had a good experience. Take care."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "111185458041701003469", "name": "Janice Alldredge", "time": 1622120019876, "rating": 3.0, "text": "I was denied  getting a receipt  from the driver.  Said, Ace towing didn't do that. I needed it for my  records. I sure would  appreciate it if you sent  us one. Driver was very nice.", "pics": null, "resp": {"time": 1622145294956, "text": "Hi Janice. Thank you for reviewing us and offering your sentiment. Please call us at (256) 571-7397 so we can further discuss. Thank you!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "115860167730400630707", "name": "Ann Loyd", "time": 1618919857425, "rating": 5.0, "text": "I've used Ace towing several times. I appreciate their service.  They have always taken good care in getting the job done and getting me back on the road. I highly recommend 👌", "pics": null, "resp": {"time": 1619028271736, "text": "Thanks for being a repeat patron, Ann! We appreciate the review!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "112410163162826009327", "name": "James Derringer", "time": 1626447082751, "rating": 1.0, "text": "This company has been around for awhile and continue to hire new people. I never understood why they had such a high turn out until this year. The manager/owner has an absolutely terrible attitude with his staff. I don't care how cheap a business is if they treat the employees like this I will do my best to avoid them. I've personally witnessed his angry attitude while waiting to pick up my truck from a wreck. When you run a business your employees make it efficient. Without good employees you can't have a great business.\n\nI wrote this for my grandpa, he is over 80 and asked me to help him.", "pics": null, "resp": {"time": 1626448238538, "text": "I hate you feel this way but 99% of the time when we hire new people Is because we are growing and buying more trucks so yes there is a lot of new people   And I like to hear more about this wreck your talking about call us so we can understand more what you are even talking about 256 571 7397"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "108410027990668447230", "name": "Heather Chandler", "time": 1618588899550, "rating": 5.0, "text": "Great company! I have used them multiple times. Never a long estimated time of arrival. Always friendly. Help any way they can.", "pics": null, "resp": {"time": 1618841043161, "text": "Thank you so much for the 5-star rating of our towing service, Heather! We truly appreciate the feedback, take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "115319276034568085393", "name": "Blake Welch", "time": 1624040682355, "rating": 5.0, "text": "Jerry was a great service provider helped me get where I needed to go and was very friendly", "pics": null, "resp": {"time": 1624044529942, "text": "Thanks for the review, Blake. Call us if you need towing or roadside assistance in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "100799403960777165054", "name": "Shirlee Bailey", "time": 1617129638266, "rating": 1.0, "text": "This company was used by my insurance roadside assistants. They said that because I had All-State insurance they were not putting me first because All-State doesn't pay well. That tells me that it's not about who is in need of help, but how our insurance pays them. I sat on the road for almost 6 hours with 3 kids.\nWhen I called the place in which my car was to be towed, they said it was never delivered.\nMy vehicle was still sitting on the road even after I was sent a text saying it would be picked up at 4:37-4:52, only it was moved about 600 feet to where we initially stopped. The kids built a pyramid of rocks while playing in the ditch, which was approximately 600 feet to where the car was. Which tells me they loaded it then put it back down. WHY IN THE WORLD WOULD YOU DO THAT? Never again.", "pics": null, "resp": {"time": 1618836909946, "text": "This was on a very busy day, we told this potential client that we would get to her once we were finished with the calls that had come in earlier. She demanded that we get to her first and after some very uncomfortable phone calls we decided that we did not want to do business with said potential client. We informed the roadside insurance of this decision."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "114971774806745297921", "name": "Michelle Smith", "time": 1597859142473, "rating": 1.0, "text": "If you want to be talked over when trying to speak or talked rude to this is the company to use. I called them to explain something just like my insurance company asked me to do. Jason was very rude telling me I shouldn’t even be dealing with him only my insurance company should call him. First off its our vehicle and I’ll call all I need to about it especially when instructed to do so by my insurance company. I was belittled and talked to rudely. Our company will not use them again. We also requested our truck be dropped off at home 3 miles from the accident. He said oh no let me take it to my lot so the insurance company will come out faster. Which we let him do and it cost us $2800.00 because they didn’t come out faster and it sat there from 6/26-8/21. I’ll say the lady in the office was always nice when I spoke with her but Jason who I believe is the owner has no customer service skills. When someone calls to ask about their vehicle you should be willing to answer any questions they have and be nice about it regardless if they have their insurance company involved or not. Especially when you’re telling me a different story then my insurance adjuster told me minutes before I called you.", "pics": null, "resp": {"time": 1601211158625, "text": "This was not a issue on Ace Towing this was matter of insurance wasn’t notified properly, and when they did come we had to do what they told us to do, we strive daily to help and be reliable to ALL our customers. Thanks"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "101118139834634442543", "name": "austin croslyn", "time": 1602290855207, "rating": 4.0, "text": "If you need service and are seeking the best and most knowledgeable around, ask for Brandon Bartlett by name. Unprecedented knowledge and respect. 5/5 stars!", "pics": null, "resp": {"time": 1602604880591, "text": "Hello and thank you for taking the time to share your detailed feedback! We are thrilled to hear that you have nothing but amazing things to say about our team at ACE Towing LLC and what we offer."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "107049464995190951194", "name": "Julie Pendergrass", "time": 1601557066964, "rating": 5.0, "text": "When you call, ask for Brandon Bartlett for excellent customer service and support when you need it the most. He works hard and gets the job done in a timely manner.", "pics": null, "resp": {"time": 1601656519066, "text": "Thank you for your five-star review! Our team always strives for the highest standards. We are delighted we made your experience a positive one. Hopefully you stay on the road with no issues, but if you ever need towing services again, we hope to hear from you. Take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "102397935363594854051", "name": "Annette Hubbard", "time": 1601319545591, "rating": 5.0, "text": "Roger Bearden came out in the cold and rain to tow my vehicle even gave me a ride to his house so it was convenient for my husband to come get me there. Really appreciate all he did.", "pics": null, "resp": {"time": 1601493958711, "text": "We're grateful to know that your experience with us was an amazing one! We're always happy to hear appreciation from our customers. We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "116569002804669636628", "name": "Daniel Mcguire", "time": 1601567539895, "rating": 5.0, "text": "I called Ace and Brandon was there to get my car within 10 minutes he was very professional and nice! I will definitely use Ace again in my future endeavors and prefer Brandon if possible!", "pics": null, "resp": {"time": 1601653566024, "text": "Daniel, thank you for rating us five-stars! We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "107542211489626141488", "name": "Robin Bartlett", "time": 1601504331539, "rating": 5.0, "text": "Best towing service, when you call ask for Brandon Bartlett to come get you, he is always professional and friendly never meets a stranger he'll treat you like he has always known you. The only towing service I will use.", "pics": null, "resp": {"time": 1601655916255, "text": "Thank you, Robin. We're grateful to know that your experience with us was an amazing one! We're always happy to hear appreciation from our customers. We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "106191660830502545763", "name": "nathaniel glass", "time": 1601557584901, "rating": 5.0, "text": "Had Brandon Bartlett come and tow my BMW M5 and it made it in perfect shape and was a very quick response if your looking for someone to tow your vehicle give him a call!", "pics": null, "resp": {"time": 1601653412328, "text": "Nathaniel, thank you for your five-star review! We are happy we made your experience a positive one. Hopefully you stay on the road with no issues, but if you ever need roadside assistance or towing services again, we hope to hear from you. Take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "101317153570533013858", "name": "teresa furlough", "time": 1601331956134, "rating": 5.0, "text": "Jerry Pence was very professional, courteous, and very good at his job. Will definitely use service again.", "pics": null, "resp": {"time": 1601556441427, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "112403462109188980959", "name": "Rodney Stephens", "time": 1601404750016, "rating": 5.0, "text": "Had Great experience with your company using Brandon..Very punctual and professional..Will request him whenever need towing...", "pics": null, "resp": {"time": 1601493088337, "text": "Rodney, we're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "102517755859555845380", "name": "curtis bridges", "time": 1602290395665, "rating": 5.0, "text": "Roger bearden was on time very professional an an quick to get my vehicle out of the road an back to the house ace towing is the best", "pics": null, "resp": {"time": 1602518780710, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "112778604424818808340", "name": "Frank Ervin", "time": 1601763171500, "rating": 5.0, "text": "Roger Beardens always just in time when you need him, if all the drivers are that quick and punctual this local company is amazing .", "pics": null, "resp": {"time": 1602019496189, "text": "Thank you for your five-star review! Our team always strives for the highest standards. We are delighted we made your experience a positive one. Hopefully you stay on the road with no issues, but if you ever need towing services again, we hope to hear from you. Take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "105437708985457210098", "name": "BrittneyDenton69", "time": 1601836637579, "rating": 5.0, "text": "I recommend Brandon Bartlett he is very professional and gets the job done in a sufficient amount of time.", "pics": null, "resp": {"time": 1602075192291, "text": "Thanks so much for taking the time to share this short but sweet feedback! We're happy to hear that you had a great experience with us at ACE Towing LLC. Take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "104193553422111669326", "name": "Tammy Bridges", "time": 1602294900206, "rating": 5.0, "text": "Roger Bearden has been very professional and courteous every time we have used Ace Towing.", "pics": null, "resp": {"time": 1602513530540, "text": "We're grateful to know that your experience with Roger remains an positive one! We're always happy to hear appreciation from our customers. Hopefully you stay on the road with no issues, but if you ever need roadside assistance or towing services again, we hope to hear from you. Take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "105712231263277548868", "name": "Jason Bryant", "time": 1561127452498, "rating": 5.0, "text": "Professional,fast service. 100% satisfied", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3ZVzfBkbNyeY_RDaSRQsDhpGjQ3N-yJCwukc-=w150-h150-k-no-p"]}], "resp": {"time": 1561129807651, "text": "Thanks we appreciate your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "113502656303043705185", "name": "William Pendergrass", "time": 1601556858385, "rating": 5.0, "text": "Brandon is a phenomenal help. He was kind and got the job done without any issues.", "pics": null, "resp": {"time": 1601644181763, "text": "William, we appreciate the lovely feedback of ACE Towing LLC. Thank you and have a great day!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "100614751988497197507", "name": "Nick McCracken", "time": 1602291943019, "rating": 5.0, "text": "Highly recommend Brandon Bartlet. Excellent customer service.", "pics": null, "resp": {"time": 1602510275713, "text": "We're grateful to know that your experience with Brandon was an amazing one! We're always happy to hear appreciation from our customers. Thank you for reviewing ACE Towing LLC"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "102892845576197818204", "name": "Brooke Stapler", "time": 1601303186524, "rating": 5.0, "text": "Roger was there in time of need for my mother in law! He is great at what he does! Very kind and professional!", "pics": null, "resp": {"time": 1601469664136, "text": "That is so amazing to hear, Brooke! Thank you so much for taking the time to share your feedback with our team at ACE Towing LLC. It's great to know that we continue to provide our customers with everything they need. Have a great day!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "115591385468741222207", "name": "Leasha Bartlett", "time": 1601334719233, "rating": 5.0, "text": "I highly recommend Brandon Bartlett for any and all services! Not only is he knowledgable about his work, he'll get the job done right with excellent communication skills.", "pics": null, "resp": {"time": 1601483790937, "text": "We're grateful to know that your experience with us was an amazing one! We're always happy to hear appreciation from our customers. We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "117157833698126974841", "name": "Carol Byrd", "time": 1602023299039, "rating": 5.0, "text": "Roger Bearden of Ace Towing is great! He was on time and awesome service!", "pics": null, "resp": {"time": 1602181858636, "text": "Thank you so much for your review of ACE Towing LLC! We truly appreciate the feedback and wish you safe travels on the road"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "106020052208629017612", "name": "Jason Bridges", "time": 1602289913965, "rating": 5.0, "text": "Roger bearden was very professional an on time an was quick about loading my car up", "pics": null, "resp": {"time": 1602510365991, "text": "We're grateful to know that your experience with Roger was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "117430703498202486531", "name": "Chris Stapler", "time": 1601319384725, "rating": 5.0, "text": "I recommend ACE towing for all your towing needs.  Roger Bearden is a very professional.", "pics": null, "resp": {"time": 1601478626929, "text": "Thanks Chris for the wonderful review of ACE Towing LLC. We appreciate you taking time to leave your feedback and we wish you safe journeys!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "110847095288014096162", "name": "Kathy Neal", "time": 1601301930887, "rating": 5.0, "text": "I highly recommend Roger with ACE towing . He’s on time , very professional, & great service .", "pics": null, "resp": {"time": 1601474190004, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "109020950069206083077", "name": "Robert Barnett", "time": 1601320369258, "rating": 5.0, "text": "I highly recommend Roger Bearden with Acd Tower. He is very polite, friendly and professional!!", "pics": null, "resp": {"time": 1601556492215, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "108392818325663170423", "name": "Anita Barnett", "time": 1601307261415, "rating": 5.0, "text": "Roger Bearden is awesome, polite and courteous! I would definitely recommend!!", "pics": null, "resp": {"time": 1601472344982, "text": "We appreciate the five star review! Thank you for rating ACE Towing LLC and have a great day."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "107988812511109175303", "name": "A P", "time": 1589506099051, "rating": 5.0, "text": "Jerry Pence drives for Ace towing, he’s very professional and easy to deal with. They have nice new trucks, highly recommend them for your needs.", "pics": null, "resp": {"time": 1589896198069, "text": "We appreciate the lovely feedback of ACE Towing LLC. Thank you and have a great day!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "113583959649180126986", "name": "Donna Doran", "time": 1601520398437, "rating": 5.0, "text": "Roger Bearden is the man to call .Roger is a nice man would do anything for anyone.", "pics": null, "resp": {"time": 1601649194579, "text": "Donna, we're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "118244371123015021027", "name": "Katie Fritz", "time": 1595363193060, "rating": 5.0, "text": "Our trailer came off the hitch on the side of 431, and Ace Towing was prompt, extremely helpful and a great value.  We could not recommend them more!", "pics": null, "resp": {"time": 1595367051211, "text": "Thanks we appreciate your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "114575341371330715933", "name": "Beverly Stapler", "time": 1601551368702, "rating": 5.0, "text": "Highly recommended. Roger Bearden is very professional and gets the job done", "pics": null, "resp": {"time": 1601656581156, "text": "We're happy to hear you had an awesome time with us at ACE Towing LLC! Thanks for sharing your experience. Take care!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "100451886196785302936", "name": "Derek Bullock", "time": 1601049938323, "rating": 5.0, "text": "These guys were extremely helpful and honest, highly recommend", "pics": null, "resp": {"time": 1601061452645, "text": "Thank you for your five-star review, Derek. Our team at ACE Towing LLC always strives for the highest standards. We are delighted we made your experience a positive one. Until next time, take care."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "117051437302855023756", "name": "Angelia Bledsoe", "time": 1598989391698, "rating": 5.0, "text": "Very friendly and personable. Came when they said they would", "pics": null, "resp": {"time": 1599057589301, "text": "We're happy to hear you had an awesome time with us at ACE Towing LLC! Thanks for sharing your experience. We hope you have a great day."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "116638835340925119005", "name": "Tamara Castleberry", "time": 1601310936461, "rating": 5.0, "text": "Frank was very knowledgeable and did an exceptional job!", "pics": null, "resp": {"time": 1601474497437, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "109189244977347325701", "name": "christy Pence", "time": 1589504285563, "rating": 5.0, "text": "Highly recommend ACE TOWING!!!! I had a blow out on my way home called ace and they sent jerry pence out he was on time  very professional and they are  very reasonably priced!!!!I would recommend ace towing for all your towing needs!!!!", "pics": null, "resp": {"time": 1589896195689, "text": "Thank you for your five star review. The ACE Towing LLC team is delighted we could serve you so well."}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "109257159523082153494", "name": "Julie Justice", "time": 1601301850361, "rating": 5.0, "text": "Roger was very helpful when my car broke down and was there withen minutes of the call. Even tho it was raining he didn’t complain and was very careful with My car! Shout out to Mr. Roger himself and ACE Towing", "pics": null, "resp": {"time": 1589896200271, "text": "We appreciate the lovely feedback of ACE Towing LLC. Thank you and have a great day!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "115427368005765120273", "name": "Robert Hammer", "time": 1570205245104, "rating": 5.0, "text": "Absolutely the best wrecker service I’ve ever used.  The driver was very professional and helpful plus he was on time.  Will never use another wrecker service.  Thanks so much.", "pics": null, "resp": {"time": 1570206113701, "text": "Thanks so much we appreciate your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "102935775978872369336", "name": "Randy King", "time": 1565391211513, "rating": 5.0, "text": "Called Ace Towing for a very specialized trucking issue. Load shifted on the trailer, used Ace Towing to pull pallets of product back into position via a strap and roll back truck. Driver arrived quickly, fixed issue and we were on our way, Jason, the owner was very professional and reasonable with our \"special project\"  Would highly recommend Ace Towing for any project. Thank you again Jason and your driver for a job well done.   SPI Transportation-Idaho", "pics": null, "resp": {"time": 1565392595340, "text": "Hey Randy we was glad to help you out and thanks for your business we appreciate it"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "106872967316307559348", "name": "Randara Fuller", "time": 1601345800893, "rating": 5.0, "text": "Frank has awesome roadside service!!", "pics": null, "resp": {"time": 1601492438876, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "106982212019849691508", "name": "Jerry Pence", "time": 1590192410450, "rating": 5.0, "text": "Jason and Ann operate a first class towing company and give the best prices egg quality service in the business and they have a driver Roger Bearden that is five star all the way I recommend Ace Towing for all of your Towing needs", "pics": null, "resp": {"time": 1590196213744, "text": "Thank you sir"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "110306302646791675027", "name": "Angela Bearden", "time": 1602285566516, "rating": 5.0, "text": "Call Roger Bearden at Ace Towing. He is so precious and will go out of his way to help anyone.", "pics": null, "resp": {"time": 1602506449945, "text": "We're grateful to know that your experience with Roger was an amazing one! We're always happy to hear appreciation from our customers. We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "117920094703906902114", "name": "James Warren", "time": 1601817460910, "rating": 5.0, "text": "Jerry Pence came and pick me up and took me home thanks", "pics": null, "resp": {"time": 1602072687136, "text": "Thank you so much for your review of ACE Towing LLC! We truly appreciate the feedback and wish you safe driving"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "107538361752477665544", "name": "Hebron Fire Grant, AL", "time": 1601307447056, "rating": 5.0, "text": "Roger Bearden was great", "pics": null, "resp": {"time": 1601478451433, "text": "Hebron, thank you so much for the 5-star rating! We are happy we have earned your trust!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "105354626821789424070", "name": "Vickie Thompson", "time": 1519307038810, "rating": 5.0, "text": "I use this wrecker service at all times. I have had to call them to unlock my car they were quick and they had good timing since I had left my car running and it was summer time. I've had to use the towing service on numerous occasions. The service is great my cars have never been damaged. I have heard from several people that when their car was towed it was damaged but not from this company. I know several people that's always used Ace Towing. My family uses Ace Towing as their primary towing company. They towed my car to the location I need it for its repairs or to my own home so I do not have bills for it being in the Wrecker lot. As for this service is a one place that I recommend to anyone who's in a situation of needing towed or if their car has been locked up and there are locked out. I like the speediness of them getting to where I'm at when I need them.", "pics": null, "resp": {"time": 1519336756786, "text": "Thanks for your business and the review"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "102238669714628713509", "name": "Roger Dobbins", "time": 1570278922366, "rating": 5.0, "text": "I've used Ace towing for years, always reasonably priced and excellent work.\nBest service around", "pics": null, "resp": {"time": 1570302255710, "text": "Thanks Roger we appreciate you and your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "101504228469303191663", "name": "Virginia sharp", "time": 1570234879787, "rating": 5.0, "text": "Need a Tow?? Call Ace Towing. Great tow service and great owners !!", "pics": null, "resp": {"time": 1570237472921, "text": "Thanks"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "109732184339398543960", "name": "Brandon Buckman", "time": 1570512856417, "rating": 5.0, "text": "Awsome people super fast response time", "pics": null, "resp": {"time": 1570533957777, "text": "Thanks sir we appreciate your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "105933643250666310790", "name": "Greg Rogers", "time": 1601337111545, "rating": 5.0, "text": "Roger Bearden is professional  and on time", "pics": null, "resp": {"time": 1601492390884, "text": "We're grateful to know that your experience with us was a positive one! We look forward to servicing you with all your towing needs in the future!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "114718131994874784164", "name": "Cassey Osburn", "time": 1588640213650, "rating": 5.0, "text": "Adam is the Bomb.com! Ace Towing all the way!", "pics": null, "resp": {"time": 1589896179683, "text": "We appreciate the lovely feedback of ACE Towing LLC. Thank you and have a great day!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "101752073394714187352", "name": "Crystal bumbalough", "time": 1500296416657, "rating": 5.0, "text": "Our h2's radiator cracked in a campground across the lake.  I was a little frantic about what to do because we were 3 hrs from home and a lot of the tow conpanies were closed on Sunday.  I called and he was very nice and came right out, they took it to a dealer for us.  Great service!!!!!!!!! Very friendly!!!!!!", "pics": null, "resp": {"time": 1500774333412, "text": "Glad we could help you!"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "111910164830337322730", "name": "Sakeynah Graves", "time": 1601159286449, "rating": 1.0, "text": "Poor customer service and unreliable", "pics": null, "resp": {"time": 1601210925072, "text": "Can you give tell me what happened? We are very reliable go above and beyond to serve everyone, I would like for you to call me and we can discuss this matter. Thanks"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "117659196798365848715", "name": "stymie222", "time": 1511536947592, "rating": 5.0, "text": "Great courteous service. Best in the area !", "pics": null, "resp": {"time": 1511571008278, "text": "Thanks glad we could help you"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "115644234701162816952", "name": "Amy Whiteside", "time": 1570204994858, "rating": 5.0, "text": "Love love love these folks!!!", "pics": null, "resp": {"time": 1570206138282, "text": "Thanks Amy we appreciate your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "108920855893889549588", "name": "Caleb Burns", "time": 1519310151034, "rating": 5.0, "text": "Great company and great service", "pics": null, "resp": {"time": 1519336696627, "text": "Thanks"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "108338852264485722436", "name": "Frances Young", "time": 1568314639669, "rating": 5.0, "text": "Came on time", "pics": null, "resp": {"time": 1568322083336, "text": "Thanks we appreciate your business"}, "gmap_id": "0x8889ffe3639fea95:0x154266a551ccf7ca"}
{"user_id": "104823080354961699231", "name": "Ray Blackwell", "time": 1610394418952, "rating": 5.0, "text": "Great personal staff and the Yard Man went above and beyond the call of duty to help me to cover the exhaust system from the weather. I've been doing business with COWIN for many years. All locations are in the great state of alabama. Service and sales good place for your needs on equipment.", "pics": null, "resp": null, "gmap_id": "0x88627ccc1f17452f:0xbf4e370686d63c22"}
{"user_id": "106438895930528935158", "name": "Schubert Enterprises, LLC", "time": 1610385650491, "rating": 5.0, "text": "Cowin Equipment is a business that involves working with great people, and easy to work with. We really have enjoyed working with this company and Daniel Lawrence.", "pics": null, "resp": null, "gmap_id": "0x88627ccc1f17452f:0xbf4e370686d63c22"}
{"user_id": "114836788721599527052", "name": "Rebecca Moore", "time": 1563072411489, "rating": 5.0, "text": "The service manager is AWESOME!! If you need to rent heavy equipment this is the place!!", "pics": null, "resp": null, "gmap_id": "0x88627ccc1f17452f:0xbf4e370686d63c22"}
{"user_id": "117153234213934009171", "name": "Local 360", "time": 1508785455637, "rating": 5.0, "text": "Outstanding selection of product. Staff is knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x88627ccc1f17452f:0xbf4e370686d63c22"}
{"user_id": "114394581462068813574", "name": "Jonathan Patterson", "time": 1516029022279, "rating": 3.0, "text": "Understaffed. Friendly and helpful just not enough of them", "pics": null, "resp": null, "gmap_id": "0x88627ccc1f17452f:0xbf4e370686d63c22"}
{"user_id": "104175698255390153821", "name": "rafa abastta", "time": 1535404998691, "rating": 5.0, "text": "Excellent customer service... We asked for diagrams and got them within the hour... we were able to order that day.... for Overnight.  Chris Ward was Super Fast and very helpful. He helped us get what we needed.", "pics": null, "resp": null, "gmap_id": "0x88891b57867c23dd:0x385c666f9349e5d6"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474308736940, "rating": 5.0, "text": "Love it :)", "pics": null, "resp": null, "gmap_id": "0x88891b57867c23dd:0x385c666f9349e5d6"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1607204219231, "rating": 3.0, "text": "Nice staff. In and out quickly.", "pics": null, "resp": null, "gmap_id": "0x88892f764cb32709:0x25ede79c5214c8e6"}
{"user_id": "111455793275680422914", "name": "Sheley White", "time": 1550949250408, "rating": 5.0, "text": "Great company", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPaCBptnMVA-OeuM2jW9k1nagkxO-OklW5xsEZH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx95QdQEFjtHh_NbdgG9SkRcdStlwmmuPPCzuL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892f764cb32709:0x25ede79c5214c8e6"}
{"user_id": "108179446782967186542", "name": "Doug Mckinney", "time": 1450993453746, "rating": 4.0, "text": "We provided lodging for the technicians working at the steel mill in Calvert Al\nand found them to be a great bunch of guys.\nThey are most welcome to stay at any of our Geer properties.\nBates Creek RV and cabins\nDoug Mckinney", "pics": null, "resp": null, "gmap_id": "0x88892f764cb32709:0x25ede79c5214c8e6"}
{"user_id": "103945743370275520911", "name": "Larry Miller", "time": 1590181407459, "rating": 5.0, "text": "Great equipment rental and super service dept.", "pics": null, "resp": null, "gmap_id": "0x889bb272e0971537:0x9a72ac85e7c04ae1"}
{"user_id": "108709046707809231762", "name": "Jerry Ross", "time": 1606341290440, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889bb272e0971537:0x9a72ac85e7c04ae1"}
{"user_id": "112939297021499187841", "name": "Trey Fredriksen", "time": 1615646133434, "rating": 5.0, "text": "Todd Turk is our sales rep. and he does a fine job of taking care of us.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "110475295824654204137", "name": "Lee Conkin", "time": 1611857174718, "rating": 5.0, "text": "Courteous, prompt, and professional service. Thank you.", "pics": null, "resp": {"time": 1612383920407, "text": "Glad to hear it, thanks Lee. We appreciate it!"}, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "103164162666243524528", "name": "Dale Byrd", "time": 1587649498031, "rating": 5.0, "text": "I have been dealing with United for over two years now and have had great customer service from Hunter Ellenburg out of the branch on Laughlin Rd in Mobile AL. He has always gone above and beyond to make sure our needs are taken care of.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "105983005854464388967", "name": "david lyndall", "time": 1517577801297, "rating": 1.0, "text": "Rent somewhere else!  They bragged about their equipment being better that others and theirs still  messed up. Man lift Would periodically stop working in rotation. Caused a huge delay in the job.  Returned  back, explained the problem  and they did a 1 minute test... How thorough can you be in thaybtime frame.  They said it's working fine. Didnt put a man in the basket, didn't raise it up and check much at all. A joke.  Waste of 380. Going to Sunbelt to get a decent piece of equipment. But hey at least they said thank you.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "112102071206392387458", "name": "Quality Marine", "time": 1465398864012, "rating": 5.0, "text": "Great Company and Service!!! Thank You!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "110253808106973230346", "name": "Matt Farmer", "time": 1378925380288, "rating": 5.0, "text": "Get people to work with. Always egear to help you with your needs.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "102679193764789257722", "name": "Jamie Vaal", "time": 1620433648954, "rating": 5.0, "text": "We had an amazing experience with these gentlemen! We were visiting from out of town and had a huge issue with a trailer which literally made impossible for us to continue our trip! They went above and beyond (seriously) to help us out! Thank you gentlemen so very much!", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "117549284173165215237", "name": "Mike B", "time": 1621546963480, "rating": 1.0, "text": "Very very rude people. Rseppionist is very rude when she answers phone. Terrible way to treat customers. This place is a joke . Waisted our time and didn't even do the job Which was a very simple job.", "pics": null, "resp": {"time": 1621596726752, "text": "We tried to accomadate this lady with her situation, I was even working on her project when she came to shop ,as far as being  rude, she wasn't very pleasant  herself, when you explain you will have to work her project in ,I even asked her to go wait in her truck while I finished her project, but no ,so sir I will be glad to finish ,come see me this morning yourself ,plates are all ready  made"}, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "112073226468449551182", "name": "amy tolbert", "time": 1588297643690, "rating": 5.0, "text": "Called almost at closing time and they told me to have my husband come on in . They stayed open for him and did an amazing job fixing the problem, charged a very reasonable price ,were very professional and friendly.Couldnt ask for any better.Would definitely use again.Thanks Micheal and the guys at J and S.", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "110104542312120385760", "name": "Reggie Burns", "time": 1604983331462, "rating": 5.0, "text": "Good workmanship", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "116948428538353870721", "name": "Nathan Nance", "time": 1605137427045, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "113305976062415365904", "name": "ashley robison", "time": 1494845545157, "rating": 5.0, "text": "I had a good neck ball installed in my truck and they did an awesome job it is clean and looks like it was installed during manufacturing!! I love it !! Thanks j&s!!", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "107743390634055755749", "name": "Yadier Val", "time": 1605808232936, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x8861dec8c29feec3:0xb0d694a8aaa9bd34"}
{"user_id": "108958405280150727809", "name": "Chris Hall", "time": 1579737523467, "rating": 5.0, "text": "Lots of items to choose from!", "pics": null, "resp": null, "gmap_id": "0x889ae55fbc6d36b9:0x13ee7ee0e08bea3e"}
{"user_id": "113410844554686366621", "name": "Ronnie Ridlon", "time": 1610671828627, "rating": 5.0, "text": "Wanted to share my experience with United rentals in Foley Alabama. Absolutely amazing, every single person I deal with is awesome and extremely helpful! But I have to give the biggest thanks & Recognition to Sara Polansky! She is amazing, gets whatever I need no matter the hurtles. Always comes though with perfect service!  Great company and people I highly recommend them for anything you can rent.", "pics": null, "resp": {"time": 1611604218436, "text": "Thanks for the shout-out, Ronnie. We appreciate the feedback and hope we can help out again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "116446889405825928476", "name": "Jimmy Chivers", "time": 1615418548661, "rating": 5.0, "text": "I always receive the best service when I rent a piece of equipment. The people are very helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "113237515850884011856", "name": "John Jr Blacksher", "time": 1622233771920, "rating": 5.0, "text": "When I pull in the yard, I never have to wait more than a minute to get waited on. Got to keep my head on a swivel because someone will be coming soon on a forklift to get the trailer off or to unload my truck.", "pics": null, "resp": {"time": 1622579634299, "text": "Thanks, John. Looking forward to working together again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "112561182036069999605", "name": "Kevin Maxwell", "time": 1616501952588, "rating": 5.0, "text": "Sales associate(Angie) from the Pensacola Branch has been a pleasure to work with. She always takes care of me and all rentals set up for delivery and pick up with no issues.", "pics": null, "resp": {"time": 1617134131539, "text": "Thanks, Kevin. We appreciate the positive feedback and shout-out for our team. We're glad we were able to help you with your equipment needs and look forward to working together again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "115486194241409294379", "name": "Tim Simpson", "time": 1608920867720, "rating": 5.0, "text": "Great place to rent equipment, very friendly staff.", "pics": null, "resp": {"time": 1609793608105, "text": "Thanks, Tim. We appreciate the feedback and your business. Let us know if there's anything we can do to help in the future."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "111447997756065862365", "name": "Jake Plash", "time": 1569741024569, "rating": 5.0, "text": "Nice staff, very knowledgeable. There is this one mechanic named Jon, he went out of his way to help my crew understand the machine we picked up. We asked every question possible and he never once brushed us off or got irritated with us(and it was hot out). You don’t get many people that are so knowledgeable and professional. We will come\nback just for that one mechanic alone. Good job United", "pics": null, "resp": null, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "105863266449619678846", "name": "Jeff Devine", "time": 1618980634870, "rating": 5.0, "text": "GREAT SERVICE", "pics": null, "resp": {"time": 1619042532177, "text": "Thanks, Jeff. We appreciate the positive feedback and shout-out for our team. Let us know if we can help out again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "100734923312528273151", "name": "Angela Wingard", "time": 1569741163806, "rating": 5.0, "text": "Very professional staff. They are always ready to help. The whole team seems to work well together. I love hearing around town how reliable United’s machines are. Great company to help with all your jobs, big or small!", "pics": null, "resp": null, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
