{"user_id": "102994960911053000583", "name": "Bobby Snellgrove-Fitch", "time": 1618930626872, "rating": 5.0, "text": "Dr. Z took my husband that could barely walk upright and he was able to walk upright with no pain. We recommend Dr. Z to everyone because he truly cares about you and your health and quality of life!!! A++++ all the way!!", "pics": null, "resp": {"time": 1618931316519, "text": "Thank you for your review Bobby!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "105934926024519793008", "name": "Cathy Solis", "time": 1487276998267, "rating": 5.0, "text": "Dr. Zlotea is a very caring individual who believes in natural healing. I will return.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM0lHCQyO06MiiuYhEpPTwCeUQJ4f2-bsVQxjbK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "107076720452160226984", "name": "Lisa Mixon", "time": 1613589536201, "rating": 5.0, "text": "Awesome doctor and staff! Not only does Dr. Z help you get better, he teaches you techniques to practice at home. I am very pleased with my experience and encourage anyone to give these folks a try. Thank you MedPlus for all you do!", "pics": null, "resp": {"time": 1613600606344, "text": "So happy that you are feeling better Lisa. Thank you for your review!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "109080146947797361768", "name": "Trevor Wells", "time": 1618434148823, "rating": 5.0, "text": "Had two herniated disks. Did the decompression sessions and it worked miracles! Got my inlaws and my wife to come here because not only is the dr great he is honest with you and wants the best for you. It’s not all about the money with him. And the staff are amazing!!", "pics": null, "resp": {"time": 1618930652028, "text": "Thank you Trevor, We are so happy you are feeling better and thank you for the referrals...patient referrals are the best compliment!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "108057812535758939989", "name": "Wendella Johnson", "time": 1615226089811, "rating": 5.0, "text": "After my second visit I noticed I was able to breath better. This is my third visit and everybody has been amazing and supportive", "pics": null, "resp": {"time": 1616608663411, "text": "So happy you are doing better Wendella. Thank you for the review"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "112153710737265265846", "name": "LaLa Coates", "time": 1616467713553, "rating": 5.0, "text": "I absolutely cannot express how much I appreciate Dr. Z and Bre, recently I lost my Father and my best friend, they offer ERT( emotional relief therapy) accupuncture and so many more services that are tailored to your needs. Very very knowledgeable and dont just try and shove medicine down your throat,  Dr. Z goes above and beyond to help you. My experience especially during this time in my life has been a God sent", "pics": null, "resp": {"time": 1616608788673, "text": "Thank you Lara for the review. So happy you are doing better."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "107943989129216553308", "name": "Jonathan L.", "time": 1612199563656, "rating": 5.0, "text": "Extremely knowledgeable and skilled, Dr. Z is an amazing chiropractor. Having been to several different chiropractors over the years he's definitely the best. Highly recommended!!", "pics": null, "resp": {"time": 1612278466898, "text": "Thank you for the review Jonathan."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "105799318375824680097", "name": "Brittany Boehme", "time": 1607465855243, "rating": 5.0, "text": "For the first time in my life I am medication/prescription free and have been able to correct many bodily and mental issues through the gentle chiropractic and ERT care received here with Dr. Z and his staff. this office has helped alleviate and correct issues from decades ago in just a few months without drugs. The office does come off at first as chaotic, a little unorganized, and rushed HOWEVER I recommend this place to everyone despite that because it is the only time I have seen and felt relief in my body and mind. I've seen multiple doctors, been on every medication under the sun, and even had surgeries, none of which ever actually corrected my underlying issues and at most only suppressed the pain temporarily.", "pics": null, "resp": {"time": 1611012237547, "text": "So happy you are better Brittany!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "115372094136056382528", "name": "Christopher Edwards", "time": 1578633877303, "rating": 5.0, "text": "I have been a patient at Medplus for over a year now. I first came to them with debilitating back pain from a work related injury, and they were able to see me the day I called and had me mostly pain free within a week. As a chiropractic patient for my whole life, I can tell you that the care is first rate! The office is also very accommodating when you need to reschedule, and the wait times are generally very reasonable. Highly recommended!!", "pics": null, "resp": {"time": 1616609239734, "text": "Thank you Christopher for your review."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "100893327043437746882", "name": "Joseph Clark", "time": 1580191046084, "rating": 5.0, "text": "Became a patient here after an car accident. From my very first appointment, I was well taken care of. The staff is amazing and they genuinely believe in what they do. They educate you, work with your schedule, and above all, they really do care about you and your health on a personal level. Medplus truly stands apart from other chiropractic clinics.", "pics": null, "resp": {"time": 1594758754371, "text": "Thank you for the nice review Joseph."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "102134584308787485856", "name": "Latoiya Chapman", "time": 1574881551911, "rating": 5.0, "text": "new patient. visiting family in the area for the holidays. Someone at Southeast Health circle E. Rehab heard me talking with my mom and suggested Dr. Z. (my Thanksgiving miracle).  I was in so much pain and got relief by the end of my treatment. Thank you GOD for putting them all in my life today. Awesome staff. Very clean and relaxing facility. The prices are reasonable and they also have packages for payment/ treatment plans.", "pics": null, "resp": {"time": 1616609615364, "text": "Thank you Latoiya!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "102838329008690048946", "name": "James DeWick", "time": 1563206607938, "rating": 5.0, "text": "Came in to do stem cells thinking that it would be my only option for relieving chronic pain in my knees. Dr Z gave me an examination and a chiropractic session that relieved most if not all of the pain in my knees instantly. Now we are doing blood work and other tests to determine underlying causes of this issue. I’m very happy I went with Dr Z because he’s a truly honest and caring person. Thank you !", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "108440211550559556154", "name": "Jamie Ward", "time": 1580946519213, "rating": 5.0, "text": "The personnel are very friendly. When I walked in and heard the 70’s light rock over the sound system I knew this was my kind of place. I went in for lower back pain that kept me nearly immobile for a week. I came here after reading the reviews, desperate for relief. I felt great after my initial visit and with my continuing therapy feeling better each day. I’m also learning a lot from the doc about my health and how to maintain it without pharmaceuticals.", "pics": null, "resp": {"time": 1594758699819, "text": "Glad to hear you are feeling better Jamie, Thank you for the nice review!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "104864739853747299846", "name": "James Avery", "time": 1583430026780, "rating": 5.0, "text": "Dr. Z is amazing and acupuncture works! I no longer have to suffer through near constant nerve pain. Dr. Z listens carefully to symptoms and issues and treats accordingly. Through incredible ancient practice, he is teaching my body how to heal itself. I recommend Medplus to anyone for any aliment or struggle you face.", "pics": null, "resp": {"time": 1594758524687, "text": "So happy you are feeling better James."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "102567243071136296355", "name": "Johanna Lodder", "time": 1590598739052, "rating": 5.0, "text": "I was in a car accident, ended up with neck fusion herniated disc, lots of pain.  Considering I never used a primary care doctor before this because I didn't need one, went to gynecologist yearly, that was it. Suddenly it was lots of doctors tests etc.  Spent the last two years with orthopedic, chiropractors, muscular therapists but still in pain, still not able to sleep well.   Pain changes you....but I wasn't going to give up yet. My primary care Dr. recommended Lions Mane and Dr Z. Ordered the supplement on Amazon started taking it, it really helped with brain fog from concussion. So I headed off to Dr Z, not expecting too much, I was already seeing a chropracter.  Wow, what a difference, decompression has reduced the nagging pain, the first morning after, I woke up because I was rested!  Hadn't done that since...before accident.  I get up now in the morning and can feel my feet, and walk normally, not like I have flippers.  I had ligaments and muscles whining and complaining, because now my hips were staying where they should and everything had to stretch.  But I did my stretches and my ankles and left leg aren't hurting like they did.\nI am actually thinking about exercising again,  this experience has made me hopefull again.  Thank you.", "pics": null, "resp": {"time": 1590607070863, "text": "Thank you for the wonderful review and I am so happy that you are doing so much better!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "113060451933630546658", "name": "Jasmine Mathis", "time": 1577440440033, "rating": 5.0, "text": "It's easy to integrate a holistic view of heath here. The environment here feels like you are amongst friends, not a sterile impersonal place to churn through \"patients\".  Doc Z and staff are genuine and show they care in every way!", "pics": null, "resp": {"time": 1616609488495, "text": "We appreciate the positive review Jasmine."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "105934926024519793008", "name": "Cathy Solis", "time": 1487276998267, "rating": 5.0, "text": "Dr. Zlotea is a very caring individual who believes in natural healing. I will return.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM0lHCQyO06MiiuYhEpPTwCeUQJ4f2-bsVQxjbK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "106707135146370551231", "name": "Keely Stokes", "time": 1547508272124, "rating": 5.0, "text": "Such a smart man!! Genuinely cares. My family loves this place!!! The lady who runs the front desk is so sweet, also. They have a prayer jar at the check out... I loved that. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "115791347319216772123", "name": "Johnny Brascom", "time": 1575726077070, "rating": 5.0, "text": "If you are tired of getting the run around about your health conditions, allow Medplus to give you the treatment that can help you with your condition. Since 1995, I have no regrets about the care that I received. Many others clients that I personally recommend Medplus to, I said some of the same things. Find someone who have been there, and ask them for yourself. Word of mouth is the best advertising a business can get.", "pics": null, "resp": {"time": 1616609572388, "text": "Thank you Johnny"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "106707135146370551231", "name": "Keely Stokes", "time": 1547508272124, "rating": 5.0, "text": "Such a smart man!! Genuinely cares. My family loves this place!!! The lady who runs the front desk is so sweet, also. They have a prayer jar at the check out... I loved that. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "114904503914724392533", "name": "Victoria Lewis", "time": 1577943610757, "rating": 5.0, "text": "Dr. Z is very kind and caring, but more importantly great at getting the results in the treatment plan.  Definitely recommend.", "pics": null, "resp": {"time": 1616609421077, "text": "Thank you for that positive review Victoria, we appreciate that!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "115334525789632108128", "name": "Ronnie Creel", "time": 1580501975046, "rating": 5.0, "text": "I have been to numerous chiropractors over the years...Dr. Z has been the most effective chiropractor that I have used. I highly recommend him.", "pics": null, "resp": {"time": 1594758718512, "text": "Thank you Ronnie!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "111408767941227709324", "name": "Michael Parker", "time": 1573681991492, "rating": 5.0, "text": "A great experience, and I'm starting to feel much better than before I visited them. I always feel comfortable in their care.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "109228320926072450908", "name": "Joe Schmitt", "time": 1577683494498, "rating": 5.0, "text": "Dr Zlotea took the time to understand my condition and developed a plan that works for me.  I would recommend him highly.", "pics": null, "resp": {"time": 1616609445572, "text": "Thank you Joe."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "108162525150113625054", "name": "Donielle McLendon", "time": 1550701377555, "rating": 5.0, "text": "I injured myself almost 4 years ago. My left foot and sciatic nerve have caused me to be in almost constant pain since. Before the injury, I ran about 30-45 miles per week, but I have not been able to workout with any regularity since, and it was depressing. I have seen 2 orthopedic surgeons, another chiropractor, a podiatrist, an acupuncturist (a different practice), and massage therapists with little relief. It’s not that they were bad, but they weren’t looking in the right place. He really listened to me and I appreciate that.\nDr. Zlotea has been treating me for the past few weeks for a herniated disc and other issues. He recommended using decompression therapy and it has worked wonders! I don’t think I would have been able to workout again if not for him. I’m only 32 and finally don’t feel like I’m 102. I am able to start light exercise again as of today and I couldn’t be happier! My foot doesn’t hurt at all anymore! I feel like I’m getting my life back.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "109056233387514796744", "name": "Brandon Glover", "time": 1583928002354, "rating": 5.0, "text": "I get treated every chance I get, Dr. Z is great and the staff are friendly and professional! 10/10 would recommend!", "pics": null, "resp": {"time": 1594758478414, "text": "Thank you for the review Brandon!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "107954626535469574796", "name": "Angela Lewis", "time": 1583521829114, "rating": 5.0, "text": "Nicest group of people who worked with me in every step. Would recommend to everyone", "pics": null, "resp": {"time": 1594758495784, "text": "Thank you Angela!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "116938001085867824133", "name": "Kendall Jackson", "time": 1554320010636, "rating": 5.0, "text": "As some of you may remember, in November 2011 I was involved in a vehicular hit and run on Ross Clark Circle, in which I was a pedestrian. To give you an idea of the impact, it fragmented my tibia and fibula in half (lower leg bones). I incurred a lot of bodily damage. At one point I could barely walk due to the various pains due to misalignment. The photo attached shows how much of my skin was removed by the ground, although and I was wearing a pea coat at the time of the incident. To keep things short, I'm less afraid of vehicles passing me on my morning runs than I am to try a new chiropractor. I love the down-to-Earth atmosphere at his office. I strongly recommend you at least give it a few visits to see if his structure is right for you. It only took me ONCE.\n\nThank you Dr. Z\n\nKendall Jackson", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "116938001085867824133", "name": "Kendall Jackson", "time": 1554320010636, "rating": 5.0, "text": "As some of you may remember, in November 2011 I was involved in a vehicular hit and run on Ross Clark Circle, in which I was a pedestrian. To give you an idea of the impact, it fragmented my tibia and fibula in half (lower leg bones). I incurred a lot of bodily damage. At one point I could barely walk due to the various pains due to misalignment. The photo attached shows how much of my skin was removed by the ground, although and I was wearing a pea coat at the time of the incident. To keep things short, I'm less afraid of vehicles passing me on my morning runs than I am to try a new chiropractor. I love the down-to-Earth atmosphere at his office. I strongly recommend you at least give it a few visits to see if his structure is right for you. It only took me ONCE.\n\nThank you Dr. Z\n\nKendall Jackson", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "116000749469182170300", "name": "Lisa Boulden", "time": 1583366760076, "rating": 5.0, "text": "When I walked into Dr Z office I was in so much pain for the last 9 yrs and unable to sleep all night. With the help of Dr Z help I'm able to sleep all night and in a lot less back pain. He knew what was really wrong with me and is treating me where all the pain Drs and others was treating me for the wrong problem. Thank Dr Z and the staff.", "pics": null, "resp": {"time": 1594758569838, "text": "I am so happy you are feeling better! Thank you for the nice review."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "112866264996664654199", "name": "Lulu", "time": 1554156257377, "rating": 5.0, "text": "Dr Z is very knowledgeable and has a great bed side manner.   I highly recommend this business for all of your chiropractic and alternative med needs .", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "104826516406177233702", "name": "Michael Rivera", "time": 1579583912021, "rating": 5.0, "text": "Had really bad lower back pain and normally I get an injection, but decided to try this place. After 2 adjustments from Dr. Zlotea I was back to work.", "pics": null, "resp": {"time": 1594758826210, "text": "Glad you are feeling better Michael. Thank you for the review."}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "100386496371243945188", "name": "Southern storage fanatics SSF Love", "time": 1554408659181, "rating": 5.0, "text": "This non surgical procedures have changed my life and set me on a new back pain free journey I feel so much better thank you doctor z .", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "108054103625112930466", "name": "Stephanie Graves", "time": 1550532735713, "rating": 5.0, "text": "Absolutely amazing ..... the difference in the pain levels in my back and shoulders after the first visit were undeniable and it just keeps getting better!!! Thank you sooo much Dr. Z and Bree for taking my feel good levels to the next level!!", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "117316136504355216547", "name": "Steven King", "time": 1524093896461, "rating": 2.0, "text": "Not what I expected, saw him as an alternative health doctor for a holistic approach to ADHD expecting a blood test and diet change with some supplements and ended up leaving with only a $37 wrist band that plugs into an electrical outlet ground and some hemp drops! Total visit was $137. Also he was very quick to make sure he suggests treatments for the whole family for everything and anything to capitalize on the money. Saw him on a Wednesday and he wanted me right back in on Monday. No thanks.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "102932335609973839526", "name": "Melissa Jasso", "time": 1578525872560, "rating": 5.0, "text": "Very knowledgeable doctor and really helped out my back pain after a car crash! Super friendly staff!!", "pics": null, "resp": {"time": 1616609294762, "text": "Thanks Melissa!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "116006549440308680174", "name": "Courtney Hobgood", "time": 1571869716849, "rating": 1.0, "text": "I paid 96 dollars to be told I need to take only herbs and supplements to help get pregnant. If you are going through IVF treatment do not go here.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "112152234662089849546", "name": "Angela Lewis", "time": 1543678211537, "rating": 5.0, "text": "Great service I always leave feeling  so much better.  Dr Z and his staff take great care of there  patients.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "111865828242966296618", "name": "Marie Czyzewski", "time": 1533821462245, "rating": 5.0, "text": "A Dr. that really cares and is there when you need him! He even came to our house and the hospital! Thank you so much! Hard to find such a place...", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "117584512843289227018", "name": "allfr miss", "time": 1549001623688, "rating": 5.0, "text": "I had a car accident back in September. I was so bad injured I couldn't move a thing. It took 2 visits to be actually able to move and another 3 to able to do sit ups. If it wasnt for dr. Z i wouldnt be working today. He helped me getting me back on feet. It may seem pricey but he is actually affordable and he will work with you.\nYou can see him about anything and he will help you!", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "112015099658226436362", "name": "Chrys D", "time": 1562788995269, "rating": 5.0, "text": "Dr.Z is amazing and attentive. I came in with severe back/neck/sciatic pains and constant headaches, all of which are nearly non-existent now!", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "116006549440308680174", "name": "Courtney Hobgood", "time": 1571869716849, "rating": 1.0, "text": "I paid 96 dollars to be told I need to take only herbs and supplements to help get pregnant. If you are going through IVF treatment do not go here.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "107581244131353720108", "name": "Erin Caputo", "time": 1527119302965, "rating": 5.0, "text": "Absolutely love this place. Dr. Z is very good at what he does! Everyone in the office is just super kind. Trust the process and trust in your ability to heal and the work he does on you whether it be chiropractic, acupuncture, ERT (energy clearing) or otherwise will be truly life changing. At first the ERT may seem silly, but let me tell you!.. I've done energy work before as its practiced often in my field of work, and he really has a wonderful knack for it and has helped me work out years and lifetimes of negative emotion that was holding me back! I highly recommend this place just the same as I would recommend a spa or retreat. I even got my husband to go now! Dont wait on your health and well-being, your absolutely worth it!", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "117106867049802556063", "name": "Anna Valentine", "time": 1516279413795, "rating": 5.0, "text": "No clue who these people are but they deserve a 5 star", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "107343789345385082830", "name": "rodel pasibe", "time": 1455204821298, "rating": 5.0, "text": "Got relief after the first visit, now my whole family goes for adjustments. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "111157066322882418752", "name": "Gladys Rudd", "time": 1584377904734, "rating": 5.0, "text": "Love these people!", "pics": null, "resp": {"time": 1594758426840, "text": "Thank you Mrs. Rudd, we love you too!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "104767249365781567656", "name": "Josue Jasso", "time": 1578525543969, "rating": 5.0, "text": "Good place", "pics": null, "resp": {"time": 1616609315882, "text": "Thank you for your review!"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "103333171734651580629", "name": "JJ M", "time": 1537639882438, "rating": 1.0, "text": "This Dr. is nutts!", "pics": null, "resp": null, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
{"user_id": "109256037850911362746", "name": "Charlie Crowe", "time": 1624413134920, "rating": 2.0, "text": "I was a little disappointed with my visit. Before I had done the in take paper work as a new patient we were talking about  12 visit plan. I didn’t feel that I was heard. There seemed to be an agenda other than my condition. I will say that they had me in and out fast.", "pics": null, "resp": {"time": 1624416536659, "text": "Thank you for your review. Your input is appreciated.\nYour perspective on the first visit is different than most of our patients but significant. The intake paperwork asks the patient to list all their symptoms and quantify their health complaints and instructs the patients to quantify their level of improvement over the next 12 treatments.... That is correct. The reason the paperwork addresses a treatment plan is so patients are aware from the beginning that holistic treatment is not a one treatment panacea, it's not a pill and it's not magic. It is a healing process and the specifics are handled individually with each patient.\nA 20 minutes face to face with a physician is unheard of these days and if you feel that was a short visit so be it. In a 20-minute visit we addressed the entire human frame above and beyond the chief complaint plus acupuncture and tongue analysis. The process didn't stop when you left the office but it continued as the tongue analysis was performed by OUM physicians in California and THERE WERE THREE EMAIL CONVERSATIONS REGARDING THE SPECIFICS. That was a step I take out of true concern for the health and well-being of my patients but it's cases like these that make excellent physicians become callus.\nBest of luck on your journey and next time find something to praise about the next person that gives a damn about your health and well-being"}, "gmap_id": "0x8892927a6c918d1b:0x6fa1927cce21bd5d"}
