{"user_id": "105044962524974615561", "name": "Charles Laidlaw", "time": 1594849224689, "rating": 5.0, "text": "Stuart and his team are outstanding!  Responsive, knowledgeable, personable, and reasonable costs.  I found him to be straightforward and honest, but at the same time, sensitive to my situation.  I would recommend him for any decontamination needs.  I found his customer relations to be top-notch.", "pics": null, "resp": {"time": 1594859074787, "text": "Thank you, Charles. We appreciate the kind words and positive feedback!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "101817843924647244811", "name": "Vanguard Birmingham", "time": 1594656160021, "rating": 5.0, "text": "Alabama Bio-Clean was thorough, professional and extremely responsive to our needs. We are very pleased.", "pics": null, "resp": {"time": 1594859173982, "text": "Thank you, Vanguard team! It has been a absolute pleasure to work with you!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "107375794760677872941", "name": "Marie Guerrero", "time": 1576863671258, "rating": 5.0, "text": "I highly recommend Alabama Bio-Clean to anyone needing their services. I unfortunately required their service due to my brother unexpectedly passing and his remains had decomposed in his home for approximately a month. I was able to get ahold of Stuart on a Sunday early morning and he quickly took my information and throughly explained the process. I then worked with Steve to complete the work and he handled everything with such compassion and care I am extremely grateful to him. We were faced with a very difficult situation on how to handle this and they handled everything and kept us informed of the project status at all times. They were kind, compassionate and professional throughout. I am very grateful that we used Alabama Bio-Clean for this service and I wouldn’t hesitate to use them again. If you require their services, I highly recommend them and you will not be disappointed. Thank you Alabama Bio-Clean for providing your services and taking care of the families the way you do. We will always be grateful ~The Guerrero family", "pics": null, "resp": {"time": 1577118412803, "text": "Thank you, Marie! We are so glad we were able to be of service to your family."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "112940478652632526032", "name": "Jennifer Johnson", "time": 1561497129447, "rating": 5.0, "text": "Your work was very much appreciated.  My aunt had passed away in the home and wasn't discovered for several weeks plus she was a hoarder.  Your team treated me and her things with so much compassion and respect as if it had been someone from their own family.", "pics": null, "resp": {"time": 1561553873467, "text": "Thank you, Jennifer. We appreciate the kind words. Our team strives to provide the best service to all those we serve."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "116506850202642592448", "name": "Dee Creel", "time": 1572215656665, "rating": 5.0, "text": "Alabama Bio-Clean did an outstanding job cleaning a room that had been damaged significantly. They were fast and very thorough.  I would highly recommend them!", "pics": null, "resp": {"time": 1572360711680, "text": "Thank you, Dee. Alabama Bio-Clean is committed to outstanding service. Thank you for the recommendation!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "106403972089806849279", "name": "Lynne Ninas", "time": 1569277421187, "rating": 5.0, "text": "Our job was a body which wasn't found for over a week. They were fast and professional. I am pleased with the results.", "pics": null, "resp": {"time": 1569281427286, "text": "Thank you for trusting us to care for your family. We appreciate you working with our team to help with such a sensitive situation."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "103633037923778965400", "name": "Jason Hickey", "time": 1568054112419, "rating": 5.0, "text": "Stuart and his crew are angels on earth. They not only did an amazing job for my family during our time of tragedy, but they showed an incredible amount of compassion. They took all the worry away and took care of the job while giving us time to mourn. I couldn't have asked for any better service by any better people.", "pics": null, "resp": {"time": 1568480022528, "text": "Jason, thank you for allowing us to serve you in your family’s time of need. Your kind words and compliments mean so much to our team."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "100180005230919815523", "name": "Lincoln Berland", "time": 1573763328839, "rating": 5.0, "text": "They were very prompt in responding, extremely courteous and highly efficient for a cleaning job in our basement. I highly recommend them.", "pics": null, "resp": {"time": 1573767298742, "text": "Thank you for allowing our team to serve you and the kind words. We pride ourselves in doing great work!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "112418711240383036882", "name": "Caroline Dorris", "time": 1576777565906, "rating": 5.0, "text": "Phenomenal customer service! Efficient, friendly and professional.", "pics": null, "resp": {"time": 1577118466073, "text": "Thank you, Caroline. Our team works hard to be efficient, friendly and professional!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "111111111183653095837", "name": "Danielle G.", "time": 1563826224057, "rating": 5.0, "text": "We were soo impressed with the way everyone employed by this company treated us and the compassion and kindness they showed.  Its was a very traumatic time in  our lives and these people we're so patient and very available for all our questions. They did a great job cleaning up and getting the smell out. They are not weird or shady like some of the ppl in these type of buisnesses. Great company.  I hope I never have to use you again, but if I do, you'll be the ones I call.", "pics": null, "resp": {"time": 1563827680364, "text": "Thank you for the kind words, Danielle. We appreciate you trusting Alabama Bio-Clean to serve your family."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "109493165217982754673", "name": "Shawna Kelley", "time": 1523459473731, "rating": 5.0, "text": "Considering all the circumstances in my situation, Alabama Bio-Clean is the company that helped get the job done!! They did an excellent job for my property and I recommend them to anyone who can utilize their services especially in someone's time of need. Thank you for your prompt work and outstanding service!!", "pics": null, "resp": {"time": 1568480261409, "text": "We pride ourselves in serving others! Thank you for the compliments."}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "110635179280190388464", "name": "Sheryl Tucker", "time": 1421683532661, "rating": 5.0, "text": "These guys are terrific!  They are hard-working, fast, and efficient, as well as professional, clean-cut, and respectful.  Even when my loved one got ornery as they were doing their job, they understood that this was stressful for her, and they still responded gently and with understanding, while at the same time, trying to reason with her.  I am so impressed at how much they accomplished in six days.  I think one more visit should finish the rest of the house!  I highly recommend them for hoarders!  (I'm sure they are superb at the other services they provide as well, but hoarding clean-out was what we used them for).", "pics": null, "resp": null, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "102799302416532719104", "name": "Terry Richmond", "time": 1545667677719, "rating": 5.0, "text": "Wonderful experience in a terrible situation, Alabama Bio-Clean's people were not only personable but calm, reassuring and very professional. We feel we received the very best advice and service during our disaster.", "pics": null, "resp": {"time": 1568480177822, "text": "Terry, thank you for the review! We were honored to serve you!"}, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
{"user_id": "103302081939759230770", "name": "Randy Reed", "time": 1503677685454, "rating": 5.0, "text": "Alabama Bio-Clean did a super job at our facility.  Stuart Frandsen and his team were highly professional with 100% of the emphasis on us as their customer.  I highly recommend these guys.", "pics": null, "resp": null, "gmap_id": "0x888975c361d884d9:0x2476487c353e8a84"}
