{"user_id": "114308907761100550853", "name": "Kentrell Applegate", "time": 1627748235012, "rating": 5.0, "text": "We did the combo nature/fishing trip and it was the highlight of our trip! We saw more wildlife in three hours than the rest of our vacation (crabs,fish,oysters,dolphins,sting ray, birds). I would definitely recommend this private trip over the larger dolphin cruises in the area. It was an amazing experience! Thank you captain Skip!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7nDVrQauTWnGfxY_Ug6KSO6fxykQFaXKy87g5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPN3K8VGkPtCNFaXRfq8riamNWYQaRPuI_24wd2=w150-h150-k-no-p"]}], "resp": {"time": 1627749338919, "text": "So glad your family had a fun time. Thanks for taking time to write a great review.\nThanks,\nCaptain Skip"}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "106688584650934420087", "name": "Kelly Tanner", "time": 1624464428263, "rating": 5.0, "text": "There are not enough good words for this experience! Skip is fantastic and so knowledgeable. We went with our three kids (12, 10, and 8), and they could not stop talking about how amazing it was. We learned about oysters, crabs, and multiples types of fish. The kids saw  dolphins and pelicans up close. We also added the hour fishing, and each of our kids caught at least 2 fish. It was the highlight for every member of our family for our summer vacation! I highly, highly recommend this to everyone.", "pics": null, "resp": {"time": 1624471477931, "text": "Wow ! Thanks for taking your time to write a review. I'll try hard to meet up with everyone's expectations created by your review.\nThanks,\nCaptain Skip"}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "109842979209811779302", "name": "Darien Miller", "time": 1622937681577, "rating": 5.0, "text": "We absolutely loved our trip! We will definitely go back next time we are in Alabama!! Skip you are the best, Thank you for the amazing memories we will cherish them forever. The three teenagers can’t stop talking about!!", "pics": null, "resp": {"time": 1622941703937, "text": "Thanks so much for cruising with me and taking the time to write a review.\nI'm so glad your family had a good time.\nThanks Captain Skip"}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "107673335728260922473", "name": "Nate Wood", "time": 1594913341595, "rating": 5.0, "text": "What more can we say about Capt Skip and the day we had aboard Windy  Ways.  Capt was very patient and informative, prompt in communicating, and fee was very reasonable.\n\nGlorious way to cement our love for each other.  Weddings for under $400.  All in - cake, champagne, flowers, misc., and 3hr charter.\nThank you once again Janet and Capt Skip.\n\nWill do this again!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRNmaAFAB1FnkbcBwaIbAM8U0A4yttvuwt7Ds=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3DgAP32qPRKZYQqPN5InigogkZeMPKtJ8jFY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPChtRBnjfg-SI4_urPL_ZqkOTfEyiSpLZOWio=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMKOMlPmv0Rx_qVlPSZUTXv8gMND1dGvc0YUM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_UEvschZ-ykNleLyRobCLwYo2UJFyT13e9qI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNMm3AOwijFetQBsdNaK8M4n-MKIgdWgtWBR0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEwM47_krM8vRGeMDK32H9iqPT0duqRW-j-_o=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "113946398358420208085", "name": "Michaela McCage", "time": 1617133523864, "rating": 5.0, "text": "Skip is amazing! He is so knowledgeable of the ecosystem in the area, and you truly see it all on his nature charters! Well worth the time and money. I would recommend his charters to anyone.", "pics": null, "resp": {"time": 1622941866428, "text": "Thanks so much for cruising with me. Thanks for the nice review."}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "109826361223310525501", "name": "Jessica Richards", "time": 1627401138403, "rating": 5.0, "text": "We just returned from the nature trip with Captain Skip. As 2 moms with 4 girly girls ages 5-9 we were unsure about going on a shrimping, crabbing, and oystering trip without the dads but y’all…. WE HAD AN ABSOLUTE BLAST. Captain Skip first goes over all the safety measures with you and it’s really reassuring with young ones on board. We learned all about the wildlife then kids were constantly entertained with all the hands on experiences. We held oysters and snail shells, learned how to tell boy crabs from girl ones, spotted different birds.. The best parts were watching the dolphins follow the shrimp net(they were all around the boat!), and picking out the different fish in the tank and having the kids throw them back in the water (some made it, others were caught was birds!). They kids even caught a baby sting ray! Thanks again Captain Skip for the best time!\n\nDon’t hesitate to book this trip!", "pics": null, "resp": {"time": 1627749602593, "text": "Thanks Jessica for the nive review\nMakes my day to hear that my guests had a great time.\nThank you !"}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "114832839804743055340", "name": "Bob Vast", "time": 1622765684239, "rating": 5.0, "text": "Amazing trip! Very knowledgeable.", "pics": null, "resp": {"time": 1622773510414, "text": "Thanks for cruising with me. And thanks for taking the time for doing a review.\nAnd finally, thanks for the nice review.\nCaptain Skip"}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "104779760775237826453", "name": "Katie Yaeger", "time": 1591127993731, "rating": 5.0, "text": "Captain Skip was by far the best! Very knowledgeable and so patient with our 2 and 5 year olds. Favorite part was shrimping. Thank you for a wonderful trip.", "pics": null, "resp": null, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "102396147435181019874", "name": "Katy Chase", "time": 1581988419878, "rating": 5.0, "text": "Fantastic trip. 6 hours later we are still talking about it. Have reccomended to many.\nThank you, Skip.", "pics": null, "resp": {"time": 1581997796951, "text": "Thanks for the nice review. I'm so glad you enjoyed the cruise.\nThanks\nCapt. Skip"}, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "101729673731335383445", "name": "Mauricio Lopez", "time": 1565129142526, "rating": 5.0, "text": "Best experience lots of fun for the family and free dolphin watching", "pics": null, "resp": null, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "113772326852756184056", "name": "Janet Beebe", "time": 1517959228141, "rating": 5.0, "text": "Thanks for asking my opinion this is my home and business is a great place", "pics": null, "resp": null, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "114525358347988962063", "name": "Chereenah Larkin", "time": 1531874326706, "rating": 5.0, "text": "Best part of our vacation!!!", "pics": null, "resp": null, "gmap_id": "0x889a060cd54607cb:0xf086350bfad27b9d"}
{"user_id": "106606620714127602179", "name": "Jonathan Shearer", "time": 1620952771640, "rating": 5.0, "text": "I can't wait until they open back up this summer! I've lived in the desert most of my life, so, now that I live near the ocean, I am anxiously awaiting the return of Carnival and a chance to venture far out into the gulf.", "pics": null, "resp": null, "gmap_id": "0x889a4fda329dc6f9:0xc7363cb4bb6bdc31"}
{"user_id": "106548200471721872270", "name": "Scotty", "time": 1621136249429, "rating": 1.0, "text": "The lady didn't know much asked about the covid passport", "pics": null, "resp": null, "gmap_id": "0x889a4fda329dc6f9:0xc7363cb4bb6bdc31"}
{"user_id": "110237217175601926941", "name": "Roxie Wilson", "time": 1621034700769, "rating": 5.0, "text": "Love its. 💘", "pics": null, "resp": null, "gmap_id": "0x889a4fda329dc6f9:0xc7363cb4bb6bdc31"}
{"user_id": "107757625209362433318", "name": "Justin Stoddard", "time": 1623862228692, "rating": 5.0, "text": "Lisa is amazing lady. Very helpful and positive bout everything. Will take the time to help plan any vacation needs. I enjoy her helping us plan our summer vacations. 5stars can't say one negative thing about her and her services.", "pics": null, "resp": {"time": 1623866363714, "text": "You are very sweet!  We will  find the perfect opportunities for you and your family!  I am enjoying working with you, Justin!"}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "117547193041453748522", "name": "Holly Schneider", "time": 1620086794795, "rating": 5.0, "text": "HANDS DOWN THE BEST TRAVEL AGENT I HAVE EVER WORKED WITH! my honeymoon trip got ruined by the resort, they extended renovations through November (my honeymoon is in September) and they never informed me of the change. I was devastated, I had all this disappointment with covid and now this! Lisa gave me multiple alternative options and worked tirelessly for days to make something work for my fiancé and I. She gets back to you right away and really listens to what you want to give you the greatest experience she can. I would choose her again 10/10 times for any future travel plans.", "pics": null, "resp": {"time": 1620087534894, "text": "Holly,  thank you for your patience and kindness during this mishap!  I am so glad we could fix it for you and Wes!  You are very sweet! Lisa"}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "117413974803220717151", "name": "Pat Greager", "time": 1539616875125, "rating": 5.0, "text": "Lisa planned a exciting & beautiful tour.  I was amazed at how organized everything went \"like clock work\"!!!  We saw the highlights of Portugal & Spain, as well as the smaller personal parts of the quaint little villages and their people. The hotels, our guides, transportation & food was the best.  It's  easy to see Lisa puts her heart into making the tour something unforgettable for her clients. She's #1 in my book, can't wait to travel with her again. (Thank you Lisa for the TLC)", "pics": null, "resp": {"time": 1539622730062, "text": "Pat, it was an absolute pleasure working with you and traveling with you!  I can't wait to go somewhere else with you! Lisa"}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "105171212290638891986", "name": "Sam J", "time": 1555451724632, "rating": 1.0, "text": "Lisa has been the worst travel planner we have ever had to work with. To begin, she can’t communicate clearly or even spell words correctly, so almost all her interactions with us were incredibly hard to read and understand. Next, she kept emailing us the wrong dates and times for almost everything on the trip. You name it, she messed it up, from flights to shuttles to hotel info. It was unbelievably confusing and frustrating to have to keep clarifying and working through misinformation. Additionally, she has an excuse for everything and can’t take ownership of her mistakes. We never received an apology for one of her many errors. She was pushy, illiterate, lazy, and entitled. I would never recommend her to anyone and have no idea how she has received any positive reviews. This has been a horrible experience for all of us. There were so many problems and we would have been a thousand times better off putting the trip together ourselves. Do yourself the biggest favor and never bring your business to this irresponsible girl.", "pics": null, "resp": {"time": 1555617427938, "text": "Hello Sarah J.   My sincerest apologies for your bad experience with a travel planner.  But, it isn't me!  I went through all my files today looking for someone with your name and I don't have any client fitting your name.  I also communicate very clearly and am diligent in ensuring I have the correct information for my clients.  I would love to help you if you have travel needs and prove to you that I am actually excellent at my job.  It is sad to me that there are travel planners who aren't proficient at their job.  I am so sorry for your experience.  In addition I am a woman of 60 years not a \"girl\" with over 20 years in the business.  Whenever I have made a mistake, I always take responsibility for it and make it right.  As I said, you are welcome to reach out to me personally  and I would happily ensure you have a great experience."}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "101883825134467886321", "name": "Tammi Bortner", "time": 1528571588521, "rating": 5.0, "text": "Lisa planned a wonderful trip for us to Riviera Maya in Mexico.   The resort, the food, the staff were all excellent.   A perfect carefree getaway planned by a true professional.   Always a delight to work with!", "pics": null, "resp": {"time": 1528587449046, "text": "Thank you, Tammi!"}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "101343049786589699472", "name": "Taylor Ellis", "time": 1519840307344, "rating": 5.0, "text": "Lisa Tanner is the most knowledgeable travel agent I have ever met! I have not yet booked a trip with her yet, but I definitely will in the near future. She is extremely educated when it comes to travel best practices and planning a trip. I would highly recommend her to help you plan a trip!", "pics": null, "resp": {"time": 1519842300231, "text": "Thank you!  I look forward to working with you."}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "118279081000963395169", "name": "Catherine Long", "time": 1539644569646, "rating": 5.0, "text": "Castles,cathedrals,wineries,olive farms BARRACAS/ paella classes and dinners to die for. Shopping non stop and oh what about the Flameco/ fun fun group Excellent guides everywhere! Lisa is an amazing  ,strategic,TRAVEL MAKER! ❤️❤️", "pics": null, "resp": null, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "113079700930574487564", "name": "Miracle Azoca", "time": 1573357407373, "rating": 5.0, "text": "So blessed ❤️", "pics": null, "resp": {"time": 1573394487382, "text": "Thanks, Miracle.  I was happy to work with you!"}, "gmap_id": "0x88608b39ab135f4b:0xae2e2740c60c355b"}
{"user_id": "111708735438679206444", "name": "Sara Olivencia", "time": 1624127073733, "rating": 5.0, "text": "We went on the pirate cruise and it was so much fun! This was our second time on the cruise  and I would highly recommend it.\n\nMy kids 4 and 8 love it! The pirates are really friendly and talkative with the kids. The kids get to play lot of water games to stay cool.\n\nThere is very little shade. Wear sunblock and bring a couple cold bottles of water with you.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMQwCB53Jzaw18urb6mv2aO0Mi28pfctDmnBkfO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "109544488219792108696", "name": "Patrick O'Connor", "time": 1626810231466, "rating": 5.0, "text": "Phenomenal! Great Captains and Deck Hands. LOADS of fish. Take the 6 or 8 hour trip if serious about fishing. Take the 4 hour if you just want a boat ride.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "105641229329402056021", "name": "Colton Sweeney", "time": 1625162330317, "rating": 2.0, "text": "4 hour fishing trip was actually not even 2 hours of fishing. They told us to be there 30 minutes early (7:30am) but we didn’t leave the dock til 8:30am. Took an hour to get to the fishing spot. We were constantly moving, so we couldn’t even let our bait sit for fish to get it. Don’t think anybody on the boat caught anything worth a picture. Cherry on top was when it took an hour and a half to get back to the dock. I’m not sure why but we were going the speed of smell. Only reason they get two stars is because the crew was nice.", "pics": null, "resp": {"time": 1625164652508, "text": "Thank you for your feedback. We will try to improve our performance in future."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "109448717336349307640", "name": "Ron Sheffey", "time": 1627221833100, "rating": 2.0, "text": "Not family friendly.  Crew used language not appropriate for children and did not want to help children or anyone . Bathroom was ridiculous for all! Captain had own agenda and did not consider passengers even with several very seasick.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "113474584404003178631", "name": "Floyd Middleton", "time": 1626467781784, "rating": 5.0, "text": "You'd like to go deep sea fishing I suggest you take this trip with these guys any one they got everybody's friendly and the captains put you on the fish great experience thank you", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108799767585984097410", "name": "Sherry Stout", "time": 1627658304774, "rating": 4.0, "text": "We had a great time.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN5-Bb3q3PKxNAcZ72lmuXWGtlZRpFmtD2-sMeg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "116170982147585230387", "name": "Just V", "time": 1623692240384, "rating": 3.0, "text": "Decent time.  Have been on many fishing trips. This was first time we didn't catch anything.  Deckhands said the captain was still in training.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "100112620822331472753", "name": "Johnny Fuller", "time": 1623876879436, "rating": 4.0, "text": "Had a fun trip.could use something to get your cooler back and forth from boat.its a long way  to get to boat", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114081320692615497880", "name": "Jill McCowan", "time": 1596942910448, "rating": 4.0, "text": "Even tho we got soaked on our tour and had to cut it short, it was still enjoyable.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGYN2BS7lHBK0OR4_kvCQHqxFl5YVj5mimBRUH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOA1Ymk6HuT0r0yFeHDYq8lGuObpj-rTmELhh2P=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108961580354972501878", "name": "Amy Jo", "time": 1555634913607, "rating": 5.0, "text": "We had a great time on our dolphins cruise. The caption and deckhand were friendly. The kids had a blast and the views were amazing. The kids even had a water fight with pirates.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQ0hVaq68M7SPfOf50yU5n-2Y_E4_DPZA7u0rZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRxRKVdF263QeVglBLOBwMIQ6GI70M3dqvrpM0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_Qt3_ObvI2c427dVRB72QD1wFgT6mRRmtqWBF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "104691344408054441869", "name": "Jessica Standley", "time": 1609390581381, "rating": 5.0, "text": "The dolphin cruise was amazing! Captain Jason and Brad did such a great job finding us dolphins and made sure that everyone had a great experience. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "109336242671021637298", "name": "David r", "time": 1559655320178, "rating": 5.0, "text": "Water was very scenic. Crew member complimented my socks. Felt like a fisherboy. Saw a beer can and a styrofoam cup.\n\nWe also fished. Very enjoyable. Would recommend to a friend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMIxTYrmBdA2QPNYrGF5Gc4ZdPYfKnGxqrXFxvV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOjOvUhFjHedvep7rfQIfFaZ1XOZ4r2IhE4wF8_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114990386539318743109", "name": "Kim Smyly", "time": 1615619991749, "rating": 5.0, "text": "Great, helpful staff.  Captain was very good!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108433850513267517153", "name": "Angie Stiel", "time": 1521439404228, "rating": 5.0, "text": "My fist time out on a fishing charter boat.  I loved it. Honestly didn't think I would enjoy it but when I reeled in my first tiny fish and then hit my monster fish I was hooked. The crew was very helpful and friendly. Shout out to first mate Jason and the other two crew members that worked their butts off to make sure we had a great time. Thanks to the captain for our safe return to dry land. I had a deal with my dad that I'd go but I was not touching any bait or fish lol. So yep I had a great time and best thing was I didn't even chum up the Gulf.  Dad holding my monster fish.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP1Yta7PQ3k4Ng2pUh4aLjlShCgQyWA2seQib-w=w150-h150-k-no-p"]}], "resp": {"time": 1530358530728, "text": "Thank you for fishing with Hudson Marina!  We are glad to hear you had a great trip, and congratulations on your catch.  We appreciate your business and the time you took to leave a review.  Come back again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "105338668820991915894", "name": "Chad D", "time": 1594402071125, "rating": 4.0, "text": "Friendly deck hands, very knowledgeable. Better if we would have caught more fish, but that's the way fishing goes sometimes. We took the 4 hour party boat deep see fishing service.", "pics": null, "resp": {"time": 1597330995491, "text": "Chad, thanks for the review and joining us. Hopefully the next time you join us the fish will be in a biting frenzy."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "102351120971033053699", "name": "Rodney Ford", "time": 1627495439630, "rating": 1.0, "text": "Waste of money be better off brim fishing", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108749386585888320547", "name": "Robert M. Puig", "time": 1598576817831, "rating": 4.0, "text": "I had an awesome time :) Great food, sights, he let us drive the boat. What a great time for a good cause too", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114565860916992683555", "name": "mikey lemaster", "time": 1594785123334, "rating": 5.0, "text": "One of the best places to fish that I have found. Our party limited out on Red snapper and the C.A.T. Captain and crew were great.", "pics": null, "resp": {"time": 1597330852485, "text": "Mikey, thanks for joining us on the C.A.T. We can’t wait to have you on board with us again."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "109162935010241998899", "name": "Hannah Horohoe", "time": 1559684087476, "rating": 1.0, "text": "The dolphin tour was a huge waste of time and money. We were asked to arrive early to prepare for the tour. At 3pm they had us walk down the dock to the boat, but did not allow us on the boat for twenty minutes and would not tell us why. After burning in the sun, they took us out to the gulf to see what we could spot. The captain would shout out dolphin “facts” over the intercom to keep us entertained. One of them being, “dolphins can get up to 10 tons.” The crew had us yell and clap at the dolphins when we saw them. I do not believe dolphins like to be catcalled since they would flee from the boat. I have done another dolphin tour in orange beach in the past. We should have returned to them. Overall, I do not recommend.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "111473983636279812641", "name": "Amanda Rich", "time": 1561732188710, "rating": 5.0, "text": "Absolutely everything I wanted and more! The crew was awesome! They helped make sure all of the kids got to reel in some good fish! Everyone in my party of 6 got to catch we had a blast!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "104345595908715149634", "name": "bamababe75", "time": 1559444790480, "rating": 1.0, "text": "We were supposed to be on the C.A.T.  but got bumped to a party boat. The Explorer.   They could not find  fish.  Worst fishing trip ever!  Deck hands were super nice but not very knowledgeable.  Definitely not worth $150.00!  I went on the Wishbone last year and it was amazing!  That was what I paid for this year but t was horrible! Never again!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "102715924275221528982", "name": "Bryan degroot", "time": 1551729877541, "rating": 5.0, "text": "My boat engine died after towing it from Michigan with plans to fish with family. Obviously that plan changed, and we decided to fish from a party boat. Something I normally would not do, as experience has taught me that this is usually a low likelihood of success fishing trip, where little effort is put into ensuring a good shot at catching fish. Imagine my surprise, when we fished with Captain Dan aboard the Explorer. What a difference! The Captain put us on fish, and knew when and where to move to keep the action consistent, and stayed out a bit longer than planned to ensure everyone had a good shot at a catch. The crew, from First mate Jason to Julie, Steve, and Ashton, the entire team was first rate. They were fun, lively, VERY helpful and worked hard to keep lines in the water and made sure everyone was attended to, with bait, and fish removal as well as quickly fixing tangles, and kept everyone fishing.\nBy far the hardest working, and most attentive crew in Party boat fishing.!! Top notch. Thanks for your efforts!! I would recommend this group to anyone. Coming from our group of 10. Ranging from kids and 1st timers to experienced anglers, we all had fun.\nHighly recommended trip.", "pics": null, "resp": {"time": 1530358432538, "text": "Thank you for your business and for leaving a review.  We are glad you had a great trip and appreciate the compliments you left for the captain and crew. We hope to see you again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "102893544790701644751", "name": "thomas lynch Jr", "time": 1595072851686, "rating": 5.0, "text": "Fun place to go to see dolphin and for kids they have a pirates boat to", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "113864000198270431686", "name": "Lauren Schanz", "time": 1506286758550, "rating": 3.0, "text": "The cruise and Captain was great.. The captain did an awesome job telling and showing us things about Orange Beach on top of seeing the dolphins. My family and I enjoyed watching the Dolphins. $10 a person is a great deal til have a to pay for an infant.. $3 a piece for can soda, water, chips and cotton candy absolutely ridiculous. Office staff could be a lot more friendlier and helpful. Three staff members and they couldn't even help find suitable life jackets for the children and infants. Couldn't find one infant life jacket so had to find the smallest child life jacket. They just sat there talking to each other and on the computers..", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114996517613180284426", "name": "shelby leblanc", "time": 1528386072392, "rating": 5.0, "text": "Sitting at the beach and Saw a boat that said Dolphin Tours, Hubby and I decided why not go on one. Best $12 ever spent. Got to see some dolphins, got to have some drinks and snacks! The bartender was super sweet as well as our tour guide, she has AWESOME recommendations for places to eat with the best views. Very cute family owned Business!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "113094732813484433195", "name": "gary dollar", "time": 1553983068898, "rating": 5.0, "text": "Best dolphin cruise I've been on. The operators were super fun and they made sure we saw dolphins of course but were super engaged with the whole group. Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108704389578438704539", "name": "Sara Benningfield", "time": 1508286159591, "rating": 5.0, "text": "Well worth the money!! We had so much fun. We saw lost of dolphins and he was very informative about the cruise and what was going on. Also the co-captain Jason did an awesome job with the kids and keeping them interested and showing them where the dolphins were. We will be back!! Thank you for such a relaxing dolphin tour!!! 🐬🐬🐬", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "101686388931921534753", "name": "Mike McCravey", "time": 1533896843970, "rating": 5.0, "text": "Took the family for a fishing trip while on vacation and had a wonderful time! We didn't catch much, but we had a few fish for dinner that night. The captain and crew were awesome and the boat was wonderful as well. For my first time out deep-sea fishing, this was a great experience.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108901819069363243405", "name": "Ashley DeBord", "time": 1558662294854, "rating": 5.0, "text": "Had a great experience this evening on our dolphin tour. Even though we didn't see many dolphins, the crew made every possible effort to give us a great experience. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "112588275953705806358", "name": "Christy Lewis", "time": 1529521524076, "rating": 5.0, "text": "Thank you for a wonderful fishing adventure.  The crew was very attentive and personable.  We would recommend this trip/adventure to anyone who was looking for a fun adventure in the Gulf Shores/Orange Beach Area. 😀", "pics": null, "resp": {"time": 1530323904472, "text": "Thank you for booking with Hudson Marina!  We glad you had a great time fishing,  and thank you for the time you took to leave a review.  Come back again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "109051437031037917690", "name": "susan rice", "time": 1521247916667, "rating": 5.0, "text": "We had a great experience! Caught lots of fish on our trip. Crew was friendly and helpful. Had an added on bonus with a dolphin jumping out of the water putting on a show right next to the boat.  Jedidiah... fish on!!!", "pics": null, "resp": {"time": 1530358588182, "text": "Thank you for fishing with us! Congratulations on your catch.  We appreciate your business and hope to see you again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "100253420759539457712", "name": "Adrienne Williams", "time": 1521851983201, "rating": 5.0, "text": "Was a nice boat ride of the gulf and orange beach. Crew were very nice and knowledgeable of the surroundings. Saw a few dolphins and they made every attempt to show us them!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "110001724783670029231", "name": "Eddie Ledkins", "time": 1550102929570, "rating": 5.0, "text": "Deckhanded on the boats there last season. Good Captains and crew. Best prices on 4 hour deep sea fishing trips.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114742776727529072075", "name": "art moyer", "time": 1593541338005, "rating": 1.0, "text": "Worst trip I've ever been on one of the mates was sea sick and the captain could not find the fish and out of 30 people only 6 fish longest was 16\"", "pics": null, "resp": {"time": 1597331208438, "text": "Art, we apologize for it being a rougher day on the water and for the bite being slow that day. Hopefully next time the seas are calm and the fishing are biting"}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "105654223948589743124", "name": "Kirstin Fullenwider", "time": 1505844778737, "rating": 5.0, "text": "Highly recommend this place. Jason and Corbit were a lot of help and made this fishing trip one of the best I've ever had! Can't wait to come back next year!", "pics": null, "resp": {"time": 1508438548545, "text": "Thanks!  We love to hear great things about the crew!  We are glad you enjoyed the trip and hope to see you again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "111273865834909830062", "name": "adam quick", "time": 1559738451787, "rating": 3.0, "text": "We were told to be there early because the boat was leaving at 7:30 well it was well after 8:00 when we finally left and everybody was catching good fish untill the captain wanted to keep moving, then one of the deck hands kept moving everybodies fish around and nobody knew where their fish were and there was some big fish that couldn't be found do to the deck hand swapping our buckets around, but due to leaving the dock late our trip was cut short. Other than that it was fun and we had a pretty good time I guess, deck hand todd was awesome and he deffently knew what he was doing", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "117999417123324361714", "name": "Kelly Standley", "time": 1532741712696, "rating": 5.0, "text": "Had a great time on a four hour morning party trip. Every one in our group had a catch. Some with as many as 5-6.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114688610584650818356", "name": "Tabitha Freeman", "time": 1568681500537, "rating": 5.0, "text": "I want to thank the captain and crew for making one of my sister dream come true she was diagnosed with stage 4 cancer  with only 6 to 12 months and although she was very sea sick they did everything to make sure she caught some fish and she said even though she got sea sick she would do it again  love them for  them making her feel great", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "101036735928027546433", "name": "Joe Eaton", "time": 1528938644096, "rating": 5.0, "text": "Great boat ride. seen several dolphins playing. Crew was great, Captain was awesome, with the history, and knowledge of the area and dolphins as well", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "106406338427680149582", "name": "aften giles", "time": 1530737959454, "rating": 1.0, "text": "Only saw like 2 dolphins while other dolphin cruises was going out not the ocean but not this one he did circles and pretty much didn’t go anywhere except the bay very disappointed", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "109831568302657861486", "name": "Daniel Alexander", "time": 1532575574263, "rating": 1.0, "text": "I was highly disappointed in this cruise being I had gone deep sea fishing with the same company the day before and had an absolute blast. However this was not the case on the Dolphin cruise. Trouble started as soon as we boarded the boat. As we walked up the stairway to the upper deck to view the dolphins there were no benches or any permanent seating just the cheap white lawn chairs you buy at Dollar General. This not such a big deal but very in professional looking. Second of All as soon as we sit down in our lawn chair we noticed there were way to many people on the upper deck for the amount of chars provided. This was due to the lower deck witch is enclosed and air conditioned smelling like raw sewege. We not talking about a little stick, it was so bad not one person could stay inside and by the end of the trip the smell was leaking out of the lower deck and was ingulfing us on the stairway outside on the boat.This was my chief complaint just due to the fact I have 3 small children that use the bathroom a lot and I was having to go in and out of this stink a lot!! Also could have seen more dolphins from the beach and we had got a lot more close to the dolphins the day before fishing. It was hour into the trip before we seen a dolphin 200yds away.  People save your time and money huge let down on the dolphin Cruise. But the deep sea fishing trip is great.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "112729767571819831638", "name": "Terry Hammond", "time": 1532115365905, "rating": 4.0, "text": "Captain was pleasant and good with the kids. Even let them drive the boat. However didn’t see many dolphins.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "104243203846769707352", "name": "Nik-Nik Pat", "time": 1537067200387, "rating": 4.0, "text": "So sorry we we were running a little late Captain!! We had a  wounderful time.The water was beautiful and the dolphins were amazing.We saw one doing flips out of the water,he was for sure showing off.We will be back to bring the baby when she’s older.Godbless.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "117291416776496563504", "name": "matt mansfield", "time": 1530998382703, "rating": 5.0, "text": "Great experience even on a choppy day, the crew was very helpful and went above and beyond to make sure everyone (especially the kids) had a great experience", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "105783782817732124548", "name": "Justin Blair Fishing", "time": 1530738816352, "rating": 2.0, "text": "Started out good saw dolphins then headed towards the inlet and open water and the captain went down stairs. Boat stopped and idled in the inlet for a good solid 10 minutes then when he came back we turned around and cruised the inlet then went back 2 stars only because we saw dolphins early on in the cruise after that nothing", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "115763857207844364304", "name": "Stefanie Miller", "time": 1491345623941, "rating": 5.0, "text": "Capt Rodney and Porter were great. We saw some beautiful dolphins including a baby. Great time for the whole family.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "114697603950291318054", "name": "Christina Conn", "time": 1538307201741, "rating": 5.0, "text": "Great price and we saw tons of dolphins. The boat ride was very smooth too.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "103825724188431378248", "name": "Drew Hysong", "time": 1530046992423, "rating": 5.0, "text": "We had a great time and everyone should have caught at least one fish.  They were biting.", "pics": null, "resp": {"time": 1530323614500, "text": "Thank you for fishing with Hudson Marina!  We are glad you had a great time and appreciate the review you left.  We hope to take you fishing again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "111553274197812649423", "name": "Steve Fuller", "time": 1541948663608, "rating": 2.0, "text": "The boat broke while we were out, so we stopped for a while to fix, then went unreasonably slow moving spot to spot.  Captain tried to pass the slow speed off as trolling, but it was unproductive as only 2 fish were caught in hours of trolling.  Nobody on the boat was satisfied with the their experience.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "103151621189699030653", "name": "Kenny McCallister", "time": 1537288779736, "rating": 5.0, "text": "Pirate ship adventure was a Great family trip! C.C. was awesome!!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "118229518544342749989", "name": "Quan Nguyen", "time": 1529959991042, "rating": 5.0, "text": "We had good time with captain Dan and his crews on the explorer", "pics": null, "resp": {"time": 1530323747138, "text": "Thank you for fishing with Hudson Marina!  We appreciate your business and the time you took to leave a review.  We are glad you had a great time and hope to see you again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "110837248750084546906", "name": "J C", "time": 1487860099081, "rating": 5.0, "text": "My husband and I are Snowbirds from Canada and we enjoyed a delightful voyage on the Perdido Queen at the Hudson Marina on February 22, 2017.\n\nThe lunch was delicious!  There was ample food for everyone!\n\nChicken, pork, salad, mashed potatoes, pasta, grilled vegetables, dinner rolls and strawberry bread pudding!  There is a bar onboard and you can enjoy an alcoholic beverage with your lunch.\n\nCompliments to Chef Jonathan!  Two thumbs up!\n\nIt was a very smooth ride and we enjoyed seeing the sights!\n\nThe Staff is very professional and polite and assisted the passengers boarding and departing the Perdido Queen.\n\nWe will recommend the Perdido Queen to our American Snowbird friends!", "pics": null, "resp": {"time": 1530358719294, "text": "Thank you for cruising with Hudson Marina!  We are glad you had a great experience, and thank you so much for taking the time to leave a review. We hope to see you again soon."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "106783467129149818018", "name": "Kelsey Sims", "time": 1531658888320, "rating": 1.0, "text": "Worst dolphin tour I’ve ever been on. Captain complained over speaker the whole time. Took us to the end of the bay and said he wasn’t going any further because of waves. We literally sat there and watched other dolphin boats pass us to go out. Saw two dolphins fins. That was it. Paid $60 for 4 people for nothing. After tour, spoke with captain about how disappointed I was. He didn’t care. Called and spoke to manager and they were rude to me. Waste of time. Do not go on this tour. Choose a different company!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "116970451152437868029", "name": "James Dennis", "time": 1536706201409, "rating": 5.0, "text": "Caught my limit plus 2 big ones Jason really took care of all of us", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "101848231560099595987", "name": "Angel Reavis", "time": 1592448279857, "rating": 5.0, "text": "Best dolphin cruise", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "110736244387105644279", "name": "Mark Waters", "time": 1503824613273, "rating": 4.0, "text": "A one one thing.  We saw dolphin and nice landscape but overall not a highligt of summer.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "112630261362670391391", "name": "Maddison Leonard", "time": 1561782135207, "rating": 5.0, "text": "Really fun saw lots of dolphins", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "116645713594199119893", "name": "Judy Johnson", "time": 1487008687766, "rating": 1.0, "text": "The  food on the valentine's  cruise  was disgusting.  Don't  waste  your .money.", "pics": null, "resp": {"time": 1530358788256, "text": "Thank you for your business.  We strive to provide each customer with an exceptional experience and apologize if you did not enjoy the activity."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "108056702684378713223", "name": "Craig Hare", "time": 1530008785644, "rating": 1.0, "text": "You will spend most of your time riding and not very much time fishing. Save your money and go to tje state park pier.", "pics": null, "resp": {"time": 1530323675436, "text": "Thank you for your business.  We apologize for any inconvenience you experienced.  It is our goal to provide each customer with an excellent experience."}, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "115148944342502621641", "name": "Denisa Berry", "time": 1548131235228, "rating": 5.0, "text": "Very enjoyable.", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "117155686041931429521", "name": "Michael Brown", "time": 1594935548236, "rating": 1.0, "text": "They will cancel on you!!!!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "112636576920083694509", "name": "Phil Berry", "time": 1542206966461, "rating": 5.0, "text": "Amazing experience", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
{"user_id": "117830329188900865886", "name": "Adrian Salas", "time": 1527636277494, "rating": 5.0, "text": "Love it!", "pics": null, "resp": null, "gmap_id": "0x889a349e9e0f1cc9:0x80cc4af501f95590"}
