{"user_id": "109619675205096985804", "name": "Nghia Huynh", "time": 1533477701944, "rating": 5.0, "text": "Wonderful dessert spot that has a unique atmosphere and vibe. Everything is based on Alice in Wonderland from the paintings to the decor. The menu is unique, exquisite, and delicious for all ages. I recommend going here for hang outs or just for a quick bite with the family.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOv3Tl2MdK6RIODEctiodeNIjvmrXLe6mQ_2k67=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPvXHY_rAh9oeg0piiV95fckLoGhCrSMVJyVwjA=w150-h150-k-no-p"]}], "resp": {"time": 1535945114221, "text": "Thanks for the love! We're hoping to get even more cool artwork up soon!!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "111355980571480367779", "name": "Adam Robinson", "time": 1553520064282, "rating": 4.0, "text": "Something different and unique! Great attitudes and atmosphere!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNE_TxrwCi00jW66gsbo1FvnPEi0__39f4PQkfn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-MoS3zmRJ28Rb1YqhuiNa8STUbiSJEvFYnx6B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOuawTbasousXXsDM6WrNsyhQjvUT5tIeS2qK1B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8sS26EbWl66biHuDdciG-KyAqUx7WXvHRYBPx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "108659578881549219395", "name": "K8 Naclr", "time": 1546118727841, "rating": 4.0, "text": "Food was amazing!! Service was having some trouble. Great yummy drinks.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNNtkP3COql3s2BXpqFutBSlcdl4LrEC0XqVvJx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104730995248469061339", "name": "Heather Trinh", "time": 1531878661978, "rating": 3.0, "text": "First things first, the drinks were great and well prepared. Now, the customer service was really wrong, hate to put it like that but the young lady did exactly what you should never do. While taking our order she was visibly annoyed, unfriendly, and short both in her tone and body language. There wasn't a sense of customer service to me at all: no smiling or anything. So even though it tasted great and there's a lot of potential, the service improving would greatly help this store, that's just the truth, but nice atmosphere and everything : )", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOIcwHwSxp8xI60GWY5FyOUdONi4FoKX9SXj7k=w150-h150-k-no-p"]}], "resp": {"time": 1531863013979, "text": "Thank you so much for the feedback, Heather! I truly appreciate you taking the time to let me know! We are in the process of training up two new servers, so hopefully today's experience will be remedied once they're fully trained. I would love to get some more feedback from you so that I can follow up on your experience with my shift leader and continue to improve the cafe! My email address is Alice@TheWonderlandCafe.com. Please do not hesitate to email me. Thank you again for reaching out!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110451810343837860449", "name": "Terilyn Hodges", "time": 1547851866469, "rating": 5.0, "text": "The service was amazing the server was lively and charismatic! Food was great! Please go visit to save this resteraunt gem! Go to Wonderland!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMqZgFCkzWsCgZpmJTOvAEDVihujQOccz9Eqphw=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116932204071976804703", "name": "Big Pop Productions", "time": 1536290146576, "rating": 5.0, "text": "This place is AWESOME. Great lite plates and the atmosphere was delightful. Met the cook and she was super nice to me and my family.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOwOXSPXhMs2WF_B3hVfdc27I8foTv4p00LRUrf=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110421368245796635899", "name": "Haden Sisk", "time": 1535916794492, "rating": 5.0, "text": "Really cool place. The drink treats are awesome, the foods delicious and has cute themes, and they give popcorn out before the meal.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNrka1_W0QiKKCveNpIzLTXJlDw42MFk7VoVow6=w150-h150-k-no-p"]}], "resp": {"time": 1535944981226, "text": "Thanks for checking us out! We're psyched to hear that you enjoyed yourself!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "100621223601285246326", "name": "Cherry Duke", "time": 1548554935731, "rating": 5.0, "text": "We had a wonderful time here!!!!!! The waitress was super friendly and took her time to explain everything to us.  Our food was delicious! We will be back very soon to try more goodies! I LOVED the popcorn given to us as we sat down; different than your typical bread basket. The tables and decor were top notch.  I would suggest making sure the heater is turned on before guest start to arrive. We got there at 11 am and it was freezing. The thermostat said it was 59 degrees in the cafe; we wrapped up in blankets as we ate.  I would  also suggest the staff get there earlier. We were waiting at the door for someone to arrive. The waitress arrived after we did. None of this changed our experience. We had a great time and will be back.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "105927707020492253536", "name": "Carley Pekelder", "time": 1552248538829, "rating": 3.0, "text": "Good food and setup. I like that they encourage hanging out and gaming.\n\nThe atmosphere and decor are very strange, though. Curtains would help a lot. The view of the parking lot outside would not be missed. Weird music. Also, the high gloss paint is awful. I can't see returning just for the food.\n\nPlease hire someone to redecorate.\n\nBTW the website is really nice", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103328607110011183422", "name": "Kimberly Brigner", "time": 1551034570810, "rating": 5.0, "text": "Wonderland Cafe should be very proud for offering something totally unique in their area.  This is a very welcoming and family friendly establishment (also ideal for a date or solo treat-yourself) and food wise you get what you pay for.  It's a simple menu prepared fresh and plated and served with a lot of love.  The drinks are decadent! The staff are friendly and attentive.  It's a small space and the staff stays busy so go ready to have a good time and soak up all of the adorable details while you wait.", "pics": null, "resp": {"time": 1551036394007, "text": "Than you so much, Kimberly! I'm so happy you had a great time! We dream of having a larger space someday!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "117446881123573499674", "name": "Shelby Barlow", "time": 1529124723080, "rating": 5.0, "text": "I LOVED The Wonderland Cafe! A group of friends and I went there for the first time tonight, and everything we got was amazing! The place was cute and quiet. Everything was perfectly unique in its own way! The staff was so sweet and the drinks were fantastic! 11/10!!!", "pics": null, "resp": {"time": 1531130651706, "text": "Hi Shelby! Thank you so much for stopping by to check us out! I had a great time chatting with y'all! We just added several new items to our menu this past weekend, so please come on in and give them a try! The Caterpillar Split is adorable AND delicious! :D"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "100302988820746427470", "name": "Ashley Danielle Flores", "time": 1544502732925, "rating": 5.0, "text": "Loved it! I took my 3 and 4 year old children there on a Sunday afternoon and they enjoyed every moment. The food was delicious, and the staff was so sweet. They posed for photos with the kids and everything. Only critique would be that I wish the Lunch with Alice event had been more of an actual event like it had been promoted leading up to it, but I understand they’re still evolving and I’m sure themed events will get better over time. They certainly have a regular customer out of me.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "117130068240871444812", "name": "Cat R", "time": 1539553225531, "rating": 5.0, "text": "My boyfriend and I decided to stop by here before we went to run some errands, and since I'd been wanting to try it for a while. I was so nervous but once I stepped inside all of that melted away into excitement! It's such a cute little cafe and the server was so kind and helpful! The meal was delicious and filling, I don't think I'd had such a fun time at a cafe in a while. There were even other children and family's there but it was never to loud and there was always this warm and fun vibe about the place. Perfect for a date as well, an I seriously can't wait to go back!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103956318067676998353", "name": "Kittenblade", "time": 1529874675990, "rating": 5.0, "text": "Great place for a treat! I made my own bubble tea, and the staff made it promptly and ensured I enjoyed my drink too! There was a lot of flavor, and I didn't feel shorted on my yogurt pops either. We had the option to play a variety of classic boardgames, carefully disguised as books, and the theme was wonderful!!!\n\nThey have a happy hour, a kids night, and they've only been open a month!!\n\nI highly suggest dropping into the rabbit hole and trying it for yourself!!", "pics": null, "resp": {"time": 1531131286188, "text": "Aw, thank you Candace! It was so good to have you and you husband stop in and try out our little cafe! Maybe next time you'll bring the kiddo along? I know she'd have a blast with the bubbles!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "108168029583239503459", "name": "Leena Vincenz-Gavin", "time": 1536198691754, "rating": 5.0, "text": "We love Wonderland! Healthy & sweet food options and creatively delicious drinks. Whimsical yet elegant atmosphere and fun for our whole family. Love the kids eat free on Wednesdays. Sweetest owners. Definitely a unique find. We'll be back!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116426470633208123524", "name": "Anna Lombardo", "time": 1528988029485, "rating": 5.0, "text": "This restaurant has to be the most adorable establishment in Mobile. The ambiance is incredible, the food delicious (with huge portion sizes) and the staff very attentive and amiable. Great taste in music! My friend and I have decided to make Sunday lunch a tradition here. Would recommend to everyone.", "pics": null, "resp": {"time": 1531130894890, "text": "Thank you for the lovely feedback, Anna! Did you make it in this past weekend to try out our new menu items? The Sweet Summertime Salad is super yummy, covered in fruits and nuts and feta cheese, then topped with grilled chicken and a delicious strawberry vinaigrette! It definitely makes for an amazing Sunday brunch!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "112450502056009716154", "name": "Ravyn SilverShadow", "time": 1544671765988, "rating": 5.0, "text": "I had a lunch date with my fiance here. I loved the Cheshire drink, and the Bandersnatch was delicious! The atmosphere is calm and cozy, with board games disguised as books and incredible attention to detail. The staff are friendly and quick to provide the best service possible. I will absolutely be back to Wonderland again!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103477708885327618125", "name": "Heather Michelle", "time": 1528834843433, "rating": 5.0, "text": "Honestly one of the most wonderful, quaint places! I love the ambiance, and the staff is truly a treasure. I've met the owners, and they are amazing people. Please make sure to stop in one day and try the amazing tea! You won't be disappointed.", "pics": null, "resp": {"time": 1528835319010, "text": "Thank you Heather! I'm so happy to hear that you enjoyed your visit! We're very proud of our little cafe!  :)"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103477708885327618125", "name": "Heather Michelle", "time": 1528834843433, "rating": 5.0, "text": "Honestly one of the most wonderful, quaint places! I love the ambiance, and the staff is truly a treasure. I've met the owners, and they are amazing people. Please make sure to stop in one day and try the amazing tea! You won't be disappointed.", "pics": null, "resp": {"time": 1528835319010, "text": "Thank you Heather! I'm so happy to hear that you enjoyed your visit! We're very proud of our little cafe!  :)"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116796089376672066262", "name": "Kaitlin Carr", "time": 1532298611915, "rating": 5.0, "text": "I had the daily special, the red queen (red velvet), and my husband had the house tea with milk. Both were extra delicious. We also enjoyed a game of scrabble while we sipped our beverages. The staff was extra attentive. We can't wait to come back and see what kind of concoctions they come up with next.", "pics": null, "resp": {"time": 1535945212882, "text": "Thanks for the kind words! We're happy to hear that you had a great time!!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "113131966221512494691", "name": "Cool Videos", "time": 1546806482465, "rating": 4.0, "text": "I loved this place the service was amazing and the waiter was so patient and nice to us the prices were reasonable a little on the higher side but the food is amazing so it’s worth it now when we went I went with my sister because my parents could never go because the hours are just so short I wanna take my family here because I know they would love it.\nSuggestions: Sunday - Thursday they should close at 5:00 Friday and Saturday maybe at 10:00 please think about these suggestions you would make more money and more families can come out If they get off late thank you for reading sincerely April", "pics": null, "resp": {"time": 1546807891003, "text": "Thanks for the awesome review! Our summer hours include dinner on weekdays and extended weekend hours. We just don't get enough late day traffic to stay open longer during the school year. Extended hours will be back in May!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104587366533229985738", "name": "Lisa Johnston Hancock", "time": 1535938181848, "rating": 5.0, "text": "We had a wonderful experience at The Wonderland Cafe and are already talking about when we can go back. We have a 4 & 2 year old so a sit down meal is difficult wherever we go. It was nice to have a couch area with some toys and activities for the kids to entertain themselves with while we had coffee and lunch and the kids had an amazing dessert. We had several people check on us to see if we needed anything and one of the owners even brought us a free smoothie sample (that was delicious by the way). The food was delicious as well. I definitely recommend this play for its creativity and hip vibe. A great family place thats fun for adults and kids. Mobile needs something like this! We will be going back.", "pics": null, "resp": {"time": 1535944899793, "text": "My husband and I are so happy to hear that you had such an epic experience! Thanks for the super kind review! We'll see you again soon!! ☺️"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104521004451174077369", "name": "cmorgan _", "time": 1543240404780, "rating": 5.0, "text": "I really liked my first visit. I’m fine with the prices, the items given to you are very adorable and fresh along with a fancy atmosphere presented to you. The waitress was nice and well informed of the menu, she even designed the chocolate milk tea to her own personal preference (which was good) and they were even nice enough to remake my friend’s drink to remove the jellies from it (it was a lot of drink too!). It’s a shame there are people out there giving it one star reviews in a vengeful tactic, I’ve managed to read through the reviews the owner responds thoughtfully to each one. It’s possible you may not like some of the portion sizes for the prices but I’m personally the kind of person that can’t go to a steak house and get a plate that has four times what my stomach can handle (and sometimes it’s not possible to take it home). I felt full after leaving, so it works for me. Don’t go out to eat at any restaurant if you aren’t prepared to spend money. This place has good food, the prices aren’t near as steep as I’ve seen some cafes, and they’re well designed. Gonna’ get bubble tea here again during the happy hours when I move back someday.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "107867996135846229104", "name": "Ashley Zehrt", "time": 1528839396511, "rating": 5.0, "text": "Amazing food, creative atmosphere, excellent place to grab a tasty treat, study, or just hang out with friends. Generous portion sizes - and great healthy alternatives, if wanted. The new management has really brought this magical concept to life! In a sea of BBQ joints, it is great to have a place to bring the family to a magical spot.", "pics": null, "resp": {"time": 1528840273540, "text": "Thanks for the love, Ashley! We've worked hard to balance delicious, nutrient loaded entrees and pure dessert whimsy to make a place everyone can enjoy! Even the kids menu has choices like waldorf chicken salad avocados and veggie loaded quesadillas, but also favorites like cinnamon sugar butterfly toast and fruit & whip cream topped waffles with strawberry syrup! Of course, you can't go wrong with our amazing Specialty drink selection! We hope you continue to enjoy our menu for years to come!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "118346125674198208615", "name": "Rachel Strombom", "time": 1528834872967, "rating": 5.0, "text": "So excited about this wonderful place that serves the cutest specialty drinks I've ever seen!!! The owners have put their heart and soul into everything from the whimsical and fun menu to the relaxing ambiance and it shows!! They have created a welcoming space and I highly recommend stopping in for a whimsical treat!!!", "pics": null, "resp": {"time": 1528835784406, "text": "Thank you for your kind words, Rachel! I'm happy to hear that you enjoyed our cozy cafe and fun Alice in Wonderland inspired menu! I don't know if you were able to try it out, but our Strawberries in Wonderland drink is a fantastical delight, topped with cotton candy, cookie sticks, a chocolate covered strawberry, and a cute little Eat Me sign! If you enjoy the fun drinks, you'll love this one!!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "107316626499845338190", "name": "Rox Bano", "time": 1528837070719, "rating": 5.0, "text": "Wonderful family owned cafe. Nice menu and the service was awesome. Thank you guys for everything and for being so sweet. Not sure why there are cruel reviews down there. Doesn’t make sense and not relevant at all to this cafe. I hope everyone who goes here enjoys it as much as I did and ignored those reviews in the beginning. Thank you, Wonderland!! Xoxo", "pics": null, "resp": {"time": 1528838007971, "text": "Thank you, Rox! I'm so happy to hear that you love our cafe! We're trying not to pay attention to the negativity; we know our cafe will speak for itself because we have the best customers ever!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "106716616675812621040", "name": "Gen Ring", "time": 1550205922627, "rating": 5.0, "text": "I went with my boyfriend for Valentine's Date night.  Everything was amazing. Beautiful, decadent, and delicious.  For a truly unique experience & artfully prepared dishes I highly recommend this lil cafe 🐰🖤", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104333380295994816392", "name": "A Allgood", "time": 1528835182711, "rating": 5.0, "text": "Such a fun place to visit! Not sure what the other reviews are about, the staff was more than accommodating and friendly. The menu was very personalized/themed to the restaurant and well worth every penny (which was a fair penny might I add). I enjoyed my experience and will be returning!", "pics": null, "resp": {"time": 1528835407464, "text": "Thanks for the kind words, Ash! I'm so happy to hear that you enjoyed yourself! Your little boy is just too cute! I hope you'll come visit us again when you're next in town!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "102488586520290667199", "name": "Andrew Thigpen (Andrew)", "time": 1548791843240, "rating": 5.0, "text": "Love this place. High quality food with friendly service. Taking my wife there for their valentines dinner!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116779710654066748423", "name": "Mary Shariat", "time": 1529149575038, "rating": 5.0, "text": "Had a wonderful time at this quiet, adorable, quaint place! My friend and u enjoyed our teas while chatting. Perfect cozy place that is needed in Mobile for a fun meeting place for conversation. Will be back!!", "pics": null, "resp": {"time": 1531130543705, "text": "Thank you so much for the kind feedback! I'm so happy to hear that you had a lovely time! I hope you'll visit us again soon; we just released several new menu items this past weekend! Our new Summertime Salad is absolutely delicious!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "106533045246628070674", "name": "Heather Daniels", "time": 1534186328086, "rating": 5.0, "text": "I have eaten there twice and both times the food and drinks were delicious! The staff were super friendly and the atmosphere relaxing. The prices are what you would pay at most locally owned restaurants in town. It is extremely unique Foods in a great place to meet for lunch.", "pics": null, "resp": {"time": 1535945042406, "text": "Thanks for the kind words! We're so happy that you enjoyed yourself!!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "112259678786689674864", "name": "Scarlett Dotson", "time": 1546145518090, "rating": 3.0, "text": "Very pricey, felt really underdressed even in nice clothes. Not a whole lot of selection, and the one drink we got tasted like soda water honestly. Good for some people, not for me. Waitress was awesome though", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115091038900372188521", "name": "F L", "time": 1548387735024, "rating": 5.0, "text": "Went with a friend and loved it! They were even able to cheerfully accommodate my need to eat gluten free. Looking forward to going back.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "109073071595155681031", "name": "Haley O'Bannon", "time": 1529247911366, "rating": 5.0, "text": "Super cute place. The owner was so friendly and took time to speak to my friend and I. The drinks look fantastic and everything is beautifully presented. There’s something here for everyone.", "pics": null, "resp": {"time": 1531130424645, "text": "Aw, thank you Haley! I'm so glad you had a wonderful time and that we had a chance to chat. :) I hope you come back to see us again soon! We just released several new menu items, including a delicious Summertime Salad and a really adorable little banana split called The Caterpillar!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "107659225130037846268", "name": "Kimberly Miller", "time": 1529278051348, "rating": 2.0, "text": "There was only one person working so she was stretched thin, needed another employee to help her.  She wasn't very happy (probably because she was alone trying to juggle everything). While the food was good, wish the cheese and meat platter had been explained a little we did not know what cheese we were eating, we still had to go somewhere afterwards to get something to eat.  The atmosphere is nice and loved the toys for my little one, first place he didn't through a fit in. But for $49 we left still hungry.  Might go back but not for dinner, maybe for a snack.", "pics": null, "resp": {"time": 1531130324219, "text": "Hi Kimberly! I'm sorry you had a less than ideal experience. I spoke to the barista about what happened and she let me know that she sat you right after I had left for the evening. We close early on Sundays so that staff can go home and be with their families for Sunday dinner, and the closing baristas are not supposed to seat guests after 5:45p. The employee who waited on you didn't want you to be disappointed by turning you (or either of the other two tables that showed up right before closing) away, so she sat you without letting you know the policy. Having experienced the stressful situation that followed, she now understands why we don't seat after 5:45p on Sundays. Your review helps to reinforce why the seating policy is in place, and I really appreciate you bringing your experience to my attention.\n\nAs for the cheese plate, I'm sorry it wasn't explained more fully. I do always present it with an explanation of what is being served, but the barista who waited on you had never presented a charcuterie before and was unsure of what to do. Again, I apologize for the confusion!\n\nI'd love to bring you back in sometime when I am on shift, so that I can extend you an apology in person and make sure you have an amazing experience. You can reach out to me any time at Alice@TheWonderlandCafe.com."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "109957079081119938254", "name": "The Legion", "time": 1544222719026, "rating": 1.0, "text": "Terrible service. Just stood at the counter for 3 min without a single person coming out to check or help serve. This was my first time. The dude just stepped out and gave me the peace sign after we started to leave. Health a 85? Shows in their service.\nEdited for owner: Your waitress and cook were talking in the kitchen. She wasnt in the restroom. We made noise. I was even talking to my wife in the main lobby. The cook didn't show no signs of trying to stop us. He didn't seem to care. No wave was given to flag us down just a \"yup\" and a deuce deuce like he didn't care. The waitress didn't try to even come out of the kitchen to give proper work etiquette or formal apology for just chatting and not working the front register.", "pics": null, "resp": {"time": 1544221207812, "text": "Hi Jonathan, it is a weekday afternoon in our small cafe, so we have one server on duty. She didn't greet you immediately because she had stepped back to go use the restroom. The gentleman who peeked out was the cook who had heard the door open. He was trying to flag you down to let you know the server would be right back. I apologize that you had to wait three minutes to be acknowledged, but a one star review berating us for our server needing to use the restroom seems a bit excessive. Next time, perhaps say hello. My crew would have been happy to seat you."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103616815376185704895", "name": "R.C. Scoggins", "time": 1550726486001, "rating": 1.0, "text": "Worst owner any establishment in Mobile has ever had. Owner will start drama. Beg for money. Bother families. Being an owner is having the town talk positively about you. Not continue posting they are a narsasstic thief. Glad that 99% of people I know especially being in the bar business in Mobile do not back this establishment up. Owner should be taken down for negligence and fraud.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115279879834251668304", "name": "Robert", "time": 1533417258128, "rating": 5.0, "text": "Such a cool and cute place! Stopped by with my wife and our friends last night. I had a Jabberwocky, my wife had the Cheshire Cat, and we split some Gryphon Treats! It was all so tasty! The owner and wait staff were very friendly! I'm sure we'll be back again!", "pics": null, "resp": {"time": 1533420891700, "text": "Awww! Thanks for the love, Bobby! I'm so happy y'all had a great time. 😁"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "113553716765409972678", "name": "April Hitchcock", "time": 1528840274365, "rating": 5.0, "text": "After reading all these awesome reviews, I can’t wait to try this cafe!  We love all things Wonderland themed, and it sounds like we will really enjoy it!   Can’t wait to try the tea!!", "pics": null, "resp": {"time": 1528842254444, "text": "Thanks, April! We look forward to introducing you to our amazing menu and whimsical cafe!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "117250528998903771633", "name": "chris chavers", "time": 1544502029344, "rating": 5.0, "text": "Love the atmosphere and the specialty hot chocolate. If you want something different from “chain restaurants” this is a quaint place to get together with friends, especially if you like sweets.❤️", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "118045740458175825402", "name": "Mike & Stephanie Freeman", "time": 1554657121760, "rating": 5.0, "text": "This place has such a cute atmosphere and menu. For anyone looking for a good brunch spot this is the place!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "111814748063538007077", "name": "Maria Mejia", "time": 1529426991553, "rating": 5.0, "text": "Staff was wonderful! Love the aesthetic of the cafe. Felt comfortable and spoiled at the same time! Menu has different options of drinks/beverages.  Reccomend any of the specialty drinks. (Had the Dormouse) Such an amazing idea of having interactive food for the little ones! This place is a must for everyone to try", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "102606351838024124742", "name": "Aiden Clarke", "time": 1528796869822, "rating": 5.0, "text": "Great atmosphere and exceptionally cool menu. They have this chill, quirky Alice in Wonderland thing going on. The wife and I hadn't seen Bubble drinks before, so the staff brought out sample trays and let us try several of the flavors. We ended up getting this crazy specialty drink with tons of cotton candy on top. Very fun, and my daughter had a blast. The charcuterie was phenomenal, the quesadilla was really well done, and my daughter got a kick out of the kids meal we ordered. It's nice to see a well thought out kids menu for a change. If you go in, ask about the fun kids meals. (I think hers was called the Crocodile?) This might be our new favorite spot.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "105604576567357110037", "name": "Missy Dulin", "time": 1542837343648, "rating": 5.0, "text": "Oh. My. Word.  The food and drinks here are amazing.  Y'all... If you haven't gone yet, you need to.  I had a quesadilla and a milkshake... can't remember the name of the drink but it was HUGE and so so good. The owner even brought out samples of their new frozen hot chocolate.  😋  I was in seventh heaven haha.  Highly recommend this place!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMi5MVPu14pL9lwXEnrg-QJ8dVizOBqxYvYtHc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115726320254621792287", "name": "Cassandra MO", "time": 1550787594400, "rating": 5.0, "text": "I just walked into the most authentic, beautiful, yummy, and fragrant restaurant in Mobile. You must go to partake in an experience!!! You will return again ... and again.", "pics": null, "resp": {"time": 1551036458439, "text": "Thank you, Cassandra! It was wonderful having you in today and getting to chat with you for a while! I'm so happy you enjoyed everything!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116624671476696700309", "name": "Jaylyn Hogan-Duncan", "time": 1553798151546, "rating": 4.0, "text": "My favorite drink was the March Hare. Service was great and food was okay. It was a bit pricey seeming that the dishes seem kind of small and take a particular taste to try them but it's a lovely place with outdoor and indoor seating and the bathrooms were clean.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103422917261014138146", "name": "Stephanie Martin", "time": 1550718681952, "rating": 1.0, "text": "After seeing firsthand the type of people this establishment employs, as well as how rude the owner is when receiving any type of criticism is I would never visit. I never heard of the place until they made a go fund me to help keep the business afloat. I thought it was unprofessional, but I guess it worked for advertising bc I planned to take my kids. It seemed like a neat little concept.\n\nAfter seeing social media posts made on the business page by the owner arguing back and forth with several people, and watching comments get deleted from several other posts just bc they gave negative reviews and criticism - I’m glad we didn’t waste the money. And from other reviews, it would have been money wasted.\n\nJust a tip, next time come up with a solid business plan that includes advertising, reasonably priced product, and for the love of god - do not shop at Walmart. It’s amazing you lasted this long 🙄 No. this is not bullying. This is someone that doesn’t like the establishment and is giving an honest review. Get over yourself.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "101930296487029769053", "name": "Malak Thabet", "time": 1528839121726, "rating": 5.0, "text": "Amazing cafe with whimsical treats for the whole family! Such a unique concept! It is great to have healthy options!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115619246026256854320", "name": "Joan Zehrt", "time": 1530820119640, "rating": 5.0, "text": "Had never had bubble tea, so my visit to Wonderland Cafe was an eye opener. Have been back several times to try out different drink and food options.  All delicious!!!  Love the quesadilla - a big plus for me is the plentiful bed of lettuce. Super delish!", "pics": null, "resp": {"time": 1531124438687, "text": "Thanks so much for the kind words! I love introducing people to these fun drinks! If you haven't had the Dreamsicle yet, you should totally try it the next time you're in! It's mandarin orange, non-alcoholic amaretto, cream, and a few other yummy ingredients, and it's based off of one of my favorite lounge cocktails. I was super excited to find a delicious yet non-alcoholic amaretto for this one and it really turned out amazingly well! (I think it might actually be better than the original drink it was based on!) I have a feeling that you'll really dig it! ;)"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104845393980734080516", "name": "Lacey McElderry", "time": 1546221564240, "rating": 5.0, "text": "Loved this place! Very memorable specialized experience! A must try!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "114720064576506069800", "name": "Casey Welborn", "time": 1550581830206, "rating": 1.0, "text": "Food was not worth the price. Went a few months ago and we were very disappointed by the slow service and the quality was not there what we pay for. Tried to tell the owners this and they deleted my review on Facebook. Grow up!", "pics": null, "resp": {"time": 1550594835550, "text": "We have a strict No Bullying policy on our Facebook page and in the cafe. Though we love to get suggestions, ideas, and constructive criticism, we have in the past, and will continue to, remove any and all hostile, disrespectful, vulgar, obscene, or otherwise rude comments aimed at other customers or at the cafe. We will continue to monitor comments and posts, and we absolutely do not apologize for doing so. Folks who are unable to be decent to others do not need to be on our Facebook or in our cafe, and will be removed accordingly."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115672687049967875348", "name": "Matthew Kimble", "time": 1540856556775, "rating": 5.0, "text": "My girlfriend and I went out searching for our old haunt, Boba Time. We were puzzled to find a new cafe where it used to be, so we gave TWC a shot. Yeah, it's a bit on the expensive side, but it's a semi-boutique cafe with unique dishes and drinks. It's not a Starbucks by any stretch of the imagination. For two people, our ticket price was around $35 before the tip. It was unequivocally worth it! I ordered the hummus and vegetable plate, and my girlfriend ordered the chicken stuffed avocados. To drink, we had the Cheshire Cat boba shake. Most lower priced restaurants don't care much for peripherals around the food or anything beyond basic atmosphere/aesthetics, and I would gladly pay to come back here again and again. The decor is great, and our server Madison was kind, knowledgeable, and didn't come to interrupt/check up on us a thousand times as staff at other places often do. It's a great chill spot to grab a tea or coffee and curl up with a good book!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "103793743098361710791", "name": "Candace Anderson", "time": 1552083592554, "rating": 5.0, "text": "Great place for light lunch, bubble tea, brunch, dessert/tea/coffee time, good service . Enjoyed visit!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "112769748978367294680", "name": "Amatullah Mustafa", "time": 1548936401011, "rating": 5.0, "text": "loved my red queen tea party, small quaint restaurant amazing food both visually and in taste, can't wait to return...", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "112497673407880308545", "name": "Tabitha Vance", "time": 1529444849282, "rating": 5.0, "text": "Wonderful service and tasty treats! Definitely worth a stop.", "pics": null, "resp": {"time": 1531131423210, "text": "Thanks, Tabitha! I'm happy to hear that you had a great time! I hope you'll drop in again soon to try out our new menu items! We just released an amazing Sweet Summertime Salad and an adorable Caterpillar (banana) Split!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "107777898807619487692", "name": "Debra Dixon", "time": 1535575616896, "rating": 2.0, "text": "Dont waste your money here. The food, specialty drinks and tea were amazing and waitress was shy but friendly, but shortly after ordering a 34 oz pot of tea for two they closed the cafe. My guest and I continued to try to finish our pot of tea and were kicked out before we could finish our 10 dollar pot of tea we had already paid for because the \"manager\" didnt want anyone in the cafe after 3:30. This made me pretty disappointed.", "pics": null, "resp": {"time": 1535610304472, "text": "Hi Debra! I apologize that  you felt rushed. That is definitely not the experience that my husband and I would like our guests to have at our cafe. We do close at 3p to prepare  for dinner, but customers who are already seated should feel welcome to stay and enjoy the cafe and our offerings. If there  is anything I can do to make up for the rushed service, or if you would like to share the specific details of what was said, please feel free to reach out to me at Alice@thewonderlandcafe.com."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "118171106657488935946", "name": "Shanette Trice", "time": 1555589887253, "rating": 5.0, "text": "This place is a hidden gem! Supper nice staff, accessible owner, and a menu to die for!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "111555564003523459362", "name": "Christopher Lewis", "time": 1528788294765, "rating": 1.0, "text": "Went the other day and could not believe how unprofessional and condescending they were to me. I may not be hipster but come on. Pretentious and overpriced. $12 for a half a quesadilla! Definitely preferred the old Boba concept. Not sure what happened, but it definitely is no longer authentic. Could be new owners, but they are no longer a true bubble tea shop. My drink was far too sweet. Such a shame. I had high hopes for the reskin.", "pics": null, "resp": {"time": 1528793060266, "text": "Hi Christopher. I'm sorry to hear that you had a bad experience! We have only been open for two weeks, so our staff is still learning the recipes. If you ever get a drink you don't like, you can most definitely have it remade! We are still using the same recipes as the previous cafe, so your drink shouldn't taste different than usual. As for cost, our menu prices are set to be similar to other sit-down cafes and restaurants in the area. The previous cafe that was in our location (Boba Time) went out of business due to their too-low prices that were unable to sustain the costs of operating in Mobile. Like other restaurants in the area, we have set prices that will allow us to keep our doors open. I'd be happy to remake your drink for you whenever you next come in, and I'd appreciate any details you could send me about the staff you interacted with. The vibe should definitely be warm and welcoming! I bought Boba Time because I loved it and did not want to see it disappear, and I truly aim to make Wonderland an amazing cafe! You can e-mail me at admin@thewonderlandcafe.com. Thanks for your input. -Jamie"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "113293698370985787595", "name": "Earnest Grainger", "time": 1528825184145, "rating": 1.0, "text": "The staff seem unhappy and bored. I felt very uncomfortable drinking just tea. It seemed like I did not spend enough for their liking.", "pics": null, "resp": {"time": 1528834453085, "text": "Hi Earnest! I apologize for the less than stellar experience. Many of our customers just stop in to sit and have a smoothie or cup of tea, so there is definitely nothing to worry about there! There's no minimum to spend to enjoy the comfort of our cafe, and water is always available if you just want to sit and chat with friends for a bit. We hope you'll give us another try. I can't find your name in our Square customer account list, so please shoot me an e-mail if there's anything I can do to make your next experience more enjoyable! You can reach me at contact@thewonderlandcafe.com."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110408513389932533923", "name": "Ian Massey", "time": 1552094067907, "rating": 5.0, "text": "The services were very generous and the food was amazing", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "109125074463744599198", "name": "Joy Dixon", "time": 1553548857901, "rating": 5.0, "text": "Wonderful food and friendly atmosphere!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110021316489930434608", "name": "Veronica Meola", "time": 1550526425259, "rating": 5.0, "text": "Delicious, fresh food and a lovely atmosphere.", "pics": null, "resp": {"time": 1551036480085, "text": "So happy you enjoyed it! 💖"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "113473761376617777793", "name": "B H", "time": 1541297347566, "rating": 2.0, "text": "tl;dr Go for dessert items and drinks.  Service will be slow.  The decor is nice but I expect more substance over style for these prices.\n\nPros:\n- Lovely interior decor and details (\"painted red\" roses) with a nod to the Alice in Wonderland theme\n- Cozy coffee house feel\n- Dessert items (ice creams, cakes, waffles) tasted great\n\nCons:\n- Food was extremely slow and out of proportion to the difficulty in making the food.  Took an hour for my friend to receive her banana split dessert.  Despite us asking about it we kept being told \"they're working on it.\"  It's a banana split dessert.  What exactly is there to \"work on\"?\n- Quesadillas underfilled; not much besides cheese (supposed to have steak, peppers, etc)\n- Waitress seemed extremely uncomfortable in her role; she kept making comments about our party as if we were inconveniencing her at her job.  She had a hard time separating our checks despite our party offering to walk up to the register to help her.\n- Our table was served food slower compared to tables that arrived 15-20 mins after us.\n\nHonestly I wish the food and service (both very subpar aside from desserts) matched the emphasis on decor.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110186651824387153462", "name": "Veronica Thornhill", "time": 1528841332257, "rating": 1.0, "text": "The staff did not seem nearly as trained as the previous Boba Time staff was. To say I was disappointed is a total understatement. The menu is seriously overpriced as well.", "pics": null, "resp": {"time": 1528842003751, "text": "Hi Veronica! Thanks for the feedback! We've only been open for two weeks, so our staff is still learning. Always feel free to ask them to remake anything you don't love! We've set our prices to match the other surrounding sit-down cafes and restaurants so that we can continue to bring our customers an amazing experience. For those who want some cheap eats and more of a snack-shop experience, we have $4 Happy Hour Create-Your-Own drinks every Monday through Friday from 3-5p that even come with free, fresh-popped popcorn, as well as a couple Happy Hour Entrees that fit into a tighter budget. We hope you'll give us a chance to prove our epicness!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116503927605462445852", "name": "Gen Mcginnis", "time": 1544138834375, "rating": 5.0, "text": "Great menu, love the milk tea, great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "105481596742473509469", "name": "Ken Knight", "time": 1528832384269, "rating": 1.0, "text": "This place should be shut down. It's got to be the most overpriced  place in Mobile. Not to mention the quality .. it's so bad it's laughable! 😡 it doesn't even deserve the 1 star I gave .", "pics": null, "resp": {"time": 1528834038297, "text": "Hi Ken! f you're looking for cheaper eats, please feel free to stop in during our Happy Hour! It's from Monday to Friday from 3-5p and included $4 Create-Your-Own smoothies, frozen coffees, and much more, plus discounted entrees!  If ever you receive a drink or meal you don't like, please just let your server or barista know. We're happy to remake it or help you find something else that you like more."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "116525236136936758271", "name": "Emmy Johnston", "time": 1528850372927, "rating": 5.0, "text": "I used to frequent this location when it was Boba Time and stopped going because the drinks were too sweet. I visited the Wonderland Cafe for the first time last week and they were very acommodating, allowing me to taste the house milk tea and then specially making me a half plain black tea / half House milk tea to make the perfect boba! Nice staff.", "pics": null, "resp": {"time": 1528858489759, "text": "Hi Emmy! I'm so glad you had a great time! I like to cut my tea half and half as well! (Though I admit, I do put a little Stevia in afterwards!) I hope you'll come back to see us again soon!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110227595629994788646", "name": "Soulless Ginger", "time": 1556227596154, "rating": 1.0, "text": "We tried it out for the first time today and we had an amazing experience! The staff was very friendly and the food was delicious!! Plus the entire place was so cute. Highly recommend!!\n\n*UPDATE* After supporting the buissness, which I now regret, I feel the need to edit my review. The management here is obviously ba big contribute to the restaurant failing. I have to see y'all fail, but the drama via their social media and while dinning at the buisness itself is what pushed my friends and I away to spend our money elsewhere. Wishing ya'll the best of luck tho. The concept was a good idea.", "pics": null, "resp": {"time": 1528858391810, "text": "Thank you so much for the kind words! I love that you had such a wonderful time! We're working very hard to make our cafe the most whimsical and lovely little restaurant in town! Thank you for noticing!!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104636555727661356531", "name": "Ashley Williams", "time": 1528836722169, "rating": 5.0, "text": "Lovely place. Can definitely expect more visits from me!!!", "pics": null, "resp": {"time": 1528837958479, "text": "Thanks, Cinna! We aim to make every visit amazing! :D"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "101545421565665473872", "name": "DeParis Shaw", "time": 1528860640052, "rating": 5.0, "text": "This place is such a wonderful spot for me to relax on the weekend after a stressful week at work. The staff are amazing and the boba drinks are delicious. My favourite is the Taro smoothie with Tapioca pearls . i see nothing but continuous growth at this local business. Y'all try the Unbirthday cake and the Armadilla too those are Deeeeeeeelish! Please support Local business in the Port City.", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115582802761634809499", "name": "Samantha Larson", "time": 1528827826796, "rating": 1.0, "text": "I was so pumped to go here...I left rather disappointed. The staff seemed nice enough I guess, but it seemed like a giant gimmick store. Not sure what the angle was but I can not afford the steep prices. I left and went to the other milk tea bar.", "pics": null, "resp": {"time": 1528833790080, "text": "Hi Samantha! Our prices are set to be the same as the other sit-down cafes and restaurants in the surrounding area. It is a bit different than the previous bubble tea place since we are now a full cafe and not just a snack shop. If you're looking for cheaper eats, please feel free to stop in during our Happy Hour! It's from Monday to Friday from 3-5p and included $4 Create-Your-Own bubble smoothies, delicious frozen coffees, and much more- plus we have discounted entrees during that time! If ever you receive a drink or meal you don't like, please just let your server or barista know. We're happy to remake it or help you find something else that you like more!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "115590685850347105680", "name": "Page Ellis", "time": 1532739161929, "rating": 5.0, "text": "Wonderful service, kid friendly and the queens cheese board was fantastic!", "pics": null, "resp": {"time": 1532766622169, "text": "Thank you, Page! It's always lovely to see you! You and your family are so sweet!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "113793916050324139486", "name": "Oliver Karcher", "time": 1528919633216, "rating": 5.0, "text": "As a person who loved Boba Time when it was Boba Time and loved Wonderland Cafe when he fell down the rabbit hole, I have no complaints here. The bubble tea is so good it makes you feel as mad as a hatter. I really and truly enjoyed every minute of being there and didn't feel a pretentious vibe from you guys at all like I do when I go to other boba shops in town. (not gonna name any names but hehe there are only two boba shops in town so it's no secret who I'm talking about) Anyway, no tea no shade. The baristas/servers were cute too. All around 10/10 would fall down the rabbit hole and WILL fall down the rabbit hole again.", "pics": null, "resp": {"time": 1531131111594, "text": "Yay! I'm so happy that you're enjoying the new vibe! I feel quite mad as a hatter most days, so you're in fine company! Thank you so much for saying such nice things about the staff! We're working very hard to create a whimsical world where everyone feels warm and welcome. If there's ever anything we can do to make your visit even more magical, never hesitate to ask! Stay Curious! -J"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "104594793874088994234", "name": "Robert Stanley", "time": 1531114586939, "rating": 1.0, "text": "A huge expensive gimmick. You'll leave hungry and your wallet will be lighter. The claim that your prices are comparable to the area is false. Compared to whom? Starbucks? I can go get better (the best) coffe in Mobile at Carpe Diem and pay  much less.\n\nIts geared for younger millenials still in college so I suppose prices arent that important.\n\n(No this review is not an attempt to sabotage their business).", "pics": null, "resp": {"time": 1531124000738, "text": "Hi Robert. I'm sorry to hear that you had a less than ideal experience. I hope you'll reach out to me and let me know what confused you about our restaurant and which meal left you hungry. We do try to keep our portion sizes to a reasonable caloric range that is both filling and healthy, but sometimes we miss the mark. My e-mail is Alice@TheWonderlandCafe.com if you'd like to reach out!\n\nTo address your other comments, yes!, you are correct that our restaurant is geared towards millennials. MIllenials are the generation born between 1980 and 1996, so those between the ages of 21 and 38. That is the generation that my husband and I belong to. There are many restaurants in town aimed at other generations, but as our generation heads towards our 40's you're likely to see many more Millennial-owned establishments springing up. As is the norm in our generation, we do aim to bring a fun, hip, and distinct vibe that you can't find elsewhere in town. If this isn't your thing, we totally understand! Not everyone is going to be feeling the vibe. ;)\n\nAs for the coffee, I will happily concede that if it's a standard cup of hot coffee that you're after, you're definitely better off going to an actual coffee shop, which we are not. I've been going to Carpe Diem and Satori for well over 15 years now, and agree that they're great! Wonderland is a brand new eclectic eatery and Bubble Cafe. We've only been open about a month and a half now! Bubble drinks are definitely a 'millennial thing' and very new to the Mobile Bay Area, but I fell in love with them when I travelled out of state for college in the early 2000's, and I'm thrilled to be able to offer this delicious treat to my home town.\n\nIf the Bubble Cafe part is what was confusing, I can understand that! We've done our best to break down the menu as clearly as possible, but being introduced to an entirely new-to-the-area food concept can put one a bit out of sorts, hence the idea of slipping into Wonderland. Some people find this fun, but I can understand that not everyone is about trying new things on a leap of faith. I hope that if you return, you'll ask your server for some samples and pointers. Bubble samples are always free to newcomers and are helpful if you want to learn about this unique beverage! If you're feeling less adventurous, all of our specialty drinks are pretty much calibrated for complete epicness, so they're an easy place to start- but they're likely not what you're looking for if you're just after a basic cup of joe."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "106417372735444765628", "name": "Dawn Marie", "time": 1550692081340, "rating": 1.0, "text": "There is black mold hidden in the walls!\nDO NOT TAKE YOUR CHILDREN THERE!\n\nBe careful leaving negative reviews, the owner has started coming to peoples homes and yelling, cussing, threatening, ect.", "pics": null, "resp": {"time": 1550700617464, "text": "Since this keeps circulation, I will address it here. There is absolutely no mold in the walls. A few days before we took over the lease of the unit, we saw that there was bubbling in the paint on the walls. My husband peeled back the paint and we found a significant amount of mildew through the wall and down into the baseboard, caused by a leak at the neighboring business. We notified the landlord immediately that we could not take over the lease if the issue was not addressed. We took many pictures to document the situation, and sent them to the landlord. The following Monday, the contractor came in, fully sealed of the effected area in tapping with a fan to dry the wall, then removed the entire bottom half of the front west wall from the floor to six feet up. This removed the mildewed area, as well as the two feet above it. The inside of the wall was removed, and affected boards and insulation replaced, with mold block being sprayed in throughout the repair. New drywall was installed, primed, and repainted. I realize that the pictures I took for the landlord to show the original damage are circulating on Facebook, but please take two minutes to think about why they exist. Do you honestly believe that my husband and I ripped a wall partially down, documented the damage, and then paid to have a secretly damaged wall rebuilt? Doesn't it make way, way more sense that we took the pictures to document an issue that needed to be fixed in order to have the matter addressed and remedied by the landlord? Seriously, why else would we have taken so many pictures documenting the damage?\n\nAs far as you saying that I'm showing up at people's houses cursing and screaming, this is also completely falseYes, we have a past employee who was let go of last October and who continues to slandering the business the internet over. Her mother, who she lives with, lives down the street from me. Since this young woman cannot be reasoned with, and has continued to slander me, my family, my employees, and my cafe, I did in fact go over to speak with her mother, who is my neighbor, calmly and matter of factly explaining (mother to mother, neighbor to neighbor) that if her daughter does not stop posting untrue information attempting to ruin my business, I will be filing a lawsuit. I wanted to give her a chance to speak with her daughter about honestly and most definitely how not to react to being let go of by an employer.\n\nThe fact that you have written this  review, believing the absolutely bizarre things this young woman had said about me and my cafe, only further proves her guilt in what is fast approaching a lawsuit, should this harassment continue. Speaking the truth about a business is legal, spreading lies that damage a business's reputation and cause damage to the business is absolutely not. I would appreciate it if you would remove your slanderous review."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "101578391090180444454", "name": "Ashley Holmquist", "time": 1528834785783, "rating": 1.0, "text": "I had the privilege of attending the grand opening. When I first arrived the two staff members looked mortified that someone had walked into their restaurant so I waited outside. The owner later showed up with her toddler in tow. Her child was running all over the restaurant and screaming while jumping on a couch and throwing pillows. The table that was sitting behind them were seriously confused and kept making comments about it. Her daughter even came up to my table and started trying to mess with my daughter who I had brought with me. I was super excited because this seemed like a great idea for a restaurant but it's poorly managed and poorly executed. Small children have no business running around a restaurant establishment and touching things and bothering customers. The menu is overpriced and they think it makes a qusadilla fancy by putting it on top of arugula...which is pointless. Also, it needs more seasoning. The only good thing I can say at this point is the unbirthday cake was actually really good...so there's that. I would say venture at your\nown risk.\n\nEdit - I have since returned since opening night -even after your manager quit - and I contacted the health department after watching your child touch someone's food. My review has nothing to do with you stealing your employees tips, as I left that out. My review is based purely on my two experiences in your establishment. It's so disappointing because I had such high hopes for this place. Oh, I was like 5 minutes early and you were 20 minutes late. So there's that too. 🤗 Best of luck with your business venture.", "pics": null, "resp": {"time": 1528832615530, "text": "Hi Ashley, you were given a special spot at the free pre-opening event and let in early because you were good friends with a with one of the managers and you said you didn't mind it being a little while as we got ready. That manager then quit during our first day open and has been asking all of her friends to write one-star reviews now that we finally have our business page up on Google. I don't understand why she is so keen on ripping down a small family business and slandering my family to anyone that will listen, but it is what it is. You seemed like a really cool person with a great kid. I'm sure you'll leave this review up, but it is what it is. Hopefully, we'll start getting reviews from actual customers in the coming days. Take care."}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "110019249349110193685", "name": "Ginger Holt", "time": 1528979735672, "rating": 5.0, "text": "So very good, drinks, snacks, service, yum!!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "109472760128910590990", "name": "Amber Johnson", "time": 1544762724634, "rating": 5.0, "text": "Absolutely charming and the staff are wonderful!", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "100353882927820030038", "name": "Sheila Osborne", "time": 1562801266727, "rating": 5.0, "text": "Great Sweet Crêpes", "pics": null, "resp": null, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
{"user_id": "111894355925630733763", "name": "K D", "time": 1530529919289, "rating": 3.0, "text": "Good. Clever menu item names, but, overpriced IMO.  $9.50 for a non alcoholic drink?", "pics": null, "resp": {"time": 1531129382301, "text": "Hi Kiki! Thanks for the feedback! Our basic beverages (iced tea, lemonade, etc) are $2.95 with free refills. Our standard create-your-own bubble smoothies and frozen coffees are $5 and come with your choice of two flavors and a topping. If you want to go crazy then, yes, we do have $10 specialty drinks, and you definitely get what you pay for! Sure, a large 24-ounce salted-caramel mocha frozen coffee with boba pearls is going to run you $6.25- but the price to make it a specialty drink really pays of. For the extra few bucks you spend, you get mocha chips in your beverage, a huge pile of whip cream on top, twice as much boba, high quality ghirardelli salted caramel mini chips, cookie sticks, brownie brittle, chocolate chunks, AND ghirardelli caramel syrup. It's like adding an entire dessert to the top of your drink.\n\nPS: We do hope to get our liquor license in the future. A Wonderland After Dark event here and there sounds like fun to us!"}, "gmap_id": "0x889bb393b79e14f9:0x4b36df30e0221a91"}
