{"user_id": "102285025872117436620", "name": "Amy Adkins", "time": 1498498385959, "rating": 5.0, "text": "Scott Jones d/b/a Jones is Thirsty is fantastic and knowledgeable of extremely good wines at very reasonable prices.  He has worked our annual fundraiser for United Way of Alabama for the past two years.  I would highly recommend Scott Jones for a private wine tasting at your home with guests, or a large fundraiser.   We have always had a good turnout, with money left to donate!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNENbHzILXeUgwwStYNji6_OdNDax20q7AOKf71=w150-h150-k-no-p"]}], "resp": {"time": 1498567267698, "text": "Thanks, Amy! I appreciate the kind words...and for the opportunity to partner with awesome organizations like United Way of Alabama to do my part in giving back to the Birmingham community."}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "116722354746811582342", "name": "Sally French", "time": 1531493976373, "rating": 5.0, "text": "I went to one of Scott's classes this week and he did an exceptional job! The class was very fun and informative. The no-snobbery education made a comfortable atmosphere for discussion and questions. I was pleased to find all of the wines we tasted at my grocery store without any issue and they were all within my price range! I would definitely recommend one of Scott's classes to anyone wanting a fun and laid-back wine tasting experience!", "pics": null, "resp": {"time": 1531494802023, "text": "So glad to hear you enjoyed the education/tasting session! I appreciate the kind words and good thoughts."}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "106142074257908578623", "name": "Marilyn Lindsey", "time": 1498490193739, "rating": 5.0, "text": "I have participated in two different wine tasting events with Scott - one with friends and one with co-workers at a holiday party.  Both events have been absolutely AWESOME.  Scott shares his immeasurable knowledge of the wines during the tasting and it takes the whole experience to another level.  Highly Recommend!!!", "pics": null, "resp": {"time": 1498567190456, "text": "Thanks, Marilyn! I appreciate the kind words!"}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "111966465672028454461", "name": "Brent Fuhrman", "time": 1498308229729, "rating": 5.0, "text": "His wine knowledge is impressive but his ability to translate that knowledge is what sets him apart!", "pics": null, "resp": {"time": 1498317076838, "text": "Thanks for the kind words and good thoughts, Brent! Working hard to spread the No-Snobbery doctrine in Birmingham and Nashville!"}, "gmap_id": "0x88892002f8e732c5:0x4856935cfa0d7eef"}
{"user_id": "114481091531893131517", "name": "Darren Ice", "time": 1582346212372, "rating": 5.0, "text": "The cooking classes are a great date night; culinary education mixed with amazing food and knowledgeable people.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5om-8jm11UEub8PCUUkFovxf4QSKdcde5h4w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNAUmAnUPPsIkyPXTJBh1PrPLEpViNE_joZbPU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZ8WRul5SWPcP82eNhIH8OkzO6a4JrYeKdlFw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkpUAMvUAQ2Sg4FW4DT-6OtQuvad7oO8RYvFU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "110371737344884996340", "name": "Lelia Wissert", "time": 1582565715725, "rating": 4.0, "text": "My daughter and I took a class, Celebration of New Orleans. It was fun, Chef Steven was great and his helper was too. The facilities were really nice. We made gumbo, shrimp and grits and bananas foster. My disappointment was the tomatoes in the gumbo, it turned the gumbo into a creole dish. Corporate needs to let the Chef’s cook dishes that are regional and not from some far away place.  We lived in Louisiana for many years and never had gumbo that was red.  Be sure to try a class!!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "117361591650432770601", "name": "Vicki Yackel", "time": 1590714164481, "rating": 5.0, "text": "Absolutely love this store, their products and the staff!  Chef Tenita is awesome!  Can't wait until classes begin again!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "110264065072084241647", "name": "O P", "time": 1597279100905, "rating": 5.0, "text": "Expert and honest opinion, going out of sale get it while you can.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "105970757067103209668", "name": "Rosalind Lewis", "time": 1590702917657, "rating": 4.0, "text": "I was able to enter freely and see a 'cook's dream' and all I could do was add the cost and try to place in my budget to return for purchases.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "110207220062043295661", "name": "Brittany Ward", "time": 1579102782092, "rating": 3.0, "text": "Recently took a class here, and it was way too crowded - 14 people plus 3 chefs. Their kitchen is not big enough to accommodate that many people to have a comfortable experience. It was 4 people to a 3 person station. For the price of $70+ per person, you would expect more and more hands-on. Overall, the chefs were great. Really hate they are limited to a set, very basic recipe from corporate. Also, their stove wasn’t working properly. All groups were cooking at different temps for different amounts of time, which messed up some people’s food.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "118059759926802992691", "name": "Nicholas Blackstock", "time": 1498049790561, "rating": 4.0, "text": "This store is pretty cool. It's like Bed Bath & Beyond, but just the Beyond part and on steroids at that! All things kitchen can pretty much be found here. Depending on what you're used to, you might consider it on the pricey side, but that comes along with the quality/brands they sell here. I've walked through this store and seen items I literally had no clue existed. Staff has been completely friendly and helpful in my experience. Especially with the nice array of FANCY coffee machines that will gladly dispense samples for you.\n\nAlso, toward the back of the store they have a kitchen setup for group cooking classes. Again, imo on the pricey side but check the website because they sometimes have sales! The class we attended was nothing short of spectacular! The teacher was great, the format of cooking in teams worked well and ALL of the food we prepared in this particular class was amazing! So happy that we got to bring the recipes home to try them out on our own (and maybe add our own spin to things)!\n\nCome check the store out for yourself, even if just to simply window shop!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "105905580112857686944", "name": "Cyrus Patel", "time": 1562542620303, "rating": 5.0, "text": "I think everyone who is into cooking should do a cooking class here. My girlfriend and I have done two. One with Chef Rodney (scallops, rice, salad, and a souffles) and one with Chef Steven (salmon, mashed potatoes, salad, and a creme brulee). Both times we had so much fun. They are expensive but totally worth it. We will definitely be doing more cooking classes.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "109266245816607281040", "name": "Bonnie Philips", "time": 1491008446547, "rating": 5.0, "text": "SHOCKED AND SADDENED by the other reviews! :(\nI have always had amazing experiences in this store. The employees are helpful, efficient, and care about the costumers and the merchandise. I love their selection especially the Pearl dinnerware collection, which the staff helped me piece together throughout the years as the collection grew. Grateful to have this Sur la Table in Birmingham!!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "109464309515501726339", "name": "Scott Whitlock", "time": 1517991036246, "rating": 5.0, "text": "I love this store! It is a foodie paradise. Although pricey, it is somehow not as pretentious as Williams-Sonoma. The staff is always friendly, and I could spend hours here just browsing.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "107473305844072902504", "name": "David Petry", "time": 1563564199103, "rating": 5.0, "text": "My cooking class was great it was fun and it helped me become a better chef.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "108389291477513439513", "name": "Ken Davenport", "time": 1544494409483, "rating": 5.0, "text": "Chef Tyler is amazing. Me and my daughter had the best time", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "108714737956968439456", "name": "Chrissi Burrell", "time": 1530635161122, "rating": 4.0, "text": "Love the unique selection of kitchen gear and the cooking classes, the staff on the other hand, not so lovely. Victoria and Marilyn's review on the staff is pretty accurate.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "102596166594644062574", "name": "Correy Miller", "time": 1500816993277, "rating": 5.0, "text": "I have nothing but great things to say about this store, the product selection, and the staff. This is truly a cook's store. I would also highly recommend taking a cooking class with Chef Nadia!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "111773357693952643618", "name": "Victoria Mass", "time": 1491407337547, "rating": 1.0, "text": "Terrrrrrrible. The customer service is a joke. Absolutely rude. I literally saw an employee give a customer the finger. That is SUCH poor taste. To have that kind of person working with customers is flabbergasting. How immature and childish. Particularly these two women kathy and christy. The store's environment would be great but these two drag it down with their rudeness and disrespect. Don't ask a question because they will just roll their eyes and give you a plate of sarcasm. Customer service doesn't mean a thing in this establishment. Too bad for Sur La Table...they make your business look bad.", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "107903129565900055211", "name": "Guy Whiddon", "time": 1534399558303, "rating": 5.0, "text": "Great classes! Love Date Night with my wife!!!", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
{"user_id": "104038932801695145650", "name": "Mrs C", "time": 1544127192994, "rating": 5.0, "text": "Unique kitchen items", "pics": null, "resp": null, "gmap_id": "0x88891eb847f706b5:0xf46893ac2b7f056d"}
