{"user_id": "116429372261267771140", "name": "AMERICA CHANGING", "time": 1623517793175, "rating": 5.0, "text": "This company has always been a go to for cleaning needs  residential,  and commercial. Best prices for this area by far.\n\nThe employees care about and take pride in their craft. The skill set and dedication they use on every job compares to none. God bless !\n\nManagement will always work with customers on just about any job that they need completed, even on short notice.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "117442105613568298197", "name": "Avery Berry", "time": 1624052497756, "rating": 5.0, "text": "Tim and his team are quick, responsive, and very professional. The cleaning of our Persian rug was affordable and the end result exceeded our expectations! Give Color Clean a call!!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "111286944870289120139", "name": "Harsh Deep", "time": 1605195227840, "rating": 5.0, "text": "Tim and his team did wonderful job.  I heard a  \"oh wow\" from my wife and the carpet looked new. I would highly recommend them to anyone. they show up on time do a great job and Tim calls a few days later and makes sure you were happy. that is high quality professionalism.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "101632670236800593092", "name": "heather ross", "time": 1599673002374, "rating": 5.0, "text": "These guys did an AMAZING job! They lifted what furniture they could and got underneath. Very thorough! Other places I have used have not done that. I have a puppy who has had many accidents and it already smells better. I also had a few stains that are completely gone now. They were very friendly and professional. I will 100% use them again. The price was great too. Very satisfied with everything regarding the service and the outcome.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "106936848834138953552", "name": "BeverlyRollins Tyus", "time": 1599002292274, "rating": 5.0, "text": "Excellent the worker did a miracle with my father bed room. Sometimes my dad have accident on his carpet.  I really was ashamed to let someone clean my dad carpet,but I didn't have a choice.\nThanks again for doing a. Excellent job again on my carpet in my dad room. Please if anyone looking for someone to clean there carpet . This is a carpet cleaner company who is Excellent.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "112386203193160859168", "name": "Tom Nazzal", "time": 1601413115870, "rating": 5.0, "text": "Thank you guys so much it’s very good job the carpet bank brand new I love this Company", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "101829201486310805532", "name": "Ronnie's Toy", "time": 1629912801356, "rating": 4.0, "text": "Was pleased with job", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "115814401402878176057", "name": "Elizabeth Tripp", "time": 1594661000984, "rating": 5.0, "text": "Tim was professional and he & his team did a great job on our carpets. We appreciated that there were no \"hidden gimmicks\". We would highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "107213755420667044962", "name": "Margaret Huggins", "time": 1580506965692, "rating": 5.0, "text": "I couldn’t be more pleased with the amazing results on my travertine floors! They cleaned the grout and went the extra mile. The floors look brand new! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "103442510115057575136", "name": "Will Walker", "time": 1513772140129, "rating": 5.0, "text": "Tim and his team did a tremendous job for us ...cleaning 5 yrs of grime off a kitchen tile floor.  The guys who did the work were professional, courteous, and efficient...please pass my thanks along to them. Thanks so much for a great experience.  I’ll recommend Colorclean to friends who need your services.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "108028177057941063913", "name": "Kelly Hipp", "time": 1524328209199, "rating": 5.0, "text": "I’ve been using Tim and his team for years and would never use anyone else! Last week they cleaned my brick floors and it looks incredible!! The guys are professional, friendly, and do the most amazing work! They can clean anything and make it look better than new. Thank you Colorclean for another amazing job!!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "100185915162051668825", "name": "Susan Curvin", "time": 1490486367072, "rating": 5.0, "text": "These guys cleaned two area rugs that my cat had \"marked\" as hers.... No more smell and the rugs look great! Highly recommend these professionals. Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "107696391325802110195", "name": "Jeremy Flatt", "time": 1331190117894, "rating": 5.0, "text": "Cleaned my MATTRESS!  We had so kids mattress's that had through years of potty training and needed some DEEP Cleaning.  I was thoroughly impressed that all stains were remove and it seems cleaners then when we first bought them!   GREAT Job! Highly Recommended!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110429488499564898034", "name": "Angela Pritchett", "time": 1444323449721, "rating": 5.0, "text": "My area rug had a strong odor and I called a carpet cleaner to come clean it.  I was told  that the strong smell was just the wool itself. I had it cleaned anyway but the strong odor continued.   This time I called Colorclean and I can not believe they got the strong smell out of my rug.  I would recommend Colorclean to  anyone!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "102405756617049813206", "name": "Maggie Williams", "time": 1481906647803, "rating": 5.0, "text": "I love color clean.. The team cleaned up to 5 of my rooms and they had done a wonderful spotless job.... Thanks guys", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "104915578567577841431", "name": "steven wyatt", "time": 1599072438972, "rating": 5.0, "text": "Best service ever carpet was bad made it look new again would recommend an will have come back for more", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "117335776038636322912", "name": "Yoga Gem LLC", "time": 1515769136906, "rating": 5.0, "text": "Wow!  What a difference this service can make to the look of your place.  The carpet was so stained I really did not think it could be saved.  Colorclean worked their magic and in a couple of hours the carpet looked great.  Reasonable price, and they showed up when they said they would.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113784790187107991278", "name": "Russell Taylor", "time": 1346259459433, "rating": 5.0, "text": "Truly awesome. No words to express my pleasure, when I walk on my shiny new cleaned carpet. It is soo soft and smells sweet. I know what am I bringing you to clean next- all my mattresses. Can't imagine what will be the feeling when I lay on them.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "107502667799377724763", "name": "Rendell Smith", "time": 1497541672795, "rating": 5.0, "text": "Family owned with lots of experience and trustworthiness. Tim and his son did an awesome job, can't beat the price! I would recxomend to ANYONE and will definitely consult his business in the future! Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110133068636524106091", "name": "Janine Roeder", "time": 1358842610850, "rating": 5.0, "text": "I would definitely recommend this company to anyone who needs carpet cleaning services. They came they did their job and my house looks great!! Thanks again for the awesome job!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "109399571462069407613", "name": "Jack Osgoode", "time": 1472741324218, "rating": 5.0, "text": "Tim cleaned my 2003 Ford F-150 super cab  he did the seats and wow! Looks and smells great now extremely pleased. Tim was very professional and took me in so fast really surprising.Look forward to another visit soon before I sell it.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "101772151225026697576", "name": "Randy Jones", "time": 1331236183540, "rating": 5.0, "text": "Excellent experience. The techs were friendly and did a wonderful job. They are the only floor care company for me.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110872642443757453630", "name": "Stephen Forte", "time": 1331045106571, "rating": 5.0, "text": "ColorClean cleaned our carpet at our office and was prompt and on time. They even gave us a bottle of carpet cleaner in case we have any incidents. Very professional and knowledgeable of everything carpet.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "112919958669817687550", "name": "Larissa Evernet", "time": 1514327466700, "rating": 5.0, "text": "Colorclean Complete Floor Care did an excellent job cleaning our carpet and especially the stairs. I highly recommend this cleaning company.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "111968071114027137699", "name": "Megan Tucker", "time": 1492770976983, "rating": 5.0, "text": "Thank you Colorclean for the 5 star service! My four carpets are looking fantastic and it's all because of you!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113951701904935207987", "name": "John Havard", "time": 1513886557870, "rating": 5.0, "text": "These folks did a great job cleaning our carpet. Fast, thorough, and priced well.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "112324043148064106505", "name": "Patrick Davidson", "time": 1347016945888, "rating": 5.0, "text": "God bless you and your employees. Best rug cleaners I've seen in years.", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "117297619160754220204", "name": "Brian Johnson", "time": 1469132112940, "rating": 5.0, "text": "Tim and his team were provided excellent, quick service.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "108169735602713845549", "name": "Andrew L. Cogburn", "time": 1498767885423, "rating": 5.0, "text": "Colorclean are doing the carpet cleaning at my house for over an year. They are professional, dependable, more than affordable and I definitely recommend their services to anyone who needs clean carpets at home!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "111791057317532065598", "name": "Chris Brunson", "time": 1458662498550, "rating": 5.0, "text": "Had my whole house cleaned and King Matress Cleaned as well. Very Professional and Highly Recommend", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113268841348329204958", "name": "Evelyn Cotton", "time": 1518478203862, "rating": 5.0, "text": "Since we use Colorclean Complete Floor Care we have no problems with the dirt and stains on our carpets and upholstery. They turned out to be very professional crew. Thanks a lot!", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "110565960869331847070", "name": "Frances Griffin", "time": 1591871324997, "rating": 4.0, "text": "They have reasonable prices", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "116199467977539803996", "name": "Daniel Hadden", "time": 1496330192409, "rating": 5.0, "text": "Good work", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "108239992083094603721", "name": "gift mwanyalo", "time": 1571351798241, "rating": 5.0, "text": "Prompt response", "pics": null, "resp": null, "gmap_id": "0x888c2ac6bf60d933:0x59f0c95ebdcd97e0"}
{"user_id": "113499866941115887302", "name": "Dan", "time": 1624139672793, "rating": 1.0, "text": "I had a car with damage to the front seat and attempted to get an estimate.  Called several times a week for about two weeks with no answer.  The wife finally decided to drive down to the shop to see if we could get find some info in person.  She ended up waiting around for quite a while before someone finally got to her, and the staff seemed rather annoyed that they had to take time out to talk to a customer.  They finally sent someone to look at the car, took some pictures, and told her they would get back to us in a couple days with an estimate.  He was pleasant and professional. That was 24 May. A couple weeks went by and nothing... tried calling multiple times and got no answer.  When someone finally answered, she was extremely unprofessional and quite rude.  We told her our situation, and asked the status of our estimate; she said the one who helped us was new, and that there was no way they were going to get back to us that fast, said it was going to be a while, but couldn't give us any sort of expected response time.  She was snappy, extremely rude, and pretty unprofessional.  19 June and still no response... pretty sure we're headed to Norm's out in Gurley.", "pics": null, "resp": {"time": 1625055326861, "text": "Hi. Totally apologize. I’m a one man team and I’m overloaded with emails and work. Please send me pictures I will send a quote. 2564680377"}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "104245720813593919173", "name": "Tariq", "time": 1618537842715, "rating": 1.0, "text": "These people asked me to send pictures of the job that I needed done, and never called me back with quote. They made me waste my time. I didn't appreciate it. Especially since I asked a lot of questions, and their answers were different than their actions. Good luck with these people!", "pics": null, "resp": {"time": 1625055300439, "text": "Hi. Totally apologize. I’m a one man team and I’m overloaded with emails and work. Please send me pictures I will send a quote. 2564680377"}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "101472191700801432954", "name": "Chris Fisher", "time": 1625054070830, "rating": 1.0, "text": "They never would call me back for a estimate, I'm not going to beg these people to do business with me.", "pics": null, "resp": {"time": 1625055286215, "text": "Hi. Totally apologize. I’m a one man team and I’m overloaded with emails and work. Please send me pictures I will send a quote. 2564680377"}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "117939616528887178968", "name": "John Bryson", "time": 1617892391721, "rating": 1.0, "text": "They were so unprofessional about communicatng on the job I asked them if they could do.  If you asked to speak to manager he is aways out or in abouy to go out.  Very poor service, they wasted so many days with my bed cover to tell me they could not fix, it made me miss an appointment with another place that wanted to try and fix it", "pics": null, "resp": {"time": 1617921178146, "text": "Mr. Bryson,\nI sincerely apologize for any inconvenience we may have caused. I assure you we have tried our best day in and day out to find another company who could trim down your bed cover since we weren’t able to however we were unable to locate anyone within a 100 mile radius who could get the job done. I’m sorry it had to come to this but hopefully if you cannot get a refund you can find someone with that particular expertise. Thank you for the opportunity and again I do apologize and hopefully one day in the future we can earn back your business."}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "104156777358998484949", "name": "andros thomson", "time": 1592614513081, "rating": 5.0, "text": "Restored to original condition torn drivers seat in Jeep Altitude! Owner is hands on and he and his team are user friendly! Have already recommended them to my neighbor ! Could not be happier with all aspects of Moore’s Upholstery! Highest recommendation!\nThanks for the great work!", "pics": null, "resp": null, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "106092555222530807368", "name": "Denise Smith", "time": 1595085884396, "rating": 5.0, "text": "Kenneth and his team has a great customer service attitude and they did an outstanding job on a headliner replacement. Not to forget that our truck was ready at the time we were promised. We will definitely repeat our business in the future!", "pics": null, "resp": null, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "117215131029413761930", "name": "Randal Knight", "time": 1584118174924, "rating": 5.0, "text": "Quality and value can't be matched in the area. I took my 2010 Ford F-150 in to get a driver's seat re-upholstered. I wish I would have taken before and after pictures. Looks brand new. Kenneth does great work. Also, Doug in the body department did some touch up paint and body work for me. Again, great work, great price. Will definitely go back for any future needs and highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "116949887726984857345", "name": "3932L", "time": 1560438750797, "rating": 5.0, "text": "I dropped off my 2001 F250 for the front seat to be reupholstered.  Moore's did a fantastic job and went above and beyond by also re-cushioning the front seat.  And, he was much more affordable than the other places I called.  I will definitely recommend him to others and will be back.", "pics": null, "resp": {"time": 1578111729071, "text": "Thanks so much! Make sure to visit our new location 2490 Washington St HSV."}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "113412158886417435550", "name": "Matthew M.", "time": 1562904834787, "rating": 5.0, "text": "Excellent upholstery work, would recommend to anyone needing interior work to their vehicle", "pics": null, "resp": {"time": 1578111717119, "text": "Thanks so much! Make sure to visit our new location 2490 Washington St HSV."}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "107178187074987980136", "name": "William Dunham", "time": 1554379543977, "rating": 5.0, "text": "I had Mr. Moore replace the top on my 2011 convertible.  They did a wonderful job, very friendly crew.  Thank you Mr. Moore.", "pics": null, "resp": {"time": 1578111746043, "text": "Thanks so much! Make sure to visit our new location 2490 Washington St HSV."}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1570584485983, "rating": 5.0, "text": "Great owner does great work.", "pics": null, "resp": {"time": 1578111661882, "text": "Thanks so much!"}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
{"user_id": "104551124467345101631", "name": "Justin Edge", "time": 1560350652876, "rating": 5.0, "text": "If you ever need something done to your convertible top this is the place", "pics": null, "resp": {"time": 1578111737720, "text": "Thanks so much! Make sure to visit our new location 2490 Washington St HSV."}, "gmap_id": "0x88626a2ea8021a55:0x788298e96c8475ac"}
