{"user_id": "108461345992821767233", "name": "Karen Landrum", "time": 1523567259727, "rating": 5.0, "text": "I’ve never needed to order draperies before & I was looking in the Yellow Pages & found Western Draperies.  I asked the gentleman who answered the phone if they made block out draperies & he said yes.  The rest was history as Mary came out & made some measurements in my “hot box” bedroom.  I’ve been on my own since I was 21 & moved out of this house ever since.  Mama passed away & she loved lacy valances & mini blinds but it was too hot in this front bedroom.  I moved back in as I knew it would benefit both daddy & I.  But the sun came in fast & furious & I sleep better when it’s dark.  Mary was very personable & definitely knew what she was doing.  My draperies are beautiful!!  And they work so very well w/blocking out that sun that baked me in the early morning.  Her husband was such a nice man & did a wonderful job installing my drapes.  I was like a kid in a candy store!! 👍🏼 💯% satisfied customer!!", "pics": null, "resp": {"time": 1554999857341, "text": "Thank you so much, Karen! We really appreciate the review!"}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "109332975547593912319", "name": "cash wilkerson", "time": 1476814263290, "rating": 5.0, "text": "Great... both Mary and Phil are true professionals ... magicians with the fabric.\n\nTwo big thumbs up.", "pics": null, "resp": {"time": 1477684242947, "text": "Cash, thanks for the nice review and for your business!"}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "115502573476427931475", "name": "Mike Denton", "time": 1448313185336, "rating": 5.0, "text": "We were looking for someone to make a half circle window treatment (fanlight approx 3' x 6') for us, but found that no one did that kind of work anymore. It was the look we wanted. We were finally referred to Western Drapery in Homewood. They have a new vender who will make any shape frame you want from a template. After discussing the way fabric would go on the frame with the kind people at Western Drapery, we decided that we could do it ourselves as long as we had the frame. So after carefully measuring and creating the template, it was ordered, made, and shipped. We attached sheer fabric to get the star burst look we wanted to achieve and the end result was perfect. We couldn't have done it without Mary and her brother at Western Drapery and the company that made the form. They were both great to work with.\n\nMike and Randy Denton", "pics": null, "resp": {"time": 1449507015705, "text": "Thank you Mike for leaving the great review.  We appreciate your business and hope your window treatment is perfect for you."}, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1504276276388, "rating": 5.0, "text": "They do amazing work!!", "pics": null, "resp": null, "gmap_id": "0x88891964ee99dcb9:0x5c9cab50316f9b9d"}
