{"user_id": "113234642395900676173", "name": "Amelia Johnson", "time": 1618538431177, "rating": 5.0, "text": "Kami was a blessing when it came to my wedding time and fixing my dress. Not only did she fix my dress, she helped pick it out! She is so sweet and down to earth. Thank you for all your help for my whole wedding party!!", "pics": null, "resp": {"time": 1618539234804, "text": "Thank you so much Amelia! It was such a pleasure seeing you pick your dress and working with you! 🌿"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "112321985978614526141", "name": "Katie Walker", "time": 1607114722551, "rating": 5.0, "text": "Kami was a pleasure to work with! She is so relaxed and easy going. I had Kami alter my wedding dress & add a belt. The final result was everything I could have imagined. She was fast, easy to communicate with, and encouraging! I'd definitely use her for future alterations and I highly recommend her to anyone needing someone pleasant and professional for their alterations!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNYhtOGrwGsVw5nsvrtS8jRCCSKFxA8cxTR9rQi=w150-h150-k-no-p"]}], "resp": {"time": 1607115914640, "text": "Katie, thank you so much! It was so nice to work with you too!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "105786232615524536947", "name": "Becca Brooks", "time": 1612751617386, "rating": 5.0, "text": "Kami is absolutely AMAZING. She made my wedding dress fit perfectly! We have been back for several pieces since then and she always does them to fit exactly how we asked!", "pics": null, "resp": {"time": 1612752343525, "text": "Thank you Becca! Always awesome working with you!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "117733309999258893799", "name": "Sheela Creel", "time": 1607459348244, "rating": 5.0, "text": "Kami altered my wedding dress for me 2 1/2 years ago and I've been going back to her for all of my alterations since! Everything she does is quick and extremely high quality. She's easy to communicate with and has an amazing understanding of what you are looking for. She does amazing custom work as well! Kami is simply the best!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPaV9pbVCEUJJgv200z2pEOoSjHJ93eVqzc6Lna=w150-h150-k-no-p"]}], "resp": {"time": 1607460877148, "text": "Sheela! I appreciate you for choosing me 2.5 years ago and every time since! It is so fun working with you!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "113392544321716923500", "name": "Jennifer Jones", "time": 1607125481572, "rating": 5.0, "text": "Kami made me a few custom items to fit my tricky body type. I feel confident and fabulous in the items she made me! They fit perfect and the quality can't be beat!", "pics": null, "resp": {"time": 1607126244844, "text": "Thank you Jennifer! I'm so happy to work with you!!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "104371084870626615108", "name": "Emily Anne Jones", "time": 1607290286980, "rating": 5.0, "text": "I have received a few personalized pieces from Kami - love them all! I was especially impressed with her desire to understand what I wanted out of the pieces and attention to detail (like a perfect waistline on my skirt)! My daughter has also taken a sewing class with Kami and felt so loved, enjoyed the experience, and came home with new skills! She is so great to work with!", "pics": null, "resp": {"time": 1607307828016, "text": "Thank you Emily! It is so great to work with you and your daughter! Looking forward to more projects with y'all!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "103975612526460037133", "name": "Samantha Jones", "time": 1607112935724, "rating": 5.0, "text": "Kami does an excellent job. She has made me a few things and I love them! I can't wait to see what she comes up with next!", "pics": null, "resp": {"time": 1607116192639, "text": "Thank you Samantha! It is always awesome working with you!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "115448019653358924227", "name": "Melissa", "time": 1607136809744, "rating": 5.0, "text": "We LOVED Kami!! My 9 year old daughter came to one of Kami’s sewing classes and absolutely loved it!! She kept going on & on about how funny and nice she was. My daughter made her first pillow & also learned a couple of new stitches. She asked me if she could go back for another class. I appreciate Kami’s professionalism & patience and the fact that she made my daughter feel so comfortable. We will 100% be coming back to do business with her!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMs03jeeZ2qrspXQRd0us0pRbpp7bNBhcTz8ENP=w150-h150-k-no-p"]}], "resp": {"time": 1607139859680, "text": "Thank you Melissa! She is such a joy to teach. We did have such a great time!"}, "gmap_id": "0x8889cbddac2dfa1d:0xe655ec3484366c28"}
{"user_id": "102104976338860587415", "name": "Brittany Turner", "time": 1619582269214, "rating": 5.0, "text": "I’m giving 5 stars... only because I can’t give ten! I purchased my dress at David’s bridal and went to Evanna’s for alterations. I was nervous and did not know what to expect. Let me just say-it was a better experience than I could have ever anticipated! If you are looking for a Bridal Shop with exceptional customer service and expert level knowledge concerning bridal couture-look no further! I go back for my next fitting in a month-but I have no worries how the finished product will look. Thanks for the awesome experience!", "pics": null, "resp": {"time": 1619618306531, "text": "Thank you so much Brittany. We really appreciate your kind feedback as well as entrusting us with your gorgeous gown! You will not be disappointed."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "111579393592885651734", "name": "Savannah Echols", "time": 1616596496170, "rating": 5.0, "text": "If you are looking for a wedding dress and want guidance on what will look great on your shape. Go ahead and make an appointment with these wonderful ladies. Their attention to detail and listening to what I wanted was amazing. Absolutely would recommend everyone I know to go to Evanna’s Bridal Boutique. The service I received here was like being part of a family. The welcoming nature and knowledge made me feel so comfortable. A hundred times over I would recommend and choose again. Thank you so much for helping me feel beautiful on my wedding day.", "pics": null, "resp": {"time": 1616597296206, "text": "Thank you so much Savannah. We really appreciate you choosing to shop small & local at Evanna’s Bridal. We really enjoyed helping you find The Dress & we are honored to be a tiny part of your Big Day!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "103565799790613180325", "name": "Brittney Anderson", "time": 1609349503332, "rating": 5.0, "text": "There should be an option for more stars, just for Evanna’s! Both ladies here are so friendly and warm! The studio is beautiful and clean and the ladies are professional and personable (a great combination that is often hard to find!) They got me in quickly for an appointment after my call and did an impeccable (and quick) alteration for me. I am so impressed by Evanna’s and will definitely only choose here for alterations in the future. If you need a bridal gown or alterations, this is your place!!", "pics": null, "resp": {"time": 1609350250170, "text": "Thank you so much Brittney, we really enjoyed working with you & are looking forward to seeing you again should you need our services."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "118320149898923378989", "name": "Lisa Martin", "time": 1616795458536, "rating": 5.0, "text": "Absolutely the best place to go! The kindest women work there! They fixed my dress in such ease and were willing to do everything I needed! I highly recommend!", "pics": null, "resp": {"time": 1617044283640, "text": "Thank you so much Lisa, we really appreciate your kind words! Come back and see us if you ever need anything else altered."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "107393947240567921171", "name": "Natalia Langner Smith", "time": 1617145987074, "rating": 5.0, "text": "Evanna's Bridal is a gem in Northport! I had to make some alterations between May 2020 when my wedding was initially scheduled and March 2021 when it was rescheduled to due to COVID-19, and everyone at the boutique was absolutely incredible! The work they did on my dress was high quality. From the first visit, I felt comfortable leaving my dress with them and trusted their abilities to handle those alterations. I cannot thank them enough for all of their work, their professionalism, and reasonable prices. Evanna's Bridal was a delight to work with and the owners are truly amazing!", "pics": null, "resp": {"time": 1617146744197, "text": "Thank you so much Natalia, we really appreciate your kind feedback. We enjoyed helping with your wedding dress alterations & are looking forward to seeing you for any formal wear alterations in the future!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "102970486136240435307", "name": "Stephanie Graeter", "time": 1612150027857, "rating": 5.0, "text": "My daughter found the perfect dress. Eva and Anna were super friendly and helpful. Love the handmade garter gifted with the dress purchase. And Eva was able to do the initial pinning for alterations to make sure we have the dress in time for the special day. Love these ladies and their beautiful shop.", "pics": null, "resp": {"time": 1612373650908, "text": "Thank you so much Stephanie! We really appreciate the kind feedback.  Your daughter will be the most beautiful Bride in her perfect wedding gown and we are beyond excited to be a tiny part of her Big Day!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "116929551957183597251", "name": "Brittney Anderson", "time": 1609348694160, "rating": 5.0, "text": "There should be an option for more stars just for Evanna’s!\nThe ladies are both so friendly! The shop is beautiful and clean and the ladies are professional and personable, such a great combination that is often hard to find. They got me in quickly for an appointment after my first call (and safely during covid) and did wonderful and quick alterations. I am beyond pleased with the service and their work and will never have anything altered anywhere else in this area except Evanna’s! If you’re looking for a bridal gown or need an alteration, this is your place!", "pics": null, "resp": {"time": 1609350213444, "text": "Thank you so much Brittney, we really enjoyed working with you & are looking forward to seeing you again should you need our services."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "117187300582972913749", "name": "KJ T.", "time": 1608827248961, "rating": 5.0, "text": "I absolutely loved working with them! Anna was super sweet, and very helpful in selecting the perfect dress for me. She was very responsive to my desires, and helped me pick out dresses that fit my exact tastes. The dresses are all gorgeous and there is something for all kinds of brides in a variety of sizes! If you are looking to purchase a dress, please check this place out!", "pics": null, "resp": {"time": 1608834600068, "text": "Thank you so very much KJ! We absolutely loved having you & your sweet mom at Evanna’s! You will make a spectacular bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "113577614855476773515", "name": "Cassidy Evans Windsor", "time": 1602082843550, "rating": 5.0, "text": "I purchased my dress in Arizona, moved to Alabama, but am getting married in Missouri. I reached out to Evanna's for alterations while I was still living in Arizona. I wanted to add some pretty extensive customizations to my dress to match my Halloween wedding theme. They were wonderful from day 1 via email. They were super responsive and worked with me and my unique situation. Their work is INCREDIBLE. They eased all of my nerves and it turned out better than I could even imagine it! 300% would recommend them over again. I will be going back for all my formal event needs and for my dress preservation after the wedding. (I will revise and attach pictures after the wedding). I do not have enough great things to say about them.", "pics": null, "resp": {"time": 1602166554646, "text": "Thank you so much Cassidy! We really appreciate your kind feedback. We couldn’t be happier to help with bringing your unique vision to life! We can’t wait to see pictures of your Halloween themed wedding!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "106344847118014455850", "name": "Katelyn (Kate) Smith", "time": 1596408669716, "rating": 5.0, "text": "Wow! Cannot speak highly enough of this boutique or my experience here. So kind, so helpful, and I got my dream wedding dress! If you're in the Tuscaloosa area (or not, it's worth the drive), definitely make an appointment here! They were able to see me very quickly, and I'm so excited to go back and get my dress altered.", "pics": null, "resp": {"time": 1596419670853, "text": "Thank you so much Katelyn! We really appreciate your kind feedback. Congratulations once again, you will make a spectacular Bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "107039753791451588486", "name": "Amanda Bradley", "time": 1590296197200, "rating": 5.0, "text": "You will not be disappointed if you choose to shop here! Such a beautiful bridal shop. The owners are so genuine about what the customer really wants, they do not pressure you to buy anything. They made our whole family feel welcome and special. My niece bought a dress, veil, and accessories there today and they were so sweet and patient with her. Such a fun and relaxing experience. They are very kind and accommodating, highly recommend Evanna's! Ten stars!", "pics": null, "resp": {"time": 1590331517988, "text": "Thank you so much Amanda, your kind words are much appreciated! We had a lot of fun hosting your beautiful family. We are more than honored that your beautiful niece chose our boutique to be her shopping destination. She will be a stunning bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "116299297408480638914", "name": "SARAH sarratt", "time": 1602011564793, "rating": 5.0, "text": "Wonderful owners in the shop, beautiful store and product. Very knowledgeable, kind, and timely. Thank you for altering my dress so last minute and doing such an exceptional job with it! You made my dress perfect for the best day of my life!", "pics": null, "resp": {"time": 1602022308787, "text": "Thank you so much for your kind feedback Sarah! We really appreciate it."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "115306872035654595154", "name": "Tricia Buzzelli", "time": 1583710514360, "rating": 5.0, "text": "The service at Evanna's was impeccable. My friend bought her wedding dress out of town and when it arrived she was very stressed that it needed a lot of altering. She called Evanna's and they told her to come down immediately. They took great care to take all necessary measurements and alterations needed. When we went back together to pick it up, they were so warm and welcoming. They made sure that the dress was comfortable and did not rush us at all. Evanna even made alterations while we were there (that only took ten minutes) in order to make the dress perfect. It also looks like they have wonderful dress selection, and even have one of a kind handmade beautiful gowns in the store as well as handmade garters which are beautiful. I would recommend this place to everyone.", "pics": null, "resp": {"time": 1583711598530, "text": "Thank you so much Tricia! We really appreciate your kind feedback and we are hoping to see you again at Evanna’s if you ever have any formalwear alterations projects."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105168678500260060697", "name": "lota silurus", "time": 1598380085481, "rating": 5.0, "text": "Wonderful place to shop! Excellent customer service, great selection of dresses. I would recommend this place to everyone.\nThe best place in Alabama.👍👍👌👌!!!!", "pics": null, "resp": {"time": 1598220754079, "text": "Thank you so much for the positive feedback. We appreciate it."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "115679847283396178980", "name": "Shannon Bogert", "time": 1578794277534, "rating": 5.0, "text": "What a wonderful experience we had at Evanna’s.  The owners are absolutely precious!  They patiently helped my daughter find the most beautiful dress and were kind and thoughtful to all of our family.  I highly recommend this lovely store and its gracious owners.  They will make you feel so special and so appreciated.  Thank you, ladies, for a day I will always treasure!", "pics": null, "resp": {"time": 1583897854822, "text": "Thank you so much Shannon, we really appreciate your kind feedback. We had so much fun with you and your family, we definitely enjoyed the experience as much as you did."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "108444243851086955014", "name": "Shelley Reed", "time": 1577479208569, "rating": 5.0, "text": "A few months ago, I had a short amount of time to have a bridesmaid dress altered. I went into Evanna’s, and the ladies were so sweet and helpful! I heard about Evanna’s through a friend and went with her to have her wedding dress altered. After seeing the beautiful work on her dress, I knew I’d never go anywhere else! My dress had many layers, and they patiently pinned every layer while making me feel right at home. The dress was absolute PERFECTION and finished in under a week — even with it being their busy wedding season!!! I highly recommend Evanna’s to everyone. Great quality work, affordable, and always a pleasant experience!", "pics": null, "resp": {"time": 1583897924797, "text": "We are always happy to help! We really are your kind feedback. Thank you!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "109586907477442692473", "name": "callie wallace", "time": 1583710463696, "rating": 5.0, "text": "Evanna's Bridal exceeded all expectations. My dress was picture perfect as was my rehearsal dress. They made me feel so comfortable  and taken care of, especially  since my mom couldn't  be present  for my special moments. They are like family!  I highly recommend  them for all bridal and alteration  needs!", "pics": null, "resp": {"time": 1583711437703, "text": "Thank you so much Callie! We treat our customers like family because we feel y’all are family to us. We were honored to work for you and helping your spectacular wedding gown fit its best! You made a truly dreamy Bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "112053090274057503169", "name": "Carolyn Fuller", "time": 1591049268395, "rating": 5.0, "text": "Incredibly personal experience and the dresses were so gorgeous! We kept thinking we had the one until we tried on the next! Prices are great but the personal service you get truly can’t be beat!", "pics": null, "resp": {"time": 1591053138075, "text": "Thank you so much Carolyn! We were more than happy to help you find your Dream Dress & be able to see how much joy it brought you! You will be a Gorgeous Bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "112255602697470193757", "name": "Amy Mitchell", "time": 1584279641960, "rating": 5.0, "text": "The ladies were beyond helpful and accommodating. Anna provided exceptional customer service and was very kind and friendly. The store was beautiful, welcoming, clean, and inviting for the perfect experience. They helped with my alterations and I will definitely use them in the future. I recommend them to any bride looking for the perfect dress with a perfect experience as well as anyone needing alterations.", "pics": null, "resp": {"time": 1584283390105, "text": "Thank you Amy, your kind feedback is much appreciated. We will be looking forward to seeing you again at Evanna’s."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "102824168924369950339", "name": "Jennifer Sullivan", "time": 1570316281888, "rating": 5.0, "text": "A friend of mine found her dress here today. They are AMAZING!! They try very hard to not only work within your budget but make sure you have an AMAZING dress. They have a nice inventory with a nice array of dresses from very simple to super decked out. They spent HOURS with my friend today making sure she had HER dress. Definitely a great place to go!!!", "pics": null, "resp": {"time": 1584030773851, "text": "Thank you so much Jennifer, we really enjoyed working with you guys! Your kind feedback is much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "115108509904387823047", "name": "Rebekah Brown", "time": 1590258663629, "rating": 5.0, "text": "Evanna’s was the BEST experience I had when searching for my wedding gown. Eva and Anna were both super nice and helpful and I was able to find my absolute dream dress with their help. Highly recommend!!", "pics": null, "resp": {"time": 1590263617219, "text": "Thank you so much Rebekah! It was our pleasure to help you find the perfect wedding dress. You will be a dreamy Bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "111703197667157199794", "name": "Harley Frizzell", "time": 1583774929238, "rating": 5.0, "text": "MUST GO!!!!! I didnt even want to buy a wedding dress an when I went to look the two lovely ladies were so amazing an help me find my perfect dress at just the right price. I cant thank them enough because they def made my wedding day something special. They have the best customer service I have ever seen. You can see they care about you and your day.", "pics": null, "resp": {"time": 1583775229431, "text": "Thank you Harley! We really enjoyed helping you find the perfect wedding dress, you will sure make a spectacular Bride on your Big Day !"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "113200183230979017769", "name": "Kari Killingsworth", "time": 1583848484158, "rating": 5.0, "text": "The wonderful women at Evanna’s Bridal go above and beyond to provide stress free and excellent service to their customers. I had my wedding dress taken up here and a veil hand-made for me when another bridal shop refused to, and they even incorporated details from my wedding dress to personalize it! I would definitely recommend Evanna’s Bridal to any newly engaged brides-to-be!", "pics": null, "resp": {"time": 1583861523716, "text": "Thank you so much Kari! We were more than honored to be able to custom make your dream veil and alter your gorgeous wedding gown. You sure made one spectacular Bride!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105987606832676284755", "name": "Charity Gee", "time": 1583766695648, "rating": 5.0, "text": ": Evanna’s was the first place I went dress shopping and I found my dress for a very reasonable price! Both ladies were so kind and helpful. And are altering my dress, just the way I want it!💗", "pics": null, "resp": {"time": 1583772686987, "text": "Thank you so much Charity! We appreciate your feedback. You looked absolutely gorgeous on your wedding day & we are very grateful you picked us for the wedding dress shopping & alterations."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "101507609379468649476", "name": "GG", "time": 1583876094614, "rating": 5.0, "text": "Professional, polite, & beautiful work! Thank you so much for taking such good care of me at a fantastically reasonable price. Will recommend 100%.", "pics": null, "resp": {"time": 1583879010499, "text": "Thank you so much GG, we really appreciate your kind feedback! We are looking forward to seeing you in the future should you have any alteration projects."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "103078773492789449830", "name": "Robin Claybrook", "time": 1566063749410, "rating": 5.0, "text": "This was such a wonderful experience! They were so kind and helpful! The family atmosphere and hospitality really put them over the top. I would highly recommend them for any bride! Their knowledge and expertise on wedding dresses is the absolute best! My veil is handmade by Eva and the garter is made by Anna! The dress and veil are breathtaking!", "pics": null, "resp": {"time": 1584031887229, "text": "Thank you so much Robin! You made a truly spectacular Bride & we are honored to call ourselves a tiny part of your Big Day."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "107196768141802609793", "name": "Brittney", "time": 1583725497091, "rating": 5.0, "text": "I had the best experience picking out the perfect dress here. They are so helpful and helped me pick out my dress when I wasn’t really sure exactly what I wanted. I can’t recommend them enough!", "pics": null, "resp": {"time": 1583762596610, "text": "Thank you Brittney! We really appreciate your kind feedback. We had great time helping you pick the perfect wedding dress & we can’t wait to see the pictures of you wearing it on your Big Day!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "103228218974734525732", "name": "Morgan Connell", "time": 1583772420270, "rating": 5.0, "text": "I Had the absolute best time shopping for my dress here! I’m very excited to have found the one at Evanna’s! The staff is extremely nice and so helpful. I highly recommend shopping here!", "pics": null, "resp": {"time": 1583772928798, "text": "Thank you so much Morgan! You’re a delight to work with & we’re more than happy to call ourselves a tiny part of your Big Day."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "114797945864350935586", "name": "Maegan Ingram Smalley", "time": 1583695904682, "rating": 5.0, "text": "I cannot recommend Evanna’s enough! Both ladies were so kind and hospitable to me and  my family. They made the whole dress shopping process a breeze! For a bride that had NO idea what she wanted when she walked in, they pulled and pulled dresses for me without any compliant. I did not feel rushed or bombarded. I’m so glad I chose to go dress shopping at Evanna’s!", "pics": null, "resp": {"time": 1583696523912, "text": "Thank you so much for your feedback Maegan! We really appreciate it very much."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105370633786959715022", "name": "lindsay ortman", "time": 1569688909896, "rating": 5.0, "text": "I absolutely adore Anna at Evannas. When I went in for alterations, she was so helpful and made suggestions that would make my dress perfect. I picked it up from her yesterday and I couldn't believe what an unbelievable job her and Eva did. They create bridal magic; My dress is perfect and exceeded my expectations. Anna is legitimately one of the sweetest and most personable people I've ever met. I will suggest Evanna's to any bride looking for a gown or needing alterations. 5 stars is not enough for this company.  Thank you for being so amazing Anna!", "pics": null, "resp": {"time": 1584031008177, "text": "Right back at you Lindsay! I had so much fun helping you make your beautiful gown fit it's best. You are truly one of the nicest people out there & we thank you for choosing Evanna's alteration services. Your kind feedback is much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105127019332923648287", "name": "Hanah Greene", "time": 1583599442815, "rating": 5.0, "text": "On my friends wedding day, she could not find her veil that she purchased from Evannas. We called them and they held a identical one for her, and allowed us to borrow it for the event! They were amazing and made sure we had nothing to worry about. 10/10 recommend!", "pics": null, "resp": {"time": 1583813978014, "text": "Thank you so much Hannah! The veil is for keeps - our gift to Emily! We appreciate y’all very much."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "114904370218585971567", "name": "Destiny Busby", "time": 1584803121334, "rating": 5.0, "text": "I found the dress of my dreams and had a private appointment and was able to feel like they were there just for me! They were so nice and helpful and just as excited as I was to find my dress!!! Everyone should come here!", "pics": null, "resp": {"time": 1588737225597, "text": "Thank you so much Destiny! It was our great pleasure to help you find your Dream Dress. We cannot wait to see the pictures of the wedding!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "110218029178315766341", "name": "Morgan Jacobs", "time": 1583704573470, "rating": 5.0, "text": "I went here to get my prom dress altered and they were so nice and very helpful! They also have a beautiful selection of wedding gowns. I would definitely recommend them.", "pics": null, "resp": {"time": 1583704901648, "text": "Thank you so much Morgan! We really appreciate your feedback."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105555915403381046512", "name": "Kiesha Dorough", "time": 1583774142696, "rating": 5.0, "text": "These girls are soo nice!! And they do an amazing job!! They work fast to get your needs met! Def recommend them!", "pics": null, "resp": {"time": 1583774200864, "text": "Thank you so much Kiesha! We really appreciate you."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "114217617548433770254", "name": "Jennifer", "time": 1583712493935, "rating": 5.0, "text": "Evanna’s is the best bridal boutique! The ladies there are so sweet and helped me find my dream wedding dress!!", "pics": null, "resp": {"time": 1583712666939, "text": "Thank you so much Jennifer! We’ve enjoyed working with you and we’re more than happy to be able to help you find The Dream Dress! You will be a Gorgeous Bride on your Big Day and we are thrilled to be a tiny part of it!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "110763505324148428071", "name": "Tricia Buzzelli", "time": 1556929245257, "rating": 5.0, "text": "Incredible service. Attentive and really intelligent staff who make sure everything is correct for your special day. My friend received her wedding dress from out of town and it needed a lot of work in order to make it fit, Evanna took special care and attention to detail on order to alter the dress perfectly. She even made some quick alterations while we were there in order to make sure the dress was comfortable. The staff was so cheerful and polite and made sure we had impeccable service. It also looks like they have a great selection of dresses and even some that are handmade and one of a kind. I would recommend this shop to any and all of my closest friends.", "pics": null, "resp": {"time": 1584031730725, "text": "Thank you so much Tricia! We truly had a blast with both of you. You are so much fun to work with & we appreciate you choosing Evanna's Bridal."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "112682288460419021337", "name": "Nicole Buziak", "time": 1551747490599, "rating": 5.0, "text": "This boutique is absolutely spectacular! The women who own it are super nice, hard working, and you can tell that they love what they do! They're friendly and make the entire experience fun and positive! There's so many gorgeous options and styles to choose from so you can't go wrong! I would recommend them to any family member or friend. When I get engaged, they'll be the people I go to. Can't recommend enough!", "pics": null, "resp": {"time": 1583945878045, "text": "Thank you Nicole! Your kind feedback is very much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "115917411843787213274", "name": "Cerra Little", "time": 1566607007171, "rating": 5.0, "text": "This is the best place in the Tuscaloosa area to buy a wedding dress! The ladies were so friendly, honest, helpful, and informative. I have been to several wedding dress stores and this was by FAR the best experience I had! I wish I could do it over and over again with them.", "pics": null, "resp": {"time": 1584031220345, "text": "Thank you Cerra! We had the best time with you as well, as you are impossible not to adore. We are honored to call ourselves a tiny part of your Big Day."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "113760295303504583771", "name": "Helene Brock", "time": 1573134821022, "rating": 5.0, "text": "This is the place to get a dress! They are very sweet and great at helping you pick the perfect dress. Very professional and have beautiful dresses!", "pics": null, "resp": {"time": 1583898091962, "text": "Thank you Helene! We appreciate you chose our boutique as your wedding dress shopping destination and we are honored to call you one of Evanna’s Brides."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "103876867294001752963", "name": "Anica Marx", "time": 1542821826575, "rating": 5.0, "text": "My shopping experience at Evanna's bridal was amazing! Eva and Anna are the best - very welcoming and friendly! They helped me find the dress of my dreams. They offer beautiful, high-quality wedding dresses in a very pretty store. The alterations of my wedding dress worked out perfectly, as well as those of my fiancé's wedding suit. Highly recommend this place!", "pics": null, "resp": {"time": 1584031528673, "text": "Anica, we can't thank you enough for your kind feedback! We really appreciate you choosing Evanna's Bridal and we are honored to call ourselves a tiny part of your Big Day."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "100708692591354320913", "name": "Monica Hill", "time": 1542490062710, "rating": 5.0, "text": "Took my daughter in search for the perfect dress.  We didn't have an appointment so I wasn't expecting much. We walked into the boutique, Anna greeted us with a warm smile and a \"Good morning\". From that moment forward it was like a fairytale experience! The appointment she had scheduled happened to reschedule, it was a sign in my eyes that this was definitely where we were suppose to be! Both Eva & Anna were kind and inviting! I'm so glad I decided to stop here!\nThank you both for a great experience!", "pics": null, "resp": {"time": 1584031404643, "text": "Thank you so much for your kind feedback Monica. Courtney sure made a Beautiful Bride and we are absolutely honored you Ladies chose Evanna's Bridal to be your wedding dress shopping destination."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105909426448985373896", "name": "Morgan Rotch", "time": 1583709079191, "rating": 5.0, "text": "These women are amazing! So hard working and they have a beautiful selection!", "pics": null, "resp": {"time": 1583709774765, "text": "Thank you Morgan! We really appreciate your kind feedback."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "105723231619062635720", "name": "Lauren Mosley", "time": 1566256994728, "rating": 5.0, "text": "Can’t say enough about the ladies at Evanna’s! I had my dress altered here and I couldn’t be more pleased with the experience! They do incredible work!", "pics": null, "resp": {"time": 1584031932217, "text": "Thank you so much for your kind feedback Lauren, it is much appreciated!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "109519925597465813283", "name": "Megan Moore", "time": 1566319464410, "rating": 5.0, "text": "Evanna’s bridal boutique altered my sample sale gown. They could not have done a better job!! The gown was ripped in the back, dingy, and needed major alterations. When we picked up the gown, it fit perfectly and looked brand new! They also placed my late MIL’s veil on a new comb for me. I could not be more pleased with their work! Would highly recommend.", "pics": null, "resp": {"time": 1584032044662, "text": "Megan, We're so happy we could help! We really appreciate your kind feedback & we are honored you chose Evanna's Bridal alteration services."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "106124082299752079168", "name": "Emily Skelton", "time": 1567035148243, "rating": 5.0, "text": "These ladies helped me find my perfect dress! They were so sweet & helpful. They’re new to town, but SO worth it. Thank You!!", "pics": null, "resp": {"time": 1584031118948, "text": "Thank you so much Emily. It was so much fun helping you shop for your dream dress! We are honored to call ourselves a tiny part of your Big Day."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "110093267553562101863", "name": "Shelby Barbee", "time": 1551546888713, "rating": 5.0, "text": "The only place I would go to for a special event for sizing and alterations. They gave me my measurments and even helped me look for a dress online with their own time because they knew I was in a pinch for a bridesmaid dress. The two women who work there went above and beyond to help me out even though I didn't make a purchase from them. Awesome people!!!", "pics": null, "resp": {"time": 1583945770605, "text": "Thank you so much Shelby. Your kind feedback is much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "103667462782236263553", "name": "Abby Figueroa", "time": 1565220963878, "rating": 5.0, "text": "I love the time and attention they gave us. Their dresses are gorgeous as well. Plus I found my dress!!", "pics": null, "resp": {"time": 1584031812156, "text": "Thank you so much Abby. We really appreciate your kind feedback & we are honored you chose Evanna's Bridal as your wedding dress shopping destination."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "101930462414614841490", "name": "Candice Reel", "time": 1583795252179, "rating": 5.0, "text": "Very great service!  Great prices!", "pics": null, "resp": {"time": 1583796817199, "text": "Thank you so much Candice, we really appreciate your positive feedback."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "117723255383395816515", "name": "Anna Czyzewski", "time": 1536778725068, "rating": 5.0, "text": "Evanna’s Bridal Boutique & Alterations is a place to go if you expect 5 star customer service! Those Ladies are really amazing! They simply made me feel special. The alterations department did spectacular job on my gown. I highly recommended Evanna’s!", "pics": null, "resp": {"time": 1583945671479, "text": "Thank you so much Anna. We greatly appreciate your positive feedback."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "111753468563339640152", "name": "Diana Welch", "time": 1536608564155, "rating": 5.0, "text": "Eva and Anna are both amazing! They did an incredible job helping me find a dress that made me feel beautiful, and made it even better after alterations. Their prices are affordable and they do spectacular work. If you are looking for the wedding dress of your dreams or need alterations, do yourself a favor and visit Evanna’s!", "pics": null, "resp": {"time": 1583945612032, "text": "Thank you so much Diana! It was pure joy to work with you. You looked absolutely gorgeous on your wedding day. We really appreciate your positive feedback."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "103184199993599098378", "name": "Kristle King", "time": 1536798872602, "rating": 5.0, "text": "For all your bridal and alteration needs please go to Evanna's Bridal Boutique and Alterations. The ladies are extremely nice and professional.  Their dresses are amazing. You will not be disappointed.", "pics": null, "resp": {"time": 1583879215496, "text": "Thank you Kristle! We really appreciate your kind words & we are looking forward to seeing you again at Evanna's Bridal."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "108115062304306670637", "name": "Daniel Moe", "time": 1540917500796, "rating": 5.0, "text": "My friend & his fiancée were shopping for a wedding dress in Tuscaloosa. Everybody else told them it’s impossible to find a dress in one week (they only had a week before the ceremony). The ladies at Evanna’s Bridal Boutique & Alterations helped his fiancée find the perfect dress & did all the alterations in 2 days! We had a great experience at this bridal shop & we all highly recommend Evanna’s Bridal!", "pics": null, "resp": {"time": 1583880308275, "text": "Thank you Daniel! The pleasure was all ours. We had the best time with you guys & we appreciate you choosing Evanna's Bridal!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "101076082543024260289", "name": "Kendall Lockman", "time": 1536806791593, "rating": 5.0, "text": "Anna and Eva are so incredible!! There selection of dresses are unique and unlike anything you will find anywhere else! These women are so amazingly talented and will truly make your dreams come true! I wouldn't trust anyone else with my alterations!!", "pics": null, "resp": {"time": 1583879285080, "text": "Thank you Kendall, your kind feedback is much appreciated. We are looking forward to seeing you again at Evanna's!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "100606222984842245293", "name": "Johanna Zettl", "time": 1541014895339, "rating": 5.0, "text": "Shopping at Evanna’s Bridal Boutique is a pleasure! The shop is beautiful and the owners are super nice. Their wedding dress are gorgeous!", "pics": null, "resp": {"time": 1583880352901, "text": "Thank you Johanna. Your kind feedback is much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "101322685209832427546", "name": "Crystal Wicker", "time": 1584021275505, "rating": 5.0, "text": "Great amazing people to work with and help for your special day!!", "pics": null, "resp": {"time": 1584025098590, "text": "Thank you so much Crystal, your kind feedback is much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "118183330546363343409", "name": "Kaye Ivy", "time": 1536933537347, "rating": 5.0, "text": "Eva and Anna are just amazing! If you're looking for top quality gowns in an elegant and relaxed setting backed up with quality alterations services then this is the place for you.", "pics": null, "resp": {"time": 1583879378815, "text": "Thank you Kaye! Your kind feedback is much appreciated."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "102981829582397877819", "name": "Samantha Bailey", "time": 1551571568583, "rating": 5.0, "text": "I’m speechless, this place is AMAZING and the ladies and very helpful and experienced. Found THE DRESS there and I couldn’t be more happy!", "pics": null, "resp": {"time": 1583945842114, "text": "Thank you so much Samantha. It was a pleasure to help you find the perfect wedding dress! We are honored to be able to call ourselves a tiny part of your Big Day."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "115810636362030032280", "name": "Beata Maziarz", "time": 1539108324488, "rating": 5.0, "text": "I went to several bridal shops but none of them had the style I was looking for. Thank you Evanna’s Bridal for helping me find my dream wedding dress!", "pics": null, "resp": {"time": 1583880176405, "text": "Thank you so much Beata! We had so much fun helping you find your dream wedding dress. You looked spectacular on your Big Day and we're more than lucky to call ourselves a tiny part of it!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "113612660581805565785", "name": "Linda Workman", "time": 1538159816557, "rating": 5.0, "text": "They were very friendly and professional. Prices are reasonable. The shop is very warm and inviting.", "pics": null, "resp": {"time": 1583879750830, "text": "Thank you so much Linda. We really appreciate your kind feedback & are looking forward to seeing you again for your alteration needs."}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "116338696974289518299", "name": "Quinika Bradley", "time": 1536795587271, "rating": 5.0, "text": "Anna and Eva are amazing business women from their customer service to their pride in their products! They produce beautiful dresses and alterations so perfect that you wouldn't imagine!", "pics": null, "resp": {"time": 1583879133943, "text": "Thank you so much Quinika, we appreciate your kind feedback. You are always welcome at Evanna's!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
{"user_id": "111252817869373556911", "name": "Ashley Goins", "time": 1544818692209, "rating": 5.0, "text": "Great to work with! Very helpful!", "pics": null, "resp": {"time": 1583945728867, "text": "Thank you so much Ashley, we really appreciate you!"}, "gmap_id": "0x88861dace3aaf8f9:0xeca28170aa23a904"}
