{"user_id": "102897001148959961385", "name": "Jennifer Kirkland-Brown", "time": 1599694939580, "rating": 5.0, "text": "Everyone at Beverly's Dance is extremely nice. This is my daughter's first real dance experience and it's been wonderful. Organized and great customer service. Jessica is Awesome!!", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "110245101985770234245", "name": "Alyssa Martin", "time": 1610579154598, "rating": 5.0, "text": "This dance studio is the absolutely the best in AL!!!!", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "107966765071143325430", "name": "Dylan Wynn", "time": 1571958480524, "rating": 5.0, "text": "Miss Carla is the best teacher I know and I really appreciate her Beverly's dance unlimited is awesome", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "112846620322092228807", "name": "Alexandria Esparza", "time": 1571958567499, "rating": 5.0, "text": "Beverlys dance unlimited is awesome Mrs.Carle is the bomb I dance there you will get the funnest dance class you will not regret it", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "105424716030245240137", "name": "Blanca Esparza", "time": 1573531946037, "rating": 5.0, "text": "BDU is amazing my daughter goes there since she was 2 she loves it there", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "115553302713419071941", "name": "Mattie Garrett", "time": 1571950546979, "rating": 5.0, "text": "My Great Grandmother is Mrs Beverly. I love Beverlys dance soooo much it is the best place ever. Most of the friends I have are from there everyone is nice and caring to each other. Everyone there older than be is considered my big sister we all care for each other and love each other. In my opinion Beverlys is the best and I love everyone there even the staff are sooo nice. Please come to Beverlys and enjoy the fun❤️❤️", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "100869438527917390373", "name": "Joely French", "time": 1504900868530, "rating": 5.0, "text": "I'm a dancer here, and this studio is different than any other studio I've ever been in, I remember my first day ever dancing in my life and dancing here made me feel that admiration I had when I started dancing.The only bad thing I'd say about it is that ever since I got there I couldn't stop dancing. My sister calls me happy feet because whenever I'm sitting I always just starting practicing the clogging combo I learned in intensives. I love this studio and I'm never going to switch studios again.", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "107951818427975923500", "name": "Marissa Martin", "time": 1540421380375, "rating": 4.0, "text": "I went there when I was little. I loved it. I miss doing it but I got took out of it because of $.", "pics": null, "resp": null, "gmap_id": "0x88890c0fd84c7613:0xe692cba1b27aadf2"}
{"user_id": "108221675631306578496", "name": "Nikki Rochelle", "time": 1541563017202, "rating": 5.0, "text": "Jorge and Maribel are awesome Latin Dance instructors. They make sure that their class is fun and educational for all students attending. Anything from Salsa, Bachata, Merengue, and Cumbia, they got it. If you're in the Birmingham area you won't find better teachers!", "pics": null, "resp": null, "gmap_id": "0x88891b14f3dea9af:0xe8334f97cce5d27"}
{"user_id": "115287326183816819444", "name": "Anastasia Rolin", "time": 1629241954775, "rating": 5.0, "text": "Great place for kids to learn how to dance different styles of dance. Ms. Laura is a wonderful teacher and makes all the kids comfortable and they have fun!", "pics": null, "resp": null, "gmap_id": "0x887d37d8859439df:0x55d1f1efed119250"}
{"user_id": "108218628685328911983", "name": "Karen Griffin", "time": 1593558351426, "rating": 5.0, "text": "Laura and Chyna does an awesome job with These Children 🙌🙌🙌🙌💙💛💙💛", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNmzkN_9Ni84KZZEpMTIGAtFFRIPgWkUmThwUOc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d37d8859439df:0x55d1f1efed119250"}
{"user_id": "116113058112256569080", "name": "Mary English", "time": 1592870826018, "rating": 5.0, "text": "Granddaughters love Miss Laura and dance class!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOiuSXadjhjKo8-P62MnkFipXTg2K-ZkpC84_b2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d37d8859439df:0x55d1f1efed119250"}
{"user_id": "103688801772047204618", "name": "Anthony Rhodes", "time": 1528076758756, "rating": 5.0, "text": "This place is the bomb my daughter goes their and does Competition and there goingTo nationals in Gatlinburg and they got a golden ticket to go to someplace far far away to compete against people in China and Africa and Asia all around the world thank you", "pics": null, "resp": null, "gmap_id": "0x887d37d8859439df:0x55d1f1efed119250"}
{"user_id": "104639742037733316386", "name": "Jennifer Guthery", "time": 1537545055166, "rating": 5.0, "text": "Our daughter has been dancing here for going on 3 years and I can honestly say this is HANDS DOWN the best dance school ever.", "pics": null, "resp": null, "gmap_id": "0x88884ba79da36d7b:0x69b8fd495dc89b64"}
{"user_id": "108073493475397643570", "name": "donnie collins", "time": 1492422590245, "rating": 5.0, "text": "They be dancing in the streets .", "pics": null, "resp": null, "gmap_id": "0x88884ba79da36d7b:0x69b8fd495dc89b64"}
{"user_id": "107818827383601040527", "name": "SaintMegery15", "time": 1601517218003, "rating": 5.0, "text": "Only been here twice, but had an awesome experience! My instructor was Laura and she was great! Highly recommend checking the place out regardless of your experience level.", "pics": null, "resp": null, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "117087636439447869447", "name": "Taylor Goodwin", "time": 1573096898017, "rating": 5.0, "text": "Such a fun and positive environment. I have never felt more welcomed and accepted than I have with my pole family. Elle runs the best studio in Alabama, and employs the best instructors. Everyone is so uplifting and encouraging through the process of learning and perfecting pole tricks safely. I couldn’t praise Elle or her instructors enough. The studio has changed my life and given me so much confidence in my self and in what I can accomplish, in and out of the studio. I leave every class with something new, and it’s my favorite way to work out!", "pics": null, "resp": {"time": 1573484941082, "text": "Taylor, you are a joy and a complete beast. We love having you at the studio!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "108735130160287974459", "name": "Brandi Darty", "time": 1571269490754, "rating": 5.0, "text": "I love taking classes at Studio Steel.  Elle and her fellow teachers always make me feel welcome, confident, and comfortable. Pole is such a fun exercise! I was hooked at my Taste of Pole almost a year ago. Give Pole a chance! You won’t regret it!", "pics": null, "resp": {"time": 1571271076291, "text": "Thanks Brandi, we love having you at the studio!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "116512171448465134690", "name": "Stephanie Smith", "time": 1582688330449, "rating": 5.0, "text": "Fantastic studio! The most amazing instructors; they really care about their students progress and want to help in every way. I have loved the classes I’ve taken so far and will definitely be back for more.", "pics": null, "resp": null, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "108495221448313984188", "name": "jenny machen", "time": 1562438676414, "rating": 5.0, "text": "I’ve been attending classes for about 5 months now and I feel wonderful! If you don’t like the gym and want to try something different this is the perfect place for you. I’ve always felt encouraged here, and have felt myself become so much stronger both physically and mentally! It isn’t easy, but it is SO WORTH IT!", "pics": null, "resp": {"time": 1562506055101, "text": "You are a source of endless fun and positivity! I am so glad you chose Studio Steel - I love how you try everything without screaming lol"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "103977678075375672494", "name": "Nneka Gunn", "time": 1562530186339, "rating": 5.0, "text": "I went from someone who didn't think very much of herself to someone who has not in only grown in strength physically, but mentally as well. Today, I am stronger, more confident, and more fit than I've ever been and it is all thanks to the love, support, and instruction I've received from the owner Elle and her wonderful team of instructors.\n\nI recently competed at PSO Southern on the Studio Steel Team and I won a gold medal!!! I'm three months into pole sport and this is the type of results I've received in such a short period of time.\n\nIf you like to workout in a judge-free environment filled with people of all backgrounds then this is the place to be. Prices are great, the instructors are incredible, and I'm delighted to say that I've gained a whole new family with my pole sisters!\n\nSee you in class!", "pics": null, "resp": {"time": 1562532700862, "text": "You are a ray of sunshine in the studio! You are always encouraging and inspiring to everyone, and as for your gold medal: YOU DID THAT and it was just plain beautiful to watch. xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "101408989439602486738", "name": "Peyton Stanley", "time": 1562426854322, "rating": 5.0, "text": "Amazing community and supportive instructors who always listen. Very considerate of each person's limits and will help you find ways to do things you didn't know you were strong enough to accomplish. Welcoming and wonderful.", "pics": null, "resp": {"time": 1562430663442, "text": "We love you Peyton! Thanks for the confidence in us!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "100323010358199979456", "name": "Kathryn at Redemptive Cycles", "time": 1562422788278, "rating": 5.0, "text": "Elle & the community are wonders. I love this studio so much: it is welcoming, inclusive, encouraging & SO FUN! I've done a progressive class here, had a surprise bday party (BEST Dirty Thirty party EVER - props to Elle for helping my beau pull that off), and have done several stand-alone classes. Each experience left me feeling empowered, strong and sexy AF. You may be timid to walk in but you'll feel like a million dollars when you walk out!", "pics": null, "resp": {"time": 1562430748382, "text": "Thanks Kathryn! xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "109297461363289862660", "name": "Demiboy Dorito", "time": 1597709026283, "rating": 5.0, "text": "awesome classes and atmosphere!!! very kind and talented folks!", "pics": null, "resp": null, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "102067650701121365390", "name": "Destinee Marie", "time": 1503545116430, "rating": 5.0, "text": "Going to class at Studio Steel is definitely my favorite place to go/do through out the week. Corinne an Elle are some of the most friendliest people I have been delighted to meet. I have started learning this form of dance as a complete beginner with no experience in really any dancing or fitness and Corinne has been an excellent and patient teacher!", "pics": null, "resp": {"time": 1503693003670, "text": "Thanks, Destinee! It's great to see you getting stronger and flexier and learning those pretty moves!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "113370131676107905675", "name": "Cassie Renfro", "time": 1524527762238, "rating": 5.0, "text": "I love going to Studio Steel! I started as a complete beginner and have loved it from the first second of class. It’s a super inclusive and friendly atmosphere where everyone is welcome. It’s a great way to get a full body workout with amazing people!", "pics": null, "resp": {"time": 1524531646990, "text": "Thanks, Cassie! Your progress has been so much fun to watch!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "101043115690362851359", "name": "J D Porter", "time": 1503502380368, "rating": 5.0, "text": "Finally, a professional vertical fitness facility in B'ham!  Pole is an incredible workout and it's greatly enhanced when the instructors and the studio are top notch, like they are here.  Studio Steel is a new, unique, and very comfortable space that really lets you focus on the workout.  I so like the look and feel of the place.  The pleasant surroundings, ample parking, professional equipment, and quality accessories in the boutique let it all come together.  Definitely worth a visit.  And, they've got a great $10 \"Taste of Pole\" option that newbies should absolutely check out.", "pics": null, "resp": {"time": 1503710989469, "text": "Thanks, JD - that means a lot coming from you! I know you are a huge fan of all things pole and it's good to know you approve. xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "109349167885662516841", "name": "Who Knows", "time": 1539543798564, "rating": 4.0, "text": "I would give it 5, but while I loved Elle's energy I was totally turned off by Corinne. She just didn't seem to know the difference between what's appropriate to speak about as a teacher and what isn't. She just was a major over sharer of her personal life, and the worst part was her young son is feet away possibly listening to his mother talk about inappropriate things.", "pics": null, "resp": {"time": 1539545155623, "text": "Thank you for your feedback. I don't think you are alone in this opinion. She doesn't work here anymore, and the new instructors are far more professional in both their conversation and their teaching. Please come try another class and see what I mean! xoxo Elle"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "102359538113372438245", "name": "Kasi C McPherson", "time": 1562543003271, "rating": 5.0, "text": "Stopped going to the gym and started coming here for my fitness. It’s so much fun and love the instructors.", "pics": null, "resp": {"time": 1562600613360, "text": "We love you too Kasi!😘"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "100758672122723167148", "name": "Madame Camembert", "time": 1503594237409, "rating": 5.0, "text": "Studio Steel is welcoming and inclusive. Instructor Corinne is enthusiastic, accomplished, and very strong - an excellent spotter who will never let you down. Pole is so much fun!", "pics": null, "resp": {"time": 1503710924231, "text": "Merci, Madame! Five stars for you too!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "117519148265845830763", "name": "Isabel Medina", "time": 1539240353341, "rating": 5.0, "text": "Love the studio and love Elle. The space is very cool and clean. It was a wonderful class and a great workout!", "pics": null, "resp": {"time": 1539260334058, "text": "(Translated by Google) I love you Isabel!\n\n(Original)\nTe amo, Isabel!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "114874055451960096950", "name": "Leslie Williams", "time": 1562424597116, "rating": 5.0, "text": "Such a welcoming and inviting place. No matter your skill level, you can call Studio Steel home!", "pics": null, "resp": {"time": 1562430687540, "text": "Thanks, Leslie! xoxo"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "114519519707451427421", "name": "Dolores Esme", "time": 1539309098888, "rating": 5.0, "text": "Fabulous place! Great for group parties", "pics": null, "resp": {"time": 1539347386056, "text": "Thanks, Dolores! Glad you had fun!"}, "gmap_id": "0x888918ec6427e6fb:0x3880ce0c7018f7b2"}
{"user_id": "111263084375488113721", "name": "Frank Clem", "time": 1590535276707, "rating": 5.0, "text": "Fresh, airy and clean. Very well lit. Easy parking, convenient location.\n\nPersonell are friendly, likeable, polite and knowledgeable. They teach from beginner through advanced. Always make you feel comfortable; never let you be embarrassed.\n\nPricing is moderate and worth every penny.", "pics": null, "resp": {"time": 1591999928734, "text": "Thank you for your possitive feedback. We appreciate your thoughtful and kind remarks."}, "gmap_id": "0x888c2c1b1af281d1:0xffb417f9f2c3ff7e"}
{"user_id": "111608993652945740449", "name": "Sherry Luna", "time": 1591942120974, "rating": 4.0, "text": "I have been a student at River Regions for many years now and it has been the absolute best thing I have ever done for myself.  The studio is clean and tastefully decorated, the music is grand, and the staff encouraging, patient, and devoted to making me happy while helping my dance skills to go beyond what I ever expected.  I have formed many friendships with other students, and the atmosphere is one of a caring family.", "pics": null, "resp": {"time": 1592000220905, "text": "Thank you kindly for your  review.  It is very nice ro know that we are accomplishing our goals. Our aim is to provide a safe, comfortable environment to help you reach your goal,   or even exceed them."}, "gmap_id": "0x888c2c1b1af281d1:0xffb417f9f2c3ff7e"}
{"user_id": "107375799276518083075", "name": "Demetrius Mills", "time": 1591531352215, "rating": 5.0, "text": "Awesome place. The instructors are so professional and knowledgeable. The dance classes are so refreshing and awesome.  I have found a new love for dancing at River Region Ballroom Dance Studio.     The owner is the best.", "pics": null, "resp": {"time": 1592000522297, "text": "Thank you so much for your  possitive feedback. We are especially pleased to know that you are loving dance and enjoying the environment in which you are learning."}, "gmap_id": "0x888c2c1b1af281d1:0xffb417f9f2c3ff7e"}
{"user_id": "100758445480816684403", "name": "Scott Campbell", "time": 1583117304745, "rating": 5.0, "text": "Jim, Beverly, and the rest of the staff here have become like family to my wife and I.\nTheir instructors are excellent and patient. I no longer dance like I don't know what I'm doing!", "pics": null, "resp": {"time": 1592000937207, "text": "Thank you for your feedback. Our intention is for you feel like family. We hope you continue  to enjoy dancing throughout your life."}, "gmap_id": "0x888c2c1b1af281d1:0xffb417f9f2c3ff7e"}
{"user_id": "102289894542531990067", "name": "Aarons Springhill", "time": 1565624300675, "rating": 5.0, "text": "My grandaughter wants to take every class! She is excited about the new location on Hill crest and all the new friends!", "pics": null, "resp": null, "gmap_id": "0x889bb4b1af466e85:0x676d5aa090ff8828"}
{"user_id": "100486269904876005349", "name": "kris xD", "time": 1524598400650, "rating": 5.0, "text": "I love the dance academy. I go there and it is the most fun I have ever had!!!", "pics": null, "resp": null, "gmap_id": "0x889bb4b1af466e85:0x676d5aa090ff8828"}
{"user_id": "101188350846086181842", "name": "Tara Crawford", "time": 1520379090953, "rating": 5.0, "text": "My granddaughter just love her dance classes with Mrs. April and Mrs. Britrany", "pics": null, "resp": null, "gmap_id": "0x889bb4b1af466e85:0x676d5aa090ff8828"}
{"user_id": "113189752257735134907", "name": "Tanya Baker", "time": 1570754793342, "rating": 5.0, "text": "Mrs. Crawford is an amazing teacher", "pics": null, "resp": null, "gmap_id": "0x889bb4b1af466e85:0x676d5aa090ff8828"}
{"user_id": "104970824738440311941", "name": "Faye Tilley", "time": 1600379336845, "rating": 5.0, "text": "Amazing teachers and great prices.  My granddaughters love it! Year 4 for us!!!", "pics": null, "resp": null, "gmap_id": "0x8861d91e9e246b55:0x7414d384be1fe391"}
{"user_id": "104263520010213291960", "name": "Jack Stevens", "time": 1544618336158, "rating": 5.0, "text": "I am on my third daughter attending Jackie O'Neal School of Dance and over the past 18 years the level of teaching has been top notch.  They produce amazing dancers.  No matter if it's just an extracurricular activity for your child or it becomes more serious Jackie O'Neal hS classes for everyone.  There are even classes for Adults!  Good people to work with.", "pics": null, "resp": null, "gmap_id": "0x8889185c9d11576b:0x69441b8121fd2591"}
{"user_id": "102719550152136551499", "name": "Maria Elizabeth", "time": 1548789952043, "rating": 5.0, "text": "Great studio! A big family! Highly encouraged.", "pics": null, "resp": null, "gmap_id": "0x8889185c9d11576b:0x69441b8121fd2591"}
{"user_id": "100234670222462545800", "name": "David Gibson", "time": 1471922101156, "rating": 5.0, "text": "Our daughter loved it! Staff was very good with young kids, and she loved being in a big show at the end of the year!", "pics": null, "resp": null, "gmap_id": "0x8889185c9d11576b:0x69441b8121fd2591"}
{"user_id": "111433231012809897638", "name": "annabanana2380", "time": 1448241562538, "rating": 5.0, "text": "Most warm & inspiring atmosphere. Highly encouraged!!", "pics": null, "resp": null, "gmap_id": "0x8889185c9d11576b:0x69441b8121fd2591"}
{"user_id": "115435772073966242807", "name": "Sparklebellart", "time": 1485377943981, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x8889185c9d11576b:0x69441b8121fd2591"}
{"user_id": "111706196492720769056", "name": "Billy Thomason", "time": 1596068964403, "rating": 5.0, "text": "Very professional dance studio", "pics": null, "resp": null, "gmap_id": "0x88891bba50e8ca35:0x41279a04f66a6ae1"}
{"user_id": "103773133951462250431", "name": "Erin", "time": 1591485102976, "rating": 5.0, "text": "Love Mrs. NINA and the staff", "pics": null, "resp": null, "gmap_id": "0x88893e5f06e0af7f:0x3324b0fa48fe8964"}
{"user_id": "107533991737902249002", "name": "Beryl Hillman", "time": 1446660512439, "rating": 5.0, "text": "I have attended Dance South recitals for many years. The dancing is top notch!  I'm proud that my granddaughters have been students, and one still is.", "pics": null, "resp": null, "gmap_id": "0x88893e5f06e0af7f:0x3324b0fa48fe8964"}
{"user_id": "107913674080373866240", "name": "Angela Mitchell", "time": 1469018111029, "rating": 5.0, "text": "Great leadership and teachers...", "pics": null, "resp": null, "gmap_id": "0x88893e5f06e0af7f:0x3324b0fa48fe8964"}
{"user_id": "101265545699224416167", "name": "Jessyca Johnson", "time": 1600461399787, "rating": 5.0, "text": "Friendly staff and nice facility. Really worked well with our space rental needs.", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "102952613248880929441", "name": "queen issa", "time": 1556291333119, "rating": 1.0, "text": "The Karar Performance Arts Class with Essence Was Horrible!!!! She put my daughter out the group because of an Adult situation we had to handle she blocked me and wouldn't respond to any of my calls. before recital took my money wouldn't do a refund or nothing", "pics": null, "resp": {"time": 1605033608020, "text": "Karar Performance Arts Class is not a program of The Dance Foundation.  Karar uses studio space at The Dance Foundation for its own programs."}, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1560895587385, "rating": 5.0, "text": "Very good staff and nice building with lots of parking.", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "115251175638094904336", "name": "Ebony Peak", "time": 1472097854414, "rating": 5.0, "text": "My daughter has been apart of this organization for 2 years, and the experience and atmosphere is amazing. I love this place and the great opportunities it has provided my daughter.", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "104886168044124675523", "name": "tammie reeves", "time": 1554497852439, "rating": 5.0, "text": "The Dance Foundation has truly been a blessing for my daughter!", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "103390587395375316707", "name": "Glizzy E", "time": 1448817866590, "rating": 5.0, "text": "Looks like a good place but does this have hip hop classes? I could really use one", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "107324629583264007780", "name": "Roberto Triste Martínez", "time": 1508374390143, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "101758080153732289854", "name": "Alyson Mikul", "time": 1369011544841, "rating": 5.0, "text": "I adore Children's Dance Foundation!", "pics": null, "resp": null, "gmap_id": "0x88891963662f97c7:0xfe51d8286f61ef95"}
{"user_id": "100276970107330092959", "name": "Sherri Eichhorn", "time": 1502923835571, "rating": 5.0, "text": "My daughter has progressed greatly. She loves it so much she doesn't want to leave! Thanks to Paige & Spencer! And Renee who inspires me!!! And of course Jane with  her great big smile to greet you when you go in. Autumn is on the dance team this year. So far she is loving it!!\nProud dance mom blessed 😇", "pics": null, "resp": null, "gmap_id": "0x8888e72507c8670f:0xd90ba89e13ce87d3"}
{"user_id": "105601092823382899743", "name": "Paul Burns", "time": 1534475584038, "rating": 5.0, "text": "Best dance studio in the world!  I love Renee' Lamar!  :)", "pics": null, "resp": null, "gmap_id": "0x8888e72507c8670f:0xd90ba89e13ce87d3"}
{"user_id": "103485890352765913654", "name": "Preston Holloway", "time": 1559416114979, "rating": 5.0, "text": "This is a great dance studio! My daughter loves it! The prices are reasonable and the staff members are friendly and great with kids! My experience, however, is mostly sitting in my car in the parking lot or plopping in with all the other apathetic and emotionless parent zombies in the lobby. My daughter loves this place! 5 stars!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPtL8keMYV_W_wpD6pxswAB_9paDJvCPRhuJ4_o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO3KgcdGB97oLECvRusRJ59d-GRzkHeXRqEQJPH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNYMULOUWtgYjweZ7pbgVGBu7L-FA3vNADYURxm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890c53052ed61f:0xb991e0ee67a86848"}
{"user_id": "101352094046618620065", "name": "Amaya Mccall", "time": 1441766837779, "rating": 5.0, "text": "I want to be in", "pics": null, "resp": null, "gmap_id": "0x88890c53052ed61f:0xb991e0ee67a86848"}
{"user_id": "103909718517757983946", "name": "Jackson Mayo", "time": 1621272144056, "rating": 5.0, "text": "My step-mom is cool. :)", "pics": null, "resp": null, "gmap_id": "0x889bae2f2255efe9:0xe5dcd96ab84897d8"}
{"user_id": "103611176003529614716", "name": "J. Craig Dickson", "time": 1599173030003, "rating": 5.0, "text": "Great learning center for young girls.", "pics": null, "resp": null, "gmap_id": "0x889bae2f2255efe9:0xe5dcd96ab84897d8"}
{"user_id": "100903884159188194670", "name": "Roy Hall", "time": 1534897905478, "rating": 5.0, "text": "My daughter has been with Lindsey since she was 2 she is now 15. She loves Lindsey and Rhythm dance center. They are all amazing and love her like there own. Can't find a better place.", "pics": null, "resp": null, "gmap_id": "0x889bae2f2255efe9:0xe5dcd96ab84897d8"}
{"user_id": "102299835508540481536", "name": "Faye frost", "time": 1499118371598, "rating": 5.0, "text": "She is one of the best dance teachers I have ever seen. She has the best patience and tolerance for the little ones . My little girl used to cry when we would have to go to the other ballet class but, now when I say ballet she says I get to go see Miss Lindsey  it makes me smile every time.", "pics": null, "resp": null, "gmap_id": "0x889bae2f2255efe9:0xe5dcd96ab84897d8"}
{"user_id": "106254716439663658968", "name": "Poppy’s World", "time": 1523741023227, "rating": 5.0, "text": "I used to attend Rthym For about 2 years but I decided Dane wasn’t really my thing and I’m a Level 5 Gymnast Now. The teachers are wonderful and my little sister still attends, Doing Ballet, And Lryical. I used to do tumbling, Hip Hop, Ballet, And Jazz. If you are looking for a dance studio to take lessons at with an affordable Price. Rthym Is Your Option!", "pics": null, "resp": null, "gmap_id": "0x889bae2f2255efe9:0xe5dcd96ab84897d8"}
{"user_id": "110466523540148810808", "name": "Tara Rosschile", "time": 1569544606151, "rating": 5.0, "text": "This dance studio, kicked my butt as a busy mom! However, it provided a great foundation in my daughter, Karter Victoria's dance career. Essentially what can you say negative about seeing your little dancer on a giant stage performing in front of hundreds of fans. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88892209f6abb197:0x2a64b7fb640a7999"}
{"user_id": "109279869391010923641", "name": "Lizzie Graham", "time": 1574134421097, "rating": 5.0, "text": "I've studied in two ballet studios before I came to CBM.  They both pale in comparison.  The dance rooms are big and full of natural light.  The facility is excellent.  All the teachers are extremely skilled in their craft.  Mrs. Pam's artistry and dedication are what make the choreography come to life.  Most importantly, all the staff members love the students they teach, make costumes for, and work in the office for.  They truly love what they do.  They give full, dedicated effort in every combination given, stitch sewn, and paperwork checked, even when we don't pay attention, squirm in our costume fittings, and turn in paperwork late ;)  Could not give higher praise.", "pics": null, "resp": null, "gmap_id": "0x889a5298b0bc01c7:0xda03a95b49efbb26"}
{"user_id": "102712730275457345878", "name": "Sara Kindt", "time": 1592502173723, "rating": 5.0, "text": "Wonderful community of dancers and their families! Superior direction and instruction. We couldn't be happier being there.", "pics": null, "resp": null, "gmap_id": "0x889a5298b0bc01c7:0xda03a95b49efbb26"}
{"user_id": "105442251537396058413", "name": "Carley Smith", "time": 1565033922301, "rating": 5.0, "text": "Beautiful light and airy studios with state-of-the-art sprung floors! Artistic Director Winthrop Corey is inspiring the young dancers every day here at CBM!", "pics": null, "resp": null, "gmap_id": "0x889a5298b0bc01c7:0xda03a95b49efbb26"}
{"user_id": "114876694445975577315", "name": "Lettie Duke", "time": 1581973695048, "rating": 5.0, "text": "Wonderful classical school of ballet!!", "pics": null, "resp": null, "gmap_id": "0x889a5298b0bc01c7:0xda03a95b49efbb26"}
{"user_id": "111276372695865407000", "name": "Ann Mitchell", "time": 1590112615255, "rating": 5.0, "text": "Wonderful and caring teachers", "pics": null, "resp": null, "gmap_id": "0x889a5298b0bc01c7:0xda03a95b49efbb26"}
