{"user_id": "108806208355383444639", "name": "Hannah Morris", "time": 1570732099036, "rating": 5.0, "text": "Wonderful, educated and SAFE daycare!", "pics": null, "resp": null, "gmap_id": "0x88861d17e0a91f8d:0x6facd5916eb03f3b"}
{"user_id": "114703629528848915343", "name": "Stephen Sweeney", "time": 1618406587660, "rating": 5.0, "text": "Our son has been at Heritage Preschool for almost 3 years.  They truly have an exceptional focus on childcare while providing quality child development.  Even as a toddler, we don't refer to it as daycare because it is so much more.  We refer to it as school at they have been a true partner in the education and development of our child.  They keep us informed of his progress and what they are working on so we can reinforce at home.  We have been very pleased with Heritage and would recommend them to anyone seeking a childcare solution.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "114261971942354221263", "name": "Mark VanHooser", "time": 1618585074731, "rating": 5.0, "text": "We love Heritage! There have been times, as a first time parent especially, that we and I had no idea if we were doing the right things to help our daughter learn and grow.  The teachers and staff do an excellent job in helping to not only guide us in those areas, but encourage us! There is even a Potty Training Boot Camp that helped us tremendously!!  We now have two little ones enrolled and have been attending for four years.  We wouldn't dream of going anywhere else.  We have never had a bad experience with any of the teachers or staff and our kids love them!", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "112503870539108523573", "name": "Maria Martinez", "time": 1618571910925, "rating": 5.0, "text": "I have 2 kids that love going to Heritage. My daughters always have a big smile on their face when I drop them off and my oldest always tells me she had a great day. Julie, Mary, and the 3B teachers have made the transition of me returning back to work so positive by taking care of my youngest daughter who absolutely loves them!  My oldest has thrived under Mandy and Kathryn teaching her in PreK. The entire staff at Heritage is amazing and I can't say enough great things about them. They all have been so kind, caring, and patient with my kids.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "108764545879343287557", "name": "Brittany Ledbetter", "time": 1618422045551, "rating": 5.0, "text": "We absolutely love Heritage. When we decided to move our daughter to the school after having multiple issues with the previous daycare we had her in, Mr. Paul was so very helpful and did everything he possibly could for us to insure we had a smooth transition and could get her out of the other environment quicker. Along with Mr. Paul, all of the teachers and staff have been wonderful! We are very grateful to be apart of the Heritage Family.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "108187336593524485880", "name": "Mallory Hilderbrand", "time": 1618363457807, "rating": 5.0, "text": "We've been a Heritage family for over six years with both of our children starting around ten weeks old as infants. The staff, parent communication, and care are all excellent. We've grown to love this place and trust Heritage with our most precious little people. When I hear stories from other (even more expensive) daycares from my friends, I am often reminded of how grateful I am for this school.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "115265369182271824868", "name": "Maija Galloway", "time": 1618394188669, "rating": 5.0, "text": "I love the warm welcome every time I walk in to drop off my child or pick them up.  All the teachers are so loving on my child. It warms my heart to see my child run to give a teacher a hug.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "112083917072030483291", "name": "Suzanne Crisanti Boos", "time": 1618521708717, "rating": 5.0, "text": "My daughter is in infant 2 and she is adjusting very well. Her teachers pay close attention to her and what she needs. The facilities are also kept very nice and clean! The front staff also greets children by name and recognizes parents!", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "107044125849186536892", "name": "Ola Janik", "time": 1623170884757, "rating": 3.0, "text": "My son's teacher was very nice and had many years of experience in childcare. The place is big and clean with nice classrooms and playgrounds. That being said, on the wobbler class, they have twice the number of children per teacher according to State regulation suggestion. Because of that it seemed like all the kids do is sit and wait on stuff. Diaper changes, feedings, and snacks take forever. The kids just sit strapped into a chair probably half the day, if not more. My biggest problem with them is that they did not take any  COVID precautions for the kids or parents (they take temperatures of everyone that comes in in our new daycare) and my son got COVID from there his first week. I know it was from there because we didnt take him to stores or in public because of social distancing. When we informed them of this, they shrugged it off and said something like, at least kids aren't that badly affected by it. I bet they didn't inform any of the other parents in his class. It's really expensive too and you have to provide everything. Also they don't support hand washing or potty training till later classes. Not a good fit for our kid but I'm sure it's fine for others", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "108013677555608400746", "name": "Jessica Brown", "time": 1570041204842, "rating": 5.0, "text": "We absolutely love this daycare. Our child started at 6 months old and the teachers have always been so wonderful to him. They greet him each day with big smiles, help him when he refuses to nap :), and clearly love him which is so important to us as parents. He gives them huge smiles at the end of every day - so I know he loves them as well.They keep him on a great schedule, which we now copy on weekends. We had no idea where to send our son initially but feel incredibly lucky to have found Heritage as our home!", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "110677768454612850550", "name": "William McCandless", "time": 1558214398590, "rating": 5.0, "text": "We have just finished with multiple years at Heritage preschool.  The first day of my child's new school we received a note from the teacher saying it was like he had been there all year.  I attribute that readiness to my child, parenting, and the time we spent in Heritage.  I feel my child is prepared and ahead.  I highly recommend them.  More than most types of places you get what you pay for; at Heritage we always felt safe, it was always clean, and the communicate from the staff was excellent.   We would make the same decisions again knowing what we know now.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "102093753296407760423", "name": "Meaghan-Elizabeth Morris", "time": 1568392437644, "rating": 5.0, "text": "We have three children who started at Heritage this week (7 month old twins and a 3 year old). We worried about the transition for our 3 year old but she continues to be excited to go everyday. The teachers and staff are so helpful and caring. We are already seeing the advantages of the curriculum in our 3 year old and are excited to watch her grow at Heritage.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "112297320730612422168", "name": "Jonathon Whitehead", "time": 1618351946690, "rating": 5.0, "text": "We love this place! I never thought I would feel comfortable leaving my infant at a daycare/preschool, but Heritage seems to be on top of things.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "113315254037543348133", "name": "Jonathan Williams", "time": 1557962161791, "rating": 5.0, "text": "This will be my second child to come through Heritage Preschool.. once my now 9 year old  left Heritage he was ahead of his kindergarten class in writing and all.. the staff there are all consistent and very loving to my kids and my family. Very family friendly..  We also love “parents night out” . A very much needed rest and intentional date night on a quarterly bases away from 3 kids (3,9,12)-1", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "101897421637681069468", "name": "Kendal Etu", "time": 1475675425113, "rating": 5.0, "text": "Our son has been at the CCS Research Park location since he was 3 months old. I cried every time I thought about taking him to daycare until I actually had to take him. The staff at CCS have been wonderful to us. They know my son by name and greet him every morning and afternoon. His teachers have been amazing and so very patient with us. As first time parents we tend to over analyze everything. I can't say enough good things about our experience with this school. I truly feel like they love our son and are investing in his future.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "110430242518840529491", "name": "Michelle Thompson", "time": 1618930710209, "rating": 5.0, "text": "The teachers and staff are amazing! Our little girl has learned so much and is very happy there.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "100822264134376288234", "name": "Nichole Hache", "time": 1507299692780, "rating": 5.0, "text": "This isn't a daycare, this is a family!!! Our daughter has been going to CCS Research Park since she was 1 year old. She has been doing so great there. I use to be nervous to take her to daycare and knew she would scream and cry when I would drop her off, but at CCS she is happy to be there and doesn't scream or cry. The staff feels so much like family and they are quick to comfort and help her and comfort and help me when both my daughter and I are having separation anxiety moments haha. My daughter and cerebral palsy and has to wear a leg brace and therapy services, the staff at CCS are so quick to help with her brace and with therapy while playing, and they allow her therapist to come to daycare, which helps my husband and I so much. She is excelling everyday and I am just amazed and what all she has learned and continues to learn. No child is pushed to move any faster than the child has to. They let the children mature and grow in everything at the child's pace before moving to a older class. Which as a mother I am thankful that they our daughter move at her pace and not expected to be like all the other children. I will never go to another daycare, it makes me nervous just thinking about leaving CCS. They are a wonderful family who we have just grown to love and happy to see everyday.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "107229838440758352945", "name": "Heather Ellett", "time": 1475681564460, "rating": 5.0, "text": "My child has been at CCS for eight months.  He's currently in the wobblers classroom, and we love it.  His teachers are great with all the children.  In a previous review, I saw it mentioned the children were being \"tied to a chair\".  My job allows a lot of flexibility in my schedule, so I will drop off and pick up at various times of the day.  I have never seen my child, nor anyone else's, tied down.  They have small chairs the children sit in, and there is a strap with a buckle that goes over their lap.  They will buckle them in while they're eating lunch or snack to keep them from falling out.  These children are still small and aren't used to sitting in armless chairs by themselves yet.  They will use these same chairs for timeout.  My son likes to try to stand up and climb on everything, so I'm glad they buckle him in to keep him from falling out or standing up and then falling and potentially hurting himself.  The teachers not buckling him in his chair would be a safety concern for me.  They have lesson time and they are taught letters, numbers, colors and sign language.  My son is 15-months old, and he will do sign language for various words, and he's learning so many new things all the time.  We are greeted every morning when we come in, and all the staff know my son by name.  I'm very happy with CCS, and the teachers in the wobblers room seem to truly care about the children in their care.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "111068785253351938642", "name": "Brandon Howard", "time": 1461252485065, "rating": 5.0, "text": "I am so appreciative of the folks at CCS. My daughter loves to go to school, she loves all her teachers. It's nice when we are leaving that everyone that works there knows her name and says goodbye. The facility is clean, safe and the playground areas are great. The staff is attentive and caring, especially when my daughter was apprehensive about school at first. I highly recommend CCS.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "100822264134376288234", "name": "Nichole Hache", "time": 1507299692780, "rating": 5.0, "text": "This isn't a daycare, this is a family!!! Our daughter has been going to CCS Research Park since she was 1 year old. She has been doing so great there. I use to be nervous to take her to daycare and knew she would scream and cry when I would drop her off, but at CCS she is happy to be there and doesn't scream or cry. The staff feels so much like family and they are quick to comfort and help her and comfort and help me when both my daughter and I are having separation anxiety moments haha. My daughter and cerebral palsy and has to wear a leg brace and therapy services, the staff at CCS are so quick to help with her brace and with therapy while playing, and they allow her therapist to come to daycare, which helps my husband and I so much. She is excelling everyday and I am just amazed and what all she has learned and continues to learn. No child is pushed to move any faster than the child has to. They let the children mature and grow in everything at the child's pace before moving to a older class. Which as a mother I am thankful that they our daughter move at her pace and not expected to be like all the other children. I will never go to another daycare, it makes me nervous just thinking about leaving CCS. They are a wonderful family who we have just grown to love and happy to see everyday.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "110372519584396435110", "name": "The Mental Fit Chick", "time": 1422653367654, "rating": 5.0, "text": "I ABSOLUTELY LOVE CCS (Research Park Location) ! The learning environment is ABSOLUTELY GREAT! This school is like the HARVARD or YALE for preschools within the Huntsville/Madison Area! Each grade level has great instruction and the classical approach way of teaching has been amazing for my son! We brought him to the school because he wasn't being challenged where he was and within 2 weeks he knew all of his alphabets, vowels and knew what his constants were as well; We have been there about 5 months and he is on his way to reading and he is only 3!  The Business aspect is handled properly and that is important also because again this was like our 5th day care and although Christian Daycares are GREAT BUSINESS IS BUSINESS! The teachers are professional and Gossip amongst them with parents is nonexistence. The environment is clean, safe (you have to have codes to get into every door), and overall a joyful atmosphere!", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "107229838440758352945", "name": "Heather Ellett", "time": 1475681564460, "rating": 5.0, "text": "My child has been at CCS for eight months.  He's currently in the wobblers classroom, and we love it.  His teachers are great with all the children.  In a previous review, I saw it mentioned the children were being \"tied to a chair\".  My job allows a lot of flexibility in my schedule, so I will drop off and pick up at various times of the day.  I have never seen my child, nor anyone else's, tied down.  They have small chairs the children sit in, and there is a strap with a buckle that goes over their lap.  They will buckle them in while they're eating lunch or snack to keep them from falling out.  These children are still small and aren't used to sitting in armless chairs by themselves yet.  They will use these same chairs for timeout.  My son likes to try to stand up and climb on everything, so I'm glad they buckle him in to keep him from falling out or standing up and then falling and potentially hurting himself.  The teachers not buckling him in his chair would be a safety concern for me.  They have lesson time and they are taught letters, numbers, colors and sign language.  My son is 15-months old, and he will do sign language for various words, and he's learning so many new things all the time.  We are greeted every morning when we come in, and all the staff know my son by name.  I'm very happy with CCS, and the teachers in the wobblers room seem to truly care about the children in their care.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "106038085531150271857", "name": "Josh Langford", "time": 1475673646119, "rating": 5.0, "text": "Our child recently started attending CCS and each and every time we step foot in the Research Park campus we have been made to feel like family. We are very particular about who watches our child and we feel very comforted he is in such a welcoming, learning and loving environment.", "pics": null, "resp": null, "gmap_id": "0x88626eeacd32e797:0x55052fe279060507"}
{"user_id": "101985505293882074514", "name": "V H", "time": 1628710750480, "rating": 1.0, "text": "I called this daycare simply asking if they had any openings. The girl that answered said they had 2 openings and even wanted to see if I could come in to tour the facility. I then advised my son was dx with autism and if they were they inclusive. I was placed on hold. The director picks up and says they don’t have any openings and that the two positions had been filled and paid for. Oh, really? Funny, how when I was transparent the conversation changed. I would have appreciated it better if they would have simply said they are not equipped. Even though my son is not aggressive, he simply needs a little bit more hands on attention. I would’ve preferred er an honest answer versus what I was given. I would never try to enroll my son somewhere where the teacher and staff where incapable of meeting his needs.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105293497763588398661", "name": "Ami Joy Scarbrough", "time": 1596469385384, "rating": 1.0, "text": "I’m literally sitting in a place that mandates marks AND a statewide mandate is in place while a director ahd I assume a franchise owner are sitting in a public place discussing COVID19 guidelines with no masks! I’m not a fan of masks either but this certainly doesn’t give me much reassurance that my child would be safe at AK if two individuals in management don’t take the County and State Health department mandates seriously. It’s a shame because I’d planned on enrolling my son after having visited before COVID19. I think I will pursue other avenues.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "100925917018523557513", "name": "Sabrina Miller", "time": 1569274483583, "rating": 5.0, "text": "I am very grateful for the School For Amazing Kids' staff (including Tina, Dana, and Teresa).  My son has a new diagnosis of autism (high functioning), and they have been very helpful with helping him through his separation anxiety and speech delay.  They personally directed us in the right direction for his speech, and  have went out of their way to comfort him when he has a break down.  Their reassurance has helped me tremendously. They all are a huge blessing to us.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "109769568946250490366", "name": "Morgan Stepek", "time": 1569274917265, "rating": 5.0, "text": "They have been a wonderful change from our previous childcare. We love the teachers and directors. Everyone has been so caring and helpful. The atmosphere is truly child focused and my son is so much happier!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105662675913979288642", "name": "Bethany Aultman", "time": 1570799271727, "rating": 5.0, "text": "This school does truly live up to its name! It is absolutely amazing. My son has attended here since 2017, and the care he has received has been incredible. His teachers from previous classes still come and check on him. I honestly don’t ever worry about him during the day, and I know he is being loved on while I have to work. I would honestly be lost without this daycare! My son tells me all of the time, “ thank you for sending me to school today.” He’s 3!!\nThe staff and directors are pretty amazing too!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "113958667329379467599", "name": "Benjamin L", "time": 1509653625995, "rating": 5.0, "text": "My wife and I love The School for Amazing kids. We just had our first child this year and we knew going back to work would be tough. He started at 10 weeks old and has done fantastic in their care. He is 6 months old now. We couldn't ask for better people to be watching our newborn. I feel very safe leaving my son their each day because I know he is in good hands. I like knowing they have a camera system installed throughout the building and that no one can check in or out with out providing a finger print.\nTheir hours each day are long enough to give us time after work to get there and pick him up. They keep track of when he eats and sleep. It's like getting a report each day about his day. The staff in the infants room is fantastic! They stick to the feeding schedule we requested and will do anything we ask.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "103609490675210709345", "name": "Courtney Shugart", "time": 1535321244470, "rating": 5.0, "text": "This is truly the best daycare. We started our girls here back in February and the difference in my three year old has been night and day. We struggled a lot before with her listening and following direction. Since starting Amazing Kids, she has blossomed. She listens to us now and loves to follow directions. She loves her teachers and constantly talks about them and all they have taught her.\n\nNot only has this daycare program helped our daughter, it has helped us too! The teachers are always more than happy to answer our questions and give us guidance when we need it. They offer such a nurturing environment for our children. We were so nervous in the beginning, as we had always had our girls kept at home but, the staff at Amazing kids made the transition much easier than I ever imagined. They answered all the crazy questions we had and never once made us feel like we were overthinking it. They have truly become a second family for us and our girls.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "109016015818727086592", "name": "Todd Mashburn", "time": 1423755122598, "rating": 5.0, "text": "We absolutely love Morningstar!  The staff and teachers that work there are awesome and they always have a smile on their face!  They are great with the children and our child can't wait to get to \"school\" every morning.  We also like the fun, seasonal activities that Morningstar provides for both the children and the parents.  These activities allow for the parents of the children to get together, to meet and talk to the teachers and for the children to have an awesome time playing!  We highly recommend Morningstar Child Care if you are new to the area!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "101988841145153303609", "name": "Erica Roberson", "time": 1554296503582, "rating": 2.0, "text": "Walked in to my son’s classroom one day to find him on the floor of the bathroom with his pants down, door open, and a kid pointing and laughing at him. The teacher sat at her desk and did nothing. I asked for security footage to be reviewed and was told it was a live feed and not recorded. I’m giving more than one star because the director assisted us all he could and I understand there’s not much you can do when you don’t have evidence. My son had a few good teachers, but there was one that he said was really mean to him. He’s doing much better now that he’s in public school.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "106602396844289446026", "name": "Katrina Ackerman", "time": 1406259112506, "rating": 5.0, "text": "We absolutely love Morningstar Daycare. As, first time parents, it was important for us to find a place that we were comfortable with dropping our girl off at.  The teachers really seem to care about each and every child that comes through those doors. It is reassuring to see your child smile when you hand her over to the teacher. We could not have chosen a better place for your daughter to go!  Hands down the best place!!!!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104844221744970119888", "name": "Brandi Hicks", "time": 1417038465704, "rating": 5.0, "text": "My daughter started attending Morningstar 10 months ago and we have been extremely happy.  We have grown to know and love the teachers there and were welcomed with open arms.  It is so comforting to know that my child is in great hands while we are at work.  Many of the teachers have become just like family to us and are so kind and caring.\nThe education that she is given at Morningstar has been wonderful in getting her prepared for 5K next fall.  We are so thankful for Morningstar and their staff.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "108797649337013205711", "name": "RaNetta Underwood", "time": 1474909316439, "rating": 5.0, "text": "Caring Staff\nIt is a very hard and even an emotional time when a parent drops their child off for daycare for the very first time and this was definitely the feeling I had when I had to finally go back to work after spending 9 wonderful weeks with my newborn; but I will say that taking her School for Amazing Kids, Calera made that transition just a little more easier than it would normally be. I remember the first day, her lead teacher, Crystal, welcomed us with a very warm greeting and immediately took my daughter for a first time bonding moment. At that moment, I knew I had made the right choice in child care for my daughter.\n\nThe staff is so friendly and they speak every time you see one of them, even if they are not the teacher of your child. They really love on the children and it reflects heavily with my daughter when I can drop her off with no hesitation from her. She happily goes to the teachers and I feel like they really care for her and her well-being. They are as well caring of the parents, by offering conversation every time you are in their presence. This is the kind of relationship that you want when you entrust your child with a child care facility for more hours than they are at home with you.  This was the most important thing to me when I was looking for child care and I know I found it in School for Amazing Kids, Calera.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105788619074884303182", "name": "Kevin Taylor", "time": 1509738718438, "rating": 5.0, "text": "I really like the School for Amazing Kids located in Calera. The school is super accessible and conveniently located for parents that have to work. It is a very good value for the money that you pay and what you get out of it. My wife and I are paying less here for my two children to go to this school where they LEARN than our previous childcare arrangements. Best of all they have a full school schedule. What I mean by that is I don't have to take off from work to watch my kids because they are closed.\n\nOn top of ALL that value the school is great because of what my children have learned and how they have developed academically. I know they will be ready for the next step. The staff is great, my kids and myself enjoy all the teachers; especially Mr. Jonathan.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104388354297591062318", "name": "Cory French", "time": 1500384762154, "rating": 5.0, "text": "Our family is very pleased with School for Amazing Kids in Calera, Al. The location is excellent, right off 65, and is very convenient for dropping off before and after work.  The teachers are awesome and they really take the time to work with each child.  Our child has transitioned from the bottle to a sippy cup/table food and has started walking with ease, because the teachers have really invested time with her.  We highly recommend School For Amazing Kids.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "100494866314545458784", "name": "Kendall Collum", "time": 1444864935884, "rating": 5.0, "text": "Morningstar is an awesome place to send your kids to daycare. Within a week, my son (3 years old) was able to recognize words and letters and my daughter (1 year old) knows where her eyes, mouth, nose, and ears are. Every staff member is genuinely concerned with the children there and it shows! I would recommend Morningstar to anyone!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "114237533627667812775", "name": "SoulofBleuz", "time": 1433296444168, "rating": 5.0, "text": "My husband and I absolutely love Shepherd's Promise. Our son was 7 months old when he started at the daycare. Needless to say, we were nervous because his grandmother kept him for us during the day while we worked. Little did we know, our precious bundle of joy warmed right up to his teachers as well as his fellow classmates.\n\nSince attending Shepherd's Promise, our baby has become so independent. It is hard to keep up with him! The teachers are so nurturing which made the transition for our son easy. We highly recommend this great daycare to new parents. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "101138586749935998975", "name": "E Atkinson", "time": 1423797477688, "rating": 5.0, "text": "Morningstar is just what we were looking for, close to home and a clean and safe environment for our child. They offer many great programs and activities during and after business hours such as parent lunches and parents' night out. Who doesn't need that?? My child loves getting up to go to school and see his friends. Walking into his room, there is a list of what they are learning for the week, which even includes a bible verse. I also love when my child's artwork gets to come home with us. It is those things that I will always cherish. Thank you Morningstar for loving my child as much as I do.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "118190968104715445350", "name": "Katie Allen", "time": 1433438983209, "rating": 5.0, "text": "I absolutely LOVE this child care facility or should I say SCHOOL. I bounced my son around for a while from daycare to daycare and the \"teachers\" weren't taking time with him, he wasn't learning what he needed, wasn't getting the attention he needed and I was about to throw my hands up until I found Morning Star. It is perfect, he gets up in the mornings ready to go see his friends and teachers ( which he never ever use to do ) and he actually had a struggle with his colors for a while and once he got into a classroom at morning star with his amazing teachers he just stared coming home each day, learning something new and he was so excited and I am so proud of him he now comes home and knows his colors! So thank you to his awesome teachers and such a fun learning facility for my son!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104111556044705391971", "name": "Jetta Johnson", "time": 1406303337150, "rating": 5.0, "text": "We love Morningstar!  My child has been there since she was 8 weeks and we've had nothing but positive experiences in 4 1/2 years. I can't imagine going anywhere else.  The teachers are great and is nice that most of the children have been there as long as we have.  We've basically all grown up together like family.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105510942630776563837", "name": "Amy Lynn Butler", "time": 1407007894478, "rating": 5.0, "text": "My 2 ½ year old toddler is ready to take on the world! And Morningstar Daycare supports his desire for discovery and need for independence, while also providing a sense of safety and security.\nIn his present class, the teachers actively partner with the parents to help your child learn important independent life skills, such as potty training and hand washing.\n\nI really like the balance they have with teaching: Child-Initiated: the children play and explore throughout their day, and they develop an understanding of their world. And Teacher-Guided: Teachers use a developmentally appropriate instructional framework to help stretch children’s minds by demonstrating, asking questions, encouraging and guiding.\n\nMy child has been going to Morning Star for over 1 1/2 years. I love it that every day he comes home with a new art project he did, or singing new song, sharing something new he’s learned.  I know at Morningstar my child is learning and thriving, happy and safe.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "113314655421421145470", "name": "Brooke O'Brien", "time": 1423756967489, "rating": 4.0, "text": "Our first child started with Morningstar when she was 9 months old.  I was a new mom and was not excited about leaving my child with strangers for 10 hours a day.  In addition, my family is not religious, and I'm an atheist, so I trying to find a secular daycare in my area was next to impossible.  We looked at multiple facilities and ultimately settled on Morningstar.  While I'm not keen about the religious instruction (biblical stories and praying at meals), the facility is always clean and the teachers are well mannered, and trained in early childhood development.   The facilities are kept up-to-date with new equipment and decor.  The directors are always happy to listen to my latest worry or concern about my daughter, her behavior, or the latest news of the day.  Parents are allowed to visit for meals and their adoption of a \"parent's night out\" is a treat my husband and I look forward to each month.\n\nMy daughter is now 3 and the teachers understand when to introduce structured discipline.  My husband and I have started using the same techniques at home so that my daughter can have consistency and a better understanding of what's right and wrong.  When my son recently joined our family, there was no question where he would go.\n\nWe have had incidents in the past of biting, falls, sickness, etc. and the staff were always prompt in notifying me and informing me of any additional needs they have.  I am completely at ease with my kids being in their care and know that they love them as much as I do.\n\nI would like to see more teachers in the classrooms, but they are following DHR guidelines for adult/child ratios.  However, I understand what that would mean for tuition rates.\n\nMy daughter is well cared for, well mannered, well educated, and well socialized (as a 3 year old can be).  And for that, I'm willing to put up with some minor annoyances about religion from time to time.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "117227606683738909208", "name": "Peggy Huckabaa", "time": 1423837483195, "rating": 5.0, "text": "My daughter started at Morningstar Child Care when she was 9 months old. She loved going to school, playing with her friends, and seeing her teachers. She graduated from 4K with a beautiful ceremony that my grandparents still talk about today. Since they are currently in their 80's, they will not have the opportunity to see her graduate from High School. It was a moment we will all treasure.\n\nMy daughter still stays in touch with some of her friends she made at Morningstar. She is now a First grader. Her Kindergarten and First Grade teachers have made comments on how advanced she is compared to some students who did not go to Morningstar. Her reading and math levels are above the expectation for each semester and in some circumstances even for the year. Morninstar gave her a great start to her education. We are extremely happy with the love, care, and learning Morningstar has given her.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104464780234480036300", "name": "Diana Sprayberry", "time": 1423774093871, "rating": 5.0, "text": "I absolutely love this daycare.  My child has been attending Morning Star since he was 2.  If I have ever had any issues they have always been very helpful and resolve the situation. I would recommend this daycare to anyone..", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "108384461223185409576", "name": "Kelli Kirk", "time": 1406042803582, "rating": 5.0, "text": "Both of my daughters attended Morningstar for a combined 3 years and I can't say enough about the teachers. My girls have learned so much in their care. My oldest has excelled in kindergarten this year and I have the amazing teachers at Morningstar to thank for that.\n\nIf you're looking for excellent childcare in a warm and caring environment, look no further. Hands down, the best childcare center around.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "117819684952928400096", "name": "Crystal Evans", "time": 1448249252576, "rating": 5.0, "text": "From a dads point of view\nI wanted a place that was safe, close to home and that would teach him. Our son is being cared for by teachers that truly care about him. I like the daily sheet that's sent home each day about his day. I appreciate that the teachers are actually teaching and not just watching him. KJ is\nlearning a lot at Morningstar and I feel that it will pay off when he starts grade school by attending Morningstar. We also have a daughter who's now in third grade who attended Morningstar and she's an \"A\" student... # school forAMAZINGKIDS", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "116859668458003607073", "name": "Abby Johnson", "time": 1423766585943, "rating": 5.0, "text": "Morningstar is a wonderful daycare.  I have 1 boy that currently attends Morningstar and one who left 4k in August to start Kindergarten.  The staff does a great job at not only teaching the children, but making it FUN!  Because of the wonderful staff in 4K, my kindergartener is way ahead in his class and is currently reading on a 1st/2nd grade level. I would and have recommended Morningstar to anyone who is looking for not just a daycare, but a preschool for their child.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "117199467805225833307", "name": "Mom of One", "time": 1407273809998, "rating": 5.0, "text": "My little tike has been attending Morningstar for nine months. To say that he loves it is an understatement. Each morning he wakes up saying \"go school\" and is disappointment when it is not a school day. When he sees the building he starts singing \"school, school, school, yeah!\" He loves going to \"school\" and we love that!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "104111481299569271122", "name": "Erica Jones", "time": 1406220287543, "rating": 5.0, "text": "I would absolutely recommend Morningstar Child Care to any parent!\n\nI am a single, working mommy of three boys. My life is a whirlwind of church, work, sports, and - of course - the never-ending list of household tasks.  After unsuccessfully trying a few other centers, I was disheartened that I couldn't find a center that my youngest would love to attend...\n\nMorningstar has hands-down become that center!!  Cason (who used to cry every morning for an hour at other centers) eagerly waits by the door at our house for ME to get ready to leave in the morning.  He LOVES his teacher AND his new friends.\n\nI also ADORE the paintings and crafts that he brings home.  He has mastered his colors and enthusiastically talks the entire way home about the things that he has done that day!  I love Morningstar, and I feel confident that you will too!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "105560449602812627301", "name": "Douglas Stevenson", "time": 1507332605080, "rating": 1.0, "text": "The employees at this daycare would rather try to sweep issues under the rug than deal with them. Our daughter was bitten by another child five times in the four months since moving into the infant D classroom. In early September it happened twice in one week, and that's when we finally decided to have a meeting with the office. We met with the assistant director Jonathan, and he tried to tell us that it is normal behavior and that none of the bites were aggressive. He also informed us that the daycare has no official policy when it comes to biting, other than simply informing the parents of all children involved that it happened, and perhaps additional meetings if it becomes an \"issue\". On Monday, October 2nd, our daughter was bitten again this time on the face. The teacher who was working the room that day informed my wife that the same boy who had bitten my daughter that day had also bitten two other children, and that it had been a consistent problem with this one child and the office and his parents knew about it but refused to take any real action. I had a meeting with the assistant director Jonathan the next morning, where he informed me that two of the bites were \"not aggressive \" because the children that were bitten we're trying to take a toy away. Later in the same conversation, he backtracked and claimed that there were not three bites in one day, and the information we were given was incorrect . Later that same day, my wife met with the director Brittany who informed her that there actually WERE three bites in one day, and that Jonathan knew about that and she's not sure why he would have told me that there weren't.\nWe understand that biting is an issue that is going to arise at most daycares, but we want to know that action will be taken when it becomes a clear and present problem. I also don't appreciate it when somebody looks me in the eye and lies to me. Parents trust daycares with the safety of their child, and they deserve to know what's going on.", "pics": null, "resp": {"time": 1507649052509, "text": "We sincerely regret that you and your family had a negative experience at School for Amazing Kids, Calera. As caretakers, we constantly strive to become more nurturing to children in our care and to better communicate with parents. Unfortunately, biting is common among babies and toddlers and we try our best to stay aware of when it happens and treat all children involved with the proper care. However, we always have room to improve. We appreciate your feedback and resolve to look into this matter more closely."}, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "116853981651728870176", "name": "Liz Walker", "time": 1345899544333, "rating": 5.0, "text": "When I asked my two-year-old this summer if he wanted to stay home and go to the pool with mommy or go to \"school\" (at Morningstar), he said, \"school.\"  I think that explains it all!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "111143771922235603499", "name": "Olivia Attical", "time": 1423787341182, "rating": 5.0, "text": "This is the best child care facility in Calera, AL in my opinion my child has grown to love the kids and the staff. The facility is very clean and neat and actually looks like a school. The atmosphere is amazing they make you feel so welcome. They provide a very nutritious meals which includes breakfast, lunch and snack so you don't have to worry about providing any meals. Another important part about that is that it doesn't cost any extra just for the meal that is all included in the tuition. The curriculum that they are teaching I feel is awesome to help your child adjust to school. My two year old has learned so much in the past 5 weeks that I was amazed. All the hard work and dedication that those teachers put into their jobs really shows when you interact with your child on a daily basis.", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "115624620000957645011", "name": "Erica Arnold", "time": 1423761180420, "rating": 5.0, "text": "When I think about quality child care, one of the first things that come to mind is that I don’t want to have to sacrifice good care for my child(ren) at the sake of cost. And I was so happy when I realized that would not be the case at Morningstar! My children and I love the daycare employees, and I love that they get excellent care on a great budget.  Their prices are so reasonable, and this is the only daycare I have ever been in contact with that offers a military discount to families! That is AMAZING! But also with quality care, that is cost-reasonable, I worried about location. Morningstar’s location is great for parents who commute because it is right off the interstate. It is very easy to drop off my child and get right on the interstate to commute to work in the mornings.  And the facility is always How great that they support our troops in that way! As a military family, we couldn’t appreciate that more!\n\nBut also with quality care, that is cost-reasonable, I worried about location. Morningstar’s location is great for parents who commute because it is right off the interstate. It is very easy to drop off my child and get right on the interstate to commute to work in the mornings.  And the facility is always kept clean. The outdoor grounds are nice and there is a very nice playground for the children!", "pics": null, "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "113060076254201156521", "name": "Kurt de klerck", "time": 1509738021515, "rating": 5.0, "text": "We were blessed to find school for amazing kids in calera when we moved to shelby county. Joshua has been attending sfak calera for almost 5 years !! now and still ,every day ,are we amazed about how much our son knows already for his age. he speaks very well, he behaves, he knows how to write and work with numbers already ! knows songs, days of the week etc... all this can only be achieved by staying busy with the kids . He likes to go to sfak calera, he does soccer, a guitar man comes over once a week to play songs, the have festivals and career days etc..\nif you have the opportunity to have your child taken care off in a daycare, sfak calera is the best place to be !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOsXxwEtfohb5Knwedw0afGrRqUUF2LQBC6Yna0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "110464883060595520891", "name": "Shirley Sanderson", "time": 1505677440349, "rating": 1.0, "text": "Saw roaches and mice droppings in kitchen and the kids milk being left out too long", "pics": null, "resp": {"time": 1507649290556, "text": "Going back to December of 2016 we have scored no less than 99 on all health inspections. Our last inspection was conducted in June of 2017 in which we scored 100. If you have legitimate concerns about the cleanliness of our facilities we are happy to provide this documentation and speak with you in detail about this matter. Please call our main office at 205-620-1725."}, "gmap_id": "0x88892facbd2752ef:0xdd7c44690c64d916"}
{"user_id": "108779550204122059582", "name": "Kelsey Sherbert", "time": 1465009786696, "rating": 5.0, "text": "Great teachers who truly love the children they care for! Very clean and have had no problems", "pics": null, "resp": null, "gmap_id": "0x8889bfd3eff7ecbd:0xb01e44e4efc48474"}
{"user_id": "105097048826536648987", "name": "Lia Brady", "time": 1582813711722, "rating": 1.0, "text": "A little floored by my initial experience with this daycare. My daughter does not go here and I have heard wonderful things about this place. Unfortunately, that was not my experience.\n\nWhen I walked in to have a \"meet the teacher\", the AD was grumpy and not very helpful. I ended up speaking to a teacher that was passing by. Looked at the classroom - wasn't what I was used to which is fine. It wasn't the worst, just not the organized, vibrant environment that I'm used to at her previous school. There is a lot that could be said about the aesthetics. When the director got there and I walked up to speak with her, she had a big smile and was very warm and welcoming. When I started asking questions about the program and mentioned that my daughter is currently at Heritage, she immediately crossed her arms and leaned back in a defensive stance. It was incredibly awkward trying to ask questions as an inquiring parent (which is normal when your child is starting a new school) because she seemed irritated that I was questioning anything. When I asked about curriculum for the class my daughter would've been enrolled in, she said verbatim, \"The teacher hasn't been able to work much on that because some of our parents need better parenting skills and a lot of the kids weren't potty trained when they should've been, so the teacher had to work on that instead.\" Excuse me, what? Did you just bash the parents to a potential new parent at your school? Nonetheless, I thanked them for the information and left. Not once was I rude. I kept my composure during that entire (strange) ordeal.\n\nI left a little perplexed and stunned and called my husband letting him know my experience. STILL, because I had heard such great things and wanted to give them a shot, I sent an email the next day letting them know we would like to start Monday. The director emailed back and asked me to call her, so I did. While on the phone, she basically told me she didn't want my negativity at the school (with a very chipper tone) and that she wanted her parents to be happy to bring their kids there. Again, 100% floored that she's saying this as I gave no indication that I was unhappy. I then tell her my experience when I met them and how she talked bad about other parents as my FIRST IMPRESSION. After that, she was silent on the phone for an awkward amount of time and finally said \"I'm sorry you felt that way and you're right, we could've handled that better...but I don't think it will be a good fit. I've never said that, but sorry.\" And I just said okay thank you, have a good day and hung up.\n\nI'm sure this is a great program (if you're okay with a 'play' daycare instead of one based on curriculum), but the way I was treated when I walked in is causing me to leave a bad review. I honestly can't tell you if I've ever left a bad review on anything before, but this was worth the write. I'm sure the kids are treated with love and respect, but the fact that she basically told me I couldn't enroll in her school had me dumbfounded. Still scratching my head wondering why I was treated this way after being so kind to them. Use your best judgement when enrolling! I don't know whether to make heads or tails of it.", "pics": null, "resp": null, "gmap_id": "0x88890ce34fa0fe1d:0xf0338f4b3eb352bf"}
{"user_id": "108499737291937337171", "name": "Kelly Ratcliff", "time": 1513787306617, "rating": 5.0, "text": "Absolutely ecstatic that I found this place!  My baby boy LOVES his teachers and I am VERY pleased that he has a smiling face every day I come in there.  Thank you Tena and all of the staff for taking him in and treating him as your own!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMhb2mzZnPbfBHjG-e3FJFG6w4kNKgEY2PrR8QJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889261022d728685:0xbd2a9d965a6091a0"}
{"user_id": "109536671827021143223", "name": "Jeremy Mcnelley", "time": 1547638819004, "rating": 5.0, "text": "Awesome place with amazing staff. They welcome me and my son as soon as we walk in. My son loves the people and and atmosphere there. He calls it \"school\" not daycare lol.\nIf you are interested in a daycare this one is definitely one to look into.", "pics": null, "resp": null, "gmap_id": "0x889261022d728685:0xbd2a9d965a6091a0"}
{"user_id": "102038792781115204046", "name": "Arica Shetka", "time": 1522188869925, "rating": 5.0, "text": "Beautiful kid friendly set up they have going on. Amazing staff. Quality toys and equipment", "pics": null, "resp": null, "gmap_id": "0x889261022d728685:0xbd2a9d965a6091a0"}
{"user_id": "105994487291364532530", "name": "Bailey Godette", "time": 1604992582724, "rating": 5.0, "text": "I am admittedly a very difficult parent to please; I expect the very best when it comes to my child. My child has learned more than I ever could have imagined at Vinehouse and we love her teachers and Ms. K so much that they feel like a part of our family. Her classroom is always immaculately clean and I never worry knowing she is genuinely loved while I'm gone. We are so in love with this school!!!!!!", "pics": null, "resp": {"time": 1605019723037, "text": "Mrs. Bailey! Thank you so much for giving us the opportunity to teach, love, and nature your beautiful child. You all are family to us and we love you all so much."}, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "108037861533023052633", "name": "Maritza U", "time": 1596423076025, "rating": 5.0, "text": "Clean & presentable facility!\nFriendly director/owner & staff!\nPut all my feelings at ease knowing I picked the right daycare for my child! :)\nHighly recommended!!", "pics": null, "resp": null, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "100111218157992860193", "name": "K O", "time": 1560261186522, "rating": 5.0, "text": "The staff is all uniformed and nice. The director is well-versed with child development through education and experience. I toured the daycare on yesterday with my husband and two little ones--we loved it! My favorite room is the infant room but I loved all the room/age groups. The daycare is super clean, organized and neat. Many crunchy/natural mothers would love the daycare just as much as I did.", "pics": null, "resp": null, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "116065217473010773015", "name": "Hylesha Dill", "time": 1604593675455, "rating": 5.0, "text": "The director and her team are all so amazing.", "pics": null, "resp": {"time": 1604610254135, "text": "Thank you so much Mrs. Hylesha! We adore your sweet family and we are so blessed to have you all here with us."}, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "107267648975319495692", "name": "LaQueena Compere", "time": 1553054384661, "rating": 5.0, "text": "Ms. K and her staff are exceptional! They don't  just watch your children, they invest in your children. They care for your children and they protect your children. This daycare is awesome and the teacher's truly love children! They have many programs that compliment the curriculum for the children. There is Soccer Shots, Zumbini, Mother goose who reads to the children and Spanish lessons. Vinehouse is growing and you truly will be blessed if your child is there.", "pics": null, "resp": null, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "108427914683267385550", "name": "Kelley Pesnell Conner", "time": 1546972771571, "rating": 5.0, "text": "Wonderful place. They have an educational program, they are currently doing baby zumba. They do outdoor time when weather permits and they care for my child as if she was their own.", "pics": null, "resp": null, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "114875150070584322457", "name": "Stacy Serrano", "time": 1525584360243, "rating": 5.0, "text": "After being traumatized by the news and social media when it came to daycares it was really really hard to choose a affordable/trustworthy daycare! 🤔😥 it became a very stressful month when I found out I needed to look for a daycare because family babysitting wasn’t going to be an option anymore 😰😥😱 I toured about 4 different daycares, called several (which just talking to them over the phone was enough) to say this isn’t the place. Location, security, cleanliness, affordability and most importantly parents hunch about the daycares made me think is this the place I want to bring my baby 5 days a week?\n\nThat’s when I came across Vinehouse Nursery, thanks to a dear friend (Fransico). I was already thinking this is going to be like all the other places I’ve gone to before. But surprise surprise! 😱😱 As soon as you knock on the door the Director comes to greet you with a huge smile on her face. She answers any questions you may have and offers to give you a tour at that moment (if you have time).\n\nShe took me through the WHOLE building, (bathrooms/break rooms/kitchen/I mean every room the nursery has. At that moment my heart felt a HUGE relief! Everyone is super friendly/bubbly, cleanness is remarkable, security, organization and ITS AFFORDABLE! My mom sensors were yelling YES! YES! YES! THIS IS PERFECT! Just what I was looking for!", "pics": null, "resp": null, "gmap_id": "0x888928aa088c1d51:0x8f0e0c57bd2f0f8d"}
{"user_id": "107850006429978510160", "name": "Caitlin", "time": 1612896938200, "rating": 5.0, "text": "I was very hesitant to put my kids in daycare after spending most of their lives with a private caregiver. My younger sister went to Angie’s when she was younger and loved it. Due to a last minute crisis, my kids had to start daycare within 3 business days. Angie graciously took both of them in. Now 7 months later they both love going to daycare. Angie remembers all of her kids, no matter how long it’s been since she’s seen them. The teachers there also learn each child’s habits. They know my son always runs to Ms. Angie every morning and loves playing in the big kid room. They know my daughter has to give everyone a hug and kiss before she leaves for the day. 10000% the best place I could’ve picked.", "pics": null, "resp": null, "gmap_id": "0x8862a09111106589:0x583d8eb6c8b3a895"}
{"user_id": "112269754779127506476", "name": "Chealsee Porchowsky", "time": 1620460466795, "rating": 1.0, "text": "Please don’t send your kids there.", "pics": null, "resp": null, "gmap_id": "0x8862a09111106589:0x583d8eb6c8b3a895"}
{"user_id": "105931098807180447119", "name": "Amanda Chaney", "time": 1528770464860, "rating": 5.0, "text": "My 3 yr old daughter absolutely loves it. They are really good with all the kids and Mrs.Angie has a heart of gold and treats all of the kids like her own. She has learned so much just after a month of being there and is excited every morning to get up and go.", "pics": null, "resp": null, "gmap_id": "0x8862a09111106589:0x583d8eb6c8b3a895"}
{"user_id": "112115899016908084261", "name": "Jessica Gemnell", "time": 1527181934511, "rating": 5.0, "text": "They are so sweet and good with the kids. My son loves it. The pre-k class does a good job working with them and teaching them my son knew how to spell his name after just a day or two after going.", "pics": null, "resp": null, "gmap_id": "0x8862a09111106589:0x583d8eb6c8b3a895"}
{"user_id": "106422980440795594608", "name": "Paisley Flannagin", "time": 1600196648148, "rating": 1.0, "text": "i hate this place they were so rude to me while i was there they are mean please don't let your kids go there", "pics": null, "resp": null, "gmap_id": "0x8862a09111106589:0x583d8eb6c8b3a895"}
{"user_id": "118264947672003681055", "name": "Nise 2You", "time": 1470500303669, "rating": 1.0, "text": "Statements made by the receptionist who facilitated the tour, we're insulting and personally hurtful. Her visual observations should be kept to herself and shared with the staff as need to knows for the betterment of my child versus choosing to use an open forum of the admitting office in front of others. Not to mention her observation is not valued or wanted, seeing that she does not hold not one certification in childcare development.", "pics": null, "resp": null, "gmap_id": "0x8888de288808b555:0x19b0a0b6063e9048"}
{"user_id": "107797963116797806453", "name": "Rayuna", "time": 1497584187880, "rating": 5.0, "text": "Great place to take kids as an after school care.", "pics": null, "resp": null, "gmap_id": "0x8888de288808b555:0x19b0a0b6063e9048"}
{"user_id": "107548778246489069221", "name": "123 Powell", "time": 1618424330459, "rating": 5.0, "text": "We love sending our 4 month old son to Heritage Preschool. Being a first time mom with a newborn, my husband and I searched diligently to find the best fit for us and our family. After visiting several daycares, we knew immediately after we visited that Heritage was perfect for us.\nWe always have an amazing experience with everyone we ever encounter in all departments.\nSo I believe their staff all share the same vision.\nI am confident and at ease when I drop my son off, because I truly believe he is loved and well taken care of... what more could a mom want.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103857139478884580385", "name": "Ali Wesson", "time": 1618339139885, "rating": 5.0, "text": "My two babies who are now 2 and 4 have been at Heritage since the infant room. They are the only facility we would ever consider. The staff is amazing, the facility is top notch. Not to mention the curriculum. I would recommend them to anyone I know. Thank you Heritage for taking such great care of my babies!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "112630661301553325517", "name": "Amy Barnett", "time": 1618364783739, "rating": 5.0, "text": "Heritage\n\nWe started our journey with Heritage amongst a pandemic. Around us the world lived in fear of getting sick and hid behind masks and shelter in place orders. As we started to venture out we knew we needed to put our daughter in a place that was welcoming, caring, God fearing, and safe. When we walk through the doors at Heritage there is no way to not feel this comfort. We are greeted each morning by the office staff with warm hello’s in a clean and welcoming atmosphere. As you transition throughout the building it is impossible to not feel welcome and see how safe and cared for the children are. The entire staff always goes out of their way to help and ensure your child is getting the utmost care. If you are on the fence about a day care let me help you make the decision. Heritage of Pelham is hands down the best daycare in our area. We are blessed to have them help us raise both of our girls.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "108205421969520103869", "name": "Samantha P", "time": 1618543296873, "rating": 5.0, "text": "Heritage Pelham is the best!!! All the teachers we’ve had have all been truly precious people and always taken great care of our little one!! They love the kiddos so much and make each one feel special. I’m so grateful for all they do and that we are apart of the Heritage family. I always recommend them and tell everyone how happy we are with them!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "108403785627861765743", "name": "Kate Waudby", "time": 1618352238115, "rating": 5.0, "text": "This is the best preschool around town! Every staff member is so kind and welcoming. The second time I ever walked through the door with my baby, they knew him by name. The rooms are very well taken care of and exceptionally clean. I would definitely recommend it to anyone and everyone looking for a preschool for their child.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "110396967236934452510", "name": "Jessica Porterfield", "time": 1618409783804, "rating": 5.0, "text": "We moved our son (3 yo) to Heritage from a different local daycare a year ago, and are so happy with our decision. We have been so impressed with the love they show him every day, and the education that he receives. I can trust that he is in good hands for the 9+ hrs that I am away from him at work. Heritage is a great school with great office staff and teachers!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102575521635550231267", "name": "Alison Howell Steineker", "time": 1618323226772, "rating": 5.0, "text": "We love Heritage Preschool.  It has been a great experience for our two year old.  The management and teachers are top notch.  The facility is beautiful and our little girl loves it there. I would highly recommend to other parents.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103992992988265627864", "name": "Christina Dennis", "time": 1618430091860, "rating": 5.0, "text": "We went through a few preschools until we found Heritage. Our little girl was adopted, and the other schools we tried were not willing to work with us on our daughter's needs as she became adjusted to a new culture. We finally tried Heritage Preschool of Pelham, and were blown away. The staff is amazing, and assured us that they would work with our child as she became accustomed to a new culture, new school, and any past traumas she had dealt with. They have done just that! Our daughter now wakes up excited to go to \"school\" and jumps out of bed. She immediately talks about her friends, her teachers, and runs in the door with excitement upon arrival. We can also tell that Heritage puts a ton of effort into teaching our little one, as her speech has highly improved. She's learning so much, and we couldn't be more grateful for the staff at Heritage! Thank you for giving us the confidence to leave our girl in your hands, and for showing her that she is in a safe place to be free to learn and discover new things! We couldn't ask for any better!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "106754749569257705291", "name": "Katie Haggard", "time": 1618436660938, "rating": 5.0, "text": "I have such a piece of mind dropping my kids off everyday knowing they are learning, socializing, and having fun. The best part is I know they are being well taken care of and I do not have to worry! I would 100% recommend this school.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "113051054236845780263", "name": "Peyton Penfield", "time": 1618586989661, "rating": 5.0, "text": "We are so excited to have joined the Heritage family. We had a difficult time with our 2 y/o daughter at her last school and spent a lot of time trying to figure out if it was just the terrible two’s or if she just wasn’t getting enough out of the school. We started to seek out other schools and looked at a few in the area and our heart gravitated towards Heritage. I believe God led us to these wonderful people and since joining our girl has gone 180 from where she was. She is engaged all day, is happier when she comes home, her mood is fun and spunky, her language is exploding and the teachers there truly love and care for her. From the moment you walk in you are greeted with joy from everyone. I have much thanks and am so grateful for the amazing staff at Heritage and look forward to watching our girl grow with them.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "112112577322382546613", "name": "Josh Buchanan", "time": 1629147885063, "rating": 1.0, "text": "Larry Vann needs to go. Also, they'll occasionally give away a months tuition for a five star review so I'm curious how many of these \"reviews\" are legitimate.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105189177001833809618", "name": "Shannon Davis White", "time": 1618539828610, "rating": 5.0, "text": "Heritage is such a great place. It’s more than a daycare/preschool they are a part of our family helping to mold and shape our kids. The best choice you can make is enrolling your children here.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109057022824028875632", "name": "Oreal Hixon", "time": 1618510926300, "rating": 5.0, "text": "My son has attended this school since he was 6 months old and now he is in kindergarten.  He has learned so much and received great care. The teachers and front staff are just like family.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "106955693202899981180", "name": "April Hubbard", "time": 1603376891774, "rating": 5.0, "text": "Heritage Preschools is a wonderful place to send your children! 2 of my children have gone through the whole program from 6 weeks to 6 years and my 6 month old is currently attending. The quality of care they give the children is so high. We have made some really good friends there that we still talk to even though they aged out of Heritage. My oldest 2 were academically ready for school when they left Heritage. The staff is so loving and they care about the children and their families. I highly recommend Heritage Preschools for your little ones!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "115456164234946425502", "name": "Miranda McClanahan", "time": 1618532823793, "rating": 5.0, "text": "When we started looking for childcare for our baby boy, Heritage easily made it on our list of places to look into. And then, they blew us away and easily became the very clear choice for us! After years of investigating abuse and neglect (including daycare settings), I have extremely high expectations when it comes to childcare. I was not going to send my child just anywhere. I am also super strict when it comes to safe sleep practices. Like many parents, the thought of leaving my child with someone else gave me a lot of anxiety to say the least. However, I have had so much peace knowing my child is cared for by the very best! I do not have to worry about his safety, and his teachers have proven time and time again how much they care for him and love their jobs. My son has been in the Infant II class with Charla, Suzy, and Mykah. I already know how hard it’s going to be when he’s ready to move up to the next class because these teachers are so wonderful! He has learned and developed so much. He loves going to see his teachers and friends each day! They keep me updated on him, and they love sharing about his day!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "111720728292359326685", "name": "Ashley Murry", "time": 1578436226133, "rating": 5.0, "text": "The Heritage is always spotless and the teachers are always very pleasant. My daughter has attended The Heritage Preschool of Pelham since she was 5 months and she is now 3 and still loves it to this day .  Every morning when I drop her off she greets her teachers and classmates with a smile, which makes it a lot easier to feel comfortable going to work.  I feel this way because the Director and Teachers are more like family than anything else .", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107280509047977737572", "name": "Rachel Seaborn", "time": 1579023875706, "rating": 5.0, "text": "I highly recommend Heritage Preschools. We’ve had a great experience. It’s exceptionally clean and well kept. The teachers and staff are supportive, friendly and take great care of the children. We transferred our daughter from another daycare and their structure, curriculum, and atmosphere has been wonderful! We're thankful for their Christ-centered curriculum and hearts for the kids there. It really shows. Our daughter has just blossomed and learning so much at Heritage!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "110787787163769028758", "name": "Beth Simpson", "time": 1578952187302, "rating": 5.0, "text": "Words can't describe the LOVE we feel at Heritage! Our two girls are loved so much and have learned so much from their teachers! I never worry about the safety of our children while at work because I know they are in the best of care. They truly love the kids like they are their own!!\nAnd when your child comes home and tells you she can do all things through God you know you are sending her to the right place!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105688356547102328377", "name": "Lori Cannady", "time": 1576764981971, "rating": 5.0, "text": "My 2 sons go to heritage in Pelham and I cannot think of anything negative to say about this place. They are so kind and always make sure we’re happy. The teachers are so caring and love on my babies like their own! The admin go above and beyond to help with anything we need. Through thick and thin, this school has always put us first! And the building is beautiful! Highly recommend this location.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "114054417791963527329", "name": "David and Katy Bush", "time": 1578434083004, "rating": 5.0, "text": "We have had a wonderful experience! Our boys are well loved and encouraged to be their best. I love that Ms Doris keeps me in the loop when my son has a tough day so we can help him when he's struggling. I feel like it's a team effort. The admin staff is so welcoming and Larkin is wonderful. I cant speak highly enough of the experience we have had so far!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102242513818275068683", "name": "John Haggard", "time": 1578442446718, "rating": 5.0, "text": "We have had a great experience with Heritage. Our son used to ask not to have to go to school but now that he’s at Heritage he gets excited for school in the morning. He thrives under the structure, discipline,\nand guidance of his teachers. His teachers really care about him and truly want what’s best for him.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "114474255352478065466", "name": "Gina Borgosz", "time": 1578438376833, "rating": 5.0, "text": "I have nothing but great things to say about my experience at Heritage! We’ve been there for a year and I feel that my daughter has grown and learned so much, she loves to be around people, and is so loved by her sweet teachers! The administration and office staff are very friendly and keep me informed weekly. This was the first daycare we toured, and we looked at two others after, but nothing compared to Heritage! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107991444761873434501", "name": "Mary Gray", "time": 1576704588910, "rating": 5.0, "text": "We LOVE Heritage!  The facility is clean and beautiful, their infant care is amazing, and their curriculum will give your little ones a strong foundation for their early learning years.  They are far more than just a daycare and truly care about the WHOLE family!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "100807575411967493142", "name": "M. Crocker", "time": 1577365575831, "rating": 5.0, "text": "Amazing staff! The teachers genuinely care for their students and the admin team goes above and beyond every day, not just for the students but for the parents and the staff as well. The curriculum is far more than I expected, they actually teach the students how to read so they are more than prepared for elementary school.  Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105097048826536648987", "name": "Lia Brady", "time": 1576702319792, "rating": 5.0, "text": "Great management and teachers - all of the Heritage locations far exceed any expectation you could ever have about a preschool. I would honestly never take my child anywhere else. Once you have the best, it's hard to go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "115944271822776124180", "name": "Colby Nicholson", "time": 1578433811128, "rating": 5.0, "text": "Fantastic Preschool! Our daughter has been going here for a little over a year now. The teachers and staff are very friendly and take exceptional care of the kids. You can tell that they really care. The facility is always very clean which is a BIG deal to us and I am sure very hard to do with so many children. The Godly manner in which they teach the kids and run the preschool is unmatched and very hard to find anywhere else. Our daughter sang the \"God Our Father\" prayer song that they sing everyday before having a tea party with her toys the other day and it melted our hearts. That is the kind of stuff that you want your kids learning from the people that they spend the majority of time with. We love Heritage!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103704608010324281996", "name": "Lakenya Wilson", "time": 1576703926207, "rating": 5.0, "text": "There is no where I would rather my children attend. We have some of the best teachers, and they are all CPR certified (A PLUS) . The management is phenomenal! The facility is spotless, and safe. We love Heritage!!!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105381839324171587080", "name": "Ali Wesson", "time": 1578451570077, "rating": 5.0, "text": "My children have been with them since they were infants. We love the school and the staff. The teachers truly care about their students and it shows. They have a great facility and an excellent curriculum.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103264253202825430321", "name": "Chibi Maruko", "time": 1578684207289, "rating": 5.0, "text": "Both of my kids like the Heritage preschool. We moved our kids from another daycare and it was a big decision to make for us. Now, we are glad we made that decision. Our oldest son is learning so much stuff from school and I can easily see that because he tells me what he did at school everyday. Sometimes, he even gives me a little lecture using his small white board how to write letters and numbers (his name, his brother's name, blends...etc). Our young one shows a big smile and looks so happy when he sees his teacher every morning which makes me happy and feel so relief as well.  And I have to mention that the facility is really clean.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105299005113423680197", "name": "Jessica Howland", "time": 1578625230159, "rating": 5.0, "text": "Our two children have been at Heritage for the past year and a half. We moved them there from another center, and we are so glad that we did. They love it there. They have had great teachers, and they have both learned so much. It is such a relief to trust the people who take care of your children and not have to worry about them all day. We can’t recommend Heritage enough!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "108771880478844710722", "name": "Melody Jordan", "time": 1578945266994, "rating": 5.0, "text": "My son (2.5) attended a home daycare and didn’t start until he was 4 months old. I was a little hesitant about our daughter starting at a “real” daycare at 8 weeks old.  Ms. Rachel and Ms. Kim are amazing with  her and you can really tell that she LOVES being there. They go above and beyond to make sure she is happy and well cared for. I could not be any happier with our experience at Heritage in Pelham. Everyone from the front office to the directors to the teachers go out of their way to help, pray and make your child feel welcomed and loved!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "104936373940227419437", "name": "amanda moore", "time": 1578942848606, "rating": 5.0, "text": "Hands down the BEST preschool around! Every teacher has been so kind and truly invested themselves into my daughter.. I will always recommend Heritage Preschool!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "113677293010907942361", "name": "Erin Sullivan", "time": 1578456723405, "rating": 5.0, "text": "As a first time mom I had severe doubts/concerns/fears about sending my new baby somewhere ... until we started here at Heritage. The staff is welcoming and learns everyone’s names, the place is spotless, and they genuinely care for the kids. My son is in the infant 1 classroom and his teachers have become a huge part of our lives helping us with milestones/advice/showing he can do things or play with things - before we even knew he could - helping him learn and grow. It is worth every penny having peace of mind he’s being loved on and cared for each day.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109285476220903445679", "name": "Rachel Etheridge", "time": 1576801541966, "rating": 5.0, "text": "I have thoroughly enjoyed my time at Heritage. There is such a great atmosphere and it is a great place to work. We aim to spread the love of Christ to every family that walks through our doors.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105348703662129544564", "name": "WTGardner", "time": 1578945216388, "rating": 5.0, "text": "One of the best places to have your young children learn and socialize as they grow.  We love having both of our girls there!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102789889152596392620", "name": "Coley Robichaux", "time": 1578940116524, "rating": 5.0, "text": "Heritage has been a blessing to my family! I was very apprehensive about sending my child to school since my oldest child hasn’t done preschool. Heritage calmed my nerves by showing so much love and attention to my child. I thought morning drop offs would be difficult but seeing my child light up when she sees her teacher makes me so happy! Getting daily updates and pictures puts my mind to ease as well. No matter how many people are coming and going in the front lobby, my child is always acknowledged by name from any employee to start and end our day. ❤️", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "116386011935017213922", "name": "Jordan Uptagrafft", "time": 1576770392955, "rating": 5.0, "text": "We love Heritage Preschool! My kids are so excited to run down the hallways and greet their teachers and friends each morning. The teachers are so hands on and loving! My kids have learned so much and not just about their ABCs and shapes but also that they have a Savior that loves them so much. They are taught the ten commandments and are challenged to memorize bible verses! Heritage is family and we love it so much!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "104671133905199226450", "name": "Natalya Winters", "time": 1578438333597, "rating": 5.0, "text": "Reviews are so important. Actually, my husband does not purchase items or visit locations without reading the reviews! My 4yr old started in September 2019 and it has been such a wonderful experience. For our family [like many], it's important that our daughter is in an environment that uplifts her. Pre-K is such an important time is a child's educational and social transition. Our sweet girl has a syndrome and has been teased at another school; It left me feeling hopeless about what was to come [starting kindergarten], but she has not come home with any stories about being teased since starting at Heritage. I attribute that to the welcoming environment that you are greeted with from the front door to the classroom and everything space in between. They have listened to and explored every concern my husband and I have had. They keep us updated weekly on events and news, which is important for me as a working mom. (I'd hate for her to miss out on PJ day because no one informed me) It is a great school with great staff who love patiently on all the children. We thank God for this experience as we prepare for Kindergarten!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109060624930144108753", "name": "Charla Jex", "time": 1576802399382, "rating": 5.0, "text": "I love this school, it has brought me great joy and happiness for many years. Heritage is the best daycare for your precious children.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103074922479554079597", "name": "Natalie Jenkins (NatBug)", "time": 1618831072626, "rating": 5.0, "text": "This is a really good daycare. My little one loves it here! The teachers are amazing and treat everyone like family💜 and you can tell they love their students as if they were their child. Best decision when choosing a daycare!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "111556422172679070967", "name": "Rochelle Newby", "time": 1582220498153, "rating": 5.0, "text": "Best daycare ever! I was terrified when I thought about leaving my 8 week-old in the arms of a stranger, but the moment I toured the school, I was sold. I was not impressed with the other daycares that I visited because they were either lacking in cleanliness, preparedness, or security and Heritage Preschool of Pelham was on point with everything. Miss Rachel and Miss Kim were the best!!!! Aniyah is no longer with them but she still loves to stop by their room just to say hello.  My precious baby is now 16 month-old and I still have no regrets. She loves every one of her teachers from Miss Anna and Miss Netty (who used to be in 2B) to Miss Ashley (in 3B). I have yet to meet a teacher that I have issues with, and management has been nothing short of amazing. Heritage is like an extension of our home and I am at peace at work each day because I know she is safe and surrounded by love.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "106207523485526176174", "name": "Tanna Roberts", "time": 1576702101216, "rating": 5.0, "text": "High quality care that implements a curriculum that promotes social, emotional, physical, language, and cognitive learning and development. Positive relationships are promoted & families are encouraged to participate in their child’s learning.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107049547984406096861", "name": "Amanda Nicholls", "time": 1578934374338, "rating": 5.0, "text": "We love heritage. I moved my kids a little over a year ago to heritage. It is an amazing school. My kids have grown soo much. My son had his first seizure at heritage and they were on the ball when responding to his needs. The office staff and teachers are amazing. They have truly became family,. The Director Larkin has literally been a a gift from God to my family. He has helped me through a lot of things. If you are looking for an amazing family for you kids to become close with this is it.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103838094767729227132", "name": "Lindsay Smith", "time": 1578936907872, "rating": 5.0, "text": "Heritage Preschool is a great school and daycare. My oldest son has been going to this daycare for over 3 years now and I also have an 8 month old son who attends the daycare as well. The teachers are friendly and provide your children with a great education. My 3 year old has learned so much from the teachers at Heritage and he amazes me every day with something new that he has learned. They also love on your children and treat them like they are their own. I never worry about my children when I leave them because I know they are in great hands. The office staff is very friendly and do a great job to ensure that parents are happy. Whenever I have had questions or concerns, they have always been willing to sit down with me to discuss those concerns and to figure out a solution to the problem or discuss ways to make things better. My 3 year old son also loves Bible Study and learning about Jesus with Mr. Larkin, the director.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109402263344983678758", "name": "Regina Gentry", "time": 1602121848704, "rating": 1.0, "text": "Its so sad to say that the school leadership has changed since the split of CCS. I believe in the vision of the owner but don't feel that the vision is being led correctly. I was told that my precious rainbow baby and my kindergartener could no longer attend the school because I mentioned a competitors school to a teacher. (my job has changed and I was looking elsewhere for care) what kind of company immediately kicks out precious children (my 5 year old and a 1 year old) because a competitor was mentioned? There was no animosity, mal intent or anything! It was mentioned in passing. Then I get a call out of no where saying their stuff has been packed up and I can pick it up the next day and it was because I mentioned Ardent to a teacher.\nThis is not a daycare that is about the well-being of the children anymore. They just kicked my babies out! They could care less about what is to happen to my children or where they are to go. My children are good children! They dont deserve to be left high and dry from the one place we prayed over and trusted to care for them!\n\nMy beautiful rainbow sustained chemical burns just two weeks ago from the cleaner they use. Did I up and pull them? No, because I still had faith in them. Then just two weeks later they are kicked out. I just dont understand. Are they so scared of the competition that just mentioning it they will make your kids leave? I dont know but one thing I do know is Mia and Skylar DO NOT DESERVE to be kicked out of the one place that was entrusted   with their care.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "110714652277720069670", "name": "Katherine Cardwell", "time": 1576704933335, "rating": 5.0, "text": "Heritage preschool is a wonderfully well rounded, loving, Christ centered environment for little ones! I wouldn't want to send my child anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "100836181896454454687", "name": "Paul Vest", "time": 1576704093663, "rating": 5.0, "text": "Very thankful for the caring and attentive staff at Pelham!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105127760162334549090", "name": "Lacey Aman", "time": 1518229594889, "rating": 5.0, "text": "I am so thankful for CCS! My twins have attended for a little over 3 years and my 5 MO since she was 8 weeks. I decided to change daycares for several reasons and regretted it the entire week. Yes, O N E week and I had to move the girls back. CCS Pelham is our ‘home’ and we are happy to be back!\nThe curriculum is awesome and the daily teaching of the Bible is amazing! The girls have learned so much thanks to the staff and we look forward to many more years!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102202956938878219341", "name": "kelly", "time": 1576792598174, "rating": 5.0, "text": "We love Heritage!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103156949653836018700", "name": "Rian Mitchell", "time": 1624466896777, "rating": 5.0, "text": "I absolutely love this school. The teachers are so friendly and they genuinely care for the kids. I can tell that my child is learning so much here and he’s really coming out of his shell because his teachers make him comfortable. It’s a great place and I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "103025602541297467871", "name": "Amber Roberts", "time": 1621946510180, "rating": 2.0, "text": "When I first started working here I absolutely fell in love. However, coworkers did warn me about the management and I didn’t listen. I recently found out I was pregnant and I tell them and they treat me differently. They  did not want to work with me when it came to doctors appointments, they told me I wasn’t giving “ a 110%” to my room, because I had to walk out a few times to get sick ( pregnant so I couldn’t help it). I love my kiddos and still came and pushed through it for my kids and that didn’t matter at all. I’ve had some complications with my pregnancy, but of course that didn’t matter to them. So many coworkers bad mouth the management, but we stay for the kids. I do not recommend working here they go through A LOT of employees. Also, if a kid got sick and parents needed to be called the office wouldn't call  we would bring the kids to the office more than once and sometimes still no call. The parents would pick up at the end of the day and be frustrated that they never received even a message from the office.  However, the parents and kids are amazing 💗", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "106158621903270330438", "name": "Kayla Hyman", "time": 1580662155615, "rating": 5.0, "text": "Best place my daughter has ever been. We love her teachers!", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "102976677382947809638", "name": "Ashley Hendricks", "time": 1521168141316, "rating": 1.0, "text": "My child was bitten and we were not notified! I didn’t find out that she was bitten until I was giving her bath that evening and notice a large bite mark on her shoulder! My husband and I were confused because when he picked her up that day he asked her teacher if anything happened today and if she had a good day and her teacher lied and said that nothing happened and that my daughter had a good day. The next day my husband and I were livid sand when he brought her to school he asked the teacher directly was our daughter bitten and pulled down her sleeve to reveal the bite marks and only then did the teacher admit that she was bitten but didn’t explain the scenario for how she was bitten. She didn’t even apologize for not telling us! She only just said that she saw the incident but didn’t think it broke the skin! That tells me that she didn’t even look or apply aid to my child! My husband asked if our daughter cried and she said yes but didn’t say that she comforted my daughter at all. I was at work when my husband called to tell me all this. I called and talked w/ the manager and all she did was cover up for her worker. She admitted that this was not the first time that this employee had not followed standard protocol as no report was written and turned in at all on the day of the incident but she kept saying” I know her heart” screw that my child was injured and I was not notified! Just unacceptable! The manager admitted that no medical aid had been applied to my child! When asked how all this happened she said my daughter was playing with a toy first and a child wanted it and when the child couldn’t get it he bite my daughter. She said my daughter did nothing wrong. Reluctantly we had to leave her there for the day as my husband had to go to work and we have no family or friends available to watch her. When my picked her up today he was handed a report about the incident and on the document the director lied saying that the bite was wiped and cold pack was applied and this  never occurred! She told me earlier today that the teacher stated that she didn’t think the skin broke and she agreed that she had not assessed the bite to see if skin was in fact broken! She didn’t give a flip about my child! So she falsified documents to cover up for her incompetent, lazy employee! She admitted to my husband that this was not the first time that this employee had done something like this and yet she keeps her as an employee!This is not a place to bring your children! They will not take care of your child and will NOT report to you if anything bad happened to your child throughout the course of the day! We will be removing our child as soon as we find another daycare! I’m beyond livid w/ the facility!", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "116837726980120317264", "name": "Satish Parvataneni", "time": 1449370553157, "rating": 5.0, "text": "We sent our kiddo here when she was 15 month old and our experience with Odyssey is exceptional.\n\nIt is very well run daycare/learning center and teachers are organized, affectionate towards the children. Always makes the child welcome. After the initial jitters and rash of ear infections and fevers my daughter adjusted and then thoroughly enjoyed going here.\n\nMost important thing is place is super clean and all the teachers we have had experience with are genuinely caring and affectionate towards our kiddo and communicative towards parents. Especially last 2 years (k3 and k4) were a blast. From the administration point of view, they are not defensive and open to dialogue and suggestions from parents.\n\nOne of the times, we were struck at the center for overnight due to a snow situation in Birmingham. The way teachers and the director Ms Annie handled the situation was superb. I almost feel lucky to have discovered this center.\n\nI have to mention especially about the assistant director Miss Jennifer. I don't know how she remembers all the children by their names etc. :) she would always greet kids with their name and a big smile. Other than running the operations smoothly, she is understanding and supportive of all the situations that parents go through as we deal with job transfers etc. can't thank her for enough.\n\nI highly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "108652398885516426739", "name": "Jennifer M. Williams", "time": 1524508125598, "rating": 5.0, "text": "I believe that there are not enough reviews on here to judge such and impeccable learning facility! Therefore, I am adding mine to show future families of Odyssey how wonderful this school is! First, My child has been attending Odyssey since 6 weeks old. We have had an amazing experience since! Annie and Jennifer have always done everything in their power to please any wishes I had for childcare (and I am a hard mom to please) Yes, Annie is straight forward and awesome, but I am also a huge fan of Jennifer’s ability to make anything happen if it deems possible. Sometimes this may seem as though she is not “to the point,”, when in fact, she may be changing the point all together to fit my needs! She has loving and understanding customer service and I have never had any issues that I Couldn’t come to her about. When my child has moved up in rooms, we have had teacher changes. Especially on the toddler hall. I have never been disappointed with any teacher that my son has had though. They send home a letter upon a teachers leaving and let us know who our new teacher will be. This happens, bc unfortunately a preschool teacher isn’t always a main career for a young adult. However, in the infant hall/preschool hall their teacher have been at Odyssey 10-20 years!!! Now that truly says something about the owner and directors! You have to be doing good by your employees if they work for you each day for decades! So, when my child’s teacher is replaced I figure that it is either due to a career path change or that they didn’t meet Odyssey standards and I am just Fine with that! Lastly, I am so appalled that the previous review referred to the floaters as “randoms” This has to be the most offensive sentence I have read in all of these reviews. The floaters work just as hard as the named teachers at Odyssey...some work harder! I bet every one of them knows every child by name. Watch the cameras yourself! I watch the floaters clean up meals, place out cots/high chairs, put up cots and chairs, close down rooms when they haven’t been in there all day, put my child to sleep, rock my baby when the teachers are busy feeding. I have never seen a group of more loving floaters. I have used one of the floaters as a babysitter and felt from the beginning that she loved my son Just as much as I do! Most of the time floaters are there because they have 2nd jobs and work at Odyssey part time. I also know that a few of them are full time employees and would rather help out and love on all the children than be placed in one room. I wish you would have thought about that sentence before you posted, because if you have never had your child physically harmed by a teacher at Odyssey, then why scare people into thinking that a floater may? They have the same couple of floaters every day and my child can name all of them. It is my hope that all the floaters get just as much recognition as the teachers at Odyssey bc they do the same thing and that is providing a safe, clean, and  professional child care facility where I know my child is loved. Now that my child is getting ready to go into kindergarten soon, I am beyond please with his knowledge! He can almost read! He can write! He can do things that first graders are doing in elementary schools! I owe this all to Odyssey and their outstanding curriculum. Thank you for providing us a second family and I will always refer family and friends to Odyssey!", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "117711167682133515508", "name": "Amy Brunson", "time": 1532311310782, "rating": 5.0, "text": "I cannot day enough good things about Odyseey Inverness. The teachers have become like family tomus and both of my children have flourished there. We would never consider sending them anywhere else!", "pics": null, "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "107480475846028738560", "name": "Tanga Lawler", "time": 1579127264402, "rating": 4.0, "text": "She Happy we Happy", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfB6k8fx03BBI9BQ7JBdnGO2XzlPhUsAW4CUOp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889164cd85a6245:0x68fd4e632becdcc1"}
{"user_id": "107781205171573931849", "name": "vannisha Howard", "time": 1618423572585, "rating": 5.0, "text": "Wonderful experience. Staff is great with communicating. Would highly recommend to anyone looking for a childcare facility!", "pics": null, "resp": {"time": 1618513212939, "text": "Hi, Vannisha!\nThank you for taking the time to leave a review for KinderCare. We are so happy to hear that you’ve had such a positive experience with us! We couldn’t be more proud of our team at Halcyon Park KinderCare for going above and beyond to be communicative, compassionate, and friendly at all times, and we’re thrilled that you’ve chosen us to be your partner in childcare and education! Families like yours are why we do what we do, and we could not imagine KinderCare without you. Thank you for being a part of our family; we’re so happy you’re here!\nWarm regards,\nCarlie, Family Support"}, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "104029282363454416687", "name": "Karin Hager", "time": 1612284074968, "rating": 5.0, "text": "We absolutely love kindercare! Our daughter had made Leo’s sand bound since starting the program! She’s potty training, eating and actually communicating with us which she was not doing before she started. Ms Courtney is a fantastic supervisor and is always ready snd willing to communicate. Ms Autumn is an amazing teacher who really cares about her students. Thank you kindercare!", "pics": null, "resp": {"time": 1612296366150, "text": "Hi, Karin!\nThank you for taking the time to leave a review for KinderCare! We are happy to hear that you have had such a positive experience with us. We’re thrilled you’ve chosen Halcyon Park KinderCare as your partner in childcare and education! We love that you’ve seen so much development in your daughter since starting with us and that she is communicating better with you now! It’s great to hear Ms. Courtney and Ms. Autumn have both made such good impressions on you, too. Families like yours are why we do what we do, and we could not imagine KinderCare without you. Thank you for being part of our KinderCare Family; we’re so happy you’re here!\nWarm regards,\nLindley, Family Support"}, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "114627476859457748562", "name": "Freddy Powell", "time": 1549641320323, "rating": 5.0, "text": "We have been apart of the KinderCare family for 4 years.  They are like family to us. They have looked after my son since he was 3 years old. Very professional, very clean, and great communication.  I have no worries knowing my son is under Kindercare's Care. BEST PLACE IN THE CITY!!! Well worth the money.", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "102589230138472495729", "name": "Rachel Stewart", "time": 1549587544183, "rating": 5.0, "text": "We love kindercare. They have been an extension of our family for 9 years now. We wouldn’t change a thing. Courtney and Audrey are amazing leaders that inspire the best from a wonderful team of educator/caregivers. Our family has always felt loved and nurtured here.", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "107375799276518083075", "name": "Demetrius Mills", "time": 1557788705823, "rating": 5.0, "text": "Excellent service,   this is more like a learning center then a DayCare.  They teach our son so much, he is developing at an excelled pace thanks to Kindercare.  Great facility,  very nice people,  my son really loves his teachers.  Very professional staff", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "111531457423214275776", "name": "Chris Watts", "time": 1533569542950, "rating": 1.0, "text": "Thought this daycare would be good because it was expensive but I was wrong! They have 1 adult per 5 infants! The staff lets the babies cry, and the director is only concerned about money! Never will i ever recommend this place", "pics": null, "resp": {"time": 1533747203084, "text": "Hi Chris, Thank you for sharing your experience with us. We will share your feedback with the district leader so they can look into your concerns. We do follow all ratio guidelines in all of our centers. Thank you, Rachael, Community Manager"}, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "104406319095852020769", "name": "rajni sharma", "time": 1520370009792, "rating": 1.0, "text": "I thought this daycare is expensive so they will take care of my baby very well.I was wrong.its very horrible daycare i ever seen in my life.They don’t care about kids and they just let them cry.Firstday of my son in daycare was miserable..I told them if he will not eat call me back.But they didn’t.They let him cried and kept him hungry straight six hours.I was so sad.Next day when I dropped him.I stood outside of his class room.He was crying and stood in the corner alone.nobody paid attention to him.Nobody came near to him and not even tried to sooth him.when i came to pickup him up he was so unclean and his eyes were swollen because may be he cried a lot over there.Next day I didn’t send my son to such a horrible daycare.Now i found another daycare.On  His first day he didn’t cry at all. He is soo happy over there. He love his teacher.", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "103130751321000341546", "name": "Christin LeJeune", "time": 1556131725149, "rating": 5.0, "text": "My son has been at Kindercare for a year now and we absolutely love it. He has grown and learned so much in the last year and it's amazing to see his development. We transferred from a church daycare, and while he did receive excellent care there, being at a preschool that emphasizes skills and knowledge while still strongly encouraging play has been lifechanging. I could never go back to a daycare program after being part of Kindercare.", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "111870094518219914138", "name": "April Theobald", "time": 1549636343917, "rating": 5.0, "text": "We have been so extremely happy with the care our kiddos have received at Kindercare!  We have been at the center for almost 2 years and over that time have found all of the staff to be very professional, loving and they treat the kids like their own. We have two boys at the center (6 years and 2 1/2 years) and everyone knows their names, even the caregivers in other rooms. We really like that the boys can see each other throughout the day even though they are in separate rooms. We were also very happy with the structure In the PreK Room and found that it was very helpful in preparing our son for Kindergarden. I would highly recommend Kindercare!", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "102858591062664317203", "name": "Amy Sills", "time": 1539957065067, "rating": 5.0, "text": "We've been extremely happy with the Pre-K program my 4 year-old attends.  Her teacher, Ms. Christine, is amazing.  The class is well-run, and my 4 year-old has learned so much already - academic skills, as well as social/emotional skills.  The directors, Courtney and Audrey, are always friendly and have been very accommodating.  At the beginning of the year, they put on an a very informative parent night where we met with the Pre-K teacher and were given expectations about what the year would look like, what the day would look like, and what we can do at home to help our kids grow.  They put on school-wide events like \"Back to School Night\",  and a \"Fall Festival\", and I'm sure more as the year goes on.  The center is very accommodating to working parents.  The Pre-K program is a great balance of academics, social/emotional skills, and fun!  They do special days like \"teddy bear workshops\", \"pumpkin patch\" and class parties.  If you're looking for a pre-school for your child, I highly recommend KinderCare!", "pics": null, "resp": null, "gmap_id": "0x888c2c7f8ac8902b:0xcd6d53796f179b7"}
{"user_id": "106936286422287650638", "name": "Amarie Stitt", "time": 1498139427183, "rating": 5.0, "text": "I love the Learning Ladder! They kind of treat me like family. Its different environment then my old summer camp. I like most of the children and all of the teachers are nice.", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "102366484631884152425", "name": "Timothy Smith", "time": 1498138806393, "rating": 5.0, "text": "Good fundamentals being installed at the center. If you're looking for good morals, this is the place!", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "115326286464597819321", "name": "Ashley Nathan", "time": 1498139639904, "rating": 5.0, "text": "I have been associated with this business for several years. Its an awesome experience in my life.", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "102346938557731359916", "name": "Tymmekia Miller", "time": 1468262314920, "rating": 1.0, "text": "My son was also injured at this daycare, there are no two sides to a story when it comes to a child who can not speak. please be careful in choosing a daycare with workers and a owner who actually care about your child's safety and health.", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "108608343843627552975", "name": "Sandra Dee", "time": 1358521526528, "rating": 5.0, "text": "The Learning Ladder is an exceptional Childcare facility that enriches the growth and learning structure of children. I am extremely pleased with the personal care and concern that they share for my little one.", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "103215858353081934810", "name": "Stephanie Carson", "time": 1461853746360, "rating": 1.0, "text": "Just saw on facebook that a child was scratched up by a teacher there.  Please follow up to this situation before putting your children here. Their are always two sides to a story but I would investigate before enrollment.", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "106999980082771564909", "name": "Birmingham tours", "time": 1468021119889, "rating": 1.0, "text": "My son was assaulted there by the owner would not recommend this to any parent", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "101454417683754777692", "name": "msaprilp", "time": 1498183689428, "rating": 5.0, "text": "Awesome daycare!!!!! Great learning environment and the staff is very friendly!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "114444210296126039828", "name": "Ashli Nathan", "time": 1498139717467, "rating": 5.0, "text": "Bring your kids here!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "116622254778105254021", "name": "Tonya Johnson", "time": 1499271046482, "rating": 5.0, "text": "great facility!!!", "pics": null, "resp": null, "gmap_id": "0x88890ef1659d4783:0x4e14fa1d0420b113"}
{"user_id": "101055147953708287881", "name": "Breasia Lee", "time": 1625256391202, "rating": 5.0, "text": "this a rea good daycare my babies love it", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "113151562803550660047", "name": "April Rudolph", "time": 1573707697724, "rating": 1.0, "text": "They are HORRIBLE!!! DO NOT TAKE YOUR KIDS THERE!! My 2 yr old son got food poison from some old chicken they gave him and the owner grandson got into it with my oldest son... they let him fight my son and they had the audacity to put my son in a corner. Not to mention they also let my kids leave with a known family member but he was not on the list to get them your best bet would to literally pay extra for a better school or a trusted baby sitter DONT DO IT!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "102272326938322236587", "name": "Jayda Edwards", "time": 1564705384000, "rating": 5.0, "text": "My baby been here since she was born. My next baby going here too. They a good daycare.", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "101782508590337117974", "name": "LaAsia Davidson", "time": 1512094228129, "rating": 5.0, "text": "This daycare good. They keep my infant and my 4 year old. They take good care of them and they eat hot meals. The employees are friendly too. VERY GOOD DAYCARE!", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "102266576119778375124", "name": "New Customer", "time": 1581095999795, "rating": 1.0, "text": "This daycare is horrible!!! I honestly would not recommend it to anyone. They are very highly unprofessional and rude to parents!  No communication at all... My kids were taunted everyday.", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "106979149559681703193", "name": "BYRDIE Yeah", "time": 1554762620192, "rating": 1.0, "text": "This place is a WELFARE DAYCARE CENTER!\nThat's right. They accept AFDC. Which is welfare from the department of human resources on mobile highway! That's one of the reasons why they have an extremely large amount of children ranging from infant to school kids. Most of the parents dont even pay because they cant afford a real daycare center. So the welfare pays it for them. And the welfare sends each and every single kid over to kids zone.   The staff that works there are mainly family. A wife, a husband, his two mixed daughters, and a couple of their friends. The staff is messy, love talking negative about others behind their back,\nAnd very neglectful. They will leave your small infant child in their crib all day long crying.\nAnd will quickly pick the baby up when they see a parent or someone important arriving. That's when they pretend like they are cuddling and caring for your kid.\nThey have misplaced kids expensive personal belongings. They have fed a child the wrong snacks. Kids come home with bruises from either some other child or from one of the staff. But the list goes on and on when it comes down to this place. Look at their reviews. And check out what others are saying on Facebook. This really is not a good place for your children people. And I suggest that you dont take your kid to this place. .\nIf you cant afford a real center. Please take two maybe even three jobs if you have to.\nSAVE YOUR KID FOLKS! Dont let the welfare just slap your kid off on any old thing.", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "110547607290266785355", "name": "Lashanda Lowery", "time": 1472507070944, "rating": 1.0, "text": "this daycare is horrible! the staff is very rude and mean. they only care about the money. my baby went there for 4 hours total but i paid for a full week which i shouldn't have because they told me my baby had a virus which he didn't. also in the infant section they had 1 person in there with 10 babies (which is illegal). when his grandma went to pick him up she saw that he had been crying and they were trying to prop a bottle up to feed him instead of just picking him up to feed him. the lady told her that \"hes just gonna have to get use to it\". i dont recommend this daycare to anyone who cares about the safety and well-being of their child. ohh and also when i dropped my baby off there was a child standing on another child's back!! (which is why they need more than 1 person for so many small babies) and when my mom went to get my child they DID NOT check her ID she just told them who she was there to get and they just let her in. please, if you care for your child's safety find a different daycare!", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "112653109460484354813", "name": "leslie potter", "time": 1596819279507, "rating": 1.0, "text": "Staff are rude and have nasty attitudes.", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "108661747075478328570", "name": "taquita stowe", "time": 1525046419692, "rating": 1.0, "text": "Not good for the children", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "108930829501933578489", "name": "Destiny Beverly", "time": 1459413409991, "rating": 1.0, "text": "Hey.", "pics": null, "resp": null, "gmap_id": "0x888c2a99b05b83b9:0x476247689c174680"}
{"user_id": "107145819377935563475", "name": "Ash Redmon", "time": 1613569964231, "rating": 5.0, "text": "Since my daughter restarted here she has thrived. She’s learning baby sign language and her ABC’s. She trying to speak in sentences and she’s only 17 months! We love her teachers and Mrs. Dorothany is so sweet and patient them! The Covid protocols her make me feel good about sending her!", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "105526535865470865373", "name": "T H", "time": 1578429460199, "rating": 5.0, "text": "Great center for any age. The staff are mostly elder aged women and are very sweet and patient. Been going there for 2years.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "105472100687638951978", "name": "Edna Holley", "time": 1540239041215, "rating": 5.0, "text": "I give this daycare an A+, not only because of their excellent work with the children left in their care, but also for the exceptional customer service that they provide in order to assist/help families that some times fall on hard times.  The owner’s willingness to listen and assist when things are difficult goes beyond just a business relationship.  Kudos to the owner and staff at this daycare.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "101860055553159395826", "name": "Jennifer Ashworth", "time": 1540245547545, "rating": 5.0, "text": "My twins having been going to this daycare since they were 3 months old. They are now 2 1/2. They love their teachers and are always showing us new things they’ve learned. We could not have asked for a better group of people to love our babies as much as we do.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "108202992465986488558", "name": "Brandi L", "time": 1453407976331, "rating": 5.0, "text": "I love everything about this daycare. The ladies there are very kind and responsible. My son learns something new everyday and I can tell he's being well taking care of. I highly recommend this daycare.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "104460363010035342690", "name": "Ashley Hickerson", "time": 1569500135767, "rating": 1.0, "text": "This daycare has multiple allegations of abuse.", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "107184831850587604212", "name": "D Robinson", "time": 1483562550805, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x886268c566ee2c07:0xd791fb9971a500ed"}
{"user_id": "106853080787595576763", "name": "Sarene Hampton", "time": 1554761771976, "rating": 4.0, "text": "My grandson attends and is the 3 year old class. I'm impressed with lead teachers Ms Linita and Ms Kelsey. They are very positive with him and he seems challenged by the activities.", "pics": null, "resp": null, "gmap_id": "0x88893eee40e42ceb:0x6ca62eaa9ba28915"}
{"user_id": "100130098704628948313", "name": "Kiara Keith", "time": 1565128703196, "rating": 5.0, "text": "We love the Ready, Set Grow family. My 3 year old goes there and they are amazing!", "pics": null, "resp": null, "gmap_id": "0x88893eee40e42ceb:0x6ca62eaa9ba28915"}
{"user_id": "104918093718692277076", "name": "Lauren King", "time": 1498726668477, "rating": 1.0, "text": "Honestly, to fire the one worker all the kids actually LIKED over one stuck up woman? Amazing daycare or not, you are not worth anything if you can't take care of your own employees.", "pics": null, "resp": null, "gmap_id": "0x88893eee40e42ceb:0x6ca62eaa9ba28915"}
{"user_id": "108355139047049249542", "name": "The Raging Potatoes", "time": 1622188438550, "rating": 2.0, "text": "very loud and obnoxious and everyone slams doors there", "pics": null, "resp": null, "gmap_id": "0x888601f02358f579:0xce014e9f84e941c4"}
{"user_id": "106816396734449417501", "name": "sam myrick", "time": 1573001788248, "rating": 4.0, "text": "Staff is friendly, my grandbabies like going", "pics": null, "resp": null, "gmap_id": "0x888601f02358f579:0xce014e9f84e941c4"}
{"user_id": "117288742390188316750", "name": "Lauren D", "time": 1621905773567, "rating": 5.0, "text": "We enrolled our son in sugar and spice at 5 months of age after being denied by 3 other daycares (closer to us and WAY MORE expensive) due to COVID19 making most places \"half capacity.\" Well, we couldn't have been more blessed. The staff at sugar and spice are incredibly nurturing and caring. They absolutely love the kids. I never doubted my son wasn't taken care of. We are incredibly grateful to have found sugar and spice and are thankful to Sybil, owner, for running such an amazing establishment at an affordable price. Thank you for my son's happiness, all the beautiful hand made crafts we got to bring home, and all the friends we made. We are only leaving due to another job opportunity out of state. We highly recommend this place. We will miss you all!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "114438123508120345391", "name": "Michael Jones", "time": 1591318997228, "rating": 5.0, "text": "Hands down an excellent place. They have been so reliable. The children seem very happy. Big playground and frequent recess. They have great success prepping the children for school, and they obviously care about the children and families.", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "111221075117093834098", "name": "Karen R", "time": 1597327193795, "rating": 5.0, "text": "Lots of reviews by people who are emotional and not critical thinkers, and have never even been to S&S, but feel entitled to post negative comments based off a FB post (and even then, they are making all sorts of other assumptions as well). I've had kids attending since 2014 and every one of them has loved it and loved their teachers.", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "108213775447919099162", "name": "Paola Myers", "time": 1522971750822, "rating": 1.0, "text": "Statement from my sister in law: On February 26, 2018, I was relieved to be off work and on my way to pick up my children. I walked up to the daycare office and my children burst out of the door to greet me. Hellos, hugs and kisses were shared. I shuffled them to the car as usual, trying to hurry home. I asked them how their days were and the news I would receive from my children would change my outlook on the world. My son, who is 5, stated he had good news and sad news. (This is a usual statement. He like to say something sad and good that happened during his day. He said his teacher pushed him down. Taken aback, I inquired what happened? I had thought for sure I misunderstood. He repeated himself in more detail that she had taken her hand to the back of his head and pushed him off of the picnic table. He continued that he had fallen on the rocks of the playground and hurt his hands and knees. I checked his hands and knees, but there were minor indications of trauma. The owner of the daycare assured me she would get to the bottom of it and let me know. She expressed how much she loves my children and cares for us like family. Trying to reassure myself, I say how maybe he was mistaken, because his sister had said stuff before and recanted. Surely, I told myself, there has to be some mistake. My children have attended this daycare for over 4 years, and we have not had major incidents in that time.....Boy, was I wrong....\nThe owner of the daycare gave me her phone the next night, so I could feel better about the situation and know that my children are safe. She stated how my son was mistaken and that the teacher had caught him from falling, etc.. I was left to watch the video in slow motion to find out what happened....Shocking!  I took my children out of this place immediately. The teacher pushed down my son and I have it on video. I advice you to stay away from this place!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "106516886678315836311", "name": "Taneshia Pendleton", "time": 1446576782501, "rating": 1.0, "text": "I don't even know where to begin. My child attended this place for less than a month. The teachers clearly are not trained. On several instances I walked into the building and heard teachers yelling at kids. No positive reinforcement at all only negative. I don't yell at my child and don't expect a teacher to either. Next, there was a security concern. No formal system of regulations to keep intruders out. Plus, on instances I have walked into a classroom to see the teacher's boyfriend I presume just hanging out. That was the Big oh no for me. Then I have seen the teacher's send 2 year old girls into the bathroom together, no supervision and some of the girls were pushing and hitting others, which is the same thing I witnessed during nap time. Not sure why they let kids be on someone else's sleep mat either. For a place that claims to be \"more than a babysitting service\" they get a F from me. My babysitter are more qualified then these people.", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "101692042645044912594", "name": "Kaitlin S", "time": 1562425042608, "rating": 1.0, "text": "This place has turned DRASTICALLY. 5 years ago it wasnt bad but now its just a monster house. Please please please dont take ypur kids here, especially for the price. I had my child here and the bullying between kids is kinda bad but the adults are very hit and miss. Not worth it, got somewhere else", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "100043059207302503824", "name": "Ashley Lovell", "time": 1565292847096, "rating": 5.0, "text": "The staff have been so great to my kids after a horrible experience with another daycare. We love it at Sugar and Spice!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "109024269947870514212", "name": "Ahmad said", "time": 1392673165077, "rating": 5.0, "text": "I have a 3 kids that go here , they been going here for 3 years and counting this is one of the best day cares If not the best. great staff would recommened this day care to anyone its a great day care you wont be disappointed .", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "108897493192774710473", "name": "Candlewood Suits", "time": 1389083071754, "rating": 1.0, "text": "PLEASE, PLEASE, PLEASE DON'T SEND YOUR CHILD HERE!!!!!!  THEY DON'T TAKE CARE OF CHILD AND EVERY CHILD DESERVES TO BE TAKEN CARE OF WHEN YOUR NOT THERE.  THEY NEED TO BULLDOZE THIS PLACE TO THE GROUND!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891f33442888f5:0x78b5a80f33f6ac46"}
{"user_id": "117764079385978279143", "name": "Janie Masterson", "time": 1584673318471, "rating": 5.0, "text": "This daycare is very well equipped to take excellent care of all the children who go there. The teachers are all very well trained. The kids just love each other and their teachers. They know the names of all the children at the center. The ownd", "pics": null, "resp": null, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "106840031253399653717", "name": "Scarlette Ohara", "time": 1591134489531, "rating": 5.0, "text": "So far so good! We love this center. It would appear that the negative reviews are exclusively individuals who were unable to obtain a spot for their children.", "pics": null, "resp": null, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "111438439752344032875", "name": "Merritt Gambino", "time": 1560442059669, "rating": 5.0, "text": "The owners Sara and Gary are extremely nice and follow all policies. The teachers know every child by name, even if they teach a different age group. They're thorough and make sure each and every child feels loved and important. I'm so glad I found a group of people that I can trust with my child!", "pics": null, "resp": {"time": 1561493791520, "text": "Thank you so much Ms. Gambino for the wonderful review!"}, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "106428152132259460217", "name": "RVPeak", "time": 1589212717523, "rating": 4.0, "text": "They have a sincere concern for the children and their growth and development. They are willing to work with you special needs for your child as well.", "pics": null, "resp": null, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "103895057589246813819", "name": "Karrin Lawhon", "time": 1574776149661, "rating": 1.0, "text": "Just tried to talki g to them about my children and once she told me she had no room i went to ask if they had a waiting list and before i could say anything she hung up on me. That is honestly so rude and unprofessional. If i could give less than a 1 star i would.", "pics": null, "resp": {"time": 1574793515978, "text": "Ms. Karrin i am so sorry this happened! I am sure that whomever you spoke to did not mean to hang up on you. If you would like to call back and speak to our assistant director I'd love to assist you however I can."}, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "100143805689990764541", "name": "Juan Torres", "time": 1561382912855, "rating": 1.0, "text": "Horrible experience. My wife and I went in a week in advance and was told there was an available spot for our daughter. We signed up that day. Fast forward to next week our first day to drop our daughter off. They didn’t have any room available and were over booked. they failed in notifying us that there wasn’t any room available. This business should not be taken seriously.", "pics": null, "resp": {"time": 1561493772864, "text": "Hello Mr. Torres,\nFirst I would like to apologize in our failure to notify you that the last spot available had been taken. We run on a first come first serve basis. When your wife called last thursday, and then stopped by her second tour she was told that she didn't seem very comfortable with leaving your child in our center. Our first priority is always the children and then the  parents. If you do not feel comfortable when taking a tour and after meeting the staff then this is probably not the center for you. Your wife was told that we would hold all her information and if she went home and decided this was the place for her to come back so I believe there was a communication error in that part. We take great pride in the love and care we give each and every student here. I am very sorry you did not have a good experience and wish you both luck in finding the center that will better fit your needs!"}, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "112708603833174606564", "name": "Katie Henry", "time": 1550856910955, "rating": 1.0, "text": "I had intended to sign my son up for the summer and had been speaking to someone on their Facebook page. When I arrived, not only did no one know what I was talking about, I was told they didn’t know what they were doing for the summer and they’d take my name & number and call me. On my way out I drove past their “playground” their fence was missing several boards, so you could see right in to the dirt pit with a jungle gym, 2 teachers sitting at a picnic table talking while kids ran around screaming. I was glad at that point that I didn’t send him there.", "pics": null, "resp": {"time": 1561494056179, "text": "I apologize Ms. Henry for the miscommunication. We have two owners and an assistant director who all run our facebook page. We did have some fence boards missing and were not using that playground at that time. All fencing has since been fixed!  We are currently completing building renovations as well as updating our playgrounds. Again I apologize for the miscommunication and thank you for your consideration."}, "gmap_id": "0x889a686c789f781d:0x3b5715298d98cb1f"}
{"user_id": "101457219148764461048", "name": "Tatum Butterfield", "time": 1600202487234, "rating": 5.0, "text": "I want to say thank you to the staff and management of Childcare Network who go above and beyond on a daily basis to make sure that my child’s needs are met. Lisa, Stepheni, and Tway insure that safety is a priority at Childcare Network. The teachers take their jobs as care givers to the children of our community very serious.  Every teacher my child has had (from infant room to the two year old room) has treated her like family. Childcare Network puts mind at rest and I find comfort in knowing that my child is safe and loved while I’m at work. Again, thank you for all you do.", "pics": null, "resp": {"time": 1600699197367, "text": "Hi Tatum, thank you for taking the time to leave us a positive review! We work hard to meet expectations like yours, and we are happy that you are satisfied with the care and education our teachers provide your child. Thank you for choosing Childcare Network, we are so thankful to have you and your family a part of our Childcare Network family."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104168410981765307695", "name": "Audrey Johnson", "time": 1599846286448, "rating": 1.0, "text": "I’m going to start by saying the staff that works directly with the children are great! However the management such as corporate is awful! Not ms. Tway or Stephanie. I get childcare subsidy obviously because I can’t afford childcare on my own! They told me Friday that I have to pay childcare out of pocket because child care subsidy only pay it once a year! If childcare charges once a year then why would you guys charge twice a year? That is not a working moms best friend! That is a inconvenience and makes it impossible to go to work. So I’ll probably be missing a week of work because the company wants to make more money any way they see fit! Strongly recommend the staff definitely do not support the corporation rules as a whole! Lisa butler is rude and don’t care about people much like Donald trump a total tyrant!", "pics": null, "resp": {"time": 1600699769077, "text": "We appologize for the inconvenience. We are available to speak with you about any concerns you might have. Please call 833-407-6174 to speak to Corporate Customer Care to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107699754980347841886", "name": "Mrs Russ", "time": 1602170297994, "rating": 1.0, "text": "Horrible Management. The director Stephanie was very  disrespectful. Just pulled my child out today. I do not recommend this location.", "pics": null, "resp": {"time": 1602176980516, "text": "It is only through feedback such as yours that we are able to maintain and improve upon the service we provide to our families. We would like to apologize for the experiences in your review and would very much like to follow up with you. If you wouldn’t mind giving us a call at 833-407-6174, we would like to have someone from the Corporate Customer Care department follow-up with you."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114608540680499829506", "name": "Cierra Rodriguez", "time": 1502031119097, "rating": 4.0, "text": "So... first off I want to clarify the \"discount for review\" thing everyone is talking about. There isn't ANYWHERE on the flyer that states you have to give 5 stars in order to receive a discount for services, so some of the below listed reviews are being VERY dramatic on that standpoint. It's a nice center and my kids have really enjoyed their summer here.", "pics": null, "resp": {"time": 1504620883207, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100824425643397100780", "name": "Chad Millirons", "time": 1476292499052, "rating": 5.0, "text": "I absolutely love this facility. Our daughter is 16 months and love coming to school. In the infant class, she loved Mrs. Michelle and Ms. Emily. Now that she is in the Toddler class, she loves Ms. Chianti. You can tell they truly love kids and they treat your child as one of their own.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "105770043327052678250", "name": "Emily Gunter", "time": 1506826590216, "rating": 5.0, "text": "My niece has been going to childcare network #169 since she was 6 weeks old. She now currently 3 years old and we still absolutely love it! We know she is always safe and well took care of. The staff goes above and beyond to make sure the children are happy and that they are learning! It's amazing how much my nieces knows at only 3 years old! Not only are the teachers great! The director and the assistant director are awesome as well. They are always welcoming and helping solve any issue that may come up! Couldn't imagine my niece anywhere else! #169 rocks!", "pics": null, "resp": {"time": 1509047826570, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107439376903288006210", "name": "Brittany Jenkins", "time": 1575650038335, "rating": 1.0, "text": "I called to see if there were openings for both of my children's ages, I was put on hold for 5 minutes to be told unfortunately there was a wait list for both of their age groups. I asked to be able to put my kids on the wait list. The first lady acted like she was annoyed that I asked. And put me on hold for another 5 minutes, and was transferred to the lady that handles the wait list. Of the 30inute phone call less than 5 minutes of the call was spent actually talking. I understand there is probably a high volume of calls, but even being put on a wait list I'm still a potential client/customer. Either one of those people could have taken their information down and just put them on the wait list.", "pics": null, "resp": {"time": 1575667693921, "text": "Hello Brittany, we apologize for the inconvenience this has caused you. However, after checking with the director, it looks like we do have some space available. If you would give us a call back, at 334-214-5273 and select option two and then press 1 to be transferred directly to the school. We will be happy to help get your little one enrolled!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106419371562225867134", "name": "Jovan", "time": 1409781459748, "rating": 5.0, "text": "So far the experience has been great! My kids love it there! The staff is amazing! The facility is well kept and there is plenty of space. The summer program is great! I can't wait for the curriculum to start!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113462493091324192784", "name": "Dana Love", "time": 1505920344827, "rating": 5.0, "text": "My daughters have been going to childcare network for almost a year. My oldest daughter is very shy, today i dropped her off, like every other day the teacher welcomed us but today was different. Shianti said good morning, got my daughter to talk to her and helped her get her favorite toys to play with. I'm so happy all the teachers at the daycare loves my girls like i do.", "pics": null, "resp": {"time": 1509047895512, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109412919093052672197", "name": "Lanie Dale", "time": 1525701543849, "rating": 5.0, "text": "My son has been going to childcare network for over a year now. I previously had him enrolled in a daycare in Columbus because they had video cameras inside the facility and the place was absolutely awful . I had heard great things about this daycare and decided to give it a try. I am probably the most anxious person in the world and worry constantly about my child. I can honestly say I don't worry one bit when my son is here. The entire staff here are angels in my eyes. My son loves everyone of them and says it's his favorite place to be. He is always so happy to see them and has learned so much from this place. I would recommend them over and over again to anyone and I would never send my son anywhere but here. Thank you guys for everything you do and all of your hard work! This place has truly been a blessing in my life!", "pics": null, "resp": {"time": 1527192891537, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100331046499534639501", "name": "Sammantha Fietzek", "time": 1394756269298, "rating": 5.0, "text": "Love this place! The staff is loving and caring. The school age group has an amazing space upstairs including a beautiful basketball court. All three of my kids love going there and can't wait to return each day (which makes a huge difference to me)", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103774541742903168684", "name": "Courtney Moore", "time": 1455298609373, "rating": 5.0, "text": "My daughter absolutely loves Childcare Network. It took only about a week before she was jumping into the teachers arms, which made me realize that it was an awesome daycare center. I love all the teachers, they always have smiles on their faces and positive attitudes!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106355487220241390016", "name": "Joey Keyser", "time": 1506700330803, "rating": 5.0, "text": "Since my son has been going to child care network he has learned so many new things. The staff is excellent and responds quickly to any problems or any good things that happens at school. They treat my son and every child like it's there own. Thank you childcare network # 169 and staff for making my son and I feel like family!", "pics": null, "resp": {"time": 1509047795325, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113478113579831077819", "name": "Jessica Koonts", "time": 1573551437192, "rating": 1.0, "text": "Beware! My son made it one day (only a few hours). When I picked him up all of the kids in the room were crying while the provider sat on her cell phone. The room was trashed, potatoe chips littered the floor (it was approximately 10am). My son sat in a chair, drenched in tears, and looked completely miserable. Before I went in the room, I went to the directors room to pay, she was rude, didn’t get up to greet me, and said she was busy and that she hadn’t added him to their system (they had his packet for over a week). The place felt like a holding cell for drunk inmates, total chaos and dirty.", "pics": null, "resp": {"time": 1573571429176, "text": "Hi Jessica, thank you for taking the time to share your review. It is only through feedback such as yours that we are able to maintain and improve upon the service we provide to our families. We would like to apologize for the experiences you detailed in your review, as it is not consistent with our company’s policy or standard of care. Please call 877-424-4530 to speak with our Corporate Customer Care Department to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102733578205204750793", "name": "amy danny", "time": 1458786128352, "rating": 5.0, "text": "Absolutely love this place. All of the staff are amazing. Jeffrey loves the teachers that he's had. I would and do recommend this daycare to anyone. I hate we are leaving this summer. It's going to be hard to find another place like this.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "110168122037238350626", "name": "Jay Elliott", "time": 1506828393638, "rating": 4.0, "text": "Both my girls attend this center and their after school program and absolutely love it. And the staff is like family. Highly recommend Childcare Network #169", "pics": null, "resp": {"time": 1509047729893, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107189216982052531231", "name": "P (Ed9arA11enPWND)", "time": 1492114341787, "rating": 5.0, "text": "Awesome daycare! Been using them for over a year. Very comfortable leaving my child in their care. The whole staff is awesome.", "pics": null, "resp": {"time": 1493732569640, "text": "Thank you for your response!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114643715027830862706", "name": "Meka Johnson", "time": 1363373764017, "rating": 5.0, "text": "Childcare Network is a great center. My kids have being going there for 7 years. They have a great curriculum and summer program. My kids are in the afterschool program. The teachers make it fun. The Director is very friendly and goes ABOVE and BEYOND to truly be \"The Working Parents Best Friend\".", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115286715098411149444", "name": "Tiffany Williams", "time": 1413289458299, "rating": 5.0, "text": "So glad that I moved my daughter to this school. She is so much happier going here and the personal relationships between parent and teacher is just priceless..I feel like she is with family and that is great for me. Absolutely love this school! Thanks for everything y'all do!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108390911644580454484", "name": "debbie keyser", "time": 1506651109457, "rating": 5.0, "text": "My son Landon attends this Childcare Network & loves it! The staff here is amazing!!! Landon has learned so much over the last 2 years!! They are always so nice and friendly! I wouldn't want my son going anywhere else!!!!!", "pics": null, "resp": {"time": 1509047919332, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104806860150022084336", "name": "Jenny Britton", "time": 1506828994754, "rating": 5.0, "text": "I have 3 amazing kids & I'm that momma who doesn't trust just anyone with them. My boys are school aged, & my daughter is almost 2. We've been with Ccni #169 for over 6 years off & on. I absolutely trust Stepheni Elliott the director with my children's life. She's an all around amazing lady. She treats the children as Her own.  Her staff is also very wonderful. & helpful.  Everyone is Very friendly, it's a clean facility, & has the best teachers in town. I highly recommend them to everyone I know. Price is great for the attention, love, learning & the care they give.  If I could I'd  give them 10 stars. Thanks ladies for always caring for my babies, protecting them & being there for us whenever we need y'all. #169 rocks.", "pics": null, "resp": {"time": 1509047691587, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102068573566851062720", "name": "Erica Robinson-Hill", "time": 1410399552596, "rating": 5.0, "text": "I have not had to deal with childcare for 13 years. I was fortunate enough to be able to stay home with my little one for almost 2 years. Needless to say, I was extremely nervous about placing my child in someone else's care. My husband and I were welcomed from the moment we came to visit (unannounced) the center. Prior to meeting the director, other staff members were making us feel very comfortable. The director spent approximately an hour with us. We were impressed at the cleanliness of the center as well as how organized and structured the programs are.\n\nWe only need part-time care, but were still impressed at the affordability of full-time care and were advised that should our needs change we could obtain full-time care at any time. Payment options are great as well.\n\nIt is our plan for our child to spend many years here!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104855126629260209208", "name": "Dylan Savage", "time": 1506828639566, "rating": 5.0, "text": "The teachers are great.  The director Mrs. Stephanie and her assistant is wonderful they go above and beyond to meet your needs. 😊", "pics": null, "resp": {"time": 1509047709578, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103235426364552560482", "name": "Denise McWhorter", "time": 1412283117605, "rating": 5.0, "text": "Childcare Network is a great organization. This is my grand children's first experience at being away from home. They absolutely love it. Thank You Childcare Network for helping make the transition easier for my family.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112035745007813061516", "name": "First name Last name", "time": 1491486822869, "rating": 1.0, "text": "Don't believe the hype with the reviews. They offer discounts if you give them five stars. It's a horrible feeling to pick up your kid with a pamper of of poop, dirty nose, and the room smelling horrible. They really need to tight up!", "pics": null, "resp": {"time": 1493732559874, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101973606365972658821", "name": "Benjamin Heimstead", "time": 1476626353862, "rating": 5.0, "text": "Great place with lots of room. I have two children that attend and they are always well cared for. I highly recommend them to any parent.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109216346628053368426", "name": "Labrisha hudgins", "time": 1446393239387, "rating": 5.0, "text": "Great center!! My kids loved going to the center!! The teachers are professional and  very caring. I highly  recommend them for your child care needs!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102351711852551824862", "name": "Rebecca Savage", "time": 1506826674973, "rating": 5.0, "text": "I am a mother of 3 wonderful children, I do not trust my kids with just anyone. I have had experiences with a few daycares and child care network was by far the best place I could have chosen for my kids to go. They are a very clean and friendly place. The teachers are great and very hands on with the children, and the director  Mrs. Stepheni is AWESOME and very helpful. If you have a problem she will go above and beyond to make it right.", "pics": null, "resp": {"time": 1509047838125, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103985994571871773787", "name": "Facetime Terri", "time": 1533675561377, "rating": 1.0, "text": "i learned you cant always go off reviews. i say go visit your self, and ask around verbally, and believe them the first time. good luck", "pics": null, "resp": {"time": 1535490076044, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115616847827434254267", "name": "Jessica Palmer", "time": 1413226102441, "rating": 5.0, "text": "My daughter is two and she absolutely loves going to see her friends and teachers at this CCN!  I am continually impressed by the staffs dedication to child learning, safety, and play!  I would give it six stars if I could!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117802146329438379169", "name": "Krista Brown", "time": 1395223377838, "rating": 5.0, "text": "Been using THIS facility for almost 2 years now. I moved and pulled my daughter out for a while and then had my son. Since I was no longer near this one I tried putting my kids at a different daycare. That only lasted a couple weeks, I now drive about 25 mins out of my way each way everyday just so my kids can be at this daycare! This is the only daycare I can trust and feel good that they're being taken care of. My daughter loves her teachers and constantly talks about them at home and she is learning so much. All the staff are friendly and know your kids by names even if they're not in their class. Molly actually gets excited to go to daycare so she can play. Price is good and the only thing you have to supply is diapers. The director Stefanie and her assistant Loren are awesome, along with ALL the other staff, way to many people to name!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "113069187479871638866", "name": "Vidal Rodriguez", "time": 1502032018353, "rating": 4.0, "text": "Really nice place, my kids love it. They do a lot of different activities during the week to keep the kids entertained.", "pics": null, "resp": {"time": 1504620841273, "text": "Thank you for your review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107067552357276901124", "name": "Hailey Harris", "time": 1448296561722, "rating": 5.0, "text": "I love Childcare Network. I feel safe when I drop my two babies off knowing that they both have wonderful teachers to look after them. The staff are all very nice. Both of my children have learned so many new things and they have only been attending a few months now so it's safe to say i'm a very pleased mother! I look forward to the years ahead of them attending here!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107121782027184352770", "name": "Breanna Savage", "time": 1506828758421, "rating": 5.0, "text": "The director Stepheni and her assistant are amazing people. They do everything possible to make sure your kids are cared for. Couldn’t ask for a better daycare!", "pics": null, "resp": {"time": 1509047701022, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111873776292630679900", "name": "Laquesha Sanders", "time": 1506828621423, "rating": 5.0, "text": "Childcare Network #169 is a awesome school.My children have been attending this facility since they were 6 weeks old.The staff is  professionally trained,very friendly and polite.I would highly recommend them to any working parent's.", "pics": null, "resp": {"time": 1509047750728, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117473344090074990580", "name": "Markaya Tillery", "time": 1506653006429, "rating": 5.0, "text": "I have heard such great things about your school. Debbie Keyser has never had anything negative to say. Landon loves his school very much and has learned so much.", "pics": null, "resp": {"time": 1509047765609, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111900377350133016334", "name": "Emily Murphy", "time": 1455244038075, "rating": 5.0, "text": "We have only been here a few weeks, but the staff is really nice.  I love his teachers and everyone I talk to are crazy nice", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100273397424063345141", "name": "craig chapman", "time": 1394828194234, "rating": 5.0, "text": "For years Childcare Network has provided the best, and most professional of care to my grandchildren. The staff is always kind and caring, willing to assist in every way possible, thank you Childcare Network.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101722058819039312398", "name": "Haley Kelcy", "time": 1506829883332, "rating": 5.0, "text": "Childcare network 169 is a wonderful school. The staff is so great and super friendly!", "pics": null, "resp": {"time": 1509047669972, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103586207344466468637", "name": "shannon collier", "time": 1506651072292, "rating": 5.0, "text": "My nephew Landon Keyser goes here and he loves it and his teacher! Place is neat and clean!", "pics": null, "resp": {"time": 1509047908348, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112470804804835729813", "name": "T Herring", "time": 1412110535561, "rating": 5.0, "text": "Being a working parent is hard.  You worry alot about your child.  You worry about their safety, and you worry about their day while  they are away from their family, in the care of others.  Since changing my daycare to Childcare Network, my worries have greatly decreased.  My mind is more at ease during the work day.  My child is happy when she is dropped off, this is what matters to me in a daycare.  Sometimes you think a newer building, a higher tuition, or an affiliation will make for better childcare.  You may have to re-evaluate how you determine good childcare.   If your child runs to their teacher, and all the other teachers know her name as she is leaving..... that is the sign of good childcare.\n\nThe school age program is very good as well.  The facililty's school age room is also very updated and very age appropriate.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "109946996148804562651", "name": "zachary christian", "time": 1506653213403, "rating": 5.0, "text": "Debbie Keyser's son Landon goes here and loves it. Highly recommend this place for your children!!!", "pics": null, "resp": {"time": 1509047774654, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "114489419511252273612", "name": "Lisa Singleton", "time": 1506652856427, "rating": 5.0, "text": "Childcare network 169 is the best!! Debbie Keyser's son goes here and loves it! Heard great things about Childcare Network 169!!!", "pics": null, "resp": {"time": 1509047983561, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108711465469148690233", "name": "Debra Keyser", "time": 1506651222998, "rating": 5.0, "text": "My grandson Landon goes  here they are very loving and caring teachers  i would  highly recommend them.", "pics": null, "resp": {"time": 1509047932465, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111724122616853462260", "name": "Christina Love Holmes", "time": 1506652700685, "rating": 5.0, "text": "Debbie and Joey Keyser love this place! I've heard nothing but great things!! Highly recommended 😊", "pics": null, "resp": {"time": 1509047971791, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "101614353680917904448", "name": "Chianti Thomas", "time": 1455203291617, "rating": 5.0, "text": "I love work here and my youngest daughter love coming here. It's a great place to be......", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104307182280512490021", "name": "pamela kidd", "time": 1363355225501, "rating": 4.0, "text": "My son is not the type of kid that likes school but after I enrolled him at the Childcare network he loves going to school. I like the fact that he has homework every week. I feel it gives him a since of responsibilitly. Overall, I am glad I pick the childcare network for my son's first expericene of preschool.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "107627302866370449935", "name": "Daniel Britton", "time": 1506829108755, "rating": 5.0, "text": "Great place. Good people. Reasonable prices.", "pics": null, "resp": {"time": 1509047675300, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "115274757706770895378", "name": "Erica Hurst", "time": 1490393892268, "rating": 1.0, "text": "I don't like the idea that they offer a discount for writing a good review. I've had many problems since my son started attending. The following of policy and procedures are questionable. My child stays sick. I do like some of the teachers but again things are questionable.\nI've witnessed things that I know are not proper policy like changing children's diapers in the floor.\nI", "pics": null, "resp": {"time": 1491245409351, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "118248626441964847063", "name": "Constance J", "time": 1506652667386, "rating": 5.0, "text": "My friend Debbie Keyser takes her son Landon to Childcare Network on 169 & he absolutely loves it! Debbie & Landon both love the staff!!", "pics": null, "resp": {"time": 1509047946265, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "103808145144504545852", "name": "Wanky Thomas", "time": 1478449711526, "rating": 5.0, "text": "Outstanding after-school care for any parent considering to enrolled there child into this program with outstanding result!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "104890901343860388153", "name": "Jerry lee Savage", "time": 1506827351101, "rating": 5.0, "text": "The faculty is very polite and professional, school is always clean and organized!!", "pics": null, "resp": {"time": 1509047720681, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102990706181603890645", "name": "Wendy Cameron", "time": 1506808761294, "rating": 5.0, "text": "4 of my Grandchildren have went to this day care, the team work they have starting with there Director Mrs Stepheni is more than you could ever ask for, Mrs Stepheni is the most friendlest person I think I have ever met over the last 4 year's I've seen the way she is with her staff and Children at the daycare most importantly the children and you can tell how much those children love Mrs Stephanie as well as the parents and her staff I thank God that there is a daycare out there that has a director that cares about the Children and staff like Mrs Stepheni! and there are no discount for giving them a 5 star rating. Thank you Mrs Stepheni and staff at childcare Network #169", "pics": null, "resp": {"time": 1509047815860, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "111698858551078694409", "name": "Realtor Haley Adams", "time": 1506828438463, "rating": 5.0, "text": "Such a caring and dedicated staff!  As a local realtor, I am constantly recommending Mrs. Stepheni and her staff at CCNW 169 to my clients new to the area.\nWhen you choose CCNW 169, you aren't just putting your baby in someone's hands, you're putting your baby in someone's hands you can trust!!!", "pics": null, "resp": {"time": 1509047739060, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "108686196410113201274", "name": "Labrina Jones", "time": 1366118956393, "rating": 5.0, "text": "came to the states 2011 searched for a daycare for my son didn't really like to many than I came upon childcare network the teachers are the best they made me and my child feel like we was at home. they are very clean, organized and caring. my child been going here for 2 1/2 years and he  love it. the director Mrs.Kabrina she is the best she make sure her staff do their job and do it to the best of there ability, she walks around daily and check each and every classroom if there's a problem she will address it in a professional way. I love Mrs. Kabrina and her staff in her class its going to be sad to have my child go off to kindergarten when he loves this prek program.", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102467198449630806741", "name": "Bradley Lyons", "time": 1502921562294, "rating": 1.0, "text": "Don't send your child here. My daughter has been bitten three times by another child and the teachers have done nothing. I've heard a teacher tells kids to shut up while dropping off my daughter. They do not change diapers nearly as often as they should so my daughter has a constant rash. This place should be shut down. The teachers there don't pay attention and there are way too many children in one room at a time with one maybe two teachers. Worst daycare I've ever seen.", "pics": null, "resp": {"time": 1504620790601, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "110888813726953861614", "name": "Chris Johnson", "time": 1458226295694, "rating": 5.0, "text": "Such an awesome place for a kid to be! Great atmosphere, great teachers. I've been using this daycare for over a year now and havent had any reason at all to look for another daycare. Stephanie and Kelly are the best coordinators ever!! They work really hard to keep that place clean and safe also my son has CF and has special needs, has to take medicine and has to do therapy everyday and they make sure it gets done. My son, Kash, has learned so much and has met alot of new friends in the short time that ive been using this daycare. I love this place and so does my son! thank you guys so much!!", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112028605250662399315", "name": "Terran Nichols", "time": 1412220230185, "rating": 5.0, "text": "Great place! Loved the teachers and the curriculum", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "112475840415048354211", "name": "Shawn Johnson", "time": 1506652952810, "rating": 5.0, "text": "My nephew London keyser goes here and his parents speak so highly of this day care,im considering enrolling my twins here !", "pics": null, "resp": {"time": 1509047995294, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "102230131251676624290", "name": "Hyrel Walsh", "time": 1413569693922, "rating": 5.0, "text": "My Great grands tell me they <3 it!! :-)", "pics": null, "resp": null, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "100374613251113555965", "name": "Amanda Herbine", "time": 1533373276913, "rating": 2.0, "text": "They need to drug test their staff!!!", "pics": null, "resp": {"time": 1535490067602, "text": "We are interested in helping with any and all concerns regarding your experiences with our school. Please call 877-424-4530 to speak to parent services to discuss this matter further."}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "117045102858677899679", "name": "Stepheni Elliott", "time": 1506827317778, "rating": 5.0, "text": "I love this school!!!", "pics": null, "resp": {"time": 1509047850432, "text": "Thank you so much for your positive review!"}, "gmap_id": "0x888cd1f929061a95:0xe4d0ee862ebd627b"}
{"user_id": "106164141656186991920", "name": "Gary Grimes", "time": 1562144653147, "rating": 5.0, "text": "Fun for kids", "pics": null, "resp": null, "gmap_id": "0x8888dca0160eca41:0xf29624755a328497"}
{"user_id": "105371521628203230677", "name": "Jayne Wilson", "time": 1493384751570, "rating": 5.0, "text": "Very family orientated", "pics": null, "resp": null, "gmap_id": "0x8888dca0160eca41:0xf29624755a328497"}
{"user_id": "109452318790210321813", "name": "Beverly Doyle", "time": 1620050622138, "rating": 5.0, "text": "My son has enjoyed the transition to BBMA and they have been amazing through the entire pandemic. I appreciate their efforts to keep the kids safe!", "pics": null, "resp": null, "gmap_id": "0x888c933b5eb14285:0xfd9870e1e09f7486"}
{"user_id": "116314851762972347449", "name": "Kim", "time": 1559313013662, "rating": 2.0, "text": "I have to write this review so parents will know exactly what to expect. First this is the cheapest and best price daycare center it's only $50 a week and they have regular daycare hours 6am- to 5pm. SOME of the teachers are very nice and do their job as far as interacting with the kids, cleaning up, and checking children. But MOST of them look like they don't want to be there and they don't try to hide it. I have witnessed a very older lady that works there jack a toddler up by the arm and shirt. On lady yelled at a 2 year old  \"Walk faster or you can't go outside!\" And because the toddler could not she made him stay inside. He cried so hard it hurt my heart. He didn't understand and she needed to be patient it wasn't like he was being disrespectful he just didn't walk fast. Cups were left on the floors several times, on time I came to pick up my toddler another toddler had his cup in his mouth. The girl that was in there was new and thought the cup belonged to the other toddler. My Son's cup was labeled.", "pics": null, "resp": null, "gmap_id": "0x888cf3142ed4f69f:0x4ef249609b38c573"}
{"user_id": "107748946242011219344", "name": "James Black", "time": 1551459799991, "rating": 1.0, "text": "AWFUL", "pics": null, "resp": null, "gmap_id": "0x888cf3142ed4f69f:0x4ef249609b38c573"}
{"user_id": "112554992326868700494", "name": "Jobs Bham", "time": 1580837030791, "rating": 5.0, "text": "We have been here almost a year and LOVE it. My son started when he was just over a year old in the Starfish class. Hannah, Haley, Olivia, Stephanie, Brittany,Nate, Kelsey, Melissa, are all so responsive. Everyone is very nice, they have a great curriculum and my son has learned SO much since he has been here. He just transitioned to the next class, and has done great. Miranda is so sweet and loving to all her children in the class. Can't say enough good things about this place.  Only downfall is that tight parking lot.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "115711114034754827075", "name": "Shyesa Granger", "time": 1531835316904, "rating": 5.0, "text": "Where do I begin to express the level of love, passion, and appreciation not only as parents I have for this school but our has daughter too! They are hands down the best place for your babies. From infant to school age care, they are well equipped for the academic, cognitive,emotional, and world adventures ahead of them. My daughter has been here since 1.5 yrs old and she’s well prepared for Kindergarten, as she asks to be quizzed in the car daily on math, science, spelling, and most importantly her facts on the Lord!! Thanks to all the staff and their love for our precious little ones, we as parents never had to worry a day she’s there. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "111525890168679962999", "name": "Catherine", "time": 1551399125597, "rating": 5.0, "text": "My son has been going to this school since he was 11 months old, he’s been in 3 classrooms and all the teachers have been incredible. The staff is so kind and sweet, they always let us know when something happens to him. He’s so well taken care of, I wouldn’t want him to be anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "112147048019439728339", "name": "Adam Owens", "time": 1551380197758, "rating": 5.0, "text": "My son has been going to this daycare for over 2 and a half years and we love it. I have always enjoyed spending time with my son so it is not uncommon for me to him off in the morning and stay for 20 minutes or longer to hang out with him and his friends in his class.  The teachers have always been appreciative of me spending time with him and when he was younger, I would stop by at random times without warning just to check on him, to see him and was always greeted and got a chance to know his teachers. I have appreciated the curriculum because my son always comes home having learned new words, colors, shapes or just singing a new song. He loves to go to school and loves to be with his friends. All the kids I see usually are really happy and smiling. He moved up into classes with older kids at times which I appreciated because in order for him to learn to crawl or even walk, it was helpful for him to see other kids who were already doing those thing so he could mimic what they did. We love the staff and the hours and I feel confident that he is taken care and truthfully the teachers as a whole are not appreciated as much as they should be because it's a hard job and not everyone can handle that stress. We have recommended this school to numerous friends who have their kids now and it is nice for us to watch them grow up together.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110056607960264182440", "name": "Latraunda Smith", "time": 1500390052723, "rating": 4.0, "text": "My Daughter has been here since she was 8 months old.  She likes it and enjoys her little friends. I can tell she is learning so many different things. I really appreciate the meals they provide they are well balanced and fresh!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103454785843009009204", "name": "Rachel Samuel", "time": 1465785111671, "rating": 5.0, "text": "Wonderful people, excellent school. Both our kids went there for 3 months and loved it. We had to change only because it was way too far for us and if they open a branch in Hoover, it would be amazing.\nMr. Chris is very supportive and really good with kids. They personally know each kid and how their day was. A special mention and a big thanks to both teachers, Miss Kendrika and Miss Taylor. Our babies still miss you guys. God bless you people for all the good work you do. Thanks", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "108549760505356603610", "name": "Joshua Perry", "time": 1570222968254, "rating": 1.0, "text": "This daycare is below standards in the personnel running this daycare and its staff. Unprofessional and unclean. This is more like a place to drop off your children to be babysat than to learn and grow. The rooms are small and the building is old and the staff is very young and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110769963648522258386", "name": "Stacey McIntyre", "time": 1464285953813, "rating": 5.0, "text": "Great school for many reasons:  they teach children in a loving way to read,, write, exhibit good character traits, have a love for learning Biblical lessons along with wonderful teachers, staff and owners.  And the cherry on top....at a reasonable price for what all you get!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "118248202318085508053", "name": "Autumn Hiett", "time": 1551286822188, "rating": 1.0, "text": "My son is 10 months old now and started at Grace in the guppy class at the Ridge location. We loved the teachers and that class so much. One morning when he was in the guppy class I was dropping off my son and the lead teacher of sea turtles was opening that class. My son had a blow out so the teacher was changing him and I was standing there helping her. As I’m talking to her she is taking his clothes off and then begins to use his outfit to wipe his stool off his entire body. His outfit ended up having to be thrown away because after three washes it was stained. I mentioned it to the admin and the director and nothing was done. Everything was great until he moved up to the sea turtle class. We did not want him moving up to that class because he was only about 7.5 months old. He wasn’t even crawling, but was attempting to crawl. They kept pushing me to move him up even though I expressed my feelings towards it several times. They stated he was “too big” for the guppy class and he couldn’t fit in the swings anymore. He was a 7.5 month old who couldn’t even crawl, in a class full of 1 year olds who are walking. After he moved up to the sea turtle class we started having issues instantly. The lead teacher would tell me what to do and not to do with my son. He came home with three knots on his head over the period of time from when he moved up until this week. Nobody called me to inform me that he had hit his head either. When I picked him up the teachers or admin staff would state they didn’t know how he got the knots and bruises on his head. Also, every day when I pick up my sons nose is crusted with snot. It clearly hadn’t been whipped off all day. His clothes would be covered in the foods they had eaten that day too. Several times I would have to change his clothes and clean him up before leaving because he looked so bad. On many occasions he came home with 3 out of 4 bottles still filled with formula that I had pre made that morning. The teachers would state he refused to eat. Let me mention that my now 10 month old is 27 lbs, he doesn’t miss a meal. When I would pack his bottles up to leave he would get so excited like he wanted one, so I would give him one and he would drink it so fast like he hadn’t eaten all day because he hadn’t. They only gave him one bottle for an entire 10 hours. When my son was close to 9 months old he came home for a week straight throwing up randomly and having bad stools. I finally took him to the doctor thinking he was sick. I came back to the daycare the following week and told his teacher that his doctor said he was fine. That is when I find out that his lead teacher had been giving him whole milk with his formula without asking me or even telling me for an entire week. What if my kid was allergic or I didn’t want him to have milk? The doctor even recommends children not have whole milk till they are a year old. I expressed my feelings towards her stating all my concerns about it and she states in that class they train the children on whole milk. I told her not to give it to him anymore but I would find out from the other teachers that she continued to give it to him. One day I had to pick my son up during nap time for a doctors appt and she told me to shhh that I would wake the children up. Let me mention I was whispering asking how my son was that day. The same teacher has gotten a stern tone with two of the other kids in his class while I was in there talking to her during drop off, so it makes me wonder how she is talking to my son without me there. These are only a few things that have happened. The director was aware but never did anything about it.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "114329012990978862549", "name": "Jenifer Phelps", "time": 1472481050331, "rating": 5.0, "text": "Wonderful place! Our daughter loves it here. She is always talking about her school now. She's learned so much since she started. She talks about all her friends, water day, her teachers, and about the songs and lessons she's learned at school.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103030316341926541305", "name": "Melissa Jackson", "time": 1551402400626, "rating": 5.0, "text": "Great place to work!!!! Great place for your child/children!!!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "112160728932164480160", "name": "Jamie Rathbone", "time": 1515086972996, "rating": 5.0, "text": "They are so wonderful with my girls my three year old girl hated it to start with but two wonderful teachers have her loving big girls school and Dottie is just a wonderful lady very easy to work with I'm just thankful for a good place for my children to go and I totally recommend them", "pics": null, "resp": null, "gmap_id": "0x888c475570029e99:0x93b9215eaa42ae3a"}
{"user_id": "116805157457535040004", "name": "Malena Warren", "time": 1624056935500, "rating": 1.0, "text": "My daughter attended the location in Madison. The staff there lacked the training, education, care or simply the common sense to recognize that my child was in respiratory distress. In fact one member of staff stated “yea I was thinking it was asthma”. They did however recognize that she had a fever. To add insult to injury they have yet to call and check on her as we continue to sit in pediatric ICU for now 3 days. I excused A LOT of the behaviors this location displayed from loosing my child’s belongings, to putting other children’s belongings on my child repeatedly, to giving her foods they were told not to give her, but not recognizing that a child is not breathing well is inexcusable!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "116009046360017387272", "name": "Anna Kinton", "time": 1615410955554, "rating": 1.0, "text": "My daughter was one of the first kids to start attending when they opened the first location. In the beginning, it was great! It was what I as a single mother desperately needed. It went downhill fast.\n\nThere were many times that the meal I sent with her was not used and they started charging me for the extra meal. I had to work at putting a stop to this. The meals, at least in the beginning, were told to me as being \"organically catered\" but that was clearly not true or had fallen away pretty quickly.\n\nAt the time, we were vegetarian - which was on her paperwork and discussed with the owner. But I learned from my reluctant daughter, who was worried she would be in trouble, that there were many times she would be required to finish her whole meal to get dessert, which included chicken nuggets. That is a ridiculous position to put a small child in.\n\nWhen I reached out via email to discuss the issue, one of the co-owners - Joey - essentially said I was lying and said no child is ever forced to eat something they don't want and did not investigate it or properly address the issue. Funny, because he wasn't even there most of the time. I still have those emails to this day.\n\nThere was also the issue of her meds not being given to her and being routinely \"forgotten.\"\n\nDebra-someone rose to being in charge and she was a very cold and rude person. Despite always paying my bill on time and being one of the original customers, she began requiring me to prepay - something which other parents I spoke with did not have to do. But interestingly enough, it was after I had raised concerns about the food issue and then the medicine issue.\n\nAt one point, I had to be out of work for a month because my daughter had caught from the daycare strains of influenza, strep, staph, and had a full blown case of MONO. I had never heard of anyone having mono younger than a high-schooler! It was made obvious then that they do not clean well enough.\n\nThe last and final straw was the lack of care and protection from the teachers. Despite being the older kid most of the time, she would get hit a bunch by the younger ones. She would tell the teachers who in turn wouldn't do anything, or she would be the one who got in trouble. I tried coaching her on how to protect herself and what to say, but she had a huge fear around doing anything and getting in trouble. No matter what she did, she said she got in trouble when she tried to stop from being hit or complained about it.\n\nI pulled her out and never took her back. She's almost 13 and still talks about how glad and relieved she is to never have to be at daycare. And sometimes I learn new things about her time there, and I overall regret that she spent any time there since it has been such a shadow in her mind.\n\nThis place can't even do the basics. I would never recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "102478510957492773121", "name": "Joseph Ayers", "time": 1532484043373, "rating": 5.0, "text": "Awesome child care option! My kids love it here. They love the sweet teachers. They are always bringing things home that they learn about. They are very happy to be dropped off. I feel safe here. It’s new and nice. They always adjust if I need to drop to part time or even if I need time off. Our area is so lucky to have this child care option!!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "118195363127870321472", "name": "Sybil Gibbons", "time": 1458054945674, "rating": 5.0, "text": "Like some families we do not have family here and KidTowne has helped so much. When we needed a full-time daycare at the last minute KidTowne was there and welcoming. Since our youngest has started school we only need KidTowne during school breaks and whenever mommy and daddy want a date night. Thank you so much for all of the hard work the many conversations and kindness Ms. Deb, Andrew and David.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "112852574436978280579", "name": "Shivonne Smith", "time": 1501620217578, "rating": 1.0, "text": "First let me say that this daycare was what I considered to be, my lifesaver in the beginning. This was primarily because of the extended hours of operation. I was working a job in Retail at that time, and did not have the luxury of people lining up to care for my child while I worked. Long story short.....   Several instances where I would pick up my daughter to find her face, nose, clothes, etc. FILTHY. Not once or twice, but over 15-20 times. I always provided change of clothes but they were NEVER used. She was always very thirsty and hungry-as they do not serve dinner until 7 p.m.\nI emailed the Director to schedule a meeting with her and the owner, to which she took days to reply. One day before the such meeting, I walked in to find my daughter with a snotty nose as an employee crouched in the corner texting on her cell phone. I was later told that BOTH owners were just TOO busy to meet with me so I sat down with the Director only. She assured me that things would improve. One being their extremely high turn over rate-that did NOT change. My daughter no longer attends this daycare. Please PLEASE do not leave your children with these people. On my daughter's last day there, while not being attended to; another child in her over 2 1/2 yr room shut her hand in a door!!! The Director nor either owner EVER called to say \"I'm sorry\", \"How is she\"... NOTHING.\nActions speak VOLUMES.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "111205050632765327637", "name": "Cody Brewer", "time": 1486502314864, "rating": 5.0, "text": "The best place to leave you child. Rita is exceptionally attentive, and has your child's best interest at heart. The absolute BEST place to have someone watch your child.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "111375550807231069290", "name": "brittany ortiz", "time": 1531258277356, "rating": 5.0, "text": "My daughter is 4 years old and is always happy to go to Kidtowne. We love the flexibility of being able to use it 7 days a week as our schedules vary. We use it for our 9 year old as well when we need a \"sitter\". Every person that works there is friendly. I also appreciate that it does not have a bad odor, as some childcare places do. I recommend Kidtowne to many people moving to Madison and consider it a great asset to the community.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "105861014711752205746", "name": "Anonymous User", "time": 1511856810296, "rating": 4.0, "text": "i love bringing my child here because she learns so much! The staff is so friendly,  I do Rita and Ashley were still working here though!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "117024389915904390062", "name": "MELANIE M (Somewhere Alabama)", "time": 1516106579765, "rating": 1.0, "text": "I myself would not take my children there. All food is cooked using a microwave. I Know to ask every day care how meals are prepared now.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "115625084595458408770", "name": "Anon feth", "time": 1457132604814, "rating": 1.0, "text": "I really don't think these people are qualified to run a daycare. Also, the \"teachers\" they hire to watch your children are very young and have practically no experience. Drop your kids off at your own risk, I'm surprised they haven't been shut down. I'll be calling DHR.", "pics": null, "resp": {"time": 1470414115030, "text": "We are sorry that you had a poor experience. We do not feel that the experience described is typical of the care provided here at KidTowne. Many of our teachers have degrees in early childhood education and all participate in rigorous training. Please give us a call if there is anything further we can do to help resolve your concerns and pinpoint any specific events."}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "101573086581830669870", "name": "Guy Hippleheuser", "time": 1492019389611, "rating": 5.0, "text": "We have two kids that have attended KidTowne for several months and can't say enough good things about the staff. We shopped around for the best daycare when we moved to the area and have to say that we made the right choice!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "102781215082073276326", "name": "Beyond Nail Spa", "time": 1461246191782, "rating": 5.0, "text": "Very clean and nice place. I love the flexible hours and people work here.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "116484233083284217885", "name": "Breanna Harris", "time": 1512178524709, "rating": 1.0, "text": "This place is so dirty they do not use sanitizer for anything. The bathrooms are always dirty. They don’t make sure that the kids are cleaned after they use the bathroom or that they was their hands. The owners are never there. They just assume. They don’t take pride in their daycare. It smells like dirty diapers all the time. I wouldn’t send my child their at all. Plus this day care doesn’t even have a oven. They only have microwave food and it’s not what they tell you they kids will be having for the week. They don’t have dish detergent to wash dishes. They just dip the dishes in some type of water solution. Their is still food that will be left on the dishes. It’s a lot of mess that’s in that building and they don’t pay enough for the work they ask for.  If i were I’d take my child anywhere but there.", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "112560404216566117827", "name": "Stan Reese", "time": 1470499648738, "rating": 4.0, "text": "We have never worried when we dropped our kids off here. The staff seems to love kids and our kids always have fun.", "pics": null, "resp": {"time": 1470613371169, "text": "Thanks for the review! We always enjoy having your sweet kids around!"}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "104662944056814806933", "name": "Mr Information", "time": 1486219970139, "rating": 1.0, "text": "Walked in and saw kids bottles propped up with baby quilts and other propping tools. Small babies on the floor making it easy to trip and fall or drop something on the kids. Madison location is horrible", "pics": null, "resp": {"time": 1486491224389, "text": "We are very sorry that you had a negative experience. Please give us a call and speak with a manager. Propped bottles are certainly against our policy. We would like more information and an opportunity to resolve your concern."}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "111025247278940458523", "name": "Lydia Pinkston Gray", "time": 1457109189263, "rating": 1.0, "text": "Really really terrible staff. They didn't know how to handle a 3 year old tantrum and called me to come and get him because he was \"scaring the other students\". Then they told me that he was not welcome back. His tantrum was because he had bit his tongue, and it was hurting, and they were trying to make him eat. If you are going to run a daycare, you need to know how to handle a young child breakdown. It is GOING to happen, guaranteed. The two owners have no idea what they are doing, one had only WORKED in a daycare a handful of years before deciding to open his own, and the other one wouldn't even disclose his history. If you drop your kid off here, who knows what kind of care they are getting.", "pics": null, "resp": {"time": 1470414387347, "text": "Mrs. Pinkston, We see that your child last attended in 2013. Please give us a call so that we can resolve your concerns. We would be more than happy to share with you information concerning the degrees and experience of our owners as well as our staff."}, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "110875785077912197685", "name": "Jessica Jackson", "time": 1462990943166, "rating": 5.0, "text": "We absolutely love Kidtowne!  Everyone is very friendly and my son loves going there!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "100503568814906216094", "name": "Margerita Martinez", "time": 1457556996490, "rating": 5.0, "text": "I drop my niece off here often and she loves the staff. The facility is very clean and friendly!!", "pics": null, "resp": null, "gmap_id": "0x88626f62c0ce5887:0xe9e099118a93786f"}
{"user_id": "104458556672187548740", "name": "Ashlee Eastham", "time": 1622835699746, "rating": 5.0, "text": "Our daughter has been here since she was like 8 weeks old. She's 2 now and our experience has been amazing. All of her teachers have been sweet and great with the kids. When I go pick her up, I never hear tons of crying kids. They are happy! Can't reccomend enough.", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "115779836355485980687", "name": "LeeAnn", "time": 1552888424522, "rating": 5.0, "text": "Both of my kids have been going here since they were 11 weeks old, my oldest is 4 yrs old now and we love it here. The teachers are attentive and loving towards the kids. I’ve never had a bad experience with anyone who works here. I love that the infants have their own building and individual outside play areas. The owners, Pam and Tina are great and are always available to answer any questions we may have. It’s been a great daycare for my family and I would highly recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "112070463315952051508", "name": "Stephen Walls", "time": 1547057193522, "rating": 5.0, "text": "I think it's important to note that every bad review for Slaughter Road CDC was written by someone who DOES NOT have kids there. Their lack of response to phone calls is likely because they're being attentive to the kids that are there! Teachers are quick to give you their personal numbers for reaching them and they are quick to contact the parents when necessary. We have had our son here for nearly 2 years and it has been nothing but a great experience. It is a wonderful small-family atmosphere and they have helped our son grow and mature so well. I'm always impressed at the new skills he learns every week!", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "103048727101640839031", "name": "Courtney Warner", "time": 1533868398586, "rating": 5.0, "text": "I have 4 kids and they each went to daycare here, starting in 2012 up to now. We tried other places before this one, and this is hands down the best daycare I have ever known. I absolutely love the staff. It's a family business run by mother and daughter for over 30 years. Very small classes. The \"baby building\" has 8 rooms divided by age from newborn to 2 yrs old - average class size is 4-6 kids. The other building has 4 large classrooms, again divided by age from 2 to 5 - average class size 8-12 kids. All of the teachers are kind, responsible, and loving. I have never heard a teacher yell at a kid, my kids have never come home with injuries. As a matter of fact, they adored each of their teachers. You can tell by a kid's reactions whether someone is treating them right. And my kids would run up to their teachers to hug them in the morning. Even now, when we go pick up little brother, the older kids want to go in and say hello to their old teachers. I am an obnoxiously overprotective mom, and this is the one place where I can leave my baby and still have peace of mind. These people care for the kids like their own. They are down to earth and easy to communicate with. I think it's more than just a daycare/school for the kids, its like a home away from home. We have been absolutely blessed!", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "117609473759118596883", "name": "Courtney Brooke", "time": 1551702441214, "rating": 5.0, "text": "I see quite a few reviews on here about rude and unresponsive staff. I called the center at 0630 in the morning. The lady who answered the phone was very sweet. They didn’t have any openings for my sons age, but she gave me a few other suggestions for places that might. Very long waiting list but in my opinion that really says something about this center.", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "115956262125306067750", "name": "Iman Jones", "time": 1566047374135, "rating": 5.0, "text": "i want there as a pre schooler and for daycare and it was the best experience ever", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "104819572461079106980", "name": "Grace Chen", "time": 1466176731000, "rating": 5.0, "text": "Both of my kids went there. We all love the daycare and the teachers who really care about the kids. I also like the small class size for little ones, as it definitely helped preventing little ones from getting sick frequently. Most of the teachers are there with the owner for a long long time. We used a fancier daycare before, but the turnover rate was so high, for a 9 month period, my 2 year-old had 5 teachers.", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "109553925927640738881", "name": "Jason Manthey", "time": 1512427490438, "rating": 1.0, "text": "My wife and I have been looking for a day care and have tried to call this place about 4 times. My wife has left a message with her phone number asking for a return call and info, I’ve left a couple messages with the same. Makes you wonder what would happen if your kids were there and you needed to contact the day care about an emergency.\n\nI guess you guys have answered our questions with your lack of answering our questions. It’s too bad because your location would have been incredibly convienant for us.", "pics": null, "resp": null, "gmap_id": "0x88626f2f2cd2e859:0x4cfe5a14e1694d95"}
{"user_id": "103579174212771347048", "name": "Rhonda Woods", "time": 1578039184672, "rating": 1.0, "text": "My 1 year old grandson had bruises around his neck, scratches on his chest and face. No one could provide any information as to what happened. Management was unconcerned and nonchalant. DO NOT BRING YOUR KIDS HERE!!!! Pay a little extra for a peace of mind. This place is a NIGHTMARE.", "pics": null, "resp": null, "gmap_id": "0x88891c17d308bb15:0xa4e3e69a7e240eef"}
{"user_id": "104369371603549193053", "name": "Brian Spoonire", "time": 1540927240411, "rating": 5.0, "text": "Office is easy to find at 501 Princeton, and they have a whole children's-sized 2 acre campus complete with a little playground.", "pics": null, "resp": null, "gmap_id": "0x88891c17d308bb15:0xa4e3e69a7e240eef"}
{"user_id": "108783939158751704376", "name": "Belinda Washington", "time": 1502853206688, "rating": 1.0, "text": "Worst daycare I have ever known. They DO NOT take good care of your kids. My grandbaby  went there for a week, every day  he was wet and hungry when I picked him up. The owner and workers need their ASS KICKED", "pics": null, "resp": null, "gmap_id": "0x88891c17d308bb15:0xa4e3e69a7e240eef"}
{"user_id": "116173000297876424545", "name": "Laura Brooks", "time": 1564802684592, "rating": 5.0, "text": "Awesome! Everyone there is so kind and caring.  My children love going there.  The past 5 years have been wonderful!", "pics": null, "resp": null, "gmap_id": "0x887d4f36fef1b49b:0x1dba19de51bec88d"}
{"user_id": "108686916702594191147", "name": "Ashley Bates", "time": 1560957744585, "rating": 1.0, "text": "Do not send your child here. They don't pay attention to the children. My daughter had rocks thrown at her at the playground and no one was paying attention. My daughter cried and begged not to go back. Today while my grandmother dropped her off she witnessed NO ONE paying attention while another child hit another child and tries to knocked them down. Unless you want your child bullied while the workers aren't paying any attention, DO NOT SEND YOUR CHILD HERE!!!", "pics": null, "resp": null, "gmap_id": "0x887d4f36fef1b49b:0x1dba19de51bec88d"}
{"user_id": "105040849405940354148", "name": "tommy behel", "time": 1520253664386, "rating": 1.0, "text": "Never send ur kids to this place or any Johnsons daycare. They will bully ur child around. I, know I've been there when I was a kid, not sure if I can even sue for mental state of mind what they done to me. Specially the poor kids they love to pick on them the most. Barbara was one of them.", "pics": null, "resp": null, "gmap_id": "0x887d4f36fef1b49b:0x1dba19de51bec88d"}
{"user_id": "104540090658671445641", "name": "Dxme Does", "time": 1469314309718, "rating": 5.0, "text": "Fascinating", "pics": null, "resp": null, "gmap_id": "0x8888e064814a3c4d:0x39b79ab966ac6d79"}
{"user_id": "107695779955104319481", "name": "J O", "time": 1512482171196, "rating": 1.0, "text": "1 star for a daycare that supports child molesters seems pretty generous, but Google doesn't have an option for 0 or negative stars. However, I suppose that it is only a 0 star church for people that don't want their children molested.\n\nFor those \"Conservative Christian Values\" parents who are hoping to have their very young daughters groomed (sexually assaulted) by old Christian men who need a broken, obedient wife who never talks back... This daycare  would probably be 5 stars.\n\nSo... If you support child molesters and wish to place your children in the care of people who also support child molesters, living way ministries daycare might be a great fit. If you don't support child molesters and don't want your children near those that do... Maybe find a different place.", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "118138909642223551442", "name": "Joseph Stoney", "time": 1512567194997, "rating": 1.0, "text": "If I could give 0 stars for this place, I would. How in the world can you even think that comparing Roy Moore to Jesus was the right thing to do? This is disgusting. Roy Moore was accused of sexual assault on minors from women who didn't even know each other. There are documents showing his signature that indicate that he is the child predator that America thinks he is. I don't have children, but I would never send my child to this place. As a matter of fact, I'm hoping this business shuts down because people see your sign all over the internet and realize that you are promoting child sexual assault. You should be ashamed of yourselves.", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "103421989147179833602", "name": "Adam Gantner", "time": 1512574524899, "rating": 1.0, "text": "Who in the world would trust their kids to a church that supports raping children.  Find a new place. Disgusting", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "112286089045311452183", "name": "Porter Hodges", "time": 1512533154508, "rating": 1.0, "text": "The whole denomination supports pedophilia - great place to have your daughters virginity taken", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "103864230104786635562", "name": "David Stevens", "time": 1512607472600, "rating": 1.0, "text": "They support an alleged child molester. Kids will probably not be safe.", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "114545428006939769004", "name": "Michael Oleksak", "time": 1512323246864, "rating": 1.0, "text": "Not only is it wrong by the laws of the land for you to support a political candidate, but it is blasphemous to compare Christ to Roy Moore, an accused child molester.", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "110703563575400299207", "name": "Mitchell Warnken", "time": 1512870112821, "rating": 1.0, "text": "Terrible place that supports pedophilia", "pics": null, "resp": null, "gmap_id": "0x888ceb58227d2989:0x5b5864d8db75b8af"}
{"user_id": "117703946227358848398", "name": "Emily Deem", "time": 1615239004525, "rating": 3.0, "text": "I worked here when it was Milestones. Loved the space, the kids and the experience but the way it was ran was just horrible. They didn’t care about the kids or the teachers. So glad to see it being filled with a loving environment. Miss my 2 and 4 year old room!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "103749716764314910408", "name": "Anthony Dean", "time": 1614183259912, "rating": 5.0, "text": "BBMA has been fantastic for our infant. We are very happy with her care, but also the communication from the Staff. The Kidreport app lets us keep track of what our baby is doing through the day. We would recommend BBMA to any family looking for a school that is more than just \"daycare.\"", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "111631696327820832893", "name": "Freddy Tate", "time": 1611741349823, "rating": 5.0, "text": "The reason we accepted Big Blue Marble Academy as our child care provider for our son was simply because of first impression. This daycare offers a caring, vibrant, clean and stimulating environment for all kids.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "103031316302630230910", "name": "Kaylie Hill", "time": 1611543409699, "rating": 5.0, "text": "Love the whole staff here!! They made the transition for both me and my child super easy!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "114242692349494653430", "name": "Ragan White", "time": 1610722406962, "rating": 5.0, "text": "I am a first time parent, and it can be an anxious experience to start your child in daycare. I recently enrolled my son here under the new ownership of Big Blue Marble and I could not be happier with this facility! He is being engaged every day, and when I get him home he is so much more animated and talkative (as much as one can be for 4 months old). The staff takes great covid precautions with pickup, dropoffs and the rooms, and they always make it a really fun experience for him and for me every day. I think any time you take your kid to day care you need to expect that they are going to be exposed to more germs and be sick a little more, but that's going to happen whether it be day care, preschool, kindergarten, church or sports. It's unavoidable if you want your child to interact with the world outside of your home. If you are looking for a learning center / day care that offers real engagement, wonderful teachers and staff, and parent peace of mind - I highly recommend Big Blue Marble on e Glenn!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "110865988102077324518", "name": "K. Moore", "time": 1549308311854, "rating": 1.0, "text": "My daughter worked there a few years ago during college. She had a terrible experience. She was sick so often that we made her quit! She often had worker kids which made her number of children per adult be over regulation. Toys were not cleaned effectively. I’d suggest looking elsewhere or you’ll end up paying for daycare and taking sick days from work to take care of your child.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "117689063770602216947", "name": "Shashank Rao", "time": 1441426855097, "rating": 1.0, "text": "We have tried Milestones on two separate occasions - first when our son was an infant (8 weeks to 4 months old) and now when he turned 18 months old.  Both times the experience was HORRIBLE (not sure why we even decided to give them a second chance after the first time's issues). As an infant, he was sick every alternate week while at Milestones.  One week he would go to Milestones and catch something, then we would keep him home for a week and fix him up.  The next week he would catch something else again.  It was a perpetual cycle because of which we decided to pull him out.\n\nHe then restarted daycare (somewhere else) when he was a year old.  For 6 months he was relatively healthy - barring the occasional cough / cold.  We started him back at Milestones this week (i.e. 18  months).  He has been there all of 3 days and already he has caught a stomach bug. This place is horrible!  On day 1 when we went to pick him up, his milk cup was not washed and just sitting around.  The second day, his pacifier was missing.  When I asked the teacher where his pacifier was, she started looking among the toys.  That should have been my first clue - if the teacher is looking for a pacifier amongst the toys, god alone knows how many kids have put it in their mouth!  And the pacifier had a string attached to it, so they could just have clipped it to our son, but they did not care to do that.  The \"teachers\" as such are a bunch of college kids, and most of them have no clue what they are doing.  As such, it is a revolving door for teachers; there is so much turnover that almost anyone you speak with says they are new.  If you care for your child's health, please stay away from this place!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "115378296404842659895", "name": "Abby Wang", "time": 1418914474916, "rating": 3.0, "text": "Their facility is very new, so it looks good if you take a tour as a first time visitor. My child kept getting sick during his stay, and I had to withdraw him from the center after I found him another place. They use plugin air fresheners with VERY STRONG scent, even an adult would feel very uncomfortable while staying in the room. I was really worried that my son's health might be hazarded by those chemical stuff. Are those things allowed to be used in a childcare center by regulation? Also, their playground is paved with pebbles, which is ridiculous and rather unsafe for outdoor activities!", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "106924736182366108753", "name": "alexis winston", "time": 1528647818899, "rating": 1.0, "text": "Bad experience while working there the staff was very awful towards me , a few girls I've known that worked there never received their money after working for weeks and  definitely my last check wasnt given to me with all my hours\nrecommend new directors in the front office.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "109305050767514805056", "name": "SONG AaBbCc", "time": 1566223499466, "rating": 1.0, "text": "(Translated by Google) So bad.\n\n(Original)\nSo bad.", "pics": null, "resp": null, "gmap_id": "0x888cf29ebbecb847:0xbb13043ca963f1bd"}
{"user_id": "100097909954426410742", "name": "Julianne Whittle", "time": 1623951261424, "rating": 5.0, "text": "Both of my kids started at Ardent at 8 weeks of age and it could not have been a better decision for my family! The love and care the staff at Ardent provides goes beyond what I could have asked for! These ladies truly care for my littles and want to see them flourish and grow, not only academically, but in their walk with Jesus!", "pics": null, "resp": null, "gmap_id": "0x888917d8d6b1332b:0x9a6a0331ce651d08"}
{"user_id": "115810661440224963673", "name": "Jennifer Jones", "time": 1623851305318, "rating": 5.0, "text": "Ardent Preschool offers the one thing we absolutely need as parents.  A safe, clean environment that we can leave our children at while we work with a great staff and an amazing learning experience.  My children thrived at Ardent.", "pics": null, "resp": null, "gmap_id": "0x888917d8d6b1332b:0x9a6a0331ce651d08"}
{"user_id": "108744117899050610639", "name": "William McKoy", "time": 1623984968167, "rating": 1.0, "text": "Sent an email to the owner of Ardent explaining to him some complaints that we had. Gave him several days to reply to my complaints. It was not until AFTER I left a review that he emails me and asks me to remove my review. Really unprofessional leadership starting at the top.", "pics": null, "resp": null, "gmap_id": "0x888917d8d6b1332b:0x9a6a0331ce651d08"}
{"user_id": "103152976852344553784", "name": "deanna edmondson", "time": 1595546504818, "rating": 5.0, "text": "Very clean facility, friendly admin, and fun center! My children love attending and get excited to see their teachers and friends!", "pics": null, "resp": null, "gmap_id": "0x888917d8d6b1332b:0x9a6a0331ce651d08"}
{"user_id": "103572408596680175637", "name": "Ky maria Rich", "time": 1509389208905, "rating": 5.0, "text": "My daughter has been here since she was a baby (9 years) and they've always gone above and beyond. Are more than helpful & courteous. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4ce94fcc3c49:0xeaab0e47897088d5"}
{"user_id": "106080969867089273720", "name": "Jamelle Jones", "time": 1530223959460, "rating": 5.0, "text": "If I could give it 10 starts I would.\nIt's a family when you join Becks Daycare.\nI love it. My children love it", "pics": null, "resp": null, "gmap_id": "0x889a4ce94fcc3c49:0xeaab0e47897088d5"}
{"user_id": "111626314593290777686", "name": "Christopher Austin", "time": 1581351068777, "rating": 3.0, "text": "Its been a while since ive been here but when i was little it was alright", "pics": null, "resp": null, "gmap_id": "0x889a4ce94fcc3c49:0xeaab0e47897088d5"}
{"user_id": "100541308125428991075", "name": "Haile H.", "time": 1511635697488, "rating": 1.0, "text": "My baby cousin hated it there. She used to say her day was bad.", "pics": null, "resp": null, "gmap_id": "0x889a4ce94fcc3c49:0xeaab0e47897088d5"}
{"user_id": "103470995000362938869", "name": "Sassy Sophia", "time": 1481469192142, "rating": 5.0, "text": "They took great care of both my grandchildren. The oldest participate in the Pre K-3 program and she really enjoyed it.", "pics": null, "resp": null, "gmap_id": "0x888ec6165c993c9f:0x441d424d4a132a6c"}
{"user_id": "107134571415290422774", "name": "Kristen Burgin", "time": 1577793559081, "rating": 5.0, "text": "I love this daycare. Mrs. Ruby & all of the teachers are wonderful!", "pics": null, "resp": null, "gmap_id": "0x888c2a65fe570561:0xdca6b00ea85f0167"}
{"user_id": "107289754936045256928", "name": "Tracy W", "time": 1573431222888, "rating": 5.0, "text": "Love this daycare ❤️ Mrs.Ruby is a amazing Lady!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a65fe570561:0xdca6b00ea85f0167"}
{"user_id": "103227802844892782214", "name": "Jason York", "time": 1561242264516, "rating": 5.0, "text": "Mrs. Ruby is the sweetest person alive!", "pics": null, "resp": null, "gmap_id": "0x888c2a65fe570561:0xdca6b00ea85f0167"}
{"user_id": "103045826868957820186", "name": "Travis “ttow” Tow", "time": 1500475120015, "rating": 5.0, "text": "Excellent pre-k program.  Could not be happier with my daughter's development while she attended Somerville Baptist Pre-K.  Careing staff and challenging curriculum.", "pics": null, "resp": null, "gmap_id": "0x8862789eadfe545d:0x8beed7b949ce0044"}
{"user_id": "103045826868957820186", "name": "Travis “ttow” Tow", "time": 1500475009795, "rating": 5.0, "text": "This is a great daycare/pre-school.  Caring staff, secure facility, smart curriculum for all age groups.", "pics": null, "resp": null, "gmap_id": "0x88626b9f477a22a9:0x4ce81667ed13c07c"}
{"user_id": "102992049721903402099", "name": "Tee W", "time": 1617158849714, "rating": 1.0, "text": "I received a call that our baby had an allergic reaction outside.  When we picked him up his lip was swollen and he had scratches on his face.  When we got home and removed his clothes,  his body was covered in red bruises.  There was also a purple bruise on his thigh.   He was also very hoarse.  We contacted the school and doctors office.  Because my son had allergies and he was so young we wanted to confirm if the marks were injuries or allergies.  The dr and nurse both said bruises.  Additionally he was seen by 3 other drs. ALL agreed. They also said he was hoarse from screaming all day.  This school went \"all out\" covering up what really happened to my 20 month child! Lied,  said video was broken that day,  and even changed their stories.  I was more hurt than anything being this was a Christian establishment! Needless to say we still have no clue what happened.  PLEASE BEWARE.  Things happen but if NO ONE KNOWS what's going on when your precious babies are left in the care of \"trained adults\" that is totally unacceptable.", "pics": null, "resp": null, "gmap_id": "0x8888e3fa42c1418b:0xf5dffabf542a08bc"}
{"user_id": "100601188058577813679", "name": "Debra Banks", "time": 1569875266549, "rating": 4.0, "text": "I'm a first time mom and when I dropped my child off I cried ...a lot. By his grace infant teachers make have put my mind at ease since I enrolled my child. Ive gotten a phone call ensuring my child was okay, I heard my child cooing over the phone and even sent pictures of my child. So far they have gone out of there to help a first time mom like myself to put the parents mind at ease. That ensures they care about the child and parent as well as business.", "pics": null, "resp": null, "gmap_id": "0x888c2af03fbc7081:0xfc171e5f4f43b691"}
{"user_id": "114026529930627777898", "name": "Alexander Pena", "time": 1572561104490, "rating": 5.0, "text": "This place is awesome! The owner is easy to talk to and all of the teachers go above and beyond for my children. Very satisfied", "pics": null, "resp": null, "gmap_id": "0x888c2af03fbc7081:0xfc171e5f4f43b691"}
{"user_id": "102975993051396786471", "name": "Desma Maria", "time": 1567365175854, "rating": 4.0, "text": "My kids have been here for a while now and I can't complain.", "pics": null, "resp": null, "gmap_id": "0x888c2af03fbc7081:0xfc171e5f4f43b691"}
{"user_id": "104869386803456475292", "name": "S", "time": 1555453676907, "rating": 5.0, "text": "Very kind and caring staff! The children are very well taken care of! Kids are treated like family! Nice & clean facility. We wouldn’t go anywhere else! We highly recommend St. Luke’s!", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "109023714190831141616", "name": "Chaney’s Dream", "time": 1549473002339, "rating": 5.0, "text": "All 3 of my children attended this daycare. Great friendly staff that always made me feel comfortable leaving my children in there care. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "110626816679186279276", "name": "Kenzz", "time": 1517100580145, "rating": 5.0, "text": "It was a very good school for me. I miss st. Luke so much the teachers were very nice they helped me learn a lot they took time and good care of the children definitely a great place to go! 🙃", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "111350650214678996293", "name": "Prada 0825", "time": 1559789009353, "rating": 5.0, "text": "My children go here and they are wonderful. It feels like family is taking care of your kids. My child didn’t get into pre-k and I was so glad they did a program for pre-k! He learned so much! My children have gone here from 6 weeks to 5 years old. I am not sure what some previous reviews are talking about. They are never outside in the hottest part of the day from 11-3:30 and they make sure they are hydrated. I am glad my kids get to go outside and play because they love it and I don’t have much time to take them. They also bring home all kinds of crafts. I don’t have any complaints and their prices are great!", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "101566191098707249614", "name": "Amy Ervin", "time": 1537971831087, "rating": 5.0, "text": "Both of my children attended the daycare facility here and loved it.  The employees are kind and attentive, and my children were treated with loving care the four years that each of them attended St. Luke Daycare.", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "106704901141206521183", "name": "Michael Parham", "time": 1545606612954, "rating": 5.0, "text": "Kind, loving people who genuinely care about preschool teachings but also the lessons of life and eternity.......", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "114583725038948866054", "name": "Chip Ervin", "time": 1515233467929, "rating": 1.0, "text": "If there was a church from the movie Deliverence, this would be it.. Same members have been going here for 10-15 year with no new faces. \"Wonder Why\" One member who's name is Janice Voss, also on the board, in the choir, and is one of The United Methodist Woman is the worse hypocrite in The Deep South. I chalanged her and Amy Gay Ervin to go to a professional Christian mediator for family counseling, but they were to ignorant in their beliefs to go. Our last visit was this past Easter, my fiancé and I went because that's were my children attend. We were shunned by 75% of the congregation. I have nothing good to say about this church, other than an elderly couple \"Bill and Ellen Flowers\" it's my opinion, they are two of the most wonderful Christians in the world!  I hope this church makes some major changes, because they're giving Christians a bad name.", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "116260773014428018427", "name": "Russell Cox", "time": 1533680372069, "rating": 1.0, "text": "Our twin 2 year olds go here and day in and day out they are outside in this 100 degree weather almost all day!! This is ridiculous. Not to mention barely ANY a/c inside either! Our kids come home everyday so lethargic because they’re exhausted from being in the heat all day long!! My suggestion don’t use their daycare!", "pics": null, "resp": null, "gmap_id": "0x8888a9a1bdc47b4b:0x8c2df27ca15ff874"}
{"user_id": "112962176387176648163", "name": "Kayela Elders", "time": 1594361505691, "rating": 1.0, "text": "Being a past employee I caution people about this place. I would not put my own child in this facility. The faculty can get rude with the children and negligent. I saw this first hand. There are so many kids and so few staff and how things are ran are very chaotic. Please look else where for child care.", "pics": null, "resp": null, "gmap_id": "0x88628ba0e592fb55:0xe1c64a82035d0b25"}
{"user_id": "101780319247756191484", "name": "Rachel Jones", "time": 1564851918673, "rating": 5.0, "text": "I have both of my boys here for over a year. We love all of the staff (they keep me sane too) and my boys give nothing but smiles at drop off and pick up. My oldest is ready for Kindergarten through their program and my youngest is learning something new every day too. Blessed to have found them.", "pics": null, "resp": null, "gmap_id": "0x88628ba0e592fb55:0xe1c64a82035d0b25"}
{"user_id": "107621578186408019179", "name": "daniel sylvester", "time": 1566008546101, "rating": 1.0, "text": "Let me say that when my son first started here we loved the staff and more importantly my son loved going to daycare but this past Tuesday all that changed when we were told Tuesday morning that he wasn't allowed back because he wasn't a good fit. All my son talked about was getting to see his friends at school everyday he was so happy and it breaks my heart that he's not able to get to do that anymore. We were never gave any warnings this just came from out of the blue and the way it was handled was very unprofessional I've lost all respect for the owner and staff. My son is 3 and yes he likes to goof off and thinks everything is funny but today when I picked him up from his new make shift baby sitter he is crying because he didn't get to see his friends and he misses them.  So to the owner I hope you can sleep at night after screwing people over giving them less than 24 hours to find someone to keep my son.", "pics": null, "resp": null, "gmap_id": "0x88628ba0e592fb55:0xe1c64a82035d0b25"}
{"user_id": "101805586055624800577", "name": "Alex Resendez", "time": 1471039650578, "rating": 5.0, "text": "Great teachers who really care about the kids they take care of and awesome environment with lots of activities for all the age groups. Would defintley recommend them.", "pics": null, "resp": null, "gmap_id": "0x88628ba0e592fb55:0xe1c64a82035d0b25"}
{"user_id": "108207243572241885935", "name": "Dianne Castillo", "time": 1551305880630, "rating": 5.0, "text": "They are amazing!!!", "pics": null, "resp": null, "gmap_id": "0x88628ba0e592fb55:0xe1c64a82035d0b25"}
{"user_id": "100845632388054069668", "name": "Courtney Green", "time": 1536181783315, "rating": 5.0, "text": "Great people great facility", "pics": null, "resp": null, "gmap_id": "0x88628ba0e592fb55:0xe1c64a82035d0b25"}
