{"user_id": "117312924918776447647", "name": "Sarge off-roading", "time": 1598381146974, "rating": 4.0, "text": "I have to said the credit union is a great credit union to be with. Low rates and services. But, I have one problem with the 800 number you can. Ever time I call. No one answers the phone and I leave my number and I don't get a call back half the time.", "pics": null, "resp": {"time": 1598392256174, "text": "Our Member Contact Center wants to follow up to be sure we don't miss any other calls and would appreciate your help. Will you send an email to Service@NavigatorCU.org and include the phone number(s) you use when calling our 800-344-3281 number?\n\nWe really appreciate the positive review, and we also appreciate your feedback about your experience with our Member Contact Center. While it is true we've been experiencing extremely high call volumes, you should receive a call back as soon as possible after leaving your number. We apologize. Thanks so much for being a Navigator Member!"}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "114917442111981466603", "name": "Ryan Hall", "time": 1562361966979, "rating": 5.0, "text": "I really only opened my account here for an auto loan. After it was paid off, I've kept the account opened just to use as a small savings account. I may not come in often, but I have never had any problems. Everybody in there is always really helpful and nice.", "pics": null, "resp": {"time": 1562362986265, "text": "Thanks so much, Ryan! Navigator offers comprehensive banking services, and we're here to help in any way we can. Our Save'N Up debit card savings program is especially popular, as it gives Members the chance to save, earn high interest and receive matching funds up to $300 per year. Of course, terms and conditions apply, but it's very easy to add to our free checking account. Give us a call, visit navigatorcu.org or come by any Branch to learn more. :)"}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "116914596694617830488", "name": "Brian M", "time": 1531515179574, "rating": 1.0, "text": "Do not use this bank. They are the worst ever! Used them for my dads estate during probate, and cashed a check that the lady at the branch gave me to use after I was physically in their office. Needless the say even though the funds were in the bank, my loan and probate check bounced because their staff is incompetent.", "pics": null, "resp": {"time": 1531518604416, "text": "We regret you feel this way following your experience with Navigator and would welcome the opportunity to follow up. Please consider sending an email to service@navigatorcu.org so we can look into this further."}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
{"user_id": "105623020962152108197", "name": "D Dizzel", "time": 1521645853006, "rating": 1.0, "text": "The new branch manager is the worst.", "pics": null, "resp": {"time": 1522709514801, "text": "We deeply regret your experience rated as one-star; Member satisfaction is a top priority. Would you be willing to provide additional details to us at Service@navigatorcu.org? We'd like to follow up and ensure your future interactions with the Navigator Team are much more to your satisfaction."}, "gmap_id": "0x889bb2e629b28247:0x12da0070bf9f9723"}
