{"user_id": "115951762354233507880", "name": "Jesse Waters", "time": 1616002620562, "rating": 1.0, "text": "Mr. Britt the owner is incredibly rude and rude will not work with you. When offering suggestions he gets heat for over talks when you are attempting to speak and yells at you with name calling and cursing. Highly unprofessional group.", "pics": null, "resp": null, "gmap_id": "0x8889c9f4ab9667dd:0x85ce38f69839e73a"}
{"user_id": "116098974576458959435", "name": "N M", "time": 1582945391496, "rating": 5.0, "text": "Always leaves me satisfied 😁", "pics": null, "resp": null, "gmap_id": "0x8889c9f4ab9667dd:0x85ce38f69839e73a"}
{"user_id": "104144904953318885583", "name": "Marie Lindsey", "time": 1558764435780, "rating": 5.0, "text": "Love this peaceful quiet solitude.", "pics": null, "resp": null, "gmap_id": "0x8889c9f4ab9667dd:0x85ce38f69839e73a"}
{"user_id": "110973633519845370603", "name": "Lisa Mccubbins", "time": 1593902644232, "rating": 3.0, "text": "Polite employees", "pics": null, "resp": null, "gmap_id": "0x8889c9f4ab9667dd:0x85ce38f69839e73a"}
{"user_id": "110449187161243648948", "name": "Peta May", "time": 1628959071453, "rating": 5.0, "text": "Thanks for wearing a mask.", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "109630563949313923278", "name": "Rick Hoffman", "time": 1629848713656, "rating": 5.0, "text": "The men were professional, hardworking and courteous. They tore down a shed, removed a dog pen fenced area and an old railing along the road of the property. My yard looks amazing now. These team is who I will call when I am in need of their services in the future.", "pics": null, "resp": {"time": 1629902127611, "text": "Thank you so much it was a good project glad we could help ."}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "116509936454655471443", "name": "NICOLE WILLIAMS", "time": 1628010090062, "rating": 5.0, "text": "They were fast, professional, and great. I will definitely recommend them. I just wish they were wearing masks. There is still a pandemic outside. Stay safe.", "pics": null, "resp": {"time": 1628081411801, "text": "Thank you Nicole !! We appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "111244784993031716094", "name": "Sharon", "time": 1629568984789, "rating": 5.0, "text": "We had a specific timeframe that we needed their services and they were able to accommodate us on 2 different occasions. I definitely recommend this company.", "pics": null, "resp": {"time": 1629902148308, "text": "Thank you Sharon we really appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "102003568719050773051", "name": "Melissa Hovater", "time": 1627580353632, "rating": 5.0, "text": "Drew and the guys were great! They were polite, professional, friendly, and most importantly, got the job done.", "pics": null, "resp": {"time": 1627581013814, "text": "Awesome glad they took care of y’all !! We appreciate your business"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "114510750428938382430", "name": "amy pope", "time": 1626565014389, "rating": 5.0, "text": "They were very nice and took care of all my junk i needed removed at a very fair price.", "pics": null, "resp": {"time": 1626630764926, "text": "Thank Amy for your business!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "102875373812070980294", "name": "Jason Ash", "time": 1628876115522, "rating": 5.0, "text": "They provided excellent service! I am very pleased.", "pics": null, "resp": {"time": 1628912006331, "text": "Thank you Jason for your business!! We appreciate it."}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "112352788881824410842", "name": "Denise Legate", "time": 1629127199187, "rating": 5.0, "text": "Whole process very easy, Derrick and his staff great to work with, would definitely recommend so easy basically just point at what needs to go and they load it up", "pics": null, "resp": {"time": 1629209864107, "text": "Hi Denise, we're happy to hear that our junk removal service was satisfactory!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "111898620020419840197", "name": "Anthony Booth", "time": 1626212757004, "rating": 5.0, "text": "They were great. Will use again.", "pics": null, "resp": {"time": 1626394124102, "text": "Thank you Anthony !! We appreciate your business"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "103029933756560219237", "name": "Brittany I", "time": 1626995103281, "rating": 5.0, "text": "Very friendly and helpful. Everything was cleaned and will definitely use this company again.", "pics": null, "resp": {"time": 1627053358352, "text": "Thank you Brittany!! We appreciate your business."}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "114197100801407810796", "name": "Tyler Smith", "time": 1624412349310, "rating": 5.0, "text": "Great guys. Very prompt and very efficient. You can tell these guys take pride in what they are doing.", "pics": null, "resp": {"time": 1624416398369, "text": "Thank you Tyler for your business!! We appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "109247015138032705533", "name": "Gilda Brame", "time": 1626451529141, "rating": 5.0, "text": "Excellent service. Professional. Efficient\nPleasant and kind. I would highly recommend Down South Junk Removal to anyone decluttering or moving!", "pics": null, "resp": {"time": 1626525447878, "text": "Thank you Gilda we appreciate your business!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "110395664768973967980", "name": "Andrea Echols", "time": 1627948086041, "rating": 5.0, "text": "The service was great and worth every penny. Great communication, knowledgeable workers, and the price was appropriate to the service. We will use them again!", "pics": null, "resp": {"time": 1627949160038, "text": "Thank you !! We appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "117900549031430803860", "name": "Michael Johnson", "time": 1612815815086, "rating": 5.0, "text": "The two men Derrick at Down South Demo & Junk Removal sent were great. They were professional, kind, and worked very hard! The process was easy dealing with Derrick. No problem getting a convenient  & prompt time for services. And pricing was upfront and reasonable. They cleared out my Mom's apartment, leaving me no work to do after. And they followed my instructions to a T! Thanks Down South! I highly recommend.", "pics": null, "resp": {"time": 1612820052698, "text": "Thank you Michael we appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "107875452708179595316", "name": "Ellouise Cotton", "time": 1621455096938, "rating": 5.0, "text": "From the initial response to us bidding farewell upon job completion, I am very impressed! Outstanding customer service, exceptional execution and remarkable efficiency have this company etched on my \" tell a friend\" and will call again list! Thanks guys!", "pics": null, "resp": {"time": 1621455897055, "text": "Thank you so much for your business!! We appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "109683487942694438544", "name": "Becky Millican", "time": 1616947173051, "rating": 5.0, "text": "I found Down south demo and junk removal on Facebook. They were professional and quick to respond to my request for a quote. And I was able to secure an appointment quickly. They were good with communicating with me —even when the recent storms were going to affect our appointment. They called us when they were on their way and were able to quickly pick up our “junk” in about 20-30 minutes. We had a Lot of stuff just cluttering up our basement including some big items like an old treadmill and a sofa that we wouldn’t have had a way to dispose of otherwise, I believe it was money well worth spent.", "pics": null, "resp": {"time": 1617018100464, "text": "Thanks Mrs.Millican we appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "101262606106558451712", "name": "ANTHONY JONES", "time": 1616819934351, "rating": 5.0, "text": "These guys were awesome!! They’re very professional and very fast! The prices are very reasonable and very well worth the money. We’ll definitely be using the services again. Thank you so much!", "pics": null, "resp": {"time": 1616879698567, "text": "Thank you Anthony for your business!! We appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "117563625465852176350", "name": "Brandalyn Sanders", "time": 1620683598224, "rating": 5.0, "text": "Derrick is awesome. Very professional and speedy. I have the hardest time getting items removed for trash but with them it was a breeze. Thanks again", "pics": null, "resp": {"time": 1620684581693, "text": "Thank you so much Brandalyn for your business!! Hope we can continue our business relationship and keep helping y’all out !!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "106915260195093871648", "name": "Jazmine Benjamin", "time": 1627677716980, "rating": 5.0, "text": "I got them to remove some furniture and appliances. They were very quick with communication, professional, fast at getting the furniture out, and kind. Will definitely use them again for future disposal needs. Highly recommend.", "pics": null, "resp": {"time": 1627737087112, "text": "Thank you Jazmine we appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "118045817709576928198", "name": "JamesAndEsther Price", "time": 1614986766700, "rating": 5.0, "text": "These guys were literally the BEST! They went above and beyond to remove junk that was hard to reach, all over the house and in the yard, then did a thorough sweeping up of all the debris that was left. Drew and his sidekick (I don’t remember his name)  were so respectful, polite and happy to serve. They made a very difficult situation painless. I could not be happier with their service. 100% recommend!", "pics": null, "resp": {"time": 1615045467585, "text": "Thank you so much James and Esther for your business we appreciate it ."}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "109950088317634901172", "name": "Jayme Moore", "time": 1628089605960, "rating": 5.0, "text": "We used Down South Junk Removal to clean up a bunch of stuff getting ready to list our house. There were multiple used appliances, old furniture pieces, lumber, tin, and various other junk. Down South was able to come out on a few days notice, kept us apprised of when they would be there, and they were on time. The two gentlemen who came worked their tails of loading their 18 foot trailer to the brim (it took two and a half hours), and they never stopped. They even brought tools and broke down some of the items to be able to fit everything. Overall, the process was professional, a good value, and I would use them again.", "pics": null, "resp": {"time": 1628162617346, "text": "Thank you Jayme !!  We appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "115276409378927516191", "name": "Benjamin Hinkle", "time": 1621967299764, "rating": 5.0, "text": "Awesome guys to do business with. Highly recommend Derrick, and appreciate the timeliness and value. 5 stars", "pics": null, "resp": {"time": 1621967965744, "text": "Thank you Ben !!! We appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "106406625179602023949", "name": "Jason Walker", "time": 1620775904245, "rating": 5.0, "text": "The guys that were here let me know every step they were doing. They were also worried about scratching my concrete which needed a good pressure washing. I do the pressure washing so I told them the more you scratch off the less I have to do. I would recommend Down South Demo in a heartbeat.", "pics": null, "resp": {"time": 1620788361596, "text": "Thanks Jason !! We appreciate your business hopefully they scratched it up for you a little bit so you don’t have to work so much ! Haha"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "114989559908141496832", "name": "maggie miskelley", "time": 1615673244366, "rating": 5.0, "text": "Derrick and Jackie were extremely helpful. They did a stand up job! I would highly recommend them. Down South Junk Removal did the job at a fraction of the price of other junk removal businesses. 10/10 would recommend!", "pics": null, "resp": {"time": 1615735432585, "text": "Thank you Maggie we appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "116127509801019413948", "name": "traci duncan", "time": 1620777431264, "rating": 5.0, "text": "I called & got a general idea of cost & they came to pick up the next week.\nThey were able to start at earlier time & were done quickly.\nWe weren’t home so when they were done they texted me pics. The yard was picked up.\nThey offered Venmo pay which was so easy.", "pics": null, "resp": {"time": 1620788419291, "text": "Thank you Traci !! We appreciate your business !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "115881235747999843950", "name": "Cathy1 Crumley6", "time": 1616940479874, "rating": 5.0, "text": "They were timely and fast and did an excellent job. Both Jacky and Drew were very kind and courteous. I would highly recommend this company to anyone.", "pics": null, "resp": {"time": 1617018068809, "text": "Thank you Cathy we appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "116074587325975294163", "name": "Matthew Beadlecomb", "time": 1606256726569, "rating": 5.0, "text": "Derrick was great at communicating throughout the process. The guys who showed up to do the work were efficient and thorough. They also made sure to clean up after themselves which isn't always the case with this kind of work. Nice job guys!", "pics": null, "resp": {"time": 1606257407156, "text": "Thank you so much Matthew we appreciate your business."}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "100729453472225313664", "name": "Keli Watson", "time": 1608522419434, "rating": 5.0, "text": "Derrick was very professional and timely in response to my quote for service and was able to accommodate a Sunday job (which was a major plus!). The two gentlemen who assisted us the day of the haul were on time, polo and got the job done with minimal supervision. I was thankful that when they encountered something unexpected that they reached out for clarification instead of making an assumption which could’ve led to lost files. I would definitely recommend their services.", "pics": null, "resp": {"time": 1608523134792, "text": "Thank you so much for your business Mrs.Watson !! We appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "115783579019459128502", "name": "Jean Tucker", "time": 1623113427678, "rating": 5.0, "text": "Scheduled for Noon- but they called to inform me that they were running overtime on a previous job- and scheduled a new arrival time. Received a call when they were on their way- upon arrival they got right down to work- quickly and efficiently! Pricing was more than fair- and the two men were polite and professional. Would use this company again!", "pics": null, "resp": {"time": 1623117202666, "text": "Thank you Jean we appreciate your business !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "105212137196620224298", "name": "RICHARD Johnson", "time": 1623251571236, "rating": 5.0, "text": "The guys did great work at cleaning out a lot of junk at my parent’s house. They were fast and did exactly what we needed!  Derrick was great to work with, and everything happened just like he told us it would. All of the guys were very courteous, and made sure we looked at all the areas and were satisfied before they left.", "pics": null, "resp": {"time": 1623253386361, "text": "Thank you Richard we appreciate your business !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "102467099328358585916", "name": "John Michaels", "time": 1611951600935, "rating": 5.0, "text": "Communication was prompt and clear. Crew arrived on time and were friendly, quick and professional. We will definitely use them again and recommend them to anyone. Great job!", "pics": null, "resp": {"time": 1611958340863, "text": "Thank you John for your business we appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "116033623161451631352", "name": "Margaret Jones", "time": 1616247432348, "rating": 5.0, "text": "I found Down South Demo on the internet! They were very professional, on time and finished the job on time. It was a very hard job to do but they were very good! I would recommend them to all my friends!", "pics": null, "resp": {"time": 1616250718468, "text": "Thank you Margaret we appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "108014599104457837527", "name": "Melissa Williams", "time": 1606952415947, "rating": 5.0, "text": "These guys were amazing! They cleaned everything out and was in and out super quick! I highly recommend them!", "pics": null, "resp": {"time": 1606953685836, "text": "Thanks you so much for\nYour business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "111238351509163474314", "name": "Ron Huie", "time": 1613592354475, "rating": 5.0, "text": "Awesome service! They did all the work to haul out some heavy items to the truck all I had to do was point them out. I actually forgot a very large item and they came back and got if for no charge. I highly recommend Down South Demo and Junk Removal!", "pics": null, "resp": {"time": 1613593009316, "text": "Thanks Ron we appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "118225198705006582915", "name": "Steven Sawyer", "time": 1609680578703, "rating": 5.0, "text": "They did a great job! Arrived on time and quickly finished the job! Communication was great and very professional. Will DEFINITELY use again!", "pics": null, "resp": {"time": 1609690790274, "text": "Thank you Steven for your business we appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "107786698841525049771", "name": "Lorie Anderson", "time": 1599441767784, "rating": 5.0, "text": "These folks are phenomenal! Being from out of state, it was difficult to know who to call and to hire. Derrick was my main point of contact and was very friendly and professional from the beginning.\n\nThe house I hired them to clean out was probably one of their worst jobs ever! The house had been sitting vacant for a few years. There was plenty of mold and mildew, garbage, furniture, and water damage from a fire somewhere in between. Mix all of this with 90 degree weather and high humidity and this job should have been one that they ran from!\n\nThe clean-up crew did a fantastic job and got the place cleaned out in a day and a half. Derrick was more than fair with his pricing and I couldn't be happier!\n\nI highly recommend Down South Demo and Junk Removal. You will NOT be disappointed!", "pics": null, "resp": {"time": 1599445545156, "text": "Thank you so much for your business!! That’s what we are here that take of our customers and not break the bank !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "100644676050698967291", "name": "Matthew Mitchell", "time": 1597301993865, "rating": 5.0, "text": "These guys were great and I would definitely use them again. Communicative, helpful, and personable. They went above and beyond in disposing of all of the things they found. I would absolutely recommend them to anyone for this or any other junk removal need.", "pics": null, "resp": {"time": 1597323634706, "text": "Thank you for your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "100162171375963083742", "name": "Stacey Jackson", "time": 1610376611106, "rating": 5.0, "text": "Great job, very friendly. Went above and beyond!!! Would definitely recommend to everyone. We will be a repeat customer!!", "pics": null, "resp": {"time": 1610377344162, "text": "Thank you Stacey !! We appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "115608216160568798146", "name": "Caleb Cole", "time": 1612836057428, "rating": 5.0, "text": "They did such an amazing job! They went above and beyond to take care of us!", "pics": null, "resp": {"time": 1612927946311, "text": "Thanks Caleb we appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "105628132792008045231", "name": "LaShawna Wallace", "time": 1614454909771, "rating": 5.0, "text": "They were very prompt and attentive. Great service.", "pics": null, "resp": {"time": 1614458724272, "text": "Thank you LaShawna we really appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "108788680961305315865", "name": "Jeff Dennis", "time": 1599170349037, "rating": 5.0, "text": "We used the service and we were VERY pleased. Courteous, professional and hauled everything we needed gone with no problems at all! I highly recommend them!", "pics": null, "resp": {"time": 1599174049332, "text": "Thank you Mr.Dennis !! We appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "102553720496821645652", "name": "Emily Overton", "time": 1609620021015, "rating": 5.0, "text": "I called the number on their website and my couch I wanted removed was gone within the hour. Would highly recommend!", "pics": null, "resp": {"time": 1609620692824, "text": "Thanks Emily for your business!! We appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "112612503212244820088", "name": "Escape Day spa", "time": 1613251941275, "rating": 5.0, "text": "They came in with friendly professional attitudes accessed what needed to be done and Got the job done quickly.\nThank you", "pics": null, "resp": {"time": 1613254061306, "text": "Thank you so much for your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "118171998515961286177", "name": "Keith Chichester", "time": 1594067721858, "rating": 5.0, "text": "Down South Demo and Junk Removal were awesome. The guys were on time, efficient, and very respectful. They finished the job far faster than I would have expected and prices were extremely fair. I would recommend them for anyone needing some junk hauled.", "pics": null, "resp": {"time": 1594072905575, "text": "Thank you Keith for your business we appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "115804879893948727954", "name": "Cody Johnson", "time": 1597901844316, "rating": 5.0, "text": "The best junk removal company! Not only did they quote me the most affordable price out there, but they actually arrived the very next morning and enthusiastically took away every single bag with no issues. Guys, they even swept up after. On-time, professional, affordable, wow.", "pics": null, "resp": {"time": 1598651263658, "text": "Thanks for your business we appreciate it !!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "118358183436866337797", "name": "Amy Newell", "time": 1595438159781, "rating": 5.0, "text": "Very responsive to communications and very flexible with my schedule. The men were on time, professional, kind, and took care to make sure they did not hit walls/doorways as they moved items out. I highly recommend!!", "pics": null, "resp": {"time": 1595441889699, "text": "Thank you Mrs.Newell we appreciate your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "108185687100063658505", "name": "Jennifer Bryan", "time": 1591288969905, "rating": 5.0, "text": "These guys are awesome! They responded to my text with minutes and we set up an appointment. They are very friendly and a job well done! I will definitely recommend them to family and friends and use them again in the future! ⭐⭐⭐⭐⭐", "pics": null, "resp": {"time": 1591292678728, "text": "Thank you so much Jennifer for the kind and honest review we appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "111898344171488975184", "name": "Neil C", "time": 1593487724170, "rating": 5.0, "text": "We called Down South the morning we needed a lot of furniture and other items picked up and removed. They arrived promptly as promised, were very professional, and very efficient in getting the job done. I would highly recommend.", "pics": null, "resp": {"time": 1609690871195, "text": "Thank you for your business we appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "112180260005037183280", "name": "gordon ball", "time": 1594152933217, "rating": 5.0, "text": "Guys arrived right time and started work immediatley. Very hard workers and never stopped moving. Great experience and I highly recommend. I will use them again in a few months!", "pics": null, "resp": {"time": 1594156961917, "text": "Thank you Mr.Ball !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "117763279846894466273", "name": "John Pope", "time": 1594497411092, "rating": 5.0, "text": "Very professional company !  I'm certain I will be doing business with them again.  Derrick worked with me on a satisfactory meeting time and showed up right on time.  You can't beat that for service !", "pics": null, "resp": {"time": 1594501290436, "text": "Thanks Mr.Pope we appreciate your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "117094175794368548441", "name": "Tommy Colbert", "time": 1596694333722, "rating": 5.0, "text": "Great junk removal company. Excellent service and affordable service!", "pics": null, "resp": {"time": 1596713420233, "text": "Thank you for your business!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "117422373709909575080", "name": "Lawrence Alton Smith", "time": 1595985066260, "rating": 5.0, "text": "They were prompt and cleaned up what I had for them to do at a reasonable price.", "pics": null, "resp": {"time": 1595990353866, "text": "Thank you for your business Mr.Smith !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "106181201746368259915", "name": "Natasha Croskey", "time": 1592259399681, "rating": 5.0, "text": "Very professional and hard working. The job took no time at all. I will recommend.", "pics": null, "resp": {"time": 1592320958614, "text": "Thank you for your business"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "108395769566001758004", "name": "vampireninja719", "time": 1587417470544, "rating": 5.0, "text": "Very professional and friendly. His crew are wonerful and hardworking. Would highly recommend if you're looking for a trustworthy company to get the job done right and quickly.", "pics": null, "resp": {"time": 1609690888093, "text": "Thank you for your business we appreciate it !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "106613914441998304190", "name": "Alyssa Belcher", "time": 1592256901059, "rating": 5.0, "text": "Derrick came out quickly to give a quote.  They worked with our budget and had our old shed removed in no time!", "pics": null, "resp": {"time": 1592320975613, "text": "Thank you so much for your business"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "106297425208997521634", "name": "Bama Auto Glass", "time": 1562868405799, "rating": 5.0, "text": "Very nice folks to work with. They done excellent work. I would use them again for sure", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "105777380388358370627", "name": "Miranda Jinright", "time": 1562800031055, "rating": 5.0, "text": "Thank you Down South Demo and Junk removal for your timely service and for sending out such a professional to clear out my clutter. Derrick Cross I appreciate you! I would highly recommend you and the company to all my family and friends!", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "103235046489327460491", "name": "John Reaves", "time": 1590172777550, "rating": 5.0, "text": "They removed 50 years of stuff that was ruined by water damage.  Very quick, and professional.", "pics": null, "resp": {"time": 1590176551394, "text": "Thank you John for your business we appreciate you !!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "102417422492903054053", "name": "The Vintage Creep", "time": 1596479089981, "rating": 5.0, "text": "Very professional and great price!", "pics": null, "resp": {"time": 1596483318690, "text": "Thanks for your business!!!"}, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "100356003726944919236", "name": "Jessica Parker", "time": 1562800169435, "rating": 5.0, "text": "Best prices and honest folks! I highly recommend. I will continue business with them in the future!", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "112064075001581335653", "name": "Courtney Stewart", "time": 1563403031865, "rating": 5.0, "text": "Affordable, dependable & professional.  I would highly recommend this team for your future junk removal needs!", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "107715827230981410028", "name": "Laura Kate", "time": 1563150961674, "rating": 5.0, "text": "Derrick and his guys are a pleasure to work with! Great costumer service and hard workers! Would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "108943949801147727536", "name": "Kris Chesser", "time": 1563055179482, "rating": 5.0, "text": "The owner was very professional. He gave me a price I was happy with and got it gone.", "pics": null, "resp": null, "gmap_id": "0x8889a987eb6b7af7:0x5003d352ef0972e5"}
{"user_id": "107333726000827348260", "name": "Shea", "time": 1555076949868, "rating": 5.0, "text": "This place & crew work very hard💪 and stand behind their service 💯.  We are Very pleased and definitely recommend 😊👍.", "pics": null, "resp": null, "gmap_id": "0x889293e41b89639d:0xe48134273d1830ed"}
{"user_id": "107169161494843556430", "name": "ConstructNoden", "time": 1551805431275, "rating": 5.0, "text": "Met Mr. Jerry Lynn. Nice people", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO2W_QzKcGKY7CK_-hF56svjsNByBlmFVOJwZ2D=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYCq_SRj3a_4Y6wWwMhBJq7f7hlvNcU0TaJ5cA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "108070789149755392551", "name": "D.J. Griffith", "time": 1623895598241, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "111457034627434133095", "name": "Tim Klassen", "time": 1573778388553, "rating": 5.0, "text": "Seemed to be a well managed and courteous business", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "108153645040115082532", "name": "Johnny Beckmann", "time": 1511356916070, "rating": 5.0, "text": "I work for company.... Carmen and Wes are good people to work for", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "115721972787033739102", "name": "bob reed", "time": 1546280895099, "rating": 5.0, "text": "A good place to work , i love it", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "106221786649025159832", "name": "Jeff Hasting", "time": 1606327529044, "rating": 5.0, "text": "All friendly", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "101283505276968539545", "name": "Chris Lee", "time": 1563637396879, "rating": 5.0, "text": "Great owners&workers", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "100597131582895109513", "name": "Sean Mattox", "time": 1511289218007, "rating": 5.0, "text": "I work here", "pics": null, "resp": null, "gmap_id": "0x8889b4c1f82e78b1:0xe665f82f9c7d3505"}
{"user_id": "117964855152244640625", "name": "jonathan ford", "time": 1617324287749, "rating": 5.0, "text": "Jason came out to my father in laws house a few weeks ago to give him a price on removing some trees. He did such a good job we gave him a call. Hands down best company I’ve used for tree service and stump removal. Theses guys are top notch!!!", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "111883269886772509514", "name": "Justin M", "time": 1600570353952, "rating": 5.0, "text": "Fair amount of work for a great price. His guys went above and beyond to make sure i was satisfied before leaving.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOlg0SWDpCXVfEHYqShKc-bZFo6S96GY3WxmebK=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "108472072762294146279", "name": "Jeffrey Cowgill", "time": 1597432825968, "rating": 5.0, "text": "We were recommended to use Colburn's Tree Service by our contractor. When we met with Jason he was prompt, courteous and on time. We discussed the project which involved a large white oak that was literally 6in from our house as well as giant red oak and four other smaller oaks and pines that needed to be removed. I also discussed keeping a portion of the hardwood for myself.  We also agreed on trimming a couple of other trees nearby.\n\nIt was several weeks before we saw him again. Jason contacted the day before and confirmed it was good for us.  They showed up before 9am and had all trees down safely, stumps ground and all debris removed by 3pm.  They're a hard working bunch, they have the equipment and know how to use it.\n\nWe were extremely happy with their work ethics and efficiency. The price was VERY reasonable as well!\n\nUrban Cowgill\nAugust 2020", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "103523374340554078681", "name": "J Leonardi", "time": 1573577417507, "rating": 5.0, "text": "Recommended by a friend to cut two big 60 year old trees down. Good pricing and very good service. The clean up job was excellent, couldn't even tell the trees were once there. Will definitely use Colburn's Tree Service again.", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "114053075900843136467", "name": "C. Gosa", "time": 1547571782351, "rating": 5.0, "text": "Great job! My husband and I are very happy with the service and the price! They cleaned up so well when they finished, we had to look up to even know they had been there!", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "111321582258790281630", "name": "Jesse James", "time": 1497457111584, "rating": 5.0, "text": "Did an amazing job! Didn't even look like a tree had fallen after they were done. Highly recommend. I will be using them again for some other tree work around my property.", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "107398536840021017898", "name": "Alan Beckham", "time": 1502740487422, "rating": 5.0, "text": "Owner and employees are very friendly and helpful.  Fair prices and great service. Has done work for me twice and I will use again.", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "100714061196415768837", "name": "Amanda Corley", "time": 1534777805668, "rating": 3.0, "text": "Friendly, but I've had no luck getting them to come do the work. I got an estimate 8 months ago, and even called to see if I was to be scheduled soon. They said I was, and months later, still have not heard from them.", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "105324353265519608768", "name": "Ray White", "time": 1613926597286, "rating": 5.0, "text": "Professional.", "pics": null, "resp": null, "gmap_id": "0x888834bf3636cbe7:0x3c4b70b1f52edae1"}
{"user_id": "105471174307983097823", "name": "Rebecca Rolling", "time": 1559516862835, "rating": 5.0, "text": "(Translated by Google) Gr8 company y'all!\n\n(Original)\nGr8 company y'all!", "pics": null, "resp": null, "gmap_id": "0x888e9b6622c473b5:0x65c0a2dec6241c6f"}
{"user_id": "109610876333966879150", "name": "Denise Curti", "time": 1587174956256, "rating": 5.0, "text": "They came to demo my garage and what a great team!!!\nThank You\nDenise\nHitchcock Rd", "pics": null, "resp": null, "gmap_id": "0x889a4b52136d1609:0x93a3f31558f17041"}
{"user_id": "105075720426636384558", "name": "James Jones", "time": 1585776384852, "rating": 1.0, "text": "Your horrible driver broke my windshield. While on the phone he ran off the side of the road slinging rocks into my window.", "pics": null, "resp": {"time": 1618330030678, "text": "James, I am sorry to hear about your windshield.  Unfortunately I believe you left this review for the wrong company.  None of our vehicles have, or have ever had our company logo or name on them.  There is another company here in town that was previously Gulf Equipment.  They recently changed their name in 2018 to Gulf Services, confusing, I know.   Thank you for doing your due diligence before leaving this negative review."}, "gmap_id": "0x889a4b52136d1609:0x93a3f31558f17041"}
{"user_id": "111982970219168060492", "name": "Patricia Keller", "time": 1490386312824, "rating": 5.0, "text": "Gulf Services removed floor and wall tiles from two of my bathrooms and my utility room. They were prompt, courteous, reasonable, and best of all, left everything perfectly clean and ready for new flooring to be installed.", "pics": null, "resp": {"time": 1494519082926, "text": "Thank you !!!"}, "gmap_id": "0x889a4b52136d1609:0x93a3f31558f17041"}
{"user_id": "105348168449170469307", "name": "Jana Burns", "time": 1478116184373, "rating": 1.0, "text": "Horrible. I called about getting an estimate and the guy named Shawn on the phone started cussing and was very unprofessional. He was a moron. I would not recommend this company to anybody. What an embarrassment it should be to work for that company.", "pics": null, "resp": null, "gmap_id": "0x889a4b52136d1609:0x93a3f31558f17041"}
{"user_id": "101063283637232281119", "name": "Mark Simpson", "time": 1602200117170, "rating": 5.0, "text": "The are always on time and have always be easy to work with!!", "pics": null, "resp": null, "gmap_id": "0x88627ccbed3010b7:0xf2b060c9d937e2d9"}
{"user_id": "101334352526397875062", "name": "David Keenum", "time": 1583019568254, "rating": 5.0, "text": "Highly recommend these guys, they get it done!", "pics": null, "resp": null, "gmap_id": "0x88627ccbed3010b7:0xf2b060c9d937e2d9"}
{"user_id": "107380872044109264525", "name": "Jon Powell", "time": 1570752978037, "rating": 5.0, "text": "Fantastic operation! Best in the business!", "pics": null, "resp": null, "gmap_id": "0x886212a7340d4ba5:0xb6a8b0fa202e1b84"}
{"user_id": "113697523890979437419", "name": "S1CKLIFE", "time": 1539830125306, "rating": 1.0, "text": "Horrible company management forces them to do Jobs in an unsafe manner to increase productivity or get fired somebody is going to get killed working like that", "pics": null, "resp": {"time": 1539895707713, "text": "Penhall Company's most important value IS safety."}, "gmap_id": "0x886212a7340d4ba5:0xb6a8b0fa202e1b84"}
{"user_id": "115621809928245497220", "name": "Betty Brooks", "time": 1619695632441, "rating": 5.0, "text": "Everyone has always been extremely friendly & professional. The drivers are highly skilled and very helpful. I have used M&M for several jobs from tearing down a house, clearing and hauling off debris, gravel and sand for driveways and mulch. Pricing is always very fair. I highly recommend this company to anyone in Auburn/Opelika and surrounding area for and sand, rock, gravel , demo work and more. Local company that has been around forever.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "110492658169783760353", "name": "Keith Henderson", "time": 1624583715148, "rating": 5.0, "text": "Very  friendly  staff  takes care of all  your  needs  recommend them for  all your projects 👍", "pics": null, "resp": {"time": 1619696708070, "text": "Keith, Thank you so much for taking the time to leave an excellent rating. We really appreciate your business. Please let us know what we can do for you in the future."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "105472388354531624085", "name": "geoff goodman", "time": 1617453922400, "rating": 5.0, "text": "They were very helpful and patient even though we weren't experienced with gravel. Very affordable too.", "pics": null, "resp": {"time": 1619696612914, "text": "Geoff, Thank you so much for this 5-star review. We really appreciate you being a customer and helping to share the word about us. We’re here for you anytime."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "104823080354961699231", "name": "Ray Blackwell", "time": 1600264924595, "rating": 5.0, "text": "Had a chance to meet up with the owner and his great people who work with in the company, I am impressed with the operation of this company. Very relaxed and happy personal.\nCall them for all your hauling and construction needs.", "pics": null, "resp": {"time": 1619697580787, "text": "Wow Ray, Thanks very much for your positive words, we really appreciate the time you took to write such a detailed review! ..."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "100930629282906136008", "name": "Thomas Martin", "time": 1617229194425, "rating": 5.0, "text": "Awesome people to work with.", "pics": null, "resp": {"time": 1619696289300, "text": "Thanks for the awesome review, Thomas! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "100636373954232831416", "name": "john brinkerhoff", "time": 1587408270114, "rating": 5.0, "text": "I ordered #4 River Rock last week,  and they didn't disappoint.  On time and reasonably priced!", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "116623804487121358634", "name": "MARK WOODHAM", "time": 1603292932518, "rating": 5.0, "text": "They were very nice people.", "pics": null, "resp": {"time": 1619697228694, "text": "Thanks Mark for the kind words! I will be sure and share with our team."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "113236634424785109120", "name": "Thomas A Wingate", "time": 1590698613740, "rating": 1.0, "text": "Truck 169 bad truck driver made an illegal pass. He got in the left turn lane and passed me and  continued on al 29n running 15 to 220 mph over the speed limit.  Watch this guys,  he will hit someone. Called the company.\nThey really didn't care.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "117998137137117074726", "name": "Spencer Marshall", "time": 1604547111063, "rating": 5.0, "text": "Best of the best!", "pics": null, "resp": {"time": 1619696992948, "text": "Thanks Spenser for sharing your rating with us and the community."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "108614393673397163525", "name": "M Stevens", "time": 1561383615344, "rating": 4.0, "text": "Great selection of bulk wood chips, gravel, fill dirt etc.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "113417458447786060644", "name": "Parker Brightwell", "time": 1497300794899, "rating": 5.0, "text": "awesome company. Very nice and go out of there way to make sure customer is happy. Will definitely do business with them again.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "108269308095602918464", "name": "Hunter Knutson", "time": 1385948067034, "rating": 1.0, "text": "I ended up paying 90 dollars for 5 yards of mulch. I am only able to fit about 2 yards in my truck which I did not know at the time but they charged me for the full 5 yards anyway. They wouldn't let me come back to get the rest of the 5 yards I paid for because it \"cost money to start the loader up\". Even with two bed loads I'd still be paying for 1 yard that I didn't even get so the cost to start the loader up should not be an issue. Not a good company to work with and they are rude to their customers. Definitely not going to give them any more of my business. They cheated me out 3 yards worth of mulch. They assume that because I am young that I do not know what I am talking about. Little do they know that I work with a lot of landscapers in the area. I am surprised they are still in business.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "102380662978626476734", "name": "Brett Mcanally", "time": 1497376602363, "rating": 5.0, "text": "Business has never been better. We at M & M strive to treat every customer fair and with respect. Hope to see you soon for your hauling needs and more.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "105230526967069425494", "name": "mike green", "time": 1552087982256, "rating": 5.0, "text": "Purchased several loads of gravel and had them delivered to my business. They were on time and the driver done a great job dumping where he was instructed.", "pics": null, "resp": {"time": 1552160439103, "text": "We love to hear from our happy customers. Thank you for leaving this awesome comment and we can’t wait to help you with whatever you may need next."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "109426155573594901889", "name": "Scott Thomas", "time": 1557885671566, "rating": 3.0, "text": "They got dirt.  Woohoo!", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "103451499692195617494", "name": "Eric Matthews", "time": 1581855535693, "rating": 5.0, "text": "Great job", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "113335051986762264633", "name": "Scott Bishop", "time": 1529515428557, "rating": 2.0, "text": "Ok.", "pics": null, "resp": {"time": 1529517508904, "text": "Scott,\n\nWe pride ourselves on our customer service so we hate to hear you had just an ok experience with us. We welcome feedback from customers so we can make sure we are delivering excellent customer service at all times. Please give us a call at 334-887-3976 and ask for either Lorie or Brett. We look forward to hearing from you."}, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "103754739575959049783", "name": "Roman Duprel", "time": 1545246779439, "rating": 3.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "100748542161748357188", "name": "Betsey Grubbs", "time": 1516796563989, "rating": 5.0, "text": "Good people!", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "105339929986108342600", "name": "Larry Gill", "time": 1503279079457, "rating": 5.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "116653803327074013423", "name": "BamaEsco334", "time": 1473180193261, "rating": 1.0, "text": "Crooks", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "116870093977678492069", "name": "Jeff Ott", "time": 1427066930840, "rating": 1.0, "text": "Worst experience I've had with this company. One lie after a another 3 hr  late said they would spread it\nI got 4 piles of it. I was told it would be 26 1/2 ton it was 26, haft ton short I will never use this company again.", "pics": null, "resp": null, "gmap_id": "0x888cf6a425c35753:0x6af9d0b3ca99f1c3"}
{"user_id": "103374242086324184034", "name": "Samuel Tullis", "time": 1618613068631, "rating": 5.0, "text": "Very Professional Staff!", "pics": null, "resp": null, "gmap_id": "0x888e83dd1a6ba061:0x17c0e38d3fcbd674"}
{"user_id": "103162136052860084150", "name": "connie moya", "time": 1614735069818, "rating": 5.0, "text": "This is the company helping people who were affected by the tornado in Fultondale. Not just any company would do this free of charge. If you have excavation needs, consider this company. They have a good heart ❤️", "pics": null, "resp": null, "gmap_id": "0x8889bb9c31449fb3:0xd48bf3362b30c6a1"}
{"user_id": "100639088679056676756", "name": "Roger Barker", "time": 1614112715777, "rating": 5.0, "text": "Top notch service. They were able to get to me quicker than they told me and the gentlemen that came out were extremely professional and courteous. They answered all of my questions. If you are having any septic issues this would be the first place I would call.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "103308412789397971883", "name": "Jonathan A", "time": 1614660311920, "rating": 5.0, "text": "Awesome experience... I was having problems with my lines backing up slightly. Beckham came the first time and had to get the sewage pump removed by the city. They came back after the pump was removed a second time and fixed the problem. Excellent customer service and very friendly to talk to. Thanks for all the help!", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "110610890565114875970", "name": "Dana Roberts", "time": 1620569182574, "rating": 5.0, "text": "Prompt service and delivery. Fair prices.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "117937986260486224502", "name": "Michael Smith Sr", "time": 1612797975494, "rating": 5.0, "text": "Beckham is the ones to call when in need of cleaning out your septic or installation of full  septic systems,they've done both for me and they do a professional job all the way around! Thank you very much! Mr. Smith", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "111170944278033919655", "name": "mark johns", "time": 1602555395598, "rating": 5.0, "text": "Great Company if you have a septic tank. They come out and get to work and take care of everything. Very nice and knowledgeable. I highly recommend them for all your septic tank needs!!", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "106050411289251251894", "name": "Lauren Carr", "time": 1568236613624, "rating": 5.0, "text": "I was having a panic attack because our septic was backed up...(toilets, showers...yuck) called and they fit us in their schedule.  They found our ‘hidden’ septic, pumped it out, and diagnosed some other issues we needed to address.  They know what they are doing!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipONc8JeiUouHXtQEXTBH2Ane88bn_yJAjbJD3Om=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP82W8p-4vxVZoAAOP8CSxbdzPhGaebs541ybW5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNt7RnkRrfd12BoGteYT9sJvpLQM4czPZkrHu01=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "103315500884180346693", "name": "Edwin Knowles", "time": 1621662853484, "rating": 4.0, "text": "Good place to take care of what you need", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "117730551450805331612", "name": "Shelia DeVoe", "time": 1620849584028, "rating": 4.0, "text": "Talked to a very nice lady", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "108893711364249011637", "name": "Kris Mucho Burger", "time": 1619760599639, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "103676085010133939354", "name": "Linda Rose", "time": 1614293146757, "rating": 5.0, "text": "Friendly staff and get the job done attitude.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "114362352266200764789", "name": "Jerri Kandle", "time": 1588949616745, "rating": 5.0, "text": "Great place to get rock for landscaping. Very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "107241340788942704880", "name": "Angel Straughn", "time": 1558060871984, "rating": 5.0, "text": "Mr. Beckham helped my family when we were struggling. Our fill(?) Or drainage lines from our septic tank were installed professionally by his crew and he even oversaw the work to guarantee it was done right. After 15 yrs  It's held up damn good with only minor incidents within the last 5. I am thankful that he gave us a break and worked with us on payment even though we had never met before that day.. hard too find good business men like that nowadays.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "111589273743175363139", "name": "William Self", "time": 1603800769310, "rating": 5.0, "text": "Very professional, honest business.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "109779427199515129685", "name": "Dave Diaz", "time": 1543549999893, "rating": 5.0, "text": "The day after Thanksgiving!!!  I called at 8:30 in the morning and had the septic pumped and ground filled back in before noon.  I was told the cost up front on the phone and there where ZERO hidden add-on charges.  Great service!  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "105375422697623443573", "name": "Jason Estaphan", "time": 1504804380510, "rating": 5.0, "text": "When my house was 6 years old I decided to have Beckham conduct a preventive maintenance inspection and service of my septic system.  The technician that came out was very friendly and happily answered all my questions.  This is my first house with a septic system so I had a great deal of questions.  The technician explained to me what he was inspecting for as well as explaining the concept of operation for a healthy system.  He also taught me how to keep my system healthy between services as well as tasks I could perform myself to avoid the cost of a service visit if I experience some common minor issues with my system.\nI do not list prices in reviews since prices can always change, but I will say that I was surprised how reasonable the price was considering the time and effort involved in properly inspecting my system.  I have recommended Beckham to quite a few of my neighbors and co-workers since I received my service and have not heard anything negative from anyone.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "104780671590124512704", "name": "Tim Brooks", "time": 1553349659332, "rating": 5.0, "text": "I have an early 1950s vintage house with same era septic tank.  I bought the house about 7 years ago and had no clue where the tank was but had a general idea.  Nick and crew came in, found the tank in 20-30 seconds, marked off approximately where it was, dug down to it and sure enough there it was, just as they'd suspected.  It was, in fact, the source of my problems in the house.  It was full of water.  They cleaned it out, resealed and covered it and i'm good for another 3 to 5 years.  Great job fellas and enjoyed chewing the cud with yall while being schooled on what my problem was and given options on how to address them going forward after this stop-gap measure.  Good stuff Beckham Septic.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "105301130749763764084", "name": "Glen Woodard", "time": 1502818963798, "rating": 5.0, "text": "Great Service! We had a sewage back-up problem with our septic tank/system. Beckham team (Heath and Ziebol) went out of their way to work us into the schedule quickly. When they arrived they pumped the tank and took the few extra minutes to point out problem areas. The workers were friendly, courteous and careful with the truck. They also provided options for related/future repairs without selling me anything specific.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "116940310739111391505", "name": "Elena Wyatt", "time": 1477587765445, "rating": 5.0, "text": "Ben Beckham sent a crew (Wayne, Danny, and Drew) out to put in a new septic tank at our farm.  They are courteous and hard working!  A thousand recommendations for Beckham Septic tank company.  Clean, thorough and a great job.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "100807167007877559763", "name": "Mark Doyle", "time": 1563370358918, "rating": 4.0, "text": "Good place locally to pick up dirt/gravel, or sand. A little expensive, but local has a price!", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "109968272946088520335", "name": "Katie Whipple", "time": 1420067075144, "rating": 5.0, "text": "Absolutely great service.  They came out to my house and were there till 11:00PM on a holiday weekend just to make sure everything was working properly.", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "103175554785426972020", "name": "steve tolver", "time": 1579617265687, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "116323956863434844674", "name": "Mark Howard", "time": 1553303279357, "rating": 5.0, "text": "Nice friendly people", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "115211438186003211319", "name": "Dianne Barody", "time": 1478968639749, "rating": 1.0, "text": "My septic is less than 8 yrs old and they installed it. I have since then had it pumped out two times. They did a horrible job .", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
{"user_id": "106131548092225426664", "name": "Austin and Britney Parker", "time": 1477935955665, "rating": 5.0, "text": "Established and Professional", "pics": null, "resp": null, "gmap_id": "0x88926c3ac2569eaf:0xbcfcb3559147d68c"}
