{"user_id": "113255891038668824937", "name": "KAREN Davis", "time": 1628468452392, "rating": 5.0, "text": "Everyone is professional and very pleasant. In and out in no time at all. I enjoy going here.", "pics": null, "resp": null, "gmap_id": "0x88628b246b3d7b39:0x666ee66b0b181715"}
{"user_id": "117301029356773724754", "name": "Janey Motes", "time": 1455985420877, "rating": 5.0, "text": "Always friendly service, and you always greet a smiling face with miss Kari and Ashley that are there. Love knowing I can rely on their help!", "pics": null, "resp": null, "gmap_id": "0x88628b246b3d7b39:0x666ee66b0b181715"}
{"user_id": "111808094991275648324", "name": "Jamie Hudson", "time": 1626202616469, "rating": 1.0, "text": "Don't waste your time or money here! There are much more valuable options for your insurance needs from other providers. ALFA is horrible!", "pics": null, "resp": null, "gmap_id": "0x8889cbbdee5e9ca5:0x45725fc3422c3a0f"}
{"user_id": "102755576709956134879", "name": "Justin Floyd", "time": 1593632253258, "rating": 2.0, "text": "Very rude front desk workers that were\nnot interested at all in seeing me.", "pics": null, "resp": null, "gmap_id": "0x8889cbbdee5e9ca5:0x45725fc3422c3a0f"}
{"user_id": "116205855454198303897", "name": "Jill Herring", "time": 1518732771373, "rating": 5.0, "text": "Buddy, Kristen and staff has always bent over backwards to help answer questions and take care of our home and auto insurance needs. Thank you Buddy!!", "pics": null, "resp": null, "gmap_id": "0x8889cbbdee5e9ca5:0x45725fc3422c3a0f"}
{"user_id": "112653080769808270384", "name": "Sean", "time": 1623849232443, "rating": 5.0, "text": "I'm a 3rd generation Alfa customer.  I've been working with Tyler Ross for some years now.  It's easy to take him for granted.  I'm used to quick friendly responses as my insurance needs evolve over the years.  It's a good feeling knowing that if something ill occurred, Tyler would personally be on the other side of our phone call, watching out for my best interests.  That's just not something you get with most insurance companies.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "116434852083388879342", "name": "Ruth Hearne", "time": 1560438192169, "rating": 1.0, "text": "All three women that work there have dismissed all my questions and requests and I've been made to feel it's because I'm a young adult, despite it being my money that I'm using to pay for my car insurance for my own car, that I also bought with my money. However, as soon as my mom goes there for me to ask questions about my account, they answer every questions perfectly with excellent explanations. This has been going on for the past two years I've been with them and has happened twice in the past four weeks. I also don't understand why they keep telling me they're not capable of printing out a breakdown of my accounts and also keep telling me that they have no explanation for changes made to my account. I'm also told that they are incapable of notifying me of any changes made to my account. So I keep finding out that they're overcharging me after the fact. They are very short and rude with me but as soon as my mother steps in they are polite and give her all the answers I have been trying to ask. I have tried to resolve these issues with them multiple times but they refuse to talk to me. They shut down and just keep repeating \"I can't do that it's out of my hands\" to every single question I have about my account, but they give all answers and explanations to my mom.\n\nUpdate: I called headquarters today and who I spoke with said \"if she can pull up your breakdown on her computer and tell you what's going on with your account there's no reason she cant give that to you.\" The person at headquarters i spoke with immediately emailed me my breakdown and reviewed it with me in real time. I was also told I should be getting letters in the mail with updates on any and all changes (which i never have gotten and I've been asking this office to fix) so the lady at headquarters made a note on my account for that to be fixed.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "115977458552717310182", "name": "Justin Young", "time": 1568838213207, "rating": 5.0, "text": "Tyler Ross is an exceptional person. He is very thorough, caring, and driven to serve to his customers. If you live in the South Huntsville Area, and are needing professional insurance advice and service, he's your guy.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "113291594850599514913", "name": "Rob Austin", "time": 1597943448096, "rating": 5.0, "text": "Tyler provides excellent service for his clients!", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "118005019822138114336", "name": "Tyler Ross", "time": 1568731374866, "rating": 5.0, "text": "Wonderful ladies out front, great service. Trusted claims service. I was a customer before I was an agent!", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "103100108075498210856", "name": "Linda Edwards", "time": 1530306608069, "rating": 5.0, "text": "The employees are so friendly and always try to help in any way they can. Even 30 minutes before closing the office they took my call and helped me!", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "107664738144158443415", "name": "Leon Coyner", "time": 1533680282323, "rating": 1.0, "text": "Had a break in 2 months ago still waiting  on adjuster to send paperwork.", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "110173963842502647556", "name": "Michael Beasley", "time": 1532990155387, "rating": 5.0, "text": "All I can say is thank you Mario Williams you went above and beyond and saved the day", "pics": null, "resp": null, "gmap_id": "0x88620d585864162f:0x9c833d18b0a92a7a"}
{"user_id": "117800999328705908307", "name": "Wally W", "time": 1576346569118, "rating": 5.0, "text": "Great insurance been with them 20 years never had a issue with claims they have always been there.", "pics": null, "resp": null, "gmap_id": "0x88928eee09c951a1:0x2780a3f46e75dd5"}
{"user_id": "107227098665924559172", "name": "Don Hand", "time": 1502412133458, "rating": 4.0, "text": "Good experience with this office.", "pics": null, "resp": null, "gmap_id": "0x88928eee09c951a1:0x2780a3f46e75dd5"}
{"user_id": "106741270653134453184", "name": "Scott Plagmann", "time": 1496615887841, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": null, "gmap_id": "0x8889046c4dc2a7b7:0xd9b1998d45410ddb"}
{"user_id": "115874563116520773011", "name": "Jill Ainsworth", "time": 1566466714086, "rating": 5.0, "text": "My husband and I recently purchased our first home and in trying to find the best rates for homeowners insurance we were referred to Gabe Martin.  Hands down  the best possible choice for our family! Not only did he give us a much cheaper rate on homeowners insurance he was also able to get us a better rate on car insurance and point out some changes we needed to make to be sure if we were in a accident we were completely covered. Gabe took the extra time to sit down with us and explain every question we had in regards to homeowners, vehicle and life insurance. I am so very glad we were steered in his direction! He was a blessing to our family in what can be a very stressful time and we are forever thankful for his guidance and look forward to doing business with him for many years to come!!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "104313680687472899875", "name": "stephanie ziglar", "time": 1569071810918, "rating": 5.0, "text": "Gabe & His Staff have went above & beyond for my family!!!!  We could not be happier with how easy it was to transfer our insurance to him.   Super Fast, Exceptional Customer Service, & rates that were saving my family money!!  It was a Win Win!!! Thanks Gabe!!!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "100643199118892719993", "name": "Tony T", "time": 1610045760329, "rating": 1.0, "text": "Absolutely terrible should just close this location down", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "112129277729705995189", "name": "Christin Moore", "time": 1513737268132, "rating": 5.0, "text": "My husband and I have life insurance through Alfa and our agent is Gabe Martin.  Any time that we have questions about our policies, he is very quick to respond and willing to advise us on which policies are most appropriate for us. He truly cares about his customers and will do whatever he can to provide exceptional service. There is honestly no one I would feel more comfortable entrusting with our insurance needs.", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "115467300363797450132", "name": "Sandy Love", "time": 1513741858300, "rating": 5.0, "text": "I've known Gabe for years! The first time I insured anything with him, I bought a car toward the end of the work day on a Friday (I believe) and he agreed to insure! That was in 2007! Since then, I've gotten married and we ended up moving all our insurance to Gabe! He has always been helpful - through 3 totaled vehicles😱! He is dedicated and truly cares about his clients.\nFor each accident, Gabe made sure I knew each step to take (although unfortunately by the 3rd I was starting to feel like a pro😞). He worked to make sure everything was in order and handled so the claim was paid quickly... Even when we were hit by an uninsured driver. Even though our vehicle insurance was dropped (because of Alfa regulations about total loss - NOT GABE), we have our other insurance with Gabe still - with no plans of changing! He was extremely helpful when we recently bought a home. (*and btw, Gabe made several phone calls with me sitting in his office trying to get the auto insurance reinstated).\nGabe is a hard-working, trustworthy, community-minded man that I would recommend to anyone looking for insurance!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "102040461105288587049", "name": "John Cole II", "time": 1550856144215, "rating": 5.0, "text": "Best agents in town! Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "111114512807709466408", "name": "Abby Fry", "time": 1513978253668, "rating": 1.0, "text": "I feel the need to warn people of getting ripped off by a local insurance agent Gabe Martin with Alfa insurance. My husband and I began looking for our home to purchase in August 2017. After we decided on a home and were under contract I contacted Gabe for a quote. My husband and I decided that since we will be moving in a few years it was best to keep our current insurance-- we've never had any issues with them. We closed on our home on Oct 24th 2017. I noticed in November that our homeowners insurance never got paid (the seller paid 1 year at closing). I contacted both my insurance company and our mortgage company. The mortgage company had the incorrect insurance information and the two exchange information. In the meanwhile, Gabe showed up to my home and told my husband that I had contacted him to change insurance companies and had him sign an application--3 weeks AFTER we closed on our home. Now, why would an insurance agent that I contacted be going behind my back and having my husband sign paperwork? My husband trusts what he said and signs the paper, we just wrote it off as just for it was for quotes or something and never thought of it again. A couple of weeks later, I get a letter from our mortgage company stating that we had previously had Alfa insurance and that it was our responsibility to cancel our policy. Now, I never received a single letter from them-- I had no idea what my policy number even was. They had received a check and cashed it WITHOUT ANY KIND OF PERMISSION. I called Veterans United to find out that Gabe took it upon himself to get my PERSONAL loan information from my lender and added Alfa insurance to our loan-- we never signed any kind of paperwork when did this. I called Gabes office-- who could not care less about the issues I was having. The secretaries were VERY disrespectful and nasty. Then Gabe called me and was even worse. He was saying that he had text messages saying I wanted insurance-- which was not true. And said that this was my fault and that I had contacted him and I must have forgotten. I had to take this all the way up to the district manager and it took 2 months and I'm currently waiting on my refund check. Remember how I said the seller paid at closing? Well, that amount was less than what our current insurance is-- and since we've closed there is no way to get the hundreds of dollars difference back from the old seller so we are out this money because of Gabes actions. We never received any kind of apology and they take no responsibility. I would steer clear of Alfa insurance-- especially Gabe Martin.\n\n**** there one only one review of Gabe Martin-- from himself. Since I've given this very honest review magically there are multiple positive reviews. FAKE!", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "112646355693632748268", "name": "Stephanie Van Zante", "time": 1531945933655, "rating": 5.0, "text": "Friendly staff, great service", "pics": null, "resp": null, "gmap_id": "0x88926eb102cb9f25:0xa08cd89fd8078a60"}
{"user_id": "110616671367226506577", "name": "Carolyn Lossing", "time": 1582929367832, "rating": 5.0, "text": "Me. Ken, Miss. Sandy, and Miss. Brenda are so sweet and helpful! I love this office they are like family!", "pics": null, "resp": null, "gmap_id": "0x8892f5ad3b762a75:0x2017ccf0bcf755a0"}
{"user_id": "103810348722060945059", "name": "Denise Marsh", "time": 1613508100170, "rating": 1.0, "text": "I am not personally still a client. After the 2011 tornadoes and us not having a claim at all, our premiums went up dramatically. So, I chose State Farm. My mom recently had a pretty severe accident with a family member. My mom's policy states that medical-wise, she was paying the premium that included $300,000 per accident, per person. My family member was in the hospital for a couple of months. ALFA refuses to pay no more than $5000 for our family member's medical bills. What is the purpose of paying premiums for well over 25 years, only for it to be absolutely misleading when it actually came to a claim being filed. I highly suggest doing research before going with ALFA. AND you have to pay $135 annual fee JUST to be a member? No thanks. My mom's car she bought to replace her totaled one was quoted at DOUBLE what the same policy State Farm quoted. So, needless to say, she's with State Farm now.", "pics": null, "resp": null, "gmap_id": "0x886238ae31b72639:0xc1cd235494377e07"}
{"user_id": "102413442602877426720", "name": "Steven Hyden", "time": 1546623279552, "rating": 5.0, "text": "I haven't had a claim yet thankfully, but they have the friendliest staff I've ever seen. They are always helpful and pleasent. Very happy with them so far!!", "pics": null, "resp": null, "gmap_id": "0x886238ae31b72639:0xc1cd235494377e07"}
{"user_id": "110854299656033283928", "name": "Justin Marr", "time": 1595630641335, "rating": 5.0, "text": "Zac is not your typical insurance agent. He goes the extra mile to be sure you have the right amount of coverage for your situation at an affordable price. He is very professional and knowledgeable. He is always available to answer any questions and has a wonderful personality. You could not find a better agent I highly recommend him. He is fantastic! Our insurance needs were very unique, but he was able to get everything covered! Give him a call for a quote!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "115230406252358551426", "name": "Laura Price", "time": 1597456858845, "rating": 5.0, "text": "My husband and I looked into adding our 16 year old son to our car insurance policy with another insurance company. We were faithful customers with this company for many years and we were absolutely shocked when our rate increased by more than $350 per month! Even after having the same policy for many years, they would not work with us to find a rate we could afford. We started shopping around, and quickly found that Zac Stokes was able to give us the lower rate we were looking for. We are so thankful for all his help! His costumer service was top notch. We are even talking with him about switching our homeowners and life insurance. You will not regret working with Zac for any insurance needs you have.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "115831920679422057663", "name": "Ricky Doyal", "time": 1592619154958, "rating": 5.0, "text": "New Agent in the office, Zac, was very informative. He took time to explain my options and answered all my insurance questions and concerns. Plus showed me how I could increase my coverages without braking the bank, actually saved me some money annually.", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "117780145703181759343", "name": "Steve Webber", "time": 1507084152597, "rating": 1.0, "text": "No complaint about this office in general but more the company as a whole. Terrible customer service and even worse customer loyalty. They have no regard for their customers. Buyer beware. They do not stand up for you even after being a customer for 20+ years with only filing claims 3 times are n that span.", "pics": null, "resp": {"time": 1532357155177, "text": "Steve, I am very sorry that you have been so displeased with our company.  Perhaps if you gave our specific location a try we could try and earn your business.  Reach out to me at 251-661-9957"}, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "110977361075062353679", "name": "Noah Crossfield", "time": 1527910003220, "rating": 1.0, "text": "I spoke to Kelly Deford about insurance, and it was a bad experience. My parents have used ALFA for years, so I sought them out. It seemed as though the insurance premiums were significantly higher than other so I asked about changing the coverage amounts. (I certainly do not have over $150,000 of possessions in my house). I was given fairly ambiguous answers and felt as though I was being told simplified versions of the policies. It was not sufficient. Every time I told Kelly that I was looking at other companies, she would find another discount that was miraculously available despite the fact that the last three quotes I got were \"the lowest quote I could have gotten.\" I was not pleased, so I tried to work through a different ALFA agent. Kelly called me to let me know that she was watching her system, and that I had to work with her if I wanted to go through ALFA. Regardless of her intent, it came across as incredibly manipulative and threatening. I will never use ALFA, but if you want to I encourage you to pick very carefully who you get your initial quote from because it is apparently not an option to change if you are not content.", "pics": null, "resp": {"time": 1532356841861, "text": "Hi Noah! I am sorry to hear that you had such a bad experience. I am normally known for my exceptional personalized service and attention to detail, and regret that I did not deliver that to you.  I am available to discuss this problem further and rectify any concerns that you may have had 251-661-9957. I look forward to speaking with you and earning your business back."}, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "110754710922066890541", "name": "Annette Lundy", "time": 1593140897468, "rating": 5.0, "text": "Very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "107562939036068414398", "name": "David Jackson", "time": 1532715670280, "rating": 1.0, "text": "Customer service is terrible the guy in charge is never there and they were extremely rude if I could give them no Stars I would", "pics": null, "resp": null, "gmap_id": "0x889bb2e6c0d5e40b:0xe81a0bea18adb9e9"}
{"user_id": "112874030379735311242", "name": "Jade Skye", "time": 1557495477294, "rating": 1.0, "text": "I dont know why they feel the need to give out personal information to family members. They have never called us directly to handle anything instead calling a family member they know to do business for them? Very unprofessional.  Everytime we did try to get some info on when our bill was due or how much they could not seem to find the answer? Pointless and ignorant agents to work with. Oh and they called our family member to tell them we were cancelled!", "pics": null, "resp": null, "gmap_id": "0x8888c8c654865663:0x6975165964f09d40"}
{"user_id": "102993565637065628945", "name": "Supa CG", "time": 1489432130255, "rating": 1.0, "text": "I would give this location 0 stars if I could. Rhonda at this location was beyond rude to my mother for absolutely no reason. Myself, my mother, my little brother and my aunt and my father all have insurance with Alfa and we will all be cancelling our auto insurance and our life insurance policies this next month because of her. We have a total of eleven policies with them between all of my family members. This is our local office and I refuse to pay someone who talks down to my family. I have been with this company for 7 years, my brother has been with them 5 years and my mother has been with them for 20+ years and we have never had a single problem with them until now but the bullying that she did to my mother is just intolerable. Furthermore I intend to use all of the resources at my disposal to let everyone I know of my experience with her. I could go on and on but the point is that she has been inexcusably rude and it is because of her that Alfa will lose a total of eleven policies.", "pics": null, "resp": null, "gmap_id": "0x8888c8c654865663:0x6975165964f09d40"}
{"user_id": "115833354626560237882", "name": "Julie Fulmer", "time": 1526867190375, "rating": 5.0, "text": "Go see Rhonda!", "pics": null, "resp": null, "gmap_id": "0x8888c8c654865663:0x6975165964f09d40"}
