{"user_id": "100440800575191516765", "name": "Elizabeth Carver", "time": 1628879578699, "rating": 5.0, "text": "We were coming in from out of town and my crown snapped on my front tooth. They worked me in and even saw me early since we got into town earlier than expected. She was so kind and sympathetic to my situation. If I lived here I would choose this practice for my whole family. Great experience all around.", "pics": null, "resp": {"time": 1629123159151, "text": "Thank you for the 5 star review Liz!  We so appreciate your thoughtfulness here at Dr. Pamela Edwards Dentistry!  We hope you enjoyed the concert and safely made it home!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "117445189799208478257", "name": "Randy Wedel", "time": 1628029543379, "rating": 5.0, "text": "I was in Gulf Shores on a family vacation and chipped a tooth. Concerned that I might have cracked the tooth I searched for a local dental practice that could help in a hurry. Thanks to Google reviews I lucked out and found Dr Edwards and Doctor Long. I was in the chair quickly and Dr Long did a thorough evaluation and gave me three options. Since I was there I chose to have the tooth repaired. 20 quick minutes I was fixed and on the way back to the beach. Painless, professional, and very kind. Also thanks to Lu Lu for scheduling me in so quickly and assisting in the procedure. I can assure you If I lived in the area, these would be my dentists. Thanks again Dr Long", "pics": null, "resp": {"time": 1628529164952, "text": "Randy, we so appreciate the 5 STAR review!  Here at Dr. Pamela Edwards Dentistry we try to accommodate our emergencies so that they may enjoy their vacations!  We hope you had a great time at the beach!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116712352414957526349", "name": "Aubrey Bianco", "time": 1612974881902, "rating": 5.0, "text": "The women at Dr. Pamela Edwards Dentistry are kind, caring, and very professional. The office space is beautiful and clean, and they take responsible COVID precautions to keep everyone as safe as possible. They all had my best interest at heart during procedures, whether that was a simple teeth cleaning or tooth filling. Dr. Mary was even willing to fit me in for an additional filling the same day, even if that meant cutting her lunch a little short....oh, and not to mention, that was on all on her birthday!! I recommend these ladies to anyone and everyone visiting the island or living here full time!", "pics": null, "resp": {"time": 1613575030085, "text": "Thank you Aubrey for the sweet review:)  We appreciate you as a patient here at Dr. Pamela Edwards Dentistry and glad we can help!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "104899247306997818073", "name": "Matt Mcclane", "time": 1617995096343, "rating": 5.0, "text": "Absolutely amazing family of dentists. Always polite and very helpful have always got me right in especially if it’s an emergency I drive over an hour to see them every time. The only dentists I will use.", "pics": null, "resp": {"time": 1618242539988, "text": "Thank you Matt for the 5 STAR review!  We hope you are well and call us here at Dr. Pamela Edwards Dentistry if you need anything!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "103710730532972880089", "name": "Sue Ann B", "time": 1607572661556, "rating": 5.0, "text": "I would give them 10 stars if I could 😀!  I called with an emergency when I broke my tooth and they were able to get me in.  Everyone in the office was so kind and caring.  Kim took the time to explain everything they were going to do and stayed with me through the entire process.  Dr. Long was amazing and one of the best dentist I have ever been to!  She was able to repair my tooth and made sure I was comfortable during the procedure.  I would highly recommend them!  They represent the best of the best of Gulf Shores!", "pics": null, "resp": {"time": 1608220972593, "text": "Thank you so much Sue Ann! It was a pleasure to treat you here at Dr. Pamela Edwards Dentistry and look forward to seeing you again!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113544784563397714920", "name": "Pat Nadolski", "time": 1611236616058, "rating": 5.0, "text": "My husband and I spend winters in Gulf Shores.  On New Year’s Day I broke a molar and was very concerned about finding a dentist.  No worries, we were able to make an emergency appointment to see Dr. Mary.  What a positive experience!  Everyone was professional and best of all friendly, showing a genuine interest in getting to know a little about me personally.  I highly recommend this practice.  We will definitely return here for all of our dental needs.", "pics": null, "resp": {"time": 1611241607531, "text": "Thank you so much for your kind words, we enjoy having you as a patient here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "108034747061564675834", "name": "Shelly Sharkey", "time": 1623210412057, "rating": 1.0, "text": "An awful experience. Easily spent 45 mins in Dr Pamela Edwards office without ever even speaking to the doctor and basically just lectured at and sent away with no resolution. Called a different dentist the same day and within a week, my daughter has had a full exam, xrays and multiple apts completed and has her front teeth fixed and her smile back, which everyone deserves. I was just dumbfounded that the doctor wouldn’t even come out of her personal office to speak to us as a new patient in her office, and the condescending treatment by her assistant or hygienist or whoever she was, was mind blowing.  Let alone the issues to even get an appointment scheduled in the first place and then it was the “wrong type” appointment I was informed when we arrived. Don’t worry about my too complicated daughters case Dr. Edwards, it was easily resolved by another Dentist willing to take the time.", "pics": null, "resp": {"time": 1627480724289, "text": "Hi Shelly, We would like to apologize for your negative experience. We’re normally known for our exceptional patient care, and we regret that we missed the mark. My name is Bryan and I am the office manager. If you’d like to discuss this further, please contact me at (251) 500-1025 so we can work toward making this right."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "102798552068936175374", "name": "Glenda Sickles", "time": 1614980782836, "rating": 5.0, "text": "This dentistry office is incredible.  I'm a Snowbird in Gulf Shores, Alabama and had a bridge fall out.  Away from home with a dental problem...what to do?  Family Dentistry has an ad in the local paper that they  love winter guests and accept emergencies.  I was both!!  They gave me an appointment the next day, took impressions, pulled a tooth and in three weeks I had a new bridge.  Dr. Mary Edwards-Long is kind, compassionate, and all procedures were pain-free.  She is friendly and we visited like old friends.  Her assistants, Kim 1 and Kim 2, were equally caring and efficient.  The whole office was careful with Covid 19 practices in place.  I can highly recommend this dentistry office!", "pics": null, "resp": {"time": 1615233103366, "text": "Thank you so much Glenda for the stellar 5 star review!  We so enjoyed having you as a patient this winter here at Dr. Pamela Edwards Dentistry  and hope you stop by to say hello when you return next winter!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116871257425676724879", "name": "Renee Ziegelbauer", "time": 1622220748700, "rating": 5.0, "text": "It was a very satisfying experience. Got an appointment right away and everyone was very friendly. Dr Edwards fixed my broken tooth as good as new and I never felt a thing. I recommend this practice highly.", "pics": null, "resp": {"time": 1607440241144, "text": "Thank you Renee for the stellar 5 star review!  You were a pleasure here at Dr. Pamela Edwards Dentistry and we hope you have a wonderful time in our small beach town!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107347205390787217582", "name": "Laurence Waterford", "time": 1616526434469, "rating": 5.0, "text": "Painless, efficient, and reasonable! It was easy to get a new patient appointment:) Highly recommend!", "pics": null, "resp": {"time": 1616599241943, "text": "Thank you Laurence for the 5 star review!  We look forward to seeing you again here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "109992211678560912217", "name": "Lindsay Scogin", "time": 1606764910974, "rating": 5.0, "text": "Dr. Long and staff are fantastic. Very friendly and I know I’m in good hands with them. Every experience there has been top notch! Thanks so much!", "pics": null, "resp": {"time": 1606924274142, "text": "Dear Lizzy, thank you so very much for the lovely review. We enjoy having you as a patient here at Dr. Pamela Edwards Dentistry and hope all is well with you and yours. Please come by and see us anytime!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107895436442352151171", "name": "williamcleere", "time": 1598490352985, "rating": 5.0, "text": "I didn't go to the dentist for many years because of bad experiences as a child. I started going here several years ago and they have been awesome! The whole staff put me at ease from the very first visit and the care has been excellent! I highly recommend Dr. Pamela Edwards Dentistry.", "pics": null, "resp": {"time": 1598543434164, "text": "Thank you so much David for your kind words. We love having you as a patient here at Dr. Pamela Edwards Dentistry. See you next time."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "100852840691330073802", "name": "Kim Tittle", "time": 1617647253266, "rating": 5.0, "text": "My husband loves this place! Teeth feel great!", "pics": null, "resp": {"time": 1617804703190, "text": "Thank you for the great review Kim! We look forward to treating all you dental needs here at Dr. Pamela Edwards Dentistry ."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "108828524844116142116", "name": "Susan King", "time": 1599692730491, "rating": 5.0, "text": "Dr Edwards took me in as an emergency patient on the Friday before a holiday weekend after I cracked a tooth. She was great, the staff was was incredible. It was a pleasure. I’d highly recommend them.", "pics": null, "resp": {"time": 1599833768637, "text": "Thank you so much Susan!  We are glad we could help here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "109748822718271145758", "name": "Holly Trimpey", "time": 1602914643033, "rating": 5.0, "text": "My husband is working out of state and had a work injury causing a chipped front tooth. The receptionist was able to fit him in immediately and without any hassle. He has a slight fear of dentists but he felt very comfortable the whole time he was there. They offer many payment options and were very patient and understanding. The dentist and the receptionists made wife and husband both feel at ease. Hubby says if we didn’t live 1000 miles away they would be our primary dentist office. Thank you ladies for all of your effort and making both hubby and myself less stressed about an already stressful situation.", "pics": null, "resp": {"time": 1603115591499, "text": "Mrs. Trimpey, Thank you so much for the 5 STAR google review!  We are happy we could help in your time of need and please come visit us here at Dr. Pamela Edwards Dentistry if you are ever in the area again to say hello:)"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107725966810708064818", "name": "Dot Perkins", "time": 1596904055678, "rating": 5.0, "text": "I was on vacation and needed an emergency visit.   I called and got an immediate appointment.   Due to COVID, I was met at my car for a temperature check/screening  and then taken right in.  I was given excellent care and  was soon on the road to recovery from horrible tooth pain.  Price for services was reasonable.  They filed my dental insurance and my check for payment came today!   I highly recommend this dentist office.  The dentist, assistant, and office staff are exceptional.  Wish they were in my home state.  I’d switch dentist if they were.", "pics": null, "resp": {"time": 1597068817359, "text": "Thank you so much Dot for the stellar 5 star google review!  We hope you had a wonderful weekend and we would be happy to take care of you next time you are down here at Dr. Pamela Edwards Dentistry:)"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "101315047186797699072", "name": "Michelle M", "time": 1598551202915, "rating": 5.0, "text": "Dr. Edwards is an awesome dentist! I have had a lot of dental work done by her, and I have been very satisfied with every aspect of it. She and her staff are very professional, caring and helpful. I would highly recommend.", "pics": null, "resp": {"time": 1598881733694, "text": "Thank you Michelle for the 5 star google review!  We miss your pretty face here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "102616097894735510373", "name": "Jennifer Nevers", "time": 1596540078457, "rating": 5.0, "text": "I was on vacation when my temporary bridge cracked. Called late Sunday. They not only answered, but got me in first thing Monday morning. They were awesome! Knew what they were doing and were so kind and friendly. I’m so glad I found them 😊.", "pics": null, "resp": {"time": 1596723257286, "text": "Thank you Jennifer for the kind google review of us here at Dr. Pamela Edwards Dentistry!  We hope you are having an awesome vacation!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "108734392972708753960", "name": "Kinsey Clark", "time": 1592852558957, "rating": 5.0, "text": "Dr. Long is so kind and the staff here is great! We had a super easy going dentist visit and they are doing a great job practicing extra health and safety steps to help prevent the spread of the virus. Ten out of ten would recommend!", "pics": null, "resp": {"time": 1592941634340, "text": "Thank you so much Kinsey from us here at Dr. Pamela Edwards Dentistry and congratulations on your graduation and the exciting voyage ahead of you!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "118221727880634853767", "name": "Todd Wiese", "time": 1583489382750, "rating": 5.0, "text": "This Dentistry has been Awesome for me.   Three separate recent problems, so I contacted Cathy.  Appointments were made quickly, and  problems solved without having to come back. Work was done painlessly and with lasting results.   Wonderful  office atmosphere.    Now,  I wont go anywhere else.   Thank you for great service.", "pics": null, "resp": {"time": 1583531304306, "text": "Thank you so much for the stellar review Detective!  We enjoy seeing you here at Dr. Pamela Edwards Dentistry and hope you have a great spring!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "100034744989100488526", "name": "Steven Wood", "time": 1565183244132, "rating": 5.0, "text": "Was in bound for vacation in Gulf Shores when recent dental work I had done at home started giving me trouble - my wife called all the dentists in the area and only Dr. Edwards was willing to help. Dr. Edwards and her staff were completely transparent with the cost (even helped with a discount) and got me in and out of the chair within 40 minutes of arrival. After my visit, I was able to comfortably enjoy the rest of my time in Gulf Shores. I highly recommend Dr. Edwards and her staff! Thank you!", "pics": null, "resp": {"time": 1568991703266, "text": "Thank you Mr. Wood for the sweet review of us here at Dr. Pamela Edwards Dentistry and we are happy you enjoyed your time here!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113180262553188670832", "name": "Kim Ting", "time": 1612812654476, "rating": 5.0, "text": "Love this office! Highly recommend!", "pics": null, "resp": {"time": 1612813619299, "text": "Thank you for the 5 STAR review! It was great to see you Kim here at Dr. Pamela Edwards Dentistry !"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "103547184139733646861", "name": "Lisa Barnett", "time": 1581385667636, "rating": 5.0, "text": "After just moving to Gulf Shores my husband and I had emergency needs for a Dentist.  Dr. Edwards and her staff were able to get us in very fast and they were great! I have always had a fear of going to the dentist and they made me feel very at ease.  I would highly recommend this office!", "pics": null, "resp": {"time": 1581519695045, "text": "Dear Lisa, Thank you so much for the sweet google review of us here at Dr. Pamela Edwards Dentistry and I am so happy we could alleviate your pain and dental fears!  Please call if you need anything!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "115023971281417884180", "name": "Sarah Ballard", "time": 1580248003662, "rating": 5.0, "text": "I just went and saw the duo today and I can’t tell you how informative they were about my issues. I’ve got a long road for gum problem but the referred to some great surgeons and just made me feel right at home. Such sweet women in that place. Very professional, I’ve been to a lot of dentist and I’ve  never been treated so special ❤️ Thank you ladies", "pics": null, "resp": {"time": 1580311918664, "text": "Sarah, we so appreciate you coming to see us today and leaving such a sweet review of us here at Dr. Pamela Edwards Dentistry !  Call anytime if you have more questions, we are happy to help!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106184557121123866722", "name": "Jane Randolph", "time": 1579305665858, "rating": 5.0, "text": "It was a great experience from scheduling an appointment to the actual visit. The entire staff was welcoming, they explained everything from treatment to cost. I am so glad I found them. This is one dental experience that I left feeling good about coming back.", "pics": null, "resp": {"time": 1579536822198, "text": "Wow, thank you so much Jane for the kind review of us here at Dr. Pamela Edwards Dentistry!  We look forward to seeing you in the future:)"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "108325913728881329484", "name": "Amie McCully", "time": 1560279489167, "rating": 5.0, "text": "I am astounded by the absolutely stellar care & treatment I received from Dr. Edwards as well as her entire team. I have put off much needed dental work for years and am so grateful to be following through with this office.\n\nI felt beyond at ease during my appointments which involve receiving crowns; all of my interactions with everyone apart of this team has far exceeded all of my expectations.\n\nI am especially grateful for their professional/gentle/educational approach; very thankful for all their assistance in working with our confusing insurance issues!\n\nI highly recommend Dr. Edwards and her excellent team; looking forward to their services in the future.  So happy to finally having all of my teeth & maintaining my smile!", "pics": null, "resp": {"time": 1579536896112, "text": "Wow Amie!  We so appreciate the awesome review of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "103637650157977336757", "name": "Heather Jajeh", "time": 1592943415474, "rating": 5.0, "text": "Love coming here! Dr. Pamela and Dr. Mary are excellent and love what they do. Highly recommend!", "pics": null, "resp": {"time": 1592948437022, "text": "Thank you Heather and we look forward to seeing you all again:)"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106710097819687869453", "name": "Taylor Means", "time": 1579281385468, "rating": 5.0, "text": "Dr. Mary and the entire staff at Dr. Pamela Edwards Family Dentistry are fantastic. Anytime visitors to our area need an emergency dentist visit, I recommend them and they always come through. Just yesterday, I had a major tooth ache and they worked me in immediately. Problem solved and feeling great! Thanks Dr. Mary!", "pics": null, "resp": {"time": 1579282665103, "text": "Thank you Taylor for the awesome google review of us here at Dr. Pamela Edwards Dentistry and so happy you're feeling better!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113756297757993465324", "name": "Derek", "time": 1564083825401, "rating": 5.0, "text": "The absolute most reliable, friendly, and efficient dentist and staff you’ll not just find in Gulf Shores, but in Alabama. Period.\n\nDoctor Mary, Kat, Brian (and the entire team) fixed my teeth and made my cosmetic experience actually enjoyable. They also made me feel great about myself, so I can’t thank them enough. The best in the biz.", "pics": null, "resp": {"time": 1570642800180, "text": "Thank you, we look forward to seeing you again."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116416420091017153685", "name": "Tamoya Thompson", "time": 1556166077902, "rating": 5.0, "text": "If I could rate their office more than a 5 star, I absolutely would. I had a cleaning done and 2 fillings last week, and it was such a great experience. Nobody describes having to get a filling as a great experience, but from the minute you are greeted upon entrance right through the dental process was just absolutely great service right through. I would recommend here to anyone. Both Dr. Edwards's are amazing and their wonderful staff. I have more dental work to get done and I don't  plan on going anywhere else but here!! Thank you guys a million times!!", "pics": null, "resp": {"time": 1579542479274, "text": "Thank you, hope to see you soon here at Dr. Pamela Edwards Dentistry ."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "112813787796334531770", "name": "Carol Fountain", "time": 1565885351442, "rating": 5.0, "text": "It was last Friday I saw Dr Mary Edwards. I was in a lot of pain from a problem tooth and my regular dentist was not open on Friday..Dr Edwards was a God-send to me. I was able to get in to see her right away and she and her staff were able to determine my problem, refer me to specialist , and give me an antibiotic prescription to get me by until I could be seen by my regular dentist in 4 days. Her office is warm and welcoming and I would switch dentists if my insurance would let me. Cannot say enough good things about the whole experience.", "pics": null, "resp": {"time": 1568991596358, "text": "Thank you for your kind words of us here at Dr. Pamela Edwards Dentistry ."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "103708118828479758694", "name": "Betty Kelley", "time": 1563901149341, "rating": 5.0, "text": "Came to Gulf Shores for family vacation.  First family drama was my bridge falling out.\nI also have a terrible fear of dentists.  Thank goodness for Dr. Edwards.  They had me fixed by 10 am Monday morning.  They could not have nicer, more professional and caring.  I wish she was in my hometown. Dr. Edwards and her staff are the best!", "pics": null, "resp": {"time": 1570642825128, "text": "Thank you so much, we are here if you need us again at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "112331878771149906292", "name": "Dana Given", "time": 1559321962602, "rating": 5.0, "text": "Just came from my first visit at Dr. Edwards office. Everyone was great; from the initial appointment phone call two days ago;  to check in today (even when there was a glitch with my insurance); to X-rays, teeth cleaning, and follow up with Dr. Edwards.\n\nVery professional and friendly staff; respectful with the glitch - which got resolved while I was in the dentist chair; gentle and thorough dental care.\n\nIt’s always scary trying to find a new dentist when you relocate - but I can highly recommend this office - whose entire staff obviously cares about their patients.", "pics": null, "resp": {"time": 1579542437948, "text": "Thank you for your kind words."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "100799285567448739885", "name": "Kathlene Smith", "time": 1581034357734, "rating": 5.0, "text": "If you need an emergency crown replacement as I did,  this is the place to go! this is a family strong dental business and they treated us like family as well!  Thank you for your excellent service and care!", "pics": null, "resp": {"time": 1581094469685, "text": "Thank you so much Kathlene!  You are part of the Edwards Family now and we hope y'all have a wonderful trip!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "112502927984971047551", "name": "Judi Farmer", "time": 1579744758829, "rating": 5.0, "text": "I’m from out of town and went in for emergency help. Dr. Mary treated me and she is awesome! She diagnosed a cracked tooth and treated me on the spot. Dr. Mary and her staff were super caring. They even gave me a piece of king cake and a box of valentine chocolates when I left. What a super family team!", "pics": null, "resp": {"time": 1581104311858, "text": "Judi, we so appreciate the kind review of us here at Dr. Pamela Edwards Dentistry !  You are part of the Edwards Family:)"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116210909819071282399", "name": "Edward Williams", "time": 1572025582948, "rating": 5.0, "text": "I was on vacation with my family when I chipped a tooth. Started thinking of a good story to tell my friends about how it happened. My wife said to call around to see if anyone could fix it. Dr. Edwards and her staff fit me in that day! Prices were fair and the doctor was fantastic. I was walking out smiling. Would recommend to anyone needing emergency or cosmetic treatment!", "pics": null, "resp": {"time": 1572371809219, "text": "Dear Edward,\n\nWe are so happy we were able to help you in your time of need!  It was a pleasure to meet you and  your family.  We hope the rest of your vacation was wonderful and please stop by to say hello to us here at Dr. Pamela Edwards Dentistry whenever you are back in the area!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113246964317659973791", "name": "Sarah Halford", "time": 1560547509963, "rating": 5.0, "text": "We are visiting the area and my husband was incorrectly diagnosed by the minor med clinic after a week and 2 visits.  Dr Mary and her staff were able to see him right away, discover the real problem and get him on the road to recovery. The whole staff were knowledgeable and very caring. We will highly recommend their office to others.", "pics": null, "resp": {"time": 1570642888506, "text": "Thank you for your kind words of us here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "109949541769968411010", "name": "Jash Yotes", "time": 1566483429411, "rating": 5.0, "text": "The Edwards run a fantastic dental practice - whether it's locals or out-of-towners with dental emergencies.\n\nPamela and Mary so thoughtful, intelligent, and excellent at making patients feel welcome & cared for.\n\nThey're great with locals, (I'm one, ha!) but they've really distinguished themselves in what they're willing to do to accommodate all the visitors that we have in town with their dental emergencies. (And are the FIRST to tell folks on the phone that they need to go elsewhere [like the emergency room] if the problem sounds like a medical priority.)\n\nAnyone on the fence should feel excellent about trusting the Edwards. They're a great, skilled, family run practice that are going to look out for their patients' best interest first.\n\nLove you guys!", "pics": null, "resp": {"time": 1570642742910, "text": "Thank you for your kind words."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "115758883812390407827", "name": "Kinsley Lively", "time": 1547500839208, "rating": 5.0, "text": "Such a wonderful experience!! I’m usually a little nervous about dentist appointments but the staff here was so welcoming and friendly. Dr. Edwards, the younger one, was so knowledgeable about my concerns (wisdom teeth coming in) and Star did a phenomenal job cleaning my teeth!! Pearly whites for the win! 😁", "pics": null, "resp": {"time": 1570643006975, "text": "Thank you, hope to see you again here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "102840717140429100097", "name": "Mike M", "time": 1583351300294, "rating": 5.0, "text": "I like to just say this is the best and most friendly dentist 🦷 office around\nI just had work done and very professional\nPeople 5 stars if I could give 10 stars I would\nHighly recommended !!\nThey have a 24 hour emergency service if needed\nSincerely\nMike", "pics": null, "resp": {"time": 1583433890734, "text": "Dear Mike, Thank you so much for the kind review!  We look forward to seeing you again!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107506529350621767347", "name": "Vincent Odom", "time": 1547489411482, "rating": 5.0, "text": "This office was great.  They worked with my crazy schedule to get me seen and their rates were very reasonable.  On top of that, their staff was very personable and polite.  I definitely recommend this dental office.", "pics": null, "resp": {"time": 1570643070313, "text": "Thank you, let us know if you need our service again here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106146631471297159856", "name": "kristin kilborn", "time": 1564673475009, "rating": 5.0, "text": "Wonderful and friendly staff. Just moved to the area and I have found my dentist. I must say I was a little nervous and they put my mind at ease!!", "pics": null, "resp": {"time": 1568991711857, "text": "Thank you Kristin for the awesome review of us here at Dr. Pamela Edwards Dentistry and please let us know if you need anything!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107391584301156112087", "name": "Kirk Flowers", "time": 1549489402148, "rating": 5.0, "text": "Had a tooth that my dentist at home had been monitoring for the last few check ups. In the first week of my winter vacation, it broke off. Got an appointment the next day with Dr Edwards and 7 days later, she installed a crown. It feels great. Highly recommended.", "pics": null, "resp": {"time": 1579550598188, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry . We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113231605562396826844", "name": "Rachel Pody", "time": 1455584228722, "rating": 5.0, "text": "A great lady dentist that is caring, fun, and funny. I was very happy with my visit. Dr. Mary Edwards  was extremely professional, skilled and friendly. The office was very clean, modern, and at the same time felt like a home; which is a huge plus. On my first visit which was an emergency I could tell that the staff cared and I wasn't just another patient but a human being that was in pain, and they empathized with me and wanted to help me(Very different than one of my visits to a different dentist in town). They even took the time to make small talk with me. Every visit since then has been great. Strongly recommend!", "pics": null, "resp": {"time": 1570645491473, "text": "Thank you for the lovely google review Rachel of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "114746271337438963775", "name": "onakay", "time": 1601649567672, "rating": 5.0, "text": "Amazing service! So family friendly, patient, and genuine. I was unable to get work done due to the fact that they don't accept Medicaid, but their excellent service honestly made up for it! When I get official dental health coverage, I will certainly be returning 💕💕", "pics": null, "resp": {"time": 1568991555736, "text": "Thank you! Can't wait to see you again here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "102810553941394763010", "name": "Thomas Francis", "time": 1484763295785, "rating": 5.0, "text": "Great experience! I am a snowbird who broke/cracked two molars with very old large fillings. I was able to get a same day appointment with Dr Edwards. She conducted a thorough examination and we had a frank discussion about courses of action. I chose to have two crowns. Within a week I had two new crowns. Dr Edwards and her staff were polite, professional, and extremely competent. I would and have recommend Dr Edwards.", "pics": null, "resp": {"time": 1570645249743, "text": "Thank you for the lovely google review Mr. Francis of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106546813873245049936", "name": "Whitney Day", "time": 1564512015041, "rating": 5.0, "text": "This will definitely be my go to dentist from now on! I had an awful toothache and they got me right in and the very next week got me in for a cleaning! The staff is so sweet and personable and made me feel completely at ease!", "pics": null, "resp": {"time": 1568991689381, "text": "Thank you and thank you for the referral to us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "103001090234035149826", "name": "Jennifer Farris", "time": 1528394883792, "rating": 5.0, "text": "Amazing staff and wonderful doctor. Was there on vacation and I had recently had a root canal done at home before going on vacation. I had extreme pain for the last few days of my trip.  I called to see if they could work me in, they got me in immediately.  Turned out the molar behind the tooth I had the root canal in was cracked.  Since I was leaving the next day it would be nearly impossible to fix the tooth, since I needed it crowned.  They took care of me the best they could and sent their findings to my dentist back home.  I would highly recommend this practice!!!  Thank you so much Dr. Edwards!!!", "pics": null, "resp": {"time": 1530627451922, "text": "Thank you Jennifer for the review of us here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107663042073113765837", "name": "Aaron Frazier", "time": 1562095413632, "rating": 5.0, "text": "On vacation and dental emergency day one. We called Dr Edwards office and they worked us in as if we were regular patients. They saved the rest  of ourvacation once we realized an abscess tooth causing the issue! Thank you so much!", "pics": null, "resp": {"time": 1570642846819, "text": "Thank you so much, we are here if you need us again at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "111682194518139708362", "name": "Holly Howell", "time": 1546546251928, "rating": 5.0, "text": "What a wonderful staff!  Professional, courteous and were very understanding to my fear of the dentist.  The work  I have had done on my teeth has been phenomenal.  I recommend Dr Edwards to everyone.", "pics": null, "resp": {"time": 1570643086676, "text": "Thank you for he kind review of us here at Dr. Pamela Edwards Dentistry , you're so kind."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "110524401480000987542", "name": "Betty Myrick", "time": 1539562408157, "rating": 5.0, "text": "I can't say enough about this Dentist.  Dr. Mary Edwards is awesome, as well as her staff!!!!! I broke a tooth in half with exposed nerves while vacationing over Fall break.  I am so thankful God led me to this team!  I have a fear of dentists from childhood and an even bigger fear of needles.  They got me right in as were were being evacuated from hurricane Michael!  The staff treated me with \"kid\" gloves and pampered me.  Dr. Edwards made sure I would experience no pain and for that I was very Thankful!!!!!  The secretary helped my husband book a hotel as I was being treated.   I just can't say enough about this team!  Thank you all so much!!!!!!", "pics": null, "resp": {"time": 1570645105223, "text": "Thank you for the lovely google review Betty of us here at Dr. Pamela Edwards Dentistry !"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "111256309448252486632", "name": "Allayna Duffy", "time": 1533051576558, "rating": 5.0, "text": "I've never left a review before, but this dentist truly deserves one! I was only in Gulf Shores for summer classes and planned to leave back for fall semester in four days when I had chipped my tooth and they scheduled me in immediately, did a check up and fill in the same day! The staff was incredibly friendly and as a young adult, going to a doctor for the first time alone, they made me feel so comfortable and welcome! The next morning I even received a phone call from the dentist to see how I was feeling. Absolutely amazing!", "pics": null, "resp": {"time": 1534254417384, "text": "Thank you so much for coming in. We are always here at Dr. Pamela Edwards Dentistry if you need us. Good luck with college."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "102843748980058396942", "name": "Local Guy", "time": 1564608015682, "rating": 1.0, "text": "Go somewhere else where the doctor actually has time speak with you and look at your teeth. Receptionist was very nice. No communication . Already booking appointments elsewhere in Foley. Wasn't happy they wrote me painkiller script to try and  get me out the door. Not happy at all about experience.", "pics": null, "resp": {"time": 1572371641041, "text": "Hi Local Guy,\n\nThanks for your feedback however, we are unable to verify any of the information you have described nor can we locate your name in our patient database.\n\nWe take customer feedback very seriously so if you could contact our manager directly at mrstoothdoc@hotmail.com so we can resolve this issue as a matter of urgency.\n\nMany thanks"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "115395488226022210295", "name": "courtney west", "time": 1525798909756, "rating": 5.0, "text": "I am on vacation and had a tooth break and needed emergency care. Not only did they get me in immediately but they were so fast, efficient and  friendly! Highly recommend going here if you live here or if you need taken care of while visiting. This office is the best they really made this stressful time so much easier! Thank you", "pics": null, "resp": {"time": 1579550547641, "text": "Thanks for the five-star review. We really appreciate your support here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106287081837833042887", "name": "Ricardo Medina", "time": 1509380545187, "rating": 5.0, "text": "Came here to fix a broken tooth and they did the best work. The staff was great from the first time that I called till the end. Got everything done quick and perfect. They also followed up to see how I was doing after my visits. Highly recommended.", "pics": null, "resp": {"time": 1579550565006, "text": "Thanks for the five-star review. We really appreciate your support here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "105605307915686949092", "name": "Bill Long", "time": 1500482604594, "rating": 5.0, "text": "Warm, knowledgeable and committed staff. Have had two crowns installed and both fit perfectly.  As painless an experience as I've had in dentistry with the exception of a standard cleaning procedure.   I highly recommend Dr. Mary Edwards and their staff.", "pics": null, "resp": {"time": 1570645269880, "text": "Thank you for the lovely google review Mr. Long of us here at Dr. Pamela Edwards Dentistry !"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "103877882513155005099", "name": "Lynn Adcock", "time": 1453244459082, "rating": 5.0, "text": "Everyone including the dentist was very friendly and nice. I didn't have to wait long for an appointment and I  had NO PAIN ! The dentist was very gentle and considerate. She stopped several times to check on my comfort and even got me a pillow for my neck. I highly recommend this office!", "pics": null, "resp": {"time": 1570645550373, "text": "Thank you for the lovely google review Lynn of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106849969081385456762", "name": "Glenn Terry", "time": 1436532624211, "rating": 5.0, "text": "I am from Rome, Ga and was on vacation in Gulf Shores when I had a tooth brake, I needed emergency care because I was in pain with an exposed nerve.\nI found Dr. Edwards on line and she had great reviews, we'll let me say that one call was all it took, they were very professional and was very nice, worked me in that same day only a few hours from the time I called, the service was outstanding and the whole family was very nice and caring upon my arrival at the office.\nThe work performed was great and I never had any pain after I left there, I would recommend them to anyone, local or not local, very nice and professional.\nThank you,\nGlenn Terry.", "pics": null, "resp": {"time": 1570645665077, "text": "Thank you for the lovely google review Glenn of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107365884695369524413", "name": "Dan S", "time": 1537371541629, "rating": 5.0, "text": "Took excellent care of me. Well I'm not a big fan of dentists I would not hesitate to go back. The entire staff is very friendly and they do their absolute best to cause as little pain as possible.", "pics": null, "resp": {"time": 1579550540442, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry. We really appreciate your support Dan!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106634638639337074851", "name": "Katie Avant", "time": 1388433713402, "rating": 5.0, "text": "Excellent! My insurance is canceling on the first of January and they did everything they could to help me out. The staff and Doctors are very personable and sweet! I got two fillings replaced and even though that's not the most fun, they made it the best dental experience I have ever had. This office gets an A++++!!", "pics": null, "resp": {"time": 1570645705380, "text": "Thank you for the kind google review Katie of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "108275317998463856781", "name": "Matthew Borcicky", "time": 1548473769466, "rating": 5.0, "text": "Dr. Edwards is the best dentist I've ever been to! The atmosphere is friendly and welcoming, and the procedures are always painless. I love taking my family to see them!", "pics": null, "resp": {"time": 1581367730205, "text": "We love seeing your family too Matthew! Thank you so much for the kind words of us here at Dr. Pamela Edwards Dentistry ."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "112670273135760649696", "name": "elizabeth lovely", "time": 1543860003345, "rating": 5.0, "text": "I broke a tooth Friday morning and this office saw me immediately when everyone else was closed.  I was so thankful with how they took excellent care of me and caused no pain!  I am coming back to this office every time I visit the beach!  Thank goodness for this kind, family practice!", "pics": null, "resp": {"time": 1570645161821, "text": "Thank you for the lovely google review Elizabeth of us here at Dr. Pamela Edwards Dentistry !"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "110813089560274456272", "name": "Frank Repici", "time": 1559853915050, "rating": 5.0, "text": "GREAT EXPERIENCE, WONDERFULL PEOPLE. MADE THE CAP PROCESS SIMPLE. AND EASY😎. HIGHLY RECOMMEND!", "pics": null, "resp": {"time": 1570642935359, "text": "Thank you, we look forward to seeing you again."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "114041529128426039923", "name": "Mikaela Boecher", "time": 1592505850486, "rating": 5.0, "text": "Super nice mother and daughter dentists, clean and professional", "pics": null, "resp": {"time": 1592587028504, "text": "Thank you so much Mikaela for the review of us here at Dr. Pamela Edwards Dentistry!  Good luck at UAB:)  I am rooting for you."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "115302337944439457380", "name": "John Armstead", "time": 1452888635530, "rating": 5.0, "text": "This doctor is great. I was here on vacation when I had a dental emergency. She came in on a weekend to see me when I was in pain. I had a regular dentist that was a little rough so when I went to Dr. Edwards and had a completely pain free experience I was astonished. I live 3 hours away but told the doctors that I would be willing to drive to gulf shores to let them work on me and my children and I meant it too.", "pics": null, "resp": {"time": 1570645646270, "text": "Thank you for the king google review John of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113286803057517752340", "name": "Diana Morris", "time": 1499962533477, "rating": 5.0, "text": "Everyone is so nice here! Definitely the best dentist I have been to. I never felt any pain she makes sure you're comfortable no matter what. I will recommend her to anyone.", "pics": null, "resp": {"time": 1579550616900, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry. We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "100665867793084492383", "name": "Rebecca Lewis", "time": 1530969637713, "rating": 5.0, "text": "Went to the dentist because of incredible pain while on vacation. They were all extremely friendly and knowledgeable. I was in and out within 20 minutes! The Walgreens next door is also great and filled my prescription in less than 15 minutes!", "pics": null, "resp": {"time": 1534254488353, "text": "Thank you, we are here at Dr. Pamela Edwards Dentistry if need us again."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "100671737347539473209", "name": "Anne Long", "time": 1500388798840, "rating": 5.0, "text": "While vacationing in Orange Beach, my tooth became infected.   The staff was VERY friendly and welcoming and got me in that day.   I hate any dentist (a fear I have never overcome),  BUT THIS DENTIST eased my fear and took extra care with me.   She will be my Dentist when we are down in Orange Beach.   Loved this group.", "pics": null, "resp": {"time": 1570645529853, "text": "Thank you for the lovely google review Anne of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "109147102187331731102", "name": "Bryan Long", "time": 1500320072657, "rating": 5.0, "text": "Dr. Edwards was absolutely amazing! By far the friendliest dental staff I have ever experienced. I had to go in for a tooth ache that had been bothering me for some time. I figured a filling would be needed. Dr. Edwards has some type of vodoo magic because I barely felt a thing from beginning to the end of the procedure. I was always apprehensive about dental visits before, but now that is a thing of the past. Highly, highly recommend this dentist. I went in for an emergency but now she is my full time dentist!", "pics": null, "resp": {"time": 1581367803523, "text": "Thank you very much for the great review Bryan of us here at Dr. Pamela Edwards Dentistry! We look forward to seeing you again!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113637804941923623218", "name": "Seth Barber", "time": 1559921919592, "rating": 5.0, "text": "I was on vacation and had a horrible tooth ache. These folks were awesome!! Got me in on a Friday and got me fixed up! If I lived here this would be where I would go for sure!", "pics": null, "resp": {"time": 1570642913007, "text": "Thank you from us here at Dr. Pamela Edwards Dentistry , hope your vacation got better."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116019838234051497205", "name": "CSR FocusPG", "time": 1426000011185, "rating": 5.0, "text": "I was on vacation for 2 weeks in Gulf Shores. My tooth cracked and became infected. Dr. Edwards and the whole office went above and beyond any expectations. They were welcoming, friendly and even came in to the office on Fat Tuesday! I will I could stay so Dr Pamela could be my regular dentist.\nJennifer H", "pics": null, "resp": {"time": 1570645747859, "text": "Thank you for the kind google review of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "105003835494003205732", "name": "Lori Gail", "time": 1502557285905, "rating": 5.0, "text": "Best dental experience ever!!! Fractured tooth while vacationing in Gulf Shores; called the office and was seen within 30 minutes. Excellent customer service... Highly recommend!", "pics": null, "resp": {"time": 1579550611885, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry. We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116022116947548857573", "name": "Barbara Jajeh", "time": 1556812807558, "rating": 5.0, "text": "Dr. Pamela and Dr. Mary are excellent dentists and very kind and personable.  Highly recommended!", "pics": null, "resp": {"time": 1570642958866, "text": "Thank you, can't wait to see your family again."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "105348439554099959258", "name": "Amanda Feightner", "time": 1509126927752, "rating": 5.0, "text": "Dr. Edwards & her staff has saved the day for me more than one time. She fixed a chipped tooth for me almost 5 years ago. My 3 year old son head butted me this morning & I lost the cap she was able to put on for me. Without second thought, I knew who to call, picked up the phone & was seen the same day. The hour drive was worth it to be seen by her & her staff again. I had my smile back! They are amazing people & have truly been a God send for me!", "pics": null, "resp": {"time": 1570645597923, "text": "Thank you for the lovely google review Amanda of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106172651254545741635", "name": "Kalli Jones", "time": 1573150172121, "rating": 5.0, "text": "Wonderful staff. Extremely pleasant and thorough with their work.", "pics": null, "resp": {"time": 1579536865811, "text": "Thank you Kalli for the kind review of us here at Dr. Pamela Edwards Dentistry !"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116446985620026407336", "name": "Rebecca Heberlein", "time": 1510849115602, "rating": 5.0, "text": "The best dentist team and staff in the world. I'm not a great fan of any dentist, but this team makes it a pleasant painless experience from the time you walk thru the door. Thank you Mary, Pam, Blanche and Rick for all that you do. You guys rock.", "pics": null, "resp": {"time": 1579550558830, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry . We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "110795808685314459747", "name": "Digital Rep", "time": 1453683834038, "rating": 5.0, "text": "Dr. Edwards and staff are caring and experienced.  They not only provide excellent care but also take the time to listen and educate patients so they can have a lifetime of healthy gums and teeth and bright smiles.", "pics": null, "resp": {"time": 1499718006492, "text": "Thanks for your wonderful review. We didn't know who you were for a long time because you posted this using your business profile. Thanks for taking the time to review us here at Dr. Pamela Edwards Dentistry and we hope you are well. See you soon."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "112155380831031213821", "name": "William Laster", "time": 1434312840923, "rating": 5.0, "text": "This Lady is your Dentist! Don't waste anytime looking further..she is the best,and I am from North Alabama......They got me in quickly.. yes I was a first time patient.\nI did not feel a thing..including the shot!  IF I lived around gulf shores....she would be my full time dentist as well as my children's dentist.  I can not express in this short review how impressed I was,and still am with their price,caring,and character... I was on vacation and split a tooth very very badly...they got me in that day at 3:00 pm,and I can not recommend they anymore highly except to say....... I would trust them with my children. Thank you .......and be ready to laugh........they really are that good!", "pics": null, "resp": {"time": 1570645810571, "text": "Thank you for the lovely google review William of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "109855080648331156257", "name": "Becky Johns", "time": 1549642742937, "rating": 5.0, "text": "My husband broke a tooth and had to have a crown while on vacation.  The doctor was great!  He had no pain, got him in quick, and would highly recommend them!!", "pics": null, "resp": {"time": 1579550462659, "text": "Thanks for the five-star review here at Dr. Pamela Edwards Dentistry. We really appreciate your support and hope your hubby is well!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "104290513577770829920", "name": "John Belcher", "time": 1570637377914, "rating": 5.0, "text": "Dr Mary is great good work priced for  working people Thank you Dr Mary and staff", "pics": null, "resp": {"time": 1570642723461, "text": "Thank you so much for the kind review of us here at Dr. Pamela Edwards Dentistry , see you soon."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "100171073440124599621", "name": "phyllis rominger", "time": 1518628229657, "rating": 5.0, "text": "As a visitor from another state, I received excellent professional service from Dr. Edwards.  She diagnosed my problem and referred me to another excellent dentist and then made a follow call to be sure my service was complete.", "pics": null, "resp": {"time": 1520436884349, "text": "Thank you for the lovely google review Phyllis of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107786617233010683761", "name": "Putty cat Russell", "time": 1533778976464, "rating": 5.0, "text": "Thank u Dr.Pamela Edwards for Free cleaning I really appreciate it.great staff and friendly!!God bless u!!", "pics": null, "resp": {"time": 1570645304475, "text": "We are happy we could help you Genevieve!  Thank you for the 5 star review of us here at Dr. Pamela Edwards Dentistry."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113011113528964565912", "name": "Lynn Griffin", "time": 1452881470876, "rating": 5.0, "text": "Great experience, Dr. Edwards was friendly and painless. State of the Art equipment. Clean Facilities and the entire staff was friendly and helpful.", "pics": null, "resp": {"time": 1570645872807, "text": "Thank you for the lovely google review Lynn of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "118030771240754741508", "name": "Tech Solution LLC (Computer Repair)", "time": 1537372094779, "rating": 5.0, "text": "Dr. Edwards took excellent care of me. If you need a dentist go see her!", "pics": null, "resp": {"time": 1579550519800, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry . We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116101865696505048747", "name": "Gail Bearden", "time": 1530559059283, "rating": 5.0, "text": "I had a cracked tooth while on vacation and they fixed me right up! Excellent service!", "pics": null, "resp": {"time": 1530627493797, "text": "Thank you for the lovely google review Gail of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "107717940225874397486", "name": "Chris Gilliam", "time": 1488485151463, "rating": 5.0, "text": "By far the best dentist around. Quality work, absolutely painless, and a very pleasant atmosphere.", "pics": null, "resp": {"time": 1499717707547, "text": "Thank you for the lovely google review Chris of us here at Dr. Pamela Edwards Dentistry! By far one of our best patients:)  Come see us soon!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "117677418675643040105", "name": "Stephenie Spenillo", "time": 1507905752993, "rating": 5.0, "text": "Went in for an emergency, excellent office. They took care of my issue and the staff was great.", "pics": null, "resp": {"time": 1520436958450, "text": "Thank you for the lovely google review Stephenie of us here at Dr. Pamela Edwards Dentistry !"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "116425894313170900552", "name": "Lynn Weeks", "time": 1452891378001, "rating": 5.0, "text": "Super friendly dentists. The mother and daughter are so nice and never cause any pain.", "pics": null, "resp": {"time": 1579550622547, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry. We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106657314274104188917", "name": "Stephanie Young", "time": 1507916640195, "rating": 5.0, "text": "Great place, great staff! Highly recommend.", "pics": null, "resp": {"time": 1570645898402, "text": "Thank you for the kind google review Stephanie of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "113873816865766773712", "name": "Jess", "time": 1468857811049, "rating": 5.0, "text": "Great dentists that are friendly, funny, and pain free. Fantastic service.", "pics": null, "resp": {"time": 1499718164595, "text": "Thank you Jess for thinking of us here at Dr. Pamela Edwards Dentistry! We look forward to seeing you again soon!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "111930261457433727455", "name": "Cathy Moncrief", "time": 1521217057566, "rating": 5.0, "text": "Congratulations on 2017 Small Business Award!! Ya’ll are the best!", "pics": null, "resp": {"time": 1581367776972, "text": "Thank you! We are very proud to be recognized by our locals here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "106612825567847028973", "name": "Ginny Outwin", "time": 1508341360354, "rating": 5.0, "text": "The staff is great and Dr Edwards is very knowledgeable and friendly.", "pics": null, "resp": {"time": 1579550605508, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry. We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "111906869220548782648", "name": "Brooke Berg", "time": 1539974569737, "rating": 5.0, "text": "In town for vacation and they got me in without an appointment. Friendly/professional staff.", "pics": null, "resp": {"time": 1579550512412, "text": "Thanks for the five-star review of us here at Dr. Pamela Edwards Dentistry . We really appreciate your support."}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "108804546674703857072", "name": "Robbin Voinche", "time": 1554169731831, "rating": 5.0, "text": "Love, love, love! The best!", "pics": null, "resp": {"time": 1570642989087, "text": "You made it easy to be the best. Thank you from all of us here at Dr. Pamela Edwards Dentistry!"}, "gmap_id": "0x889a04cfa3aba8ab:0xe5288d93a394fd5d"}
{"user_id": "111991454689379995689", "name": "Nichole Riddle", "time": 1618333314560, "rating": 1.0, "text": "My son will never be going back there. My appointment was for 7:45 we arrived at 7:30, just for the doors not to be open. They didn’t even open them till 8 no apology for the wait just plain rudeness. Then when I told them no I’m not consenting to them using restraints or nitrous oxide to help restrain doctor Jones tried to convince me otherwise. I had to explain that I am a medical professional myself and that I fully understand the forms as she tried to continue to speak to me as if I’m dumb. I will never be going back.", "pics": null, "resp": {"time": 1618344319823, "text": "We're very sorry that you had a negative experience. We strive to provide the best service possible. We would like to know more. Please fill out the form at the link below, and we will reach out to you as soon as we can: https://dashboard.reviewpush.com/35919843/i"}, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114854943619064031874", "name": "Brandon Cutsumbis", "time": 1620422510396, "rating": 1.0, "text": "This place is absolutely terrible the supervisor of the entire building is a complete lunatic and breathes down the necks of the staff, staff is rude, undereducated, they have dirt and crud on their tools. The absolute perfect example for the worst pediatric office in the tri state area. I would’ve voted 0 stars if I could", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111731736771892191321", "name": "Dione Smith", "time": 1593035370772, "rating": 1.0, "text": "I understand with everything that is going on we have to be safely. My daughter appointment and we got their at 12:45pm for our appointment that was at 1 pm . I was told to call when we got there but no one every answered the phone. I had to get the attention to the young lady that was coming from another vehicle to let her know we have an appointment. She also, had an appointment on the dentist side and the orthodontist . Now the orthodontist got her back  and then bought her back out for the dentist side. My daughter had to get a chip tooth that they had to filled. It took them from 130 to almost 245 for the dentist side to finish. I feel that they over booked their appointments . We didn’t get finish until 330pm. I thing they need to reorganized the why they make appointments doing the COVID 19 so parents aren’t sitting in a car for 2 or 3 hrs . Better planning. I was very disappointment today!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112031252969201704531", "name": "Oneofakind", "time": 1617721739155, "rating": 1.0, "text": "They take forever to come to the phone and when they do they leave you on hold for an very long time. I literally been trying to get in touch with someone for over an month to get my son braces. Very disappointed.", "pics": null, "resp": {"time": 1617813203144, "text": "We are truly saddened that your experience was not as great as we would have liked. We take bad reviews very seriously, and we would like to ensure that your experience is better next time."}, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115095228277514118392", "name": "Shondrea Cook", "time": 1579025658351, "rating": 3.0, "text": "Love Vital Smiles for being multi-kid friendly,  however,  I feel the check in system could improve. Maybe off an online portal to update information prior to visit instead of having to physically fill out paper work. For the parent with multiples, this would alleviate unwanted anxiety of the child not being called back at their scheduled appointment time. It would also help, if all children of the same family finish together. Other than that, service is great, staff is friendly and knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113878028817622775921", "name": "The Fellowship Through Jesus Ministry Williams", "time": 1581736877827, "rating": 4.0, "text": "The visit was comforting for my granddaughter and my wife was very pleased with the staff and the dentist. We would recommend this office without Hesitation. The staff has changed for the better. Good change.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110635610764420232580", "name": "Nyeada Patterson", "time": 1596056872577, "rating": 4.0, "text": "Great service doing COVID-19. Keeping everyone safe", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107182978291619974932", "name": "Lydia Stinson", "time": 1582163026782, "rating": 5.0, "text": "Vital Smiles is a great place to take your children for their dental needs. The place has warm and caring associates from the front desk to the back dental room. Always a great experience. Lily", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115484923146803974984", "name": "S. W", "time": 1563808481583, "rating": 5.0, "text": "Front office staff is nice, and that's important as they are the 1st people you see when you arrive. Doctors and Hygienist are extremely patient and nice.\n\nMy son no cavities 6 years.\nThey are a trustworthy company/place. I appreciate their work.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104128519667643563681", "name": "Melody R", "time": 1552934090761, "rating": 1.0, "text": "We used to like going here, never really had any problems. Of course there has always been a nice wait time but we decided to continue going there despite waiting a while to be seen. But this last time really made us change our mind. We have 3 children to receive updates on as they are being seen. As I sit down near my youngest daughter, and reach for my phone her hygienist tells me I have to leave because I have my phone out. I'm shocked, because I had just taken my phone out to return a text from my husband  as he wanted to know how the appointments were going. She would not continue my daughter's appointment until she escorted me out of the area. Now I completely understand businesses asking for cell phones to be turned on silent but to tell me that I cannot use my phone AT ALL is completely absurd! I have taken time from my off day to come to this business to bring my children and you're telling me I have to go to a consultation room just to use my phone.  I have already driven 30 minutes to come from my side of town, I  could have easily changed them to a Dr less than 5 minutes from home and had little to no wait time. In addition to all this, I'm trying to get information on my best friend who is in the ICU and no one knows what's going on because I can't use my phone to get the messages. Someone must have notified the manager because she came to talk, but she wanted to do it around my children and that was not going to happen. She should have asked to step away and then we could have talked.......... In other news, we won't be going  back.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110659202793566669262", "name": "Elena Sudduth", "time": 1582313912670, "rating": 5.0, "text": "Very organized, clean and friendly environment! I look forward to making Vital Smiles my preferred dentist for my son for years to come!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101854822018324683668", "name": "Octavia Messer", "time": 1547154849064, "rating": 5.0, "text": "Vital Smiles as ALWAYS, gave my daughter a very pleasant visit. The staff is always friendly and accommodating to both the children and parents! We enjoy coming and she always looks forward to her next visit! Thanks Vital 😃 Smile😍", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113079701428309101661", "name": "Jameccia Thompson", "time": 1547638853860, "rating": 5.0, "text": "The doctor and staff was amazing. By far the best dental office for kids i have seen.. Dr Jones was very gentle and kept my kids calm during the process. Definitely would recommend!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116373809041551339998", "name": "Alexis Brooks", "time": 1564499393496, "rating": 5.0, "text": "Very professional. Made my daughter very comfortable with the cleaning. Nice environment with friendly staff. Glad I chose the midfield location.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104545164349274798395", "name": "Alycia Ray", "time": 1555012252765, "rating": 5.0, "text": "My daughter was seen for her yearly checkup. The paperwork we had to complete was straightforward. Our wait time was surprisingly short. Once we got to the back, the dentists got right to it and we were done in about 15mins. I thought my daughter was going to miss that school day, but I was still able to take her with an excuse!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102147244575906686410", "name": "Tamara MT", "time": 1584374230074, "rating": 4.0, "text": "Been sending my patients here for years.\nT. Thomas NP. Usually very polite.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105795306603782845162", "name": "Angela Peoples", "time": 1579095121616, "rating": 5.0, "text": "First time taking my grandson and the environment and the friendly staff my experience was wonderful I was totally pleased", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101512517056440308933", "name": "NeAndra Giles", "time": 1562440104081, "rating": 5.0, "text": "This was my first time visiting and everyone was nice and friendly. My kids were seen in a timely manner. My kids will be returning.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100406476905447644891", "name": "Ms Gaines", "time": 1599151171705, "rating": 1.0, "text": "Behind on schedule, my child's appt was set for 10:30am as I type this review it is now 11:37am. I am calling the office for am ETA and no one is answering. Been holding the line for 10mins now. This is completely unacceptable!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112596160996400642781", "name": "Charlandria Wilson", "time": 1567699354146, "rating": 5.0, "text": "Made my 17 month old feel very comfortable and did a thorough job cleaning his teeth and getting him acclimated with coming to see the dentist. Thanks 😊", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114969718299092895590", "name": "Faith-Ann Threadford", "time": 1564521998359, "rating": 5.0, "text": "They're so good with my children. They like coming to see the dentist. Thank you!! 😊 ♥️", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116837074461348098984", "name": "Alexis Hunter", "time": 1575557797758, "rating": 5.0, "text": "I absolutely love Midfield Vital Smiles. The staff is always friendly, helpful, and professional.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101468329083468827372", "name": "Lady K", "time": 1509056801823, "rating": 5.0, "text": "This is a wonderful office for children and teenagers as well. The office staff in courteous and very kid friendly. My four year old twins left feeling like they had made new friends.  My teenager also spoke very highly of his dentist Dr Jones. He had to have 6 fillings and she made it tolerable. She was very nice and took interest in his school life and goals. \"She was great\" he said.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103987943617299034157", "name": "Latoya Coffman", "time": 1572535026329, "rating": 5.0, "text": "Have great friendly staff. I give them a 5 star", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109708734535871319361", "name": "Davita Jefferson King", "time": 1553554106995, "rating": 5.0, "text": "Great customer service. Dr. Jones does exceptional work...very good at engaging children through the dental examine process. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114769595646887398746", "name": "Sharita Hagler", "time": 1573517362739, "rating": 5.0, "text": "The staff is friendly, and professional. My daughter has been coming here about 11yrs and we love it!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113708932200295209495", "name": "Andrea Stevens", "time": 1510277973646, "rating": 5.0, "text": "I've been bringing my children for 10+ years.  The staff has always been friendly and have taken good care of my family.  The orthodontist, Dr. Phillip, and his team have been just as wonderful.  I've enjoyed this company and look forward to our future.  Special thanks to Connie Love, Dr. Jones, and Dr. Smiley.  The staff has always been so polite and informative to my kids.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102449616388326932857", "name": "TaNecia Dudley", "time": 1566829290643, "rating": 1.0, "text": "Updating my previous from 5 stars to 1 star... Our very first visit was easy, friendly, and fast... Every visit after that has been very slow and it’s always some paperwork to be done... Appointment was at 8 and we were here at 7:31 to be exact and the still didn’t get her back until almost 9... We were the first ones here and they called so many children before her. We will not be back!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113566892989130590456", "name": "Juicy", "time": 1547488752441, "rating": 5.0, "text": "I love everything about Vital Smiles, their pleasant attitudes, clean facility, their level of patience and compassion are phenomenal. Their amazing. A nice family environment.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110536951002522579053", "name": "Terri Combs", "time": 1542689512676, "rating": 3.0, "text": "Appointment was scheduled 6 months in advance for 9:30a for 3 children ages 5, 3, & 2 years old.  It was 12:40 when we left.  Waited over 45 minutes in the back to be seen and it was extremely cold for me and the children.\nThankful, they were well behaved!  But, all children can become restless. Obviously and I realize you have a large clientele, however,  it could be that you are over booking appointments.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112209787677506809130", "name": "April Winston", "time": 1492688296926, "rating": 5.0, "text": "Great place to go for braces.  The staff are very friendly and professional. There's never a long waiting period. Usually in and out under 45 minutes. I was also pleased to find out that Dr. Phillips practiced from different locations. Therefore when we moved across town, we were still close proximity to his office. I would recommend Dr. Phillips to everyone in need of an orthodontist.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105185115299333611864", "name": "Otis Todd", "time": 1576616505795, "rating": 5.0, "text": "I really loved the patience and the expertice shown during my Grandsons' first real Dental Appointment.\nO.L. Todd", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106221012134658421854", "name": "Tranijah Hammond", "time": 1571757754617, "rating": 5.0, "text": "We love Vital Smiles , they are very patient with the kids.. They also call you to the back at your schedule time 😊", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110479092634964595138", "name": "Janice Moore", "time": 1553011302654, "rating": 1.0, "text": "Had a bad experience  today. I arrived early for appointment.  They took me 30minutes after my appointed time only when I ask when would I be  serviced.  If I hadn't said anything  I guess I would still be sitting there\n\nThis is the first time I have ever had a bad experiences with Vital Smiles.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112186862140273230158", "name": "Tish Dunklin", "time": 1554396594505, "rating": 4.0, "text": "The dental hygienist was friendly & informative. I would NOT recommend scheduling an afternoon appointment due to the high volume of patients during this visit. The wait was longer that he cleaning itself.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116378143303848872452", "name": "Chelsea Taylor", "time": 1589230512574, "rating": 4.0, "text": "Loved it more when Dr Jones was there.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117204212824450326904", "name": "Antonio Smith", "time": 1473879985488, "rating": 5.0, "text": "I always have a great time here, and they are literally the best dentists I've been to. They aren't like other dentist that do all that painful stuff, but depending what you get done is going to hurt anyways, so you just have to bare with it. However, they could use a bit more people to move the waiting list faster.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103812812719691265972", "name": "Karen Lazenby", "time": 1559263353643, "rating": 5.0, "text": "Can't beat this place! Professional, kind, and fast. Five stars all the way!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110731650010733915311", "name": "INDRA COLLINS", "time": 1569932199997, "rating": 5.0, "text": "Great and friendly staff and has very good patience with kids.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110107292383503994975", "name": "Kelly Jackson", "time": 1551135261439, "rating": 5.0, "text": "Great experience for my kid. Really glad we decided to come here. Mrs. Love is the greatest!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109699230734003473503", "name": "April Rain", "time": 1571200754099, "rating": 5.0, "text": "The doctors staff are very patient and courteous. I bring all eight of my children in at the same time for their check-ups. We are not there all day.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115462024751236959031", "name": "Norma Blair", "time": 1546274023473, "rating": 5.0, "text": "I love this place. Great place for kids to have dentistry work done. Friendly and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111754949148995216313", "name": "Danitra Whitaker", "time": 1565373461914, "rating": 5.0, "text": "Everyone was friendly and helpful and the office was very clean. We'll be back", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109332601726515902871", "name": "Lisa Dawkins", "time": 1451522359254, "rating": 5.0, "text": "AT FIRST THE STAFF WAS NOT FRIENDLY, THIS WAS SOME YRS. AGO, BUT AFTER NOT COMING 4 AWHILE DR.ROSE CALLED AND ASKED WHY?  ONCE I EXPLAIN THAT I DIDN'T LIKE THE WAY I WAS TREATED, HE WELCOME ME BACK AND SINCE THEN I NEVER HAD A PROBLEM AGAIN... STAFF IS MUCH MORE PROFESSIONAL AND THE WAIT IS MUCH SHORTER...", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111340372855181251243", "name": "Amber &Joi Ninji", "time": 1566340228256, "rating": 5.0, "text": "The experience  was great the staff was friendly , so patients with the kids , my kids love it!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112200870631758663489", "name": "Tamisha Walker", "time": 1592253264682, "rating": 1.0, "text": "The worst experience ever. Especially the front desk", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103104604168623188080", "name": "Rochelle Castillo", "time": 1452282581500, "rating": 5.0, "text": "Dr. Shuhal was great! My daughter usually has to be held down for dental procedures 😩 But it wasn't necessary this time! He was amazing with her! We will definitely request him every visit! He is very warm and caring! He put her completed at ease!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118210813876478774952", "name": "Shandrika Anderson", "time": 1554909466322, "rating": 4.0, "text": "I give 4 stars because I had to fill out new patient info after my son has been attending since he was a baby but the service was great", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118010438158513199365", "name": "Yolanda Williams", "time": 1553895197682, "rating": 5.0, "text": "Everyone was very courteous and friendly. They made a stressed and first time visit comfortable and reassuring.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101874212127178546612", "name": "LylasGirls Org", "time": 1530056482482, "rating": 5.0, "text": "This office offers the best dental care for kids that I've ever encountered. I always refer other parents to bring their kids here. The staff is definitely one of the most friendliest and professional in the community.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111112835447439252649", "name": "Sandra Rich", "time": 1469133499853, "rating": 5.0, "text": "Doctor was very engaging with my child. He made sure he explained what was going on with her, how I can prevent it and how to fix it. Everyone worked together very quickly to get us in and out. All staff made sure my child and I were ok and that we had a great experience. great place for kids of all ages.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116079638539692839011", "name": "Joy Brown", "time": 1563988764795, "rating": 4.0, "text": "To me vital Smiles is a great place for our children, very nice employee ,  very clean facility . The Dr. Today was excellent 👍👍👍👌 thanks vital Smiles", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107564682097913548073", "name": "Bresha Bee", "time": 1541004988131, "rating": 5.0, "text": "Everyone was very nice. It was my 23 months old first dental appointment and she cooperated the entire time; thanks to the sweet staff there.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100320617991394767539", "name": "NEPHETERIA HORN", "time": 1513756062963, "rating": 5.0, "text": "Awesome staff! They were very patient with my child! The environment was clean and service time was exceptional! Keep up the great work!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114860423903400993789", "name": "Ashlee Crenshaw", "time": 1562963320697, "rating": 5.0, "text": "These a some of the nicest pll i have ever met in my life.. My kids love going to the dentist and that's a first for any child ive met. Cameron T'Darius Tommy and Ca'Darius...", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118187951877492123468", "name": "Latricee Cam and mom", "time": 1557889217488, "rating": 1.0, "text": "My son had an appointment today . The second lady that we was seen by when we went to the back was not friendly and just honestly down right rude. I definitely will be looking for another dentist for my son.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115529278130138094810", "name": "DeAcqueline Wilson", "time": 1562618435250, "rating": 5.0, "text": "Mybdaughter had an apoointment for braces today! The Staff was friendly and inviting. The Dr was friendly and Professional.  I was leary at first but glad I came\n\nWe will be back!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109770825724956047607", "name": "Krystal Ormond", "time": 1558472051391, "rating": 5.0, "text": "Staff was very professional and great with my son we will be back very soon. Thanks very much for everyones time and services given today.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101132097279440870620", "name": "Laneki Hobbs", "time": 1573841493781, "rating": 1.0, "text": "Terrible, You all have too many patients scheduled at one time.  The wait time is ridiculous.  Not coming back", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111893280354305308235", "name": "Willie Andrews", "time": 1568768367334, "rating": 5.0, "text": "Great service and great experience every single visit", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102025103015564825454", "name": "D Smith", "time": 1572450203555, "rating": 5.0, "text": "Excellent customer service through out the building.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112070865149396482158", "name": "Serita Dawkins", "time": 1475856818720, "rating": 3.0, "text": "I thinkits great...but they are difficult when insurance is being renewed..i had two children of mine scheduled for an appointment..one of my kids was in the process of being renewed with same contract number. My other child was okay..they would not take my child who was being renewed..why would i have one of my children under insurance and not the other...and i asked the desk person if we can deal with payment later to have it forwarded to the insurance company...she just kept going back and forth. I appreciate the doctors services but the receptionists need work.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117074648988883315010", "name": "Jalisa Underwood", "time": 1571352984521, "rating": 5.0, "text": "Great atmosphere, friendly dental assistants and dental hygienist! They were very patient with my toddler", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117669144184966715971", "name": "Cedric Young", "time": 1553120496272, "rating": 5.0, "text": "The staff were very friendly and helpful and polite. Thanks vital Smiles", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116085678823874299385", "name": "queen aa'liyah jordan", "time": 1553807069540, "rating": 5.0, "text": "Very pleasant atmosphere v,ery pleasant employees great experience thank you!! Everyone there was very nice and pleasant.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118382066292380814669", "name": "Kateena Carpenter", "time": 1487628676143, "rating": 2.0, "text": "Normally we have a great experience but today my husband took our daughter for a regular cleaning and she was there 2 and 1/2 hours. They said the workers kept skipping over them and people that were seen after them were taken care of and left the office before them. I was apalled because they could have recognized them and let them know what was going on.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107641641966225344189", "name": "LaToya Drish", "time": 1539993780834, "rating": 5.0, "text": "We have been going here for 3 years and we have never had a bad experience! We appreciate everyone there for being so sweet!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115242496671775718560", "name": "Yoni Dortch-Sisney", "time": 1487816132493, "rating": 5.0, "text": "I brought my son Jayden last week and everyone was amazing. I brought my daughter in today 2/22/2017 and once again same thing everyone was so nice and courteous and amazing. I just enjoy everyone there. I am happy I decided on bringing my kids to Vital Smiles!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113434438468919783138", "name": "Jessica McCullough", "time": 1446577688443, "rating": 5.0, "text": "This was my 3 yr old sons first time going to the dentist. It was a pleasant experience.  It went a lot better then I expected. I think it had a lot to do with the awesome staff.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111647297595267044220", "name": "LaToya Elms", "time": 1457116054172, "rating": 5.0, "text": "I've never had a problem with any work they've done on my child. I'd recommend them to anyone. Everyone that works there is very kind, understanding and patient. Great team at the midfield office.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100219380471332178852", "name": "Latrisa Irby", "time": 1448422445882, "rating": 5.0, "text": "The staff in the back where my son received care were very professional and nice. I will recommend this location to other parents. I love the dentist that took care of my son. We look forward to coming back soon. Have a bless evening and Happy Thanksgiving.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111494689261970973928", "name": "Ashaley Jackson", "time": 1493406825694, "rating": 5.0, "text": "Very great environment! Wonderful, friendly staff! I would definitely recommend this location! Quick, detailed service, just the way I like it!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108471581639099979701", "name": "Cedeidra Smith", "time": 1487800052835, "rating": 5.0, "text": "The staff was extremely friendly , professional and experienced! And most of all they were patient with my kids. I'll definitely go back/recommend this dentist office.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104151674977798047818", "name": "Nisha Foster", "time": 1561999503797, "rating": 5.0, "text": "My three sons had a wonderful  experience.  I would  recommend  Vital Smiles to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112869480666425354045", "name": "Feona Harris", "time": 1578523233749, "rating": 5.0, "text": "I had a great experience today, the people that work for Vital Smiles are wonderful. Thank you for your kindness. Have a great day.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107059388154406631200", "name": "Shay Johnson", "time": 1547847938812, "rating": 5.0, "text": "Vital Smiles was a wonderful experience for my kids for a first time visit they were nice and friendly I would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101418880885982287602", "name": "shakiliah sutton", "time": 1545080947106, "rating": 3.0, "text": "Pretty good for the midfield location everything was nice even when my kids threw up on the nurse 🤦🏽‍♀️🥰 I love how they clean and get cativities in the same day 🤩🥳", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114597383450673856480", "name": "Cheryl Holcombe", "time": 1508993850032, "rating": 5.0, "text": "The workers are so friendly and caring!! Even the doctor's give you their full attention and my children are getting good instructions on how to brush and floss properly.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111872685612337066059", "name": "hashika oden", "time": 1579745732491, "rating": 2.0, "text": "Unusual wait time.longer then usual...", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116942407079691832108", "name": "Krystal Busby", "time": 1563398088868, "rating": 5.0, "text": "Excellent service great staff no wait for appointments", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104281084585883258626", "name": "Shenika Simpson", "time": 1456011908377, "rating": 5.0, "text": "My four year old son had an appointment at 9:30a.m. We were called to the back almost immediately. My son was getting two crowns and was not the best patient. The assistants and the dentists were very patient and remained professional throughout the procedure. The process was quick and successful.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109601700436798317553", "name": "barbara lee", "time": 1532543148396, "rating": 5.0, "text": "The staff, show professionalism and help the kids so much in understanding the importance of dental care brushing and flossing. Vital Smiles is Great, my grand kids and myself love them.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116368763509082065141", "name": "Patreice Williams", "time": 1546452081111, "rating": 5.0, "text": "Love love , they take care of your kids teeth, they're very friendly and willing to do whats best for yoi child", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113131757144125322657", "name": "Melissa Stephenson", "time": 1580242995844, "rating": 5.0, "text": "My son has been going here for 5 years. The staff is friendly and helps with any concerns I my have. My son has anxieties about going to the dentist. They always make him feel better about being there.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112215675543947955726", "name": "Keauna Guyton", "time": 1477411907467, "rating": 5.0, "text": "Very good with the kids and their service is Great! This has been my kids dentist office since 2007. Good Job vital smiles staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109789170800469381568", "name": "Janneka Cowen", "time": 1549413800282, "rating": 4.0, "text": "The staff is excellent. A little bit of await once you get to the back.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112725411977602695337", "name": "Andrea Thedford", "time": 1582683675133, "rating": 5.0, "text": "My, experience was a thumbs up.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100334601939654867900", "name": "Loyalty IzMe", "time": 1534857729586, "rating": 5.0, "text": "I would reccommend vital smiles for any child , they have been taking care of my son's teeth since he had them and they are the best . There office is always clean , the staff always nice and friendly , they have activities for the kids while waiting . I just love them", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114630919705465814450", "name": "vee Harrell", "time": 1473870000091, "rating": 5.0, "text": "It was my 1yr old 1st dental appointment & it went great. The facility was clean & professional, and everybody was nice. Dr. Jones was the best.!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106587090164625018006", "name": "Erica Armstrong", "time": 1569467229727, "rating": 4.0, "text": "Amazing, the staff there is very friendly. They make the kids feel comfortable by encouraging them and explaining each step.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115076958512475912834", "name": "Brandi Ryans", "time": 1454973713138, "rating": 5.0, "text": "I think Dr. Jones did an outstanding job. Her Patience with my child especially stood out. I would defiantley recommend her and the vital smiles crew to others.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107736896771057410021", "name": "Velma Booker", "time": 1542900112681, "rating": 5.0, "text": "Staff was friendly and helpful and didn't have to wait long for my baby to be seen.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117366733177054408067", "name": "Ashlai P", "time": 1504410440999, "rating": 5.0, "text": "Great place!! They have worked on being a little faster, I really appreciate it with impatient kids. The whole staff is friendly and sweet.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104030866024894000045", "name": "Latoya Collier", "time": 1532099374529, "rating": 5.0, "text": "I brought my son to his first visit!It was a pleasure!The staff as a whole was very pleasant and concerned of our needs and questions!The best around! Roderick and Latoya Davidson", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106516100902185219386", "name": "Reginald Spencer (Reggie)", "time": 1484677922645, "rating": 5.0, "text": "Loved it all the doctors were wonderful and very patience with me and my four kids. Their dental technicians were very child oriented and friendly. If you need a new dental home you should give them a try.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109358619732290800271", "name": "Gabriel Creighton", "time": 1565648042145, "rating": 5.0, "text": "The best one the only one I go to", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109603587365242862226", "name": "DarNisha Snow", "time": 1450739025701, "rating": 5.0, "text": "They are very loving and friendly.  My kids have been going here for over 10 years I don't know of a better dentist for children in Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109490051381805502891", "name": "Felicia Gosha", "time": 1562607815622, "rating": 2.0, "text": "Son got braces today and they already popped off, went back they said it's ok leave off till the next visit in 8weeks. $4880 and not out on correctly", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111872685612337066059", "name": "hashika oden", "time": 1579745732491, "rating": 2.0, "text": "Unusual wait time.longer then usual...", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112165034286188100515", "name": "Sonia Hawkins", "time": 1539359362148, "rating": 5.0, "text": "Fast Courteous Service, kept me in the loop about  follow up visits and referrals.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100234578782026728870", "name": "Angela Burnett", "time": 1476120420767, "rating": 5.0, "text": "It's Always a pleasure bringing my daughter to Vital Smile in Midfield,  it's always clean & the staff is very professional, and they see the patients in a timely manner.  Thank you for serving our children in our community. ..", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103953629518312549880", "name": "Daqieva Davis", "time": 1550142037158, "rating": 5.0, "text": "They were awesome and my daughter loved them.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113131757144125322657", "name": "Melissa Stephenson", "time": 1580242995844, "rating": 5.0, "text": "My son has been going here for 5 years. The staff is friendly and helps with any concerns I my have. My son has anxieties about going to the dentist. They always make him feel better about being there.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112725411977602695337", "name": "Andrea Thedford", "time": 1582683675133, "rating": 5.0, "text": "My, experience was a thumbs up.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106587090164625018006", "name": "Erica Armstrong", "time": 1569467229727, "rating": 4.0, "text": "Amazing, the staff there is very friendly. They make the kids feel comfortable by encouraging them and explaining each step.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109358619732290800271", "name": "Gabriel Creighton", "time": 1565648042145, "rating": 5.0, "text": "The best one the only one I go to", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106482985169727399156", "name": "Crystal Green", "time": 1509127371085, "rating": 5.0, "text": "Friendly staff. My kids love Vital Smiles. Would recommended anyone to this dentistry..", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112358287599945294476", "name": "Sharika Taylor", "time": 1462982599062, "rating": 5.0, "text": "They are always smiling and very helpful. I love bringing my kids here. They are very patient and kind.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111022384558456991686", "name": "Derek Simons", "time": 1455215318069, "rating": 5.0, "text": "Very friendly. It took a while but the care my son received was wonderful! We love Dr.Jones shes a doll", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101282505481888802508", "name": "Kenneth Crenshaw", "time": 1581439418632, "rating": 5.0, "text": "Great place to go, very professional!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111035382530309044302", "name": "Jacqueline Flowers", "time": 1562367117068, "rating": 5.0, "text": "My son loves vital smiles", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109940470211813216884", "name": "Antronique Price", "time": 1485312617391, "rating": 5.0, "text": "We are very pleased with the services that we receive from Vital Smiles. The staff is helpful, dedicated, and nice. Thanks Vital Smile", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114047744658383398691", "name": "Crystal Roberson", "time": 1453792437924, "rating": 5.0, "text": "Great people. Got us in and out in a timely manner. Got a same day appointment. Good with kids all around", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114860770396130982256", "name": "Bernice Holman", "time": 1558572986857, "rating": 5.0, "text": "on time and very polite veey professional", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100718977720948491531", "name": "Sherrie Chaney", "time": 1567549755755, "rating": 5.0, "text": "Everyone was so nice and professional.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106482985169727399156", "name": "Crystal Green", "time": 1509127371085, "rating": 5.0, "text": "Friendly staff. My kids love Vital Smiles. Would recommended anyone to this dentistry..", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112358287599945294476", "name": "Sharika Taylor", "time": 1462982599062, "rating": 5.0, "text": "They are always smiling and very helpful. I love bringing my kids here. They are very patient and kind.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110077934448881371813", "name": "Sheena Campbell", "time": 1507931122818, "rating": 2.0, "text": "My kids have been going there since they were 1 year of age. Every 6mos they keep having me fill out paper when I say NOTHING has changed, their primary dr in which they see once a year doesn’t give me any paperwork when I say nothing has changed. I set the appointment for 8 am we were there till 11am...they didn’t called to the back till 930am. As a single parent who put in time to take off to get my kids to the and head to work they are highly inconsiderate of our time. I am truly thinking about changing dentist. I hate them!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113250311120989934613", "name": "lois davis", "time": 1449524527030, "rating": 5.0, "text": "The staff from the front to the back are very friendly and show genuine concern, my girls love coming there. Thanks for your professionalism.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101307664934415632570", "name": "Deleon Marie", "time": 1555600683644, "rating": 5.0, "text": "Wonderful establishment! Very patient and professional!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105194022033071807048", "name": "Tiffany Bryant", "time": 1470668788630, "rating": 4.0, "text": "They were very timely and got me out as quick as they could!  We will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109959001081122814655", "name": "Ashlai Parker", "time": 1546291518498, "rating": 5.0, "text": "Nice friendly staff. Love new updated look!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103252351582451747419", "name": "Mary Garrett", "time": 1547763317810, "rating": 5.0, "text": "My experience has  always been exceptional.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102336175780716518029", "name": "Diedra Moore", "time": 1456337589083, "rating": 5.0, "text": "Dr. Jones is amazing as well as the staff. My son had a procedure done with no problems.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108875998117524485958", "name": "Sabrina Dansby", "time": 1468451132780, "rating": 3.0, "text": "The people there are always great mostly\nBut it's just always a wait there I feel like they book everyone around the same time and it takes so long when u get to the back even when u have really small kids", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100268724546332465859", "name": "Raquel Lewis", "time": 1476918256243, "rating": 4.0, "text": "Took my son to the dentist today.   Got there at 3:20 pm out by 4:07 pm. Service was pleasant and out quicker than usual and the real bonus was no cavities! See you in 6 months!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106119958714924211940", "name": "Benita Brown", "time": 1466112178310, "rating": 5.0, "text": "Our experience was excellent, will be back for sure, Dr. Jones and her assistants were very polite and professional. Thanks so much.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106793328708507563653", "name": "Angela Taylor", "time": 1487283290667, "rating": 5.0, "text": "Y'all was good at the job. I never had a problem with y'all keeping up my teeth care.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105085250532808155455", "name": "Michelle Martin", "time": 1455038246207, "rating": 5.0, "text": "Loved it Connie was the best she helped me get all the right appointments i needed thank you so much for working on getting us in when we didn't have a appointment", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117539415929470554648", "name": "Alicia Davis", "time": 1462205059899, "rating": 5.0, "text": "The Davis boy's and I love the service. The worker's at Vital Smiles are friendly, fast and curtious. We love them.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110061661572166988534", "name": "Elizabeth Allen", "time": 1544051070933, "rating": 5.0, "text": "Great experience!! In and out quickly..", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118427279266134313777", "name": "Sabrina Engram", "time": 1484189846770, "rating": 4.0, "text": "Always friendly and courteous. My child has becoming here for about 8 years and have not had any problems.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108266278059756258681", "name": "Margo Jemison", "time": 1471840153846, "rating": 5.0, "text": "They was real nice to me an the lady did not hurt me. She put a band on my arm an it said no cavities an she said i could go to the toy chest an get me another toy i love to go to my dentist. Thanks Tatianna Jemison.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103937425499478708932", "name": "Evette Sims", "time": 1493333380033, "rating": 5.0, "text": "It's a get clean friendly and professional office and the staff is so great with child's I love this place and my son does to they dentist work is awesome!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102252846415822767122", "name": "Katrina Colston", "time": 1498000536892, "rating": 5.0, "text": "Dr. Smiley was very friendly & professional & the rest of the stafff were thorough  about answering my questions in great detail.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112744443126968174031", "name": "Kinsley Marie", "time": 1511290991664, "rating": 5.0, "text": "They were great with my daughter and I would highly recommend Vital smiles", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110705637427206106918", "name": "Lisha Gosha", "time": 1550592332088, "rating": 5.0, "text": "Great fast and friendly staff excellent with the kids", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117265293253426949030", "name": "Felicia Peterson", "time": 1497625794566, "rating": 5.0, "text": "I love how I can bring all 5 of my kids at once & not have to wait hours to leave.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109254037879674960154", "name": "Carmanita Monroe", "time": 1533132690452, "rating": 5.0, "text": "The staff and doctors are always nice and extremely helpful.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106406876769463925579", "name": "Keyia B", "time": 1497640053982, "rating": 5.0, "text": "Very nice place to go too been going for 9 years now staff and doctors are very sweet and friendly but over the years the wait time has gotten out of hand thats one thing that needs to be corrected", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104912750438572965216", "name": "ToMichael Abernathy", "time": 1484942311273, "rating": 4.0, "text": "They are good and very courteous. Just request gas if you know your child isn't favorable of the dentist.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103267185044598786716", "name": "Darnisha Wallace", "time": 1472060445398, "rating": 5.0, "text": "Gr8 dental care home for kids, my son has been goin there since he was 2, he's 9 nd my daughter since her 1st dental cleaning, she's 3. The staff is very kind and Dr. Jones is one of the best.!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111720114752816319588", "name": "Gejuana Safford", "time": 1468253319843, "rating": 5.0, "text": "I was very glad that you guys helped me with extracting my to and cleaning my teeth for all of these years . I will be back again soon . Thanks vital smile now I hAve a vital smile because you ☺☺☺", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106580682070017817812", "name": "Angelnetta Freeman", "time": 1460655690560, "rating": 4.0, "text": "My kids love to come. We've gotten good care and experiences there at Vital Smiles Midfield.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102196847640324712706", "name": "Brittney Alexander", "time": 1497380606356, "rating": 5.0, "text": "It's a great place for kids. ZARIAH LOVE ITS", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105419772996249312319", "name": "Alberta Diaz", "time": 1498680746803, "rating": 5.0, "text": "They are very polite and professional the service is fest.they have amazing Kids entertainment while we are waiting", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117975785130054330005", "name": "KDutchess Hair", "time": 1551827867530, "rating": 5.0, "text": "It was an awesome experience. Everyone's very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110165374772692839314", "name": "Carla Gray", "time": 1461768566122, "rating": 5.0, "text": "My visit with vital smiles was pleasant as always.  The staff is friendly courtious and always greet you with a smile.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115679363123562663200", "name": "b spfbgjLederrious Chandler", "time": 1453720238778, "rating": 5.0, "text": "They where fast and friendly, they also gave me coupouns.. My 3 year old looks forward to going back", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110995885992171686852", "name": "Michelle Outsey", "time": 1447103664033, "rating": 4.0, "text": "My kids been coming to vital smiles since it was tooth zone. It's a very professional place and my kids are always taking care of.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111678042398156433593", "name": "Shameika Ford", "time": 1495130709390, "rating": 5.0, "text": "The visit we had was great everyone was very nice and professional ...great job!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109053841262641786531", "name": "Shevetta Elder", "time": 1461683555632, "rating": 5.0, "text": "The staff was friendly, arrived early worked is in quickly, keep my son clam during the whole process, showed him every tools that was going to be used, Dr. Zang has been great with my son for 3 years now.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109268729182254782164", "name": "Candice Wilson", "time": 1466549164086, "rating": 5.0, "text": "I took my son there for a little work and the staff is very friendly and service was handled very professionally and quickly........I am very pleased with Vital Smiles!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115896084200048849037", "name": "Carolyn Rowser", "time": 1490842509014, "rating": 5.0, "text": "Fast, professional, efficient and quick. They'll take care of basically all your needs in one or two visits.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103367672848051595526", "name": "Cassandra DeGraffenried", "time": 1463606835261, "rating": 4.0, "text": "Ortho appointment went pretty smooth.  We were in and out in a reasonable time.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100880258388670867668", "name": "Valencia Anderson", "time": 1457761176221, "rating": 5.0, "text": "Great staff, experience was excellent and they truly have patience and care for their patients.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108697249381475941019", "name": "Shandria Maxwell Wilkerson", "time": 1492626041443, "rating": 5.0, "text": "Vital Smiles Ortho is very great place and I would recommend it to others for orthodontics care.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117263882652570062631", "name": "Audrey Payne", "time": 1460150023873, "rating": 5.0, "text": "It was a wonderful experience all the stuff was nice, patient, and friendly.I would most definitely recommend vital smile in midfield", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108387113186510906915", "name": "Jean Turner", "time": 1464962424571, "rating": 5.0, "text": "Staff was very patient and courteous, as always. I Love vital smiles.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102871024687358105773", "name": "Leslie Donaldson", "time": 1502463762948, "rating": 1.0, "text": "My child been waiting in a chair over an hour then when I said something the lady who finally came to clean her teeth was rude. Some of the people are nice but the rest forget it", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118356001785327667488", "name": "Donna Steverson", "time": 1468278043505, "rating": 5.0, "text": "I like the atmosphere the staff was nice and friendly and they really did a 👍 job", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109741154189437748546", "name": "Kenya Spencer", "time": 1470086067164, "rating": 5.0, "text": "Dr. Rose is the best and all the lady's there are very good with the kids.😍😍😍", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102774014506601113361", "name": "Shamika Phillips", "time": 1537362639151, "rating": 4.0, "text": "The staff was great with the kids but the wait time was a little to long.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105838077577225627562", "name": "Cheryl Jackson", "time": 1489750393532, "rating": 5.0, "text": "Very pleasant, helpful and clean. Got the work done and we were out of there.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117768088165090097944", "name": "BARBARA THOMAS", "time": 1463702689775, "rating": 5.0, "text": "A great place to take your kids! I love this place it Rocks!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108142415936397826837", "name": "Jessica Gober", "time": 1480374221587, "rating": 5.0, "text": "Very timely and excellent service! My child was very nervous and they made him to comfortable!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102690295236540143234", "name": "Susan Smith", "time": 1450891052330, "rating": 1.0, "text": "Absolute worst experience. Front desk was rude, and not helpful at all. If you are looking for a dentist, LOOK SOMEWHERE ELSE. Maybe next time they will try to be a little more polite to patients.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107960191634189620864", "name": "Nikki Hall", "time": 1551201271826, "rating": 3.0, "text": "We've got here at 925am appointment is 930, still waiting to be called at 1025 went to the desk, receptionist states there about to call him, ok now it's 11am one hour in a half later, receptionist goes to the back again!!! Then you call us!! RIDICULOUS!!! Stopoverbooking!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106861942519081668496", "name": "Tammy Laury", "time": 1533309532906, "rating": 5.0, "text": "Wonderful customer service and a nice facility", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111772673876443129303", "name": "Dermeatria Gaston", "time": 1497990377141, "rating": 5.0, "text": "Such a friendly atmosphere! The people there are awesome!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118378416390513630036", "name": "Briana Chantel", "time": 1448906779230, "rating": 5.0, "text": "Getting teeth cleaned, thy feel so much better.No cavity's,thank God!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117465543472291806419", "name": "Nikki Pleaz", "time": 1496655456415, "rating": 5.0, "text": "Fast and friendly helped all of my children same day first dentist office my son didnt get upset or nervous they are very caring and good at their job love them", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114891940124634338244", "name": "Catarina Brown", "time": 1508361668068, "rating": 5.0, "text": "Great experience very nice people will refer others.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116399080722805476375", "name": "Queen Nephateria", "time": 1506973958700, "rating": 5.0, "text": "I love the atmosphere that is so kid friendly and the dental assistants are so friendly!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104210453442621697520", "name": "Tiffany Floyd", "time": 1464797540696, "rating": 5.0, "text": "Nice Friendly Setting. Show Kids A Lot Of Love", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101111536821485837387", "name": "J Northington", "time": 1494254048324, "rating": 5.0, "text": "The staff were very friendly and the Dentist was gentle and quick!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113791979666645996788", "name": "Sonya Wells", "time": 1476713650410, "rating": 5.0, "text": "Friendly and Fast we enjoy the service you all give everytime", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117166046715961719332", "name": "Nathaniel Barnes", "time": 1565026202080, "rating": 5.0, "text": "She made the process great", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109129899147032011129", "name": "Shana Roper", "time": 1476248166692, "rating": 4.0, "text": "Service is quick and kid friendly and they perform routines in an orderly fashion!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118235037373463795842", "name": "Anquanette Colvin", "time": 1562114306585, "rating": 5.0, "text": "Excellent staff great attitudes 😀😀😀", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118118402781763313212", "name": "Dion Damari", "time": 1576864155592, "rating": 3.0, "text": "Waiting time was extremely long", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100204110029119140822", "name": "Lakandis Littleton", "time": 1469120852894, "rating": 5.0, "text": "There are very professional and my teeth look great y'all are the best", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116350362070792790618", "name": "Sharon Davis", "time": 1461841610514, "rating": 5.0, "text": "I love it all.Everyone is helpful and professional. Both of my children are patients.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101059018413303394717", "name": "Lula Bunny", "time": 1466723236222, "rating": 5.0, "text": "I found my experience to be very careful comfortable, safe a.d amusing", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110696965603337352990", "name": "Tyran Walton", "time": 1454098153063, "rating": 5.0, "text": "Loved it...The whole staff treated us great.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110709575497503788667", "name": "Diann Whitt", "time": 1566324230798, "rating": 5.0, "text": "Everyone was so professional and nice!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100494187572170577344", "name": "Naomi Underwood", "time": 1455153492765, "rating": 5.0, "text": "Very welcoming the people are very nice and they are very very good with kids 😍😍😍😘", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100795424433366643801", "name": "Valerie Williams", "time": 1446563101225, "rating": 5.0, "text": "Very friendly people clean environment and good service!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113159612858929311802", "name": "Marcia Reynolds", "time": 1582318589161, "rating": 4.0, "text": "The wait time were very long.today", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109506226825668112889", "name": "Gwenicka Woods", "time": 1473737706616, "rating": 4.0, "text": "Every experience has been Great in the past 2yrs .", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116230961174188533227", "name": "shanquitas", "time": 1493077294061, "rating": 5.0, "text": "Great service. Patient & polite", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101841438038895540352", "name": "latorya nixon", "time": 1537973130260, "rating": 5.0, "text": "My daughter's first dentist appt!!! She was scared, but the dentist was nice and very patient with her!!! Thanks", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110707304885123995352", "name": "Timenya Edwards", "time": 1473957147845, "rating": 5.0, "text": "Quality and friendly Service every tim I go!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109543573846276515020", "name": "Gordon", "time": 1498667714589, "rating": 5.0, "text": "The employees here made me feel safe", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103108439424558000618", "name": "Taressa Clark", "time": 1481380350729, "rating": 5.0, "text": "My son's always have a great experience", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117854625668954321765", "name": "adria lambright", "time": 1464272313629, "rating": 5.0, "text": "We love Vital Smiles! Everyone is so friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101647299805987728455", "name": "Quasheda Lomax", "time": 1557351620141, "rating": 5.0, "text": "Really  nice and friendly staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108770936407793927792", "name": "Khloe Owens", "time": 1568931338229, "rating": 5.0, "text": "Thank u for everything", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "105936839441519134701", "name": "LifeArtistry By T.R.Jones", "time": 1508279921219, "rating": 5.0, "text": "Always Friendly and Wonderful  With My Girls!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108105894431059071016", "name": "Susie Williams", "time": 1470495113513, "rating": 4.0, "text": "I'm please with the service everyone was nice.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106374244990611319791", "name": "April Turner", "time": 1447371631302, "rating": 5.0, "text": "They are always the best at this location. My kids actually look forward to their visits.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112798394455596745722", "name": "Wilma cooper", "time": 1458230657589, "rating": 5.0, "text": "I took three kids today. Very satisfied with the cleanliness, professionals, and overall atmosphere.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109776222473642228645", "name": "Patricia Wilson", "time": 1485213163623, "rating": 3.0, "text": "Very nice atmosphere,and very polite employees.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102168548652199541089", "name": "Wendell Coleman", "time": 1483654529966, "rating": 5.0, "text": "The staff here is awesome! They are highly recommended!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115896079183062710791", "name": "Joneese Taylor", "time": 1498676573220, "rating": 5.0, "text": "Nice place to take your kids.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109980405863930589682", "name": "shashi Lee", "time": 1495750042728, "rating": 5.0, "text": "It was great every one was so helpful", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109094709361705908612", "name": "Mona Rae", "time": 1478568099211, "rating": 5.0, "text": "The staff is always friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101270523801750686967", "name": "Precious Woods", "time": 1550515226628, "rating": 1.0, "text": "It was ok i felt like it took to long though", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111709879133583834715", "name": "Stephanie Mccants", "time": 1467242007428, "rating": 5.0, "text": "Very nice staff working 👍😆", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117242933059511461378", "name": "Shirley Flowers", "time": 1496254211924, "rating": 5.0, "text": "Wesley like the room atmosphere. He does better  in a room by himself.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117603169483479763718", "name": "Crk Cali", "time": 1562605500520, "rating": 5.0, "text": "Everything was Excellent!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111395634649246460242", "name": "Cecily Bush", "time": 1456955583495, "rating": 5.0, "text": "Wonderful! And awesome staff 🤗", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113627581729304364289", "name": "Sharon Kennedy", "time": 1453419625892, "rating": 1.0, "text": "Bad customer service my grandson waited for 2 hours. Terrible experience and still wasn't seen.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103190359215733277340", "name": "brittney reynolds", "time": 1470438484886, "rating": 5.0, "text": "Very friendly staff and very welcoming", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102780605966034001192", "name": "Kischia Fletcher", "time": 1451163227760, "rating": 5.0, "text": "Very professional  and gentle with the kids.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106710394159252081403", "name": "Tia Sanders", "time": 1479917085488, "rating": 5.0, "text": "They're great with kids!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106559254276616683387", "name": "Michelle Ford", "time": 1551375811124, "rating": 4.0, "text": "Bern bringing my kids here for years", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101338961708320396236", "name": "Delis Mitchell", "time": 1480962272236, "rating": 5.0, "text": "Very nice, professional, and fast service.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101338961708320396236", "name": "Delis Mitchell", "time": 1480962272236, "rating": 5.0, "text": "Very nice, professional, and fast service.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108173090024338916345", "name": "Velma Byrd", "time": 1476310258683, "rating": 5.0, "text": "Fast service, excellent work, friendly staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106559254276616683387", "name": "Michelle Ford", "time": 1551375811124, "rating": 4.0, "text": "Bern bringing my kids here for years", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111748976539320057619", "name": "Cheretta Wellman", "time": 1509225675445, "rating": 5.0, "text": "Today was a great day at Vital Smiles I was in and out!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116611509461665701279", "name": "William Nix", "time": 1498586334590, "rating": 5.0, "text": "Great attitudes and friendly people", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "107588229334072347784", "name": "Kimberly7vpb Tate", "time": 1545060945807, "rating": 5.0, "text": "Great experience as usual", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118037449242504067972", "name": "Nikki Battle", "time": 1486012345425, "rating": 4.0, "text": "Dr. Jones is a good dentist.I dislike the wait time only complaint!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109447503661835105605", "name": "Justin Ortiz", "time": 1570487286540, "rating": 4.0, "text": "Clean and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102683798991747060493", "name": "SM FM", "time": 1554697389874, "rating": 4.0, "text": "They are great with kids!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100683755456194009985", "name": "diamond robinson", "time": 1484153178980, "rating": 5.0, "text": "I was treated very good", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "117196580373728670459", "name": "4creativekid s", "time": 1524250141598, "rating": 1.0, "text": "Worst experience", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116380821792668630457", "name": "Pretti 10", "time": 1501175168936, "rating": 5.0, "text": "Friendly and caring staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "114834829714126796275", "name": "LaTasha Thomas", "time": 1496265898603, "rating": 5.0, "text": "Professional and courteous!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106804325559644364904", "name": "bernice holman", "time": 1495907253651, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112823162904607524562", "name": "striker xx", "time": 1493741020922, "rating": 5.0, "text": "Excellent work and atmosphere", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111748976539320057619", "name": "Cheretta Wellman", "time": 1509225675445, "rating": 5.0, "text": "Today was a great day at Vital Smiles I was in and out!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118037449242504067972", "name": "Nikki Battle", "time": 1486012345425, "rating": 4.0, "text": "Dr. Jones is a good dentist.I dislike the wait time only complaint!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100411662051197235790", "name": "Marquita Rashid", "time": 1485990634724, "rating": 5.0, "text": "Very Comfortable, and nice people..............", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111715812467936890733", "name": "Rolanda Stallworth", "time": 1485207186098, "rating": 5.0, "text": "Fast and friendly....!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112141459979454683340", "name": "Carl Thomas", "time": 1501791079666, "rating": 5.0, "text": "Excellent work and services", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "100683755456194009985", "name": "diamond robinson", "time": 1484153178980, "rating": 5.0, "text": "I was treated very good", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106684986142052267371", "name": "Jayla Morgan", "time": 1500571279328, "rating": 4.0, "text": "Over all my experience was ok", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115567125579499617821", "name": "RICKIEYA MCCONNICO", "time": 1481221375581, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101338961708320396236", "name": "Delis Mitchell", "time": 1480962272236, "rating": 5.0, "text": "Very nice, professional, and fast service.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106710394159252081403", "name": "Tia Sanders", "time": 1479917085488, "rating": 5.0, "text": "They're great with kids!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "108173090024338916345", "name": "Velma Byrd", "time": 1476310258683, "rating": 5.0, "text": "Fast service, excellent work, friendly staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111224886194539411159", "name": "Alisa Dunklin", "time": 1475781518450, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109315776310827852910", "name": "Adrena Broadnax", "time": 1475545578084, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115111879185938787878", "name": "Brittney Young", "time": 1475021724125, "rating": 5.0, "text": "Found out everything that was wrong with my son's teeth and fixed it", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104484940809119525984", "name": "Shaky Campbell", "time": 1474326201206, "rating": 5.0, "text": "Great,as always", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109013937624199484146", "name": "Faledia Parker", "time": 1473260581459, "rating": 5.0, "text": "A great one", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102717922417949659955", "name": "Nicole Howard", "time": 1471720428866, "rating": 5.0, "text": "Kids loved it nice staffs", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "101807929674099535904", "name": "Kime Burgin", "time": 1470082037986, "rating": 2.0, "text": "The only thing that is bad, is the wait time, its like a two hours just for cleaning.smh that's to long.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "103289383462536749153", "name": "Tracie Gray", "time": 1470081783637, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116724526846338911217", "name": "Briggette Eatman", "time": 1468966252961, "rating": 5.0, "text": "The clinic was clean . The staff was very professional  and kind to the children.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "116349618323869982160", "name": "calvin johnson", "time": 1466636777399, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109972575765588842791", "name": "Lakethia Ford", "time": 1466035408239, "rating": 5.0, "text": "Y'all are very awesome\nAndre", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106126942584040873687", "name": "Tameka Liddell", "time": 1481216664866, "rating": 5.0, "text": "The staff is fantastic", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102493437185609202049", "name": "Sherrell Thomas", "time": 1463691791304, "rating": 5.0, "text": "Fast, professional, friendly", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106649541303051921558", "name": "Janniece Beck", "time": 1477930172837, "rating": 5.0, "text": "Great atmosphere quick services", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "113088268063579428699", "name": "Candice White", "time": 1457645760048, "rating": 5.0, "text": "Great service, friendly smiles", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "104247023967638789756", "name": "justin Paul", "time": 1473978261502, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "110376891915035554501", "name": "Lakeysha Glover", "time": 1471561375415, "rating": 5.0, "text": "It was wonderful", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111078948389877330071", "name": "krystle wright", "time": 1468247244029, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112853233760926177753", "name": "Veronica Bell", "time": 1451399469630, "rating": 5.0, "text": "They are concerned about they patients", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102780605966034001192", "name": "Kischia Fletcher", "time": 1451163227760, "rating": 5.0, "text": "Very professional  and gentle with the kids.", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "115811366637115948461", "name": "Sandra Beckley", "time": 1446850840625, "rating": 4.0, "text": "The services", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "112178196255043824524", "name": "Kandyse MacLeod", "time": 1462897333772, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "109533630843421826427", "name": "K Holifield", "time": 1446042516553, "rating": 5.0, "text": "Fast, friendly service", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111425289608273480455", "name": "Marvin Johnson", "time": 1456441497450, "rating": 5.0, "text": "Great job", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "118078653807140595576", "name": "AL Johnson", "time": 1453738263352, "rating": 4.0, "text": "Service an employee courtesy's", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "111395634649246460242", "name": "Cecily Bush", "time": 1456955583495, "rating": 5.0, "text": "Wonderful! And awesome staff 🤗", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "106403610195823511640", "name": "Marllory N.J", "time": 1567635267979, "rating": 5.0, "text": "(Translated by Google) It is exactly, we really like this place!\n\n(Original)\nEs exactamente, nos gusta mucho este lugar!", "pics": null, "resp": null, "gmap_id": "0x8888e1dc936fa5b5:0x92ccf0ccb518dc57"}
{"user_id": "102783443452835790721", "name": "B A Buckland", "time": 1596750937699, "rating": 5.0, "text": "Very intelligent, thoughtful and caring. Congenial and authentic. Knows how to do his job. Would recommend him to anyone needing a peridontist or implants.", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "113707462642462225750", "name": "Antonio Md", "time": 1474376313336, "rating": 5.0, "text": "Really nice and friendly staff. Book ahead of time because appointments full quickly!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPw3tl2rRXxbWaJD6W86j_4ee8u-pbqshfCcZbi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkDoOSUGShUrTt-Qrm-A2n7phcsNc7NPOQiaA6=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "101289446035985518480", "name": "Ross Isbell", "time": 1595386259833, "rating": 5.0, "text": "Our practice often refers patients to Dr. Sims and team and they always are thankful for a great experience!", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "115971688142042335439", "name": "Carolyn Bryant", "time": 1553034281493, "rating": 5.0, "text": "My dentist sent me to Dr. Kevin Sims for dental implants. Dr. Sims and team made welcome immediately. He was glad to answer all my questions and explain procedures so that I could understand him. I have several visits more before I am through, but I am very impressed with him and the clinic as a whole. I anticipate having a fabulous outcome and a beautiful smile.", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "108284410228420261403", "name": "Frank Thacker", "time": 1525650909812, "rating": 5.0, "text": "I have used many dentist in my 64yrs. Dr. Sims has pleased me more than any other. The implants are AWESOME and the procedure was relatively pain free... The fact that He thought of my procedure and personally called me at home just to check meant a lot to me... I believe He takes every patients procedure personally and truly cares for their well being.... Thank You Dr. Sims for making my life better....", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "107602374876078586893", "name": "Barry Harrison", "time": 1536939257484, "rating": 5.0, "text": "Dr. Sims and his staff are amazing! From the first time I called , they were nothing but nice. I worked with them for almost a year from a bone graft to dental implants. After my surgeries Dr. Sims called me himself to check on me. Ginny was usually his dental assistant and was always so nice and caring !  The dental implants have changed my life ! I highly recommend DR. Sims to anyone !", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "100781370548418918859", "name": "Douglas Duet", "time": 1595629663830, "rating": 5.0, "text": "Amazing. Courteous, professional and super friendly", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
{"user_id": "109083510744780461943", "name": "Lindy McCullers Carmichael", "time": 1595380039299, "rating": 5.0, "text": "The whole team is fabulous!", "pics": null, "resp": null, "gmap_id": "0x888922fb25b767cf:0x3fa34aa70bac4e3f"}
